[
    [
        {
            "content": "I put off finishing Zoku Natsume Yuujinchou, the sequel to Natsume Yuujinchou, only because I didn't want it to end. I had really enjoyed the first season, and this one was even better.\r\nLike it's prequel Zoku Natsume Yuujinchou has a very gentle feel to it. It's heavy focus on loneliness and longing, is evened out with cheerfulness of love and friendship that Natsume experiences not only with the youkai he encounters but with his foster parents, school friends, and other humans.\r\nYou can see Natsume growing stronger bonds with characters introduced in the first season. It's enjoyable to see the almost sibling love between Natsume andMadara, along with a growing friendship with Natori.\\n\\n\r\nMore characters are introduced and the human characters have a stronger role as well. Natsume is growing into someone very different from the first season, and it is very noticeable that it is because of what he experiences with his fellow cast and the problems that he helps the youkai solve along the way. \\n\\n\r\nMadara of course is the main source of humor, be it his comments and bad habits, or bantering with Natsume, he sometimes steals the show. It is also interesting to see how this season changes his relationship with Natsume, definitely not disappointing.\\n\\n\r\nAnd the most pleasing is the better look into the past and character of Reiko; Natsume's grandmother. However, there is still a lot of mystery surrounding her, leading to fans hoping for the series continuation, if only to have the biggest questions about Reiko answered.\\n\\n\r\nThe show could only go so far with it's fascinating characters and heart catching stories. The art and music really help to pull everything together. With the light colors and almost paint brush feel of the scenery, along with the gentle soundtrack playing in the background, it just helps cement the feeling that the creators tried to create and pull off.\\n\\n\r\nSadly, one of the last episodes got a little sloppy,'little' being the key word as it is barely noticeable. Other than that the animation is smooth and pleasing to the eyes. \\n\\n\r\nThe opening and ending really complement the over all feel and message of the show. I especially liked the ending 'Aishiteru' by Kourin, her voice gave the lyrics a lonely but hopeful feel, it is very nostalgic.\\n\\n\r\nSome might say that this show is boring because of how mellow it can be. This is not true, and the reason is that most of the series is focused more on 'themes' as the main plot, with one story episodes; rarely does a story or conflict go on for more then one episode. \\n\\n\r\nThe ending of the season is especially pleasing. While it clearly shows some bridges have been crossed as far as story development, it was left open for either the viewer's interpretation or a third season. \\n\\n\r\nOver all, this series really makes one think about the workings of the heart, friendship, and trust. I recommend that everyone give this series a try, there is so much that it offers, and it would be sad to miss out on it.\\n\\n\r\n---PS. This is my first review on MAL. Let me know what you thought.",
            "date": "2010-03-01T07:24:00+00:00",
            "helpful_count": 237,
            "mal_id": 23628,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271383.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/breathesunshine",
                "username": "breathesunshine"
            },
            "url": "https://myanimelist.net/reviews.php?id=23628"
        },
        {
            "content": "~~Show completed as of March 30, 2009.\r\nStory - 8.8/10 (B+)\r\nAt first glance, i thought the whole \"defeating spirits\" element was overused, but the way Natsume Yuujinchou does it is much different. Natsume's grandmother, Reiko collected the names of spirits she defeated in battles until the day she died, and Natsume wants to return all the names, even though he could risk his life in the process. It really flows well, especially how Natsume punches the spirits like it's no big deal, kinda funny there. Then we have Madara, or as we know him as Nyanko-sensei, the spirit who seeks the Book of Friends only tobe told by Natsume that he will get it when Natsume dies. I'm surprised that Nyanko-sensei hasn't came up with a plan to kill Natsume, but then again, the pacing of this show is different. When i watched the first episode, i felt like it was Winter, and i was warm from a fireplace (weird, i know), but this show really makes you feel calm, collected and just mellow. Perhaps all the mecha animes and the shounen animes took a toll on me, and Natsume Yuujinchou is the cure to my pain.\\n\\n\r\nAnimation - 10/10 (A+!)\\n\r\nThe art is spectacular! I can't believe it's so well animated, just blew me away. From the opening sequence, to the ending sequence, and all in between, i really am fond of this show even more. It's so simple that it's perfect, in every way.\\n\\n\r\nSound -10/10 (A+)\\n\r\ni love the OP, and the ED is the most soft, teary, and beautiful song i've ever heard. The voice acting is really tremendous, with Kamiya Hiroshi as Natsume Takashi (Who also voices Tieria Erde in Gundam 00 btw). The voice actors all do a really marvelous job, it makes you feel like you're a part of this as well.\\n\\n\r\nCharacters - 10/10 (A+)\\n\r\nMany people think of people like Natsume as the \"gay-ish\", femine person. Well, it's better than hearing macho, tough, know-it-all's (Naruto, Ichigo, Black Star) say the same s**t all the time. Natsume is the kind of anime guy i really like, not too femine and not too masculine. Then we have Nyanko-sensei, the lovable kitten who's real form is somewhat dragon-like. Reminds me of Yoruichi's cat form from Bleach, only more enjoyable. Nyanko-sensei always has to say something smart, or pick at Natsume for being weak or too much of a pushover. I can just have these two characters and no other characters appear, and i'd still love this show.\\n\\n\r\nEnjoyment - 10/10 (A+)\\n\r\nSomething so excellent as Natsume Yuujinchou is easily overlooked by redundant shounen anime, or money-wasting ecchi. Everyone needs to watch this show, whether you're feeling down, feeling stressed  or just plain you. This show will not disappoint. Some might view this as too boring, but those people are the ones who survive off of (redundant) animes such as Naruto and Bleach and Soul Eater. As a former Bleach fan, this show really got me off the shounen animes, and i'm thankful. Give this show a try, because you'll be glad you did.\\n\r\n-----------------------------------------\\n\\n\r\nThe Good: Animation, Characters, OP/ED, Basically Everything\\n\\n\r\nThe Bad: Use of spirits (not so much a big deal) as a plot element.\\n\r\nSometimes it can get too boring.",
            "date": "2009-01-15T23:02:00+00:00",
            "helpful_count": 70,
            "mal_id": 11544,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=11544"
        },
        {
            "content": "Ahahaha~ I rated everything a ten. No. I'm not some mindless idiot who thought this series was the best thing since sliced bread. I'm a fellow reviewer who KNOWS this series is the best thing since sliced bread. Anyway, on with the review!\r\nStory: 10/10\r\nIf you loved Natsume Yuujinchou's storyline, then you'll love Zoku Natsume Yuujinchou just the same. I honestly have a thing for 'characters who are shunned by others because of their special abilities' when it comes to anime. And I loved how they developed the story throughout the series. Makes it more enjoyable to watch.\r\nArt: 10/10\r\nThe art . . . The art's amazing.It fitted every single moment perfectly. Plus, what I loved about this anime? No awkward animation. At all. Even with creepy Youkai.\\n\\n\r\nSound: 10/10\\n\r\nThe same goes with the sound. They chose the best music for each situation: A battle against the Youkai, times when it's peaceful, the episode breaks . . . Well, you get the point. ;P I especially loved the theme song, which, again, sets the mood for the series\\n\\n\r\nCharacter: 10/10\\n\r\nThere was not one character whom I detested/hated/was disgusted with at all. And even if I was, I got over it quickly. I'm not saying you have to like all the characters, though. What I'm trying to get at is that this anime's characters didn't undergo any moment where they weren't acting like themselves. Each and every character kept with their personalities straight through and didn't alter it because of what somebody said, like many anime characters tend to do.\\n\\n\r\nEnjoyment: 10/10\\n\r\nGeez. If I didn't have so many anime on my planned to watch list, I would re-watch this over and over and over again. I enjoyed each and every episode thoroughly. I never laughed so hard at an anime like this either. \\n\\n\r\nOverall: 10/10\\n\r\nZoku Natsume Yuujinchou. Simply the best of its kind. I'd recommend it to anyone who likes anime with the ghostly aspect with splashes of humor thrown into it.",
            "date": "2009-07-15T19:17:00+00:00",
            "helpful_count": 62,
            "mal_id": 16820,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99346.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChibiCrow",
                "username": "ChibiCrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=16820"
        },
        {
            "content": "\"Continuing the path that must be done\"\r\nAs the first series continues, Natsume Takashi learned that many youkai have different powers with different purposes.\r\nThe Story...\r\nIt’s a continuation of the first series as they made a slightly different way of development because it shows more involvement of youkai and his capability to use his own power. It focuses of using the same method of youkai solving as new tale to tell and to discover as it goes deeper in its arc. The drama and mystery here became more interesting and entertaining than before as they add some twist to cope up viewers on watching.\r\nDefinitely a different wayof continuing the preceding series as it really goes very well.\\n\\n\r\nArt & Animation...\\n\\n\r\nBeautiful backgrounds, detailed character designs, and impressive scenery just like the preceding. Noticing the difference from before, it’s jibing better and more appropriate in its settings.\\n\\n\r\nThe OP and ED theme is just truly wonderful… better than before.\\n\\n\r\nSound...\\n\\n\r\nThe OP and ED song is lively, dramatic, calm. Both of them matched its theme that contains such wonderful and harmonious art and BG sounds adds up the enjoyment through the show.\\n\\n\r\nCharacter…\\n\\n\r\nHmmm… Natsume Takashi, he's kind of weak in physical appearance, a compassionate type among youkai, not that free spirited among human beings but reverse among youkai, and improves a lot in this series. As for Madara the other main or the best supporting character on the series that keeps the level of boredom on the bottom became sillier, and more knowledgeable in puns.\\n\\n\r\nAnd for the other characters who sometimes make an appearance in this series, they help the series to be complete and entertaining.\\n\\n\r\nEnjoyment…\\n\\n\r\nIt's quite redundant in its case; it might be an anime that will keep you interested in their arcs, art & animation, sounds, but not quite in the characters. It has a plain and calm feature.\\n\\n\r\nOverall…\\n\\n\r\nRecommended for those who wants a slice of life with different style of maintaining its peaceful feature. A style where people tend to communicate in other species for resolving what must be done to solve its problem.\\n\\n\r\nIt is a mixture of drama, supernatural, and slice of life that will give you depth in life.",
            "date": "2009-12-22T18:55:00+00:00",
            "helpful_count": 54,
            "mal_id": 21628,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=21628"
        },
        {
            "content": "NOTE: Since the content in all three seasons is similar enough that they don't warrant separate reviews, they will all be covered here. The fourth will be edited in when it finishes, unless it differs heavily from the first three by the end of its run.\r\nNatsume Yuujinchou covers a familiar kind of story. We are presented with a teenage boy, who is unusually airy and doesn't socialize much, and frequently seems to be looking intently at things that aren't there. As you may have guessed, Natsume sees dead people. Well, not exactly... he can see Youkai, a kind of spirit told of in Japanese folklore.\r\nManyof the Youkai themselves seem to possess an unusual interest in Natsume. One day, as a pair of Youkai are chasing him, he accidentally breaks a seal containing a powerful Youkai... one that knows why Natsume is being chased. You see, his grandmother Reiko had the same gift as him, and used to go around beating up Youkai and making them give away their names to her (which allowed her to command them), which she collected in a book, the titular Yuujinchou (Book of Friends). And now that Reiko is dead, Natsume has to attempt to return the names, but without losing the book in the process. And his new Youkai friend Madara has agreed to help protect him, as long as he is entitled to the book upon Natsume's natural passing.\\n\\n\r\nWhat is really impressive about Natsume Yuujinchou is that, from that plot summary there, you will mostly likely think of many other series from various different mediums that follow a similar blueprint. And yet Natsume is significantly better than them. Natsume, as a series, takes on this theme with a brilliant level of poignancy. Rather than being a generic shonen action series as it so easily could have been (many of the bare bones of the series show parallels to Bleach, for example), Natsume is more concerned with telling the stories of each of these Youkai. While there is the occasional flash of action, this is never really the point. It's extremely refreshing to see a premise so frequently used for nothing more than cheap kicks done so beautifully. It even strikes something of a contrast with excellent series such as Mushishi and Mononoke, in that while these are focused on the abnormality of the creatures the series is based around, Yuujinchou is far more down to earth and human-feeling.\\n\\n\r\nPlotwise, this series is episodic, with the episodes focusing on individual youkai, with the stories not generally intertwining or crossing more than one episode (though there are exceptions). Almost all of the episodes are excellent, though there's two or three I didn't really care for. The second season in particular ups the quality of these, with the last four standing out as being firmly the best out of both seasons. There's not really anything in the way of an overarching plot or any clear goal, but it's all tied together through the furthering of Natsume's character and the additional insights into Reiko which we see through the Youkai's memories, both of which are excellent features of the series.\\n\\n\r\nThe characterisation in this series is truly unique. Every character is very down-to-earth and believable, and yet not quite your everyday average Joe either. They all have distinctive personalities, and yet feel totally natural. The character designs are much the same way: simple-looking, but effective and distinctive. The only characters who are consistently in every episode are Natsume himself, and his Youkai bodyguard Madara A.K.A Nyanko-sensei. Madara is mostly comic relief, but effectively so. In his true form he's much easier to take seriously, which is often used to good effect. Natsume, on the other hand, is definitely the pinnacle of the aforementioned style. He doesn't really have a clear, character-defining moment or trait, which initially makes him seem like an uninteresting character. However, the more you get to know him, the better a character he seems. He is slowly but surely characterised through musings and realizations gathered through his experiences with all the Youkai he meets, painting a subtle yet excellent portrait of his character. In the third season, this reaches it's peak, as he slowly comes to not only accept, but value his unique circumstances and all the friends he's made because of it.\\n\\n\r\nIn terms of production, the animation is superb. Oddly, though, it's quite restrained about it. Aside from some really beautiful, picturesque background art, it doesn't attempt to beat you over the head with its visuals, letting them stay in the background but subtly lending a lot to the series. In the second season especially, though, it dishes out quite a few animation bumps in some of the series more excellent moments, when it really needs to be rendered better. With this, combined with an excellent character art style, Natsume Yuujinchou just plain looks beautiful all-round. Musically, the OST does much the same as the art: it is distinct, amazing, perfectly fitting, but not overbearing. The music is invariably perfectly matched to the tone of the scene rather than being used to create the tone. The voice acting is all-round excellent, but my only problem with it is, strangely enough, Natsume himself. Hiroshi Kamiya was, in my opinion, a poor choice of casting. He does, however, put in an excellent performance which is hardly surprising given how good of an actor he is, but his voice seems terribly unfit to the role, and far more suited to more average and highly strung protagonists like those he usually plays, as opposed to the awkward, airy Natsume. Still, it's hardly distracting.\\n\\n\r\nIf I have any real complaint about Natsume Yuujinchou, it's that almost every episode's plot is built from a random contrivance. Generally, Natsume encounters something vital to the plot of the episode by sheer coincidence that is not directly tied to the plot at all. It's not terribly distracting, but it's done repeatedly and always seems far too convenient.\\n\\n\r\nNonetheless, Natsume Yuujinchou is an excellent series. It's a calming, relaxing show that simply does its job well. The second and third seasons are better than the first, with the second having better standalone episodes, along with better art and directing than the other two, and the third contributing more to the overall story and Natsume's development. Which season is the best is really a question of style vs. substance.\\n\\n\r\nFinal Words: Something I would solidly recommend to anyone looking for a calming, soothing anime.\\n\\n\r\nStory/Plot: 8/10\\n\r\nCharacters: 8/10\\n\r\nAnimation/Art: 10/10\\n\r\nMusic: 10/10\\n\r\nActing: 8/10\\n\\n\r\nSeason One Overall: 8/10\\n\r\nSeason Two Overall: 9/10\\n\r\nSeason Three Overall: 9/10\\n\\n\r\nFor Fans Of: Mushi-shi, XxXHoLic",
            "date": "2011-07-20T16:05:00+00:00",
            "helpful_count": 19,
            "mal_id": 39603,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=39603"
        },
        {
            "content": "What makes an anime great?  Is it purely a mix of great story, well made animation and soundtrack and engaging characters?  Or does an anime need something extra to be regarded as truly great?  Some kind of x-factor that makes you feel like you’re watching something special?  I believe that a great anime needs both; that the x-factor that separates those shows you give 9 or 10 out of 10 from the others is created by having the great story, animation and so on.  I used to believe that this mix could only be obtained through complexity, with unexpected twistsin the story and flashy animation styles.  Natsume Yuujinchou, and more so its sequel, Zoku Natsume Yuujinchou, proved that I was very wrong.\\n\\n\r\nSomething special about the series struck me as soon as I started watching it.  It was based on a very simple concept.  We follow the protagonist Natsume, who has been able to see spirits since birth, as he tries to return the names of the spirits obtained by his grandmother, Reiko, to their rightful owners.  Whereas this is the premise of the story, the true plot revolves around Natsume’s encounters with various spirits, and how they affect both him and the people around him.\\n\\n\r\nIn contrast to the first season, we see Natsume slowly beginning to find his place in the world and become more accepting of both himself and his gift.  He is less reserved and has more people around him to support him, but this only increases his concern that his gift will bring his friends and loved ones misfortune.  Most of the episodes are self-contained, with a couple of two episode arcs.  Objectively speaking each episode follows a simple formula and at times risks becoming a bit repetitive.  But don’t let this assessment fool you; never once did I feel bored or uninterested.  Despite the simple nature of the story there is undoubtedly a certain charm about it that draws you in.  It is incredibly calming to watch, which is in contrast with many anime series around nowadays.  It is essentially stripped of anything even resembling flashy or overt, leaving you with a bare but thoroughly interesting tale that you can sit back and enjoy as it plays out before your eyes.  Its brilliance lies in its simplicity.\\n\\n\r\nThe animation also continues the simple theme.  Minimal lines and subtle shading are used in the character designs.  The colours are also soft and subtle, using a paintbrush-like style.  Where the art really shines is in the landscapes which are striking and brilliantly drawn.  Whereas the action and fast moving scenes are not as well animated as many other anime, it is almost unnoticeable.  Wide panning shots of the sky or an open field emphasise the laid-back, almost meditative style of the show.\\n\\n\r\nThe soundtrack is quite superb, filled with calming melodies and interesting uses of effects.  In particular there are a couple of BGM tracks that really capture that mellow feel.  The opening and ending songs were also very fitting.  The seiyuu do a very good job of capturing their respective characters, though only Kazuhiko Inoue (Madara a.k.a. Nyanko-sensei) and Hiroshi Kamiya (Natsume) get a chance to show their voice-acting prowess.  Kamiya particularly portrays Natsume’s inner loneliness and conflict masterfully.\\n\\n\r\nThe characters in Zoku Natsume Yuujinchou are quite limited.  The spirits come and go, although some of them turn out to be very well constructed characters.  There is also a cast of minor human characters, but they do not feature very heavily at all.  Of course, there is also Madara who continually provides comic relief and the occasional giant spirit-fight.  Despite this, each interaction these spirits and humans have with Natsume has a profound impact on him.  The show itself revolves almost solely around Natsume, whose character grows before our eyes through these interactions.  Through this we get a real insight into his way of thinking, and also into his own loneliness.  Again the recurring theme of simplicity becomes evident again; never have I gained so much enjoyment out of watching a single character’s development, but I would have liked to see the other human characters feature more prominently.\\n\\n\r\nZoku Natsume Yuujinchou is a refreshing break from the norm; a show that doesn’t try to do anything too fancy, but still makes you feel like you’re watching something truly special.  Watching this anime is a calming and pensive process, and is thoroughly enjoyable.  It’s almost comical how such a simple concept can capture that rare x-factor while other, much more complex anime fail.  Perhaps simplicity really is the ultimate sophistication.  Overall: 9.2/10 (rounded to 9).",
            "date": "2010-10-23T02:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 31537,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/300038.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ryuu_zer0",
                "username": "ryuu_zer0"
            },
            "url": "https://myanimelist.net/reviews.php?id=31537"
        },
        {
            "content": "This series is a sequel to \"Natsume Yuujinchou\" which tells the story of a high school boy with the ability to see yokai. The plot revolves around his growing involvement with both the yokai and the people around him.\r\nZoku Natsume Yuujinchou's story continues the themes of the first series. Maintaining the seasonal style progression of the series we see the characters in autumn and winter and it continues to show us the slice of life style glimpses into Natsume's interactions with both humans and yokai. \r\nThe episodes maintain a nice balance between the humour and the more serious, melancholy side of Natsume's life.\r\nThis series isn'thugely plot driven and if you want a more in-depth storyline you will need to read the manga but I found the anime really enjoyable in and of itself.\\n\\n\r\nThe artwork is just as beautiful as in the first series, that alone made it worth my while to watch it. It is also well voiced, with a soundtrack that catches the mood of the series accurately.\\n\\n\r\nWhile there are some instances of tension and action in this series I would recommend it more for those who enjoy the fantastic aspects of the series or the 'slice of life' style stories.",
            "date": "2009-01-11T10:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 11355,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133734.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tyrantk",
                "username": "tyrantk"
            },
            "url": "https://myanimelist.net/reviews.php?id=11355"
        },
        {
            "content": "Checklist:\r\nHigh school boy with supernatural abilities – Check.\r\nShunned by society due to his powers – Check.\r\nDead Parents – Check.\r\nAncestor with the same power – Check.\r\nFunny sidekick – Check.\r\nSigh…a typical show, huh? … But, wait! I have one more item on my checklist –\r\nTotally awesome anime that manages to break out of its generic setting and blossoms into something absolutely fascinating and surpasses its predecessor in almost every way – Check.\r\nZoku Natsume Yuujinchou is the second season of the show Natsume Yuujinchou. There are no major storyline changes and these 13 episodes are a direct continuation of the first season. Although detailed knowledge of the firstseason isn’t required, it definitely gives you a better understanding and connection with the characters.\\n\\n\r\nFor those who want to give the first season a skip (although I wouldn’t), here is a quick synopsis: You follow Natsume, a high school student and his encounters with youkai. Youkai are basically demons (or ghosts) that are invisible to most humans. Once a youkai gives its name to a human, then it pledges its soul to the human and they can never truly pass on unless they have their names back. Natsume’s grandmother, Reiko, had collected the names of various youkai and recorded them in a book called the “Yuujinchou” or “The Book of Friends”. After her death, this book falls into Natsume’s hands and a never ending stream of spirits come after him. Along with Madara, the demon cat, he sets about dissolving these youkai contracts, while trying not to get killed by them.\\n\\n\r\nWhile the basic story is pretty straightforward, the actual episodes are not. Each episode contains a lot of elements, each mixed in the right proportion – action, mystery, drama, comedy, supernatural and slice of life. The stories/arcs feel complete and don’t have the half-baked feel that they had last time around. There is an overall consistency. Unlike last season, where you had youkai coming and just getting their names back or trying to steal the Yuujinchou, in Zoku you get youkai that have bizarre requests. And this adds a whole new dimension to the show. The anime now revolves less around the youkai’s names and shifts its focus to the back-stories of these youkai. Each youkai tells a tale that is intriguing and thoughtful. This also makes the anime’s objective clear – to focus on the relationships of humans and not actually the youkai. \\n\\n\r\nAlthough it retains its episodic format, the anime manages to bring in an overall arching plot. Yes, that means you can’t watch it in any random order and this makes the show far more engaging than the earlier disjoint episodes. You feel that the anime is actually going somewhere and not just dawdling around with half-dead creatures. \\n\\n\r\nBut let’s look at Zoku Natsume Yuujinchou as a stand-alone and not as a sequel to Natsume Yuujinchou: Zoku is an entertaining show, to say the least. Not only does it provide you with certain intense situations, but it also puts you in the shoes of Natsume so gently, that you can hardly feel yourself drifting into the world of the characters. And you want to stay there and never leave. This charming handling is proof enough that the show does not lack in the plot. It takes true skill to transport the viewer into a fictional world where the characters aren’t exactly happy. I mean, think about it – Would you go into the world of Harry Potter, knowing that Harry was not yet born and it was still the Dark Ages with Voldemort running around and massacring people? \\n\\n\r\nIn case you’re still wondering why I think this anime managed to stand out compared to its counterparts, it’s because of the overlying genre of Slice of Life. How often do you see an anime which has demons, spirit cats, ancestral prodigies and a legendary book, but focuses not only on these, but also on the emotions of the protagonist AND the youkai? Not often. \\n\\n\r\nThe animation has improved slightly, but not much to say here - pretty standard stuff for a 2009 anime. Everything looks like it should and the characters designs are pretty detailed. Backgrounds are as gorgeous as ever. Overall, the animation is perfect for this kind of series.\\n\\n\r\nOn a side note, (this might sound kinda weird), but if you liked the display picture of Zoku Natusume Yuujinchou on MAL, then chances are, you’ll like the anime. The cover art was the reason why I picked this anime up in the first place.\\n\\n\r\nAlthough there are no major soundtrack additions, there is a new OP and an ED. The OP is solid and is an upbeat song, with a pretty catchy tune. The ED was the definition of charming and it’s one of the best ballads ever. The vocals were very sweet and the piano playing in the background was played in a gentle and melodious manner. The lyrics of the ED were superb. It’s not often that you see an anime song whose lyrics you remember, but “Aishiteru”’s lyrics is one I will remember for a long time to come (“Hey, just a little longer. Can you listen to me just a little longer? Hey, just a little longer. Can I be selfish just a little longer?”). The BGM is apt. \\n\\n\r\nThe characters are what truly made this anime loveable. In NY, Natsume’s plight as a social outcast never really triggered any sort of emotional reaction from me. But, in Zoku, Natsume’s loneliness is highlighted in a much more subtle manner and somehow, this managed to capture my attention. I was finally able to sympathize with him and was genuinely moved by his condition. He finally realizes that he doesn’t need to do this alone and that there are people out there looking out for him. After watching the entire show, I realized how much I liked him. In fact, if you were to meet me in real life, he’s the character I would resemble the most. He is a character that I will hold close to my heart. \\n\\n\r\nMadara is back and this time he steps up his game. His jokes are hilarious and sometimes I found myself literally ROFLing at his silly jokes. His snide remarks are loaded with sarcasm and rival Kyon’s. You can also see him developing, in a fatherly-tsundere way. You have two other characters, whose names I cannot mention, who play an important role in Natsume’s life and you get to see them in about 3 or 4 episodes, which is a lot considering that the first season contained only Tanuma, who appeared for a grand total of twelve minutes in the whole series. Both these characters actually represent the yin and yang of Natsume’s outlook on youkai. \\n\\n\r\nThe show also addresses the question that constantly haunts Natsume – Is he or is he not grateful for having the ability to see youkai? To know the answer to that, you just have to watch the show. But I’ll tell you this – Natsume is a more complex character than you think.\\n\\n\r\nOverall, Zoku Natsume Yuujinchou is the kind of show I would pick up in a couple of years and still feel the same way about it. It’s fast, fun and fresh.  And most importantly, it is one of the very few anime out there that is able to distinguish the fine line between Slice of Life and Drama. That being said, this anime does not have universal appeal. If you’ve watched Kino’s Journey, Mushishi, xxxHOLiC or Haibane Renmei, you can’t go wrong with this one. But then again, the fact that not a single reviewer has given this anime a score below 9 even a year after its completion is testament to the fact that this anime truly is, one of a kind. \\n\\n\r\n [ THE WRAP-UP ]\\n\r\nZoku Natsume Yuujinchou succeeds where several anime of its genre fail – providing thought-provoking entertainment. Its emphasis on how life is a journey and how, more than often, you find yourself all alone in it and how it is at that moment, do we find the people that truly matter and who will provide us with the moments that we will cherish for the rest of our lives. Set in an episodic format, each episode/arc is loaded with content that packs a punch so hard, in such a gentle manner, that you are bound to be knocked out by its charm. The animation is smooth and the soundtrack is apt. The ED deserves special credit for its sweet vocals and charming lyrics. ZNY is testament to proof that Slice of Life is a genre that CAN be used successfully alongside action and also illustrates why Drama and Slice of Life are actually two very different genres. If you loved the first four episodes, then you’re going to have a wonderful nine episodes ahead, but if not, then this anime is just not for you. With a great atmosphere and balanced elements, this anime is one that you should sit up and take notice of. Zoku Natsume Yuujinchou is the butterfly coming out of the cocoon of its predecessor – beautiful, elegant and something that you will remember for the rest of your life.",
            "date": "2010-12-31T04:25:00+00:00",
            "helpful_count": 13,
            "mal_id": 33249,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383088.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/trzr23",
                "username": "trzr23"
            },
            "url": "https://myanimelist.net/reviews.php?id=33249"
        },
        {
            "content": "theme of Ayakashi in anime is inexhaustible\r\ni enjoyed horrible histories of \"Hundred stories\"\r\nwas delighted with avantages of mysterious salesman in 'Mononoke\"\r\nbut in those and many others anime such beings as Ayakashi always were represented as sly and evil children of darkness\r\nand what are we seeing in \"Natsume'? even Ayakashi have a sensitive soul, which icewall is broken by the kindness of the boy and Madara's devotion nature. Sure, continuing of Natsume's advantages is the most successful expecting of the season",
            "date": "2009-04-03T04:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 13802,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/17767.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wind_of_change_",
                "username": "wind_of_change_"
            },
            "url": "https://myanimelist.net/reviews.php?id=13802"
        },
        {
            "content": "In the first moments of the series, what I automatically enjoyed was the altruistic view of the main character, Natsume Takashi. I had not the feeling of an overwhelming strong, stubborned or desperate human, just a cheerful guy who wants to help any person in danger.\r\nEach episode contains a different story, it brings different aspects of the moral and the relation between humans and youkais. Mostly, Takashi is brought to help and find a solution to coexist with this species, even if he already gets a Youkai living by his side.\r\nLater on, the story continues and you follow the path of this young boy withhis fellow companion, Nyanko-sensei. The relationship between those two characters made me laugh a lot. It just brings you a moment of truce in your heart and you would like to see those two arguing again for anything else, to have more fun.\\n\\n\r\nI particularly liked the effervescent colors, along with the gentle soundtrack playing in the background, it just helps cement the feeling that the creators tried to make a memorable background.\\n\\n\r\nThe second season of Zoku Natsume made me believe that any kind of creature could live around us, humans, and make us dream that an entire different world is living next to us. \\n\\n\r\nI would surely advise this series to any person, regardless of his age. It brings you harmonious moments and a nice show to enjoy.",
            "date": "2015-08-07T08:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 195421,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4599265.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CloudsPrince",
                "username": "CloudsPrince"
            },
            "url": "https://myanimelist.net/reviews.php?id=195421"
        },
        {
            "content": "Zoku Natsume is an example of a sequel done right. Like the first season, this show has all of the aesthetically pleasing things you cherished. The tone is still light-hearted, and often peaceful and mellow. Many times throughout this season you will feel a sort of familiar peace, and even melancholy. Finishing the season will without a doubt, leave you lonely, which is certainly ironic, considering the entire season, and show for that matter, has the idea of loneliness, and even to an extent, romanticizes it. \r\nThe soft nature of the show goes together nicely with the soundtrack, which is just as good as thefirst, and for me, even better. The melody and transition sounds alone make my heart flutter, and it will be sure to raise some vague emotion within you. The musical pieces are truly wonderful, and though I shy away from the music type of Long Shot Party, it is symbolically meaningful and pairs nicely with the anime, as you will find with the ending as well. \\n\\n\r\nThe acting is suburb, especially that of Madara(Natsume's guardian cat/sensei), and of that of Natsume himself. Both lead the show in a wonderful voice cast, the two's banter and conversations unique and entertaining. \\n\\n\r\nThe only difference you will find with the two seasons is that the first was episodic, while this one verges on two-episode plot arcs, though only a couple. While the shows episodic arc plot remains largely intact, it is something that differs from the anime Mushishi, as it still involves the same characters, same setting(mostly) and a certain growth in Natsume we don't often see in episodic anime. \\n\\n\r\nThis season is a bit more upbeat, whereas the last one was more depressing, and certainly more lonely. This one shows a more positive natsume, a clear indication of his growth. Though he is surrounded by human friends and yokai friends, the theme of loneliness is still present, so much so that it wouldn't be amiss if the writers explored something new. Though to do so, might not work, and if something isn't broke..etc\\n\\n\r\nThere are few memorable episodes, but each one is enjoyable and rarely boring, and it will pick up momentum as the series goes on. \\n\\n\r\nThe character development, which is that mainly of Natsume is greatly woven throughout, and that of Reiko's background is scattered throughout, though there is more than enough questions left unanswered more than anything. While the side-characters remain good natured and lovable, there exists no real momentous change or development among them. They did however introduce a new female character, Taki, who is rather charming, and often makes good use of her screen time through humour with madara(who she finds cute) and her conversations, often deep ones, with Natsume. \\n\\n\r\nAs for Art, and animation, you may take what you will. The art work blends softness with clarity, and often gives way to something colorful, and for that, it is truly wonderful, and memorable. The art itself is nothing to brag about though, and while the animation is fluid it will not stand out to you, if you were to compare it to an anime known for its animation; this, will apply to the art as well. However, regardless, you will find no problems with what this show does with either, and you may even feel bias towards it, as I have. \\n\\n\r\nThe series, as it proved in the first season, never made Natsume out to be some strong character with the power to defeat all yokai. Though he gets a bit stronger, this can only be seen in his resolve, and though I am not generally a fan of main characters who have no real gifts, it seems to only work wonders for Natsume, who like the show, is compassionate, emotional, full of heart, and upbeat. \\n\\n",
            "date": "2015-09-21T16:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 199167,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=199167"
        },
        {
            "content": "Allow me to create a sub-genre of anime in which this particular one fits right in. I'd like to put this anime into the Zoo genre of anime. The Zoo genre is an anime which has some special monster or some unique creature within the show. Each episode introduces and focuses on one particular type of that creature. Shows like Mushishi, Fruits Basket, and Panty and Stocking all qualify for this genre of anime. In Natsume Yuujinchou's case, the monster is the Youkai, the demon-like beings which only Natsume, the main hero, can see. \r\nThese animes tend to lack any core plot dictating the entireshow, and usually consists of episodic exhibits of the monsters. Each episode is good depending on how interesting the featured monster is. Natsume Yuujinchou has a lot of monsters, and usually they're very interesting. This part of the anime is superb, and exactly the kind of thing I wanted to see after having watched Mushishi, which is probably my favorite anime ever. \\n\r\nNatsume Yuujinchou has a recurring pattern in its episodes. The episodes fall under two different types: either A) the monster is really nice and has some problem and Natsume helps out or B) the monster is really evil and the main character gets in a pinch, usually life threatening. Yuujinchou works best when it's telling an A-type story. This story really fits with the tone of the show, and really brings out the best episodes. It's during A-type episodes where Yuujinchou shows off its great animation through fantastic visuals such as gorgeous scenery or wondrous images such as a colorful dream.\\n\r\nThe B-type episodes are also good, but certain reoccurring situations really start to get dry after a while. In every single episode of this type, there's a scene in which Natsume is being chased by the monster, he trips and falls down, and then he gets rescued by somebody. It really starts to get boring watching these episodes when pretty much the same scene happens every single time. These episodes were kind of out of place as well, since most of the time the anime tends to be very peaceful and slow, while these episodes were usually very tense and exciting. \\n\r\nThis anime is very pretty, and it sounds great as well. Both of the opening songs are really good at setting the tone for the episode to come. The ending songs are both very relaxing, and give good closure for each story. I really like the voice of Madara, the cat sidekick. Natsume's voice is perfect for the show and really helps express the relaxing tone.\\n\\n\r\nThe anime is really quite good, so why did I only give it an 8 instead of a 10? Well, I had a problem with Natsume, the main character, several times. Natsume is a nice guy who had a bad childhood. He spends his time helping others and generally puts the well being of others over himself. He keeps his own troubles to himself because he doesn't want to burden the people he cares about. He is quite timid and doesn't speak much. \\n\r\nUsually I like this type of character. He's very similar to Honda Tohru from Fruits Basket, Furude Rika from Higurashi, or Nunnaly from Code Geass. The problem is that this anime has those B-type episodes I mentioned earlier and they require that Natsume grow stronger both mentally and physically.\\n\r\nWhat I mean by this is that Natsume doesn't seem to learn anything from his B-type experiences. He'll get tricked by a monster in one episode, and then in the next episode he'll get tricked by another. He gets caught up in so many dangerous situations where he almost dies and he never reflects upon what mistakes he made to get into those situations. He is actually too selfless, to the point where he doesn't even care whether he dies or not. In a particular episode, a Youkai object is absorbing Natsume's life force and gradually making him sicker. Instead of taking any action at all to save his own life, he allows the object to continue to absorb him, all because the object is important to the monster of that episode. the episode reaches a point where it seems that Natsume might actually die. Now come on, doesn't this guy fear death, like every average human being does? Why is he so willing to throw it away for NOTHING AT ALL? These B-type episodes really start to get boring because of this. Why should I care about whether Natsume gets hurt or not if he himself doesn't care?\\n\\n\r\nI thought I would enjoy this anime just as much as I did Mushishi, but I didn't. After all the danger that went through these two seasons, Natsume should really be dead already, but he isn't. It really isn't fun watching him get rescued so many times when he puts zero effort in to keep himself safe. Every time he gets attacked I half hope that he loses an eye or something so that he'll finally reflect upon his poor actions and finally start defending himself. It really is a shame that the whole entire show isn't the A-type episodes, as Natsume isn't cut out for the B-type ones. Don't get me wrong though, this is a really good show, and I'm sure I'll enjoy seasons three and four, which I'll be watching very soon. However, I'll be really disappointed if those seasons continue to have more danger episodes with a main character that never learns from his mistakes.",
            "date": "2012-06-25T11:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 64419,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468995.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/makoa69",
                "username": "makoa69"
            },
            "url": "https://myanimelist.net/reviews.php?id=64419"
        },
        {
            "content": "I find this season so hard to review because it's literally the exact same as the first season. At least where it counts.\r\nAlright, so just like last time, the absolute best part of this anime is the little stories it tells. It's very good at creating complex characters and histories for them within a single episode. It's a very nice, comfortable anime to watch, especially if you're watching the anime hoping for a great story.\r\nThe art, while simple, is charming, and the sound compliments the tone of the anime very well. As far as the characters go, I'm glad that this season started to focusin more on Natsume and how lonely he used to feel as a child as well as his relationship strengthening with Nyanko-sensei. Those two things have starting to pave the way to seeing more about Natsume's grandmother and also her relationship to Nyanko-sensei. \\n\\n\r\nI'm pretty sure the narrative is just taking it slow, but I really wanted to see some serious development this season that would turn Natsume into a more dynamic character rather than little changes here and there. There were a few moments this season that turned into continuous stories that lasted longer than an episode, and that was really nice because you got to dig into the story and Natsume's involvement with it. I hope, in the future, we get a more solidified storyline that lasts for a season because I really want to know more about Natsume.\\n\\n\r\nAll in all, though, this anime is very good. There's a reason it's beloved by so many, I think you just need to be patient with it. It seems worth it.",
            "date": "2019-02-20T20:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 302106,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=302106"
        },
        {
            "content": "I love this anime and Ive been watching it like 4 days ago and Its pretty good to me. I love it when Natsume called Madara \"Cat-Pig\" hehehe.. everytime when Natsume and Madara argues if Madara is a cat or a pig so he calls him \"Cat-Pig\". I LOVEE IT!",
            "date": "2009-04-26T16:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 14527,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/175563.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rawrandom",
                "username": "rawrandom"
            },
            "url": "https://myanimelist.net/reviews.php?id=14527"
        },
        {
            "content": "Im going to try to keep this as simple as possible for all you out there wondering what it's all about! \r\nThis is the 2nd season of the Natsume Yuujinchou series. It is following what happend in the 1st season Natsume Yuujinchou. \r\nArt: 9/10 \r\nThe arts in this series is really beautiful! It is not the same type of arts as for example the Bakemonogatari series had, but it has its charm.. and god, the char is fantastic! \r\nCharacters 10/10\r\nSimply loving all of the characters of this series! I especially love Nyanko-sensei, but now.. who wouldn't? All of the characters who are there just forthe episode is also wonderful, and many of them come back just as sweet in the coming episodes.\\n\\n\r\nEnjoyment 10/10\\n\r\nOh god, the laughs! It's quite simple to fall inlove with the show and its simple mindedness, but rhat is not all! It is really enjoyable to watch the connection between Nyanko-sensei and Natsume, but i will have to say that the adaption of Natsume towards his feelings to others has to top it all of. Simply wonderful, can't think of a more feelgood show to watch. \\n\\n\r\nOverall or tl;dr 9/10 \\n\r\nGreat show so far, the only bits i can complain about is propablya little bit in the sound and story.. but that is also quite great. If you havent seen this series and is now wondering if it's worth it, just do it! I årpmise you a good time, this season was even better then the first one\\n\\n",
            "date": "2013-05-21T18:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 97989,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Haxus",
                "username": "Haxus"
            },
            "url": "https://myanimelist.net/reviews.php?id=97989"
        },
        {
            "content": "This is not an objective review. \r\nBut if someone is still wondering if they should watch the anime here are the reasons.\r\nWhat can I say? The story, the animation, the soundtracks are all very unimpressive.\r\nBut just like the prequel nowhere in this world do I find peace for my soul so much and so guaranteed as when i watch Natsume Yuujinchou.  \r\nAnd I am writing this from a laptop on my travels through New Zealand.\r\nThe characters are lovely and the pace is just right - the stories are just there to transmit certain kinds of emotions and feelings which is just perfect. It's ahidden gem behind all those sparkly masterpieces like death parade, kill la kill, bakemonogatari.\\n\\n",
            "date": "2017-04-08T21:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 245066,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4146587.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YuukoDreams",
                "username": "YuukoDreams"
            },
            "url": "https://myanimelist.net/reviews.php?id=245066"
        },
        {
            "content": "It’s already bad that the first season was very short, so when it ended I was genuinely sad yet irritated. Why can’t they make this amazing series longer! So I am so much grateful that it continues.\r\nEvery new story is much more dramatic, inspiring, interesting, exciting and of course, touching. There is more twist to every new story so it is more exciting and anticipating. Some would be funny, some is scary, and most of it is very touching but definitely all of it is very interesting.\r\nMadara is still denying that he cares for Natsume so much that his actually thinking that it will behard to part ways because human life span is very short compared to his kind which I think is extremely cute. He is as cute and hilarious as ever. Even though he keep on saying his a high level creature, his acting more and more like a cat which is so hilarious and cute. Natsume is treasuring and accepting his abilities even more that he already feels sad with his very short encounters with different supernatural beings. He is still bothered with his past and though his becoming better as a person already after encountering Nyanko-sensei, he still can’t open-up with his very kind family and some close friends about his abilities. But he is actually worried now with the idea of not seeing the supernatural beings. Every encounter with the YOUKAI makes Natsume a better individual. After understanding and supporting each other for quite a while, Natsume and Nyanko-sensei are even closer. It is so great that even though his friends know that he is kind of weird, they still stay with him and accept him. \\n\\n\r\nThe animation is not very different from the previous one but you can still see that it is a little bit better. The sounds are getting better and better, especially the ending theme which I absolutely think so beautiful.\\n\\n\r\nAh! I can’t believe that ended so fast. This is one of the very few series that I am so puzzled why they are making it so short. Come on! At least make 100 episodes per season. I am dying to see more new story. I am just hoping that there would be a sequel. PLEASE!\\n",
            "date": "2012-12-09T08:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 79678,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79678"
        }
    ],
    [
        {
            "content": "I put off finishing Zoku Natsume Yuujinchou, the sequel to Natsume Yuujinchou, only because I didn't want it to end. I had really enjoyed the first season, and this one was even better.\r\nLike it's prequel Zoku Natsume Yuujinchou has a very gentle feel to it. It's heavy focus on loneliness and longing, is evened out with cheerfulness of love and friendship that Natsume experiences not only with the youkai he encounters but with his foster parents, school friends, and other humans.\r\nYou can see Natsume growing stronger bonds with characters introduced in the first season. It's enjoyable to see the almost sibling love between Natsume andMadara, along with a growing friendship with Natori.\\n\\n\r\nMore characters are introduced and the human characters have a stronger role as well. Natsume is growing into someone very different from the first season, and it is very noticeable that it is because of what he experiences with his fellow cast and the problems that he helps the youkai solve along the way. \\n\\n\r\nMadara of course is the main source of humor, be it his comments and bad habits, or bantering with Natsume, he sometimes steals the show. It is also interesting to see how this season changes his relationship with Natsume, definitely not disappointing.\\n\\n\r\nAnd the most pleasing is the better look into the past and character of Reiko; Natsume's grandmother. However, there is still a lot of mystery surrounding her, leading to fans hoping for the series continuation, if only to have the biggest questions about Reiko answered.\\n\\n\r\nThe show could only go so far with it's fascinating characters and heart catching stories. The art and music really help to pull everything together. With the light colors and almost paint brush feel of the scenery, along with the gentle soundtrack playing in the background, it just helps cement the feeling that the creators tried to create and pull off.\\n\\n\r\nSadly, one of the last episodes got a little sloppy,'little' being the key word as it is barely noticeable. Other than that the animation is smooth and pleasing to the eyes. \\n\\n\r\nThe opening and ending really complement the over all feel and message of the show. I especially liked the ending 'Aishiteru' by Kourin, her voice gave the lyrics a lonely but hopeful feel, it is very nostalgic.\\n\\n\r\nSome might say that this show is boring because of how mellow it can be. This is not true, and the reason is that most of the series is focused more on 'themes' as the main plot, with one story episodes; rarely does a story or conflict go on for more then one episode. \\n\\n\r\nThe ending of the season is especially pleasing. While it clearly shows some bridges have been crossed as far as story development, it was left open for either the viewer's interpretation or a third season. \\n\\n\r\nOver all, this series really makes one think about the workings of the heart, friendship, and trust. I recommend that everyone give this series a try, there is so much that it offers, and it would be sad to miss out on it.\\n\\n\r\n---PS. This is my first review on MAL. Let me know what you thought.",
            "date": "2010-03-01T07:24:00+00:00",
            "helpful_count": 237,
            "mal_id": 23628,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271383.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/breathesunshine",
                "username": "breathesunshine"
            },
            "url": "https://myanimelist.net/reviews.php?id=23628"
        },
        {
            "content": "~~Show completed as of March 30, 2009.\r\nStory - 8.8/10 (B+)\r\nAt first glance, i thought the whole \"defeating spirits\" element was overused, but the way Natsume Yuujinchou does it is much different. Natsume's grandmother, Reiko collected the names of spirits she defeated in battles until the day she died, and Natsume wants to return all the names, even though he could risk his life in the process. It really flows well, especially how Natsume punches the spirits like it's no big deal, kinda funny there. Then we have Madara, or as we know him as Nyanko-sensei, the spirit who seeks the Book of Friends only tobe told by Natsume that he will get it when Natsume dies. I'm surprised that Nyanko-sensei hasn't came up with a plan to kill Natsume, but then again, the pacing of this show is different. When i watched the first episode, i felt like it was Winter, and i was warm from a fireplace (weird, i know), but this show really makes you feel calm, collected and just mellow. Perhaps all the mecha animes and the shounen animes took a toll on me, and Natsume Yuujinchou is the cure to my pain.\\n\\n\r\nAnimation - 10/10 (A+!)\\n\r\nThe art is spectacular! I can't believe it's so well animated, just blew me away. From the opening sequence, to the ending sequence, and all in between, i really am fond of this show even more. It's so simple that it's perfect, in every way.\\n\\n\r\nSound -10/10 (A+)\\n\r\ni love the OP, and the ED is the most soft, teary, and beautiful song i've ever heard. The voice acting is really tremendous, with Kamiya Hiroshi as Natsume Takashi (Who also voices Tieria Erde in Gundam 00 btw). The voice actors all do a really marvelous job, it makes you feel like you're a part of this as well.\\n\\n\r\nCharacters - 10/10 (A+)\\n\r\nMany people think of people like Natsume as the \"gay-ish\", femine person. Well, it's better than hearing macho, tough, know-it-all's (Naruto, Ichigo, Black Star) say the same s**t all the time. Natsume is the kind of anime guy i really like, not too femine and not too masculine. Then we have Nyanko-sensei, the lovable kitten who's real form is somewhat dragon-like. Reminds me of Yoruichi's cat form from Bleach, only more enjoyable. Nyanko-sensei always has to say something smart, or pick at Natsume for being weak or too much of a pushover. I can just have these two characters and no other characters appear, and i'd still love this show.\\n\\n\r\nEnjoyment - 10/10 (A+)\\n\r\nSomething so excellent as Natsume Yuujinchou is easily overlooked by redundant shounen anime, or money-wasting ecchi. Everyone needs to watch this show, whether you're feeling down, feeling stressed  or just plain you. This show will not disappoint. Some might view this as too boring, but those people are the ones who survive off of (redundant) animes such as Naruto and Bleach and Soul Eater. As a former Bleach fan, this show really got me off the shounen animes, and i'm thankful. Give this show a try, because you'll be glad you did.\\n\r\n-----------------------------------------\\n\\n\r\nThe Good: Animation, Characters, OP/ED, Basically Everything\\n\\n\r\nThe Bad: Use of spirits (not so much a big deal) as a plot element.\\n\r\nSometimes it can get too boring.",
            "date": "2009-01-15T23:02:00+00:00",
            "helpful_count": 70,
            "mal_id": 11544,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56526.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/webkid94",
                "username": "webkid94"
            },
            "url": "https://myanimelist.net/reviews.php?id=11544"
        },
        {
            "content": "Ahahaha~ I rated everything a ten. No. I'm not some mindless idiot who thought this series was the best thing since sliced bread. I'm a fellow reviewer who KNOWS this series is the best thing since sliced bread. Anyway, on with the review!\r\nStory: 10/10\r\nIf you loved Natsume Yuujinchou's storyline, then you'll love Zoku Natsume Yuujinchou just the same. I honestly have a thing for 'characters who are shunned by others because of their special abilities' when it comes to anime. And I loved how they developed the story throughout the series. Makes it more enjoyable to watch.\r\nArt: 10/10\r\nThe art . . . The art's amazing.It fitted every single moment perfectly. Plus, what I loved about this anime? No awkward animation. At all. Even with creepy Youkai.\\n\\n\r\nSound: 10/10\\n\r\nThe same goes with the sound. They chose the best music for each situation: A battle against the Youkai, times when it's peaceful, the episode breaks . . . Well, you get the point. ;P I especially loved the theme song, which, again, sets the mood for the series\\n\\n\r\nCharacter: 10/10\\n\r\nThere was not one character whom I detested/hated/was disgusted with at all. And even if I was, I got over it quickly. I'm not saying you have to like all the characters, though. What I'm trying to get at is that this anime's characters didn't undergo any moment where they weren't acting like themselves. Each and every character kept with their personalities straight through and didn't alter it because of what somebody said, like many anime characters tend to do.\\n\\n\r\nEnjoyment: 10/10\\n\r\nGeez. If I didn't have so many anime on my planned to watch list, I would re-watch this over and over and over again. I enjoyed each and every episode thoroughly. I never laughed so hard at an anime like this either. \\n\\n\r\nOverall: 10/10\\n\r\nZoku Natsume Yuujinchou. Simply the best of its kind. I'd recommend it to anyone who likes anime with the ghostly aspect with splashes of humor thrown into it.",
            "date": "2009-07-15T19:17:00+00:00",
            "helpful_count": 62,
            "mal_id": 16820,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99346.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ChibiCrow",
                "username": "ChibiCrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=16820"
        },
        {
            "content": "\"Continuing the path that must be done\"\r\nAs the first series continues, Natsume Takashi learned that many youkai have different powers with different purposes.\r\nThe Story...\r\nIt’s a continuation of the first series as they made a slightly different way of development because it shows more involvement of youkai and his capability to use his own power. It focuses of using the same method of youkai solving as new tale to tell and to discover as it goes deeper in its arc. The drama and mystery here became more interesting and entertaining than before as they add some twist to cope up viewers on watching.\r\nDefinitely a different wayof continuing the preceding series as it really goes very well.\\n\\n\r\nArt & Animation...\\n\\n\r\nBeautiful backgrounds, detailed character designs, and impressive scenery just like the preceding. Noticing the difference from before, it’s jibing better and more appropriate in its settings.\\n\\n\r\nThe OP and ED theme is just truly wonderful… better than before.\\n\\n\r\nSound...\\n\\n\r\nThe OP and ED song is lively, dramatic, calm. Both of them matched its theme that contains such wonderful and harmonious art and BG sounds adds up the enjoyment through the show.\\n\\n\r\nCharacter…\\n\\n\r\nHmmm… Natsume Takashi, he's kind of weak in physical appearance, a compassionate type among youkai, not that free spirited among human beings but reverse among youkai, and improves a lot in this series. As for Madara the other main or the best supporting character on the series that keeps the level of boredom on the bottom became sillier, and more knowledgeable in puns.\\n\\n\r\nAnd for the other characters who sometimes make an appearance in this series, they help the series to be complete and entertaining.\\n\\n\r\nEnjoyment…\\n\\n\r\nIt's quite redundant in its case; it might be an anime that will keep you interested in their arcs, art & animation, sounds, but not quite in the characters. It has a plain and calm feature.\\n\\n\r\nOverall…\\n\\n\r\nRecommended for those who wants a slice of life with different style of maintaining its peaceful feature. A style where people tend to communicate in other species for resolving what must be done to solve its problem.\\n\\n\r\nIt is a mixture of drama, supernatural, and slice of life that will give you depth in life.",
            "date": "2009-12-22T18:55:00+00:00",
            "helpful_count": 54,
            "mal_id": 21628,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=21628"
        },
        {
            "content": "NOTE: Since the content in all three seasons is similar enough that they don't warrant separate reviews, they will all be covered here. The fourth will be edited in when it finishes, unless it differs heavily from the first three by the end of its run.\r\nNatsume Yuujinchou covers a familiar kind of story. We are presented with a teenage boy, who is unusually airy and doesn't socialize much, and frequently seems to be looking intently at things that aren't there. As you may have guessed, Natsume sees dead people. Well, not exactly... he can see Youkai, a kind of spirit told of in Japanese folklore.\r\nManyof the Youkai themselves seem to possess an unusual interest in Natsume. One day, as a pair of Youkai are chasing him, he accidentally breaks a seal containing a powerful Youkai... one that knows why Natsume is being chased. You see, his grandmother Reiko had the same gift as him, and used to go around beating up Youkai and making them give away their names to her (which allowed her to command them), which she collected in a book, the titular Yuujinchou (Book of Friends). And now that Reiko is dead, Natsume has to attempt to return the names, but without losing the book in the process. And his new Youkai friend Madara has agreed to help protect him, as long as he is entitled to the book upon Natsume's natural passing.\\n\\n\r\nWhat is really impressive about Natsume Yuujinchou is that, from that plot summary there, you will mostly likely think of many other series from various different mediums that follow a similar blueprint. And yet Natsume is significantly better than them. Natsume, as a series, takes on this theme with a brilliant level of poignancy. Rather than being a generic shonen action series as it so easily could have been (many of the bare bones of the series show parallels to Bleach, for example), Natsume is more concerned with telling the stories of each of these Youkai. While there is the occasional flash of action, this is never really the point. It's extremely refreshing to see a premise so frequently used for nothing more than cheap kicks done so beautifully. It even strikes something of a contrast with excellent series such as Mushishi and Mononoke, in that while these are focused on the abnormality of the creatures the series is based around, Yuujinchou is far more down to earth and human-feeling.\\n\\n\r\nPlotwise, this series is episodic, with the episodes focusing on individual youkai, with the stories not generally intertwining or crossing more than one episode (though there are exceptions). Almost all of the episodes are excellent, though there's two or three I didn't really care for. The second season in particular ups the quality of these, with the last four standing out as being firmly the best out of both seasons. There's not really anything in the way of an overarching plot or any clear goal, but it's all tied together through the furthering of Natsume's character and the additional insights into Reiko which we see through the Youkai's memories, both of which are excellent features of the series.\\n\\n\r\nThe characterisation in this series is truly unique. Every character is very down-to-earth and believable, and yet not quite your everyday average Joe either. They all have distinctive personalities, and yet feel totally natural. The character designs are much the same way: simple-looking, but effective and distinctive. The only characters who are consistently in every episode are Natsume himself, and his Youkai bodyguard Madara A.K.A Nyanko-sensei. Madara is mostly comic relief, but effectively so. In his true form he's much easier to take seriously, which is often used to good effect. Natsume, on the other hand, is definitely the pinnacle of the aforementioned style. He doesn't really have a clear, character-defining moment or trait, which initially makes him seem like an uninteresting character. However, the more you get to know him, the better a character he seems. He is slowly but surely characterised through musings and realizations gathered through his experiences with all the Youkai he meets, painting a subtle yet excellent portrait of his character. In the third season, this reaches it's peak, as he slowly comes to not only accept, but value his unique circumstances and all the friends he's made because of it.\\n\\n\r\nIn terms of production, the animation is superb. Oddly, though, it's quite restrained about it. Aside from some really beautiful, picturesque background art, it doesn't attempt to beat you over the head with its visuals, letting them stay in the background but subtly lending a lot to the series. In the second season especially, though, it dishes out quite a few animation bumps in some of the series more excellent moments, when it really needs to be rendered better. With this, combined with an excellent character art style, Natsume Yuujinchou just plain looks beautiful all-round. Musically, the OST does much the same as the art: it is distinct, amazing, perfectly fitting, but not overbearing. The music is invariably perfectly matched to the tone of the scene rather than being used to create the tone. The voice acting is all-round excellent, but my only problem with it is, strangely enough, Natsume himself. Hiroshi Kamiya was, in my opinion, a poor choice of casting. He does, however, put in an excellent performance which is hardly surprising given how good of an actor he is, but his voice seems terribly unfit to the role, and far more suited to more average and highly strung protagonists like those he usually plays, as opposed to the awkward, airy Natsume. Still, it's hardly distracting.\\n\\n\r\nIf I have any real complaint about Natsume Yuujinchou, it's that almost every episode's plot is built from a random contrivance. Generally, Natsume encounters something vital to the plot of the episode by sheer coincidence that is not directly tied to the plot at all. It's not terribly distracting, but it's done repeatedly and always seems far too convenient.\\n\\n\r\nNonetheless, Natsume Yuujinchou is an excellent series. It's a calming, relaxing show that simply does its job well. The second and third seasons are better than the first, with the second having better standalone episodes, along with better art and directing than the other two, and the third contributing more to the overall story and Natsume's development. Which season is the best is really a question of style vs. substance.\\n\\n\r\nFinal Words: Something I would solidly recommend to anyone looking for a calming, soothing anime.\\n\\n\r\nStory/Plot: 8/10\\n\r\nCharacters: 8/10\\n\r\nAnimation/Art: 10/10\\n\r\nMusic: 10/10\\n\r\nActing: 8/10\\n\\n\r\nSeason One Overall: 8/10\\n\r\nSeason Two Overall: 9/10\\n\r\nSeason Three Overall: 9/10\\n\\n\r\nFor Fans Of: Mushi-shi, XxXHoLic",
            "date": "2011-07-20T16:05:00+00:00",
            "helpful_count": 19,
            "mal_id": 39603,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/232951.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lindle",
                "username": "Lindle"
            },
            "url": "https://myanimelist.net/reviews.php?id=39603"
        },
        {
            "content": "What makes an anime great?  Is it purely a mix of great story, well made animation and soundtrack and engaging characters?  Or does an anime need something extra to be regarded as truly great?  Some kind of x-factor that makes you feel like you’re watching something special?  I believe that a great anime needs both; that the x-factor that separates those shows you give 9 or 10 out of 10 from the others is created by having the great story, animation and so on.  I used to believe that this mix could only be obtained through complexity, with unexpected twistsin the story and flashy animation styles.  Natsume Yuujinchou, and more so its sequel, Zoku Natsume Yuujinchou, proved that I was very wrong.\\n\\n\r\nSomething special about the series struck me as soon as I started watching it.  It was based on a very simple concept.  We follow the protagonist Natsume, who has been able to see spirits since birth, as he tries to return the names of the spirits obtained by his grandmother, Reiko, to their rightful owners.  Whereas this is the premise of the story, the true plot revolves around Natsume’s encounters with various spirits, and how they affect both him and the people around him.\\n\\n\r\nIn contrast to the first season, we see Natsume slowly beginning to find his place in the world and become more accepting of both himself and his gift.  He is less reserved and has more people around him to support him, but this only increases his concern that his gift will bring his friends and loved ones misfortune.  Most of the episodes are self-contained, with a couple of two episode arcs.  Objectively speaking each episode follows a simple formula and at times risks becoming a bit repetitive.  But don’t let this assessment fool you; never once did I feel bored or uninterested.  Despite the simple nature of the story there is undoubtedly a certain charm about it that draws you in.  It is incredibly calming to watch, which is in contrast with many anime series around nowadays.  It is essentially stripped of anything even resembling flashy or overt, leaving you with a bare but thoroughly interesting tale that you can sit back and enjoy as it plays out before your eyes.  Its brilliance lies in its simplicity.\\n\\n\r\nThe animation also continues the simple theme.  Minimal lines and subtle shading are used in the character designs.  The colours are also soft and subtle, using a paintbrush-like style.  Where the art really shines is in the landscapes which are striking and brilliantly drawn.  Whereas the action and fast moving scenes are not as well animated as many other anime, it is almost unnoticeable.  Wide panning shots of the sky or an open field emphasise the laid-back, almost meditative style of the show.\\n\\n\r\nThe soundtrack is quite superb, filled with calming melodies and interesting uses of effects.  In particular there are a couple of BGM tracks that really capture that mellow feel.  The opening and ending songs were also very fitting.  The seiyuu do a very good job of capturing their respective characters, though only Kazuhiko Inoue (Madara a.k.a. Nyanko-sensei) and Hiroshi Kamiya (Natsume) get a chance to show their voice-acting prowess.  Kamiya particularly portrays Natsume’s inner loneliness and conflict masterfully.\\n\\n\r\nThe characters in Zoku Natsume Yuujinchou are quite limited.  The spirits come and go, although some of them turn out to be very well constructed characters.  There is also a cast of minor human characters, but they do not feature very heavily at all.  Of course, there is also Madara who continually provides comic relief and the occasional giant spirit-fight.  Despite this, each interaction these spirits and humans have with Natsume has a profound impact on him.  The show itself revolves almost solely around Natsume, whose character grows before our eyes through these interactions.  Through this we get a real insight into his way of thinking, and also into his own loneliness.  Again the recurring theme of simplicity becomes evident again; never have I gained so much enjoyment out of watching a single character’s development, but I would have liked to see the other human characters feature more prominently.\\n\\n\r\nZoku Natsume Yuujinchou is a refreshing break from the norm; a show that doesn’t try to do anything too fancy, but still makes you feel like you’re watching something truly special.  Watching this anime is a calming and pensive process, and is thoroughly enjoyable.  It’s almost comical how such a simple concept can capture that rare x-factor while other, much more complex anime fail.  Perhaps simplicity really is the ultimate sophistication.  Overall: 9.2/10 (rounded to 9).",
            "date": "2010-10-23T02:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 31537,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/300038.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ryuu_zer0",
                "username": "ryuu_zer0"
            },
            "url": "https://myanimelist.net/reviews.php?id=31537"
        },
        {
            "content": "This series is a sequel to \"Natsume Yuujinchou\" which tells the story of a high school boy with the ability to see yokai. The plot revolves around his growing involvement with both the yokai and the people around him.\r\nZoku Natsume Yuujinchou's story continues the themes of the first series. Maintaining the seasonal style progression of the series we see the characters in autumn and winter and it continues to show us the slice of life style glimpses into Natsume's interactions with both humans and yokai. \r\nThe episodes maintain a nice balance between the humour and the more serious, melancholy side of Natsume's life.\r\nThis series isn'thugely plot driven and if you want a more in-depth storyline you will need to read the manga but I found the anime really enjoyable in and of itself.\\n\\n\r\nThe artwork is just as beautiful as in the first series, that alone made it worth my while to watch it. It is also well voiced, with a soundtrack that catches the mood of the series accurately.\\n\\n\r\nWhile there are some instances of tension and action in this series I would recommend it more for those who enjoy the fantastic aspects of the series or the 'slice of life' style stories.",
            "date": "2009-01-11T10:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 11355,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133734.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tyrantk",
                "username": "tyrantk"
            },
            "url": "https://myanimelist.net/reviews.php?id=11355"
        },
        {
            "content": "Checklist:\r\nHigh school boy with supernatural abilities – Check.\r\nShunned by society due to his powers – Check.\r\nDead Parents – Check.\r\nAncestor with the same power – Check.\r\nFunny sidekick – Check.\r\nSigh…a typical show, huh? … But, wait! I have one more item on my checklist –\r\nTotally awesome anime that manages to break out of its generic setting and blossoms into something absolutely fascinating and surpasses its predecessor in almost every way – Check.\r\nZoku Natsume Yuujinchou is the second season of the show Natsume Yuujinchou. There are no major storyline changes and these 13 episodes are a direct continuation of the first season. Although detailed knowledge of the firstseason isn’t required, it definitely gives you a better understanding and connection with the characters.\\n\\n\r\nFor those who want to give the first season a skip (although I wouldn’t), here is a quick synopsis: You follow Natsume, a high school student and his encounters with youkai. Youkai are basically demons (or ghosts) that are invisible to most humans. Once a youkai gives its name to a human, then it pledges its soul to the human and they can never truly pass on unless they have their names back. Natsume’s grandmother, Reiko, had collected the names of various youkai and recorded them in a book called the “Yuujinchou” or “The Book of Friends”. After her death, this book falls into Natsume’s hands and a never ending stream of spirits come after him. Along with Madara, the demon cat, he sets about dissolving these youkai contracts, while trying not to get killed by them.\\n\\n\r\nWhile the basic story is pretty straightforward, the actual episodes are not. Each episode contains a lot of elements, each mixed in the right proportion – action, mystery, drama, comedy, supernatural and slice of life. The stories/arcs feel complete and don’t have the half-baked feel that they had last time around. There is an overall consistency. Unlike last season, where you had youkai coming and just getting their names back or trying to steal the Yuujinchou, in Zoku you get youkai that have bizarre requests. And this adds a whole new dimension to the show. The anime now revolves less around the youkai’s names and shifts its focus to the back-stories of these youkai. Each youkai tells a tale that is intriguing and thoughtful. This also makes the anime’s objective clear – to focus on the relationships of humans and not actually the youkai. \\n\\n\r\nAlthough it retains its episodic format, the anime manages to bring in an overall arching plot. Yes, that means you can’t watch it in any random order and this makes the show far more engaging than the earlier disjoint episodes. You feel that the anime is actually going somewhere and not just dawdling around with half-dead creatures. \\n\\n\r\nBut let’s look at Zoku Natsume Yuujinchou as a stand-alone and not as a sequel to Natsume Yuujinchou: Zoku is an entertaining show, to say the least. Not only does it provide you with certain intense situations, but it also puts you in the shoes of Natsume so gently, that you can hardly feel yourself drifting into the world of the characters. And you want to stay there and never leave. This charming handling is proof enough that the show does not lack in the plot. It takes true skill to transport the viewer into a fictional world where the characters aren’t exactly happy. I mean, think about it – Would you go into the world of Harry Potter, knowing that Harry was not yet born and it was still the Dark Ages with Voldemort running around and massacring people? \\n\\n\r\nIn case you’re still wondering why I think this anime managed to stand out compared to its counterparts, it’s because of the overlying genre of Slice of Life. How often do you see an anime which has demons, spirit cats, ancestral prodigies and a legendary book, but focuses not only on these, but also on the emotions of the protagonist AND the youkai? Not often. \\n\\n\r\nThe animation has improved slightly, but not much to say here - pretty standard stuff for a 2009 anime. Everything looks like it should and the characters designs are pretty detailed. Backgrounds are as gorgeous as ever. Overall, the animation is perfect for this kind of series.\\n\\n\r\nOn a side note, (this might sound kinda weird), but if you liked the display picture of Zoku Natusume Yuujinchou on MAL, then chances are, you’ll like the anime. The cover art was the reason why I picked this anime up in the first place.\\n\\n\r\nAlthough there are no major soundtrack additions, there is a new OP and an ED. The OP is solid and is an upbeat song, with a pretty catchy tune. The ED was the definition of charming and it’s one of the best ballads ever. The vocals were very sweet and the piano playing in the background was played in a gentle and melodious manner. The lyrics of the ED were superb. It’s not often that you see an anime song whose lyrics you remember, but “Aishiteru”’s lyrics is one I will remember for a long time to come (“Hey, just a little longer. Can you listen to me just a little longer? Hey, just a little longer. Can I be selfish just a little longer?”). The BGM is apt. \\n\\n\r\nThe characters are what truly made this anime loveable. In NY, Natsume’s plight as a social outcast never really triggered any sort of emotional reaction from me. But, in Zoku, Natsume’s loneliness is highlighted in a much more subtle manner and somehow, this managed to capture my attention. I was finally able to sympathize with him and was genuinely moved by his condition. He finally realizes that he doesn’t need to do this alone and that there are people out there looking out for him. After watching the entire show, I realized how much I liked him. In fact, if you were to meet me in real life, he’s the character I would resemble the most. He is a character that I will hold close to my heart. \\n\\n\r\nMadara is back and this time he steps up his game. His jokes are hilarious and sometimes I found myself literally ROFLing at his silly jokes. His snide remarks are loaded with sarcasm and rival Kyon’s. You can also see him developing, in a fatherly-tsundere way. You have two other characters, whose names I cannot mention, who play an important role in Natsume’s life and you get to see them in about 3 or 4 episodes, which is a lot considering that the first season contained only Tanuma, who appeared for a grand total of twelve minutes in the whole series. Both these characters actually represent the yin and yang of Natsume’s outlook on youkai. \\n\\n\r\nThe show also addresses the question that constantly haunts Natsume – Is he or is he not grateful for having the ability to see youkai? To know the answer to that, you just have to watch the show. But I’ll tell you this – Natsume is a more complex character than you think.\\n\\n\r\nOverall, Zoku Natsume Yuujinchou is the kind of show I would pick up in a couple of years and still feel the same way about it. It’s fast, fun and fresh.  And most importantly, it is one of the very few anime out there that is able to distinguish the fine line between Slice of Life and Drama. That being said, this anime does not have universal appeal. If you’ve watched Kino’s Journey, Mushishi, xxxHOLiC or Haibane Renmei, you can’t go wrong with this one. But then again, the fact that not a single reviewer has given this anime a score below 9 even a year after its completion is testament to the fact that this anime truly is, one of a kind. \\n\\n\r\n [ THE WRAP-UP ]\\n\r\nZoku Natsume Yuujinchou succeeds where several anime of its genre fail – providing thought-provoking entertainment. Its emphasis on how life is a journey and how, more than often, you find yourself all alone in it and how it is at that moment, do we find the people that truly matter and who will provide us with the moments that we will cherish for the rest of our lives. Set in an episodic format, each episode/arc is loaded with content that packs a punch so hard, in such a gentle manner, that you are bound to be knocked out by its charm. The animation is smooth and the soundtrack is apt. The ED deserves special credit for its sweet vocals and charming lyrics. ZNY is testament to proof that Slice of Life is a genre that CAN be used successfully alongside action and also illustrates why Drama and Slice of Life are actually two very different genres. If you loved the first four episodes, then you’re going to have a wonderful nine episodes ahead, but if not, then this anime is just not for you. With a great atmosphere and balanced elements, this anime is one that you should sit up and take notice of. Zoku Natsume Yuujinchou is the butterfly coming out of the cocoon of its predecessor – beautiful, elegant and something that you will remember for the rest of your life.",
            "date": "2010-12-31T04:25:00+00:00",
            "helpful_count": 13,
            "mal_id": 33249,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383088.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/trzr23",
                "username": "trzr23"
            },
            "url": "https://myanimelist.net/reviews.php?id=33249"
        },
        {
            "content": "theme of Ayakashi in anime is inexhaustible\r\ni enjoyed horrible histories of \"Hundred stories\"\r\nwas delighted with avantages of mysterious salesman in 'Mononoke\"\r\nbut in those and many others anime such beings as Ayakashi always were represented as sly and evil children of darkness\r\nand what are we seeing in \"Natsume'? even Ayakashi have a sensitive soul, which icewall is broken by the kindness of the boy and Madara's devotion nature. Sure, continuing of Natsume's advantages is the most successful expecting of the season",
            "date": "2009-04-03T04:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 13802,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/17767.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/wind_of_change_",
                "username": "wind_of_change_"
            },
            "url": "https://myanimelist.net/reviews.php?id=13802"
        },
        {
            "content": "In the first moments of the series, what I automatically enjoyed was the altruistic view of the main character, Natsume Takashi. I had not the feeling of an overwhelming strong, stubborned or desperate human, just a cheerful guy who wants to help any person in danger.\r\nEach episode contains a different story, it brings different aspects of the moral and the relation between humans and youkais. Mostly, Takashi is brought to help and find a solution to coexist with this species, even if he already gets a Youkai living by his side.\r\nLater on, the story continues and you follow the path of this young boy withhis fellow companion, Nyanko-sensei. The relationship between those two characters made me laugh a lot. It just brings you a moment of truce in your heart and you would like to see those two arguing again for anything else, to have more fun.\\n\\n\r\nI particularly liked the effervescent colors, along with the gentle soundtrack playing in the background, it just helps cement the feeling that the creators tried to make a memorable background.\\n\\n\r\nThe second season of Zoku Natsume made me believe that any kind of creature could live around us, humans, and make us dream that an entire different world is living next to us. \\n\\n\r\nI would surely advise this series to any person, regardless of his age. It brings you harmonious moments and a nice show to enjoy.",
            "date": "2015-08-07T08:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 195421,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4599265.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CloudsPrince",
                "username": "CloudsPrince"
            },
            "url": "https://myanimelist.net/reviews.php?id=195421"
        },
        {
            "content": "Zoku Natsume is an example of a sequel done right. Like the first season, this show has all of the aesthetically pleasing things you cherished. The tone is still light-hearted, and often peaceful and mellow. Many times throughout this season you will feel a sort of familiar peace, and even melancholy. Finishing the season will without a doubt, leave you lonely, which is certainly ironic, considering the entire season, and show for that matter, has the idea of loneliness, and even to an extent, romanticizes it. \r\nThe soft nature of the show goes together nicely with the soundtrack, which is just as good as thefirst, and for me, even better. The melody and transition sounds alone make my heart flutter, and it will be sure to raise some vague emotion within you. The musical pieces are truly wonderful, and though I shy away from the music type of Long Shot Party, it is symbolically meaningful and pairs nicely with the anime, as you will find with the ending as well. \\n\\n\r\nThe acting is suburb, especially that of Madara(Natsume's guardian cat/sensei), and of that of Natsume himself. Both lead the show in a wonderful voice cast, the two's banter and conversations unique and entertaining. \\n\\n\r\nThe only difference you will find with the two seasons is that the first was episodic, while this one verges on two-episode plot arcs, though only a couple. While the shows episodic arc plot remains largely intact, it is something that differs from the anime Mushishi, as it still involves the same characters, same setting(mostly) and a certain growth in Natsume we don't often see in episodic anime. \\n\\n\r\nThis season is a bit more upbeat, whereas the last one was more depressing, and certainly more lonely. This one shows a more positive natsume, a clear indication of his growth. Though he is surrounded by human friends and yokai friends, the theme of loneliness is still present, so much so that it wouldn't be amiss if the writers explored something new. Though to do so, might not work, and if something isn't broke..etc\\n\\n\r\nThere are few memorable episodes, but each one is enjoyable and rarely boring, and it will pick up momentum as the series goes on. \\n\\n\r\nThe character development, which is that mainly of Natsume is greatly woven throughout, and that of Reiko's background is scattered throughout, though there is more than enough questions left unanswered more than anything. While the side-characters remain good natured and lovable, there exists no real momentous change or development among them. They did however introduce a new female character, Taki, who is rather charming, and often makes good use of her screen time through humour with madara(who she finds cute) and her conversations, often deep ones, with Natsume. \\n\\n\r\nAs for Art, and animation, you may take what you will. The art work blends softness with clarity, and often gives way to something colorful, and for that, it is truly wonderful, and memorable. The art itself is nothing to brag about though, and while the animation is fluid it will not stand out to you, if you were to compare it to an anime known for its animation; this, will apply to the art as well. However, regardless, you will find no problems with what this show does with either, and you may even feel bias towards it, as I have. \\n\\n\r\nThe series, as it proved in the first season, never made Natsume out to be some strong character with the power to defeat all yokai. Though he gets a bit stronger, this can only be seen in his resolve, and though I am not generally a fan of main characters who have no real gifts, it seems to only work wonders for Natsume, who like the show, is compassionate, emotional, full of heart, and upbeat. \\n\\n",
            "date": "2015-09-21T16:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 199167,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2515035.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/khunter",
                "username": "khunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=199167"
        },
        {
            "content": "Allow me to create a sub-genre of anime in which this particular one fits right in. I'd like to put this anime into the Zoo genre of anime. The Zoo genre is an anime which has some special monster or some unique creature within the show. Each episode introduces and focuses on one particular type of that creature. Shows like Mushishi, Fruits Basket, and Panty and Stocking all qualify for this genre of anime. In Natsume Yuujinchou's case, the monster is the Youkai, the demon-like beings which only Natsume, the main hero, can see. \r\nThese animes tend to lack any core plot dictating the entireshow, and usually consists of episodic exhibits of the monsters. Each episode is good depending on how interesting the featured monster is. Natsume Yuujinchou has a lot of monsters, and usually they're very interesting. This part of the anime is superb, and exactly the kind of thing I wanted to see after having watched Mushishi, which is probably my favorite anime ever. \\n\r\nNatsume Yuujinchou has a recurring pattern in its episodes. The episodes fall under two different types: either A) the monster is really nice and has some problem and Natsume helps out or B) the monster is really evil and the main character gets in a pinch, usually life threatening. Yuujinchou works best when it's telling an A-type story. This story really fits with the tone of the show, and really brings out the best episodes. It's during A-type episodes where Yuujinchou shows off its great animation through fantastic visuals such as gorgeous scenery or wondrous images such as a colorful dream.\\n\r\nThe B-type episodes are also good, but certain reoccurring situations really start to get dry after a while. In every single episode of this type, there's a scene in which Natsume is being chased by the monster, he trips and falls down, and then he gets rescued by somebody. It really starts to get boring watching these episodes when pretty much the same scene happens every single time. These episodes were kind of out of place as well, since most of the time the anime tends to be very peaceful and slow, while these episodes were usually very tense and exciting. \\n\r\nThis anime is very pretty, and it sounds great as well. Both of the opening songs are really good at setting the tone for the episode to come. The ending songs are both very relaxing, and give good closure for each story. I really like the voice of Madara, the cat sidekick. Natsume's voice is perfect for the show and really helps express the relaxing tone.\\n\\n\r\nThe anime is really quite good, so why did I only give it an 8 instead of a 10? Well, I had a problem with Natsume, the main character, several times. Natsume is a nice guy who had a bad childhood. He spends his time helping others and generally puts the well being of others over himself. He keeps his own troubles to himself because he doesn't want to burden the people he cares about. He is quite timid and doesn't speak much. \\n\r\nUsually I like this type of character. He's very similar to Honda Tohru from Fruits Basket, Furude Rika from Higurashi, or Nunnaly from Code Geass. The problem is that this anime has those B-type episodes I mentioned earlier and they require that Natsume grow stronger both mentally and physically.\\n\r\nWhat I mean by this is that Natsume doesn't seem to learn anything from his B-type experiences. He'll get tricked by a monster in one episode, and then in the next episode he'll get tricked by another. He gets caught up in so many dangerous situations where he almost dies and he never reflects upon what mistakes he made to get into those situations. He is actually too selfless, to the point where he doesn't even care whether he dies or not. In a particular episode, a Youkai object is absorbing Natsume's life force and gradually making him sicker. Instead of taking any action at all to save his own life, he allows the object to continue to absorb him, all because the object is important to the monster of that episode. the episode reaches a point where it seems that Natsume might actually die. Now come on, doesn't this guy fear death, like every average human being does? Why is he so willing to throw it away for NOTHING AT ALL? These B-type episodes really start to get boring because of this. Why should I care about whether Natsume gets hurt or not if he himself doesn't care?\\n\\n\r\nI thought I would enjoy this anime just as much as I did Mushishi, but I didn't. After all the danger that went through these two seasons, Natsume should really be dead already, but he isn't. It really isn't fun watching him get rescued so many times when he puts zero effort in to keep himself safe. Every time he gets attacked I half hope that he loses an eye or something so that he'll finally reflect upon his poor actions and finally start defending himself. It really is a shame that the whole entire show isn't the A-type episodes, as Natsume isn't cut out for the B-type ones. Don't get me wrong though, this is a really good show, and I'm sure I'll enjoy seasons three and four, which I'll be watching very soon. However, I'll be really disappointed if those seasons continue to have more danger episodes with a main character that never learns from his mistakes.",
            "date": "2012-06-25T11:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 64419,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468995.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/makoa69",
                "username": "makoa69"
            },
            "url": "https://myanimelist.net/reviews.php?id=64419"
        },
        {
            "content": "I find this season so hard to review because it's literally the exact same as the first season. At least where it counts.\r\nAlright, so just like last time, the absolute best part of this anime is the little stories it tells. It's very good at creating complex characters and histories for them within a single episode. It's a very nice, comfortable anime to watch, especially if you're watching the anime hoping for a great story.\r\nThe art, while simple, is charming, and the sound compliments the tone of the anime very well. As far as the characters go, I'm glad that this season started to focusin more on Natsume and how lonely he used to feel as a child as well as his relationship strengthening with Nyanko-sensei. Those two things have starting to pave the way to seeing more about Natsume's grandmother and also her relationship to Nyanko-sensei. \\n\\n\r\nI'm pretty sure the narrative is just taking it slow, but I really wanted to see some serious development this season that would turn Natsume into a more dynamic character rather than little changes here and there. There were a few moments this season that turned into continuous stories that lasted longer than an episode, and that was really nice because you got to dig into the story and Natsume's involvement with it. I hope, in the future, we get a more solidified storyline that lasts for a season because I really want to know more about Natsume.\\n\\n\r\nAll in all, though, this anime is very good. There's a reason it's beloved by so many, I think you just need to be patient with it. It seems worth it.",
            "date": "2019-02-20T20:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 302106,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=302106"
        },
        {
            "content": "I love this anime and Ive been watching it like 4 days ago and Its pretty good to me. I love it when Natsume called Madara \"Cat-Pig\" hehehe.. everytime when Natsume and Madara argues if Madara is a cat or a pig so he calls him \"Cat-Pig\". I LOVEE IT!",
            "date": "2009-04-26T16:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 14527,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/175563.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rawrandom",
                "username": "rawrandom"
            },
            "url": "https://myanimelist.net/reviews.php?id=14527"
        },
        {
            "content": "Im going to try to keep this as simple as possible for all you out there wondering what it's all about! \r\nThis is the 2nd season of the Natsume Yuujinchou series. It is following what happend in the 1st season Natsume Yuujinchou. \r\nArt: 9/10 \r\nThe arts in this series is really beautiful! It is not the same type of arts as for example the Bakemonogatari series had, but it has its charm.. and god, the char is fantastic! \r\nCharacters 10/10\r\nSimply loving all of the characters of this series! I especially love Nyanko-sensei, but now.. who wouldn't? All of the characters who are there just forthe episode is also wonderful, and many of them come back just as sweet in the coming episodes.\\n\\n\r\nEnjoyment 10/10\\n\r\nOh god, the laughs! It's quite simple to fall inlove with the show and its simple mindedness, but rhat is not all! It is really enjoyable to watch the connection between Nyanko-sensei and Natsume, but i will have to say that the adaption of Natsume towards his feelings to others has to top it all of. Simply wonderful, can't think of a more feelgood show to watch. \\n\\n\r\nOverall or tl;dr 9/10 \\n\r\nGreat show so far, the only bits i can complain about is propablya little bit in the sound and story.. but that is also quite great. If you havent seen this series and is now wondering if it's worth it, just do it! I årpmise you a good time, this season was even better then the first one\\n\\n",
            "date": "2013-05-21T18:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 97989,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Haxus",
                "username": "Haxus"
            },
            "url": "https://myanimelist.net/reviews.php?id=97989"
        },
        {
            "content": "This is not an objective review. \r\nBut if someone is still wondering if they should watch the anime here are the reasons.\r\nWhat can I say? The story, the animation, the soundtracks are all very unimpressive.\r\nBut just like the prequel nowhere in this world do I find peace for my soul so much and so guaranteed as when i watch Natsume Yuujinchou.  \r\nAnd I am writing this from a laptop on my travels through New Zealand.\r\nThe characters are lovely and the pace is just right - the stories are just there to transmit certain kinds of emotions and feelings which is just perfect. It's ahidden gem behind all those sparkly masterpieces like death parade, kill la kill, bakemonogatari.\\n\\n",
            "date": "2017-04-08T21:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 245066,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4146587.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/YuukoDreams",
                "username": "YuukoDreams"
            },
            "url": "https://myanimelist.net/reviews.php?id=245066"
        },
        {
            "content": "It’s already bad that the first season was very short, so when it ended I was genuinely sad yet irritated. Why can’t they make this amazing series longer! So I am so much grateful that it continues.\r\nEvery new story is much more dramatic, inspiring, interesting, exciting and of course, touching. There is more twist to every new story so it is more exciting and anticipating. Some would be funny, some is scary, and most of it is very touching but definitely all of it is very interesting.\r\nMadara is still denying that he cares for Natsume so much that his actually thinking that it will behard to part ways because human life span is very short compared to his kind which I think is extremely cute. He is as cute and hilarious as ever. Even though he keep on saying his a high level creature, his acting more and more like a cat which is so hilarious and cute. Natsume is treasuring and accepting his abilities even more that he already feels sad with his very short encounters with different supernatural beings. He is still bothered with his past and though his becoming better as a person already after encountering Nyanko-sensei, he still can’t open-up with his very kind family and some close friends about his abilities. But he is actually worried now with the idea of not seeing the supernatural beings. Every encounter with the YOUKAI makes Natsume a better individual. After understanding and supporting each other for quite a while, Natsume and Nyanko-sensei are even closer. It is so great that even though his friends know that he is kind of weird, they still stay with him and accept him. \\n\\n\r\nThe animation is not very different from the previous one but you can still see that it is a little bit better. The sounds are getting better and better, especially the ending theme which I absolutely think so beautiful.\\n\\n\r\nAh! I can’t believe that ended so fast. This is one of the very few series that I am so puzzled why they are making it so short. Come on! At least make 100 episodes per season. I am dying to see more new story. I am just hoping that there would be a sequel. PLEASE!\\n",
            "date": "2012-12-09T08:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 79678,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1802849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mrsKWON",
                "username": "mrsKWON"
            },
            "url": "https://myanimelist.net/reviews.php?id=79678"
        }
    ]
]