[
    [
        {
            "content": "I have very mixed feelings about Mayoi Neko Overrun. It's quite something to say that a series is both generic yet still one of the more... unique harems to come out in a while. This all stems from the fact that the scriptwriter, director and key artist changed every single episode for the twelve week duration of the series. The result is that studio AIC squanders what little potential the series already had and gives the directors free reign to do one-shot episode experiments. What would have been a mostly cliche but still above average harem turns into possibly \"the\" trainwreck of the year.\r\nStarting offwith the positive: The most interesting part of this series was that despite a formulaic harem setting, the show had a motif; a constantly echoed theme that ties all of the characters and stories together. The theme is stray cats, both literally and figuratively. The show examines what it means to be abandoned and alone, what it means to search for and find a place where you can belong, and what it means to have a family and a home. While not as well-developed as it should have been because of the aforementioned trainwrecking, these ideas are woven into the plot and the backstory of every single character. It all starts when Nozomi, a blue-haired emotionless catgirl with abandonment issues, is taken in by protagonist Takumi's older sister. This unofficial adoption forces the other two members of Takumi's harem to reexamine their own lives. Blond tsundere Fumino grew up with Takumi in an orphanage, a victim of non-stop bullying. Even blonder ojou-sama Chise is surrounded by wealth and yes-men who abide by her every word, but the fame of her parents ensures that they are never around and she is always alone.\\n\\n\r\nDespite archetypal definitions, the characters in this series manage to have a little extra depth to differentiate them from other harems. Otome nee-san is far more mature and understanding than her carefree attitude would lead you to believe. Same goes for Kaho, a childhood friend and conniving corporate rival of Chise's, who in one episode fosters a misunderstanding in order to strengthen the bonds between all of the characters. Two seasons prior, AIC made Sora no Otoshimono a successful harem by playing up the fact that the protagonist was an unabashed pervert, proving an interesting contrast to the indifferent or wimpy male leads of most harems. Well, Overrun does the exact opposite here. Not only does Takumi try to weasel his way out of dealing with the girls, but his indecisiveness is actually justified by just how irritating and passive-aggressive the girls actually are. Nozomi is silent as ever, but the writers don't even attempt to push Chise or Fumino as moe or submissive. They are incredibly overbearing and often cause Takumi a lot more trouble than they're worth. The characters are not quite unlikeable (I was fine with them), but it was still interesting to see a show actually get away with making a guy not want his harem.\\n\\n\r\nSpeaking of Takumi, for a male lead in a harem, he is surprisingly absent. The show is supposedly about his developing relationship with these girls. Yet even from the first episode, he frequently seems like a supporting character in his own series. Late in the show, there is an episode about the family taking care of a lost young girl (which again allows the characters to reflect on their own thoughts of loneliness) and Takumi doesn't appear at all. This is a mixed blessing but moves toward the positive. One, the show starts with Fumino and Chise already having a crush on Takumi, preventing any contrived or shallow origin story for their romantic interest in him. The chronic absence of the male lead also keeps the girls from fawning all over him like other harems (though like I said, their characterization already prevents this). The girls have a lot of scenes to themselves, where they meditate on their own thoughts and solve their own problems. If you are tired of seeing harem girls waiting around for their \"man\" to come and fix everything for them, this series can be refreshing occasionally.\\n\\n\r\nDescribing the series like this, you'd wonder what went wrong. And here is where we come back to the dreaded switching of directors every episode. The show is a mess. Every individual episode is solid enough, but the series itself lacks coherence and is riddled by random, one-off fillers in the midseason that fail to progress the story at all. This is probably the only harem I've seen where one of the girls full-out confesses to the guy early in the series, in three episodes which build up to a nice climax despite starting off a bit shaky. And yet it takes this build-up and does nothing with it, opting instead to just go for random gag episodes. Four in particular stand out: 4 was from the director of Gag Manga Biyori and jumped the shark for many viewers, as it ignored previous plot developments, and \"all\" characterization up to that point. If you've seen a lot of harems, you'll know the main guy always has an otaku sidekick to make him look good by comparison. Ever wanted to know what would happen if that idiot otaku ended up being the lead in a show? Well, Overrun gives you the chance to find out in episode 6. I've gotta admit: that otaku's got guts. He literally wastes millions of dollars and still manages to troll everyone. The worst of these fillers was easily 7, which is the season finale of some super robot series. Here, Overrun subverts like no one has ever subverted before. The episode is not a parody, it is played completely straight. There is no humor, it is a completely different series featuring Mayoi Neko's characters, and it's absolutely boring. And then 8 is an episode of Saki. The final four episodes return to the main storyline, but even then: one of them doesn't feature half the cast, and two more juggle the generic school athletic competition plot. The series starts off promisingly, then proceeds to waste just enough time to make sure we don't see the fruits of that progress by the end. It's a shame because by the time the story comes back around, there are quite a few nice, sentimental moments that make you wish it went a bit further. \\n\\n\r\nThe technical side of things is a mixed bag as well. In the visual department, the character designs (both male and female) are quite nice to look at. The artwork manages to keep a consistent style across all of the characters. For once, a series finally decides to give characters eye colors that don't match their hair; this complimentary coloring for the female leads is especially nice. Still, with the show constantly cycling through staff, the art suffers from notable inconsistencies across the series. Episode 1 has thinner lining and more shapely clothing, episode 5 has more angular faces and emotive shading, etc. A few episodes (4 & 6) have a lot of off-models, though some may have been deliberate (though it's contested whether it was worth it). For the most part, the art survived the episode transitions better than the storytelling did. The animation is below average and never really on par with the art, but being a comedy series, it doesn't really need to be.\\n\\n\r\nOn the sound side: the voice acting is serviceable but as the actors are voicing archetypes, it never goes anywhere beyond the range you'd expect. The OP song is average J-pop but the lyrics really have no rhythm and seem rushed all the way through. On the other hand, the ED has a tropical ring to it and actually sounds quite nice. What background music is present is usually done well. The problem is that there simply isn't enough of it. Entire scenes and large portions of the episodes are completely silent with no music at all. Sometimes it successfully contributes to the atmosphere, but sometimes the lack of music makes unfunny scenes even less funny. Still, the recurring piano theme played during all of the emotional scenes is commendable.\\n\\n\r\nMy biggest disappointment with Mayoi Neko is that AIC basically sacrificed  the actual adaptation to create a display booth for the talent of the various directors involved. While it may have not been a big deal with just any harem, Overrun seemed to have started off doing just enough differently from the rest of the pack to make me think the show had some potential. The fact that it's based on a light novel series and not the usual ero-manga, and a popular one at that, adds to this notion. If that weren't enough, the more faithful manga adaptation has received near unanimous praise. If you can forgive its faults, there are a lot of nice emotional beats that make it a decent recommendation for sentimental rom-com fans. Otherwise, it's strictly for harem watchers and trainwreck gazers. There is simply no excuse for a show to have so much filler when it has a short run time and a wealth of material to adapt. It feels like I've watched a four or five episode show when the series was slated for twelve. I shouldn't ever feel like that.\\n\\n\r\nEDIT: The Railgun maids get a 10.",
            "date": "2010-07-23T22:42:00+00:00",
            "helpful_count": 86,
            "mal_id": 28823,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AuroraFlame",
                "username": "AuroraFlame"
            },
            "url": "https://myanimelist.net/reviews.php?id=28823"
        },
        {
            "content": "In short this show is a disaster. Well, the first three episodes were sweet and I actually enjoyed them. At that time Mayoi Neko Overrun! seemed like a typical harem with a good character development. I was even thinking that Overrun is worthy of eight points, no kidding. But then the randomness came.\r\nY’know, randomness is not really equal to bad quality. Take a look at Galaxy Angel — that show is so damn random but it’s hilarious. It has good humorous episodes and equally good dramatic episodes in stock. But sadly I’m not here to speak about Galaxy Angel, I have Overrun to review. Thusafter three episodes of enjoyable story I got some stupid fanservice stuff, overblown instant drama, surrealistic comedy wannabe and so on… What the hell was going here? Did this show get flu or something? Overrun was trembling with fever between various plot bases. It looked to me that each episode was done by its own team of creators, and those teams never got a chance to talk and share ideas with each other. Judging by the giant list of Overrun’s episode directors here on MyAnimeList, I presume that I was right.\\n\\n\r\nAh, I especially want to talk about the culmination, the zenith of all that randomness: the mecha episode, which was 7th if I’m not mistaken. The episodes from 4th to 6th already were fillers, but the mecha surpassed all my expectations. At first I thought that it’s going to be a parody of genre, but nope, the creators just took the character design from Overrun and merged it into some stereotypical mecha plot. They made the 26th episode of Grand Braver, a fictional anime series which some of Overrun characters watched. Well, I’m not against such spin-offs. Have you seen Kujibiki Unbalance OVA? Damn, that was fun. But again, here the creators didn’t even try. It’s a straight-forward last episode of a mecha show. Since you don’t have a clue what happened before, so there’s no deep plot, and you absolutely have no jokes to laugh at. Personally I’m not a mecha fan, so the Grand Braver was extremely boring. I watched this for about 3 hours, constantly pausing it and going to kitchen to make another cup of coffee or grab more snacks. No, seriously, I was about to drop Overrun but couldn’t. Sadly I’m a faggot, so I never drop anything. Sigh.\\n\\n\r\nIt got better after the mecha but that’s just because you can’t do anything worse than that. Overrun never returned to the level of its beginning. Oh, and the last episode was a recap. So nice of them to remind me of all the horror I went through.\\n\\n\r\nBecause of all those problems we have absolutely no character elaboration in this show. They’re just doing all the director wants them. Tsuzuki, the male lead, can be a borderline otaku freak or some dude who don’t give a thing about what happens around him; Umenomori ranges from spoiled whiny brat to depressed lonely girl; Kiriya switches from just strange and introverted type to gloomy and dispirited one for no apparent reason… Only three of regular cast are somewhat stable: Serizawa, residential tsundere, the otaku Kikuchi and that other guy, but he’s just furniture so he has no personality at all.\\n\\n\r\nBy the way, let me put something straight. AIC decided to do 13-episode anime and had 8 volumes of ranobe to work with. So why did we get so filleresque  show, huh? I can’t believe that ranobe can have a plot so retarded. If there are any people here who read them, I want to know what they really consist of, so I beg of you to tell me.\\n\\n\r\nBut okay, enough with the plot. Maybe Overrun has some strong sides on technical plane? Well, the artwork is decent, the music… Erm… There was music, right? I guess it’s decent too, since I can’t remember anything good or bad about it. So no luck here either.\\n\\n\r\nAnd thus it’s time to wrap up. Overrun is overrun with fillers, plot stupidity, clichés and lacks any noticeable good aspects except the beginning. I can recommend you to watch it only if you’re masochist.\\n\\n\r\nSo at last, Overrun, here is your 5 points and sayōnara! Even the power of Umenomori zaibatsu was not enough to make you enjoyable. Hm, wait, maybe I should check my bank account or something…\\n\\n\r\nP.S. For this season I picked up Mayoi Neko Overrun! (with exclamation mark), Angel Beats! (with exclamation mark again) and K-ON!! (with two exclamation marks). I think it is a really good marketing move to make the viewer uncomfortable with all those titles constantly shouting at him.",
            "date": "2010-07-05T14:50:00+00:00",
            "helpful_count": 78,
            "mal_id": 28012,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201858.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/KatayokuTsuneki",
                "username": "KatayokuTsuneki"
            },
            "url": "https://myanimelist.net/reviews.php?id=28012"
        },
        {
            "content": "This anime, as of the third episode, is a shameless fanservice anime that throws in dozens of nerd fetishes into one strange pot.  The characters are mostly uninteresting because they are all blatant stereotypes we've all see before.\r\nThere's a cat girl, two tsundare girls, the slob, an otaku dude, yada, yada etc.  \r\nTruly a forgettable show.",
            "date": "2010-04-23T11:16:00+00:00",
            "helpful_count": 66,
            "mal_id": 25358,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 0,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/loup456fatman",
                "username": "loup456fatman"
            },
            "url": "https://myanimelist.net/reviews.php?id=25358"
        },
        {
            "content": "Story\r\nIt's not a great story, you will not have a complex story on this one so if you care about story on a comedy anime then this is not for you. The story revolves on a mysterious girl that acts like a cat or it might really be a catgirl they don't really explain why she is like that and she meets this guy Takumi who was an orphan and convince her to live with him and her ''sister'' who adopted him and basically is about their daily life and comedy.\r\nArt & Animation\r\nThe art style is very good, I liked how well animated this wasand it was consistent every episode, the characters design were very good. \\n\\n\r\nSound\\n\r\nThe sound was very good in every aspect, voice acting, i loved the OP, i never skipped the OP.\\n\\n\r\nCharacter\\n\r\nI liked every character but they could have developed the catgirl, I liked Fumino it was too tsundere though but they were funny, they will make you laugh every episode, this is why i liked them, but i still don't know nothing about the catgirl Nozomi.\\n\\n\r\nEnjoyment\\n\r\nI Had a fair enjoyment out of this.",
            "date": "2015-08-03T12:59:00+00:00",
            "helpful_count": 29,
            "mal_id": 195085,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195085"
        },
        {
            "content": "Mayoi Neko Overrun- Just like a Benz car, great at first, and then 2 months in it's the biggest mistake you've ever made.\r\nJust like anyone else, I read the reviews for this anime and of course everyone says it's horrible. But of course, just like everyone, I couldn't resist the great introduction, and the cute pictures and characters so I watched it.\r\nActually at first I it was pretty good, the story with the main character being an orphan etc. etc. and at that moment I was like WTF if everyone talking about? this anime is great! great art and story!\r\nWARNING- DON\"T BE DECEIVED this animeis a disaster after like episode 3, it just seems like filler. There is no story to it, it's not even funny anymore, and all the characters are so very repetitive. From this point on, the ONLY THING that was good was the art.\\n\\n\r\nOverall this anime would be amazing if you just watch the first 3 episodes, or studying animation (doubt it). If not, stay away from this it's a horribly, terrible anime.",
            "date": "2011-01-11T18:06:00+00:00",
            "helpful_count": 14,
            "mal_id": 33672,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/433107.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karxes",
                "username": "Karxes"
            },
            "url": "https://myanimelist.net/reviews.php?id=33672"
        },
        {
            "content": "This is my first review Ever! so dont kill me if i fail or if you dont agree!\r\n My first thought to this anime was \" oooo cute looking girls, cat girl, one boy, and jealousy, just your typical normal harem show............Heo yeah i was wrong. this show was plot less and and showed almost no sign of harem-ism. the first three episode looked good with all the love, jealousy, and heart breaking stuff but through episode 5-11 (episode 9= exception)  it was nothing but random shat and crap. i mean come on, its close to the end of the series and its stillshowing randomness\\n\\n\r\nThis anime taught me not all is handy dandy when you see cute girls ----Disapointment",
            "date": "2010-06-17T01:02:00+00:00",
            "helpful_count": 12,
            "mal_id": 27247,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97060.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/vietazn303",
                "username": "vietazn303"
            },
            "url": "https://myanimelist.net/reviews.php?id=27247"
        },
        {
            "content": "'Mayoi Neko (Stray Cats) Overrun!' is a harem comedy mainly about one guy and three girls in a cake shop called \"Stray Cats\". The owner of the shop is a tennen (\"natural boke\", someone who has zero common sense) woman who likes to find stray cats and sometimes kids, and provide them shelter in the shop. Our protagonist Tsuzuki Takumi is one of those human stray cats, and the story begins with the arrival of the second human stray cat, Kiriya Nozomi.\r\nSTORY: 6/10\r\nPretty common setting with plenty of parodies.\r\nAs far as I can tell, only first and last three episodes were the main story withKiriya Nozomi as central focus, despite all the episode titles were about her.\\n\\n\r\nJust as with the animation, there was a different director for each episode. It seems like they were given the freedom to do whatever the hell they wanted to do with filler episodes from ep 4 to 9, and that's exactly what they seemed to have done.\\n\\n\r\nEpisode 4: Possible 'FMP Fumoffu' onsen parody with a sudden parody of Ping Pong (2002) movie?\\n\r\nEpisode 5: Went for character development with fan service.\\n\r\nEpisode 6: Entire episode on a PV shoot, reminds me of 'Haruhi' movie shooting episode.\\n\r\nEpisode 7: Entire episode on mecha parodies.\\n\r\nEpisode 8: Entire episode on a custom Jenga game.\\n\r\nEpisode 9: Went for straight romance drama.\\n\\n\r\nWhether it worked or not is up for debate, but they all had great slapstick pacing, and I personally found the noticeable difference in direction to be quite entertaining.\\n\\n\r\nFinal episode was a recap of the series, which is pretty rare nowadays. The commentary was pretty funny, and I think it represents the freedom in production of this series very well (since it shows that they were given total freedom even the series composition stage).\\n\\n\\n\r\nANIMATION: 8/10\\n\r\nNotice the animation director and the production studio for animation work assistance is different for every single episode.\\n\r\nAnimation quality varied by episode, like episode 1 (Studio Comet) and episode 8 (Sunrise) were significantly better than the rest, but generally above average for harem comedy series.\\n\\n\r\nCharacter design was decent, with big-eyed attractive girls and signature features (cat ear hair, red cross-patterned ribbons etc) and comments. Despite great influence by animation director and work assistance, character animation consistency was better than average, with exception to episode 11 (Studio Blanc.), which had distinctly different drawing style that I think worked pretty well.\\n\\n\r\nYou can tell none of the animation directors and studios wanted to be seen as a slacker (less deadline rush probably helped too), and we are treated to quality animation with subtle difference in style for every single episode, which I found to be very fun to watch.\\n\\n\\n\r\nSOUND: 7/10\\n\r\nVoice acting was very strong, especially for Serizawa Fumino and Kikuchi Ieyasu. Filled with emotion and highly motivated seiyuu staff.\\n\\n\r\nBGM was unremarkable, but that is expected for harem comedy series.\\n\\n\r\nOP/ED were extremely weak seiyuu songs. I can kind of imagine a bunch of NEETs dancing otagei to it. Three \"special EDs\" for episodes 6, 7, 11 were somewhat interesting though.\\n\\n\\n\r\nCHARACTER: 7/10\\n\r\nPicking a girl for the indecisive protagonist sure is difficult for this series. We have Nozomi, who's a tennen cat girl who's good at everything and goes along with everything. Then Fumino, a tsundere childhood friend (i.e. the \"invincible character\" if this was 'eroge'). Finally Umenomori Chise, a super -pushy billionaire lolita. I have to say I liked the balance with tsundere and pushy loli fighting for the guy with tennen as a mediator.\\n\\n\r\nYes, we have a lot of stereotypical character personalities here, but they're all so off-the-chart in each characteristics (like tsundere so much that Fumino always means the opposite) actually made very interesting story developments possible, though they do get a bit annoying after a while.\\n\\n\r\nCharacter development is not really expected in a slapstick series like this, but Fumino did start expressing her feelings, and Nozomi's gradual realization of friendship and family was depicted very well.\\n\\n\\n\r\nENJOYMENT: 9/10\\n\r\nI personally liked the characters, and thought there were couple of really funny episodes. Just like Haruhi 2009's \"∞8\", most of the watch value was in subtle difference in animation styles and in this case, different director for each episode too.\\n\\n\r\nThe original setting and story may be unoriginal, but there was abundance of creativity in production stage of this series made possible by one-episode-only staff and teams. Changing animation style, good pacing, hilarious gags, constant fan service, repetitive violent retribution, great directions.\\n\\n\r\nIt's in a crappy genre where you can't expect any story, character development or value to begin with, but there was some of each in this series.\\n\r\nAs far as watch-and-forget comedy goes, this is as good as it gets. 'Mayoi Neko Overrun!' was hands-down the best comedy of the season for me since all other comedies this season were plagued with horrible pacing and letdowns.",
            "date": "2010-06-30T09:28:00+00:00",
            "helpful_count": 12,
            "mal_id": 27804,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=27804"
        },
        {
            "content": "If Mayoi Neko Overrun! was an anime meant solely for humour, it might have recieved a higher rating, as there are times when it really excels in that area, thanks to its inventiveness of situations and some clever use of character animation. However MNO is catagorically meant to be an anime based on romance as well, which means at some point the humour has to back off a little to allow the romantic part of the story to progress.\r\nTo be fair MNO does open up in reassuring fashion, conveying all the romantic gestures you'd expect from a romance-based anime, and it almost succeeds in pullingsome emotional heartstrings while stirring some deep curiosity in the personalities of the key characters. However, beyond episode 3, the promising plot disintegrates, and eventually to the point where it fails to even develop the hidden romance between the two main characters.\\n\\n\r\nThe random style of some episodes is a nice diversion from what is otherwise a plot with as much depth as a sheet of tracing paper; it just never seems to address any meaningful conclusion, goal, or resolution regarding the relationship between a passive Takumi and a pretentious Fumino... surely a dissapointment for romantics. For that matter you might as well focus as much attention on the other characters, since their storylines have about the same depth as the main two characters.\\n\\n\r\nHaving said that, MNO is by no means detestable - throughout the anime the characters remain somewhat likeable, thanks in no small part to the charming and high quality art, along with the usual winning (abeit cliched) anime poses you'd expect to see in harem type anime. Loosen your focus on the main characters and avoid trying to follow a goaless story here, and MNO is an enjoyable enough anime at least to pass the time on a rainy weekend.",
            "date": "2011-01-28T05:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 34089,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Neuko",
                "username": "Neuko"
            },
            "url": "https://myanimelist.net/reviews.php?id=34089"
        },
        {
            "content": "Mayoi Neko Overrun is basically 12 anime in 1 anime. It has a different episode director, animation director and key animation every episode. How does it matters?\r\nIt actually doesn't matter. If you are one of those who hate \"generic\" otaku anime, PLEASE DON'T WATCH THIS ANIME. It has everything you don't want to have in it, like tsundere, dense MC, harem, fan-services. If you get bothered by the major premise, there is no way you can enjoy the minor staff.\r\nBut if you are one of those who actually appreciate and enjoy school harem anime, Mayoi Neko Overrun! will definitely be a refreshing and rare watchingexperience for you, since there are 12 different styles of presentation. You don't see anime do this that often, especially in the harem category. Hope that you can match up with the \"Denpa\" comedy. That's how most of the anime by AIC works, just like Sora no Otoshimono, Oreimo, Haganai. They bear the weight of being entertainment gearing towards male otaku audience, but they still putting a lot of effort in the meticulous matters (that actually majority of the watchers do not cares, they don't even notice, Oreimo is the biggest example).\\n\\n\r\nStory: 6\\n\r\nThe overall flow of anime feels like Kotoura-san (another anime by AIC), 3 episodes of story, Slice of life for the middle episodes, then get back to telling story near the end of the anime. This pace changing is not very viewer-friendly and got a lot of complain in Kotoura-san, but it works out well here. \\n\r\nStory is fair, actually the worse part of this anime is the story. I mean the first 2 episodes. \\n\r\nThe middle part is where this anime shine. It is fair to say that the Mayoi Neko Overun! starts at episode 4.\\n\r\nThe general feeling of the story is heartwarming, just like every other work by Matsu Tomohiro (R.I.P.), its original creator. \\n\\n\r\nArt\\n\r\nArt is pretty good. The 12 different styles of presentation already provide enough things for you to pay attention to. The occasional 3D animation is great, especially in the episodes preview where we get 3D maids. \\n\\n\r\nSound\\n\r\nIt has an incredible voice acting cast. If you are a fan of Japanese voice actors, you sure would know how big that cast is and you would probably enjoy the anime just by listening to the seiyuu's performance. \\n\r\nThey do put some effort in their opening and ending too, just standard AIC things. Not on Oreimo or Heaven's lost property level where you get a new ed every episodes. But you can expect there may be different ed in a few of the episodes. If you are one of those who skip everything then it doesn't matter. \\n\r\nIn episode 4 there are some very funny use of background noises and bgm, you can pay some extra attention to it.\\n\\n\r\nCharacters \\n\r\nJust the characters you can expect from a harem anime. It's a cute and fun cast and so it's great. As much as I admire originality, there is no need to blindly search for originality in every aspect of a show. \\n\r\nKiriya Nozomi has a very cute and interesting design. I will not be surprised if Mashiro Shiina's design is inspired by her. Since Mayoi Neko Overrun is actually quite popular in Japan back in 2010. If I recall correctly the BD sales at first release is around 4500 which is well above average.\\n\\n\r\nEnjoyment\\n\r\nComedies are more towards random or slap stick comedies, Baka to test/ Inu to Hasami wa Tsukaiyou's style. Keep it in mind that you're watching a comedy then it would be enjoyable. In other words, if you know how to have fun, you'll enjoy it. I know it sounds stupid but you'll understand what I mean if you are a patron for these light novel comedies. \\n\r\nThere are a lot of fanservices too, and I like it.\\n\\n\r\nOverall \\n\r\nI usually rate any anime that I thoroughly enjoy a 10, but I can only give it a 9 here because to be honest I don't enjoy the first 2 episodes very much. \\n\\n\r\nAnother thing to keep in mind is that I'm like the perfect target audience of this anime. If you don't care about seiyuu or don't like school harem romcom, fan-services and all the other staff I mentioned, I expect the rating would be a lot lower for you.",
            "date": "2018-03-07T07:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 273269,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6432186.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nbyung09",
                "username": "nbyung09"
            },
            "url": "https://myanimelist.net/reviews.php?id=273269"
        },
        {
            "content": "(I'm not very good with reviews but I'll try my best here)\r\nI was going to write the review at the end of the series but since it looks like a recap episode so I'll push the review to this week\r\nStory - 5/10\r\nI'll be generous here.  The one big problem I found with this anime is that it does not have a consistent plot (there was a plot but it was in and out).  Every episode in the middle of the series went off on a story of their own and they all felt like fillers.  From what I can remember this animewas supposed to be a romantic comedy which I have no problem with, but I would actually like a little development each episode!  The ending however was actually quite decent because it went back to a plot point which they had in the beginning, orphans who are happy because of the \"family\" they create with each other.  Although the story messed up in tons of places, I think the ending was good enough to prevent from giving it a lower rating.\\n\\n\r\nArt -8/10\\n\r\nI really have no complaints with this area, the animations looked fluent and although I've seen better artwork I thought this one was alright.\\n\\n\r\nSounds- 8/10\\n\r\nAnother area which I have no complaints about. It had an interesting opening song which I think a person would either hate or love, I personally loved it.  The background music was used at the appropriate times and the voice acting was alright.\\n\\n\r\nCharacter- 8/10\\n\r\nA lot of the characters seem average in this anime with the exception of Fumino, who really stood out to me.  Fumino is not your ordinary Tsundere, I really can't explain what it is but she is different from the ordinary Tsundere (in a good way) and perhaps was one of the few good things the anime offered.  One problem I had is that there wasn't enough focus on Nozomi  which wouldn't be a problem if this anime wasn't named Mayoi Neko Overrun.  She did get a lot of focus towards the end but that was too little too late.\\n\\n\r\nEnjoyment- 6/10\\n\r\nI really enjoyed the first 3 episodes and I found the last 2 alright, which leaves the middle episodes.  There were one or two episodes in the middle that advanced plot which I enjoyed but the rest I really couldn't stand.  All those fillers that they put in really weren't funny with me only occasionally chuckling.  I really don't know what happened, did they run out of ideas? \\n\\n\r\nOverall- 6/10\\n\r\nOverall I really wouldn't want to recommend this anime to anyone.  It's a shame really because I really liked what they were going for in the beginning and I thought that this anime had potential to become something amazing but it fell well short of what I and many hoped for and it ends up as another let down.\\n\\n",
            "date": "2010-06-25T17:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 27570,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=27570"
        },
        {
            "content": "From what I've read from other reviews, I'd probably agree with them in certain ways when they say that this anime doesn't make any heads or tails in it, you might think it's a usual harem type of genre but it kind goes from one point to the next, you really can't figure out as to whom the male character connects with. But still, it is decent enough to be watched because what it lacks in plot makes  up with couple of good slap-stick  comedy, As for the art of this anime, I find it very good because it kinda look like atypical manga that has come alive, never mind if there are some differences between the two. The characters, well, I'm focusing on the schools uniform for girls. I like the way that it matches with the female characters  especially when it's Fumino who's wearing it, her long black socks really accentuate her very well, as if the two are mend for each other (the girls uniform and the long black socks), I also find Othome very attractive in a bikini, the way she's drawn really makes her versatile to wear any of the characters clothing from her everyday get up to her work clothes, she'll probably look good wearing the school uniform  or one of Chise's maid's uniform or in some rare cases be in the nude. The bike shorts in the last 2 episodes of the anime really does give the girls (most of them that is) that professional sporty look, since the bloomers kinda makes things too ordinary even if it's sexier that the bike shorts. So, even if this anime has it's share of twist and turns that you can't seem to make of, it is still decent enough to be watched so I give it a rating of 4. \\n\\n\\n\r\nTrivia: \\n\\n\r\nBike shorts or spats (as they were called in the anime) were first made up of black knit wool before being made out of spandex.\\n\\n\r\nBloomers (as they were also called in the anime) are also called Boyshots.",
            "date": "2010-11-21T12:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 32223,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=32223"
        },
        {
            "content": "Having no specific antagonism to harem anime, I found that this show starts out looking like it might be worth watching. Unfortunately, nothing improves from there. The show doesn't even pick a direction to go. Instead of looking like it will do something worthwhile it turns into \"The Random, Bizarre, Contrived, Episode-long Nonsense that Utterly Fails to be Funny or Otherwise Entertaining Show.\"",
            "date": "2011-11-07T08:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 47027,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=47027"
        },
        {
            "content": "Never judge an anime based on it's name and cover image. This is a good example.\r\nTakumi Tsuzuki, a boy abandoned in his infant years, adopted by very caring sister named Otome. He lives his life with Fumino Serizawa, someone was also abandoned in her childhood, both work in a pastery shop and go to school. \r\nEventually, Otome picks up this girl with a hair style similar to cat ears and has a tendency to say \"Nyaa\". Her name is Nozomi Kiriya and not much is known about her except her name. They find she is also an abandoned person. The story progresses as they learnmore onto this mysterious person. Joining them is a little girl named Chise Umenomori putting them in strange situtations.\\n\\n\r\nTerms of animation and sound, it is one of the best I've seen this season.\\n\\n\r\nStill, it is too early for a complete review but so far this is recommended.",
            "date": "2010-04-22T08:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 25311,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/R2J",
                "username": "R2J"
            },
            "url": "https://myanimelist.net/reviews.php?id=25311"
        },
        {
            "content": "Takumi is just your average nice guy who has two beautiful girls fighting for his affection; one is his childhood friend who has a short temper and the others a spoiled rich girl. Things get crazier though when a mysterious third girl who acts just like a cat enters the fray and wacky adventures ensue. Yeah, so basically it's just like any other ecchi comedy. \r\nStory 4/10\r\nEvery episode has our characters going on a different adventure whether it's going to the hot springs or going to the beach. However, the biggest problem I have with this anime is the lack of comedy; what makes otherecchi/harem anime so great is how funny the characters are, but these characters just aren't that funny. For example, an episode where the characters go to the beach has a lot of potential, but instead they just do everything people normally do when they go to the beach. \\n\\n\r\nI think the writers believe fan-service and comedy are the same thing, they aren't, they're completely different. Flashing a girls panties is not a joke, showing bouncy boobs is not a joke, it's sexy, but it isn't funny. \\n\\n\r\nThe show does have some good jokes (guy sees girls panties, girl punches guy is always funny), but the jokes are too far apart and too few. Sometimes, while I'm watching an episode, I'll be asking myself \"where's the next joke?\" \\n\\n\r\nCharacters 6/10\\n\r\nUmenomori: Umenomori is the rich girl who can make almost anything happen (no matter how impossible) using the power of money. She provides the set-up for a lot of the characters adventures, but my biggest complaint with Umenomori is she isn't that funny. I feel like all the jokes are coming from the other characters like Fumino and Takumi. \\n\\n\r\nFumino: Fumino is Takumi's childhood friend who has a short temper and always says the opposite of what she means. I always love tsunderes so naturally whenever Fumino punched out Takumi or got red in the face I laughed, but my problem with Fumino is the romance between her and Takumi feels so forced. Also, I'm so sick of this cliche where the girl loves the guy, but doesn't say anything so there's just this awkward tension between them, and that comes up a lot in this anime. \\n\\n\r\nNozomi: Nozomi is the cute innocent girl that acts like a cat by saying meow a lot and having hair that makes it look like she has cat ears. Yeah, that whole cat-act Nozomi does was cute at first, but after while it gets really annoying. STOP saying meow, talk NORMAL. Furthermore, other than looking cute, Nozomi does nothing except act more like a cat. Oh, and it is never explained why she acts like a cat to begin with. \\n\\n\r\nOtome: Otome is the big boobed owner of the bakery where the characters all work. Otome is a really funny and likeable character, but she's never around. \\n\\n\r\nSatou & Suzuki: Satou & Suzuki are Umenomori's two maids and my favorite characters. I know that sounds weird since they're mostly in the background and barely say anything, but they are both just so adorable and I love every joke they make with them. \\n\\n\r\nOverall 5/10\\n\r\nI enjoyed watching this anime because it did have a few funny jokes in each episode, but I don't really like the characters and there needs to be more jokes. Furthermore, the romance feels so forced and Takumi is such a boring main character. I'd recommend something like Girls Bravo or Heaven's Lost Property over this.",
            "date": "2017-01-16T23:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 238470,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3238983.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/middleground4471",
                "username": "middleground4471"
            },
            "url": "https://myanimelist.net/reviews.php?id=238470"
        },
        {
            "content": "Short review\r\n[Up to ep 8, altho I skipped middle part of ep8, will update again aft watching ep 8 in full]\r\nOk, this anime reminds me a lot of Baka to Test to ??. First they start with some interesting scenes introducing characters, then after a few eps you have endless plotless, comedy, ecchi annd fanservice eps. Yep, up to ep 8 it's still ongoing, go look at forums- ep discussion. Lots of ppl are dropping it aft ep8, 4 eps left, what can we expect anyways?\r\nStory:3\r\nWhat can I say? The anime started off with a touching story of inter-dependence and friendship but after the firstfew eps it became horrendously random. To the end of ep 6 there is only minimal character development and some earlier unique characteristics of characters and plot seem blown away suddenly. Till 8 there are a lot of parodies featured, starting to feel like Seitokai ?? ??, the parody show. It;s still ok if the individual eps have good storyline , even as fillers. But they do not have anything commendable at all. Except sound and art, and enjoyment for some.\\n\\n\r\nThe only hope left is its future eps. Left 3, any hopes? Nope, for me.\\n\\n\r\nArt:7\\n\r\nIt's not bad, but even with special effects all seem very 2D. the colours used were pleasing to the eye but not spectacular. Character designs were decent.\\n\\n\r\nSound:7\\n\r\nBoth OP and ED were special, and sounds effects were ok. Voice acting was quite good for the girls.\\n\\n\r\nCharacter:3\\n\r\nNice introduction of characters but bad follow-up. Plus characters sometimes change personalities a little, esp during filler eps. Character development is quite little esp for Takumi.\\n\\n\r\nWith so much filler eps showing little or no unique personalities of the characters, other than the most obvious ones, and hardly any surprises or development, the characters went stagnant. That is still ok, PROBLEM IS that in some eps the characters changed personalities. This is bad... very bad. Take ep 7 for an example, our main protagonist Takumi turned evil along with his 2 male buddies.\\n\\n\r\nI cut this score from 6 to 3, from ep 6 to 8. So, be warned.\\n\\n\r\nEnjoyment:7\\n\r\nDepends on your type of humour. Some parts were ridiculously funny and some comedy presented were literally out of this world. Up to ep 6 that is. Ep 7 and 8 was a turn-off for most of the community.\\n\\n\r\nOverall:6\\n\r\nMy main purpose of watching this series is enjoyment and seeing if the original storyline presented would be continued. And you might like this if you like Baka to Test to Shoukanjuu.\\n\\n\r\nBtw this series changes directors every ep. Wonder what AIC, the production studio has against the original creator (and pretty much the rest of the staff).",
            "date": "2010-05-13T06:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 26011,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=26011"
        },
        {
            "content": "(Bear in mind this is my first review)\r\nThis show, I can't finish watching. It is just that dreadful. I watched up to episode 5, and gave up. There are many different things that make it appalling, as I will write in this review.\r\nStory: 2\r\nThe story jumps around a lot. One episode they're at school, the next, they're in some random mountains. Usually, I like shows that are random and spontaneous, but this one just doesn't fit the bill. I also noticed they reused a lot of animations, and they also added little fillers just to waste time.\r\nArt: 7\r\nThe art is actually pretty decent. This isthe only positive thing about the show, though.\\n\\n\r\nSound: 2\\n\r\nThe music just doesn't fit with the show. The ending theme sounds tropical. If you play tropical sounding music in a show, you would expect that the show takes place in, I don't know, somewhere tropical? They also reuse a lot of music, and in one episode in particular, they pretty much just looped the same song for about 5 minutes, not caring that it didn't suit the mood.\\n\\n\r\nCharacter: 3\\n\r\nAt the beginning, they suddenly introduce a bunch of characters without warning, and you don't even get to know what the main character's name is until quite later. The characters are also very generic. Tsundere childhood friend, Pervert best friend, ETC.\\n\\n\r\nEnjoyment: 2\\n\r\nI didn't enjoy this show much at all, because of all the flaws together. Sure, it's humor can be funny at times, but it still doesn't make up for what this show is lacking.\\n\\n\r\nOverall: 3\\n\r\nThe random story, wrong music, and sudden character introductions all bring the final score down to a 3. Sure, the art is pretty good and the comedy CAN be funny at times, but it doesn't make up for all what is wrong with this. Sure, some people could like a show like this, but I don't care for it. But hey, that's my opinion, and it is just that, an opinion.",
            "date": "2014-08-13T00:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 156373,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Waffelman83",
                "username": "Waffelman83"
            },
            "url": "https://myanimelist.net/reviews.php?id=156373"
        },
        {
            "content": "The art is... It's a thing. Yeah. That's about as positive as I'm going to get when talking about the abysmal failure that was Mayoi Neko Overrun (MNO). \r\nThere's a reason why I dropped the show, a very good reason indeed.\r\nTL;DR- It's bad.\r\nAt least other shows like Toaru Majutsu no Index Season 2 (TMI S2) had half decent music, and a genuine plot to follow which this show ALMOST had as well which ultimately ended up botched due to the fact the semi-unique premise turned into generic harem #54 somehow. I actually wonder how that was even accomplished, but it's whatever. \r\nThe show is bad.Wait I already said that. Well it's bad. If anyone is actually reading this, that's very clear to understand based on my ratings and shit. (Are swear words allowed in MAL reviews? Eh. Whatever.)\\n\r\nWhile I feel the show doesn't even deserve an explanation as to why it's considered doggie dookie in my opinion, it would be extremely improper to not explain myself at the very least.\\n\r\nAs I've previously mentioned, they (an in-descriptive term I'll use to refer to whatever studio produced this garbage) had something going for them. This could have been good. But instead of focusing on character growth through means of the aforementioned \"interesting premise\" which was completely doable, instead they insinuated how much the main female leads wanted the main male leads' dick. BOTH main female leads. Along with the side characters, whom were about as prop-like and un-likable as sand paper. Dunno why sand paper was the analogy I chose to use there, but it felt right. \\n\r\nActually, allow me to take back what I said; the show DOES manage to do one thing, and that is to turn on the 11 year old weebs with poor tastes in anime. Yep, I'm going there. Mr. Elitist here to ruin the fun.\\n\r\nBut come on, you know it's true. \\n\r\nNow here's the thing: I'm a lazy person. I could sit here and go through ever reason as to why I hate this show as much as I do, but due to the fact I've already burnt through most of the hatred fuel I had at the start of this \"review\", I kind of just wanna stop and watch other things. So instead of elaborating on my oh so elegant opinions of MNO, I'm gonna end it here.\\n\r\nActually nah, I'll quickly go through some other things but don't expect a paragraph of info, ok?\\n\r\nThe art is mediocre, and because the studio which produced the show has some money it isn't garbage. Big eyes, big boobs and disproportionate hands are all you need to make anime, really. \\n\r\nThe music is equal to elevator music in terms of scene setting and immersion into the show.\\n\r\nThe characters are empty cardboard boxes, except for the main ones, they're more cardboard boxes with homeless people in them.\\n\r\nK I'm done now. \\n\r\nI don't like this show. It's bad.",
            "date": "2017-12-28T23:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 266716,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642040.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/AnimeAndApples",
                "username": "AnimeAndApples"
            },
            "url": "https://myanimelist.net/reviews.php?id=266716"
        },
        {
            "content": "The anime is centered around \"Tsuzuki Takumi\", and the main characters are introduced during the first three episodes (Takumi is the only male main character). \r\nSerizawa Fumino (Takumi's Childhood friend), Kiriya Nozomi (a \"stray cat-girl\"), and Unemori Chise are the main characters, which are introduced in the first two episodes. All three commonly have contradicting opinions and actions, and Unemori Chise gets in quarrels with Fumino quite often. It becomes apparent that the 3 of them fall for Takumi by the end of the first season, for the kindness and way he is (Season 2 is guaranteed, based on Manga to Anime comparisons).\r\nThe dialogue isvery humorous, and the situations that Takumi is put in because of the three females makes you chuckle, regardless of how well you can suppress it. The scenes amplify the effect, since Mayoi Neko Overrun is an ecchi type anime. Episode 4 contains the most embarrassing scenes for the characters, and the way it is shown really makes you laugh. \\n\\n\r\nNo real battles, similar to the anime Spice and Wolf, but with a Cat-Girl rather than a Wolf-Girl (although the main character describes Fumiyo, his childhood friend, as a Wolf). \\n\\n\r\nAnimations are decent, could be slightly smoother and less... artifact-filled, and they could have extended the amount of time it took to go through the Season. Episodes 1-3 seem okay, as they are all for getting to know all the main characters, but it begins to feel rushed and compressed from the Manga afterwards. The main problems would be in the anime progression. The first three episodes were good. After that though, everything seems to go a bit off-topic. Randomness is very high, and you could begin to question why it was written this way.\\n\\n\r\nThe sound and art would be the strongest points of the anime, in my opinion, but they could have used certain soundtracks for different scenes, as I feel that some of them aren't exactly appropriate for the scenes. Animation is smooth, but you can notice that they cut some corners around the last few episodes.\\n\\n\r\nOverall, I rate it 8 out of 10. The concept, artwork, and sound are good, but the execution of the plot/storyline was not great at all. Suggested for comedy fans.",
            "date": "2010-10-19T19:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 31470,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/348635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xHikaruSora",
                "username": "xHikaruSora"
            },
            "url": "https://myanimelist.net/reviews.php?id=31470"
        },
        {
            "content": "Being one of my first reviews i hope this helps,\r\nThis show focuses on comedy and not enough development of the characters. I would really have liked to seen takumi form some sort of secret affection for at least one of the girls. This being said it still was quite funny and is a good show to watch",
            "date": "2011-04-07T17:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 35788,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/469025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ratton21",
                "username": "Ratton21"
            },
            "url": "https://myanimelist.net/reviews.php?id=35788"
        },
        {
            "content": "This isnt your average ecchi pantsu fan service anime! IT HAS DEPTH AND PLOT... is what i wouldve said if they didnt COMPLETELY derail off course after episode 4. If what you are looking for is just oppai and pantsu, then u definitely came to the right place....\r\nMayoi Neko is like the little child that got abducted by strangers after being put through the dilemma of whether to listen to your parents about not taking candy from strangers or \"OOH BOY CANDY!\". \r\nAfter the first 4 episodes, I was convinced for the most part that I was right in picking this anime to watch forit had some depth and that family and bonds and all that good stuff was something this anime can develop on, but surely I have been proven very wrong immediately after episode 4. Every episode has less and less to do with being orphans and going through struggles, and more about fan service and love triangles or squares or whatever polygon for that matter. The series even begins to become strictly episodic and some even have absolutely nothing to do with the plot and even tries to satire other genres in the process. Not that this was why it sucked but at least do it properly.\\n\\n\r\nThe characters are shallow, the art is attractive as expected(it did get me to watch it). Music was catchy, but all of which wasnt enough for me to enjoy it. Slightly disappointed... actually... very disappointed, but it couldve been much worse.\\n\\n",
            "date": "2010-06-25T19:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 27575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=27575"
        }
    ],
    [
        {
            "content": "I have very mixed feelings about Mayoi Neko Overrun. It's quite something to say that a series is both generic yet still one of the more... unique harems to come out in a while. This all stems from the fact that the scriptwriter, director and key artist changed every single episode for the twelve week duration of the series. The result is that studio AIC squanders what little potential the series already had and gives the directors free reign to do one-shot episode experiments. What would have been a mostly cliche but still above average harem turns into possibly \"the\" trainwreck of the year.\r\nStarting offwith the positive: The most interesting part of this series was that despite a formulaic harem setting, the show had a motif; a constantly echoed theme that ties all of the characters and stories together. The theme is stray cats, both literally and figuratively. The show examines what it means to be abandoned and alone, what it means to search for and find a place where you can belong, and what it means to have a family and a home. While not as well-developed as it should have been because of the aforementioned trainwrecking, these ideas are woven into the plot and the backstory of every single character. It all starts when Nozomi, a blue-haired emotionless catgirl with abandonment issues, is taken in by protagonist Takumi's older sister. This unofficial adoption forces the other two members of Takumi's harem to reexamine their own lives. Blond tsundere Fumino grew up with Takumi in an orphanage, a victim of non-stop bullying. Even blonder ojou-sama Chise is surrounded by wealth and yes-men who abide by her every word, but the fame of her parents ensures that they are never around and she is always alone.\\n\\n\r\nDespite archetypal definitions, the characters in this series manage to have a little extra depth to differentiate them from other harems. Otome nee-san is far more mature and understanding than her carefree attitude would lead you to believe. Same goes for Kaho, a childhood friend and conniving corporate rival of Chise's, who in one episode fosters a misunderstanding in order to strengthen the bonds between all of the characters. Two seasons prior, AIC made Sora no Otoshimono a successful harem by playing up the fact that the protagonist was an unabashed pervert, proving an interesting contrast to the indifferent or wimpy male leads of most harems. Well, Overrun does the exact opposite here. Not only does Takumi try to weasel his way out of dealing with the girls, but his indecisiveness is actually justified by just how irritating and passive-aggressive the girls actually are. Nozomi is silent as ever, but the writers don't even attempt to push Chise or Fumino as moe or submissive. They are incredibly overbearing and often cause Takumi a lot more trouble than they're worth. The characters are not quite unlikeable (I was fine with them), but it was still interesting to see a show actually get away with making a guy not want his harem.\\n\\n\r\nSpeaking of Takumi, for a male lead in a harem, he is surprisingly absent. The show is supposedly about his developing relationship with these girls. Yet even from the first episode, he frequently seems like a supporting character in his own series. Late in the show, there is an episode about the family taking care of a lost young girl (which again allows the characters to reflect on their own thoughts of loneliness) and Takumi doesn't appear at all. This is a mixed blessing but moves toward the positive. One, the show starts with Fumino and Chise already having a crush on Takumi, preventing any contrived or shallow origin story for their romantic interest in him. The chronic absence of the male lead also keeps the girls from fawning all over him like other harems (though like I said, their characterization already prevents this). The girls have a lot of scenes to themselves, where they meditate on their own thoughts and solve their own problems. If you are tired of seeing harem girls waiting around for their \"man\" to come and fix everything for them, this series can be refreshing occasionally.\\n\\n\r\nDescribing the series like this, you'd wonder what went wrong. And here is where we come back to the dreaded switching of directors every episode. The show is a mess. Every individual episode is solid enough, but the series itself lacks coherence and is riddled by random, one-off fillers in the midseason that fail to progress the story at all. This is probably the only harem I've seen where one of the girls full-out confesses to the guy early in the series, in three episodes which build up to a nice climax despite starting off a bit shaky. And yet it takes this build-up and does nothing with it, opting instead to just go for random gag episodes. Four in particular stand out: 4 was from the director of Gag Manga Biyori and jumped the shark for many viewers, as it ignored previous plot developments, and \"all\" characterization up to that point. If you've seen a lot of harems, you'll know the main guy always has an otaku sidekick to make him look good by comparison. Ever wanted to know what would happen if that idiot otaku ended up being the lead in a show? Well, Overrun gives you the chance to find out in episode 6. I've gotta admit: that otaku's got guts. He literally wastes millions of dollars and still manages to troll everyone. The worst of these fillers was easily 7, which is the season finale of some super robot series. Here, Overrun subverts like no one has ever subverted before. The episode is not a parody, it is played completely straight. There is no humor, it is a completely different series featuring Mayoi Neko's characters, and it's absolutely boring. And then 8 is an episode of Saki. The final four episodes return to the main storyline, but even then: one of them doesn't feature half the cast, and two more juggle the generic school athletic competition plot. The series starts off promisingly, then proceeds to waste just enough time to make sure we don't see the fruits of that progress by the end. It's a shame because by the time the story comes back around, there are quite a few nice, sentimental moments that make you wish it went a bit further. \\n\\n\r\nThe technical side of things is a mixed bag as well. In the visual department, the character designs (both male and female) are quite nice to look at. The artwork manages to keep a consistent style across all of the characters. For once, a series finally decides to give characters eye colors that don't match their hair; this complimentary coloring for the female leads is especially nice. Still, with the show constantly cycling through staff, the art suffers from notable inconsistencies across the series. Episode 1 has thinner lining and more shapely clothing, episode 5 has more angular faces and emotive shading, etc. A few episodes (4 & 6) have a lot of off-models, though some may have been deliberate (though it's contested whether it was worth it). For the most part, the art survived the episode transitions better than the storytelling did. The animation is below average and never really on par with the art, but being a comedy series, it doesn't really need to be.\\n\\n\r\nOn the sound side: the voice acting is serviceable but as the actors are voicing archetypes, it never goes anywhere beyond the range you'd expect. The OP song is average J-pop but the lyrics really have no rhythm and seem rushed all the way through. On the other hand, the ED has a tropical ring to it and actually sounds quite nice. What background music is present is usually done well. The problem is that there simply isn't enough of it. Entire scenes and large portions of the episodes are completely silent with no music at all. Sometimes it successfully contributes to the atmosphere, but sometimes the lack of music makes unfunny scenes even less funny. Still, the recurring piano theme played during all of the emotional scenes is commendable.\\n\\n\r\nMy biggest disappointment with Mayoi Neko is that AIC basically sacrificed  the actual adaptation to create a display booth for the talent of the various directors involved. While it may have not been a big deal with just any harem, Overrun seemed to have started off doing just enough differently from the rest of the pack to make me think the show had some potential. The fact that it's based on a light novel series and not the usual ero-manga, and a popular one at that, adds to this notion. If that weren't enough, the more faithful manga adaptation has received near unanimous praise. If you can forgive its faults, there are a lot of nice emotional beats that make it a decent recommendation for sentimental rom-com fans. Otherwise, it's strictly for harem watchers and trainwreck gazers. There is simply no excuse for a show to have so much filler when it has a short run time and a wealth of material to adapt. It feels like I've watched a four or five episode show when the series was slated for twelve. I shouldn't ever feel like that.\\n\\n\r\nEDIT: The Railgun maids get a 10.",
            "date": "2010-07-23T22:42:00+00:00",
            "helpful_count": 86,
            "mal_id": 28823,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AuroraFlame",
                "username": "AuroraFlame"
            },
            "url": "https://myanimelist.net/reviews.php?id=28823"
        },
        {
            "content": "In short this show is a disaster. Well, the first three episodes were sweet and I actually enjoyed them. At that time Mayoi Neko Overrun! seemed like a typical harem with a good character development. I was even thinking that Overrun is worthy of eight points, no kidding. But then the randomness came.\r\nY’know, randomness is not really equal to bad quality. Take a look at Galaxy Angel — that show is so damn random but it’s hilarious. It has good humorous episodes and equally good dramatic episodes in stock. But sadly I’m not here to speak about Galaxy Angel, I have Overrun to review. Thusafter three episodes of enjoyable story I got some stupid fanservice stuff, overblown instant drama, surrealistic comedy wannabe and so on… What the hell was going here? Did this show get flu or something? Overrun was trembling with fever between various plot bases. It looked to me that each episode was done by its own team of creators, and those teams never got a chance to talk and share ideas with each other. Judging by the giant list of Overrun’s episode directors here on MyAnimeList, I presume that I was right.\\n\\n\r\nAh, I especially want to talk about the culmination, the zenith of all that randomness: the mecha episode, which was 7th if I’m not mistaken. The episodes from 4th to 6th already were fillers, but the mecha surpassed all my expectations. At first I thought that it’s going to be a parody of genre, but nope, the creators just took the character design from Overrun and merged it into some stereotypical mecha plot. They made the 26th episode of Grand Braver, a fictional anime series which some of Overrun characters watched. Well, I’m not against such spin-offs. Have you seen Kujibiki Unbalance OVA? Damn, that was fun. But again, here the creators didn’t even try. It’s a straight-forward last episode of a mecha show. Since you don’t have a clue what happened before, so there’s no deep plot, and you absolutely have no jokes to laugh at. Personally I’m not a mecha fan, so the Grand Braver was extremely boring. I watched this for about 3 hours, constantly pausing it and going to kitchen to make another cup of coffee or grab more snacks. No, seriously, I was about to drop Overrun but couldn’t. Sadly I’m a faggot, so I never drop anything. Sigh.\\n\\n\r\nIt got better after the mecha but that’s just because you can’t do anything worse than that. Overrun never returned to the level of its beginning. Oh, and the last episode was a recap. So nice of them to remind me of all the horror I went through.\\n\\n\r\nBecause of all those problems we have absolutely no character elaboration in this show. They’re just doing all the director wants them. Tsuzuki, the male lead, can be a borderline otaku freak or some dude who don’t give a thing about what happens around him; Umenomori ranges from spoiled whiny brat to depressed lonely girl; Kiriya switches from just strange and introverted type to gloomy and dispirited one for no apparent reason… Only three of regular cast are somewhat stable: Serizawa, residential tsundere, the otaku Kikuchi and that other guy, but he’s just furniture so he has no personality at all.\\n\\n\r\nBy the way, let me put something straight. AIC decided to do 13-episode anime and had 8 volumes of ranobe to work with. So why did we get so filleresque  show, huh? I can’t believe that ranobe can have a plot so retarded. If there are any people here who read them, I want to know what they really consist of, so I beg of you to tell me.\\n\\n\r\nBut okay, enough with the plot. Maybe Overrun has some strong sides on technical plane? Well, the artwork is decent, the music… Erm… There was music, right? I guess it’s decent too, since I can’t remember anything good or bad about it. So no luck here either.\\n\\n\r\nAnd thus it’s time to wrap up. Overrun is overrun with fillers, plot stupidity, clichés and lacks any noticeable good aspects except the beginning. I can recommend you to watch it only if you’re masochist.\\n\\n\r\nSo at last, Overrun, here is your 5 points and sayōnara! Even the power of Umenomori zaibatsu was not enough to make you enjoyable. Hm, wait, maybe I should check my bank account or something…\\n\\n\r\nP.S. For this season I picked up Mayoi Neko Overrun! (with exclamation mark), Angel Beats! (with exclamation mark again) and K-ON!! (with two exclamation marks). I think it is a really good marketing move to make the viewer uncomfortable with all those titles constantly shouting at him.",
            "date": "2010-07-05T14:50:00+00:00",
            "helpful_count": 78,
            "mal_id": 28012,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/201858.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/KatayokuTsuneki",
                "username": "KatayokuTsuneki"
            },
            "url": "https://myanimelist.net/reviews.php?id=28012"
        },
        {
            "content": "This anime, as of the third episode, is a shameless fanservice anime that throws in dozens of nerd fetishes into one strange pot.  The characters are mostly uninteresting because they are all blatant stereotypes we've all see before.\r\nThere's a cat girl, two tsundare girls, the slob, an otaku dude, yada, yada etc.  \r\nTruly a forgettable show.",
            "date": "2010-04-23T11:16:00+00:00",
            "helpful_count": 66,
            "mal_id": 25358,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 0,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/loup456fatman",
                "username": "loup456fatman"
            },
            "url": "https://myanimelist.net/reviews.php?id=25358"
        },
        {
            "content": "Story\r\nIt's not a great story, you will not have a complex story on this one so if you care about story on a comedy anime then this is not for you. The story revolves on a mysterious girl that acts like a cat or it might really be a catgirl they don't really explain why she is like that and she meets this guy Takumi who was an orphan and convince her to live with him and her ''sister'' who adopted him and basically is about their daily life and comedy.\r\nArt & Animation\r\nThe art style is very good, I liked how well animated this wasand it was consistent every episode, the characters design were very good. \\n\\n\r\nSound\\n\r\nThe sound was very good in every aspect, voice acting, i loved the OP, i never skipped the OP.\\n\\n\r\nCharacter\\n\r\nI liked every character but they could have developed the catgirl, I liked Fumino it was too tsundere though but they were funny, they will make you laugh every episode, this is why i liked them, but i still don't know nothing about the catgirl Nozomi.\\n\\n\r\nEnjoyment\\n\r\nI Had a fair enjoyment out of this.",
            "date": "2015-08-03T12:59:00+00:00",
            "helpful_count": 29,
            "mal_id": 195085,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195085"
        },
        {
            "content": "Mayoi Neko Overrun- Just like a Benz car, great at first, and then 2 months in it's the biggest mistake you've ever made.\r\nJust like anyone else, I read the reviews for this anime and of course everyone says it's horrible. But of course, just like everyone, I couldn't resist the great introduction, and the cute pictures and characters so I watched it.\r\nActually at first I it was pretty good, the story with the main character being an orphan etc. etc. and at that moment I was like WTF if everyone talking about? this anime is great! great art and story!\r\nWARNING- DON\"T BE DECEIVED this animeis a disaster after like episode 3, it just seems like filler. There is no story to it, it's not even funny anymore, and all the characters are so very repetitive. From this point on, the ONLY THING that was good was the art.\\n\\n\r\nOverall this anime would be amazing if you just watch the first 3 episodes, or studying animation (doubt it). If not, stay away from this it's a horribly, terrible anime.",
            "date": "2011-01-11T18:06:00+00:00",
            "helpful_count": 14,
            "mal_id": 33672,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/433107.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karxes",
                "username": "Karxes"
            },
            "url": "https://myanimelist.net/reviews.php?id=33672"
        },
        {
            "content": "This is my first review Ever! so dont kill me if i fail or if you dont agree!\r\n My first thought to this anime was \" oooo cute looking girls, cat girl, one boy, and jealousy, just your typical normal harem show............Heo yeah i was wrong. this show was plot less and and showed almost no sign of harem-ism. the first three episode looked good with all the love, jealousy, and heart breaking stuff but through episode 5-11 (episode 9= exception)  it was nothing but random shat and crap. i mean come on, its close to the end of the series and its stillshowing randomness\\n\\n\r\nThis anime taught me not all is handy dandy when you see cute girls ----Disapointment",
            "date": "2010-06-17T01:02:00+00:00",
            "helpful_count": 12,
            "mal_id": 27247,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97060.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/vietazn303",
                "username": "vietazn303"
            },
            "url": "https://myanimelist.net/reviews.php?id=27247"
        },
        {
            "content": "'Mayoi Neko (Stray Cats) Overrun!' is a harem comedy mainly about one guy and three girls in a cake shop called \"Stray Cats\". The owner of the shop is a tennen (\"natural boke\", someone who has zero common sense) woman who likes to find stray cats and sometimes kids, and provide them shelter in the shop. Our protagonist Tsuzuki Takumi is one of those human stray cats, and the story begins with the arrival of the second human stray cat, Kiriya Nozomi.\r\nSTORY: 6/10\r\nPretty common setting with plenty of parodies.\r\nAs far as I can tell, only first and last three episodes were the main story withKiriya Nozomi as central focus, despite all the episode titles were about her.\\n\\n\r\nJust as with the animation, there was a different director for each episode. It seems like they were given the freedom to do whatever the hell they wanted to do with filler episodes from ep 4 to 9, and that's exactly what they seemed to have done.\\n\\n\r\nEpisode 4: Possible 'FMP Fumoffu' onsen parody with a sudden parody of Ping Pong (2002) movie?\\n\r\nEpisode 5: Went for character development with fan service.\\n\r\nEpisode 6: Entire episode on a PV shoot, reminds me of 'Haruhi' movie shooting episode.\\n\r\nEpisode 7: Entire episode on mecha parodies.\\n\r\nEpisode 8: Entire episode on a custom Jenga game.\\n\r\nEpisode 9: Went for straight romance drama.\\n\\n\r\nWhether it worked or not is up for debate, but they all had great slapstick pacing, and I personally found the noticeable difference in direction to be quite entertaining.\\n\\n\r\nFinal episode was a recap of the series, which is pretty rare nowadays. The commentary was pretty funny, and I think it represents the freedom in production of this series very well (since it shows that they were given total freedom even the series composition stage).\\n\\n\\n\r\nANIMATION: 8/10\\n\r\nNotice the animation director and the production studio for animation work assistance is different for every single episode.\\n\r\nAnimation quality varied by episode, like episode 1 (Studio Comet) and episode 8 (Sunrise) were significantly better than the rest, but generally above average for harem comedy series.\\n\\n\r\nCharacter design was decent, with big-eyed attractive girls and signature features (cat ear hair, red cross-patterned ribbons etc) and comments. Despite great influence by animation director and work assistance, character animation consistency was better than average, with exception to episode 11 (Studio Blanc.), which had distinctly different drawing style that I think worked pretty well.\\n\\n\r\nYou can tell none of the animation directors and studios wanted to be seen as a slacker (less deadline rush probably helped too), and we are treated to quality animation with subtle difference in style for every single episode, which I found to be very fun to watch.\\n\\n\\n\r\nSOUND: 7/10\\n\r\nVoice acting was very strong, especially for Serizawa Fumino and Kikuchi Ieyasu. Filled with emotion and highly motivated seiyuu staff.\\n\\n\r\nBGM was unremarkable, but that is expected for harem comedy series.\\n\\n\r\nOP/ED were extremely weak seiyuu songs. I can kind of imagine a bunch of NEETs dancing otagei to it. Three \"special EDs\" for episodes 6, 7, 11 were somewhat interesting though.\\n\\n\\n\r\nCHARACTER: 7/10\\n\r\nPicking a girl for the indecisive protagonist sure is difficult for this series. We have Nozomi, who's a tennen cat girl who's good at everything and goes along with everything. Then Fumino, a tsundere childhood friend (i.e. the \"invincible character\" if this was 'eroge'). Finally Umenomori Chise, a super -pushy billionaire lolita. I have to say I liked the balance with tsundere and pushy loli fighting for the guy with tennen as a mediator.\\n\\n\r\nYes, we have a lot of stereotypical character personalities here, but they're all so off-the-chart in each characteristics (like tsundere so much that Fumino always means the opposite) actually made very interesting story developments possible, though they do get a bit annoying after a while.\\n\\n\r\nCharacter development is not really expected in a slapstick series like this, but Fumino did start expressing her feelings, and Nozomi's gradual realization of friendship and family was depicted very well.\\n\\n\\n\r\nENJOYMENT: 9/10\\n\r\nI personally liked the characters, and thought there were couple of really funny episodes. Just like Haruhi 2009's \"∞8\", most of the watch value was in subtle difference in animation styles and in this case, different director for each episode too.\\n\\n\r\nThe original setting and story may be unoriginal, but there was abundance of creativity in production stage of this series made possible by one-episode-only staff and teams. Changing animation style, good pacing, hilarious gags, constant fan service, repetitive violent retribution, great directions.\\n\\n\r\nIt's in a crappy genre where you can't expect any story, character development or value to begin with, but there was some of each in this series.\\n\r\nAs far as watch-and-forget comedy goes, this is as good as it gets. 'Mayoi Neko Overrun!' was hands-down the best comedy of the season for me since all other comedies this season were plagued with horrible pacing and letdowns.",
            "date": "2010-06-30T09:28:00+00:00",
            "helpful_count": 12,
            "mal_id": 27804,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/321412.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/8thSin",
                "username": "8thSin"
            },
            "url": "https://myanimelist.net/reviews.php?id=27804"
        },
        {
            "content": "If Mayoi Neko Overrun! was an anime meant solely for humour, it might have recieved a higher rating, as there are times when it really excels in that area, thanks to its inventiveness of situations and some clever use of character animation. However MNO is catagorically meant to be an anime based on romance as well, which means at some point the humour has to back off a little to allow the romantic part of the story to progress.\r\nTo be fair MNO does open up in reassuring fashion, conveying all the romantic gestures you'd expect from a romance-based anime, and it almost succeeds in pullingsome emotional heartstrings while stirring some deep curiosity in the personalities of the key characters. However, beyond episode 3, the promising plot disintegrates, and eventually to the point where it fails to even develop the hidden romance between the two main characters.\\n\\n\r\nThe random style of some episodes is a nice diversion from what is otherwise a plot with as much depth as a sheet of tracing paper; it just never seems to address any meaningful conclusion, goal, or resolution regarding the relationship between a passive Takumi and a pretentious Fumino... surely a dissapointment for romantics. For that matter you might as well focus as much attention on the other characters, since their storylines have about the same depth as the main two characters.\\n\\n\r\nHaving said that, MNO is by no means detestable - throughout the anime the characters remain somewhat likeable, thanks in no small part to the charming and high quality art, along with the usual winning (abeit cliched) anime poses you'd expect to see in harem type anime. Loosen your focus on the main characters and avoid trying to follow a goaless story here, and MNO is an enjoyable enough anime at least to pass the time on a rainy weekend.",
            "date": "2011-01-28T05:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 34089,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Neuko",
                "username": "Neuko"
            },
            "url": "https://myanimelist.net/reviews.php?id=34089"
        },
        {
            "content": "Mayoi Neko Overrun is basically 12 anime in 1 anime. It has a different episode director, animation director and key animation every episode. How does it matters?\r\nIt actually doesn't matter. If you are one of those who hate \"generic\" otaku anime, PLEASE DON'T WATCH THIS ANIME. It has everything you don't want to have in it, like tsundere, dense MC, harem, fan-services. If you get bothered by the major premise, there is no way you can enjoy the minor staff.\r\nBut if you are one of those who actually appreciate and enjoy school harem anime, Mayoi Neko Overrun! will definitely be a refreshing and rare watchingexperience for you, since there are 12 different styles of presentation. You don't see anime do this that often, especially in the harem category. Hope that you can match up with the \"Denpa\" comedy. That's how most of the anime by AIC works, just like Sora no Otoshimono, Oreimo, Haganai. They bear the weight of being entertainment gearing towards male otaku audience, but they still putting a lot of effort in the meticulous matters (that actually majority of the watchers do not cares, they don't even notice, Oreimo is the biggest example).\\n\\n\r\nStory: 6\\n\r\nThe overall flow of anime feels like Kotoura-san (another anime by AIC), 3 episodes of story, Slice of life for the middle episodes, then get back to telling story near the end of the anime. This pace changing is not very viewer-friendly and got a lot of complain in Kotoura-san, but it works out well here. \\n\r\nStory is fair, actually the worse part of this anime is the story. I mean the first 2 episodes. \\n\r\nThe middle part is where this anime shine. It is fair to say that the Mayoi Neko Overun! starts at episode 4.\\n\r\nThe general feeling of the story is heartwarming, just like every other work by Matsu Tomohiro (R.I.P.), its original creator. \\n\\n\r\nArt\\n\r\nArt is pretty good. The 12 different styles of presentation already provide enough things for you to pay attention to. The occasional 3D animation is great, especially in the episodes preview where we get 3D maids. \\n\\n\r\nSound\\n\r\nIt has an incredible voice acting cast. If you are a fan of Japanese voice actors, you sure would know how big that cast is and you would probably enjoy the anime just by listening to the seiyuu's performance. \\n\r\nThey do put some effort in their opening and ending too, just standard AIC things. Not on Oreimo or Heaven's lost property level where you get a new ed every episodes. But you can expect there may be different ed in a few of the episodes. If you are one of those who skip everything then it doesn't matter. \\n\r\nIn episode 4 there are some very funny use of background noises and bgm, you can pay some extra attention to it.\\n\\n\r\nCharacters \\n\r\nJust the characters you can expect from a harem anime. It's a cute and fun cast and so it's great. As much as I admire originality, there is no need to blindly search for originality in every aspect of a show. \\n\r\nKiriya Nozomi has a very cute and interesting design. I will not be surprised if Mashiro Shiina's design is inspired by her. Since Mayoi Neko Overrun is actually quite popular in Japan back in 2010. If I recall correctly the BD sales at first release is around 4500 which is well above average.\\n\\n\r\nEnjoyment\\n\r\nComedies are more towards random or slap stick comedies, Baka to test/ Inu to Hasami wa Tsukaiyou's style. Keep it in mind that you're watching a comedy then it would be enjoyable. In other words, if you know how to have fun, you'll enjoy it. I know it sounds stupid but you'll understand what I mean if you are a patron for these light novel comedies. \\n\r\nThere are a lot of fanservices too, and I like it.\\n\\n\r\nOverall \\n\r\nI usually rate any anime that I thoroughly enjoy a 10, but I can only give it a 9 here because to be honest I don't enjoy the first 2 episodes very much. \\n\\n\r\nAnother thing to keep in mind is that I'm like the perfect target audience of this anime. If you don't care about seiyuu or don't like school harem romcom, fan-services and all the other staff I mentioned, I expect the rating would be a lot lower for you.",
            "date": "2018-03-07T07:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 273269,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6432186.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nbyung09",
                "username": "nbyung09"
            },
            "url": "https://myanimelist.net/reviews.php?id=273269"
        },
        {
            "content": "(I'm not very good with reviews but I'll try my best here)\r\nI was going to write the review at the end of the series but since it looks like a recap episode so I'll push the review to this week\r\nStory - 5/10\r\nI'll be generous here.  The one big problem I found with this anime is that it does not have a consistent plot (there was a plot but it was in and out).  Every episode in the middle of the series went off on a story of their own and they all felt like fillers.  From what I can remember this animewas supposed to be a romantic comedy which I have no problem with, but I would actually like a little development each episode!  The ending however was actually quite decent because it went back to a plot point which they had in the beginning, orphans who are happy because of the \"family\" they create with each other.  Although the story messed up in tons of places, I think the ending was good enough to prevent from giving it a lower rating.\\n\\n\r\nArt -8/10\\n\r\nI really have no complaints with this area, the animations looked fluent and although I've seen better artwork I thought this one was alright.\\n\\n\r\nSounds- 8/10\\n\r\nAnother area which I have no complaints about. It had an interesting opening song which I think a person would either hate or love, I personally loved it.  The background music was used at the appropriate times and the voice acting was alright.\\n\\n\r\nCharacter- 8/10\\n\r\nA lot of the characters seem average in this anime with the exception of Fumino, who really stood out to me.  Fumino is not your ordinary Tsundere, I really can't explain what it is but she is different from the ordinary Tsundere (in a good way) and perhaps was one of the few good things the anime offered.  One problem I had is that there wasn't enough focus on Nozomi  which wouldn't be a problem if this anime wasn't named Mayoi Neko Overrun.  She did get a lot of focus towards the end but that was too little too late.\\n\\n\r\nEnjoyment- 6/10\\n\r\nI really enjoyed the first 3 episodes and I found the last 2 alright, which leaves the middle episodes.  There were one or two episodes in the middle that advanced plot which I enjoyed but the rest I really couldn't stand.  All those fillers that they put in really weren't funny with me only occasionally chuckling.  I really don't know what happened, did they run out of ideas? \\n\\n\r\nOverall- 6/10\\n\r\nOverall I really wouldn't want to recommend this anime to anyone.  It's a shame really because I really liked what they were going for in the beginning and I thought that this anime had potential to become something amazing but it fell well short of what I and many hoped for and it ends up as another let down.\\n\\n",
            "date": "2010-06-25T17:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 27570,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=27570"
        },
        {
            "content": "From what I've read from other reviews, I'd probably agree with them in certain ways when they say that this anime doesn't make any heads or tails in it, you might think it's a usual harem type of genre but it kind goes from one point to the next, you really can't figure out as to whom the male character connects with. But still, it is decent enough to be watched because what it lacks in plot makes  up with couple of good slap-stick  comedy, As for the art of this anime, I find it very good because it kinda look like atypical manga that has come alive, never mind if there are some differences between the two. The characters, well, I'm focusing on the schools uniform for girls. I like the way that it matches with the female characters  especially when it's Fumino who's wearing it, her long black socks really accentuate her very well, as if the two are mend for each other (the girls uniform and the long black socks), I also find Othome very attractive in a bikini, the way she's drawn really makes her versatile to wear any of the characters clothing from her everyday get up to her work clothes, she'll probably look good wearing the school uniform  or one of Chise's maid's uniform or in some rare cases be in the nude. The bike shorts in the last 2 episodes of the anime really does give the girls (most of them that is) that professional sporty look, since the bloomers kinda makes things too ordinary even if it's sexier that the bike shorts. So, even if this anime has it's share of twist and turns that you can't seem to make of, it is still decent enough to be watched so I give it a rating of 4. \\n\\n\\n\r\nTrivia: \\n\\n\r\nBike shorts or spats (as they were called in the anime) were first made up of black knit wool before being made out of spandex.\\n\\n\r\nBloomers (as they were also called in the anime) are also called Boyshots.",
            "date": "2010-11-21T12:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 32223,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/362801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Mugen900",
                "username": "Mugen900"
            },
            "url": "https://myanimelist.net/reviews.php?id=32223"
        },
        {
            "content": "Having no specific antagonism to harem anime, I found that this show starts out looking like it might be worth watching. Unfortunately, nothing improves from there. The show doesn't even pick a direction to go. Instead of looking like it will do something worthwhile it turns into \"The Random, Bizarre, Contrived, Episode-long Nonsense that Utterly Fails to be Funny or Otherwise Entertaining Show.\"",
            "date": "2011-11-07T08:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 47027,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/639163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/colonelpanic",
                "username": "colonelpanic"
            },
            "url": "https://myanimelist.net/reviews.php?id=47027"
        },
        {
            "content": "Never judge an anime based on it's name and cover image. This is a good example.\r\nTakumi Tsuzuki, a boy abandoned in his infant years, adopted by very caring sister named Otome. He lives his life with Fumino Serizawa, someone was also abandoned in her childhood, both work in a pastery shop and go to school. \r\nEventually, Otome picks up this girl with a hair style similar to cat ears and has a tendency to say \"Nyaa\". Her name is Nozomi Kiriya and not much is known about her except her name. They find she is also an abandoned person. The story progresses as they learnmore onto this mysterious person. Joining them is a little girl named Chise Umenomori putting them in strange situtations.\\n\\n\r\nTerms of animation and sound, it is one of the best I've seen this season.\\n\\n\r\nStill, it is too early for a complete review but so far this is recommended.",
            "date": "2010-04-22T08:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 25311,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/R2J",
                "username": "R2J"
            },
            "url": "https://myanimelist.net/reviews.php?id=25311"
        },
        {
            "content": "Takumi is just your average nice guy who has two beautiful girls fighting for his affection; one is his childhood friend who has a short temper and the others a spoiled rich girl. Things get crazier though when a mysterious third girl who acts just like a cat enters the fray and wacky adventures ensue. Yeah, so basically it's just like any other ecchi comedy. \r\nStory 4/10\r\nEvery episode has our characters going on a different adventure whether it's going to the hot springs or going to the beach. However, the biggest problem I have with this anime is the lack of comedy; what makes otherecchi/harem anime so great is how funny the characters are, but these characters just aren't that funny. For example, an episode where the characters go to the beach has a lot of potential, but instead they just do everything people normally do when they go to the beach. \\n\\n\r\nI think the writers believe fan-service and comedy are the same thing, they aren't, they're completely different. Flashing a girls panties is not a joke, showing bouncy boobs is not a joke, it's sexy, but it isn't funny. \\n\\n\r\nThe show does have some good jokes (guy sees girls panties, girl punches guy is always funny), but the jokes are too far apart and too few. Sometimes, while I'm watching an episode, I'll be asking myself \"where's the next joke?\" \\n\\n\r\nCharacters 6/10\\n\r\nUmenomori: Umenomori is the rich girl who can make almost anything happen (no matter how impossible) using the power of money. She provides the set-up for a lot of the characters adventures, but my biggest complaint with Umenomori is she isn't that funny. I feel like all the jokes are coming from the other characters like Fumino and Takumi. \\n\\n\r\nFumino: Fumino is Takumi's childhood friend who has a short temper and always says the opposite of what she means. I always love tsunderes so naturally whenever Fumino punched out Takumi or got red in the face I laughed, but my problem with Fumino is the romance between her and Takumi feels so forced. Also, I'm so sick of this cliche where the girl loves the guy, but doesn't say anything so there's just this awkward tension between them, and that comes up a lot in this anime. \\n\\n\r\nNozomi: Nozomi is the cute innocent girl that acts like a cat by saying meow a lot and having hair that makes it look like she has cat ears. Yeah, that whole cat-act Nozomi does was cute at first, but after while it gets really annoying. STOP saying meow, talk NORMAL. Furthermore, other than looking cute, Nozomi does nothing except act more like a cat. Oh, and it is never explained why she acts like a cat to begin with. \\n\\n\r\nOtome: Otome is the big boobed owner of the bakery where the characters all work. Otome is a really funny and likeable character, but she's never around. \\n\\n\r\nSatou & Suzuki: Satou & Suzuki are Umenomori's two maids and my favorite characters. I know that sounds weird since they're mostly in the background and barely say anything, but they are both just so adorable and I love every joke they make with them. \\n\\n\r\nOverall 5/10\\n\r\nI enjoyed watching this anime because it did have a few funny jokes in each episode, but I don't really like the characters and there needs to be more jokes. Furthermore, the romance feels so forced and Takumi is such a boring main character. I'd recommend something like Girls Bravo or Heaven's Lost Property over this.",
            "date": "2017-01-16T23:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 238470,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3238983.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/middleground4471",
                "username": "middleground4471"
            },
            "url": "https://myanimelist.net/reviews.php?id=238470"
        },
        {
            "content": "Short review\r\n[Up to ep 8, altho I skipped middle part of ep8, will update again aft watching ep 8 in full]\r\nOk, this anime reminds me a lot of Baka to Test to ??. First they start with some interesting scenes introducing characters, then after a few eps you have endless plotless, comedy, ecchi annd fanservice eps. Yep, up to ep 8 it's still ongoing, go look at forums- ep discussion. Lots of ppl are dropping it aft ep8, 4 eps left, what can we expect anyways?\r\nStory:3\r\nWhat can I say? The anime started off with a touching story of inter-dependence and friendship but after the firstfew eps it became horrendously random. To the end of ep 6 there is only minimal character development and some earlier unique characteristics of characters and plot seem blown away suddenly. Till 8 there are a lot of parodies featured, starting to feel like Seitokai ?? ??, the parody show. It;s still ok if the individual eps have good storyline , even as fillers. But they do not have anything commendable at all. Except sound and art, and enjoyment for some.\\n\\n\r\nThe only hope left is its future eps. Left 3, any hopes? Nope, for me.\\n\\n\r\nArt:7\\n\r\nIt's not bad, but even with special effects all seem very 2D. the colours used were pleasing to the eye but not spectacular. Character designs were decent.\\n\\n\r\nSound:7\\n\r\nBoth OP and ED were special, and sounds effects were ok. Voice acting was quite good for the girls.\\n\\n\r\nCharacter:3\\n\r\nNice introduction of characters but bad follow-up. Plus characters sometimes change personalities a little, esp during filler eps. Character development is quite little esp for Takumi.\\n\\n\r\nWith so much filler eps showing little or no unique personalities of the characters, other than the most obvious ones, and hardly any surprises or development, the characters went stagnant. That is still ok, PROBLEM IS that in some eps the characters changed personalities. This is bad... very bad. Take ep 7 for an example, our main protagonist Takumi turned evil along with his 2 male buddies.\\n\\n\r\nI cut this score from 6 to 3, from ep 6 to 8. So, be warned.\\n\\n\r\nEnjoyment:7\\n\r\nDepends on your type of humour. Some parts were ridiculously funny and some comedy presented were literally out of this world. Up to ep 6 that is. Ep 7 and 8 was a turn-off for most of the community.\\n\\n\r\nOverall:6\\n\r\nMy main purpose of watching this series is enjoyment and seeing if the original storyline presented would be continued. And you might like this if you like Baka to Test to Shoukanjuu.\\n\\n\r\nBtw this series changes directors every ep. Wonder what AIC, the production studio has against the original creator (and pretty much the rest of the staff).",
            "date": "2010-05-13T06:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 26011,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=26011"
        },
        {
            "content": "(Bear in mind this is my first review)\r\nThis show, I can't finish watching. It is just that dreadful. I watched up to episode 5, and gave up. There are many different things that make it appalling, as I will write in this review.\r\nStory: 2\r\nThe story jumps around a lot. One episode they're at school, the next, they're in some random mountains. Usually, I like shows that are random and spontaneous, but this one just doesn't fit the bill. I also noticed they reused a lot of animations, and they also added little fillers just to waste time.\r\nArt: 7\r\nThe art is actually pretty decent. This isthe only positive thing about the show, though.\\n\\n\r\nSound: 2\\n\r\nThe music just doesn't fit with the show. The ending theme sounds tropical. If you play tropical sounding music in a show, you would expect that the show takes place in, I don't know, somewhere tropical? They also reuse a lot of music, and in one episode in particular, they pretty much just looped the same song for about 5 minutes, not caring that it didn't suit the mood.\\n\\n\r\nCharacter: 3\\n\r\nAt the beginning, they suddenly introduce a bunch of characters without warning, and you don't even get to know what the main character's name is until quite later. The characters are also very generic. Tsundere childhood friend, Pervert best friend, ETC.\\n\\n\r\nEnjoyment: 2\\n\r\nI didn't enjoy this show much at all, because of all the flaws together. Sure, it's humor can be funny at times, but it still doesn't make up for what this show is lacking.\\n\\n\r\nOverall: 3\\n\r\nThe random story, wrong music, and sudden character introductions all bring the final score down to a 3. Sure, the art is pretty good and the comedy CAN be funny at times, but it doesn't make up for all what is wrong with this. Sure, some people could like a show like this, but I don't care for it. But hey, that's my opinion, and it is just that, an opinion.",
            "date": "2014-08-13T00:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 156373,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 2,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Waffelman83",
                "username": "Waffelman83"
            },
            "url": "https://myanimelist.net/reviews.php?id=156373"
        },
        {
            "content": "The art is... It's a thing. Yeah. That's about as positive as I'm going to get when talking about the abysmal failure that was Mayoi Neko Overrun (MNO). \r\nThere's a reason why I dropped the show, a very good reason indeed.\r\nTL;DR- It's bad.\r\nAt least other shows like Toaru Majutsu no Index Season 2 (TMI S2) had half decent music, and a genuine plot to follow which this show ALMOST had as well which ultimately ended up botched due to the fact the semi-unique premise turned into generic harem #54 somehow. I actually wonder how that was even accomplished, but it's whatever. \r\nThe show is bad.Wait I already said that. Well it's bad. If anyone is actually reading this, that's very clear to understand based on my ratings and shit. (Are swear words allowed in MAL reviews? Eh. Whatever.)\\n\r\nWhile I feel the show doesn't even deserve an explanation as to why it's considered doggie dookie in my opinion, it would be extremely improper to not explain myself at the very least.\\n\r\nAs I've previously mentioned, they (an in-descriptive term I'll use to refer to whatever studio produced this garbage) had something going for them. This could have been good. But instead of focusing on character growth through means of the aforementioned \"interesting premise\" which was completely doable, instead they insinuated how much the main female leads wanted the main male leads' dick. BOTH main female leads. Along with the side characters, whom were about as prop-like and un-likable as sand paper. Dunno why sand paper was the analogy I chose to use there, but it felt right. \\n\r\nActually, allow me to take back what I said; the show DOES manage to do one thing, and that is to turn on the 11 year old weebs with poor tastes in anime. Yep, I'm going there. Mr. Elitist here to ruin the fun.\\n\r\nBut come on, you know it's true. \\n\r\nNow here's the thing: I'm a lazy person. I could sit here and go through ever reason as to why I hate this show as much as I do, but due to the fact I've already burnt through most of the hatred fuel I had at the start of this \"review\", I kind of just wanna stop and watch other things. So instead of elaborating on my oh so elegant opinions of MNO, I'm gonna end it here.\\n\r\nActually nah, I'll quickly go through some other things but don't expect a paragraph of info, ok?\\n\r\nThe art is mediocre, and because the studio which produced the show has some money it isn't garbage. Big eyes, big boobs and disproportionate hands are all you need to make anime, really. \\n\r\nThe music is equal to elevator music in terms of scene setting and immersion into the show.\\n\r\nThe characters are empty cardboard boxes, except for the main ones, they're more cardboard boxes with homeless people in them.\\n\r\nK I'm done now. \\n\r\nI don't like this show. It's bad.",
            "date": "2017-12-28T23:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 266716,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4642040.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/AnimeAndApples",
                "username": "AnimeAndApples"
            },
            "url": "https://myanimelist.net/reviews.php?id=266716"
        },
        {
            "content": "The anime is centered around \"Tsuzuki Takumi\", and the main characters are introduced during the first three episodes (Takumi is the only male main character). \r\nSerizawa Fumino (Takumi's Childhood friend), Kiriya Nozomi (a \"stray cat-girl\"), and Unemori Chise are the main characters, which are introduced in the first two episodes. All three commonly have contradicting opinions and actions, and Unemori Chise gets in quarrels with Fumino quite often. It becomes apparent that the 3 of them fall for Takumi by the end of the first season, for the kindness and way he is (Season 2 is guaranteed, based on Manga to Anime comparisons).\r\nThe dialogue isvery humorous, and the situations that Takumi is put in because of the three females makes you chuckle, regardless of how well you can suppress it. The scenes amplify the effect, since Mayoi Neko Overrun is an ecchi type anime. Episode 4 contains the most embarrassing scenes for the characters, and the way it is shown really makes you laugh. \\n\\n\r\nNo real battles, similar to the anime Spice and Wolf, but with a Cat-Girl rather than a Wolf-Girl (although the main character describes Fumiyo, his childhood friend, as a Wolf). \\n\\n\r\nAnimations are decent, could be slightly smoother and less... artifact-filled, and they could have extended the amount of time it took to go through the Season. Episodes 1-3 seem okay, as they are all for getting to know all the main characters, but it begins to feel rushed and compressed from the Manga afterwards. The main problems would be in the anime progression. The first three episodes were good. After that though, everything seems to go a bit off-topic. Randomness is very high, and you could begin to question why it was written this way.\\n\\n\r\nThe sound and art would be the strongest points of the anime, in my opinion, but they could have used certain soundtracks for different scenes, as I feel that some of them aren't exactly appropriate for the scenes. Animation is smooth, but you can notice that they cut some corners around the last few episodes.\\n\\n\r\nOverall, I rate it 8 out of 10. The concept, artwork, and sound are good, but the execution of the plot/storyline was not great at all. Suggested for comedy fans.",
            "date": "2010-10-19T19:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 31470,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/348635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xHikaruSora",
                "username": "xHikaruSora"
            },
            "url": "https://myanimelist.net/reviews.php?id=31470"
        },
        {
            "content": "Being one of my first reviews i hope this helps,\r\nThis show focuses on comedy and not enough development of the characters. I would really have liked to seen takumi form some sort of secret affection for at least one of the girls. This being said it still was quite funny and is a good show to watch",
            "date": "2011-04-07T17:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 35788,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/469025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ratton21",
                "username": "Ratton21"
            },
            "url": "https://myanimelist.net/reviews.php?id=35788"
        },
        {
            "content": "This isnt your average ecchi pantsu fan service anime! IT HAS DEPTH AND PLOT... is what i wouldve said if they didnt COMPLETELY derail off course after episode 4. If what you are looking for is just oppai and pantsu, then u definitely came to the right place....\r\nMayoi Neko is like the little child that got abducted by strangers after being put through the dilemma of whether to listen to your parents about not taking candy from strangers or \"OOH BOY CANDY!\". \r\nAfter the first 4 episodes, I was convinced for the most part that I was right in picking this anime to watch forit had some depth and that family and bonds and all that good stuff was something this anime can develop on, but surely I have been proven very wrong immediately after episode 4. Every episode has less and less to do with being orphans and going through struggles, and more about fan service and love triangles or squares or whatever polygon for that matter. The series even begins to become strictly episodic and some even have absolutely nothing to do with the plot and even tries to satire other genres in the process. Not that this was why it sucked but at least do it properly.\\n\\n\r\nThe characters are shallow, the art is attractive as expected(it did get me to watch it). Music was catchy, but all of which wasnt enough for me to enjoy it. Slightly disappointed... actually... very disappointed, but it couldve been much worse.\\n\\n",
            "date": "2010-06-25T19:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 27575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/159667.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/setvenx",
                "username": "setvenx"
            },
            "url": "https://myanimelist.net/reviews.php?id=27575"
        }
    ],
    [
        {
            "content": "It wouldn't quite claim being a comedy gold, but it is up there. The humor in this anime is certainly that only a tsundre harem can provide. It's has both unique aspects and jokes that you see so much its almost expected. But it still does not fail to make you laugh.\r\nThe story is simple and humor filled. Only until toward the end does it get a bit on the feels side. still keeping a serious plot, it just manages to weaved well placed humor at the right times to make it all funny but not so funny that it's ridiculous. If you liked thestory line and humor of Baka to Test, then you will enjoy this\\n\\n\r\nArt styles is what you'd expect from standard. Simple, not too overboard with object skins and cell shading with an addition of light shades, tones and gradients where required. It is almost a text book example of 2010 anime art and animation styles.\\n\\n\r\nSound is really well done throughout the anime. besides the fact of the overused cicadas in any generic anime, it does utilize its music budget well when trying to create an atmosphere for the current scene. As for the opening and ending, the beats and tunes are good but the vocals seem out of place or off putting compared to the music.\\n\\n\r\nCharacter development is slow but satisfying as the hero and heroines all get their fair share of development as well as knowledge of their past. The storys of each one get explained on a need to know basis when the episode calls upon why they do what they do.\\n\\n\r\nOverall enjoyment is great. Humor, mild fan service every couple of episodes and added feels in the end. It really does take the romance genre as seriously as a comedy anime can at about the 8th episode mark as things really start taking place. It is well worth the watch.",
            "date": "2014-03-07T04:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 134953,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=134953"
        }
    ]
]