[
    [
        {
            "content": "For a long time, people have argued whether originality truly plays a role into the quality of a title. In any media where there is an audience and a profit to be made, it's natural for many writers and artists to take inspiration from a tried and true formula. Though they may take steps to break from the circle of homogeneity and establish their own identity, deriving elements from other successful titles is inevitable.\r\nBeing a part of the conventional genre of high school drama, Tari Tari is certainly no stranger to this pattern.\r\nThe story takes place during the final year of high school for Wakanaand her friends Sawa and Konatsu. Immediately after receiving a scolding from the strict vice principal, Konatsu decides to quit the choir club and start a new one by herself with the aid of her friends, as well as the later addition of two male characters: Taichi, a diligent badminton player, and \"Wien\", a peculiar transfer student from Austria. Of course, things don't go as smoothly for Konatsu as she was hoping they would, receiving an initially hostile reaction from Wakana who accuses her of fooling around and treating music as a game. In an attempt to show overcome her stress, Konatsu sings outdoors in public and gathers the attention of her aforementioned friends - finally assembling enough members to establish the club and push forward with her ambitions. \\n\\n\r\nOn the surface, Tari Tari seems like a standard coming of age story with a musical focus. Though the music remains a principal aspect of the anime, it primarily serves as the catalyst to bring the characters together and force them to overcome their own individual issues. For Wakana, these issues involve the regret surrounding her deceased mother, an accomplished musician who taught her how to sing and play piano. For Sawa, it involves her equestrian passions and love for horseback riding, much to the disagreement and discord with her parents. For Taichi it follows his ambition for badminton, while for Wien it is about his desire to preserve justice. \\n\\n\r\nWhile the series is focused on teenage drama, what it excels at is making each character's issue relevant and believable by using the strengths and weaknesses of the characters to evoke emotion from the viewer, instead of relying on the tired routine of melodrama. Much of the episodes focus on Wakana's previous passion for music, with her past and the relationship between her mother being explored as her story arc progresses. Her avoidance of music is given explanation and reason, while the revival of her passion feels meaningful as she comes to terms with the past and begins to see things in a new, positive light. Each question is answered and each issue is resolved, while new ones are carefully set to take their place and give reason for the viewer to be interested in subsequent episodes. A frequent problem with teenage drama in fiction has always been the reliance on trite dialogue and melodrama instead of a coherent narrative, but Tari Tari manages to feel realistic while capturing the important stage in one's life between adolescence and adulthood. The 13 episodes here have been used in a highly productive fashion which succeeds in giving each character substance. \\n\\n\r\nSadly, the same amount of detail and depth isn't given to all of the characters. Taichi in particular receives very little growth over the course of the series, resulting in his own passions and issues being seldom explored. Aside from filling the necessary role as the fifth member of the club, Taichi ultimately adds very little to the story aside from developing a romantic interest in Sawa that is only vaguely hinted towards. Other issues in the characterization come from Wien's backstory and story arc, and while he's given sufficient character development in the later episodes, the resolution is surprisingly trivial given the amount of foreshadowing earlier in the series. His childish desire to defend justice is sympathetic but the lack of consistency obstructs his story arc from wrapping up in a satisfying manner. It's fortunate that Wien himself is a unique and exciting character, being an amusing transfer student that frequently misuses and exaggerates Japanese gestures, often with comedic results. It's hard not to grow attached to him over the course of the series. \\n\\n\r\nAnother common element in Tari Tari is the presence of an antagonist: the vice principal, who strongly opposes the club for what she perceives as them simply fooling around. As with most stories, she's initially portrayed as being cold and unlikeable to build up conflict, though remarkably her character is given just as much growth and backstory as any of the main cast. By the end of the story, her cold behavior makes full sense and she herself learns to overcome her past issues as a result of another character's own growth. Rather than simply serving as a plot device, the vice principal develops into a realistic and believable as well, which makes her cooperation with the main characters during the final episode all the more significant and meaningful. \\n\\n\r\nBeing that Tari Tari is an anime focused on music, it's a bit disappointing that the quality of the music itself is nothing outstanding or noteworthy. The background music is rarely noticeable and the songs that the characters perform are all fairly juvenile and amateur, though the emotionally-driven \"Kokoro no Senritsu\" is a great addition to the soundtrack. The climactic song performed in the final episode is also well-executed, having full instrumentation to back it up and give it a more professional approach. A clever trick is also used during the ending track, with Wakana pensively sitting apart from the rest of the main cast until her passion for music is revived in the later episodes.\\n\\n\r\nThough not visually superb, Tari Tari benefits from its complex and detailed scenery which is based and modeled upon real locations. The school and the area in which the characters all live in feels very much authentic and distinctive, with impressive lighting and many dynamic camera tricks used to further accentuate the scenery. Many titles involve a high school setting but Tari Tari is one of the few that effectively build the school environment. For an anime that focuses on realistic characters, a realistic depiction of the setting is paramount, and luckily this important detail is not forgotten. The end result is an anime that looks and feels polished, with very few off-model scenes. \\n\\n\r\nTari Tari is a title that stands out not for its setting, nor its story, or even its well-developed characters. What sets it apart from the multitude of other similar titles is how it manages to synthesize all of these elements and convey a story with eloquence and reason. It exemplifies exactly how teenage drama should be conducted in a story. When so many series subscribe to the notion of \"the more crying and yelling, the better\", a title such as this is a breath of fresh air and proof of how effective this genre can be when executed efficiently. It certainly has its share of mis-steps and doesn't achieve excellence in any one aspect, but it would be hard not to recommend Tari Tari as a solid title and one of the more noteworthy in recent times. Why not cast aside the preconceptions and enjoy the ride?",
            "date": "2012-10-15T09:05:00+00:00",
            "helpful_count": 366,
            "mal_id": 75023,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=75023"
        },
        {
            "content": "The drama based on the school club is about as tried and true of an anime theme as giant robots and beach episodes.  In that case, Tari Tari certainly doesn’t break any new ground.  It doesn’t particularly do anything amazingly well or put a new spin on the genre or feature memorable characters or scenes that will stand the test of time.  But despite it all, it managed to still be a fun, fully enjoyable, and worthy investment of my time.\r\nTari Tari revolves around a group of five high schooler's who even though they all have very different goals in life doshare a common interest, music.  Singing, in particular.  They all find themselves in a newly formed club to sing together, for the joy of singing, and not under the structured rules of the other related clubs.  As expected we have plenty of drama and squabbling with the power that be as they try to crush our little upstarts at every chance.  But despite the clichéd sounding themes of the main plot it does manage to deliver an overall story that is pretty well rounded and within the realm of reality. \\n\\n\r\nProbably what Tari Tari does best is give us five believable protagonists who all struggle with their own problems, mostly typical of your average teenager on the cusp of adulthood.  They have realistic and achievable dreams and goals that I think the average viewer can relate to, unlike many of the fantastical settings most anime are based in.  Not to say this is a bad thing in all cases, I just think that it’s refreshing now and then to have more down to earth characters.  The storylines featuring Wakana and Sawa were clearly the highlight of the series, and even though some of the smaller subplots weren’t really adequately wrapped up I found myself with little to complain about overall.\\n\\n\r\nBecause it doesn’t allow itself to get buried underneath a girth of over exposed side characters, Tari Tari's cast really shines.  I would challenge anyone to find even one of the main cast that they couldn't like.  Even though the show does not really have any one character in which the story is told through, the majority is seen, not unexpectedly through our three female leads.  Mostly because of the strength of their own personal arcs, Wakana and Sawa really stand out from the rest.  In particular I found myself drawn to Wakana who has the most heart-wrenching back-story.  The whole dead parent plot device has been done to death but I felt her story was very moving and powerful.\\n\\n\r\nOf the series antagonists and side characters really only stands out, the vocal club advisor and Vice Principal Naoko Takakura.  While she is at first glance just you’re run of the mill constipated anime bitch, she has a humanity about her that makes you feel for her.  Too be honest I felt her story was just as interesting as any of the main characters, perhaps because it was also tied to Wakana's story.\\n\\n\r\nThe vocal cast features a good mix of seiyuu veterans and newcomers.   While I enjoy hearing some new voices,  it’s always nice to hear a couple of my favorites such as Saori Hayami and Ayahi Takagaki and a great deal of my overall enjoyment of Wakana’s and Sawa's characters was due to their performances.  As a show about music you would also expect a great deal of songs, which there are.   Most of these are performed by the cast.  The ED theme in particular was my favorite and never found myself growing tired of it.  The OP, sung by AiRI is a veteran of many other anime/game projects people are likely to be familiar with but this was best song I have heard from her yet.\\n\\n\r\nI loved all the character designs for the main cast, as they all had believable body types and mostly looked their ages.  Konatsu looked a tad young but a pretty minor complaint.  The backgrounds and settings were gorgeous; however some of the animation looked a little stiff and awkward (Such as Konatsu's running).  Some of the adult characters looked pretty strange and unappealing to me as well, particularly the adult characters that all had some really creepy looking lips.  It's just a style that generally does not appeal to me.\\n\\n\r\nSo despite my high rating of Tari Tari is it a really amazing anime?  No it isn't.  But it is very good.  In a year that really hasn’t featured a lot of really great shows, Tari Tari stands out as one of the years' better ones.  If you’re in the mood for light hearted school drama, you should find plenty to enjoy with this one.\\n",
            "date": "2012-09-25T17:49:00+00:00",
            "helpful_count": 131,
            "mal_id": 73295,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=73295"
        },
        {
            "content": "At first look, Tari Tari seems to be one of those animes that completely focuses on School life, that applies comedy in certain areas, with a cultural festival to wrap everything up or something. \r\nBut I was wrong Tari Tari is one of those animes where it focuses heavily on the drama of each main character, with slight comical scenes and is also a slice of life. For people who compare this to K-ON there stupid, there a completely different genre, K-ON is more comedy oriented while Tari Tari is more drama. Just because they both have music involved there not the same, you wontexactly call Code Geass similar to any of the Gundam anime just because they have mecha in....\\n\\n\r\nStory 8\\n\\n\r\nThe story is 5 high school kids forming the choir club due to the main character Konatsu unable to \"Shine\" in the music club. The main story involves around each of the main characters story providing a very nice slice of life drama that involves the characters family, individual problems or simply just friends hanging out and having fun. Although there is another main story that involves the choir club's activity and their fight against the schools music club or something along those lines. But really its just jealously.\\n\\n\r\nArt 8\\n\\n\r\nTari Tari is very well animated, the animation is fairly modern and is very similar to Hanasaku Iroha for those familiar with that anime.  Each character design is done fairly well and is realistic unlike some animes that provide a simple sketch with not a lot of detailed. I especially like Konatsu character design, i find it pretty cool and modern especially the bits when she has her headphones on. I know for a fact to many people comment on the size of Sawa's tits, its big but for some reason everyone keeps commenting some very \"disturbing comments\" about them. The background is pretty well animated, its to be expected from an anime that came out in 2012.\\n\\n\r\nSound 9\\n\\n\r\nThe concept of Music was quite special in this anime, the music and sound itself was part of the Story rather than just trying to make scenes better. The OST is quite well done, they use the song's which the character made as OST which is pretty cool. Also the ending song video changes when each character situation changes, not a lot of anime's does this although its only minor changes.\\n\\n\r\nCharacter 9\\n\\n\r\nEach character have their own difficulties whether its family problems or problems associated with their dreams. Each of the character story is detailed to the point where it is rare to find bits undeveloped and it often gives you a heart warming feeling/tear jerking moment once it ended, making you think \" Ah that was unexpected but i'm happy for them\". The personality of each character also often provides some drama, Wakana's personality for one, often causes quite a lot of drama/difficulties at the start of the anime when she wasn't close with everyone. But it gets better as it progresses.\\n\\n\r\nEnjoyment 9\\n\\n\r\nTari Tari was one of those few animes that have actually made me laughed and cried, the other anime that made me do that was Clannad. While this anime focuses on slice of life drama, its comical moments are pretty good especially the ones focus around messing with Maeda, ah you can't but laugh at how gullible he is =P or his \"vocal training\" with Taichi. Or there market ranger cosplay, Konatsu's \"Curry punch!\" =P.\\n\\n\r\nOverall 9\\n\\n\r\nOverall Tari Tari pretty much has everything you can ask for from a slice of life anime, from drama to comedy. If your one of those viewers that want something with modern animation, great sound and a amazing story that doesn't make you want to pull your hair out at every plot twist then Tari Tari is definitely something for you. It is quite possibly one of the top 3 best animes in this current season alongside Sword art online and Kokoro Connect. (For readers who might say \"Hyouka is better!\" Hyouka was last season not this season!)",
            "date": "2012-08-06T04:05:00+00:00",
            "helpful_count": 68,
            "mal_id": 68855,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1293793.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/quadnia",
                "username": "quadnia"
            },
            "url": "https://myanimelist.net/reviews.php?id=68855"
        },
        {
            "content": "It is said that music soothes the soul. There is always at least one song that can send shivers down our spine and play games with our fragile hearts; it can be interpreted in various ways depending on the individual. The way music plays our heartstrings can be beautiful and majestic, yet also painstakingly depressing. It tickles our souls nonetheless. \r\nThe story of Tari Tari is best described as arc based plots. While overall the story is very enjoyable, I also believe it takes a very safe approach with regards to adhering to common tropes rather than striving for the something new and interesting. Thisisn't necessarily a bad thing considering that the story is presented in a satisfying, coherent fashion, but playing it safe also creates a lack of remembrance. While the show revolves around the choir (and sometimes badminton) club, there are also many issues addressed outside of the club that the audience can relate to.\\n\\n\r\nOne of the strongest qualities that Tari Tari has is that it doesn’t try to be something it’s not. It’s not a part of the romance genre and it strictly stays that way. It also doesn’t utilize fan service as a cheap gimmick to attract an audience because that isn't what the series is about. Despite appearances of being a run-of-the-mill moe slice of life, Tari Tari grasps strong themes and articulates them pleasantly. It’s a heartfelt story about coming of age and dealing with the struggles of life.\\n\\n\r\nThe art and animation for Tari Tari are nothing too exceptional, but still good in my opinion. I really enjoy the quality that P.A. Works brings to the table, and I've enjoyed many other works by them. From the characters to the setting, and the animation itself, Tari Tari is visually pleasing.\\n\\n\r\nThe sound portion of Tari Tari caused me a slight bit of confusion. Given that the series is of the musical genre, I figured there would be more music involved in the sense of frequency versus actual quality. Instead what I got was quite a bit of the opposite, which I was perfectly content with. While there is a feeling of a lack of musical performances, Tari Tari's quality of music was exceptional. \\n\\n\r\nSomething unusual, yet intriguing about Tari Tari is the lack of a real main character. It's not required for a series to necessarily have a main character, however, in this case, the lack of one causes a slight impairment to the series. Supposedly the main characters are the members of the choir (and sometimes badminton) club, but realistically the differences in amount of character development is drastic. Wakana's story arc expands throughout nearly the whole series, whereas the other characters get substantially less time to develop. While the characters themselves are entertaining and likable, with Wien as a notable mention, it's a bit of a shame that they don't get much of their own story. On the contrary, side characters such as the principle and vice-principle get a bit of unexpected character development as well. There is a sense of realism depicted by the characters of Tari Tari; they each have charm, individual problems and aspirations, strengths, and weaknesses. It makes them a likable bunch.\\n\\n\r\nWith all things said and done, I thought Tari Tari was nothing short of impressive. It was remarkably refreshing to watch a series that doesn't capitalize on fan service (of the sexual manner). Hopefully more anime in the near future will keep an open mind and adapt this mindset. Sadly, I doubt it. \\n\\n\r\nThe beauty of music is that there is no good or bad, better or worse. Each and every song is just right for someone out there; it just may take a while for the right person to listen. While Tari Tari doesn't perfectly hit all the right notes, it certainly stirs the melody of the heart. If you enjoy slice of life with a dash of drama and music, Tari Tari just might be the right song for you.",
            "date": "2013-11-30T21:06:00+00:00",
            "helpful_count": 63,
            "mal_id": 122169,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/586079.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Satire",
                "username": "Satire"
            },
            "url": "https://myanimelist.net/reviews.php?id=122169"
        },
        {
            "content": "High school. Ya, we've all been there (or at least most people have). Some people likes it, some people are indifferent about it, and some people hates it with a passion. The times we spent at high school may be a different experience for everyone but it is because of these experiences that we learn more about friendship, life, and most importantly, about ourselves. This series explores the life of what a final year  of high school in the minds of several friends in the “Choir and sometimes Badminton Club” as they prepare their journey of their adulthood and into the future.  \r\nTariTari is one of those unexpected series of the season. In one way, there's not much action or excitement watching a bunch of cute girls doing cute things. In another way, it's a lighthearted school drama that details a story driven by friendship between a group of students who have their dreams, goals, ambitions, and mostly importantly, each other. That's right, Tari Tari is the rare gem of this season and one you can't buy into your heads without embracing its styles and themes that brings to its viewers.\\n\\n\r\nThe series is relatively new that is adapted from the manga written by Evergreen. Tari Tari is tagged with music, slice of life, as well as school life so guess what, the series takes place at a school setting. Some of you might feel less enthusiastic about a series regarding to school life. After all, we got  like a million of those already and who needs more. Yet, Tari Tari here presents a sweet tale of music melancholy that has a charming cast and a refreshing drama that is memorable.\\n\\n\r\nThere are five main characters in the series that all debuts in its pilot episode. Count them with a hand. Five characters and all of them have identical shaped heads but different personalities. \\n\\n\r\nFirst up, we got Wakana Sakai. She is what I would call the stubborn young lady. Despite having a strong voice with real talent, she refuses to sing. However, after certain circumstances, Wakana learns more about the true values of family and dedicates herself for the mother that she loves so dearly. Then, we got Sawa Okita who wishes to turn her dream of becoming a professional jockey into a reality. She's what I can see as probably the Yamato Nadeshiko of the club. Yet, below that outer shell hides an intensity that has vibes which can invoke much drama. Finally, we got Konatsu Miyamoto who makes up the balance of the group and seems to be the cheerful type of girl who likes to get involved with others but truly wants to help her friends. These three girls here all spice things up in the series with their conflicting personalities and ideologies.\\n\\n\r\nThe boys in the series are also noticeable at different stances. They won't let the girls walk all over them especially Taichi Tanaka who wishes to expand his badminton club. He is on a level of stubbornness with Wakana but deep down has a kind heart. His best friend, Atsuhiro \"Wien\" Maeda is there for him even though the duo has nearly completely opposite personalities. \\n\\n\r\nSo, here we are, the Choir and Sometimes Badminton Club. It's hard to say who is the leader as all of them have different parts in the story. They all have their dreams whether becoming a jockey, a professional tennis player, or finishing a song for a person they love. It's like high school you know, especially during the senior year when you start wondering about your future. \\n\\n\r\nThe series' episodes sometimes shifts focus and maintains on a specific character of the club. Yet, it brings out a sense of realistic feeling that we can relate. Tari Tari is a series that is character driven and all the members of the Choir and Sometimes Badminton Club gets their chance to shine whether individually or as a whole. The circumstances that leaves some of these characters as who they are is also entertaining to watch. Weird huh? Slice of life series often seems like reading a book where we watch a characters' life develop and their every day circumstances. Yet here, Tari Tari presents some sense of entertainment that allows us to taste a bit of realism of what the final year of high school feels like. (even for those who's already been there)\\n\\n\r\nP.A Works (Angel Beats!, True Tears, Hanasaku Iroha) is involved in the series. Thus, you can expect some similarities if you're familiar with the studio. Hanasaku Iroha is especially the case here considering the various similarities and that slice of life nostologia. The visuals of the series is also similar that brings simple school life artwork to life. Some of the episodes are deeply colored but overall retains that simple yet realistic image that gives off the slice of life feeling. There are times some childish yet cute animation sequences with miniature version of some of the characters. Overall though, the artwork visuals are above average.\\n\\n\r\nThe overall soundtrack coordination and music in the series brings out a general lighthearted melody in the series. Jin Aketagawa (Hatsukoi Limited, Honey and Clover, Toradora!) presents his skills into  Tari Tari with his experiences involving school life melancholy. The OP song \"Dreamer\" by AiRI is a symbolic term that reflects what people can do when they try hard and with the help of their friends, can make dreams come true. The ED songs here though are much more interesting to look at. In the first few sequences, there's not much development with only a lonely girl (Konatsu). As the episodes progresses and as the club grows, the ED songs features more ensembles with the cast. \\n\\n\r\nThe fact that the series is also tagged as “music”, you can expect some talented tunes beating into your ears. Unfortunately from my respective, I can't really agree with such a real talent coming out the mouths of the characters. It's just fairly average but with their ambitions, the club can make it quite far. Later on though, they bring more amusement into the show and their inner hero awakens within them bringing forth more drama. Speaking of which, there is definitely drama in the series despite not being explicit detailed. Drama takes place into the eyes of the vice principal who has a grudging attitude. It reminds me of this guy I met during high school. He would berate students for the tiniest of mistakes and hands out detention slips like free samples at Costco. Yet, as the series progresses, we can see some reflection of the vice principal's past and what she's been through. Although not the most likable character in the series, it's interesting to see her development involving the members of the cast.\\n\\n\r\nUltimately, this series is a rare gem of this season that takes slice of life to a different level. It is a school drama with a likeable cast of characters of different personalities. They bring forth joy, entertainment, drama, but at times also emotions that we all feel as part of being human. The series artwork has realism and is natural like the way a high school experience should be. The soundtrack orchestrated fits within the lighthearted mood of a typical slice of life series. The story itself focuses on the individual characters as well as the Choir and Sometimes Badminton Club as a whole. It's dramatic and entertaining to watch even though. Still though, don't expect much surprise as the series does follow with some cliches and can be repetitive at times. Additionally, the series has many borrowed themes from other school life series so don't expect the unexpected.\\n\\n\r\nSo, what do you think? Still want to watch Tari Tari? I know high school has a different view in the minds of different people but it's an experience that most of us have or will explore in our lives. During that final year, it's time to think about the future and with friends as well as a strong ambition, there's nothing we can't accomplish.\\n",
            "date": "2012-09-23T18:44:00+00:00",
            "helpful_count": 46,
            "mal_id": 73115,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=73115"
        },
        {
            "content": "All right.......so far, this is my first review, and hopefully not the last. I'm sure a few people would know my name, but that doesn't matter. As someone who watches over 8 or 10 of the anime series per season, along with other anime/manga stuff, I'm busy. But I believe this series deserves my first critic.\r\nI had good, if not the up most, expectations for Tari Tari, and it seems to have answered it with just the first episode. I'm sure there will be more to come, but I believe the first episode has done a magnificent job. So far, the story (for me) isinteresting, the art is smooth, the music in very entertaining, and other elements caught my attention. I might edit this review later on, but for now this is my opinion.\\n\\n\\n\r\nStory:\\n\r\n9/10\\n\r\nAt first, like some other folks, I believed this story was going to be another \"a circle of friendly girls\" type of anime series, which there seems to be a good number of them in the last few seasons. But, since it isn't, I was thankful.\\n\\n\r\nThe plot seems to revolve around not just one, but around a group of students of five, all with different interests. Though it may seem that one girl, Konatsu, is at the center due to her being the one trying to assemble the Music club in the anime, I believe she isn't really. I also thought that Wakana was at the center also when I saw the first 5 minutes. But because of how the plot is assembled and presented, I feel that it revolves around not just the two, but also horseback rider Sawa, lonely Badminton player Taichi and transfer student Wien.\\n\\n\r\nFascinating and eye-catching, the story is somewhat different yet similar to the usual high school anime series I've watched. The idea of creating a new club is technically a reused plot, but the characters introduced to fill into this plot really made it interesting. I look forward to how it'll be in the future.\\n\\n\r\nArt/Animation:\\n\r\n8/10\\n\r\nThough it may not be at the level of \"scenery porn\" (check here http://tvtropes.org/pmwiki/pmwiki.php/Main/SceneryPorn), the background, character details and other visual elements made me feel comfortable with the series. Smooth-flowing, though I believe I'm not one who ever tries to negatively critic art, I'm sure I cannot say that I know what is truly good anime art and what is not. Still, the animation here has that comfortable grasp, as I've seen this art style in many of PA Works anime.\\n\\n\r\nMusic:\\n\r\n9/10\\n\r\nFor such a humble anime series, the music fit quite well. The OP and the animation that went with it made the anime series more attractive, while the ED drew me in, telling me to watch the next episode. The sound effects and soundtracks were ear-catching, and lovable. I'm pretty sure those good songs and BGMs were chosen as it seems this series has music close to its core. Konatsu and Taichi sang quite well, and I'm looking forward to the rest of the cast singing too.\\n\\n\r\nOh, not to forget, the use of \"Reflectia\" for the chorus in the first episode really made a good impression on the anime. I applaud for that specifically.\\n\\n\r\nCast/character:\\n\r\n9/10\\n\r\nEach character is memorable and also the kind of people I would like to associate with. As said before, I believe there is five \"main\" characters, and no one is truly the main focus.\\n\\n\r\nKonatsu: A cheerful and upbeat girl who loves music. It seems to be that many recognize her by her \"blonde\" hair, though I would like to say that it is more of a light brown color. But that aside, her physical character design fits well with her personality. Her VA did well with the singing also, which I liked.\\n\\n\r\nSawa: A more mature girl who is friends to Konatsu. A horseback rider at home, she also participates in a club at school. I yet again feel the character design fits the personality, but I do have to say the VA choice was close to perfect.\\n\\n\r\nWakana: A girl with a mysterious past. It seems to be that she's hard to approach...this character is my favorite in the series, and that's possibly because I love the character design, plus the personality she presents to the audience. Her VA choice was also a perfect one.\\n\\n\r\nWien: A transfer student from Austria. This character's background is not dug up much in the first episode, though I do have to say he over-studied the Japanese culture. I'm quite fond of his personality and character designs, being the usual brown-haired nice guy. When I looked into his VA, I was stunned at how well his VA did for his first voice acting role. He's a promising VA, but nonetheless....\\n\\n\r\nTaichi: Badminton player. Again, no much is covered about him in the first episode, but I do know that he has this loyal and prideful personality. His kind of character is a somewhat necessary fit into our current cast, so I'm appreciate that his character is in the series. Va, yet again, did a good job portraying his character.\\n\\n\r\nOverall:\\n\r\n9/10\\n\r\nLots is to be expected of this series, if not infinitely. I am sure there are some who will agree with my review, and so who won't, but I invite all of you to at least try and take a good watch at the first episode at least. Thank you.",
            "date": "2012-07-04T04:22:00+00:00",
            "helpful_count": 36,
            "mal_id": 65287,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1165241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/GreenMoriyama",
                "username": "GreenMoriyama"
            },
            "url": "https://myanimelist.net/reviews.php?id=65287"
        },
        {
            "content": "There was a time when children watched decent American cartoons and Japanese anime on TV. Then around 10 years ago, at least in Germany, the quality of the shown material worsened rapidly. Animes were cut out of the program nearly completely, most of American and European productions lost all value, and so my time in front of the TV mostly ended. I am so content now that there are other ways to watch anime and I don't have to miss heartwarming anime shows like this one, Tari Tari.\r\n\"Where did I come from, and where on Earth am I heading?\"\r\nSo then, what is there to expect?...actually a bunch of high schoolers who search for a way to graduate properly and to live on after. For Sawa and Wakana, it is a struggle because they have to face tragedies or objections within their families, and for Konatsu it is a fight to overcome an embarrassing past experience. The story shows their efforts to bear with these burdens and how to remember their high school time: through the passion of music. Together with Badminton-fanatic Taichi and the peculiar Austrian student \"Wien\" they form the (not only, but most of the time) Choir Club and begin to understand what it means to live for something.\\n\\n\r\nThe story is kind of slow-paced, but has a clear goal and gets you hooked up especially during the last episodes. The music theme is transported throughout the series, though I would have liked to see more choir performances. The ones you will see, however, are quite a pleasure to hear to, notably \"Melody of the Heart\", which gave me shivers at the end of episode 2.\\n\\n\r\nCharacter-wise I cannot think of anyone who I despise for being there. They all have a personality that interacts well with the flow of time, and also the \"antagonists\" get a decent grip in the whole picture for a 13-episode-SoL-show. Character development is mainly focused on the female characters, for they overcome their burdens and Konatsu in particular develops a firm mind to carry the choir towards their mutual goal.\\n\\n\r\nAnimation and art serve their purpose: The characters look natural and move accordingly. Backgrounds are vivid enough to differentiate, and there are no flaws in landscape or the school, from which I love the view over the sea and the architecture. Voice acting and background music are done without complaints, but aren't special either.\\n\\n\r\nSo then, before I drift away into stating mere facts and make the review unnecessarily long, I would like to mention my final thought. For a Slice of Life anime, a certain vibe is essential to carry the sometimes trivial messages. Tari Tari stays true to its melancholic and friendly touch and shows us another time how purposefulness and friendship can conquer personal and even greater problems. Together with moments worth remembering like the stage performances, what can YOU make wrong in deciding to give this show a real chance? I enjoyed it all the way through ...",
            "date": "2013-10-26T11:40:00+00:00",
            "helpful_count": 27,
            "mal_id": 118349,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3181391.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xiaraith",
                "username": "Xiaraith"
            },
            "url": "https://myanimelist.net/reviews.php?id=118349"
        },
        {
            "content": "Tari Tari is truly a beautiful anime, simple music and subtle emotions, blending into what we known as Tari Tari. I love the music that’s played, the voices are wonderful and it never ceases to amaze me with every episode.\r\n I don’t think it’s fair to compare it to K-ON, even though they share the same premise, music and art seem a little similar but both are portrayed differently. \r\nThe characters are not the typical or stereotypical character complexes of the anime world; they are far more complex, harbouring emotions that run thicker as each episode is aired. I love the characters and the interactions,it’s lovely and a change of pace from what I usually watch.\\n\\n\r\nIt’s calming, relaxing with the tranquil music that instantly drew me in, both the OP and the ED are captivating. The drama is another aspect that appeals to the viewer, slowly building in and well developed.  \\n\r\nAs for those who simply call it boring, actually watch a few episodes and see the development for your selves, nothing over bearing with the drama but very easily to connect to.\\n\\n\r\nOverall it was a warming, tender and peaceful anime. Good music and flawless characters, I’d be enjoying every moment of this anime and sad to see it end but neverless, I hope it continues with the standards that they’ve upholded so far.\\n\\n\r\nGive it a few episodes rather than just the one to appreciate the anime for what it’s worth, the music, drama and characters are combined into this work of art.\\n",
            "date": "2012-08-07T14:59:00+00:00",
            "helpful_count": 26,
            "mal_id": 68997,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/971423.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Akiska",
                "username": "Akiska"
            },
            "url": "https://myanimelist.net/reviews.php?id=68997"
        },
        {
            "content": "I feel the need to review this since it has such a low popularity rating on MAL and it doesn't recieve too much attention. This anime is very underrated, and I hope this review will help others discover this anime and give it a chance.\r\nStory: The premise of the anime is simple, a group of friends start a choir club and unintentionally/implicitly compete against the schools chorus club who's sponsor is the vice principal who's an alleged **** The anime's plot is so simple and it's nothing to write home about, but it's so enjoyable for it's simplicity. The anime slowly unravels and develops eachcharacter and this may be a slight tear-jerker. 7/10\\n\\n\r\nArt: The animation is great, though character design may seem blandish, the characters WILL grow on you. The backgrounds make the anime's world seem very immersive and realistic 8/10\\n\\n\r\nSound: This anime is all about music, so what can you expect? Don't compare this to k-on!, it's nothing like it. The anime's approach on music is much more beautiful, seeing how totally different people can all come together and relate their problems through the expression of music. Although the songs may not be as catchy as you might expect, by the end you'll be humming the tunes all day and night 9.5/10\\n\\n\r\nCharacters: The characters in this anime aren't cookie-cutter simple, but not too involving either. The anime is so simple so don't expect some deep, mind boggling or heart-wrenching shit, but I gurantee you'll love the characters in the end as mentioned before. 7/10\\n\\n\r\nEnjoyment/Overall: This anime is so heart-warming you will NOT regret watching this one. You'll notice the anime is so entertaining and seemless to watch. Don't have second thoughts on this because this just may be one of your favorites. 8/10\\n\\n\r\nAlso, for those into anime chicks, Sawa may be the love of your life, just sayin",
            "date": "2013-05-15T10:01:00+00:00",
            "helpful_count": 23,
            "mal_id": 97265,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2347429.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/josenewtype",
                "username": "josenewtype"
            },
            "url": "https://myanimelist.net/reviews.php?id=97265"
        },
        {
            "content": "[Spoiler Free review (: ]\r\nCan music solve everyone's problems? No, it can't.\r\nAlthough, sometimes it does helps, gives hope or encouragement.\r\nSome limits can't be overcome how hard you struggle, dead people can't come back to life, things that happened in the past can't be changed and there is no \"magic\" to help you.\r\nThis show talks about moving forward and living in the present. The problems are there and you can't runaway from them. \r\nIn this season lacking of good school slife of life this one caught my attention.\r\nThe topic isn't new, 3rd year students gather together in a club, while facing daily life problems, they haveto decide their future goals, career, etc...\\n\r\nActually, Tari Tari surprised me. I first tought it would be like any other story but it was a pleasant surprise when I found out it had a really well written storyline and a realistic (and solid) plot which had a satisfying ending, deeper then I expected. \\n\r\nThe focus of the story is music of course. But it have a different approach from K-ON! for example. In this show they see the singing as a enjoyable way to spend time but also a way to work out their problems. Something that's very nice because it escapes from the ordinary \"school clubs\" animes.\\n\r\n[Did you know?] The expression TariTari can mean a lot of things, it may be use as a vague expression for saying \"doing this, doing that\" but also means \"variety\" (of music, places, stuff..) It's a interesting title that matches with the story.\\n\\n\r\nTari Tari doesn't have a \"main\" character. Good tales don't necessarily require one. This gives more movement to the plot, and you can enjoy each character development, all together. It may be, indeed, more focused into Wakana and Sawa stories, but this is  solely due to the fact their problems were more difficult to solve than the others'.  \\n\r\nBtw, this show have very interesting characters. They're the type of characters you get attached to. You see they changing through the story and, in the end, cheer for them to have a happy life. It's often said that the friendships you make in your school days will last forever. These characters kind of prove it.\\n\\n\r\nAbout Art,\\n\r\nTariTari follows this new style of setting where the scenario is the exact copy of the original place from the model town. I mean, after you finish watching, if you're curious, you can find it on Google Maps! It's nice because it gives the feeling you're watching something close to reality, which is, the essence of slife-of-life. It was carefully animated. Nothing to complain here.\\n\\n\r\nSomething that kind of disappointed me, was the lack of songs. It been a music-focused anime, I expected more inserted soundtrack and performs from the protagonists. Even though, this doesn't take the merit from the ones they did. Very well performed as you'd expect from a skilled cast like this. This time, they also featured the singing of a real high school chorus for all the bgm and ost. \"Makuhari Sogo High School Chorus Club\", which in my opinion, is one of the best I've ever listened to.\\n\\n\r\nThis season, Tari Tari was my rough diamond in the dirt. \\n\r\nI can't understand why it's still ranked so low... Seems like it didn't made the inicial \"impact\" as others did even it being a nice and entertaining show.\\n\r\n:::Story> 9|10 / Art> 8|10 / Characters> 8|10 / Sound> 9|10 / Enjoyment> 10|10 / Overall> 8|10:::\\n\r\nThx for reading and please give Tari Tari a try :)\\n\\n\r\n~Sry if there're mistakes, eng is not my 1st language.~",
            "date": "2012-10-20T15:56:00+00:00",
            "helpful_count": 22,
            "mal_id": 75449,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/339221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xbobx",
                "username": "xbobx"
            },
            "url": "https://myanimelist.net/reviews.php?id=75449"
        },
        {
            "content": "Overall a very solid series. Great for anyone who likes a light hearted slice of life type of anime, it's very similar to Hana saku iroha, basically an anime drama. \r\nThe characters seem very interesting, you have the Energetic girl (as usual), weird guy, well composed girl and girl with a history. Looks like a lot of potential to me.",
            "date": "2012-07-06T02:34:00+00:00",
            "helpful_count": 21,
            "mal_id": 65467,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1381263.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Stormberg",
                "username": "Stormberg"
            },
            "url": "https://myanimelist.net/reviews.php?id=65467"
        },
        {
            "content": "Tari Tari is a thirteen episode slice of life anime that just finished airing today. I had been watching it weekly for a while now, and after watching the final episode, I will say that overall I felt it was pretty satisfying to watch, but it really didn't do enough to stand out very much.\r\nSo, first of all, Tari Tari is another slice of life anime set in high school. Unless you're really new to anime, you've probably seen a slice of life anime set in high school at least ten times already.  High school is anime's favorite place, and I'm willing to betover 85% of all anime is set in high school. I find this really strange. Like seriously, what do Japanese people like so much about high school? Is it really that interesting a place? \\n\r\nWell, putting that aside, what's it about? Well, to put it simply, it's about five seniors who each all have their own interests (music, horseback riding, badminton, etc). One of the seniors leaves the music club because the teacher directing it is a jerk, and she starts her own choir club. She recruits the four other seniors mentioned earlier and they do various choir club activities such as going to a recital, performing on stage, and setting up for the culture festival. \\n\r\nAh yes, the culture festival. Might I also mention that just about every single anime that is set in high school will have a culture festival episode? It's true man, try naming an anime that doesn't. You'll have some trouble. Not that it's a bad thing, but seeing the same event occur in so many anime makes me feel like I'm seeing the same show over and over again.\\n\r\nGoing back on track, well... that's about it for the plot. Each of the five seniors (and by that I mean the three girls) gets her own arc which consists of around three episodes. Each girl goes through some emotions caused by some sort of trouble, and each girl overcomes her problem and grows stronger. These problems are pretty much what one would expect out of high school students, such as deciding on a future career. The progression of the arcs is really predictable and everything is solved cleanly by the end of each one. \\n\r\nAs for the two boy characters, well, all they get is the big gay dance. Tanaka's badminton troubles are hardly that, and Wien's conflict with his penpal is resolved in a matter of five minutes. These two boys are so underdeveloped it's a wonder why they're even in the anime. My only answer is they're there solely for the purpose of singing the tenor and bass parts of the songs. \\n\\n\r\nSo how's the music? Well, since it is an anime about a choir club, it better have some good music, and I'm happy to say it does. Throughout the thirteen episodes, there's three to four insert songs performed, and they all sound pretty good. The harmonies are great, and the melodies are cute and bouncy. The seiyuus all did a good job singing, and if there's anything to watch this show for, it's the songs. There was one really good background song that played during the sad parts of the anime, but that's about it for the bgm. I can't say I liked the opening all that much though. Haha the very first image of the characters you see in the opening sticks the two boys far in the back. This is a great foreshadow showing how much they didn't contribute to the anime! :)\\n\\n\r\nThe art is quite nice on the eyes. The characters are drawn similar to K-ON/Kokoro Connect/Hyouka, and that's a good thing. While the backgrounds are hardly interesting featuring locations as unique as high school classrooms, high school hallways, high school clubrooms, and outside the high school, they are all drawn really well and are at times animated really splendidly. In particular the last episode looks really nice. There isn't too much flashy animation, as to be expected from a slice of life. You won't find any high budget fight scenes here, nor any super spectacular concert scenes. \\n\\n\r\nSo how was it overall? Well I thought it was good. It didn't break any new grounds, but it was never trying to. If you are a fan of slice of life anime, then I don't see why you wouldn't like this. It's also not 'super slice of life,' so if you hated animes that require you to be really into slice of life (for example K-ON, Natsume Yuujincho, or Aria the Animation), you might still like this one. Though the fact that it's another high school anime really puts it down for me. Cheers to Aria the Animation for not being set in high school! :)",
            "date": "2012-09-24T00:05:00+00:00",
            "helpful_count": 21,
            "mal_id": 73133,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468995.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/makoa69",
                "username": "makoa69"
            },
            "url": "https://myanimelist.net/reviews.php?id=73133"
        },
        {
            "content": "2 + 2 = 4 \r\nThis is a simple equation and a hard fact of maths. If you add 2 and 2 you will have four, its a tried and true fact of life. So why am I bringing this up in an anime review up, well because Tari Tari also religiously follows a tried and true equation,   High school girls + slice of life = Money \r\nIn fact it follows so close that it actually didn't bother to bring anything original or interesting to the table, and because the writers believed so deeply in this formula they thought that it wouldn’t matterwhat they fed us, as long as they stuck to this equation people would watch it. (And the sad fact is, if you look at the blue-ray sales, they where actually right, sigh.)    \\n\\n\r\nSo what is Tari Tari, well here`s a quick summary of what its about.\\n\\n\r\nTari Tari follows 5 high school kids with High school problems who form their own choir club due to the main character, Konatsu, being unable to \"Shine\" in the original music club. The main plot revolves around each of the main characters  providing a look into each ones goals and life ambitions and the problems they face in achieving these goals. \\n\\n\r\nIt all sounds simple enough but here`s where the problems come in, the main plot, that of the group led by Miyamoto Konatsu trying to perform at the cultural festival, while a simple enough idea is so poorly written and executed that it ruins the whole series, confused, let me explain...   \\n\\n\r\nthe idea of a group of teenagers, all with their own problems, being brought together by music and then working to put on a big show is a pretty good idea, Sakamichi no Apollon (kids on the slope) did this idea too but they did it so much better because it was much better written. These characters had their problems too but they where more relatable and, most important of all their problems weren’t solved in two episodes so the story could move onto another character with problems. \\n\\n\r\nAlso the music played a much bigger part in Sakamichi no Apollon, you really get a feel that these characters are being brought together despite their differences because of there love of jazz, with Tari Tari no one really seemed to care about the music club for much of the series and it certainly never seemed to bring them together or help them with their problems, in fact they all solved their problems on their own so what was the point of this series.   \\n\\n\\n\r\nNot only that but there where some really stupid scenes in this series as well. Like with the sub plot about the school being closed down because some rich guy wants to build a hotel, I mean what is this a 90s Disney channel tv movie, come on how lame is this. Theres even a scene where the rich guy is sitting in a big chair looking over an expensive wine bottle while telling the principle hes going to close the school, oh I get it, hes a bad guy isnt he. they should have just had him counting dollar bills while stroking an evil cat and spitting on orphan puppies, if your going to do a stupid scene like that you might as well go the whole way don’t ya think. \\n\\n\\n\r\nBut to be honest this show isn’t really about the plot, its more about the characters and how they fight against their problems and  obstacles in order to achieve there dreams. And while all five protagonists have believable problems, mostly typical of your average teenager, the show again suffers from bad writing and clichéd ideas. You see again they followed a formula with the characters, introduce them and their goals + add problems + shake well = leave to cool for 1 episode then move onto another character. Then there’s the characters themselves, despite this being a character driven story we find out very little about some characters and too much about others,  very little time is devoted to the male characters, they are developed shocking little in this series and given very little screen time and attention compared to the female characters. I mean I suppose there was some attempt to give them depth like with the sup plot about Wien and some childhood friend back in Austria (which again is horribly written to the point where its almost comical) but its very small in comparison to the female cast. \\n\\n\r\nThe main problem with the characters is again the belief of the writers that by adding a few scenes of people crying and some sad back story’s this would count as character development, it does not. Character development is when we the audience can relate to characters who feel like real people and we watch and learn how they grow and change throughout the course of the story, its not devoting two episodes to a character crying because she cant do what she wants then ignoring them for the rest of the story. \\n\\n\r\nNow to be fair some of the back-storys where quite sad and moving such as Wakana`s with the story  of her dead mother, but again it could nave been done much better with some decent writing and some good direction.  \\n\\n\\n\r\nSo anyway the problems with this series aren’t particularly complicated or mysterious, its just a simple case of a series that tried to be quirky and whimsical with characters that warmed your heart, but instead it fell its face face due to bad writing, lack of imagination and  using every cliché in the book. Overall not a bad series but there’s so many other that do this idea much, much better such as  Sakamichi no Apollon, watch that instead.",
            "date": "2012-10-14T06:54:00+00:00",
            "helpful_count": 18,
            "mal_id": 74931,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356852.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/OdysseusUlysses",
                "username": "OdysseusUlysses"
            },
            "url": "https://myanimelist.net/reviews.php?id=74931"
        },
        {
            "content": "Dreadfully boring, essentially it's \"First World Problems: The Anime\".\r\nEssentially the main character wants to sing in her choir club, but doesn't have enough members. Due to some unseen and quite honestly uninteresting previous issue with singing in public, the MC is hellbent on getting people with little to no interest in joining her club to join her club, for instance she black mails her brother, and a few other uninteresting characters into joining her club.\r\nBasically it's a redemption story, based on events that happened prior to the show, and gets vaguely alluded to, and a rather self-centered MC who want others to help her makeup for her own fault by dragging in people who have nothing to do with it.\\n\\n\r\nThere's also faux drama drummed up in the form of the overly-antagonistic Assistant Vice Principal or whatever, who for the tone of the show seems cartoonishly hell-bent on ending the Choir club.",
            "date": "2012-07-17T22:32:00+00:00",
            "helpful_count": 16,
            "mal_id": 66925,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1340973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LUNI_TUNZ",
                "username": "LUNI_TUNZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=66925"
        },
        {
            "content": "Tari Tari is a glaring example of an anime with commonly done themes, as is evident from one glance at its genres— School, Slice of Life, Music, Drama. It is centered on five members of a choir club, each with their own tribulations of 'growing up' as they strive to make the best out of their last year of high school, rectify some mistakes made in the past and accomplish their goals.  There are quite a handful number of titles out there that make use of this subject with the hope of bringing something decent to the screen. Some pull it off somehow whilea few mess up,  and while it's true that Tari Tari is by no means groundbreaking, it certainly lives up to what it attempts to achieve and what any sane viewer would expect it to be— a simple, unpretentious and heart warming school drama.  \\n\\n\r\nLast year P.A. Works, the studio behind Tari Tari, gave us Hanasaku Iroha and anyone who has watched it must have felt the resemblance between the two shows since both more or less take a similar approach in terms of not only the story but also to some extent, the characters and of course the visuals. I must confess that the only reason why I picked Tari Tari was because it seemed to be reminiscent of Hanairo which I admired a lot when I watched it a year ago. Like Hanairo, Tari Tari starts off with a somewhat laid back atmosphere and then takes a dramatic turn, especially towards the end. It delivered everything it could have, given its length and the story line, and probably would have felt draggy if it was any longer. The characters were lively and relatable. The way it was wrapped up, though nothing unique, was quite satisfactory overall. \\n\\n\r\nVisually, Tari Tari was a treat. It was a pleasure to behold the beautiful, detailed backgrounds. The character designs were fine, nothing revolutionary there. It also had some nice catchy songs that fit the bill. I especially like the opening theme 'Dreamer' by AiRi and I'll probably be humming it for quite some time now. \\n\\n\r\nOverall, Tari Tari is your run of the mill school life-esque drama that certainly doesn't stand out much but I see no harm in giving it a try if you ever feel like, that is. \\n",
            "date": "2012-09-25T10:40:00+00:00",
            "helpful_count": 13,
            "mal_id": 73273,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503355.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Rika",
                "username": "_Rika"
            },
            "url": "https://myanimelist.net/reviews.php?id=73273"
        },
        {
            "content": "After first episode I'm afraid this show have pretty bad future in my eyes, and here is why:\r\nLet's think, combination of which titles could born Tari Tari? First group is school music-related series such as K-On or fresh Natsuiro Kiseki. Second group is titles, revolving around teenagers in japanese country with dose of drama, such as Hanasaku Iroha (also it have same visual style) or Ano Natsu.\r\nAnd basicly I don't think that's a good mash up.\r\nBoth K-On and NK are about \"cute girls doing thier cute things\", there is nearly no drama, and that's why they naturally combines with pop music. In HI and ANwe have huge dramatic part, but they don't do anything creative: in first we have just normal ryokan scenery, in second we see creation of nearly documental movie. Ofc there is pleany of musical series combining both drama and creativity, but they're exploiting rebellious rock/punk culture. And since we have title about choral music, I'm afraid it's gonna be rebellious, to transparent fight vs teachers or globally system, and thus most likely we'll have totally unnatural cadaver of cheering choral music and dramatic plot.\\n\\n\r\nThe only thing I've enjoyed alot is nice backgrounds, I think people who've selected photos did great work.",
            "date": "2012-07-02T02:25:00+00:00",
            "helpful_count": 12,
            "mal_id": 65065,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271134.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Wingerie",
                "username": "Wingerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=65065"
        },
        {
            "content": "Let me just say that this is probably the most underrated anime ever. When I first saw the title on MAL, read the synopsis and some reviews, I thought this was going to be another pointless Slice-of Life anime about high school girls doing things, so I just skipped it without thinking twice.\r\nFast forward a few months and I'd just finished Hanasaku Iroha, and many users recommended this show. Knowing P.A. Works pretty well by then, I decided to give it a go. Now I wonder why I didn't watch it earlier. This show was surprisingly, very very entertaining, fun, and yet so serious andemotional.\\n\\n\r\nThe story focuses on the lives of a few high school students and their personal problems, goals and relationships. In short, this is a very typical P.A. Works drama anime.\\n\\n\r\nOne of the biggest flaws of this show is that it is only 12 episodes long. Anyone who is familiar with shows by P.A. Works should know very well that P.A. Works originals with 12/13 episodes ALWAYS feel a bit too rushed, and the 24 episode series' have the best pacing.\\n\\n\r\nThe art and animation of the show, is really beautiful as expected of P.A. Works. It's too beautiful for such a not so well-known show.\\n\\n\r\nThe sound and music in the show is perfect. If you actually look at the lyrics of the songs in the show and understand them, they really relate to the shows and characters. The composition is amazing. The ED song is the most fun song I have ever heard in a while, and everytime I listen to it I just feel like watching the show all over again. The OP song is also super great.\\n\\n\r\nThe characters of the show have such an amazing chemistry and are just really funny and fun to watch. REALLY their chemistry is just unique, I just don't know how to explain but..\\n\\n\r\nAnyway, I really really really enjoyed watching this show, I still feel like watching it again and again right now. Probably the show that I enjoyed watching the most. There was never a boring episode, and the comedy is just amazing for a drama series. Highly recommend this show!",
            "date": "2018-06-26T00:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 282261,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tworats",
                "username": "tworats"
            },
            "url": "https://myanimelist.net/reviews.php?id=282261"
        },
        {
            "content": "Tari Tari, at first glance is very slice-of-life. First time I trace it, I thought it will have multiple aspects of dance (in my language, \"Tari\" could mean \"dance\"). Overall, it made me gone \"Jackiechan\".\r\nStory is comparable to La Corda D'Oro plus Natsuiro Kiseki without any magic and greatly reduced romance (hint: last episode). Given the struggle to fulfil last wishes together with very intense obstacle, it could have been a deep penalty, but I still forgive the happy ending. Final score: B+\r\nArtwork is very safe. With moe design and fairly tall character (discount Konatsu!), it provides satisfaction and must-not-fap face.The environment drawing is alsorated high. The school is very well-drawn and artistic. Final score: A.\\n\\n\r\nSound could be considered aces for this season. Thanks to Ayahi Takagaki and Saori Hayami (both are top-of-the-line), it generates god-only-knows music. Ayahi Takagaki going high-pitch also in this anime, something rare to find. The sound effect also excellent. Final score: A\\n\\n\r\nCharacter is vary and dynamic. Wakana for example, she turns from tsundere to really caring. This adds multiple increment for already-high score. In fact, all characters in this anime is matured throughout the series. Double-pack this with good design, additional score is assured to be beyond upper threshold. Final Score: A\\n\\n\r\nEnjoyment is almost non-exist other than good ending. Sawa could learn equestrian, Tanaka learns badminton (in Indonesia or China?), Atsuhiro (Wien) finally meet his friend back in Vienna, Konatsu enters university, Wakana is a bit questionable but some educated guess will lead that she manages to study music in university. Fanservice is also minimum to mere bikini shot. Final Score: B+\\n\\n\r\nGrand total: A. \\n\\n\r\nPS: in my anime league, this anime rated in fourth after Symphogear, R-15, and La Corda with GPA 3.95 (head-to-head against La Corda and top two got GPA 4)",
            "date": "2012-09-30T05:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 73707,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=73707"
        },
        {
            "content": "As I am reading the reviews for Tari Tari, I can't help but notice that many people think that this show is just another 'Moe' anime. Although I can see the basis of these comments (*Cough *Cough Konatsu) but what Tari Tari differs from the rest is within its characters and story.\r\nStory:10/10\r\nThe main story of Tari Tari is a simple one: it is about the members of a choir club working all together in hope for the final competition. It is nothing out of the norm, but from the daily lives of the members, we have the sub-plots of the members from the choir club.The anime isn't structured arc-to-arc and everything happens simultaneously, so one character could be developed in the first half of the episode and another character could be developed in the second half. But the show somehow manages to holds itself cohesively together and make us understand what is happening. This gives a more real life feel to the anime and it makes the characters more realistic.\\n\\n\r\nThe stories themselves are well written. Although some are cliché but because the show created a realistic environment through its structures, it would make you think that these cliché scenes are actually achievable. \\n\\n\r\nArt:9/10\\n\\n\r\nOne would expect a great visual experience when it comes to P.A. (the same animator for Angel Beats). And Tari Tari is no difference. The visual is well-done, everything seem so colourful and it really made me feel like I was there watching everything unfold. \\n\\n\r\nSound:8/10\\n\\n\r\nAs a show about a choir club that specialises in singing, the sound in Tari Tari isn't the most memorable, you would expect some great ear-cateching singings from the characters but they barely do any singing. Not to say the sound is bad because it is definitely not. But it could do with a lot more improvement.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nNow THIS is where the show shines, in Tari Tari, the characters all have their own problems that they have to overcome, but everyone goes at their own problems in their own ways. But the characters all support each other in the times of need. It is from these interactions that we find out how every character behaves or thinks. \\n\\n\r\nThe character development is wonderful, it secretly develops the character through their every day lives without you noticing. But after you noticed the character development, it is already too late, you already feel whole-heartedly about them. This is going back the the structure of the plot. Everything happens simultaneously, you are not given a fixed camera on one person, instead , you get to see a bit of everyone. You don't get to see all the details with the character developing this way but you were given to see what the animator want you to see, and you feel how the animator want you to feel, with no additions from any unnecessary plots.\\n\\n\r\nOverall:10/10\\n\\n\r\nTari Tari is being treated as another 'Moe' anime because of its art style and its bland story, but there might be a little bit more about this anime that just cute girls and music. Because of its plot and characters,  Tari Tari don't deserve to be called a moe anime, and I think everyone should at least give it a try and then come back and tell me how blatantly wrong I am. But before that, Tari Tari is definitely a 10/10 in my list.",
            "date": "2015-06-05T01:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 189582,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3948381.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/aqing0601",
                "username": "aqing0601"
            },
            "url": "https://myanimelist.net/reviews.php?id=189582"
        },
        {
            "content": "A show I expected to dislike. When I read the summary I was semi intrigued due to the focus on music, but was unsure when I noticed the high school setting. Oh, I thought, another boring and dull and basic high school drama that is just BLAH. Boy, was I wrong...well, for the most part. Tari Tari is definitely not your typical high school comedy, it brought me to tears, made me laugh, and made me realize why I love listening to music. However, to be honest, there were some definite flaws, but not SO definite that it made me ever want it to end.I'll start with the flaws. One major flaw I found was how extremely immature the majority of the main characters acted. If they were middle schoolers it would make sense, but during my senior year of high school I was never so immature. I found it surprising that there was little to no romance throughout the show. I found that somewhat unrealistic considering their ages. Yes, boys and girls can be friends, but COME ON, you spend EVERY DAY with each other and there isn't ANY hint of romance(there is SOME, but nothing that changes the dynamic of the show)? I found that somewhat strange. In addition, some of their actions and routines were childish, cute, but childish nonetheless. I felt it took away from the story, but only for a second. I found really nothing else wrong with the show, at times it was cliche, and I did cringe at some parts just by how cheesy it was, but overall Tari Tari deserves to be watched for many reasons. What reasons? I'm glad you asked! First off, the PARENTS of the show made it for me. I loved each parent, they developed their own personalities and changed along with their children. It was refreshing to see that, because usually the parents are stagnant characters that stay two dimensional, but not in Tari Tari. I found myself loving the parents as much as the high school kids. In addition, THE MUSIC, what absolutely breath taking music, especially the piano solo parts. Each song made me smile, and by the end I was tearing up because I felt so emotionally connected to the song even though I can't speak one word of Japanese. To me that takes skill, and I applaud the writers/producers of this show. I felt invested, I felt loved, I felt friendship throughout the show in a way that for the MOST part was realistic and made my heart honestly beat faster and my smile grow wider. I am an adventure loving, gore thrilling, sword wielding show kinda gal, but Tari Tari has made me want to give Slice's of Life more chances. It was the music, the characters, the art, the overall atmosphere that made me love Tari Tari, and I highly recommend it to all of you! :)\\n\\n\r\nP.S = If you like horses you might like this show, too! I am a major horse lover and having a horse in the show made it even better in my opinion! :D",
            "date": "2012-10-04T08:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 74071,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1334575.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/alexdibo",
                "username": "alexdibo"
            },
            "url": "https://myanimelist.net/reviews.php?id=74071"
        }
    ],
    [
        {
            "content": "For a long time, people have argued whether originality truly plays a role into the quality of a title. In any media where there is an audience and a profit to be made, it's natural for many writers and artists to take inspiration from a tried and true formula. Though they may take steps to break from the circle of homogeneity and establish their own identity, deriving elements from other successful titles is inevitable.\r\nBeing a part of the conventional genre of high school drama, Tari Tari is certainly no stranger to this pattern.\r\nThe story takes place during the final year of high school for Wakanaand her friends Sawa and Konatsu. Immediately after receiving a scolding from the strict vice principal, Konatsu decides to quit the choir club and start a new one by herself with the aid of her friends, as well as the later addition of two male characters: Taichi, a diligent badminton player, and \"Wien\", a peculiar transfer student from Austria. Of course, things don't go as smoothly for Konatsu as she was hoping they would, receiving an initially hostile reaction from Wakana who accuses her of fooling around and treating music as a game. In an attempt to show overcome her stress, Konatsu sings outdoors in public and gathers the attention of her aforementioned friends - finally assembling enough members to establish the club and push forward with her ambitions. \\n\\n\r\nOn the surface, Tari Tari seems like a standard coming of age story with a musical focus. Though the music remains a principal aspect of the anime, it primarily serves as the catalyst to bring the characters together and force them to overcome their own individual issues. For Wakana, these issues involve the regret surrounding her deceased mother, an accomplished musician who taught her how to sing and play piano. For Sawa, it involves her equestrian passions and love for horseback riding, much to the disagreement and discord with her parents. For Taichi it follows his ambition for badminton, while for Wien it is about his desire to preserve justice. \\n\\n\r\nWhile the series is focused on teenage drama, what it excels at is making each character's issue relevant and believable by using the strengths and weaknesses of the characters to evoke emotion from the viewer, instead of relying on the tired routine of melodrama. Much of the episodes focus on Wakana's previous passion for music, with her past and the relationship between her mother being explored as her story arc progresses. Her avoidance of music is given explanation and reason, while the revival of her passion feels meaningful as she comes to terms with the past and begins to see things in a new, positive light. Each question is answered and each issue is resolved, while new ones are carefully set to take their place and give reason for the viewer to be interested in subsequent episodes. A frequent problem with teenage drama in fiction has always been the reliance on trite dialogue and melodrama instead of a coherent narrative, but Tari Tari manages to feel realistic while capturing the important stage in one's life between adolescence and adulthood. The 13 episodes here have been used in a highly productive fashion which succeeds in giving each character substance. \\n\\n\r\nSadly, the same amount of detail and depth isn't given to all of the characters. Taichi in particular receives very little growth over the course of the series, resulting in his own passions and issues being seldom explored. Aside from filling the necessary role as the fifth member of the club, Taichi ultimately adds very little to the story aside from developing a romantic interest in Sawa that is only vaguely hinted towards. Other issues in the characterization come from Wien's backstory and story arc, and while he's given sufficient character development in the later episodes, the resolution is surprisingly trivial given the amount of foreshadowing earlier in the series. His childish desire to defend justice is sympathetic but the lack of consistency obstructs his story arc from wrapping up in a satisfying manner. It's fortunate that Wien himself is a unique and exciting character, being an amusing transfer student that frequently misuses and exaggerates Japanese gestures, often with comedic results. It's hard not to grow attached to him over the course of the series. \\n\\n\r\nAnother common element in Tari Tari is the presence of an antagonist: the vice principal, who strongly opposes the club for what she perceives as them simply fooling around. As with most stories, she's initially portrayed as being cold and unlikeable to build up conflict, though remarkably her character is given just as much growth and backstory as any of the main cast. By the end of the story, her cold behavior makes full sense and she herself learns to overcome her past issues as a result of another character's own growth. Rather than simply serving as a plot device, the vice principal develops into a realistic and believable as well, which makes her cooperation with the main characters during the final episode all the more significant and meaningful. \\n\\n\r\nBeing that Tari Tari is an anime focused on music, it's a bit disappointing that the quality of the music itself is nothing outstanding or noteworthy. The background music is rarely noticeable and the songs that the characters perform are all fairly juvenile and amateur, though the emotionally-driven \"Kokoro no Senritsu\" is a great addition to the soundtrack. The climactic song performed in the final episode is also well-executed, having full instrumentation to back it up and give it a more professional approach. A clever trick is also used during the ending track, with Wakana pensively sitting apart from the rest of the main cast until her passion for music is revived in the later episodes.\\n\\n\r\nThough not visually superb, Tari Tari benefits from its complex and detailed scenery which is based and modeled upon real locations. The school and the area in which the characters all live in feels very much authentic and distinctive, with impressive lighting and many dynamic camera tricks used to further accentuate the scenery. Many titles involve a high school setting but Tari Tari is one of the few that effectively build the school environment. For an anime that focuses on realistic characters, a realistic depiction of the setting is paramount, and luckily this important detail is not forgotten. The end result is an anime that looks and feels polished, with very few off-model scenes. \\n\\n\r\nTari Tari is a title that stands out not for its setting, nor its story, or even its well-developed characters. What sets it apart from the multitude of other similar titles is how it manages to synthesize all of these elements and convey a story with eloquence and reason. It exemplifies exactly how teenage drama should be conducted in a story. When so many series subscribe to the notion of \"the more crying and yelling, the better\", a title such as this is a breath of fresh air and proof of how effective this genre can be when executed efficiently. It certainly has its share of mis-steps and doesn't achieve excellence in any one aspect, but it would be hard not to recommend Tari Tari as a solid title and one of the more noteworthy in recent times. Why not cast aside the preconceptions and enjoy the ride?",
            "date": "2012-10-15T09:05:00+00:00",
            "helpful_count": 366,
            "mal_id": 75023,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=75023"
        },
        {
            "content": "The drama based on the school club is about as tried and true of an anime theme as giant robots and beach episodes.  In that case, Tari Tari certainly doesn’t break any new ground.  It doesn’t particularly do anything amazingly well or put a new spin on the genre or feature memorable characters or scenes that will stand the test of time.  But despite it all, it managed to still be a fun, fully enjoyable, and worthy investment of my time.\r\nTari Tari revolves around a group of five high schooler's who even though they all have very different goals in life doshare a common interest, music.  Singing, in particular.  They all find themselves in a newly formed club to sing together, for the joy of singing, and not under the structured rules of the other related clubs.  As expected we have plenty of drama and squabbling with the power that be as they try to crush our little upstarts at every chance.  But despite the clichéd sounding themes of the main plot it does manage to deliver an overall story that is pretty well rounded and within the realm of reality. \\n\\n\r\nProbably what Tari Tari does best is give us five believable protagonists who all struggle with their own problems, mostly typical of your average teenager on the cusp of adulthood.  They have realistic and achievable dreams and goals that I think the average viewer can relate to, unlike many of the fantastical settings most anime are based in.  Not to say this is a bad thing in all cases, I just think that it’s refreshing now and then to have more down to earth characters.  The storylines featuring Wakana and Sawa were clearly the highlight of the series, and even though some of the smaller subplots weren’t really adequately wrapped up I found myself with little to complain about overall.\\n\\n\r\nBecause it doesn’t allow itself to get buried underneath a girth of over exposed side characters, Tari Tari's cast really shines.  I would challenge anyone to find even one of the main cast that they couldn't like.  Even though the show does not really have any one character in which the story is told through, the majority is seen, not unexpectedly through our three female leads.  Mostly because of the strength of their own personal arcs, Wakana and Sawa really stand out from the rest.  In particular I found myself drawn to Wakana who has the most heart-wrenching back-story.  The whole dead parent plot device has been done to death but I felt her story was very moving and powerful.\\n\\n\r\nOf the series antagonists and side characters really only stands out, the vocal club advisor and Vice Principal Naoko Takakura.  While she is at first glance just you’re run of the mill constipated anime bitch, she has a humanity about her that makes you feel for her.  Too be honest I felt her story was just as interesting as any of the main characters, perhaps because it was also tied to Wakana's story.\\n\\n\r\nThe vocal cast features a good mix of seiyuu veterans and newcomers.   While I enjoy hearing some new voices,  it’s always nice to hear a couple of my favorites such as Saori Hayami and Ayahi Takagaki and a great deal of my overall enjoyment of Wakana’s and Sawa's characters was due to their performances.  As a show about music you would also expect a great deal of songs, which there are.   Most of these are performed by the cast.  The ED theme in particular was my favorite and never found myself growing tired of it.  The OP, sung by AiRI is a veteran of many other anime/game projects people are likely to be familiar with but this was best song I have heard from her yet.\\n\\n\r\nI loved all the character designs for the main cast, as they all had believable body types and mostly looked their ages.  Konatsu looked a tad young but a pretty minor complaint.  The backgrounds and settings were gorgeous; however some of the animation looked a little stiff and awkward (Such as Konatsu's running).  Some of the adult characters looked pretty strange and unappealing to me as well, particularly the adult characters that all had some really creepy looking lips.  It's just a style that generally does not appeal to me.\\n\\n\r\nSo despite my high rating of Tari Tari is it a really amazing anime?  No it isn't.  But it is very good.  In a year that really hasn’t featured a lot of really great shows, Tari Tari stands out as one of the years' better ones.  If you’re in the mood for light hearted school drama, you should find plenty to enjoy with this one.\\n",
            "date": "2012-09-25T17:49:00+00:00",
            "helpful_count": 131,
            "mal_id": 73295,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=73295"
        },
        {
            "content": "At first look, Tari Tari seems to be one of those animes that completely focuses on School life, that applies comedy in certain areas, with a cultural festival to wrap everything up or something. \r\nBut I was wrong Tari Tari is one of those animes where it focuses heavily on the drama of each main character, with slight comical scenes and is also a slice of life. For people who compare this to K-ON there stupid, there a completely different genre, K-ON is more comedy oriented while Tari Tari is more drama. Just because they both have music involved there not the same, you wontexactly call Code Geass similar to any of the Gundam anime just because they have mecha in....\\n\\n\r\nStory 8\\n\\n\r\nThe story is 5 high school kids forming the choir club due to the main character Konatsu unable to \"Shine\" in the music club. The main story involves around each of the main characters story providing a very nice slice of life drama that involves the characters family, individual problems or simply just friends hanging out and having fun. Although there is another main story that involves the choir club's activity and their fight against the schools music club or something along those lines. But really its just jealously.\\n\\n\r\nArt 8\\n\\n\r\nTari Tari is very well animated, the animation is fairly modern and is very similar to Hanasaku Iroha for those familiar with that anime.  Each character design is done fairly well and is realistic unlike some animes that provide a simple sketch with not a lot of detailed. I especially like Konatsu character design, i find it pretty cool and modern especially the bits when she has her headphones on. I know for a fact to many people comment on the size of Sawa's tits, its big but for some reason everyone keeps commenting some very \"disturbing comments\" about them. The background is pretty well animated, its to be expected from an anime that came out in 2012.\\n\\n\r\nSound 9\\n\\n\r\nThe concept of Music was quite special in this anime, the music and sound itself was part of the Story rather than just trying to make scenes better. The OST is quite well done, they use the song's which the character made as OST which is pretty cool. Also the ending song video changes when each character situation changes, not a lot of anime's does this although its only minor changes.\\n\\n\r\nCharacter 9\\n\\n\r\nEach character have their own difficulties whether its family problems or problems associated with their dreams. Each of the character story is detailed to the point where it is rare to find bits undeveloped and it often gives you a heart warming feeling/tear jerking moment once it ended, making you think \" Ah that was unexpected but i'm happy for them\". The personality of each character also often provides some drama, Wakana's personality for one, often causes quite a lot of drama/difficulties at the start of the anime when she wasn't close with everyone. But it gets better as it progresses.\\n\\n\r\nEnjoyment 9\\n\\n\r\nTari Tari was one of those few animes that have actually made me laughed and cried, the other anime that made me do that was Clannad. While this anime focuses on slice of life drama, its comical moments are pretty good especially the ones focus around messing with Maeda, ah you can't but laugh at how gullible he is =P or his \"vocal training\" with Taichi. Or there market ranger cosplay, Konatsu's \"Curry punch!\" =P.\\n\\n\r\nOverall 9\\n\\n\r\nOverall Tari Tari pretty much has everything you can ask for from a slice of life anime, from drama to comedy. If your one of those viewers that want something with modern animation, great sound and a amazing story that doesn't make you want to pull your hair out at every plot twist then Tari Tari is definitely something for you. It is quite possibly one of the top 3 best animes in this current season alongside Sword art online and Kokoro Connect. (For readers who might say \"Hyouka is better!\" Hyouka was last season not this season!)",
            "date": "2012-08-06T04:05:00+00:00",
            "helpful_count": 68,
            "mal_id": 68855,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1293793.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/quadnia",
                "username": "quadnia"
            },
            "url": "https://myanimelist.net/reviews.php?id=68855"
        },
        {
            "content": "It is said that music soothes the soul. There is always at least one song that can send shivers down our spine and play games with our fragile hearts; it can be interpreted in various ways depending on the individual. The way music plays our heartstrings can be beautiful and majestic, yet also painstakingly depressing. It tickles our souls nonetheless. \r\nThe story of Tari Tari is best described as arc based plots. While overall the story is very enjoyable, I also believe it takes a very safe approach with regards to adhering to common tropes rather than striving for the something new and interesting. Thisisn't necessarily a bad thing considering that the story is presented in a satisfying, coherent fashion, but playing it safe also creates a lack of remembrance. While the show revolves around the choir (and sometimes badminton) club, there are also many issues addressed outside of the club that the audience can relate to.\\n\\n\r\nOne of the strongest qualities that Tari Tari has is that it doesn’t try to be something it’s not. It’s not a part of the romance genre and it strictly stays that way. It also doesn’t utilize fan service as a cheap gimmick to attract an audience because that isn't what the series is about. Despite appearances of being a run-of-the-mill moe slice of life, Tari Tari grasps strong themes and articulates them pleasantly. It’s a heartfelt story about coming of age and dealing with the struggles of life.\\n\\n\r\nThe art and animation for Tari Tari are nothing too exceptional, but still good in my opinion. I really enjoy the quality that P.A. Works brings to the table, and I've enjoyed many other works by them. From the characters to the setting, and the animation itself, Tari Tari is visually pleasing.\\n\\n\r\nThe sound portion of Tari Tari caused me a slight bit of confusion. Given that the series is of the musical genre, I figured there would be more music involved in the sense of frequency versus actual quality. Instead what I got was quite a bit of the opposite, which I was perfectly content with. While there is a feeling of a lack of musical performances, Tari Tari's quality of music was exceptional. \\n\\n\r\nSomething unusual, yet intriguing about Tari Tari is the lack of a real main character. It's not required for a series to necessarily have a main character, however, in this case, the lack of one causes a slight impairment to the series. Supposedly the main characters are the members of the choir (and sometimes badminton) club, but realistically the differences in amount of character development is drastic. Wakana's story arc expands throughout nearly the whole series, whereas the other characters get substantially less time to develop. While the characters themselves are entertaining and likable, with Wien as a notable mention, it's a bit of a shame that they don't get much of their own story. On the contrary, side characters such as the principle and vice-principle get a bit of unexpected character development as well. There is a sense of realism depicted by the characters of Tari Tari; they each have charm, individual problems and aspirations, strengths, and weaknesses. It makes them a likable bunch.\\n\\n\r\nWith all things said and done, I thought Tari Tari was nothing short of impressive. It was remarkably refreshing to watch a series that doesn't capitalize on fan service (of the sexual manner). Hopefully more anime in the near future will keep an open mind and adapt this mindset. Sadly, I doubt it. \\n\\n\r\nThe beauty of music is that there is no good or bad, better or worse. Each and every song is just right for someone out there; it just may take a while for the right person to listen. While Tari Tari doesn't perfectly hit all the right notes, it certainly stirs the melody of the heart. If you enjoy slice of life with a dash of drama and music, Tari Tari just might be the right song for you.",
            "date": "2013-11-30T21:06:00+00:00",
            "helpful_count": 63,
            "mal_id": 122169,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/586079.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Satire",
                "username": "Satire"
            },
            "url": "https://myanimelist.net/reviews.php?id=122169"
        },
        {
            "content": "High school. Ya, we've all been there (or at least most people have). Some people likes it, some people are indifferent about it, and some people hates it with a passion. The times we spent at high school may be a different experience for everyone but it is because of these experiences that we learn more about friendship, life, and most importantly, about ourselves. This series explores the life of what a final year  of high school in the minds of several friends in the “Choir and sometimes Badminton Club” as they prepare their journey of their adulthood and into the future.  \r\nTariTari is one of those unexpected series of the season. In one way, there's not much action or excitement watching a bunch of cute girls doing cute things. In another way, it's a lighthearted school drama that details a story driven by friendship between a group of students who have their dreams, goals, ambitions, and mostly importantly, each other. That's right, Tari Tari is the rare gem of this season and one you can't buy into your heads without embracing its styles and themes that brings to its viewers.\\n\\n\r\nThe series is relatively new that is adapted from the manga written by Evergreen. Tari Tari is tagged with music, slice of life, as well as school life so guess what, the series takes place at a school setting. Some of you might feel less enthusiastic about a series regarding to school life. After all, we got  like a million of those already and who needs more. Yet, Tari Tari here presents a sweet tale of music melancholy that has a charming cast and a refreshing drama that is memorable.\\n\\n\r\nThere are five main characters in the series that all debuts in its pilot episode. Count them with a hand. Five characters and all of them have identical shaped heads but different personalities. \\n\\n\r\nFirst up, we got Wakana Sakai. She is what I would call the stubborn young lady. Despite having a strong voice with real talent, she refuses to sing. However, after certain circumstances, Wakana learns more about the true values of family and dedicates herself for the mother that she loves so dearly. Then, we got Sawa Okita who wishes to turn her dream of becoming a professional jockey into a reality. She's what I can see as probably the Yamato Nadeshiko of the club. Yet, below that outer shell hides an intensity that has vibes which can invoke much drama. Finally, we got Konatsu Miyamoto who makes up the balance of the group and seems to be the cheerful type of girl who likes to get involved with others but truly wants to help her friends. These three girls here all spice things up in the series with their conflicting personalities and ideologies.\\n\\n\r\nThe boys in the series are also noticeable at different stances. They won't let the girls walk all over them especially Taichi Tanaka who wishes to expand his badminton club. He is on a level of stubbornness with Wakana but deep down has a kind heart. His best friend, Atsuhiro \"Wien\" Maeda is there for him even though the duo has nearly completely opposite personalities. \\n\\n\r\nSo, here we are, the Choir and Sometimes Badminton Club. It's hard to say who is the leader as all of them have different parts in the story. They all have their dreams whether becoming a jockey, a professional tennis player, or finishing a song for a person they love. It's like high school you know, especially during the senior year when you start wondering about your future. \\n\\n\r\nThe series' episodes sometimes shifts focus and maintains on a specific character of the club. Yet, it brings out a sense of realistic feeling that we can relate. Tari Tari is a series that is character driven and all the members of the Choir and Sometimes Badminton Club gets their chance to shine whether individually or as a whole. The circumstances that leaves some of these characters as who they are is also entertaining to watch. Weird huh? Slice of life series often seems like reading a book where we watch a characters' life develop and their every day circumstances. Yet here, Tari Tari presents some sense of entertainment that allows us to taste a bit of realism of what the final year of high school feels like. (even for those who's already been there)\\n\\n\r\nP.A Works (Angel Beats!, True Tears, Hanasaku Iroha) is involved in the series. Thus, you can expect some similarities if you're familiar with the studio. Hanasaku Iroha is especially the case here considering the various similarities and that slice of life nostologia. The visuals of the series is also similar that brings simple school life artwork to life. Some of the episodes are deeply colored but overall retains that simple yet realistic image that gives off the slice of life feeling. There are times some childish yet cute animation sequences with miniature version of some of the characters. Overall though, the artwork visuals are above average.\\n\\n\r\nThe overall soundtrack coordination and music in the series brings out a general lighthearted melody in the series. Jin Aketagawa (Hatsukoi Limited, Honey and Clover, Toradora!) presents his skills into  Tari Tari with his experiences involving school life melancholy. The OP song \"Dreamer\" by AiRI is a symbolic term that reflects what people can do when they try hard and with the help of their friends, can make dreams come true. The ED songs here though are much more interesting to look at. In the first few sequences, there's not much development with only a lonely girl (Konatsu). As the episodes progresses and as the club grows, the ED songs features more ensembles with the cast. \\n\\n\r\nThe fact that the series is also tagged as “music”, you can expect some talented tunes beating into your ears. Unfortunately from my respective, I can't really agree with such a real talent coming out the mouths of the characters. It's just fairly average but with their ambitions, the club can make it quite far. Later on though, they bring more amusement into the show and their inner hero awakens within them bringing forth more drama. Speaking of which, there is definitely drama in the series despite not being explicit detailed. Drama takes place into the eyes of the vice principal who has a grudging attitude. It reminds me of this guy I met during high school. He would berate students for the tiniest of mistakes and hands out detention slips like free samples at Costco. Yet, as the series progresses, we can see some reflection of the vice principal's past and what she's been through. Although not the most likable character in the series, it's interesting to see her development involving the members of the cast.\\n\\n\r\nUltimately, this series is a rare gem of this season that takes slice of life to a different level. It is a school drama with a likeable cast of characters of different personalities. They bring forth joy, entertainment, drama, but at times also emotions that we all feel as part of being human. The series artwork has realism and is natural like the way a high school experience should be. The soundtrack orchestrated fits within the lighthearted mood of a typical slice of life series. The story itself focuses on the individual characters as well as the Choir and Sometimes Badminton Club as a whole. It's dramatic and entertaining to watch even though. Still though, don't expect much surprise as the series does follow with some cliches and can be repetitive at times. Additionally, the series has many borrowed themes from other school life series so don't expect the unexpected.\\n\\n\r\nSo, what do you think? Still want to watch Tari Tari? I know high school has a different view in the minds of different people but it's an experience that most of us have or will explore in our lives. During that final year, it's time to think about the future and with friends as well as a strong ambition, there's nothing we can't accomplish.\\n",
            "date": "2012-09-23T18:44:00+00:00",
            "helpful_count": 46,
            "mal_id": 73115,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=73115"
        },
        {
            "content": "All right.......so far, this is my first review, and hopefully not the last. I'm sure a few people would know my name, but that doesn't matter. As someone who watches over 8 or 10 of the anime series per season, along with other anime/manga stuff, I'm busy. But I believe this series deserves my first critic.\r\nI had good, if not the up most, expectations for Tari Tari, and it seems to have answered it with just the first episode. I'm sure there will be more to come, but I believe the first episode has done a magnificent job. So far, the story (for me) isinteresting, the art is smooth, the music in very entertaining, and other elements caught my attention. I might edit this review later on, but for now this is my opinion.\\n\\n\\n\r\nStory:\\n\r\n9/10\\n\r\nAt first, like some other folks, I believed this story was going to be another \"a circle of friendly girls\" type of anime series, which there seems to be a good number of them in the last few seasons. But, since it isn't, I was thankful.\\n\\n\r\nThe plot seems to revolve around not just one, but around a group of students of five, all with different interests. Though it may seem that one girl, Konatsu, is at the center due to her being the one trying to assemble the Music club in the anime, I believe she isn't really. I also thought that Wakana was at the center also when I saw the first 5 minutes. But because of how the plot is assembled and presented, I feel that it revolves around not just the two, but also horseback rider Sawa, lonely Badminton player Taichi and transfer student Wien.\\n\\n\r\nFascinating and eye-catching, the story is somewhat different yet similar to the usual high school anime series I've watched. The idea of creating a new club is technically a reused plot, but the characters introduced to fill into this plot really made it interesting. I look forward to how it'll be in the future.\\n\\n\r\nArt/Animation:\\n\r\n8/10\\n\r\nThough it may not be at the level of \"scenery porn\" (check here http://tvtropes.org/pmwiki/pmwiki.php/Main/SceneryPorn), the background, character details and other visual elements made me feel comfortable with the series. Smooth-flowing, though I believe I'm not one who ever tries to negatively critic art, I'm sure I cannot say that I know what is truly good anime art and what is not. Still, the animation here has that comfortable grasp, as I've seen this art style in many of PA Works anime.\\n\\n\r\nMusic:\\n\r\n9/10\\n\r\nFor such a humble anime series, the music fit quite well. The OP and the animation that went with it made the anime series more attractive, while the ED drew me in, telling me to watch the next episode. The sound effects and soundtracks were ear-catching, and lovable. I'm pretty sure those good songs and BGMs were chosen as it seems this series has music close to its core. Konatsu and Taichi sang quite well, and I'm looking forward to the rest of the cast singing too.\\n\\n\r\nOh, not to forget, the use of \"Reflectia\" for the chorus in the first episode really made a good impression on the anime. I applaud for that specifically.\\n\\n\r\nCast/character:\\n\r\n9/10\\n\r\nEach character is memorable and also the kind of people I would like to associate with. As said before, I believe there is five \"main\" characters, and no one is truly the main focus.\\n\\n\r\nKonatsu: A cheerful and upbeat girl who loves music. It seems to be that many recognize her by her \"blonde\" hair, though I would like to say that it is more of a light brown color. But that aside, her physical character design fits well with her personality. Her VA did well with the singing also, which I liked.\\n\\n\r\nSawa: A more mature girl who is friends to Konatsu. A horseback rider at home, she also participates in a club at school. I yet again feel the character design fits the personality, but I do have to say the VA choice was close to perfect.\\n\\n\r\nWakana: A girl with a mysterious past. It seems to be that she's hard to approach...this character is my favorite in the series, and that's possibly because I love the character design, plus the personality she presents to the audience. Her VA choice was also a perfect one.\\n\\n\r\nWien: A transfer student from Austria. This character's background is not dug up much in the first episode, though I do have to say he over-studied the Japanese culture. I'm quite fond of his personality and character designs, being the usual brown-haired nice guy. When I looked into his VA, I was stunned at how well his VA did for his first voice acting role. He's a promising VA, but nonetheless....\\n\\n\r\nTaichi: Badminton player. Again, no much is covered about him in the first episode, but I do know that he has this loyal and prideful personality. His kind of character is a somewhat necessary fit into our current cast, so I'm appreciate that his character is in the series. Va, yet again, did a good job portraying his character.\\n\\n\r\nOverall:\\n\r\n9/10\\n\r\nLots is to be expected of this series, if not infinitely. I am sure there are some who will agree with my review, and so who won't, but I invite all of you to at least try and take a good watch at the first episode at least. Thank you.",
            "date": "2012-07-04T04:22:00+00:00",
            "helpful_count": 36,
            "mal_id": 65287,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1165241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/GreenMoriyama",
                "username": "GreenMoriyama"
            },
            "url": "https://myanimelist.net/reviews.php?id=65287"
        },
        {
            "content": "There was a time when children watched decent American cartoons and Japanese anime on TV. Then around 10 years ago, at least in Germany, the quality of the shown material worsened rapidly. Animes were cut out of the program nearly completely, most of American and European productions lost all value, and so my time in front of the TV mostly ended. I am so content now that there are other ways to watch anime and I don't have to miss heartwarming anime shows like this one, Tari Tari.\r\n\"Where did I come from, and where on Earth am I heading?\"\r\nSo then, what is there to expect?...actually a bunch of high schoolers who search for a way to graduate properly and to live on after. For Sawa and Wakana, it is a struggle because they have to face tragedies or objections within their families, and for Konatsu it is a fight to overcome an embarrassing past experience. The story shows their efforts to bear with these burdens and how to remember their high school time: through the passion of music. Together with Badminton-fanatic Taichi and the peculiar Austrian student \"Wien\" they form the (not only, but most of the time) Choir Club and begin to understand what it means to live for something.\\n\\n\r\nThe story is kind of slow-paced, but has a clear goal and gets you hooked up especially during the last episodes. The music theme is transported throughout the series, though I would have liked to see more choir performances. The ones you will see, however, are quite a pleasure to hear to, notably \"Melody of the Heart\", which gave me shivers at the end of episode 2.\\n\\n\r\nCharacter-wise I cannot think of anyone who I despise for being there. They all have a personality that interacts well with the flow of time, and also the \"antagonists\" get a decent grip in the whole picture for a 13-episode-SoL-show. Character development is mainly focused on the female characters, for they overcome their burdens and Konatsu in particular develops a firm mind to carry the choir towards their mutual goal.\\n\\n\r\nAnimation and art serve their purpose: The characters look natural and move accordingly. Backgrounds are vivid enough to differentiate, and there are no flaws in landscape or the school, from which I love the view over the sea and the architecture. Voice acting and background music are done without complaints, but aren't special either.\\n\\n\r\nSo then, before I drift away into stating mere facts and make the review unnecessarily long, I would like to mention my final thought. For a Slice of Life anime, a certain vibe is essential to carry the sometimes trivial messages. Tari Tari stays true to its melancholic and friendly touch and shows us another time how purposefulness and friendship can conquer personal and even greater problems. Together with moments worth remembering like the stage performances, what can YOU make wrong in deciding to give this show a real chance? I enjoyed it all the way through ...",
            "date": "2013-10-26T11:40:00+00:00",
            "helpful_count": 27,
            "mal_id": 118349,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3181391.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Xiaraith",
                "username": "Xiaraith"
            },
            "url": "https://myanimelist.net/reviews.php?id=118349"
        },
        {
            "content": "Tari Tari is truly a beautiful anime, simple music and subtle emotions, blending into what we known as Tari Tari. I love the music that’s played, the voices are wonderful and it never ceases to amaze me with every episode.\r\n I don’t think it’s fair to compare it to K-ON, even though they share the same premise, music and art seem a little similar but both are portrayed differently. \r\nThe characters are not the typical or stereotypical character complexes of the anime world; they are far more complex, harbouring emotions that run thicker as each episode is aired. I love the characters and the interactions,it’s lovely and a change of pace from what I usually watch.\\n\\n\r\nIt’s calming, relaxing with the tranquil music that instantly drew me in, both the OP and the ED are captivating. The drama is another aspect that appeals to the viewer, slowly building in and well developed.  \\n\r\nAs for those who simply call it boring, actually watch a few episodes and see the development for your selves, nothing over bearing with the drama but very easily to connect to.\\n\\n\r\nOverall it was a warming, tender and peaceful anime. Good music and flawless characters, I’d be enjoying every moment of this anime and sad to see it end but neverless, I hope it continues with the standards that they’ve upholded so far.\\n\\n\r\nGive it a few episodes rather than just the one to appreciate the anime for what it’s worth, the music, drama and characters are combined into this work of art.\\n",
            "date": "2012-08-07T14:59:00+00:00",
            "helpful_count": 26,
            "mal_id": 68997,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/971423.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Akiska",
                "username": "Akiska"
            },
            "url": "https://myanimelist.net/reviews.php?id=68997"
        },
        {
            "content": "I feel the need to review this since it has such a low popularity rating on MAL and it doesn't recieve too much attention. This anime is very underrated, and I hope this review will help others discover this anime and give it a chance.\r\nStory: The premise of the anime is simple, a group of friends start a choir club and unintentionally/implicitly compete against the schools chorus club who's sponsor is the vice principal who's an alleged **** The anime's plot is so simple and it's nothing to write home about, but it's so enjoyable for it's simplicity. The anime slowly unravels and develops eachcharacter and this may be a slight tear-jerker. 7/10\\n\\n\r\nArt: The animation is great, though character design may seem blandish, the characters WILL grow on you. The backgrounds make the anime's world seem very immersive and realistic 8/10\\n\\n\r\nSound: This anime is all about music, so what can you expect? Don't compare this to k-on!, it's nothing like it. The anime's approach on music is much more beautiful, seeing how totally different people can all come together and relate their problems through the expression of music. Although the songs may not be as catchy as you might expect, by the end you'll be humming the tunes all day and night 9.5/10\\n\\n\r\nCharacters: The characters in this anime aren't cookie-cutter simple, but not too involving either. The anime is so simple so don't expect some deep, mind boggling or heart-wrenching shit, but I gurantee you'll love the characters in the end as mentioned before. 7/10\\n\\n\r\nEnjoyment/Overall: This anime is so heart-warming you will NOT regret watching this one. You'll notice the anime is so entertaining and seemless to watch. Don't have second thoughts on this because this just may be one of your favorites. 8/10\\n\\n\r\nAlso, for those into anime chicks, Sawa may be the love of your life, just sayin",
            "date": "2013-05-15T10:01:00+00:00",
            "helpful_count": 23,
            "mal_id": 97265,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2347429.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/josenewtype",
                "username": "josenewtype"
            },
            "url": "https://myanimelist.net/reviews.php?id=97265"
        },
        {
            "content": "[Spoiler Free review (: ]\r\nCan music solve everyone's problems? No, it can't.\r\nAlthough, sometimes it does helps, gives hope or encouragement.\r\nSome limits can't be overcome how hard you struggle, dead people can't come back to life, things that happened in the past can't be changed and there is no \"magic\" to help you.\r\nThis show talks about moving forward and living in the present. The problems are there and you can't runaway from them. \r\nIn this season lacking of good school slife of life this one caught my attention.\r\nThe topic isn't new, 3rd year students gather together in a club, while facing daily life problems, they haveto decide their future goals, career, etc...\\n\r\nActually, Tari Tari surprised me. I first tought it would be like any other story but it was a pleasant surprise when I found out it had a really well written storyline and a realistic (and solid) plot which had a satisfying ending, deeper then I expected. \\n\r\nThe focus of the story is music of course. But it have a different approach from K-ON! for example. In this show they see the singing as a enjoyable way to spend time but also a way to work out their problems. Something that's very nice because it escapes from the ordinary \"school clubs\" animes.\\n\r\n[Did you know?] The expression TariTari can mean a lot of things, it may be use as a vague expression for saying \"doing this, doing that\" but also means \"variety\" (of music, places, stuff..) It's a interesting title that matches with the story.\\n\\n\r\nTari Tari doesn't have a \"main\" character. Good tales don't necessarily require one. This gives more movement to the plot, and you can enjoy each character development, all together. It may be, indeed, more focused into Wakana and Sawa stories, but this is  solely due to the fact their problems were more difficult to solve than the others'.  \\n\r\nBtw, this show have very interesting characters. They're the type of characters you get attached to. You see they changing through the story and, in the end, cheer for them to have a happy life. It's often said that the friendships you make in your school days will last forever. These characters kind of prove it.\\n\\n\r\nAbout Art,\\n\r\nTariTari follows this new style of setting where the scenario is the exact copy of the original place from the model town. I mean, after you finish watching, if you're curious, you can find it on Google Maps! It's nice because it gives the feeling you're watching something close to reality, which is, the essence of slife-of-life. It was carefully animated. Nothing to complain here.\\n\\n\r\nSomething that kind of disappointed me, was the lack of songs. It been a music-focused anime, I expected more inserted soundtrack and performs from the protagonists. Even though, this doesn't take the merit from the ones they did. Very well performed as you'd expect from a skilled cast like this. This time, they also featured the singing of a real high school chorus for all the bgm and ost. \"Makuhari Sogo High School Chorus Club\", which in my opinion, is one of the best I've ever listened to.\\n\\n\r\nThis season, Tari Tari was my rough diamond in the dirt. \\n\r\nI can't understand why it's still ranked so low... Seems like it didn't made the inicial \"impact\" as others did even it being a nice and entertaining show.\\n\r\n:::Story> 9|10 / Art> 8|10 / Characters> 8|10 / Sound> 9|10 / Enjoyment> 10|10 / Overall> 8|10:::\\n\r\nThx for reading and please give Tari Tari a try :)\\n\\n\r\n~Sry if there're mistakes, eng is not my 1st language.~",
            "date": "2012-10-20T15:56:00+00:00",
            "helpful_count": 22,
            "mal_id": 75449,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/339221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xbobx",
                "username": "xbobx"
            },
            "url": "https://myanimelist.net/reviews.php?id=75449"
        },
        {
            "content": "Overall a very solid series. Great for anyone who likes a light hearted slice of life type of anime, it's very similar to Hana saku iroha, basically an anime drama. \r\nThe characters seem very interesting, you have the Energetic girl (as usual), weird guy, well composed girl and girl with a history. Looks like a lot of potential to me.",
            "date": "2012-07-06T02:34:00+00:00",
            "helpful_count": 21,
            "mal_id": 65467,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1381263.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Stormberg",
                "username": "Stormberg"
            },
            "url": "https://myanimelist.net/reviews.php?id=65467"
        },
        {
            "content": "Tari Tari is a thirteen episode slice of life anime that just finished airing today. I had been watching it weekly for a while now, and after watching the final episode, I will say that overall I felt it was pretty satisfying to watch, but it really didn't do enough to stand out very much.\r\nSo, first of all, Tari Tari is another slice of life anime set in high school. Unless you're really new to anime, you've probably seen a slice of life anime set in high school at least ten times already.  High school is anime's favorite place, and I'm willing to betover 85% of all anime is set in high school. I find this really strange. Like seriously, what do Japanese people like so much about high school? Is it really that interesting a place? \\n\r\nWell, putting that aside, what's it about? Well, to put it simply, it's about five seniors who each all have their own interests (music, horseback riding, badminton, etc). One of the seniors leaves the music club because the teacher directing it is a jerk, and she starts her own choir club. She recruits the four other seniors mentioned earlier and they do various choir club activities such as going to a recital, performing on stage, and setting up for the culture festival. \\n\r\nAh yes, the culture festival. Might I also mention that just about every single anime that is set in high school will have a culture festival episode? It's true man, try naming an anime that doesn't. You'll have some trouble. Not that it's a bad thing, but seeing the same event occur in so many anime makes me feel like I'm seeing the same show over and over again.\\n\r\nGoing back on track, well... that's about it for the plot. Each of the five seniors (and by that I mean the three girls) gets her own arc which consists of around three episodes. Each girl goes through some emotions caused by some sort of trouble, and each girl overcomes her problem and grows stronger. These problems are pretty much what one would expect out of high school students, such as deciding on a future career. The progression of the arcs is really predictable and everything is solved cleanly by the end of each one. \\n\r\nAs for the two boy characters, well, all they get is the big gay dance. Tanaka's badminton troubles are hardly that, and Wien's conflict with his penpal is resolved in a matter of five minutes. These two boys are so underdeveloped it's a wonder why they're even in the anime. My only answer is they're there solely for the purpose of singing the tenor and bass parts of the songs. \\n\\n\r\nSo how's the music? Well, since it is an anime about a choir club, it better have some good music, and I'm happy to say it does. Throughout the thirteen episodes, there's three to four insert songs performed, and they all sound pretty good. The harmonies are great, and the melodies are cute and bouncy. The seiyuus all did a good job singing, and if there's anything to watch this show for, it's the songs. There was one really good background song that played during the sad parts of the anime, but that's about it for the bgm. I can't say I liked the opening all that much though. Haha the very first image of the characters you see in the opening sticks the two boys far in the back. This is a great foreshadow showing how much they didn't contribute to the anime! :)\\n\\n\r\nThe art is quite nice on the eyes. The characters are drawn similar to K-ON/Kokoro Connect/Hyouka, and that's a good thing. While the backgrounds are hardly interesting featuring locations as unique as high school classrooms, high school hallways, high school clubrooms, and outside the high school, they are all drawn really well and are at times animated really splendidly. In particular the last episode looks really nice. There isn't too much flashy animation, as to be expected from a slice of life. You won't find any high budget fight scenes here, nor any super spectacular concert scenes. \\n\\n\r\nSo how was it overall? Well I thought it was good. It didn't break any new grounds, but it was never trying to. If you are a fan of slice of life anime, then I don't see why you wouldn't like this. It's also not 'super slice of life,' so if you hated animes that require you to be really into slice of life (for example K-ON, Natsume Yuujincho, or Aria the Animation), you might still like this one. Though the fact that it's another high school anime really puts it down for me. Cheers to Aria the Animation for not being set in high school! :)",
            "date": "2012-09-24T00:05:00+00:00",
            "helpful_count": 21,
            "mal_id": 73133,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468995.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/makoa69",
                "username": "makoa69"
            },
            "url": "https://myanimelist.net/reviews.php?id=73133"
        },
        {
            "content": "2 + 2 = 4 \r\nThis is a simple equation and a hard fact of maths. If you add 2 and 2 you will have four, its a tried and true fact of life. So why am I bringing this up in an anime review up, well because Tari Tari also religiously follows a tried and true equation,   High school girls + slice of life = Money \r\nIn fact it follows so close that it actually didn't bother to bring anything original or interesting to the table, and because the writers believed so deeply in this formula they thought that it wouldn’t matterwhat they fed us, as long as they stuck to this equation people would watch it. (And the sad fact is, if you look at the blue-ray sales, they where actually right, sigh.)    \\n\\n\r\nSo what is Tari Tari, well here`s a quick summary of what its about.\\n\\n\r\nTari Tari follows 5 high school kids with High school problems who form their own choir club due to the main character, Konatsu, being unable to \"Shine\" in the original music club. The main plot revolves around each of the main characters  providing a look into each ones goals and life ambitions and the problems they face in achieving these goals. \\n\\n\r\nIt all sounds simple enough but here`s where the problems come in, the main plot, that of the group led by Miyamoto Konatsu trying to perform at the cultural festival, while a simple enough idea is so poorly written and executed that it ruins the whole series, confused, let me explain...   \\n\\n\r\nthe idea of a group of teenagers, all with their own problems, being brought together by music and then working to put on a big show is a pretty good idea, Sakamichi no Apollon (kids on the slope) did this idea too but they did it so much better because it was much better written. These characters had their problems too but they where more relatable and, most important of all their problems weren’t solved in two episodes so the story could move onto another character with problems. \\n\\n\r\nAlso the music played a much bigger part in Sakamichi no Apollon, you really get a feel that these characters are being brought together despite their differences because of there love of jazz, with Tari Tari no one really seemed to care about the music club for much of the series and it certainly never seemed to bring them together or help them with their problems, in fact they all solved their problems on their own so what was the point of this series.   \\n\\n\\n\r\nNot only that but there where some really stupid scenes in this series as well. Like with the sub plot about the school being closed down because some rich guy wants to build a hotel, I mean what is this a 90s Disney channel tv movie, come on how lame is this. Theres even a scene where the rich guy is sitting in a big chair looking over an expensive wine bottle while telling the principle hes going to close the school, oh I get it, hes a bad guy isnt he. they should have just had him counting dollar bills while stroking an evil cat and spitting on orphan puppies, if your going to do a stupid scene like that you might as well go the whole way don’t ya think. \\n\\n\\n\r\nBut to be honest this show isn’t really about the plot, its more about the characters and how they fight against their problems and  obstacles in order to achieve there dreams. And while all five protagonists have believable problems, mostly typical of your average teenager, the show again suffers from bad writing and clichéd ideas. You see again they followed a formula with the characters, introduce them and their goals + add problems + shake well = leave to cool for 1 episode then move onto another character. Then there’s the characters themselves, despite this being a character driven story we find out very little about some characters and too much about others,  very little time is devoted to the male characters, they are developed shocking little in this series and given very little screen time and attention compared to the female characters. I mean I suppose there was some attempt to give them depth like with the sup plot about Wien and some childhood friend back in Austria (which again is horribly written to the point where its almost comical) but its very small in comparison to the female cast. \\n\\n\r\nThe main problem with the characters is again the belief of the writers that by adding a few scenes of people crying and some sad back story’s this would count as character development, it does not. Character development is when we the audience can relate to characters who feel like real people and we watch and learn how they grow and change throughout the course of the story, its not devoting two episodes to a character crying because she cant do what she wants then ignoring them for the rest of the story. \\n\\n\r\nNow to be fair some of the back-storys where quite sad and moving such as Wakana`s with the story  of her dead mother, but again it could nave been done much better with some decent writing and some good direction.  \\n\\n\\n\r\nSo anyway the problems with this series aren’t particularly complicated or mysterious, its just a simple case of a series that tried to be quirky and whimsical with characters that warmed your heart, but instead it fell its face face due to bad writing, lack of imagination and  using every cliché in the book. Overall not a bad series but there’s so many other that do this idea much, much better such as  Sakamichi no Apollon, watch that instead.",
            "date": "2012-10-14T06:54:00+00:00",
            "helpful_count": 18,
            "mal_id": 74931,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356852.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/OdysseusUlysses",
                "username": "OdysseusUlysses"
            },
            "url": "https://myanimelist.net/reviews.php?id=74931"
        },
        {
            "content": "Dreadfully boring, essentially it's \"First World Problems: The Anime\".\r\nEssentially the main character wants to sing in her choir club, but doesn't have enough members. Due to some unseen and quite honestly uninteresting previous issue with singing in public, the MC is hellbent on getting people with little to no interest in joining her club to join her club, for instance she black mails her brother, and a few other uninteresting characters into joining her club.\r\nBasically it's a redemption story, based on events that happened prior to the show, and gets vaguely alluded to, and a rather self-centered MC who want others to help her makeup for her own fault by dragging in people who have nothing to do with it.\\n\\n\r\nThere's also faux drama drummed up in the form of the overly-antagonistic Assistant Vice Principal or whatever, who for the tone of the show seems cartoonishly hell-bent on ending the Choir club.",
            "date": "2012-07-17T22:32:00+00:00",
            "helpful_count": 16,
            "mal_id": 66925,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1340973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LUNI_TUNZ",
                "username": "LUNI_TUNZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=66925"
        },
        {
            "content": "Tari Tari is a glaring example of an anime with commonly done themes, as is evident from one glance at its genres— School, Slice of Life, Music, Drama. It is centered on five members of a choir club, each with their own tribulations of 'growing up' as they strive to make the best out of their last year of high school, rectify some mistakes made in the past and accomplish their goals.  There are quite a handful number of titles out there that make use of this subject with the hope of bringing something decent to the screen. Some pull it off somehow whilea few mess up,  and while it's true that Tari Tari is by no means groundbreaking, it certainly lives up to what it attempts to achieve and what any sane viewer would expect it to be— a simple, unpretentious and heart warming school drama.  \\n\\n\r\nLast year P.A. Works, the studio behind Tari Tari, gave us Hanasaku Iroha and anyone who has watched it must have felt the resemblance between the two shows since both more or less take a similar approach in terms of not only the story but also to some extent, the characters and of course the visuals. I must confess that the only reason why I picked Tari Tari was because it seemed to be reminiscent of Hanairo which I admired a lot when I watched it a year ago. Like Hanairo, Tari Tari starts off with a somewhat laid back atmosphere and then takes a dramatic turn, especially towards the end. It delivered everything it could have, given its length and the story line, and probably would have felt draggy if it was any longer. The characters were lively and relatable. The way it was wrapped up, though nothing unique, was quite satisfactory overall. \\n\\n\r\nVisually, Tari Tari was a treat. It was a pleasure to behold the beautiful, detailed backgrounds. The character designs were fine, nothing revolutionary there. It also had some nice catchy songs that fit the bill. I especially like the opening theme 'Dreamer' by AiRi and I'll probably be humming it for quite some time now. \\n\\n\r\nOverall, Tari Tari is your run of the mill school life-esque drama that certainly doesn't stand out much but I see no harm in giving it a try if you ever feel like, that is. \\n",
            "date": "2012-09-25T10:40:00+00:00",
            "helpful_count": 13,
            "mal_id": 73273,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/503355.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Rika",
                "username": "_Rika"
            },
            "url": "https://myanimelist.net/reviews.php?id=73273"
        },
        {
            "content": "After first episode I'm afraid this show have pretty bad future in my eyes, and here is why:\r\nLet's think, combination of which titles could born Tari Tari? First group is school music-related series such as K-On or fresh Natsuiro Kiseki. Second group is titles, revolving around teenagers in japanese country with dose of drama, such as Hanasaku Iroha (also it have same visual style) or Ano Natsu.\r\nAnd basicly I don't think that's a good mash up.\r\nBoth K-On and NK are about \"cute girls doing thier cute things\", there is nearly no drama, and that's why they naturally combines with pop music. In HI and ANwe have huge dramatic part, but they don't do anything creative: in first we have just normal ryokan scenery, in second we see creation of nearly documental movie. Ofc there is pleany of musical series combining both drama and creativity, but they're exploiting rebellious rock/punk culture. And since we have title about choral music, I'm afraid it's gonna be rebellious, to transparent fight vs teachers or globally system, and thus most likely we'll have totally unnatural cadaver of cheering choral music and dramatic plot.\\n\\n\r\nThe only thing I've enjoyed alot is nice backgrounds, I think people who've selected photos did great work.",
            "date": "2012-07-02T02:25:00+00:00",
            "helpful_count": 12,
            "mal_id": 65065,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271134.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Wingerie",
                "username": "Wingerie"
            },
            "url": "https://myanimelist.net/reviews.php?id=65065"
        },
        {
            "content": "Let me just say that this is probably the most underrated anime ever. When I first saw the title on MAL, read the synopsis and some reviews, I thought this was going to be another pointless Slice-of Life anime about high school girls doing things, so I just skipped it without thinking twice.\r\nFast forward a few months and I'd just finished Hanasaku Iroha, and many users recommended this show. Knowing P.A. Works pretty well by then, I decided to give it a go. Now I wonder why I didn't watch it earlier. This show was surprisingly, very very entertaining, fun, and yet so serious andemotional.\\n\\n\r\nThe story focuses on the lives of a few high school students and their personal problems, goals and relationships. In short, this is a very typical P.A. Works drama anime.\\n\\n\r\nOne of the biggest flaws of this show is that it is only 12 episodes long. Anyone who is familiar with shows by P.A. Works should know very well that P.A. Works originals with 12/13 episodes ALWAYS feel a bit too rushed, and the 24 episode series' have the best pacing.\\n\\n\r\nThe art and animation of the show, is really beautiful as expected of P.A. Works. It's too beautiful for such a not so well-known show.\\n\\n\r\nThe sound and music in the show is perfect. If you actually look at the lyrics of the songs in the show and understand them, they really relate to the shows and characters. The composition is amazing. The ED song is the most fun song I have ever heard in a while, and everytime I listen to it I just feel like watching the show all over again. The OP song is also super great.\\n\\n\r\nThe characters of the show have such an amazing chemistry and are just really funny and fun to watch. REALLY their chemistry is just unique, I just don't know how to explain but..\\n\\n\r\nAnyway, I really really really enjoyed watching this show, I still feel like watching it again and again right now. Probably the show that I enjoyed watching the most. There was never a boring episode, and the comedy is just amazing for a drama series. Highly recommend this show!",
            "date": "2018-06-26T00:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 282261,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tworats",
                "username": "tworats"
            },
            "url": "https://myanimelist.net/reviews.php?id=282261"
        },
        {
            "content": "Tari Tari, at first glance is very slice-of-life. First time I trace it, I thought it will have multiple aspects of dance (in my language, \"Tari\" could mean \"dance\"). Overall, it made me gone \"Jackiechan\".\r\nStory is comparable to La Corda D'Oro plus Natsuiro Kiseki without any magic and greatly reduced romance (hint: last episode). Given the struggle to fulfil last wishes together with very intense obstacle, it could have been a deep penalty, but I still forgive the happy ending. Final score: B+\r\nArtwork is very safe. With moe design and fairly tall character (discount Konatsu!), it provides satisfaction and must-not-fap face.The environment drawing is alsorated high. The school is very well-drawn and artistic. Final score: A.\\n\\n\r\nSound could be considered aces for this season. Thanks to Ayahi Takagaki and Saori Hayami (both are top-of-the-line), it generates god-only-knows music. Ayahi Takagaki going high-pitch also in this anime, something rare to find. The sound effect also excellent. Final score: A\\n\\n\r\nCharacter is vary and dynamic. Wakana for example, she turns from tsundere to really caring. This adds multiple increment for already-high score. In fact, all characters in this anime is matured throughout the series. Double-pack this with good design, additional score is assured to be beyond upper threshold. Final Score: A\\n\\n\r\nEnjoyment is almost non-exist other than good ending. Sawa could learn equestrian, Tanaka learns badminton (in Indonesia or China?), Atsuhiro (Wien) finally meet his friend back in Vienna, Konatsu enters university, Wakana is a bit questionable but some educated guess will lead that she manages to study music in university. Fanservice is also minimum to mere bikini shot. Final Score: B+\\n\\n\r\nGrand total: A. \\n\\n\r\nPS: in my anime league, this anime rated in fourth after Symphogear, R-15, and La Corda with GPA 3.95 (head-to-head against La Corda and top two got GPA 4)",
            "date": "2012-09-30T05:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 73707,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Cruiser",
                "username": "Cruiser"
            },
            "url": "https://myanimelist.net/reviews.php?id=73707"
        },
        {
            "content": "As I am reading the reviews for Tari Tari, I can't help but notice that many people think that this show is just another 'Moe' anime. Although I can see the basis of these comments (*Cough *Cough Konatsu) but what Tari Tari differs from the rest is within its characters and story.\r\nStory:10/10\r\nThe main story of Tari Tari is a simple one: it is about the members of a choir club working all together in hope for the final competition. It is nothing out of the norm, but from the daily lives of the members, we have the sub-plots of the members from the choir club.The anime isn't structured arc-to-arc and everything happens simultaneously, so one character could be developed in the first half of the episode and another character could be developed in the second half. But the show somehow manages to holds itself cohesively together and make us understand what is happening. This gives a more real life feel to the anime and it makes the characters more realistic.\\n\\n\r\nThe stories themselves are well written. Although some are cliché but because the show created a realistic environment through its structures, it would make you think that these cliché scenes are actually achievable. \\n\\n\r\nArt:9/10\\n\\n\r\nOne would expect a great visual experience when it comes to P.A. (the same animator for Angel Beats). And Tari Tari is no difference. The visual is well-done, everything seem so colourful and it really made me feel like I was there watching everything unfold. \\n\\n\r\nSound:8/10\\n\\n\r\nAs a show about a choir club that specialises in singing, the sound in Tari Tari isn't the most memorable, you would expect some great ear-cateching singings from the characters but they barely do any singing. Not to say the sound is bad because it is definitely not. But it could do with a lot more improvement.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nNow THIS is where the show shines, in Tari Tari, the characters all have their own problems that they have to overcome, but everyone goes at their own problems in their own ways. But the characters all support each other in the times of need. It is from these interactions that we find out how every character behaves or thinks. \\n\\n\r\nThe character development is wonderful, it secretly develops the character through their every day lives without you noticing. But after you noticed the character development, it is already too late, you already feel whole-heartedly about them. This is going back the the structure of the plot. Everything happens simultaneously, you are not given a fixed camera on one person, instead , you get to see a bit of everyone. You don't get to see all the details with the character developing this way but you were given to see what the animator want you to see, and you feel how the animator want you to feel, with no additions from any unnecessary plots.\\n\\n\r\nOverall:10/10\\n\\n\r\nTari Tari is being treated as another 'Moe' anime because of its art style and its bland story, but there might be a little bit more about this anime that just cute girls and music. Because of its plot and characters,  Tari Tari don't deserve to be called a moe anime, and I think everyone should at least give it a try and then come back and tell me how blatantly wrong I am. But before that, Tari Tari is definitely a 10/10 in my list.",
            "date": "2015-06-05T01:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 189582,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3948381.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/aqing0601",
                "username": "aqing0601"
            },
            "url": "https://myanimelist.net/reviews.php?id=189582"
        },
        {
            "content": "A show I expected to dislike. When I read the summary I was semi intrigued due to the focus on music, but was unsure when I noticed the high school setting. Oh, I thought, another boring and dull and basic high school drama that is just BLAH. Boy, was I wrong...well, for the most part. Tari Tari is definitely not your typical high school comedy, it brought me to tears, made me laugh, and made me realize why I love listening to music. However, to be honest, there were some definite flaws, but not SO definite that it made me ever want it to end.I'll start with the flaws. One major flaw I found was how extremely immature the majority of the main characters acted. If they were middle schoolers it would make sense, but during my senior year of high school I was never so immature. I found it surprising that there was little to no romance throughout the show. I found that somewhat unrealistic considering their ages. Yes, boys and girls can be friends, but COME ON, you spend EVERY DAY with each other and there isn't ANY hint of romance(there is SOME, but nothing that changes the dynamic of the show)? I found that somewhat strange. In addition, some of their actions and routines were childish, cute, but childish nonetheless. I felt it took away from the story, but only for a second. I found really nothing else wrong with the show, at times it was cliche, and I did cringe at some parts just by how cheesy it was, but overall Tari Tari deserves to be watched for many reasons. What reasons? I'm glad you asked! First off, the PARENTS of the show made it for me. I loved each parent, they developed their own personalities and changed along with their children. It was refreshing to see that, because usually the parents are stagnant characters that stay two dimensional, but not in Tari Tari. I found myself loving the parents as much as the high school kids. In addition, THE MUSIC, what absolutely breath taking music, especially the piano solo parts. Each song made me smile, and by the end I was tearing up because I felt so emotionally connected to the song even though I can't speak one word of Japanese. To me that takes skill, and I applaud the writers/producers of this show. I felt invested, I felt loved, I felt friendship throughout the show in a way that for the MOST part was realistic and made my heart honestly beat faster and my smile grow wider. I am an adventure loving, gore thrilling, sword wielding show kinda gal, but Tari Tari has made me want to give Slice's of Life more chances. It was the music, the characters, the art, the overall atmosphere that made me love Tari Tari, and I highly recommend it to all of you! :)\\n\\n\r\nP.S = If you like horses you might like this show, too! I am a major horse lover and having a horse in the show made it even better in my opinion! :D",
            "date": "2012-10-04T08:56:00+00:00",
            "helpful_count": 10,
            "mal_id": 74071,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1334575.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/alexdibo",
                "username": "alexdibo"
            },
            "url": "https://myanimelist.net/reviews.php?id=74071"
        }
    ],
    [
        {
            "content": "At the end of June I was pretty sad. With the end of Kimi To Boku. 2 came an uneasy feeling. Like something was missing. This certain heartwarming feeling I get from watching a sweet, authentic and clever told slice of life-anime.\r\nIn an act of.....desperation I guess, I browse through the summer anime line-up once more to stop at Tari Tari saying \"You'll be my new Kimi To Boku., ok? Be nice to me!\". The addition of music was promising, too. \r\nAfter watching the first two episodes, I wasn't sure if my choice to watch Tari Tari was a mistake or not. The pace seemedakwardly rushed. But staying optimistic, I just hoped it would slow down after that and give the characters some time, to develope and shine.\\n\r\nIt slowed down indeed and focused on the characters, but not in a way it should've. At least I don't think so. \\n\r\nThe characters basically took their turns getting depressed, so they could cheer up at the end of each episode (or after two episodes) through the power of friendship and music. \\n\r\nThat itself is an ok idea, but just not executed well. Instead of dealing with the circumstances the characters are confronted in a subtle way, the show throws it right in the face of the people watching like it's yelling \"HEY, I'M DRAMATIC NOW! Feel sorry for the characters!\" just to demand \"awww\"s and tears of joy later.\\n\r\nThe opening is a perfect example for this. There the female main-characters are shown one after the other all sad and crying, just to pluck up courage then and be happy while singing and laughing with the others, eww.\\n\\n\r\nSpeaking about the characters. There isn't really much for me to say about them.\\n\r\nThey suffered from the shallow presentation and thus could never grow on me, let alone be taken seriously.\\n\r\nThis is not to say that they never had their moments to shine. Every now and then they really succeeded in being charismatic and appealing. Especially in comical scenes. Unlike the drama, those weren't as overly exaggerated. Instead they were done in a more likable and subtle way.\\n\\n\r\nBut the same goes for the whole show itself, I think.\\n\r\nIf it just would've contained the drama (quite) a bit and put more effort in making the characters and their situations more authentic it could've been way better.\\n\r\nOf course it's only natural for a show to specifically trigger emotions, but Tari Tari is just trying WAY to hard.\\n\r\nWith that happening throughout the whole series there was no way I could take it serious as a slice of life-series. It felt like an overdramatized and too theatrical show, that was just there to sneak in some tearjerkers and pretend to be smart and profound.\\n\\n\r\nThe music being one of the main themes I expected a bit more from it. \\n\r\nThe songs and bgm-tracks were nice, sure. But there were very few of them and not really much of variety. Meaning the two \"main\"-songs (from Wakana's mother and her own) sounded too much alike.\\n\\n\r\nI'm not going into detail regarding the animations because they don't really matter in this kind of anime. \\n\r\nI didn't like the character design, but that's just my opinion. No criticism because of that.\\n\\n\r\nAnd the word \"opinion\" is perfect to conclude this review.\\n\r\nI didn't like the way the show forced it's uncreative, linear drama on me. At times I even hated it.\\n\r\nBut I'm not saying that because of that, the show is undeniably bad. There are people who like this kind of presentation and that's fine (more or less). Nothing wrong with that. \\n\r\nAll I wanna say is that people who like smart and well-thought-out slice of life, that is authentic and not too naive at the same time, should stay away from this show. Watch Kimi To Boku. or Usagi Drop instead.",
            "date": "2012-09-25T09:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 73265,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/453775.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Kuchenlight",
                "username": "Kuchenlight"
            },
            "url": "https://myanimelist.net/reviews.php?id=73265"
        },
        {
            "content": "What is a Slice of life? Is it a series that anyone can find something to relate one way or another? Is it a series that tries to emulate the events that happen daily within a group of people? Is it a series that doesn't take itself too seriously, and tries to make simple jokes about those daily events? Or even if it's fulled with drama, it can still be called a slice of life?\r\nTari Tari has a little bit of all of those. It has a light comedy that isn't outright hilarious, drama that isn't the tears-in-your face kind of drama, and it emulatesthe daily lives of five people who come to wish to do one thing only: to sing in their graduation ceremony.\\n\\n\r\nThe beautiful thing about Tari Tari is that, while it doesn't excel in any of those, it hardly has any flaws in any of them. All characters are solid, the difficulties they experience and how they get through them are pretty believable, and it's easy to feel empathy with the hardships all characters go through.\\n\\n\r\nPerhaps its strongest point, and weakest at the same time, is how every character finds the answer to their problems on their own, while receiving, at best, some nudges from the others. There's a lot of respect between the characters so they don't end up invading another person's personal space, and it makes their development much more admirable.\\n\\n\r\nThe series also, surprisingly, doesn't have any fan-service. Despite one of the main characters having rather big bosoms, no one ever addressed them. In an industry where that kind of thing is almost a given, it's refreshing to see characters with all kind of body types not being defined by their body proportions. They all don't fall in overused tropes you see in anime as well. They all feel like real people that aren't defined by one single trait - like a tsundere, a extremely shy person, or any other common trait you can use to define a character.\\n\\n\r\nWhat I liked the most was how every character matures. They all become better people after getting over the distress they had with their respective hardships, and they never do it in an unintelligent, or dumb, way.\\n\\n\r\nI don't usually judge anime by their soundtrack, but Tari Tari has a gorgeous one. From the opening to the choir songs the characters sing, all of them have meaning and lyrics that fit in the story nicely.\\n\\n\r\nTari Tari is an example of an anime you can recommend to anyone. It doesn't force drama on the viewer, it doesn't have fan-service, it has believable characters, and carries a touching message thorough it all. It's the most 'slice of life' of the slice of life anime I have watched. If you're looking for just that, Tari Tari is the perfect watch for you.",
            "date": "2016-09-17T23:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 229269,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4762539.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Neimi45",
                "username": "Neimi45"
            },
            "url": "https://myanimelist.net/reviews.php?id=229269"
        },
        {
            "content": "\"Be kind; everyone you meet is fighting a hard battle.\"\r\nI wasn't going to write a review for Tari Tari, but after I finished it I believe the series warrants a much higher ranking and popularity than it currently holds on this site.\r\nLet me say this, I believe that when it comes to the Slice of Life genre, Tari Tari is superior to most, if not all other series. Watching this series kept me entertained throughout, something SoL often fails to do not just for myself but for many other fans. So, how did P.A. works do it? They've failed in the past, but somehow spitout a diamond in the rough that I think everybody can enjoy. There has to be something that differentiates Tari Tari from the rest.\\n\\n\r\nI'll cover what really separates TT from other series later, but first I'm going to cover the basics.\\n\\n\r\nArt - P.A. Works did a good job with the art. The town and surroundings they created worked well with the story, and I saw very few instances of poor quality animation. I really enjoyed seeing the world created by this studio. The various school and beach scenes I found particularly beautiful. I also thought the homes of the characters were all very well created while being entirely believable. There are, of course, other series with much better art, but there are even more with much worse. I felt the art only added to my overall enjoyment.\\n\\n\r\nSound - Tari Tari should be considered a musical. As the synopsis leads us to believe, music is a major theme of the series. There are several events that revolve entirely around music (almost all of the major ones). I almost always stay away from musicals, mainly because I find they're often poorly directed and awkward to watch. P.A. Works did a good job of making the music a theme, but not the only theme. \\n\\n\r\nSomething I found they did that I found interesting was that they didn't overload the viewer with music. The ambient themes of non-musical moments is subtle yet noticeable, and I believe helped the series forward its message in how the studio intended. In a general statement, I really liked the piano music throughout. I'm not very learned as music as a whole so I'm not going to pretend I know what I'm talking about when I say the music is good. Sometimes that is all that can be said.\\n\\n\r\nCharacter/Story - I put these two in the same category because as someone who writes as a living, I believe that without story there are no characters worth expanding on, and without characters there can be no story. To put it simply, the characters and story are the reason why P.A. works made a real winner. \\n\\n\r\nI loved the characters. I don't want to say I connected with all of them, because I didn't. I don't know what it's like to be Konatsu; I don't have a passion for music at the level of hers. I don't know what it's like to be Sawa; her dreams are of a different kind. This is the strength of the series. I didn't connect with all the characters, but I understood them. I was able to feel for them while not having to stand in the same shoes. They were entirely real. Every single character had a purpose and a personality that you can see and believe. Their inner workings and conflicts were brilliantly displayed. Not once did I find myself rolling my eyes at the actions of certain characters as I often find myself doing while watching SoL. I really have to tip my hat to P.A. Works from staying away from the archetypes that I feel plague anime today. I won't say that the characters are completely unique and whatnot, but they were different to the point where they were refreshing. \\n\\n\r\nThe story was about as Slice of Life as one can get. However, what I enjoyed about the series was that there was not just one major climax. A downfall many SoLs that only run 12-13 episodes have is that the entire thing is a buildup to one major climax in the final episodes. It was nice to see a major event happening every several episodes, because it left you feeling satisfied with what happened, yet knowing that there was still more to come. I will say that I found that direction quite fantastic throughout, especially during the final episode. P.A. Works did a great job making otherwise cliche events enjoyable and a bit different from the rest.\\n\\n\r\nOverall, I would suggest Tari Tari to anyone looking for a quick SoL to watch. It's nothing life changing, but the characters and story are superior to those in the same genre. It will leave you remembering why you began watching anime all those years ago; a good story is always a gift.\\n",
            "date": "2013-12-27T09:00:00+00:00",
            "helpful_count": 7,
            "mal_id": 125843,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/583887.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Nvrtry",
                "username": "Nvrtry"
            },
            "url": "https://myanimelist.net/reviews.php?id=125843"
        },
        {
            "content": "It takes a lot of general unpopularity for an anime to be called underrated. If it's something like Senjou no Valkyria, which is one of the best anime adaptations of a source material ever and a great military anime in general yet it's so unknown to the casual public, or it's like School Days, which is one of the most misunderstood pieces of fiction I ever came across- all of these have one thing in common. They don't get enough credit for what they brought to the industry, which, for me, is an indicator of something being underrated.\r\nTari Tari is one of those anime forme. An under-appreciated and overlooked show, that however works as a perfect example of how slice-of-life anime should like.\\n\\n\r\nThe story of Tari Tari takes place at Shirahamazaka High School. One of our main characters, Konatsu, loves singing, and wants to participate at the recital event held in their school. So she decides to start a new music club. Sadly enough, the things don't go as planned and the people Konatsu wanted to join, refuse her. Still, being pushed forward by her goal, she doesn't give up and continues with her persuasion of others.\\n\\n\r\nThe first on her list is her friend Wakana, who used to play piano as well as sing songs with her mother as a child. However, number of things happened and Wakana has given up on both piano and singing since then. But when Konatsu starts to make progress with the club, Wakana struggles and battles within herself about her reason for abandoning music. Her story, as well as her development, is the main driving force of the show. She is a nice and polite girl, but we can see her change during her struggling period and towards the end as well, seeing her in moments of frustration, happiness and raw emotion overall. I would go as far as saying that she is one of the most developed anime characters of 1-cour shows ever. The dramatic touch on her story was done to perfection, not being over the top, but still remaining somewhat emotional and touching. It's no shame for me to say that she became one of my most favorite characters of all time.\\n\\n\r\nNext one is Sawa. Another one of Konatsu's friends, that as the only one agrees to join her club right from the beginning. She's also a member of the archery club and practices horse riding and horse-archery in her free time. Kind, caring and popular with the boys, Sawa is again a great three-dimensional character, who like Wakana has her own share of problems. They revolve around her dream of becoming a professional horse rider and her dad, a priest, being against it. The drama is once again very well done and includes a little more complexity than what you might think at first glance.\\n\\n\r\nIn need for more members, Konatsu starts to ask around in a wider area. She then asks Taichi, the sole member of the badminton club, to join the club too. He refuses at first, but after losing a bet he made with Konatsu, he's forced to join. Together with him, Wien, a new transfer student from Austria, decides to join too. He's a bit reckless and doesn't get the Japan customs, hence he acts as the so-called 'comedy' character. Being pretty average at his role, but he has some good jokes from time to time. Taichi, on the other hand, is a much more serious person, who didn't want to leave his badminton dream at first even though he was practicing alone for the majority of the time. He also ends up falling to a very unexpected situation at the end, a definition of surprise. They don't really shine with anything but are still a decently made male characters and good support for the main girls.\\n\\n\r\nAfter Konatsu finds all of the needed members, the preparation for the event can start. But even more things that she didn't think about occur as an obstacle before her. She doesn't have a song and she's constantly being watched by the vice-principal. Also, a strange case of bribing and manipulation starts to occur in the school's management...\\n\\n\r\nThe story might not seem that much original or different from other school club anime. And that's right. It isn't. However, despite being simplistic at heart, Tari Tari does it's best at making the story believable, well-paced and most importantly super enjoyable. Great cast of characters surely helps with that a lot.\\n\\n\r\nStudio working on this is PA Works, so the animation is pretty much settled. You just know it's gonna be good. The character designs are cool, but would maybe need a bit more originality. Otherwise, the whole animation is just great and the background look fabulous, like always.\\n\\n\r\nIt's actually funny in a way, but good music anime doesn't have to equal good soundtrack. Look at Hibike! Euphonium for example, where the anime is great, but the general music, outside of their live performances, is somehow lackluster. Tari Tari isn't that case tho. The ambient OST isn't something mind-blowing, but fits nicely into the environment of the show. The vocal OST, on the other hand, is just awesome. The songs are sung by all of the 5 MC's and the acapella feeling you get from it is really unique in anime. Just a shame that the list of songs isn't that big, and they must've to re-use them at times.\\n\\n\r\nIgnoring what I 've said up until now, the biggest strength of Tari Tari lies in its entertainment value. Slice of lives tends to be boring. And that just isn't the case this time around. The great characters, their dramatic problems and even the pretty decent comedy will push you to watch more. I seriously don't think I was ever marathoning a show of this genre before, and I don't think I ever will again. Because Tari Tari is truly special in that aspect.\\n\\n\r\n---------\\n\\n\r\nSimiliar to others, but superior to all of them, Tari Tari still remains the best pure slice of life I've seen. I would recommend it to everyone who's looking for a chill, yet entertaining show. Because if I were to describe Tari Tari in a few words, I would use exactly these. An underrated Gem lost amongst the others.",
            "date": "2017-12-23T07:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 266097,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6348377.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tomm01p",
                "username": "Tomm01p"
            },
            "url": "https://myanimelist.net/reviews.php?id=266097"
        },
        {
            "content": "ok lets begin from the start. At first i dont expect much from this anime. it might just the same anime as any other music anime,with some kind of relationship between the charaters and stuff. But then,towards the progressing of the episodes, somehow,this anime really touch me in some ways. It just so light and kind. its like having a tea under the tree,with the breeze and tiramisu cake and sharing some laughter with your friends in the evening. It was very compact,the storyline is interesting,wait,or could i say it taste like orange juice on a hot summers! very worth to watch! NO reGrets !!!:)",
            "date": "2012-08-06T07:17:00+00:00",
            "helpful_count": 6,
            "mal_id": 68875,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1289183.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xtulthu",
                "username": "xtulthu"
            },
            "url": "https://myanimelist.net/reviews.php?id=68875"
        },
        {
            "content": "At first, I don't really interested on Tari Tari, since I think it'll be just another school slice of life. The story itself somewhat slower for 13 episode anime, which usually got 1 episode for 1 arc/story. However after I watched it, the story get an excellent balance of comedy and drama. Not only balanced, I found the comedy and drama is really emotionally involving and well made. I haven't laughed or feeling sad as much as I watch Tari Tari from watching another anime. \r\nThe art is not the best of all anime I've watched, however what we get here is already really good.Lovely scenery and character design is everywhere. \\n\\n\r\nAbout the sound, there's really no need for a lot of question. Since this is musical based, the songs and the BGM are very good, which most of them are relaxing.\\n\\n\r\nI found the characters are not shallow. Every of them have their own traits, characteristics, etc. There are no character which seems 'just like another impatient girl' or else. Even there are similar characters in other anime, the depth of Tari Tari characters make sure they're different and often better.\\n\\n\r\nI really enjoy this anime since Tari Tari exceed my expectation for a slice of life anime. Most of them just like 'random daily things' which can get interesting at the beginning but boring at the end (mostly they're getting boring in the 6th or 7th episode). Even Tari Tari story progression is slower, it didn't get boring because of the lovely artwork, characters and of course the slow story itself. If I can say I'm really excited for the new episode for Tari Tari as much as other of my 10/10 rated anime.\\n\\n",
            "date": "2012-09-07T10:44:00+00:00",
            "helpful_count": 6,
            "mal_id": 71769,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/260385.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bluelittledino",
                "username": "bluelittledino"
            },
            "url": "https://myanimelist.net/reviews.php?id=71769"
        },
        {
            "content": "2012 Series by P.A. Works\r\nSlice of School Life with a hint of Music!!!\r\nReview from my POV (w/personal biases)\r\n(Sp)oiler-ish\r\nPros:\r\n+ This is probably the most straightforward show i've seen so far, which is great in the context of this show. 3rd Person Teen Drama. Nice :P\r\n+ It also leaves you smiling at the end of almost every episode.\r\n+ The viewer has a chance to acknowledge and relate to the protagonists because This show gives each character enough time to develop. Example, Person \"A\" is given 2-3 episodes worth of spotlight w/o completely forgetting Person(s) \"B-E\".\r\n+ The \"festival\" performance.\r\n(personal)+ I thought the small Spanish element was cool. \"DoI hear Spanish?\"\\n\r\n(Sp)(personal)+ Wien is a fan of Super Sentai (Power Rangers for us U.S. kids :P)\\n\\n\r\nCons:\\n\r\n- For an anime that follows a ragtag \"Choir club and sometimes Badminton club\", there's not a whole lot of singing. Don't get me wrong, what was given was really cool, but I was really expecting more.\\n\r\n(Sp)- The principal is kind of a pushover until the last minute (plus what's up with the hair yo?)\\n\r\n(Sp)(personal)- Tanaka cmon man, too little too late dude.\\n\\n\r\nFinal Note:\\n\r\nThis show gave me the same smile as did with Usagi Drop. In the same style too: Not a deep plot, but A simple plot that's driven through relate able characterization.\\n\\n\r\nRecommends: To those looking for great \"surface level\" entertainment. \\n\r\nTo fans of the Slice of Life genre.",
            "date": "2013-03-03T20:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 88595,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1316105.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cruzader93",
                "username": "Cruzader93"
            },
            "url": "https://myanimelist.net/reviews.php?id=88595"
        },
        {
            "content": "I'm a big slice-of-life guy. Anime like Clannad and Hyouka have captivated me with their simple plots propelled by complex, well-thought out characters who experience situations and complications in their ordinary lives that hit very close to home. The charm of such school life adventures persuaded to watch a few of such tales.\r\nTari Tari is such a series. Produced by the creme de la creme of animation companies, P.A. Works, Tari Tari follows the story of four characters, three female, two male, who form a choir club in their senior year of high school in hopes of tying the loose ends in their lives beforemoving on.\\n\\n\r\nStory (6/10): Tari Tari follows a standard structure for a school life series. The tale is told through three or four episode arcs that put a particular character in the spotlight and explore their goals, motivation, and crises in detail. This formula has been proven to work for other series, so there's no denying the logic in choosing this method of narrative.\\n\\n\r\nThe problem is that Tari Tari doesn't pace itself to its 13 episode length accordingly. Three or four episodes is far too much time to spend on a single character out of five, and the arcs are paced a bit too slow. Too much time is spent on fairly irrelevant happenings, such as a low-stakes tennis game and an admittedly humorous Super Sentai parody episode. In a series such as this, the producers cannot afford to waste anytime; everything must be devoted to developing the characters and elaborating the details of its plot. Unfortunately, this  wasted time leaves the show feeling like it ended too soon, damaging its impact significantly.\\n\\n\r\nIn spite of this, Tari Tari's story and arcs are well-constructed and meaningful, even if they drag too long for such a short show. From Konatsu's energetic determination to make her own variant of the Choir Club and bring her different friends together, to Sawa's determination to ride horses professionally despite her father's wishes, each plot is emotional and has exactly as much weight as it should, with no conflict feeling overblown or easily avoided. Scenes swelling with feeling and weight are positioned at exactly the right moments, and each story feels distinct, yet equally effective. Sentimentality and themes of continuing to move on through ruined ambitions and tragic happenings are incorporated into each of these arcs seamlessly and contribute their own two cents to the emotional tone of the series. The arcs characters go through in the course of the series are all significant to the series' overarching portrayal of the good and bad of growing up and moving forward.\\n\\n\r\nWakana's arc is especially effective. Her tale has the most weight of all of the characters and has a really strong climatic payoff.\\n\\n\r\nDespite this, the series simply takes too long on these routes. And as a result, two major characters never get substantial development, much less a story arc. This painful consequence to the series' structure is why I docked it as many points as I did.\\n\\n\r\nArt (8/10): P.A Works does an exemplary job in the visual department for this series. The backgrounds are gorgeous and have a grand sense of scale that crafts a vivid, beautiful looking world that emphasize the beauty in simple locales. The animation is on-par for the studio's works with vivid animation that portrays Sakai's introvertedness, Wakana's confidence, Taichi's abrasiveness, and Konatsu's energy in a way that distinguishes the characters from their bland designs. I counted several times early in the series that I found myself mistaking Wakana for Sakai and vice versa. \\n\\n\r\nSound (7/10): The music can be described in one word: good. The score matches the tone of the show well, the opening theme is memorable, and the choir performances are well-executed. Conversely, the ending theme is utterly forgettable.\\n\\n\r\nMeanwhile, the voice acting is strong, but for the most part, doesn't really stand out. Wakana and Sakai's actresses do a good job of giving their characters unique performances, but there are no A quality acting jobs here.\\n\\n\r\nCharacter (7/10): Tari Tari's personalities are well-elaborated and entertaining. I didn't dislike a single one of the characters. Konatsu's energetic, never-give-up disposition granted her a charm almost instantly and Wakana's confident, straight-woman attitude contrasts her to the more colorful personalities around her. Sakai is quiet, but far from unfriendly, and actually shows her nicer side once the other characters push her to speak out. Her backstory perfectly justifies her behavior, and she has to be one of the most realistic portrayals of an introvert I have ever seen in anime. The relationships these characters have with each other, and the dialogue they share is cliche at times, but their characters still shine through nonetheless.\\n\\n\r\nOur male leads, however, end up being fairly forgettable. Austrian foreigner Atshuiro has an earnest, totally nice personality that is played out to its logical conclusion. The most amount of internal conflict he has is minor, and in his stringent moral code, rational viewers will realize this strife is self-inflicted. Its a consistent character, but because his dialog is often played for comedy, only shades of his personality come through dialog, and the lack of significant conflict for him to go through during the series makes him a static character. Considering a series where the majority of the mains have to go through harsh trials and tribulations to decide their future, this is a bit jarring.\\n\\n\r\nMeanwhile, tennis player Taichi Tanaka is easily the most bland of the main cast. He's one of the characters who has his ambitions crushed, but unlike the other leads, he doesn't go through an intriguing change or trial phase because of it. He plays the role of abrasive jerk with a heart of gold throughout the series and shows little development. A romance sub-plot that had been hinted at early in the story further develops in the last few episodes, but nothing ever comes of this. As a result, Taichi comes off as a third-wheel who could've easily been written out of the show to make room for the other characters, and this is disappointing because of how character-driven this series is.\\n\\n\r\nEnjoyment (7/10): On the one hand, Tari Tari has a lot of appealing qualities. Most of its characters are quirky, yet simultaneously grounded, making them relatable, the art direction is excellent, and the character arcs have a lot of weight. Each piece of these stories is well-crafted, directed, and executed.\\n\\n\r\nMost significantly, the theme captured the last year of these fictional high schoolers academic lives in such a poignant, sentimental way that it was both touching, yet unpleasant to watch.\\n\\n\r\nOn the one hand, it's a beautiful send-off. On the other hand, I didn't really get the feel that life has beautiful things for these characters in the future. There's a disconnect for me as a viewer between the fact these characters are going on to wonderful lives and that their graduation marks the end of their lives in storytelling. This isn't a strike in quality, because this disconnect is part of what makes this effect, but it personally prevented me from enjoying the series as much as I normally would.\\n\\n\r\nOn a more quality-related note, the aforementioned male characters who don't get as much elaboration as the female leads keeps the series from reaching \"great\" level.  The poor pacing is at-blame for this, and the lack of resolution for a key sub-plot makes it feel like the overarching story wasn't carefully thought-out, which lead to such careless mistakes as this. \\n\\n\r\nI appreciated the occasional times the series examined the details of choir singing, because it distracted from the times the series got bland. Tari Tari is so painfully normal sometimes, that it loses some of its charm. The pieces are there; the main cast is mostly strong, the supporting cast is colorful, by all accounts, this should be an interesting series.\\n\\n\r\nBut, somehow, this series fails to really distinguish itself from the grain. There isn't something specific I can lock on to this series does that's different or new compared to its competitors, so I didn't see an enjoyable, distinct school life anime in this show.\\n\\n\r\nOverall (7/10): Nevertheless, this was worth my time. The characters are well-developed and their arcs are relatable, the art direction perfectly fits the setting, and the comedy (when it's not overly quirky), is charming in a plain, endearing way. For all the shortcomings that keep it from being a series that sticks out from the fray, Tari Tari is worth the watch for school life anime fans simply because of how well it executes the standard elements of its genre.  \\n",
            "date": "2015-08-07T19:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 195475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1280771.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/conformityrules",
                "username": "conformityrules"
            },
            "url": "https://myanimelist.net/reviews.php?id=195475"
        },
        {
            "content": "Tari Tari is one of those shows that will leave you with a smile on your face because of its simplicity\r\nBasically, the show is about 5 high-school seniors (3 girls, and 2 boys) trying to form a choir band. The difference between this anime and other \"musical\" anime is that Tari Tari felt realistic. The girls and the boys put effort into making the songs and singing it. They did not just pick up a guitar, and “magically” create music that all high-school students would like. Furthermore, the groups singing voices matched the characters. And even though the music was not extraordinary, I felt happylistening to it.\\n\\n\r\nJust like the music, the art was fantastic. My eyes sparkled as I watched the captivating scenery and the overall artistic style of Tari Tari (okay, I'm exaggerating a little The artwork was decent).\\n\\n\r\nCharacters:\\n\r\nOnly 2 (Wakana and Sawa) out of the 5 characters have proper developments.  Considering that it was only 13 episodes, and took place just during their senior year, I did not really mind it at all.\\n\\n\r\nMy favorite character in Tari Tari is Wakana. She is shown as one of those typical girls that can not socialize well with other people, seems angry, and is not ambitious. However, to me, her personality felt genuine. The way she (angrily) spoke to her mother felt incredibly real. Some might disagree with me on that, but it does happen; we never really realize we are doing something wrong until it is too late.\\n\r\nNonetheless, most of the characters did contribute to the storyline, and made it worth watching. \\n\\n\r\nThe thing that I love most about this anime is the ending. No matter where each member of the group ends up going, their music- their song will always remind them of one another. Although nostalgia can be depressing, it can also be a wonderful thing, Nostalgia can remind you of moments that you value and treasure with all your life.\\n\\n\r\nThis show might not be for everyone, but if you want a simple slice-of life (highschool) anime , give this a shot.\\n\\n",
            "date": "2012-10-05T17:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 74179,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1521511.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/DigestingAnime",
                "username": "DigestingAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=74179"
        },
        {
            "content": "This is a short review\r\nTo put it simple this is the story of a music club that was lately formed, what I can say is It's pretty enjoyable, episode 1 you can tell from the plot that it's about friends helping each other and stuff, of course backstory is a thing as well. \r\nhowever one of the problems I saw in the series is the lack of motivation of the new music club, what do they want, is it to  perform at nationals or get famous, not really, even if you sa Its just for the music motivation is a very important factor inthe anime,\\n\\n\r\nAside from that it seems that majority of the series revolves Mahiru, a DEAD character, I know her being dead does made an impact but it seems that she's becoming more important than the main characters themselves, particularly to Wakana, a little backstro from her is enough, the rest of her screentime after the conclusion of her arc is unnecessary not only that there are some episodes that feels like fillers particularly the power rangers episode\\n\\n\r\nmy favorite character overall is Wakana, because I do think that among the rest she has the biggest development of all, and speaking of development It seems that some character development of majority of the characters we're pretty rused\\n\\n\r\nThe Art and sound we're great that I can say, the Opening was nice though the OST's we're a little too forgettable\\n\\n\r\noverall this anime is plain fun, but if your'e looking for a really interesting slice of life/ coming of age anime then I don't think this is for you.",
            "date": "2018-01-30T07:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 270116,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=270116"
        },
        {
            "content": "In my opinion,Tari Tari is a very interesting anime. Quite unlike other animes I’ve seen actually! It’s at the start of a senior year in high school and the students actually look like high school students…I can say that for sure because I am one myself. Also the animation is amazing~ O.O seriously such clear and precise lines that even normal quality looks HD! Other than that, the plot is quite fast-paced (but that’s what makes it unique), I enjoyed how the last performance wasn’t actually the \"last performance\"...the performance was actually in the second episode! How could soo much happen in just two episodes?\r\nThemusic is also very nice and happy! The song Melody of the Heart, which was performed in episode two, really caught my attention! It was catchy and sweet, not to mention the great choice of singers. It was quite the twist to see how two non-music oriented students could sing soo nicely, especially the short one~\\n\\n\r\nIn addition, I enjoyed how the story didn’t seem to have much romance or a really romantic theme, where the cliche plot of a guy falling in love with a girl and the romance builds up…no…too much of that. I take this anime as a break from all the lovey dovey build up plots! Sure I don’t mind some animes having that sort of plot, but it’s great to watch one without. I take it as a nice change and helps bring me back to real life relationships which usually doesn’t end too nicely :P A nice realistic anime can be really relaxing! So I hope you all will give this a chance; not saying you’ll love it but maybe you’ll like it at the least? :D\\n\\n\r\nSince it is only a few episodes in the story, I can’t say for sure how great of a plot it is however it is very intriguing and gives off a nice carefree atmosphere; with a side of humor. This is the first anime I’ve watched with badminton as a main sport of choice! Personally, badminton is one of my best sports…for I have a fear of other ball-related sports mainly because of my height…o.o Anyway, everyone has a different opinion on different animes, but in my opinion a nice slice-of-life anime with a happy go lucky theme and plot can be really refreshing to watch every Sunday night. It’s a wonderful way to relieve some stress and prepare for a new week with a smile and open mind!",
            "date": "2012-08-26T23:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 70949,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/622079.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MeAnime",
                "username": "MeAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=70949"
        },
        {
            "content": "I usually consider myself fairly good at making flash judgements when I'm deciding which series to follow for a new given season of anime, so I didn't think much of it when I gave Tari Tari a pass.  After all, it was made by the same people who did Hanasaku Iro Wa, and while that was interesting at first, it lost its focus along the way and petered out into mediocrity.  I expected as much of Tari Tari as well.\r\nBut then, as these stories usually go, a buddy of mine brought the series up in a conversation, and that eventually got me startedwatching.  After I started, I found myself waiting for a new episode each week -- because what the characters were going to do next, or how they were going to get themselves out of another pinch mattered to me.\\n\\n\r\nI think this is slice of life done right.  Life doesn't necessarily have a theme or even a sense of coherency to it, but as a story about five high school students brought together by a common interest (albeit some less willingly than others), each episode felt like it was there for a reason.  There are individual mini-arcs for each of the five main characters with a decent focus on each (but mostly on the three girls), and it's as much about friendship and support as it is about their obstinacy toward pursuing music despite the obstacles that lay before them.\\n\\n\r\nThe drama and srs bsns of high school life is lightened by comedy at all the right times, mostly at the hands of Miyamoto Konatsu, a lovable, persistent shortie who doesn't know when to quit.  She's voiced by Seto Asami, and if you're familiar with Chihayafuru then you'll know she's got a certain energy and verve to her voice when she does energetic characters.  She's just great at voicing lovable dolts.\\n\\n\r\nThe other two girls are voiced by Takagaki Ayahi and Hayami Saori.  Now, if you're familiar with your seiyuu as well, you'll notice that all three women are superb at singing.  Takagaki is even professionally trained in opera, and you'll see a bit of it when she sings (hilariously, she does this with a 'Power Rangers' song at one point).  You could say that's one thing I really liked about the series... I feel like there's a lot of forethought in the casting of actors that reflects in the finished product.\\n\\n\r\nThe diverse supporting characters bring in a lot of fun and quirkiness as well.  A hardass vice principal, a cool, ultra casual mom that gets mistaken as one of the character's elder sister, and so on.  There is a sense that the story is set within a community, rather than just isolated to the high school alone (you know those series -- they take place exclusively within the school building and little else is touched upon).\\n\\n\r\nThe animation is just as pretty as its predecessor, with optimistic colours that speak to the (ideal) vibrancy of high school life.  And it's a thoughtful series that doesn't seem to target the same demographic as most series usually do.  There really isn't fanservice at all, and it kind of just... is.  It's not shoujo, it's not shounen, it's not josei, and it's not seinen.  I really wouldn't call Tari Tari a masterpiece by any means, but I found it very enjoyable.  It's a good little pick-me-up.  One issue I had with it was how it felt a bit slow when I had to wait week by week, but now that it's finished airing, you're free to watch it however you want, whether in spurts or by marathoning as well.\\n\\n\r\nI would probably recommend this series to people who like...\\n\r\n- slice of life \\n\r\n- the unnamed 'in-between' of shoujo and josei (it's a series that largely adopts a more neutral or possibly even female perspective)\\n\r\n- amazing singing in general (Don't believe me?  Search 'Quel Guardo Il Cavaliere　高垣彩陽' on YouTube for Takagaki's singing!)\\n\r\n- comedy (Your mileage may vary, but Tari Tari had me laughing out loud at several points, when series usually only get a grin or two out of me.)\\n\\n\r\nIt's probably one of my favourites this season (or maybe even year?).  I hope you'll enjoy it as much as I did, if your boat floats that way.",
            "date": "2012-09-23T18:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 73113,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/27408.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Imperturbable",
                "username": "Imperturbable"
            },
            "url": "https://myanimelist.net/reviews.php?id=73113"
        },
        {
            "content": "When you think about slice-of-life anime with music, popular titles from various subgenres come to mind—Nodame Cantabile and K-ON! are two very different but valid examples. The music aspects of these two titles are a big part of what made them successful, with elements like plot and characters also being important. But what happens when a show that's supposedly centered on music lacks for the most part that very same element? While that doesn't mean it's necessarily terrible, it's hard to deny that viewers will be left with a bitter taste in their mouth afterwards, feeling a bit mislead. And although this was more orless the case for TARI TARI, to what degree is left to how other supporting factors managed to make up for where it was expected to deliver.\\n\\n\r\nArt (6/10)\\n\r\nIf one were to critique the character designs of TARI TARI solely based off originality, I'm afraid the result would not be pleasant at all. It hasn't been all that long since Hanasaku Iroha ended—about a year—so for most people who watched it, the characters in it are still quite fresh in their minds. And although this is the same P.A. Works that did Hanasaku Iroha, one would expect them to at least a bit of effort into their character designs in TARI TARI. Depending on how you look at it, each of the five main characters in TARI TARI can be matched to a character in Hanasaku Iroha in terms of physical similarities. To me, this shows a lack of effort on the producer's part. Nonetheless, I still really liked the designs. The background elements are also characteristic of P.A. Works and I found them to be pleasing to the eye, adding a nice, light touch to the scenes in the show.\\n\\n\r\nCharacters (8/10)\\n\r\nA diverse cast of characters is an integral part of a successful anime. Character interactions generally make up a good chunk of an anime's content, more so in slice-of-life stories, which is what TARI TARI is. With that being said, I really felt the characters introduced in this series were easy to relate to and fun to watch. With each having their own quirks and traits, they also battled their own difficulties, eventually coming out on top, positively changed by the personal storm they conquered. The fact that all of them melded together well made their interactions so much more enjoyable and entertaining to see.\\n\\n\r\nSound (7/10)\\n\r\nFor an anime supposedly centered on music, TARI TARI didn't necessarily deliver when it came to the musical aspects of the show. In fact, throughout the series, there have only been a handful of occasions where there was actual singing by the characters; only a couple of those could actually be called \"performances\". That said, I absolutely loved the OP and ED—the latter nicely done by the seiyū cast—as well as the insert songs in the last episode, which slightly made up for the lack of musical performances throughout the series. As for the BGM, compared to your typical offering, TARI TARI's provided above average soundtracks. The piano instrumentals were quite good and effectively set the mood for many of the scenes.\\n\\n\r\nStory (7/10)\\n\r\nWell, given that the story's your typical slice-of-life fare, I didn't really expect anything complex or mindblowing going in. And while I'd say my expectations were met (i.e. the story was decently interesting and engaging), I felt that my enjoyment overall was not constant; some arcs were great, while others were alright. I would've liked music to have played a bigger part in the story as the synopsis seemed to have suggested it would. Nonetheless, watching the daily lives of the five friends was enjoyable for the most part.\\n\\n\r\nOverall (7/10)\\n\r\nIn summary, think of TARI TARI as the shorter version of Hanasaku Iroha, but instead of the general setting being an inn, you get a choir club at a high school. Additionally, the prominent side element in the former is music, instead of romance like in the latter. So if you're a fan of slice-of-life stories about high school students and music, TARI TARI might just be for you. In the end, the show is slightly underrated in my opinion, so I hope more people will promote it in the near future.",
            "date": "2012-09-24T20:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 73217,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382843.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jeffrey-sama",
                "username": "Jeffrey-sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=73217"
        },
        {
            "content": "_Passion as an easy slice-of-life_\r\nI enjoyed this. I watched it before I tried many other high-school shows that would go on to disappoint me. This one didn't.\r\nI didn't realise how well it did what it did, until I saw so many do it poorly.\r\nThis show is about characters in high-school having passions and trying to follow them, whether that means standing on their own, or pulling others along with them. The lead characters story arc to sing for herself, regardless of the organised choir refusing her, all the way down to a side-character (the guys don't get that much development really) who is pursuing hisdream of playing Badminton, and the silly singing (and sometimes badminton) group, allows him to do that.\\n\\n\r\nThe characters are passionate, they have a background, and reasons for what they do, it is told competently, and it concludes in a satisfying way. \\n\\n\r\nWhat more do you want?\\n\\n\r\n*Also the characters aren't all excessively annoying, like most other high-school anime!",
            "date": "2016-09-18T04:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 229289,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2962847.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JohnIG",
                "username": "JohnIG"
            },
            "url": "https://myanimelist.net/reviews.php?id=229289"
        },
        {
            "content": "We don't need include story in review right?\r\nSo, I will explain why I rate high score for this common genre anime (the title is also common, cause rather difficult to find in myanimelist)\r\nUnfortunately for musical genre, the song and background sound is not that special (even the final radiant melody rather disappointing for me)\r\nbut \"kokoro no senritsu\" itself can cover all that weakness\r\ni rate high simply because this is first time i watch anime like this\r\nnot like usual slice of life which have strong comedy, or harem\r\nnot like usual school life which have strong romance\r\nalso dont have miracle (like \"when i put all my heartand soul on it, everything is possible\")\\n\\n\r\nthe story is flow very smooth and natural, it also has smooth emotion. I can dive deeply into the story and characters\\n\r\nthe art is smooth and consistent, voice and art is fit with characters.\\n\r\nrole of all main characters is equal\\n\r\nthe sound like i mentioned above, but not that much anime use choir as song and i like it\\n",
            "date": "2013-03-13T05:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 89613,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421158.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/wingz00",
                "username": "wingz00"
            },
            "url": "https://myanimelist.net/reviews.php?id=89613"
        },
        {
            "content": "+ The art is awesome, especially the sky and landscapes are gorgeous!\r\n+ Realistic drama brings at least a tear in your eye\r\n+ Characters are good and loveable, especially parents deserve a special mention\r\n+ Music is great\r\n+ This show lightens dark autumn days, I used to watch it in the mornings before hurrying to the school in the dark\r\n+ relieves Hanasaku Iroha -yearning\r\n- The characters would have even more personality\r\n- This anime resembles HanaIro so much, that I can't help but wonder if this was just calculated that they could sell HanaIro again. Well, that doesn't matter me 'cause HanaIro is awesome. I'm just wondering wouldI like this show as much if I hasn't seen HanaIro?",
            "date": "2012-10-23T11:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 75743,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1023647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CinnamonHime",
                "username": "CinnamonHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=75743"
        },
        {
            "content": "The best way to describe this anime is 'pleasant'. \r\nIt's nothing exciting and the music and art is average but it has good development of plot and characters. I liked the characterisation and character relationships the most, because they were - it feels weird to say this - mature and unique. The five friends all have their own challenges and growth too :)\r\nSome of the themes that they explored were the parent/teenager conflict, the challenge of going against the grain, the emotion and connections that music can create, and the journey of moving on from the past. The most interesting theme was the discouraging schoolenvironment, which, since it hit pretty close to home, was nice, but yeah, it was refreshing to see a different school environment beyond the typical classroom/clubroom. \\n\\n\r\nOther than the above and the opportunity to hear singing during the anime, I would say the anime isn't particularly special. Watch it if you want something low-key but still somewhat meaningful.",
            "date": "2018-04-17T01:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 278296,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5775263.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/misaoh",
                "username": "misaoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=278296"
        },
        {
            "content": "What garbage. The show failed as a slice of life and it failed as a musical. There was uneven and poor slice of life development. There was not enough music in the episodes for it to be a musical. \r\nOne girl's arc took half the show to resolve which left the others to get over their issues in just a single episode. Hell, the show had zero camaraderie to speak of between the characters. The male characters felt like female characters who were changed so as to differentiate it from other female only shows. Their development was shafted hard and got crap treatment. \r\nFor 13episodes it felt like absolutely nothing happened. The small girl was damn annoying and the lame as hell ending was downright cliched but of course what else could I expect from a show that failed on all levels. \\n\\n\r\nThe only good thing I can say is that the characters had nice voices.\\n\\n\r\nYou might wonder why I rated it so low. It's simply because the entire premise of the show is highly misleading and baits people who otherwise would never watch such shows into watching it for the wrong reasons.\\n\\n\r\nI should have watched this 3 years ago instead of now. I regret everything.",
            "date": "2015-09-19T22:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 198981,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/yuri999",
                "username": "yuri999"
            },
            "url": "https://myanimelist.net/reviews.php?id=198981"
        },
        {
            "content": "Overall, it's like Hanasaku Iroha without more episodes than it needs, and with music as it's central thematic. It's primarily a drama and only then slice of life comedy. Production quality makes this a real pleasure to watch. It's perfectly balanced in all regards. There's excellent moe as well, but one that wouldn't be able to annoy anyone. \r\nWhich brings us to a great point, that this is completely free from all the otaku stuff, but it still succeeds in completely keeping it's anime charm. If you're not into dramas, this might seem like too much praise. If you prefer fast paced crazy orhilarious stuff with action, then stay clear from this as it's the complete opposite. Story isn't epic with amazing plot twists, but it's a real pleasure to watch and characters are very deep and really great. \\n\\n\r\nAnother interesting thing is that it doesn't deal with romance, there's very very little romance involved, and it's not even teased in a wrong way (like Hyouka). And on top of that, the music is great. It features several story arcs. Story progression feels natural, and culmination at the end also delivers. Definitely the best non romantic non otaku drama anime I've seen so far.",
            "date": "2015-07-11T14:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 193132,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2424123.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Eagleshadow",
                "username": "Eagleshadow"
            },
            "url": "https://myanimelist.net/reviews.php?id=193132"
        },
        {
            "content": "If you love something or someone, you should have a right to express that love. For example, if you love music and singing, you should have a right to sing your heart out; no one should hold you back. The anime that has caused me to say such a thing is one that, along with another anime called Hanasaku Iroha, I discovered through a music video that kind of crossed over those two anime and True Tears. However, I held off on watching it for so long, but after listening to some songs from it enough times, I decided that I couldn't stop myself fromwatching it anymore. I swear, not watching this particular anime sooner has to be one of the biggest mistakes I have ever made.\\n\\n\r\nLadies and gentlemen, welcome to my review of Tari Tari.\\n\\n\r\nTari Tari follows the final year of high school for Konatsu Miyamoto, a former member of her school's choral group. She had quit the group because of the adviser and vice principal not allowing her to sing due to an incident from the previous year's recital. Despite this, she wants to sing at one more recital before she graduates, so what would she do other than form her own choir club? She recruits Sawa Okita (an archery club member who dreams of becoming an equestrian), Taichi Tanaka (a badminton player), and \"Wien\" (a boy who returned to Japan after living in Austria for 12 years) for her club; she also tries to recruit a friend of hers, Wakana Sakai, but she has given up music as a result of her mother's death. As the anime goes on, Wakana slowly but surely becomes able to love music again, and the choir club moves forward with their ambition to sing.\\n\\n\r\nThe story of Tari Tari is quite good; there are moments that got me laughing, and there are other moments that nearly got me to cry. Another reason for the story being great is the outstanding character development; although not all of the characters are necessarily likable, all of them have depth to them, going through real dilemmas. I especially liked Wakana's character development; I was originally annoyed at her for constantly running away from music, but as the anime went on and she started to come to terms with things, I came to like her, as well. If you want to know my favorite character, though, it was Wein; every time he was on screen, he just simply put a smile on my face. I also liked the bond between each of the members of the choir club; their friendship is perhaps the most genuine I've ever seen in anime.\\n\\n\r\nP.A.Works is the animation studio behind beautifully-animated anime such as True Tears, Angel Beats, and Charlotte; luckily, I can say that they also did a good job with the animation for Tari Tari. It's not the most breathtaking animation I've ever seen, and I'm not sure if I can say that the character designs are anything special; however, it was very pleasant to watch. The voice acting was amazing, as well; with talented voice actors such as Saori Hayami (Sawa) and Nobunaga Shimazaki (Tanaka), there's no going wrong here. However, the best part about this anime, without a doubt, is the music; considering what this anime is about, this is definitely a good thing. The opening theme, \"Dreamer\" by Airi, is a song that I constantly found myself singing along to, and the ending theme, \"Shiokaze no Harmony\" by Ayahi Takagaki, Asami Seto, Saori Hayami, Nobunaga Shimazaki, and Natsuki Hanae, is also a very catchy song; all of the insert songs are charming in their own ways, with my favorite being \"Radiant Melody\".\\n\\n\r\nOverall, Tari Tari is a great anime. I'd recommend it to anyone looking for an anime with a great story, lovable characters, and of course, music that you'll find yourself listening to again and again!",
            "date": "2017-01-06T14:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 237627,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=237627"
        }
    ],
    [
        {
            "content": "Tari Tari is the kind of work that looks fantastic on the paper. If I tell you an anime have a good story and above-average sound and visual, it would be certainly a recommendation, right? Well, personally it wasn't the case for me and Tari Tari. While I can't say its bad, it has some serious problems with its story telling that might make some people drop.\r\nBasically, the way the story is told is tedious. Thats it. You have technically everything necessary to make an excellent anime, but the outcome seemed to be just above average. Its hard to have motivation to keep watching, asthe series doesn't do anything to make you have. I almost needed to force myself to watch it until the end, despite not having any problems with visuals, characters, story or anything.\\n\\n\r\nBasically, Tari Tari isn't a bad anime. Actually I'm sure it can be a very good one for some. However, I'm sure not everyone can deal with the pacing and the way this story is told.\\n\\n\r\nSmall note: the final is very satisfying.",
            "date": "2014-06-27T17:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 148997,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1137149.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/9Morello",
                "username": "9Morello"
            },
            "url": "https://myanimelist.net/reviews.php?id=148997"
        },
        {
            "content": "This anime has just finished recently, with an outstanding art by P.A works (Who did the art for Hanasaku Iroha etc) and very good music , since this anime tells us abount music in high school. An operan and drama musical. It contains every development on single character, how the change during the anime and so on. Their character develop and eventually finding what they want to do. \r\nBut i should give credits to the P.A works since they create an art that you can't have in any other anime, its unique yet beautiful. So try it, a short anime that you wouldn't have towait.",
            "date": "2012-10-30T01:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 76263,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/870255.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/poey_ice",
                "username": "poey_ice"
            },
            "url": "https://myanimelist.net/reviews.php?id=76263"
        },
        {
            "content": "Let's get one thing out of the way first. This anime has portions where German is used. However, you would hardly recognize it as it is murdered and then mutilated beyond recognition, as it were.\r\nThe story is very much concerned with the ghost of Sakai's mother. How she inspired the Condor Queens, her relationship to the vice principal, how Sakai was not kind to her when she was on her deathbed, and how musically gifted she was. Every other story, aside from building the new choir club, plays a very distant second fiddle such that it looks like it was designed so you don't needto care about the secondary story-lines.\\n\\n\r\nIt's the way that the main drama of this anime is not really given proper emphasis that makes this look like a patchwork of incoherence. Instead of an overarching plot point that propels all the stories to a satisfying conclusion, what we get is a distraction every episode so that we forget there isn't really a point.\\n\\n\r\nSlice of Life does not need a point if the characters are compelling. Nothing is compelling in this anime.\\n\\n\r\nI was very disappointed.",
            "date": "2014-09-21T17:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 161453,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ethylfresh",
                "username": "ethylfresh"
            },
            "url": "https://myanimelist.net/reviews.php?id=161453"
        },
        {
            "content": "Tari Tari had  a lot of potential with its plot and character background stories. The first few episodes were kind of slow if we look at the character development but helped set the premise of the story (Forming the choir club blah blah blah…).  Then Tari Tari surprised me as it delved into one of the character’s back story and I think that part was very well executed. I was eager to see how the rest of the characters stories would go. ALAS. They did not go well at all in my opinion. Im guessing the 13 episodes limit on the series ruinedit. However I felt that maybe the creators should have chosen some of the stronger stories and only concentrated on those for the season instead of touching lightly on all of them and thus loosing on forming a deeper connection with the audience. The way the series has been made makes me feel like it just rushed through everything and left me wondering at times what the real issue was in some of the characters’ story. \\n\\n\r\nBut I wouldn’t say that watching this was a complete waste of time. The animation is great with nicely detailed surroundings and well drawn characters.  Tari Tari is about music so expect a lot of singing in the show. Some of the songs are good and leave you feeling warm. \\n\\n\r\nOverall I think Tari Tari is an anime that you can watch if you just want a short series thats light on the feels. However I wouldnt keep it on the top of my to-watch list.  \\n",
            "date": "2014-02-06T04:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 131605,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3059805.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShiroNeko89",
                "username": "ShiroNeko89"
            },
            "url": "https://myanimelist.net/reviews.php?id=131605"
        },
        {
            "content": "WARNING: This is a big spoiler if you haven’t finished it.\r\nFirstly, I’d probably give this a 10/10 but I’m a big fan for romance. Any anime that doesn’t include romance usually has the highest score of 8/10 (so consider it 10/10 xD)\r\nTari Tari is an amazing deep anime that follows the world of friendship and passion. 5 students, come together in the land of music. The story starts of following Konatsu Miyamoto, a passionate girl who wants to sing in the Vocal Club she’s in. However, she’d denied by the Vice Principal. Annoyed, Konatsu pursues the dream to create her own Choir club to beable to sing. She recruits her friend Sawa Okita and Taichi Tanaka. Following that, a new transfer student Atsuhiro Maeda (aka “Wein”) joins the group. The last member they need, and want is Wakana Sakai.\\n\\n\r\nHowever, Sakai’s bound by a past tragedy, making her avoid anything related to music. And so, this is the start of the story.\\n\r\nTari Tari follow 5 separate Arcs in a sense. The shortest being Taichi’s dream involving badminton. There’s also Wein’s story with his friend Juan, who he lost touch with. Konatsu’s storyline follows throughout the whole series, which is really just her dream to be able to sing.\\n\\n\r\nTwo big arcs are Sawa and her dream to be a horse back rider (and archery) and Wakana, with her big over coming trial with the death of her mother.\\n\\n\r\nThe overall story is wonderful. The passion of these 5 teenage  The challenges the overcome. The dreams they create. Tari Tari really focuses in depth of a friendship bond and the trials surrounding them.\\n\\n\r\nThe only thing I would have loved more, was Taichi’s feelings for Sawa, however, meh, it’s fine if there’s no romance.\\n\r\nTHIS ANIME WAS AMAZING ^.^",
            "date": "2012-10-07T19:10:00+00:00",
            "helpful_count": 0,
            "mal_id": 74391,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/892411.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SakuraHughes",
                "username": "SakuraHughes"
            },
            "url": "https://myanimelist.net/reviews.php?id=74391"
        }
    ]
]