[
    [
        {
            "content": "Alright, I've been putting this review off for a while. I just haven't exactly been ready to share my thoughts about the show, mostly because any thoughts people have on this show will most likely be typed with one hand.\r\nAnyways, Kiss x Sis, the one anime I'm guessing all echii fans have heard of. That's right, those who aren't aware of this, Kiss x Sis is an echii, not a hentai, due to the fact that there is no sex in this show, but I can safely say that this is borderline echii, which in my universe is one notch below hentai. I decided towatch this because my girlfriend said that she laughed her head off while watching this. She failed to mention everything else about the show, so this review is mainly focused on preparing you for what you're planning on watching.\\n\\n\r\nFor a 12 episode series, I was fairly surprised that they could make so many episodes about an incestuous relationship, but somehow they pulled it off. To start off, let's talk about the story, shall we? The story revolves around a Junior High Schooler, Keita. He's about to finish his last year before High School. Seems normal enough. Oh, wait, I forgot to mention the fact that before all of this is explained, Keita wakes up to both of his twin sisters sleeping in his bed, cuddled up against him. They wake up, give him a kiss after teasing him a little, and just walk out. First 5 minutes of the anime, that's what happens. Was not expecting that. Anyways, apparently his sisters love him in a lustful way, and by lustful, I mean that they're madly in love with him. However, people could debate whether it would be okay for them to love him in that way, due to the fact that they're his STEPsisters. They aren't biologically related, but at the same time, brother and sisters... but the main storyline is based off of Keita and his sisters' relationship. In terms of an actual plot, there wasn't anything big, every story seemed to be something different.\\n\\n\r\nLet's see, this anime was made 3 years, 2 months ago in 10 days from now. Overall, the artwork was relatively modern. But that's a good thing, because the artwork today is really quite impressive. It was easy to tell the twins apart, mainly due to the different hairstyles and the bandaid on one of their cheeks, haha. The echii scenes were also fairly detailed, and don't get me started on  the erotic museum and shopping center... oh God... so detailed... my eyes...\\n\\n\r\nSound was one of the reasons this anime might be thought of as a hentai. I think you all may know what that means. Despite that, voice acting was good, if not realistic... I think the thing that made me laugh the most was Riko's comments and jokes. They were really well thought of, and it brought that mature yet funny side to the anime.\\n\\n\r\nEhh... I liked some of the characters, but not all of them. Keita seemed a little indecisive. It wasn't that I hated him, it's just that he isn't really able to make up his mind about a lot of things. He could have a nice relationship with his sisters (not that I support it or anything), but he chooses not to, and the thing is, his parents are all for the idea. That made me laugh a lot, his parents, but still, Keita should make a decision. Ako and Riko were the 2 best characters in the show if you asked for my personal opinion. They seemed like really nice girls, and they really do care for people. With the main characters out of the way, there were a bunch of good minor characters, but despite the fact I liked them, I was glad to see there was a limited amount of air time for each of them, I would have preferred to see the Keita/Ako/Riko story unfold little by little.\\n\\n\r\nOverall, it was a fairly good anime. It was probably the 2nd time I've seen an anime like this (referring to Yosuga no Sora), and I can't say it's my favorite kind of anime, but I liked most of it. I enjoyed the comedy and the romance...\\n\\n\r\n...but it did get annoying having to reposition my laptop on my lap in order to get comfortable again...",
            "date": "2013-05-15T20:44:00+00:00",
            "helpful_count": 195,
            "mal_id": 97315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=97315"
        },
        {
            "content": "Kiss x Sis is the TV series to the OVA and manga adaptation. It is about a boy, Suminoe Keita, and his everyday encounters (often perverted) with his older twin sisters, Ako and Riko.\r\nThe plot of the series is light, you can almost think of it as slice of life if you take out all the erotic antics from the equation. But then it wouldn't be AS good as it is now would it?\r\nMany of the scenes aren't much better or much worse than what you would see in a regular show this season. Although the details of \"certain\" scenes clearly had much more dedicationfor you know.....Obvious reasons.\\n\\n\r\nThe soundtrack also seems to be similar to the art as it won't stray too away from the industry standard. You have your mix of erotic music, cliched moment insert songs, and the OP and ED (which were decent).\\n\\n\r\nAs for the charactere s of the show, I think they were nicely done. I think its safe to say that Keita seems like a reasonable representation of most average guys. Now on to the bread and butter of the show, Ako and Riko. While the twins aren't the most stellar or beautiful characters out there, their love and borderline actions to get to Keita that draws you in, thinking \"Oh god go for it\" or \"DO IT, DO IT\". I do think the twins' were a bit over the top, trying to get off and get into Keita's pants all the time. But its definitely their appeal that has you coming back for more.\\n\\n\r\nIt would be a giant lie if I said that I don't enjoy the show. Each episode has a different means of seduction or...enjoyment. And I truthfully admit smiling like a complete idiot at the end of each. Bluntly speaking, it is borderline hentai/porn. The show knows how to take foreplay (for you kiddies reading this wait a few years before find out :P) and make it so much more appealing. So far each episode is a  c**ktease and you know kinda left me \"unsatisfied.\"\\n\\n\r\nI originally read and watched the manga and OVA, so the TV animation certainly met my expectations. Although I am a little disappointed that more couldn't be done to improve the quality of the show in terms of animation and music. I think for many of the viewers, its a hit or miss show. If you don't like perverted stuff, it really may not be for you. But if you don't mind feeling a little horny after watching an episode, I definitely recommend this.",
            "date": "2010-05-06T06:11:00+00:00",
            "helpful_count": 180,
            "mal_id": 25784,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KY791",
                "username": "KY791"
            },
            "url": "https://myanimelist.net/reviews.php?id=25784"
        },
        {
            "content": "The story revolves around a junior-high student. Keita is your average, easy to relate to guy struggling to get his grades at a certain level, so he can go to the same school as his sisters. Yeah, his twin-sisters. Actually, they aren't blood related, but their parents married while they were still young. Now normally that wouldn't be much of a problem, but this time both are madly in love with him. Throughout the anime, they both try to win his heart, often causing him to fail at what is trying to. As the story continues, he gets more and more interested in them, andthat even results in a few spicy scenes. Well...what am I saying? I guess you could say this anime has quite a bit borderline hentai scenes. Now don't think because of that, this anime is bad, because it isn't. It's very lighthearted and enjoyable, just as anime like this should be!\\n\\n\r\nThat said, the animation is great, unlike most (borderline) hentai anime. The characters and background are animated well, and I'm quite fond of the colouring. I haven't found many scenes where characters are moving awkwardly, or anything alike. Sometimes though, especially when scenes get a little more sexual, you'll notice the occasional flaw, or at least the really hentai-like kissing. But seeing there's more than enough good animation to make op for that, i don't really mind at all. And I'm sure most people considering to watch this one wouldn't either.   \\n\\n\r\nBoth OP en ED are incredibly catchy. After a few episodes i found myself humming the ED while showering. I can't say I'm really proud of that, but you get my point. The voice acting is pretty good. The two girls are equipped with the required -and well preformed- \"little girl\" voices, and just hearing Ken Takeuchi voicing Keita is usually more then enough to feel his awkwardness. I saw the OVA before, but still wasn't expecting much of the voice acting, but i can say I'm positively surprised. \\n\\n\r\nThe characters aren't special, but certainly not bad. Keita is the typical \"harem-anime lead\", spending most of his time fantasizing about the girls, or doing things with them he normally fantasizes about. Ako is the mature sister, who cooks for the family, has good grades etc. Riko is a more of a childish and playful type. Although you'll sometimes ask yourself what their differences are, they are especially visable when seducing Keita. \\n\\n\r\nTo fill in some of the blank spots, there are some filler characters. I must say they are pretty well made. There's a group of guys who represent Keita's school friends. They constantly point out Keita's luck to have two hot sisters to love him, often causing Keita to fantasize about his sisters himself. There is also a loli who seems to have a crush on him. And we have Ako's teacher, who's also aforementioned loli's sister, an Otaku who tries to make Keita, Ako and Riko see their incestuous tendencies, are wrong. Their parents also have a small role. They're very stereotypical parents, except for the fact that dad encourages their love, and especially Keita's manliness. Last but not least we have Miharu Mikuni, a shy, glasses wearing, big-titted girl, who does the best job providing us with some interesting comedy.    \\n\\n\r\nOverall I think this is a more than decent anime. The main reason to watch this would be the hot brother-sister action you might be into, but i mostly decided to finish it because it just is a very entertaining anime.\\n\\n\r\nSo, if you're looking for an easy going anime, and wouldn't mind some interesting sexual scenes, this might be the anime you're looking for.\\n",
            "date": "2010-08-25T12:02:00+00:00",
            "helpful_count": 103,
            "mal_id": 29954,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tiggernits",
                "username": "tiggernits"
            },
            "url": "https://myanimelist.net/reviews.php?id=29954"
        },
        {
            "content": "I only watched episode 1, well half of the episode... actually just the first 10 minutes, but let me tell you... thats all you need to watch, and it's really bad, and goes to far, even for an ecchi anime.\r\n*This is just my opinion, don't get your panties in a bunch because if you know who you are, then this review won't change your opinion.*\r\nREVIEW: It starts off with a scene with a child version of the main character, Keita Suminoe, being protected by his older sisters, Ako and Riko, from a dog. After his sisters scare the dog away they both kiss Keita onthe cheeks at the same time, and at the same time I thought, \"That was cute.\"\\n\\n\r\nThat is the first and only time I would think of this anime as \"cute,\" because this anime is anything but \"cute.\"\\n\\n\r\nThe scene is then revealed to be a dream while Keita is sleeping in school. Keita is then woken up by his perverted friends, and by perverted I mean how they go on to talk about lucky he is to have sisters to sleep with, and strongly suggusting Keita gets to have sex with them.\\n\\n\r\nI guarantee your reaction will be \"What the hell?\"\\n\\n\r\nThe next scene is Keita returning home with his sisters flying at him as he enters the house, along with paired panty shots.\\n\r\nThen out of no where, they flash their breasts at him. \\n\\n\r\nWas that supposed to funny?\\n\\n\r\nThen Keita goes to take a bath and... gets a boner when he thinks about his sisters flashing their breasts at him. \\n\\n\r\nI'm not convinced that was supposed to be funny...\\n\\n\r\nAnd while he takes a bath, his sisters goes though his undergarments, and one of brags about having the underwear Keita just took off.\\n\\n\r\nWell, I guess I can see how some people would think this is funny, but seriously?\\n\\n\r\nIt just became torture after this, and I refuse to continue.\\n\\n\r\nSTORY: It's about silly antics with the main characters two perverted sisters who are sexually attracted to him, and really want to jump his bones, and... nothing much else. Pathetic doesn't even begin to describe it.\\n\\n\r\nANIMATION: Pretty average really, it's pretty much the only acceptable thing about this anime. \\n\r\nCharacter designs are pretty much meh.\\n\\n\r\nSOUND: I can't really say anything about the voice acters, but I got really irritated by the sisters dialogue. And I hated the theme song.\\n\\n\r\nOVERALL: I would go far as to say; I honestly hated this anime, and would love to scrub my brain with bleach if it would help me forget Kissxsis. \\n\r\nAnd I know that they are not related by blood and that itself is a part of a \"joke,\" but I still found this form of incest to be just as disturbing as actual incest, it's not funny, it's just gross.\\n\r\nConsider yourself warned, but to the people who like this sort of thing, have at it, cause I'm not touching it.",
            "date": "2010-11-15T23:25:00+00:00",
            "helpful_count": 82,
            "mal_id": 32080,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/344979.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/artist-retired",
                "username": "artist-retired"
            },
            "url": "https://myanimelist.net/reviews.php?id=32080"
        },
        {
            "content": "Keita Suminoe is a fifteen year old middle school student who only wants one thing...  To pass his finals, and make it into the same high school as his older twin sisters, Ako and Riko.  But he has two obstacles standing in his way.  The first is that he’s far more athletic than scholarly, which makes studying and taking tests difficult for him to manage.  And the second is that both of his sisters are madly in love with him, providing him with endless distractions as he tries to do the simplest things like eat, sleep, and of course, study.And it’s not just them, either...  One of his teachers, a fellow student that he accidentally groped, and a short loli-like girl from his school are all starving for a taste of his knob.  What can poor Keita do when these women have so much love to give to him, and he only has about six inches to give to them?\\n\\n\r\nKissXSis was allegedly animated by a small time company called Feel.  Why do I say allegedly?  Because it looks nowhere near as good as one of their other anime, So I Can’t Play H, whose incredible production values was it’s only redeeming factor.  In fact, the difference in quality between these shows that were made only two years apart is so vast that I almost want to call BS on wikipedia for telling it to me.  I guess it’s possible that feel didn’t feel the need to put as much money into this project as they’d later wind up pouring into H, and if that’s the case, I suppose I understand.\\n\\n\r\nThat’s not to say the animation is awful, though.  It’s not great, but I’ve seen plenty of shows that looked a lot worse than this.  The artwork is crisp and clean, and a few of the character designs are inspired, although most of them look generic, and the weird little shiny marks on the girls’ skin can get pretty distracting.  The bare bones budget is actually managed fairly well.   There are several moments when the moneysaving animation techniques are blatantly obvious, but for the most part, the series sticks to slow, limited movements that suit it best, saving it’s money for the few...  Um...  *cough* action scenes that need it more.  What bothered me was more WHAT they were animating than how they were animating it, I guess.  The music isn't bad either, just generic and forgettable.\\n\\n\r\nSo, I’m going to go into new territory here.  Over my years of reviews, I’ve made a habit out of talking about the animation of any given series as well as the company that produced them, but never before have I talked about the TV station that they aired on.  Since this show doesn’t have an English dub for me to discuss, and I don’t really feel up to discussing the sub, I’m going to go ahead and tell you all about a Japanese TV station called AT-X, or Anime Theater X.  \\n\\n\r\nAT-X is a Japanese premium channel...  In other words, a pay-per-view station... that, by the very nature of those words, is allowed to show most of their programs uncensored, kind of like HBO.  They’ve aired many TV-MA titles since they were established in 2000, including Elfen Lied, Mahoromatic, Highschool of the Dead, Dance in the Vampire Bund, and the Japanese dub of My Little Pony Friendship is Magic(Wrap your head around that one).  Being a pay-per-view station, they have the right to show their programming with nudity, excessive violence, groping, and all that fun adults-only stuff to it’s mainly adult crowd should they choose to do so, with streaming sites like Funimation.com and Crunchyroll.com opting to air censored versions anyway.\\n\\n\r\nThis turned out to be the perfect place for KissXSis to air, as it’s filled to the brim with adult imagery.  Not only is there underwear shots and bare bottoms galore, this show goes all out with french kissing, lines of drool falling afterwards as a result of said kissing, frequent groping, girls peeing(from many different angles), the outline of the main character’s erect penis through his clothes as his sisters very explicitly fondle it...  And yet, in the very rare moments of actual nudity, the girls in the series were given nondescript Barbie doll bodies.  Considering just how little of a fuck this series gives in regards to it’s content, that’s a hilariously bizarre omission to make.  Because, yeah, as far as this show is willing to go, nipples are the line they don’t want to cross.  It’s especially strange when you take into account that their brother, Keita, very clearly has nipples in the scene when Ako and Riko are teaming up to lick them.  I guess it makes sense that since he’s not blood related to them, he wouldn’t share the same physical deformity that they have.  At least that’s the explanation that I’m sticking with.\\n\\n\r\nMy first attempt to watch this show was back in the fall of 2012.  I’d heard some stuff about it from both sides of the fence, so I felt some morbid curiosity as to just how bad it could really be.  I wound up quitting after two episodes, already calling it the worst anime I’d ever seen.  To be clear, it’s not the incest that turned me off...  I’m not as offended by that topic as a lot of people are.  But in order to make the topic of incest appeal to a broader audience than just the people who want to jerk off to it, you HAVE to play the societal stigma card to make the material relatable.  The related couple has to face judgement from the people around them.  I mentioned as much in my review of Oreimo, and I even used what little I’d seen of KissXSis as a reference tool.  \\n\\n\r\nWhat had me running away from KissXSis as fast as I possibly could was, ultimately, the way it’s world was reacting to our three blood crossed lovers.  At school, the entire male student body was obsessed with Ako and Riko, to the point that they would ostracize and bully Keita for living with them, and form an unruly mob to chase the two girls whenever they wandered onto the school’s campus.  The only character who showed any repulsion to the idea was some big boobed glasses girl who you could immediately tell was just going to fall in love with Keita, effectively turning what could have been moral outrage into jealousy.  As I would later learn from the appearance of his teacher, that’s exactly what the writers were going for.  Keep in mind, at no point in the story are we given any insight into why such bland looking characters would be sexually deified to such extreme levels.\\n\\n\r\nAnd to make matters worse, their parents weren’t just okay with this debauchery between their children...  They were encouraging it.  Right at the end of episode 1, they start hounding Keita to excavate the gold mine of forbidden pussy that lived a few rooms down from him.  They also drop the bomb on us that Keita and his sisters aren’t really related by blood...  Keita is his son, and the twins are the mom’s daughters, so they’re actually just step siblings, and the anime constantly shoves the fact that they’re blood relatives down our throats to remind us that what’s going on between them is perfectly A-ok.  Which, as I’ve mentioned in the past, it’s not.  Children who grow up from a young age together as siblings and go through puberty in closed together become sexually desensitized to each other, and I swear i’m not making that up.  Whether or not they’re actually related by blood is a non-issue, that’s just how it works.  It’s legally okay, but only the sleaziest perverts ever call upon legal loopholes to excuse their tastes.\\n\\n\r\nAfter confirming with the second episode that this show was not going to get any better, I decided I’d had enough, and stayed away from it for a year and a half.  That was until my long awaited two week vacation from work, when I let my two best friends each pick an anime for me to watch in my free time, and one of them challenged me to finish the series once and for all.  The only reason I’m not going to punch him in the face is because he said I don’t have to watch the OVAs.\\n\\n\r\nUpon my second attempt to watch KissXSis, I’ve noticed that not only does the series never get any better, but it takes every possible opportunity to get worse.  And I’m not just talking about the depraved sexual content, which any viewer will either be able to take or leave.  There is nothing in this series that’s even remotely suggestive of any kind of story-telling.  The only plot is whether or not Keita will wind up sleeping with one of his sisters, but he’s so willing to fool around with them at the slightest provocation that it winds up not really mattering whether they cross the line or not.  The only conflict is over which sister he winds up with, but he never really shows any preference, and will happily switch between them as though they were Coke and Pepsi.  \\n\\n\r\nThere’s no story either, as the entire series is just an endless string of moments between Keita and his sisters, with no stakes, no surprises, no revelations, just interaction after interaction, competition after competition.  It can’t get old, though, because unless you were on the edge of your seat waiting for something graphic to happen, it was never interesting in the first place.  It’s portrayal of women is insanely ignorant and misogynistic, but...  Well...  It’s hard to be mad at it about that, because at no point does it ever seem to concern itself with what women are really like.  Granted, I ranted and raved about that when I originally rage-quit the series, but upon a fresh look, and a surprisingly boring viewing experience that was occasionally interrupted by random bouts of “You’ve gotta be fucking kidding me,” I think I’ve finally nailed what this anime is, and why it feels like a nonentity to me at this point, as well as why I can’t bring myself to be angry over how brain-smashingly reprehensible the content is.\\n\\n\r\nKissXSis is, at it’s core, a sexless hentai.  Now, I’ve seen several anime that I could throw that same label at before, but this is the first one I’ve ever seen that was actually aired on TV.  There is nothing more pointless than a safe-for-TV porno.  You can not realistically expect a porno to have realistic female characters, because it’s a porno.  It’s a jerk-off fantasy.  The only real reason someone could possibly watch this all the way through is to jerk off to it(watching it for reviewing purposes is not a real reason...  I’m insane, and a horrible person, so don’t do what I did).  Everything that happens in this show is just build-up to sex scenes that never happen, leaving it only palatable for the most desperate viewers who are looking for a good incest romp and somehow don’t realize that there are actual hentai out there.  \\n\\n\r\nThe only other type of audience I can imagine this series having would be people who either A: Have siblings they wish they could screw or B:  Wish they had siblings they could screw, and in either case, they’re droolingly eager to find some sort of escapist self-insert jerk-off fantasy where they have a pair of willing and able sisters that aren’t technically related to them, in a world where only the jealous haters have anything negative to say about it.  That would be the life, wouldn’t it?  Only no, it wouldn’t.  Grow up, and stop kidding yourselves.\\n\\n\r\nKissXSis has never been released stateside, and no self-respecting legal streaming service would ever touch it with a sixty foot pole.  It’s available on illegal streaming sites, and while I’d normally never recommend such a tactic, I honestly don’t care one way or another whether or not this title makes any money.  You can also find the Malaysian bootlegs on Ebay for dirt cheap, as it’s only about thirteen dollars for the TV version of the series, and around the same cost for the OVA series of equal length that came out a few years prior.\\n\\n\r\nIf KissXSis had been released as an actual legitimate hentai title, with at least the majority of it’s story arcs ending in sexual pay-offs, it would easily be one of the best titles in it’s genre, and no, I’m not exaggerating that.  The characters are well developed and complex...  By hentai standards.  The story is intelligent and well thought out...  By hentai standards.  The animation and music are very well produced...  By hentai standards.  With actual pay-offs instead of blue-ball teasing, the pacing would have been outstanding...  By hentai standards.  But this series wasn’t released straight to DVD in the adults only section of your local DVD store.  It was released on TV, in a much harsher and stricter medium.  As a legitimate TV anime, this show is just flat out pathetic, tasteless trash that only the most desperate and depraved audiences will find any sort of satisfaction with.  Since I am not one of them, I can’t even give this show a zero without feeling like I’m being too lenient with it.  Thus, I give KissXSis a -4/10.  Or I would, if MAL would let me.",
            "date": "2015-02-04T11:16:00+00:00",
            "helpful_count": 61,
            "mal_id": 179665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=179665"
        },
        {
            "content": "Fact is wherever there’s anime, there’s almost always some sort of fan service to be had as well. Ecchi series have been around for quite some time now and with every new show there also seems to be a continuous rise in the explicit material that is allowed to be shown on television, much to the delight of many otakus out there. One such show that pushes the boundaries is Kiss x Sis, an ecchi anime that attempts to blend perversion and comedy while also throwing some incest in the mix. Oh joy.\r\nKiss x Sis focuses on male protagonist Suminoe Keita and the shenanigans pulledon him by his two older twin sisters – or stepsisters, to be more accurate. The story takes place during Keita’s last year in middle school as he struggles with his final exams while also trying to resist (‘deal with’ would be the more accurate term, actually) his sisters’ often perverted advances towards him. Obscene things happen, comedy ensues, and so on and so forth.\\n\\n\r\nMost episodes adopt a casual pace and narrative typical of many other ecchi anime – not much happens plot-wise for the most part. Of course, there are some episodes that are an exception to the rule, though unfortunately in this case that’s not a good thing. Kiss x Sis does well in the ecchi and comedy departments, delivering some truly borderline hentai moments and successfully mixing in humour whenever the need arises. Surprisingly enough, the episodes that focus more on this aspect and disregard plot development are the ones that are the most enjoyable out of the lot.\\n\\n\r\nAs mentioned earlier, things don’t work too well when the anime goes for a more plot-oriented episode. Keita’s preparation for his upcoming exams makes for a useful plot point at first, delivering some good laughs as the sisters go about their usual sneaky ways in trying to intervene with Keita’s study hours both to support him and—perhaps more importantly—to get closer to him. Unfortunately, as the series progresses, a continually increasing focus is given to the more dramatic side of the story, which does not work at all simply because there’s no character development there to support it and also due to the fact that there’s a lack of compatibility between the comedy slash ecchi side and the serious side of the show.\\n\\n\r\nThere are moments when Kiss x Sis finds greatness and in turn delivers solid entertainment filled with humour and fan service that at times will leave you wondering just how far this anime is willing to go in that respect, but ultimately the series is brought down by its unnecessary need to inject drama into the whole affair. Those looking for ecchi and some entertainment will certainly not go wrong with Kiss x Sis, but then again, there are plenty other shows out there that offer more in pretty much every department.",
            "date": "2011-09-23T09:43:00+00:00",
            "helpful_count": 20,
            "mal_id": 43997,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241809.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Andristian",
                "username": "Andristian"
            },
            "url": "https://myanimelist.net/reviews.php?id=43997"
        },
        {
            "content": "Story: KxS has two parts, it's about twin sisters who are in love with there slightly younger stepbrother, and the stepbrother trying to get into the same highschool as them. While this sounds like a pretty simple story I have to give the writters credit for not making this either a true incest ecchi or an ecchi where the guy is just thrown in with a buch as girls who all love him (although there are others who slightly do). The story was fairly original although there were the typical filler episodes, a little heavy on the fan sevice in some but not too ridiculous.\r\nIpersonally thought this anime was great, in ecchi the main character almost always gets swarmed with ditsy girls who hit on him and he just seems like an idiot, but not here. In KxS the 3 main characters all had their own personalities and qualities, for example they could've made ako and riko (the twin sisters) airheads who acted just like one another but the only real quality they share is that they care for Keita. Also (and I really like to thank the writters for this) Keita wasn't some stupid idiot who was thrown into all this, he had his own set of morals and when his sisters started to hit on him he resisted and didn't give in (although there were some moments) which I find refreshing to see something that doesn't stereotype guys as horny idiots. It was nice to watch the progression of the relationship the three shared with each other and I'm glad there was the actual plot of him trying to get in the same highschool his sisters are in, this way it wasn't just based off of the sisters fighting for his love. Again I love the story because of Keita's morals he is put in a situation were both his stepsisters have feelings for him and he knows that he can't choose one but instead of going for both he makes the harder but much more mature decision not to give into them. I was however a little disappointed at the end where while they did complete the plot there was not too much on the part everyone cares about which is what  happens with keita riko and ako. One thing I didn't like about the story is throwing in about 3 other girls who appeared to like him, if they left them out I might've given this a 9 depending on how well they would've done without them. The 5 OVA episodes which are the first 5 episodes are a little better than the tv anime, I did find the transition from the OVA to the anime to be a little confusing because it seemed like their relationship in the anime hadn't advanced to where it was in the OVA's although the plot was in order.\\n\\n\r\nMusic: the music was good, it fit the anime very well, from the opening and ending thems to the music during the episode they all seem to fit nicely.\\n\\n\r\nArt: the art was also good, cute characters not too many lazy scene of just pictures (although there wasn't much movement during talking), still fits the anime.\\n\\n\r\nCharacters: the characters were the highlight of this anime, they were given their own personalities and were original.\\n\\n\r\nEnjoyment: I definetally enjoyed this anime, I was scepticle when I first started thinking it would just be another ecchi but was shocked to see how much I got to know the characters and think that anyone who isn't afraid of ecchi and some real funny/romantic moments should watch this.\\n\\n\r\nOn a final note I would like to say to women out there who critisize ecchi to understand that what it is is basically and romcom adapted for guys, if you take out the sexual mishaps/encounters, go a little heavier on the drama and make 1/4 of the characters guys most women would love it.",
            "date": "2011-12-11T01:52:00+00:00",
            "helpful_count": 18,
            "mal_id": 48943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/976291.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VelocityWaffles",
                "username": "VelocityWaffles"
            },
            "url": "https://myanimelist.net/reviews.php?id=48943"
        },
        {
            "content": "It's very easy to misinterpret this masterpiece as your average ecchi-sketchy show, or even label it as \"borderline hentai\". Admittedly, it gets extremely raunchy many times. But that's the allure of the show and the artists challenge to its viewers. Can you look past the lewd and see the authors stark depictions of the every day life of a girl suffering through extended child abuse? \r\nSpoilers ahoy, you've been warned.\r\nStory: 10/10\r\nFrom the first episode we're introduced to our hero Keita, your typical unaware harem protagonist. He's got girls hanging off him left and right, to the envy of his entire school. The major plot ofthe show is his twin sisters attempt to get him admitted to their highschool.\\n\\n\r\nTheir infatuation with their brother is apparent extremely early, always sneaking into his room at night or trying to fool around with him. For all you wincest fans, I'm sure you're well aware of how often incest occurs in reality. There's the normal siblings fooling around as toddlers/children, playing doctor of sorts. And then there's the real stuff where they know what they're doing. That last one rarely ever happens, and when it does, it's usually a sign of something having gone wrong in the household. And something is very wrong in this household.\\n\\n\r\nOne of the heroines, Riko, as part of her character design, wears a bandage on the side of her face. One could assume perhaps she has a blemish she's hiding, as one would expect of someone wearing a bandage. However, this show takes place over the course of almost a year. Any normal blemishes would have long disappeared by then. Compounding that fact is the appearance of numerous flashbacks to when the trio were small children. Riko wears the same bandage in the same spot. By now, a casual viewer may just write if off as lazy writing, but it's actually a carefully crafted plot device.\\n\\n\r\nThe main characters mother and father (especially the father) encourage this incestuous relationship, even offering \"chances\" to Keita. Normally, parents are against incest, at most willfully oblivious or ambivalent. Outright support raises many red flags. And that red flag is that the father has been abusing these girls for a very long time. Riko is a rather rambunctious girl, likely she resisted his advances at one point and he hit her, scarring her. In her shame she covered it up with that bandage we see in the flashbacks. Ako is also a victim in this.\\n\\n\r\nTo deal with this trauma, they seek out their new brother, Keita. Throughout the anime, the girls try to sneak into his room for the night, because they know if they stay in their own, their father will pay them a visit. Keita, of course, is a bright young boy and is well aware of this, that's why he acts so oblivious to their advances. If he dares speak up against this, his father will hurt him, maybe even kill him. The mother is likely in denial about the whole thing, thinking it's just a silly game.\\n\\n\r\nAll this masked in what appears to be your typical harem-comedy.\\n\\n\r\nArt: 6/10\\n\\n\r\nNothing really special.\\n\\n\r\nSound: 6/10\\n\\n\r\nAgain, nothing memorable. The ED is pretty good though.\\n\\n\r\nCharacter: Refer above 9/10\\n\\n\r\nEnjoyment: 10/10 OR 0/10\\n\\n\r\nIf you understand what I mean by those dual scores. On one hand, it disgusted me how heart-wrenching it was, and I did not enjoy that. However, the fact that it did that deserves a 10.\\n\\n\r\nOverall: 10/10\\n\\n\r\nWonderful show with something for everyone. For the casual viewer, you have a fun little incest romp. For the critical viewer, you have incest deconstruction and multi-layered plots and characters.",
            "date": "2014-06-13T11:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 146869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/corntastic",
                "username": "corntastic"
            },
            "url": "https://myanimelist.net/reviews.php?id=146869"
        },
        {
            "content": "Finally it's there, the Kiss x Sis TV Series. As I was scanlating the Manga, I was longing for that even before the OVA was published. For starters: Unlike the OVA it's not going straight after the Manga! So don't get your hopes high, but still I think, if you liked the Manga, you'll like the TV-Show.\r\nStory: 9\r\n+ What's KxS about? Well, it's some kind of typical setting: One normal perverted boy, a few girls and a lot of ecchi. The exception on this \"normalism\" is, that 2 of these girls are his sisters. But as usual they aren't blood related... I think there isno big plot behind this, meaning every episode will be with a different storyboard then the others. But I could be wrong, it's hard to tell after just 2 episodes. After all it'll be something like: Whom will Keita end up with? Hey but that's the way we want it to happen, isn't it... In comparision to the OVA the TV show seems to be more Mainstream and not as \"hardcore\". I just want to remind you of the episode 3 of the OVA ;). BUt we'll see.\\n\\n\r\nArt: 8\\n\r\n+ Oh, it's nice to watch Riko and Ako-nee, they are very well drawn, as the backgrounds and the Details. There are no big specialeffects, blurs or anything like that.\\n\\n\r\nSound: 7\\n\r\n+ I think it's good, nothing out of the ordinary, but good. The voices are fitting the picture most of the time - and the music doesn't f*ck your nerves.\\n\\n\r\nCharacter: 9\\n\r\n+ Ho, that's the way we like it! Cuteness, some kind of mature elements, innocence and did I already mention cuteness? My favourite would be probably Ako, as she already was in the manga. No, they are balanced very well, and it's not as every kind of fetish will be covered with dozens of girls. There are just a few, but I think one of them will capture your heart non the less.\\n\\n\r\nFazit:\\n\\n\r\nDuring the Anime you can see all the elements of an Harem-anime you want to see: Love Trouble, holding back, perverted thoughts, love triangles, cute girls and ecchiness ;). But you should watch the Anime as just this Anime - The plot has only the same Theme as the Manga or OVA but, it's not the same storyline. I think the theme is pretty interessting - as the father and mother support the love of these 3, and it's all done in a funny way. Well for now I really like this show, and want to recommend it, but just if you like ecchi and harem Anime ;).\\n\\n\r\nOverall Rating: 8 for now.",
            "date": "2010-04-15T05:29:00+00:00",
            "helpful_count": 15,
            "mal_id": 25096,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302476.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AnimizeEU",
                "username": "AnimizeEU"
            },
            "url": "https://myanimelist.net/reviews.php?id=25096"
        },
        {
            "content": "Kiss x Sis is the second incest or sibling x sibling anime that I have watched, and safe to say it will be the last. The whole concept is just a bit too… I don’t even know. Incest. But hey some people like that I guess, I’m not here to judge anyone… just joking. \r\n Seeing as I have only watched two anime in this genre, I don’t have a whole lot to compare it with. I found that there was a more comedic side to this show, which I felt made it a little easier to view, in comparison to Yosuga no Sora whichis a bit more ‘psychological’. \\n\\n\r\nStory: Pretty simple, a brother and two sisters live together and are in love with each other. They constantly think up ways to seduce their brother, or help him whether it be with schooling or other life related problems. That’s basically all that happens. The end. \\n\\n\r\n Art: The artwork was great. I wasn't expecting a lot in this department, but it pleasantly surprised me, but by all means I’m not saying it was a masterpiece. Just the same as any other ROM-COM made past 2010. \\n\\n\r\nSound: Both the OP and ED fit in really well with the series. It’s not something I would listen to, however it did compliment the show. Sound effects and voice acting was probably one of the strongest elements I found, as it all sounded crisp and professional. \\n\\n\r\nI didn't love this show although i didn't hate it. However realistically speaking if the two girls weren't his ‘sisters’ and just happened to be living with him for some reason like… their parents passed away or I don’t know, something creative, it would have been a enjoyable show to watch. \\n\\n\r\n8 points for effort.\\n",
            "date": "2013-10-23T06:54:00+00:00",
            "helpful_count": 15,
            "mal_id": 117973,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1366113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dandey",
                "username": "Dandey"
            },
            "url": "https://myanimelist.net/reviews.php?id=117973"
        },
        {
            "content": "Have you ever wonder what it is like to live with twin sisters who are madly in love with you? In Kiss x Sis, Keita, an average middle school and soon to be high school student, experiences such that. His sisters, Ako and Riko constantly harass him in a weird way in order to show their affections for him. This continues throughout every episode thus becoming entertaining and unpredictable as to what Ako and Riko will do next to Keita.\r\nThe plot is straight forward; Ako and Riko help Kieta pass his entrance exam into high school. What you see on the outside is what youget. There isn't anything hidden underneath the story-line, but even so the anime is able to deliver many things along the way; from entertainment to its viewers to splendid characterization of its characters. In every episode, Ako and Riko would do something different to get affections from Keita, and each time the things they do are hilarious while other time they are more perverted thus making the contents border-line hentai. It might be great for fan service, but deals a lengthy blow to the anime in a sense that it provided a scene that did not benefit the story-line, but rather pro-long that specific episode. As I mentioned earlier, some scenes were did not enter the realm of border-line hentai thus it was a great source of comedy and made the anime enjoyable. On there other hand, characterization was good since the anime was able to individualize each character in their own specific group thus each character had their own specific feature, so if someone ask me to recall a character on their trait---doing it would be an easy task.\\n\\n\r\nIn terms of art, the anime is ranked average due to the fact that it can be found in most harem anime, but there were moments in the anime when the art shown improvement such as in the \"ecchi\" moments. The art for Ako and Riko is fascinating; the way they look is appealing and make them stand out from the rest of the other characters thus they added a kind of uniqueness to the anime. The opening song was fine, but th ending song is a different story. The ED song was very catchy and easy catches one attention and you can't help it but to listen it to the very end. Along with the ED animation, how can one resist?\\n\\n\r\nIn the end, Kiss x Sis is a pleasant anime and for people who enjoy ecchi moments and a good slice of life.",
            "date": "2012-10-22T16:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 75677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/431801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lamii",
                "username": "Lamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=75677"
        },
        {
            "content": "The first story are Keita has two older step-sisters, Ako and Riko, but since they aren't related by blood, they love him in a lustful way. After a mishap at school, Ako and Riko finally confess their love to him. Keita dislikes the thought of seeing them other then brother and sister, but as he tries to enter the same school as his sisters, he slowly becomes attracted to them. Now normally that wouldn't be much of a problem, but this time both are madly in love with him. Throughout the anime, they both try to win his heart, often causing him to fail atwhat is trying to. As the story continues, he gets more and more interested in them, and that even results in a few spicy scenes. Well...what am I saying? I guess you could say this anime has quite a bit borderline hentai scenes. Now don't think because of that, this anime is bad, because it isn't. It's very lighthearted and enjoyable, just as anime like this should be!\\n\\n\r\nThat said, the animation is great, unlike most (borderline) hentai anime. The characters and background are animated well, and I'm quite fond of the colouring. I haven't found many scenes where characters are moving awkwardly, or anything alike. Sometimes though, especially when scenes get a little more sexual, you'll notice the occasional flaw, or at least the really hentai-like kissing. But seeing there's more than enough good animation to make op for that, i don't really mind at all. And I'm sure most people considering to watch this one wouldn't either.\\n\\n\\n\r\nBoth OP en ED are incredibly catchy. After a few episodes i found myself humming the ED while showering. I can't say I'm really proud of that, but you get my point. The voice acting is pretty good. The two girls are equipped with the required -and well preformed- \"little girl\" voices, and just hearing Ken Takeuchi voicing Keita is usually more then enough to feel his awkwardness. I saw the OVA before, but still wasn't expecting much of the voice acting, but i can say I'm positively surprised.\\n\\n\r\nThe characters aren't special, but certainly not bad. Keita is the typical \"harem-anime lead\", spending most of his time fantasizing about the girls, or doing things with them he normally fantasizes about. Ako is the mature sister, who cooks for the family, has good grades etc. Riko is a more of a childish and playful type. Although you'll sometimes ask yourself what their differences are, they are especially visable when seducing Keita.\\n\\n\r\nTo fill in some of the blank spots, there are some filler characters. I must say they are pretty well made. There's a group of guys who represent Keita's school friends. They constantly point out Keita's luck to have two hot sisters to love him, often causing Keita to fantasize about his sisters himself. There is also a loli who seems to have a crush on him. And we have Ako's teacher, who's also aforementioned loli's sister, an Otaku who tries to make Keita, Ako and Riko see their incestuous tendencies, are wrong. Their parents also have a small role. They're very stereotypical parents, except for the fact that dad encourages their love, and especially Keita's manliness. Last but not least we have Miharu Mikuni, a shy, glasses wearing, big-titted girl, who does the best job providing us with some interesting comedy.\\n\\n\r\nOverall I think this is a more than decent anime. The main reason to watch this would be the hot brother-sister action you might be into, but i mostly decided to finish it because it just is a very entertaining anime.\\n\\n\r\nif\\n\r\ninteresting sexual scenes, this might be the anime you're looking for.",
            "date": "2012-08-31T18:41:00+00:00",
            "helpful_count": 14,
            "mal_id": 71297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1220839.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_aikawa",
                "username": "_aikawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=71297"
        },
        {
            "content": "Kiss x Sis is a risqué story about love, lust and, comedy. It’s an Ecchi with a very basic plot that uses absurd shenanigans often times sexual in nature as the comedic device of the show. Usually leaving the viewer thinking “wtf am I watching”. At the beginning of every episode I would wonder what kind of silly antics Ako and Riko would employ on their brother this time. \r\nAko and Riko have an immense amount of love for their younger brother, even to the point where they will not consider dating any other boys and will turn down all other admirers. They express theirlove through lustful acts towards their brother Keita, quite possibly in the best way they could express their love. The show really takes you back to traditional family values and the importance of loving the ones you are with. Peoples criticism of the whole “Incest” thing is generally exaggerated, I mean come on their not even blood related! Incest is Wincest after all. \\n\\n\r\nThis anime is all about self-control and how one should not always give into lust and temptation as demonstrated by Keita’s character throughout the series. I viewed it as a case study of what to do in such circumstances. Unfortunately I myself would not have been able to resist such temptations in many of the situations Keita finds himself in. But on occasion he will give in if only for an instance, this shows that even Keita is only human and can be overtaken by feelings of lust and temptation.   \\n\\n\r\nIf you are going to watch this I would strongly recommend you watch it with your sisters, if you don’t have any just watch it with your mom.",
            "date": "2014-10-30T13:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 166821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994491.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnuCheekiBreeki",
                "username": "AnuCheekiBreeki"
            },
            "url": "https://myanimelist.net/reviews.php?id=166821"
        },
        {
            "content": "Okay, a little backstory. About a year and a half ago a friend told me about this and he said it was pretty messed. I didn't think it would be that bad... but I was wrong. This anime is crap. The main problem is that it made me say: 'What the hell?!' every couple of minutes. The two sisters trying to bang their younger step brother and often molesting him just creeped me out, but I couldn't stop! I'd finish an episode and say, 'That's it, I'm done.' But I couldn't stop watching it! I needed to see what was going to happen!\r\nNow that rantis out of the way, lets get to the nitty gritty bits. The art of the show is pretty average and the story is pretty poor. Every episode is basically the sisters trying to find a way to seduce their brother and then molest him. I disliked most of the characters especially Keita, who had very little character and was basically there to be an object of his sisters' desires. The sisters themselves are alright characters but they still made me uncomfortable sometimes.\\n\\n\r\nI didn't completely hate the series though: I found some enjoyment in some of the episodes (one bit involving a chocolate banana). The only character who I really enjoyed was the teacher of the two sisters who is an otaku obsessed with samurai who tries to stop the sisters from trying to sleep with Keita. She had good moments and one of the few characters who I cared for. The opening and ending songs are also one of my highlights, incredibly catchy and fun numbers.\\n\\n\r\nOverall, pretty bad show with mostly bad characters but some funny moments, one character and good opening and ending songs stand out",
            "date": "2015-02-10T13:54:00+00:00",
            "helpful_count": 11,
            "mal_id": 180097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4344553.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/H3nry_D_96",
                "username": "H3nry_D_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=180097"
        },
        {
            "content": "Ok so i was browsing the animelist on Animefreak.tv today and i watched a short 12 episode anime called Kiss x Sis. Now Kiss x Sis is an anime that borderlines with hentai expending on whether or not you're watching it uncensored or censored. Although there was a bit more fanservice than i would have liked, i enjoyed the anime nonetheless for a few reasons which i'll get back to later. But for now, let me break down my scores and give explanations \r\nStory-7: The story was pretty basic for the most part. -i'm not gonna spoil the story for you since i'm assuming you'rereading this review to decide if you wanna watch it- But for a short 12 episode anime series, i like the predictatble kinda generic or basic story because it'll be a short watch and it draws my attention for time. Whoever wrote the story for Kiss x Sis did a decent job in my opinion, but i would have liked to see a bit more of the cool things the main character did for his sisters before the story starts. but that's just me. \\n\\n\r\nArt-8: The artwork was well done in my bias. i watched Kiss x Sis in decent quality so the artwork shined. While some of the characters look badly drawn-otaku's dream boy(character reference)- others look well done, which i don't really mind as long as it's not stick figures lol. \\n\\n\r\nSound-8: The sound definitely hits home with what the anime is trying to do. the cutesy innocent kinda pop songs that make you scratch your head and wanna pretend like you saw nothing. the voice acting was well done as well. no freaky english in this anime, it sounds well done. \\n\\n\r\nCharacters-9: Whoever's mind created this cast of characters is good. He/She took some steorotypes and mixed them with other steorotypes which makes them seem fresh, which is a good idea in my personal bias. The teacher's character is definately my favorite-you'll see why if you watch it- she's insane... end of disscussion \\n\\n\r\nEnjoyment-8: Although the entire anime is BRIMMING with fan service, i enjoyed the few tibits of comedy. even though some of the comedic scenes had some form of a sex joke in them. I can't say that i was disguested, but i  enjoyed the anime. \\n\\n\r\nOverall-7: This anime is definately out of my comfort zone-action comedy and some lovin- but i can't say that i regretted wasting around 3-5 hours watching it. It was a good anime but i must say, much of the stuff borderlined with hentai depending if you watching the censored version or not. because there are some scenes that will make you go, that's just nasty. But if you don't mind the hentai-ish scenes and are looking for some comedic love triangle anime, i'd say watch the first few episodes and go from there. take a chance and who knows you might just stay to watch it.",
            "date": "2010-08-26T00:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 29967,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/193146.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TSX",
                "username": "TSX"
            },
            "url": "https://myanimelist.net/reviews.php?id=29967"
        },
        {
            "content": "Have you ever watched something so ridiculous you couldn’t have enough of it? That’s what this is. Kiss x Sis is so ridiculous, you just can’t stop watching it. This anime is like a box of assorted candy, you don’t know what you’re going to expect. The genre’s for this anime are harem, ecchi, romance, school, and comedy.\r\nStory: (6/10)\r\nThe story’s setting is like any other school based anime you watch. You see the typical track field, the school classroom, and the typical festival. The story itself, however, is something you don’t usually see in an anime. The main character, Keita, has to choose between oneof his two sisters, Ako and Riko, who aren’t related to him by blood, to marry as he tries to enter the same school as them. Unfortunately, you don’t get to see who he marries in the end, which I was disappointed by, but you do see the female characters try to get the upper advantage over each other to win Keita’s affection which I found to be quite interesting. As you may have expected, Kiss x Sis is sexual in a lot of ways. From using objects as a way to show affection to almost having sex with your sister, if I can say one thing about this, it’s borderline from becoming a hentai. Well of course you couldn’t have an ecchi and harem anime without its clichés. You’ll see many clichés throughout this anime such as nose bleeds, boob grabbing, and panty shots. You’d expect these clichés to be dumb, but for some odd reason Kiss x Sis does it in a funny way in which you will forgive it. \\n\\n\r\nArt: (8/10)\\n\\n\r\nThe animation for this anime was produced by a company called Feel. If you haven’t heard or don’t know the animation company, Feel, they’re the ones who produced Mayo Chiki!, Yosuga no Sora, Outbreak Company, and My Teen Romantic Comedy SNAFU TOO. The art style and environment to this anime looks typical. I’m not saying that’s bad, but nothing really stood out to me. \\n\\n\r\nSound: (8/10)\\n\\n\r\nThe opening and ending theme songs sound J-popish, which I don’t really mind, but I didn’t find them to be memorable at all. The same goes for the background music, but it seemed to match each scene, which is fine in my book. The voice actors and actress did a fine job too, I couldn’t really complain.\\n\\n\r\nCharacters: (7/10)\\n\\n\r\nWhat’s an anime without its characters? The characters itself are pretty generic, but have a clear distinction between them. There are some clichéd side characters such as the loli and big breasted female character. For the rest, there’s actually some uniqueness to them. For example, one of the characters is bad at cooking, while the other is not. Using the character’s uniqueness, the writers use the character’s characteristics to make each character seem like the best fit for the main character to date. All the characters certainly elevate our main character by giving his harem role. \\n\\n\r\nEnjoyment: (8/10)\\n\\n\r\nThe reason why I gave this an 8 out of 10 is because I felt awkward and uncomfortable at times. There’s this one character, in the show, who is your essential loli. One of the many things I did not like about her is that she’s flashes her panties at Keita, which feels really weird and awkward considering she is in middle school, but hey, I give props to the creator for writing something that we usually don’t see. The thing I like about Kiss x Sis is that it tops the last perverted thing they did. If you’re going to make a harem and ecchi based anime, at least make it outrageous enough for you to like it and kiss x sis exactly does that.\\n\\n\r\nOverall: (7/10)\\n\\n\r\nOverall, I enjoyed this anime, but I felt empty after watching this. It felt like something was missing. I enjoyed the show, but I didn’t feel hooked with the overall storyline. After I finished, I asked myself, “Was that it? Is there any more?” I wasn’t satisfied with the story and I certainly wasn’t satisfied with the ecchi. It felt like it needed more. Kiss x Sis will certainly entertain you with outrageous sexual acts, but it lacks meaningful story that I can’t really connect.\\n",
            "date": "2015-08-06T22:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 195398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4550811.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OtakuJKP",
                "username": "OtakuJKP"
            },
            "url": "https://myanimelist.net/reviews.php?id=195398"
        },
        {
            "content": "KissXSis is perhaps one of the most interesting series I have seen. It is basically a series that tries really hard to be softcore porn, and it works. While there are some ecchi series out there that actually do have strong plots to them, KissXSis is an entirely different case. Its approach to fanservice is not just through having big breasts and panty shots. It does so simply by making the scenarios fun to watch.\r\nIt is hard to really explain what is so enjoyable about KissXSis other than that the weird moments feel very genuine. While the absurdity of the series and its perverted natureis often funny, it is more to the romantic and sexual nature of the series that drives it. KissXSis is a series that is downright orgasmic in tone, which is quite a difficult feat to pull off when your series is about brother sister incest.\\n\\n\r\nWhat really works about this series is that the relationship between our characters feels real, which I can imagine is a difficult thing to accomplish with such a controversial premise. This is also the case because the characters are more realistic than most would believe. The series may have brother sister incest as a plot device, but Keita and his sisters, Ako and Riko, are not blood related. On a subconscious level, there is a psychological effect that prevents people from having a sexual attraction to those they were raised with closely; this is what makes most people find the idea of incest to be disgusting. \\n\\n\r\nHowever, in KisXSis, Keita and his brothers were not with each other from birth, yet were unnaturally close during childhood. Also the character's approach to this is interesting as well. Keita is the only person involved that has any qualms with the idea of a relationship with his sisters. Both Ako and Riko make their lust for him clear and their parents actually encourage it. Keita himself, is usually in a state of denial and does not want to believe in the idea, but he has a very hard time ignoring his true feelings. \\n\\n\r\nMost aspects of the series that occur are ones that are more so unlikely than unrealistic, and most of the unlikely aspects occur for comedic effect. The unlikely aspects of this show end up working to the show's advantage because comedy is largely based on subversion of expectations. There are several moments in the series that work so much better comedy wise by having most female characters as mischievous perverts rather than the obnoxious prudes that have infested anime ever since Love Hina. \\n\\n\r\nMusic wise, the series is pretty good. The ending theme in particular is really catchy and a lot of the music during emotional moments fit very well. The art on the other hand is pretty low quality and has a lot of skips in animation and reused clips.\\n\\n\r\nOverall, KissXSis was a very fun series to watch. I am tempted to say that it is a guilty pleasure, but I personally dislike that term due to it implying you have to feel guilty about what you like. While I suppose it can be argued that the series relies a bit too much on sexualization, I can at least confirm that it does that correctly.Overall, the only thing that I can really say is wrong with this series is that it doesn't try to be anything amazing. However, KissXSis does succeed at creating a fun story with likable characters and funny moments as well as being very arousing. Obviously it goes to say that if you do not like incest or fanservice then you would not like this anime about incest and fanservice, but if that is the case then why would you be reading this in the first place? If you are a fan of ecchi series and don't mind incest,, then this is a series you will enjoy.",
            "date": "2014-11-04T11:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 167409,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4215587.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iyamtebist",
                "username": "iyamtebist"
            },
            "url": "https://myanimelist.net/reviews.php?id=167409"
        },
        {
            "content": "Ecchi fans comes,\r\necchi fans watches,\r\necchi fans need this,\r\ntell it to me p...s.\r\nYeah, this is one fcked up anime, I mean, WTF is the point of it. I would give an gold medal to the animator (whole team) for the best ecchi anime and I would kill him (them) too because of how much this is messed up (from the incest side I mean). \r\nSo, from the synopsis you could have read there is incest, wincest for somebody. Althrough this anime is from 2010, I ve never saw it anywhere.\r\nWe are taken to the story of Keita, he have two step sister (they obviosly love him),mom and dad that should get gold medal too, for being the best perverted and funniest dad in Japan (seriosly he is tooo funny, atleast every scene with him made me laught...). This anime is pretty funny actually. The names of that two, not so innocent, step sisters: Riko, Ako. I must admit, they are cute... I meant KAWAII. As said they want Keitas D, he dont want them (from start), they still want him. Upon some time when he have to choose on which high school he wants, he chooses same high school where his two sisters are. They will help him with preparation for the entrance examination. In that time he will start get a little more exited about the love from the side of his step sisters. From that point almost every male viewer (I dont say every) will start getting that little boner from some scenes(still its only ecchi). You will be dragged to some \"Pre-main\" story scenes. What i want to say is, its not centered only around Keita. Also there will be more girls he will play with ͡° ͜ʖ ͡ -. How will it end? Try to guess. If you cant guess, go watch it. If you are female, dont watch it, because you will find some mans wishes there... \\n\\n\\n\\n",
            "date": "2016-09-29T13:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 230551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713235.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ivaaan",
                "username": "Ivaaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=230551"
        },
        {
            "content": "There are certain issues that it can be rather tricky to handle in fiction of any kind.  Drug addiction, suicide, sexual abuse, etc.  One of these topics is incest - and while some shows have it to act as a commentary of sorts, for every show that does this (the only example that comes to my head is Koi Kaze), there's a show that has incest for the sake of incest.  Like KissxSis.\r\nStory - 3/10\r\nThe story to KissXSis is a rather generic harem/romcom story, with the only thing that's really unique about it being the incest.  The plot of each episodecenters around Riko and Ako attempting to seduce their brother - and given the main \"appeal\" of this anime, you can probably guess what happens at the end.  The story tries to excuse the incest by saying that Keita (our male lead) and his sisters, Riko and Ako, aren't related by blood - they're related by marriage.  And I don't buy that excuse, because quite frankly, they're still related - it's still incest.  You can get a flu vaccine via that mist technique instead of having a shot, but that still doesn't change the fact that you got a vaccine.  At least the show has Keita's sisters be slightly older than he is.\\n\\n\r\nHalf of the events are ones that would work in a generic harem/romcom, but there are also events that are absolutely disgusting.  For example: in one episode, Riko and Ako both make a good luck charm for their brother.  While this sounds innocent enough, they do so by putting one of their pubes in the charm.\\n\\n\r\nArt - 6/10\\n\r\nI'm not a fan of the style they used here, but it wasn't unpleasant to look at - it's passable.  Nothing I'd write home about, but nothing I would condemn, either.\\n\\n\r\nSound - 4/10\\n\r\nThe sound isn't bad per say, it's just pretty forgettable - the opening is generic J-Pop, and the ending is also pretty generic.  The voice acting is...okay, I guess, but it's not something I'd say really stands out about this show.\\n\\n\r\nCharacter - 3/10\\n\r\nRiko and Ako are generic older sisters, who only interested in screwing their brother - they don't even talk about normal conversation topics (I do not remember a single moment where they talked about something like the weather or how they were doing at school).  Keita seems like he's resisting their efforts at first, but he then goes to reluctant to have them fall for him, to not having a problem with their advances by the end.\\n\\n\r\nThere was literally only 1 character who objected to Riko and Ako's efforts to seduce their brother - their teacher, Yuuzuki Kiryuu (and it's for that reason why I actually found her to be the one character I liked about the show), who happens to be a closet Otaku (I know that Otaku generally refers to males, but I forget the female counterpart), and she's really into cosplay (this is actually important during several scenes).  Everyone else doesn't have a problem with it - in fact, the parents of the 3 main characters actually encourage Riko and Ako.  It would have been one thing if they did this once as a joke, and then scolded the twin sisters the rest of the time.  But no, the story chooses not to redeem itself.\\n\\n\r\nEnjoyment - 1/10\\n\r\nI actually enjoy watching harems every now and then (it's not a perfect genre, but there are shows in the genre that I genuinely enjoy), but this was the first one that I watched (that I didn't have mental scars as a result of watching) where I did not have at least some enjoyment from watching it.\\n\\n\r\nOverall - 2/10\\n\r\nI'd just skip this one.  It's not really worth your time, and there are tons of better series out there that would take you the same amount of time to watch as it would take you to watch this one.\\n\\n\r\nAlternative recommendations: Koi Kaze, Heaven's Lost Property",
            "date": "2015-05-28T19:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 189056,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4362301.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RoarkTenjouin",
                "username": "RoarkTenjouin"
            },
            "url": "https://myanimelist.net/reviews.php?id=189056"
        },
        {
            "content": "this is one of those anime that is so pathetically bad that it makes you interested because it is so fucking weird, the story of a guy whose twin sisters are obsessively in love with their brother (sexually!) and that's that!\r\nyou know when they say we are friends with benefits? well this is family with benefits\r\nit's the funniest anime I've watched, no one makes any sense, when his father finds out he is involved with his sisters he encourages him! yes that's right! his father and mother wants him to bang his sister! so much so he get annoyed!\r\nin one of the most bizarre sceneever, one of the students pee on the main character accidentally twice!\\n\\n\r\nanother funny thing is his teacher finds out and try to stop them but guess what? she gets schooled and is forced to apologize!\\n\\n\r\nyeah you are dealing with this type of an anime, watch it at your own risk",
            "date": "2018-11-27T14:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 294829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7529349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/YohanViLiebert",
                "username": "YohanViLiebert"
            },
            "url": "https://myanimelist.net/reviews.php?id=294829"
        }
    ],
    [
        {
            "content": "Alright, I've been putting this review off for a while. I just haven't exactly been ready to share my thoughts about the show, mostly because any thoughts people have on this show will most likely be typed with one hand.\r\nAnyways, Kiss x Sis, the one anime I'm guessing all echii fans have heard of. That's right, those who aren't aware of this, Kiss x Sis is an echii, not a hentai, due to the fact that there is no sex in this show, but I can safely say that this is borderline echii, which in my universe is one notch below hentai. I decided towatch this because my girlfriend said that she laughed her head off while watching this. She failed to mention everything else about the show, so this review is mainly focused on preparing you for what you're planning on watching.\\n\\n\r\nFor a 12 episode series, I was fairly surprised that they could make so many episodes about an incestuous relationship, but somehow they pulled it off. To start off, let's talk about the story, shall we? The story revolves around a Junior High Schooler, Keita. He's about to finish his last year before High School. Seems normal enough. Oh, wait, I forgot to mention the fact that before all of this is explained, Keita wakes up to both of his twin sisters sleeping in his bed, cuddled up against him. They wake up, give him a kiss after teasing him a little, and just walk out. First 5 minutes of the anime, that's what happens. Was not expecting that. Anyways, apparently his sisters love him in a lustful way, and by lustful, I mean that they're madly in love with him. However, people could debate whether it would be okay for them to love him in that way, due to the fact that they're his STEPsisters. They aren't biologically related, but at the same time, brother and sisters... but the main storyline is based off of Keita and his sisters' relationship. In terms of an actual plot, there wasn't anything big, every story seemed to be something different.\\n\\n\r\nLet's see, this anime was made 3 years, 2 months ago in 10 days from now. Overall, the artwork was relatively modern. But that's a good thing, because the artwork today is really quite impressive. It was easy to tell the twins apart, mainly due to the different hairstyles and the bandaid on one of their cheeks, haha. The echii scenes were also fairly detailed, and don't get me started on  the erotic museum and shopping center... oh God... so detailed... my eyes...\\n\\n\r\nSound was one of the reasons this anime might be thought of as a hentai. I think you all may know what that means. Despite that, voice acting was good, if not realistic... I think the thing that made me laugh the most was Riko's comments and jokes. They were really well thought of, and it brought that mature yet funny side to the anime.\\n\\n\r\nEhh... I liked some of the characters, but not all of them. Keita seemed a little indecisive. It wasn't that I hated him, it's just that he isn't really able to make up his mind about a lot of things. He could have a nice relationship with his sisters (not that I support it or anything), but he chooses not to, and the thing is, his parents are all for the idea. That made me laugh a lot, his parents, but still, Keita should make a decision. Ako and Riko were the 2 best characters in the show if you asked for my personal opinion. They seemed like really nice girls, and they really do care for people. With the main characters out of the way, there were a bunch of good minor characters, but despite the fact I liked them, I was glad to see there was a limited amount of air time for each of them, I would have preferred to see the Keita/Ako/Riko story unfold little by little.\\n\\n\r\nOverall, it was a fairly good anime. It was probably the 2nd time I've seen an anime like this (referring to Yosuga no Sora), and I can't say it's my favorite kind of anime, but I liked most of it. I enjoyed the comedy and the romance...\\n\\n\r\n...but it did get annoying having to reposition my laptop on my lap in order to get comfortable again...",
            "date": "2013-05-15T20:44:00+00:00",
            "helpful_count": 195,
            "mal_id": 97315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=97315"
        },
        {
            "content": "Kiss x Sis is the TV series to the OVA and manga adaptation. It is about a boy, Suminoe Keita, and his everyday encounters (often perverted) with his older twin sisters, Ako and Riko.\r\nThe plot of the series is light, you can almost think of it as slice of life if you take out all the erotic antics from the equation. But then it wouldn't be AS good as it is now would it?\r\nMany of the scenes aren't much better or much worse than what you would see in a regular show this season. Although the details of \"certain\" scenes clearly had much more dedicationfor you know.....Obvious reasons.\\n\\n\r\nThe soundtrack also seems to be similar to the art as it won't stray too away from the industry standard. You have your mix of erotic music, cliched moment insert songs, and the OP and ED (which were decent).\\n\\n\r\nAs for the charactere s of the show, I think they were nicely done. I think its safe to say that Keita seems like a reasonable representation of most average guys. Now on to the bread and butter of the show, Ako and Riko. While the twins aren't the most stellar or beautiful characters out there, their love and borderline actions to get to Keita that draws you in, thinking \"Oh god go for it\" or \"DO IT, DO IT\". I do think the twins' were a bit over the top, trying to get off and get into Keita's pants all the time. But its definitely their appeal that has you coming back for more.\\n\\n\r\nIt would be a giant lie if I said that I don't enjoy the show. Each episode has a different means of seduction or...enjoyment. And I truthfully admit smiling like a complete idiot at the end of each. Bluntly speaking, it is borderline hentai/porn. The show knows how to take foreplay (for you kiddies reading this wait a few years before find out :P) and make it so much more appealing. So far each episode is a  c**ktease and you know kinda left me \"unsatisfied.\"\\n\\n\r\nI originally read and watched the manga and OVA, so the TV animation certainly met my expectations. Although I am a little disappointed that more couldn't be done to improve the quality of the show in terms of animation and music. I think for many of the viewers, its a hit or miss show. If you don't like perverted stuff, it really may not be for you. But if you don't mind feeling a little horny after watching an episode, I definitely recommend this.",
            "date": "2010-05-06T06:11:00+00:00",
            "helpful_count": 180,
            "mal_id": 25784,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KY791",
                "username": "KY791"
            },
            "url": "https://myanimelist.net/reviews.php?id=25784"
        },
        {
            "content": "The story revolves around a junior-high student. Keita is your average, easy to relate to guy struggling to get his grades at a certain level, so he can go to the same school as his sisters. Yeah, his twin-sisters. Actually, they aren't blood related, but their parents married while they were still young. Now normally that wouldn't be much of a problem, but this time both are madly in love with him. Throughout the anime, they both try to win his heart, often causing him to fail at what is trying to. As the story continues, he gets more and more interested in them, andthat even results in a few spicy scenes. Well...what am I saying? I guess you could say this anime has quite a bit borderline hentai scenes. Now don't think because of that, this anime is bad, because it isn't. It's very lighthearted and enjoyable, just as anime like this should be!\\n\\n\r\nThat said, the animation is great, unlike most (borderline) hentai anime. The characters and background are animated well, and I'm quite fond of the colouring. I haven't found many scenes where characters are moving awkwardly, or anything alike. Sometimes though, especially when scenes get a little more sexual, you'll notice the occasional flaw, or at least the really hentai-like kissing. But seeing there's more than enough good animation to make op for that, i don't really mind at all. And I'm sure most people considering to watch this one wouldn't either.   \\n\\n\r\nBoth OP en ED are incredibly catchy. After a few episodes i found myself humming the ED while showering. I can't say I'm really proud of that, but you get my point. The voice acting is pretty good. The two girls are equipped with the required -and well preformed- \"little girl\" voices, and just hearing Ken Takeuchi voicing Keita is usually more then enough to feel his awkwardness. I saw the OVA before, but still wasn't expecting much of the voice acting, but i can say I'm positively surprised. \\n\\n\r\nThe characters aren't special, but certainly not bad. Keita is the typical \"harem-anime lead\", spending most of his time fantasizing about the girls, or doing things with them he normally fantasizes about. Ako is the mature sister, who cooks for the family, has good grades etc. Riko is a more of a childish and playful type. Although you'll sometimes ask yourself what their differences are, they are especially visable when seducing Keita. \\n\\n\r\nTo fill in some of the blank spots, there are some filler characters. I must say they are pretty well made. There's a group of guys who represent Keita's school friends. They constantly point out Keita's luck to have two hot sisters to love him, often causing Keita to fantasize about his sisters himself. There is also a loli who seems to have a crush on him. And we have Ako's teacher, who's also aforementioned loli's sister, an Otaku who tries to make Keita, Ako and Riko see their incestuous tendencies, are wrong. Their parents also have a small role. They're very stereotypical parents, except for the fact that dad encourages their love, and especially Keita's manliness. Last but not least we have Miharu Mikuni, a shy, glasses wearing, big-titted girl, who does the best job providing us with some interesting comedy.    \\n\\n\r\nOverall I think this is a more than decent anime. The main reason to watch this would be the hot brother-sister action you might be into, but i mostly decided to finish it because it just is a very entertaining anime.\\n\\n\r\nSo, if you're looking for an easy going anime, and wouldn't mind some interesting sexual scenes, this might be the anime you're looking for.\\n",
            "date": "2010-08-25T12:02:00+00:00",
            "helpful_count": 103,
            "mal_id": 29954,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tiggernits",
                "username": "tiggernits"
            },
            "url": "https://myanimelist.net/reviews.php?id=29954"
        },
        {
            "content": "I only watched episode 1, well half of the episode... actually just the first 10 minutes, but let me tell you... thats all you need to watch, and it's really bad, and goes to far, even for an ecchi anime.\r\n*This is just my opinion, don't get your panties in a bunch because if you know who you are, then this review won't change your opinion.*\r\nREVIEW: It starts off with a scene with a child version of the main character, Keita Suminoe, being protected by his older sisters, Ako and Riko, from a dog. After his sisters scare the dog away they both kiss Keita onthe cheeks at the same time, and at the same time I thought, \"That was cute.\"\\n\\n\r\nThat is the first and only time I would think of this anime as \"cute,\" because this anime is anything but \"cute.\"\\n\\n\r\nThe scene is then revealed to be a dream while Keita is sleeping in school. Keita is then woken up by his perverted friends, and by perverted I mean how they go on to talk about lucky he is to have sisters to sleep with, and strongly suggusting Keita gets to have sex with them.\\n\\n\r\nI guarantee your reaction will be \"What the hell?\"\\n\\n\r\nThe next scene is Keita returning home with his sisters flying at him as he enters the house, along with paired panty shots.\\n\r\nThen out of no where, they flash their breasts at him. \\n\\n\r\nWas that supposed to funny?\\n\\n\r\nThen Keita goes to take a bath and... gets a boner when he thinks about his sisters flashing their breasts at him. \\n\\n\r\nI'm not convinced that was supposed to be funny...\\n\\n\r\nAnd while he takes a bath, his sisters goes though his undergarments, and one of brags about having the underwear Keita just took off.\\n\\n\r\nWell, I guess I can see how some people would think this is funny, but seriously?\\n\\n\r\nIt just became torture after this, and I refuse to continue.\\n\\n\r\nSTORY: It's about silly antics with the main characters two perverted sisters who are sexually attracted to him, and really want to jump his bones, and... nothing much else. Pathetic doesn't even begin to describe it.\\n\\n\r\nANIMATION: Pretty average really, it's pretty much the only acceptable thing about this anime. \\n\r\nCharacter designs are pretty much meh.\\n\\n\r\nSOUND: I can't really say anything about the voice acters, but I got really irritated by the sisters dialogue. And I hated the theme song.\\n\\n\r\nOVERALL: I would go far as to say; I honestly hated this anime, and would love to scrub my brain with bleach if it would help me forget Kissxsis. \\n\r\nAnd I know that they are not related by blood and that itself is a part of a \"joke,\" but I still found this form of incest to be just as disturbing as actual incest, it's not funny, it's just gross.\\n\r\nConsider yourself warned, but to the people who like this sort of thing, have at it, cause I'm not touching it.",
            "date": "2010-11-15T23:25:00+00:00",
            "helpful_count": 82,
            "mal_id": 32080,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/344979.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/artist-retired",
                "username": "artist-retired"
            },
            "url": "https://myanimelist.net/reviews.php?id=32080"
        },
        {
            "content": "Keita Suminoe is a fifteen year old middle school student who only wants one thing...  To pass his finals, and make it into the same high school as his older twin sisters, Ako and Riko.  But he has two obstacles standing in his way.  The first is that he’s far more athletic than scholarly, which makes studying and taking tests difficult for him to manage.  And the second is that both of his sisters are madly in love with him, providing him with endless distractions as he tries to do the simplest things like eat, sleep, and of course, study.And it’s not just them, either...  One of his teachers, a fellow student that he accidentally groped, and a short loli-like girl from his school are all starving for a taste of his knob.  What can poor Keita do when these women have so much love to give to him, and he only has about six inches to give to them?\\n\\n\r\nKissXSis was allegedly animated by a small time company called Feel.  Why do I say allegedly?  Because it looks nowhere near as good as one of their other anime, So I Can’t Play H, whose incredible production values was it’s only redeeming factor.  In fact, the difference in quality between these shows that were made only two years apart is so vast that I almost want to call BS on wikipedia for telling it to me.  I guess it’s possible that feel didn’t feel the need to put as much money into this project as they’d later wind up pouring into H, and if that’s the case, I suppose I understand.\\n\\n\r\nThat’s not to say the animation is awful, though.  It’s not great, but I’ve seen plenty of shows that looked a lot worse than this.  The artwork is crisp and clean, and a few of the character designs are inspired, although most of them look generic, and the weird little shiny marks on the girls’ skin can get pretty distracting.  The bare bones budget is actually managed fairly well.   There are several moments when the moneysaving animation techniques are blatantly obvious, but for the most part, the series sticks to slow, limited movements that suit it best, saving it’s money for the few...  Um...  *cough* action scenes that need it more.  What bothered me was more WHAT they were animating than how they were animating it, I guess.  The music isn't bad either, just generic and forgettable.\\n\\n\r\nSo, I’m going to go into new territory here.  Over my years of reviews, I’ve made a habit out of talking about the animation of any given series as well as the company that produced them, but never before have I talked about the TV station that they aired on.  Since this show doesn’t have an English dub for me to discuss, and I don’t really feel up to discussing the sub, I’m going to go ahead and tell you all about a Japanese TV station called AT-X, or Anime Theater X.  \\n\\n\r\nAT-X is a Japanese premium channel...  In other words, a pay-per-view station... that, by the very nature of those words, is allowed to show most of their programs uncensored, kind of like HBO.  They’ve aired many TV-MA titles since they were established in 2000, including Elfen Lied, Mahoromatic, Highschool of the Dead, Dance in the Vampire Bund, and the Japanese dub of My Little Pony Friendship is Magic(Wrap your head around that one).  Being a pay-per-view station, they have the right to show their programming with nudity, excessive violence, groping, and all that fun adults-only stuff to it’s mainly adult crowd should they choose to do so, with streaming sites like Funimation.com and Crunchyroll.com opting to air censored versions anyway.\\n\\n\r\nThis turned out to be the perfect place for KissXSis to air, as it’s filled to the brim with adult imagery.  Not only is there underwear shots and bare bottoms galore, this show goes all out with french kissing, lines of drool falling afterwards as a result of said kissing, frequent groping, girls peeing(from many different angles), the outline of the main character’s erect penis through his clothes as his sisters very explicitly fondle it...  And yet, in the very rare moments of actual nudity, the girls in the series were given nondescript Barbie doll bodies.  Considering just how little of a fuck this series gives in regards to it’s content, that’s a hilariously bizarre omission to make.  Because, yeah, as far as this show is willing to go, nipples are the line they don’t want to cross.  It’s especially strange when you take into account that their brother, Keita, very clearly has nipples in the scene when Ako and Riko are teaming up to lick them.  I guess it makes sense that since he’s not blood related to them, he wouldn’t share the same physical deformity that they have.  At least that’s the explanation that I’m sticking with.\\n\\n\r\nMy first attempt to watch this show was back in the fall of 2012.  I’d heard some stuff about it from both sides of the fence, so I felt some morbid curiosity as to just how bad it could really be.  I wound up quitting after two episodes, already calling it the worst anime I’d ever seen.  To be clear, it’s not the incest that turned me off...  I’m not as offended by that topic as a lot of people are.  But in order to make the topic of incest appeal to a broader audience than just the people who want to jerk off to it, you HAVE to play the societal stigma card to make the material relatable.  The related couple has to face judgement from the people around them.  I mentioned as much in my review of Oreimo, and I even used what little I’d seen of KissXSis as a reference tool.  \\n\\n\r\nWhat had me running away from KissXSis as fast as I possibly could was, ultimately, the way it’s world was reacting to our three blood crossed lovers.  At school, the entire male student body was obsessed with Ako and Riko, to the point that they would ostracize and bully Keita for living with them, and form an unruly mob to chase the two girls whenever they wandered onto the school’s campus.  The only character who showed any repulsion to the idea was some big boobed glasses girl who you could immediately tell was just going to fall in love with Keita, effectively turning what could have been moral outrage into jealousy.  As I would later learn from the appearance of his teacher, that’s exactly what the writers were going for.  Keep in mind, at no point in the story are we given any insight into why such bland looking characters would be sexually deified to such extreme levels.\\n\\n\r\nAnd to make matters worse, their parents weren’t just okay with this debauchery between their children...  They were encouraging it.  Right at the end of episode 1, they start hounding Keita to excavate the gold mine of forbidden pussy that lived a few rooms down from him.  They also drop the bomb on us that Keita and his sisters aren’t really related by blood...  Keita is his son, and the twins are the mom’s daughters, so they’re actually just step siblings, and the anime constantly shoves the fact that they’re blood relatives down our throats to remind us that what’s going on between them is perfectly A-ok.  Which, as I’ve mentioned in the past, it’s not.  Children who grow up from a young age together as siblings and go through puberty in closed together become sexually desensitized to each other, and I swear i’m not making that up.  Whether or not they’re actually related by blood is a non-issue, that’s just how it works.  It’s legally okay, but only the sleaziest perverts ever call upon legal loopholes to excuse their tastes.\\n\\n\r\nAfter confirming with the second episode that this show was not going to get any better, I decided I’d had enough, and stayed away from it for a year and a half.  That was until my long awaited two week vacation from work, when I let my two best friends each pick an anime for me to watch in my free time, and one of them challenged me to finish the series once and for all.  The only reason I’m not going to punch him in the face is because he said I don’t have to watch the OVAs.\\n\\n\r\nUpon my second attempt to watch KissXSis, I’ve noticed that not only does the series never get any better, but it takes every possible opportunity to get worse.  And I’m not just talking about the depraved sexual content, which any viewer will either be able to take or leave.  There is nothing in this series that’s even remotely suggestive of any kind of story-telling.  The only plot is whether or not Keita will wind up sleeping with one of his sisters, but he’s so willing to fool around with them at the slightest provocation that it winds up not really mattering whether they cross the line or not.  The only conflict is over which sister he winds up with, but he never really shows any preference, and will happily switch between them as though they were Coke and Pepsi.  \\n\\n\r\nThere’s no story either, as the entire series is just an endless string of moments between Keita and his sisters, with no stakes, no surprises, no revelations, just interaction after interaction, competition after competition.  It can’t get old, though, because unless you were on the edge of your seat waiting for something graphic to happen, it was never interesting in the first place.  It’s portrayal of women is insanely ignorant and misogynistic, but...  Well...  It’s hard to be mad at it about that, because at no point does it ever seem to concern itself with what women are really like.  Granted, I ranted and raved about that when I originally rage-quit the series, but upon a fresh look, and a surprisingly boring viewing experience that was occasionally interrupted by random bouts of “You’ve gotta be fucking kidding me,” I think I’ve finally nailed what this anime is, and why it feels like a nonentity to me at this point, as well as why I can’t bring myself to be angry over how brain-smashingly reprehensible the content is.\\n\\n\r\nKissXSis is, at it’s core, a sexless hentai.  Now, I’ve seen several anime that I could throw that same label at before, but this is the first one I’ve ever seen that was actually aired on TV.  There is nothing more pointless than a safe-for-TV porno.  You can not realistically expect a porno to have realistic female characters, because it’s a porno.  It’s a jerk-off fantasy.  The only real reason someone could possibly watch this all the way through is to jerk off to it(watching it for reviewing purposes is not a real reason...  I’m insane, and a horrible person, so don’t do what I did).  Everything that happens in this show is just build-up to sex scenes that never happen, leaving it only palatable for the most desperate viewers who are looking for a good incest romp and somehow don’t realize that there are actual hentai out there.  \\n\\n\r\nThe only other type of audience I can imagine this series having would be people who either A: Have siblings they wish they could screw or B:  Wish they had siblings they could screw, and in either case, they’re droolingly eager to find some sort of escapist self-insert jerk-off fantasy where they have a pair of willing and able sisters that aren’t technically related to them, in a world where only the jealous haters have anything negative to say about it.  That would be the life, wouldn’t it?  Only no, it wouldn’t.  Grow up, and stop kidding yourselves.\\n\\n\r\nKissXSis has never been released stateside, and no self-respecting legal streaming service would ever touch it with a sixty foot pole.  It’s available on illegal streaming sites, and while I’d normally never recommend such a tactic, I honestly don’t care one way or another whether or not this title makes any money.  You can also find the Malaysian bootlegs on Ebay for dirt cheap, as it’s only about thirteen dollars for the TV version of the series, and around the same cost for the OVA series of equal length that came out a few years prior.\\n\\n\r\nIf KissXSis had been released as an actual legitimate hentai title, with at least the majority of it’s story arcs ending in sexual pay-offs, it would easily be one of the best titles in it’s genre, and no, I’m not exaggerating that.  The characters are well developed and complex...  By hentai standards.  The story is intelligent and well thought out...  By hentai standards.  The animation and music are very well produced...  By hentai standards.  With actual pay-offs instead of blue-ball teasing, the pacing would have been outstanding...  By hentai standards.  But this series wasn’t released straight to DVD in the adults only section of your local DVD store.  It was released on TV, in a much harsher and stricter medium.  As a legitimate TV anime, this show is just flat out pathetic, tasteless trash that only the most desperate and depraved audiences will find any sort of satisfaction with.  Since I am not one of them, I can’t even give this show a zero without feeling like I’m being too lenient with it.  Thus, I give KissXSis a -4/10.  Or I would, if MAL would let me.",
            "date": "2015-02-04T11:16:00+00:00",
            "helpful_count": 61,
            "mal_id": 179665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=179665"
        },
        {
            "content": "Fact is wherever there’s anime, there’s almost always some sort of fan service to be had as well. Ecchi series have been around for quite some time now and with every new show there also seems to be a continuous rise in the explicit material that is allowed to be shown on television, much to the delight of many otakus out there. One such show that pushes the boundaries is Kiss x Sis, an ecchi anime that attempts to blend perversion and comedy while also throwing some incest in the mix. Oh joy.\r\nKiss x Sis focuses on male protagonist Suminoe Keita and the shenanigans pulledon him by his two older twin sisters – or stepsisters, to be more accurate. The story takes place during Keita’s last year in middle school as he struggles with his final exams while also trying to resist (‘deal with’ would be the more accurate term, actually) his sisters’ often perverted advances towards him. Obscene things happen, comedy ensues, and so on and so forth.\\n\\n\r\nMost episodes adopt a casual pace and narrative typical of many other ecchi anime – not much happens plot-wise for the most part. Of course, there are some episodes that are an exception to the rule, though unfortunately in this case that’s not a good thing. Kiss x Sis does well in the ecchi and comedy departments, delivering some truly borderline hentai moments and successfully mixing in humour whenever the need arises. Surprisingly enough, the episodes that focus more on this aspect and disregard plot development are the ones that are the most enjoyable out of the lot.\\n\\n\r\nAs mentioned earlier, things don’t work too well when the anime goes for a more plot-oriented episode. Keita’s preparation for his upcoming exams makes for a useful plot point at first, delivering some good laughs as the sisters go about their usual sneaky ways in trying to intervene with Keita’s study hours both to support him and—perhaps more importantly—to get closer to him. Unfortunately, as the series progresses, a continually increasing focus is given to the more dramatic side of the story, which does not work at all simply because there’s no character development there to support it and also due to the fact that there’s a lack of compatibility between the comedy slash ecchi side and the serious side of the show.\\n\\n\r\nThere are moments when Kiss x Sis finds greatness and in turn delivers solid entertainment filled with humour and fan service that at times will leave you wondering just how far this anime is willing to go in that respect, but ultimately the series is brought down by its unnecessary need to inject drama into the whole affair. Those looking for ecchi and some entertainment will certainly not go wrong with Kiss x Sis, but then again, there are plenty other shows out there that offer more in pretty much every department.",
            "date": "2011-09-23T09:43:00+00:00",
            "helpful_count": 20,
            "mal_id": 43997,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241809.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Andristian",
                "username": "Andristian"
            },
            "url": "https://myanimelist.net/reviews.php?id=43997"
        },
        {
            "content": "Story: KxS has two parts, it's about twin sisters who are in love with there slightly younger stepbrother, and the stepbrother trying to get into the same highschool as them. While this sounds like a pretty simple story I have to give the writters credit for not making this either a true incest ecchi or an ecchi where the guy is just thrown in with a buch as girls who all love him (although there are others who slightly do). The story was fairly original although there were the typical filler episodes, a little heavy on the fan sevice in some but not too ridiculous.\r\nIpersonally thought this anime was great, in ecchi the main character almost always gets swarmed with ditsy girls who hit on him and he just seems like an idiot, but not here. In KxS the 3 main characters all had their own personalities and qualities, for example they could've made ako and riko (the twin sisters) airheads who acted just like one another but the only real quality they share is that they care for Keita. Also (and I really like to thank the writters for this) Keita wasn't some stupid idiot who was thrown into all this, he had his own set of morals and when his sisters started to hit on him he resisted and didn't give in (although there were some moments) which I find refreshing to see something that doesn't stereotype guys as horny idiots. It was nice to watch the progression of the relationship the three shared with each other and I'm glad there was the actual plot of him trying to get in the same highschool his sisters are in, this way it wasn't just based off of the sisters fighting for his love. Again I love the story because of Keita's morals he is put in a situation were both his stepsisters have feelings for him and he knows that he can't choose one but instead of going for both he makes the harder but much more mature decision not to give into them. I was however a little disappointed at the end where while they did complete the plot there was not too much on the part everyone cares about which is what  happens with keita riko and ako. One thing I didn't like about the story is throwing in about 3 other girls who appeared to like him, if they left them out I might've given this a 9 depending on how well they would've done without them. The 5 OVA episodes which are the first 5 episodes are a little better than the tv anime, I did find the transition from the OVA to the anime to be a little confusing because it seemed like their relationship in the anime hadn't advanced to where it was in the OVA's although the plot was in order.\\n\\n\r\nMusic: the music was good, it fit the anime very well, from the opening and ending thems to the music during the episode they all seem to fit nicely.\\n\\n\r\nArt: the art was also good, cute characters not too many lazy scene of just pictures (although there wasn't much movement during talking), still fits the anime.\\n\\n\r\nCharacters: the characters were the highlight of this anime, they were given their own personalities and were original.\\n\\n\r\nEnjoyment: I definetally enjoyed this anime, I was scepticle when I first started thinking it would just be another ecchi but was shocked to see how much I got to know the characters and think that anyone who isn't afraid of ecchi and some real funny/romantic moments should watch this.\\n\\n\r\nOn a final note I would like to say to women out there who critisize ecchi to understand that what it is is basically and romcom adapted for guys, if you take out the sexual mishaps/encounters, go a little heavier on the drama and make 1/4 of the characters guys most women would love it.",
            "date": "2011-12-11T01:52:00+00:00",
            "helpful_count": 18,
            "mal_id": 48943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/976291.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/VelocityWaffles",
                "username": "VelocityWaffles"
            },
            "url": "https://myanimelist.net/reviews.php?id=48943"
        },
        {
            "content": "It's very easy to misinterpret this masterpiece as your average ecchi-sketchy show, or even label it as \"borderline hentai\". Admittedly, it gets extremely raunchy many times. But that's the allure of the show and the artists challenge to its viewers. Can you look past the lewd and see the authors stark depictions of the every day life of a girl suffering through extended child abuse? \r\nSpoilers ahoy, you've been warned.\r\nStory: 10/10\r\nFrom the first episode we're introduced to our hero Keita, your typical unaware harem protagonist. He's got girls hanging off him left and right, to the envy of his entire school. The major plot ofthe show is his twin sisters attempt to get him admitted to their highschool.\\n\\n\r\nTheir infatuation with their brother is apparent extremely early, always sneaking into his room at night or trying to fool around with him. For all you wincest fans, I'm sure you're well aware of how often incest occurs in reality. There's the normal siblings fooling around as toddlers/children, playing doctor of sorts. And then there's the real stuff where they know what they're doing. That last one rarely ever happens, and when it does, it's usually a sign of something having gone wrong in the household. And something is very wrong in this household.\\n\\n\r\nOne of the heroines, Riko, as part of her character design, wears a bandage on the side of her face. One could assume perhaps she has a blemish she's hiding, as one would expect of someone wearing a bandage. However, this show takes place over the course of almost a year. Any normal blemishes would have long disappeared by then. Compounding that fact is the appearance of numerous flashbacks to when the trio were small children. Riko wears the same bandage in the same spot. By now, a casual viewer may just write if off as lazy writing, but it's actually a carefully crafted plot device.\\n\\n\r\nThe main characters mother and father (especially the father) encourage this incestuous relationship, even offering \"chances\" to Keita. Normally, parents are against incest, at most willfully oblivious or ambivalent. Outright support raises many red flags. And that red flag is that the father has been abusing these girls for a very long time. Riko is a rather rambunctious girl, likely she resisted his advances at one point and he hit her, scarring her. In her shame she covered it up with that bandage we see in the flashbacks. Ako is also a victim in this.\\n\\n\r\nTo deal with this trauma, they seek out their new brother, Keita. Throughout the anime, the girls try to sneak into his room for the night, because they know if they stay in their own, their father will pay them a visit. Keita, of course, is a bright young boy and is well aware of this, that's why he acts so oblivious to their advances. If he dares speak up against this, his father will hurt him, maybe even kill him. The mother is likely in denial about the whole thing, thinking it's just a silly game.\\n\\n\r\nAll this masked in what appears to be your typical harem-comedy.\\n\\n\r\nArt: 6/10\\n\\n\r\nNothing really special.\\n\\n\r\nSound: 6/10\\n\\n\r\nAgain, nothing memorable. The ED is pretty good though.\\n\\n\r\nCharacter: Refer above 9/10\\n\\n\r\nEnjoyment: 10/10 OR 0/10\\n\\n\r\nIf you understand what I mean by those dual scores. On one hand, it disgusted me how heart-wrenching it was, and I did not enjoy that. However, the fact that it did that deserves a 10.\\n\\n\r\nOverall: 10/10\\n\\n\r\nWonderful show with something for everyone. For the casual viewer, you have a fun little incest romp. For the critical viewer, you have incest deconstruction and multi-layered plots and characters.",
            "date": "2014-06-13T11:24:00+00:00",
            "helpful_count": 17,
            "mal_id": 146869,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/corntastic",
                "username": "corntastic"
            },
            "url": "https://myanimelist.net/reviews.php?id=146869"
        },
        {
            "content": "Finally it's there, the Kiss x Sis TV Series. As I was scanlating the Manga, I was longing for that even before the OVA was published. For starters: Unlike the OVA it's not going straight after the Manga! So don't get your hopes high, but still I think, if you liked the Manga, you'll like the TV-Show.\r\nStory: 9\r\n+ What's KxS about? Well, it's some kind of typical setting: One normal perverted boy, a few girls and a lot of ecchi. The exception on this \"normalism\" is, that 2 of these girls are his sisters. But as usual they aren't blood related... I think there isno big plot behind this, meaning every episode will be with a different storyboard then the others. But I could be wrong, it's hard to tell after just 2 episodes. After all it'll be something like: Whom will Keita end up with? Hey but that's the way we want it to happen, isn't it... In comparision to the OVA the TV show seems to be more Mainstream and not as \"hardcore\". I just want to remind you of the episode 3 of the OVA ;). BUt we'll see.\\n\\n\r\nArt: 8\\n\r\n+ Oh, it's nice to watch Riko and Ako-nee, they are very well drawn, as the backgrounds and the Details. There are no big specialeffects, blurs or anything like that.\\n\\n\r\nSound: 7\\n\r\n+ I think it's good, nothing out of the ordinary, but good. The voices are fitting the picture most of the time - and the music doesn't f*ck your nerves.\\n\\n\r\nCharacter: 9\\n\r\n+ Ho, that's the way we like it! Cuteness, some kind of mature elements, innocence and did I already mention cuteness? My favourite would be probably Ako, as she already was in the manga. No, they are balanced very well, and it's not as every kind of fetish will be covered with dozens of girls. There are just a few, but I think one of them will capture your heart non the less.\\n\\n\r\nFazit:\\n\\n\r\nDuring the Anime you can see all the elements of an Harem-anime you want to see: Love Trouble, holding back, perverted thoughts, love triangles, cute girls and ecchiness ;). But you should watch the Anime as just this Anime - The plot has only the same Theme as the Manga or OVA but, it's not the same storyline. I think the theme is pretty interessting - as the father and mother support the love of these 3, and it's all done in a funny way. Well for now I really like this show, and want to recommend it, but just if you like ecchi and harem Anime ;).\\n\\n\r\nOverall Rating: 8 for now.",
            "date": "2010-04-15T05:29:00+00:00",
            "helpful_count": 15,
            "mal_id": 25096,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302476.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AnimizeEU",
                "username": "AnimizeEU"
            },
            "url": "https://myanimelist.net/reviews.php?id=25096"
        },
        {
            "content": "Kiss x Sis is the second incest or sibling x sibling anime that I have watched, and safe to say it will be the last. The whole concept is just a bit too… I don’t even know. Incest. But hey some people like that I guess, I’m not here to judge anyone… just joking. \r\n Seeing as I have only watched two anime in this genre, I don’t have a whole lot to compare it with. I found that there was a more comedic side to this show, which I felt made it a little easier to view, in comparison to Yosuga no Sora whichis a bit more ‘psychological’. \\n\\n\r\nStory: Pretty simple, a brother and two sisters live together and are in love with each other. They constantly think up ways to seduce their brother, or help him whether it be with schooling or other life related problems. That’s basically all that happens. The end. \\n\\n\r\n Art: The artwork was great. I wasn't expecting a lot in this department, but it pleasantly surprised me, but by all means I’m not saying it was a masterpiece. Just the same as any other ROM-COM made past 2010. \\n\\n\r\nSound: Both the OP and ED fit in really well with the series. It’s not something I would listen to, however it did compliment the show. Sound effects and voice acting was probably one of the strongest elements I found, as it all sounded crisp and professional. \\n\\n\r\nI didn't love this show although i didn't hate it. However realistically speaking if the two girls weren't his ‘sisters’ and just happened to be living with him for some reason like… their parents passed away or I don’t know, something creative, it would have been a enjoyable show to watch. \\n\\n\r\n8 points for effort.\\n",
            "date": "2013-10-23T06:54:00+00:00",
            "helpful_count": 15,
            "mal_id": 117973,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1366113.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Dandey",
                "username": "Dandey"
            },
            "url": "https://myanimelist.net/reviews.php?id=117973"
        },
        {
            "content": "Have you ever wonder what it is like to live with twin sisters who are madly in love with you? In Kiss x Sis, Keita, an average middle school and soon to be high school student, experiences such that. His sisters, Ako and Riko constantly harass him in a weird way in order to show their affections for him. This continues throughout every episode thus becoming entertaining and unpredictable as to what Ako and Riko will do next to Keita.\r\nThe plot is straight forward; Ako and Riko help Kieta pass his entrance exam into high school. What you see on the outside is what youget. There isn't anything hidden underneath the story-line, but even so the anime is able to deliver many things along the way; from entertainment to its viewers to splendid characterization of its characters. In every episode, Ako and Riko would do something different to get affections from Keita, and each time the things they do are hilarious while other time they are more perverted thus making the contents border-line hentai. It might be great for fan service, but deals a lengthy blow to the anime in a sense that it provided a scene that did not benefit the story-line, but rather pro-long that specific episode. As I mentioned earlier, some scenes were did not enter the realm of border-line hentai thus it was a great source of comedy and made the anime enjoyable. On there other hand, characterization was good since the anime was able to individualize each character in their own specific group thus each character had their own specific feature, so if someone ask me to recall a character on their trait---doing it would be an easy task.\\n\\n\r\nIn terms of art, the anime is ranked average due to the fact that it can be found in most harem anime, but there were moments in the anime when the art shown improvement such as in the \"ecchi\" moments. The art for Ako and Riko is fascinating; the way they look is appealing and make them stand out from the rest of the other characters thus they added a kind of uniqueness to the anime. The opening song was fine, but th ending song is a different story. The ED song was very catchy and easy catches one attention and you can't help it but to listen it to the very end. Along with the ED animation, how can one resist?\\n\\n\r\nIn the end, Kiss x Sis is a pleasant anime and for people who enjoy ecchi moments and a good slice of life.",
            "date": "2012-10-22T16:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 75677,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/431801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lamii",
                "username": "Lamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=75677"
        },
        {
            "content": "The first story are Keita has two older step-sisters, Ako and Riko, but since they aren't related by blood, they love him in a lustful way. After a mishap at school, Ako and Riko finally confess their love to him. Keita dislikes the thought of seeing them other then brother and sister, but as he tries to enter the same school as his sisters, he slowly becomes attracted to them. Now normally that wouldn't be much of a problem, but this time both are madly in love with him. Throughout the anime, they both try to win his heart, often causing him to fail atwhat is trying to. As the story continues, he gets more and more interested in them, and that even results in a few spicy scenes. Well...what am I saying? I guess you could say this anime has quite a bit borderline hentai scenes. Now don't think because of that, this anime is bad, because it isn't. It's very lighthearted and enjoyable, just as anime like this should be!\\n\\n\r\nThat said, the animation is great, unlike most (borderline) hentai anime. The characters and background are animated well, and I'm quite fond of the colouring. I haven't found many scenes where characters are moving awkwardly, or anything alike. Sometimes though, especially when scenes get a little more sexual, you'll notice the occasional flaw, or at least the really hentai-like kissing. But seeing there's more than enough good animation to make op for that, i don't really mind at all. And I'm sure most people considering to watch this one wouldn't either.\\n\\n\\n\r\nBoth OP en ED are incredibly catchy. After a few episodes i found myself humming the ED while showering. I can't say I'm really proud of that, but you get my point. The voice acting is pretty good. The two girls are equipped with the required -and well preformed- \"little girl\" voices, and just hearing Ken Takeuchi voicing Keita is usually more then enough to feel his awkwardness. I saw the OVA before, but still wasn't expecting much of the voice acting, but i can say I'm positively surprised.\\n\\n\r\nThe characters aren't special, but certainly not bad. Keita is the typical \"harem-anime lead\", spending most of his time fantasizing about the girls, or doing things with them he normally fantasizes about. Ako is the mature sister, who cooks for the family, has good grades etc. Riko is a more of a childish and playful type. Although you'll sometimes ask yourself what their differences are, they are especially visable when seducing Keita.\\n\\n\r\nTo fill in some of the blank spots, there are some filler characters. I must say they are pretty well made. There's a group of guys who represent Keita's school friends. They constantly point out Keita's luck to have two hot sisters to love him, often causing Keita to fantasize about his sisters himself. There is also a loli who seems to have a crush on him. And we have Ako's teacher, who's also aforementioned loli's sister, an Otaku who tries to make Keita, Ako and Riko see their incestuous tendencies, are wrong. Their parents also have a small role. They're very stereotypical parents, except for the fact that dad encourages their love, and especially Keita's manliness. Last but not least we have Miharu Mikuni, a shy, glasses wearing, big-titted girl, who does the best job providing us with some interesting comedy.\\n\\n\r\nOverall I think this is a more than decent anime. The main reason to watch this would be the hot brother-sister action you might be into, but i mostly decided to finish it because it just is a very entertaining anime.\\n\\n\r\nif\\n\r\ninteresting sexual scenes, this might be the anime you're looking for.",
            "date": "2012-08-31T18:41:00+00:00",
            "helpful_count": 14,
            "mal_id": 71297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1220839.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_aikawa",
                "username": "_aikawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=71297"
        },
        {
            "content": "Kiss x Sis is a risqué story about love, lust and, comedy. It’s an Ecchi with a very basic plot that uses absurd shenanigans often times sexual in nature as the comedic device of the show. Usually leaving the viewer thinking “wtf am I watching”. At the beginning of every episode I would wonder what kind of silly antics Ako and Riko would employ on their brother this time. \r\nAko and Riko have an immense amount of love for their younger brother, even to the point where they will not consider dating any other boys and will turn down all other admirers. They express theirlove through lustful acts towards their brother Keita, quite possibly in the best way they could express their love. The show really takes you back to traditional family values and the importance of loving the ones you are with. Peoples criticism of the whole “Incest” thing is generally exaggerated, I mean come on their not even blood related! Incest is Wincest after all. \\n\\n\r\nThis anime is all about self-control and how one should not always give into lust and temptation as demonstrated by Keita’s character throughout the series. I viewed it as a case study of what to do in such circumstances. Unfortunately I myself would not have been able to resist such temptations in many of the situations Keita finds himself in. But on occasion he will give in if only for an instance, this shows that even Keita is only human and can be overtaken by feelings of lust and temptation.   \\n\\n\r\nIf you are going to watch this I would strongly recommend you watch it with your sisters, if you don’t have any just watch it with your mom.",
            "date": "2014-10-30T13:54:00+00:00",
            "helpful_count": 12,
            "mal_id": 166821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994491.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnuCheekiBreeki",
                "username": "AnuCheekiBreeki"
            },
            "url": "https://myanimelist.net/reviews.php?id=166821"
        },
        {
            "content": "Okay, a little backstory. About a year and a half ago a friend told me about this and he said it was pretty messed. I didn't think it would be that bad... but I was wrong. This anime is crap. The main problem is that it made me say: 'What the hell?!' every couple of minutes. The two sisters trying to bang their younger step brother and often molesting him just creeped me out, but I couldn't stop! I'd finish an episode and say, 'That's it, I'm done.' But I couldn't stop watching it! I needed to see what was going to happen!\r\nNow that rantis out of the way, lets get to the nitty gritty bits. The art of the show is pretty average and the story is pretty poor. Every episode is basically the sisters trying to find a way to seduce their brother and then molest him. I disliked most of the characters especially Keita, who had very little character and was basically there to be an object of his sisters' desires. The sisters themselves are alright characters but they still made me uncomfortable sometimes.\\n\\n\r\nI didn't completely hate the series though: I found some enjoyment in some of the episodes (one bit involving a chocolate banana). The only character who I really enjoyed was the teacher of the two sisters who is an otaku obsessed with samurai who tries to stop the sisters from trying to sleep with Keita. She had good moments and one of the few characters who I cared for. The opening and ending songs are also one of my highlights, incredibly catchy and fun numbers.\\n\\n\r\nOverall, pretty bad show with mostly bad characters but some funny moments, one character and good opening and ending songs stand out",
            "date": "2015-02-10T13:54:00+00:00",
            "helpful_count": 11,
            "mal_id": 180097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4344553.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/H3nry_D_96",
                "username": "H3nry_D_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=180097"
        },
        {
            "content": "Ok so i was browsing the animelist on Animefreak.tv today and i watched a short 12 episode anime called Kiss x Sis. Now Kiss x Sis is an anime that borderlines with hentai expending on whether or not you're watching it uncensored or censored. Although there was a bit more fanservice than i would have liked, i enjoyed the anime nonetheless for a few reasons which i'll get back to later. But for now, let me break down my scores and give explanations \r\nStory-7: The story was pretty basic for the most part. -i'm not gonna spoil the story for you since i'm assuming you'rereading this review to decide if you wanna watch it- But for a short 12 episode anime series, i like the predictatble kinda generic or basic story because it'll be a short watch and it draws my attention for time. Whoever wrote the story for Kiss x Sis did a decent job in my opinion, but i would have liked to see a bit more of the cool things the main character did for his sisters before the story starts. but that's just me. \\n\\n\r\nArt-8: The artwork was well done in my bias. i watched Kiss x Sis in decent quality so the artwork shined. While some of the characters look badly drawn-otaku's dream boy(character reference)- others look well done, which i don't really mind as long as it's not stick figures lol. \\n\\n\r\nSound-8: The sound definitely hits home with what the anime is trying to do. the cutesy innocent kinda pop songs that make you scratch your head and wanna pretend like you saw nothing. the voice acting was well done as well. no freaky english in this anime, it sounds well done. \\n\\n\r\nCharacters-9: Whoever's mind created this cast of characters is good. He/She took some steorotypes and mixed them with other steorotypes which makes them seem fresh, which is a good idea in my personal bias. The teacher's character is definately my favorite-you'll see why if you watch it- she's insane... end of disscussion \\n\\n\r\nEnjoyment-8: Although the entire anime is BRIMMING with fan service, i enjoyed the few tibits of comedy. even though some of the comedic scenes had some form of a sex joke in them. I can't say that i was disguested, but i  enjoyed the anime. \\n\\n\r\nOverall-7: This anime is definately out of my comfort zone-action comedy and some lovin- but i can't say that i regretted wasting around 3-5 hours watching it. It was a good anime but i must say, much of the stuff borderlined with hentai depending if you watching the censored version or not. because there are some scenes that will make you go, that's just nasty. But if you don't mind the hentai-ish scenes and are looking for some comedic love triangle anime, i'd say watch the first few episodes and go from there. take a chance and who knows you might just stay to watch it.",
            "date": "2010-08-26T00:04:00+00:00",
            "helpful_count": 10,
            "mal_id": 29967,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/193146.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TSX",
                "username": "TSX"
            },
            "url": "https://myanimelist.net/reviews.php?id=29967"
        },
        {
            "content": "Have you ever watched something so ridiculous you couldn’t have enough of it? That’s what this is. Kiss x Sis is so ridiculous, you just can’t stop watching it. This anime is like a box of assorted candy, you don’t know what you’re going to expect. The genre’s for this anime are harem, ecchi, romance, school, and comedy.\r\nStory: (6/10)\r\nThe story’s setting is like any other school based anime you watch. You see the typical track field, the school classroom, and the typical festival. The story itself, however, is something you don’t usually see in an anime. The main character, Keita, has to choose between oneof his two sisters, Ako and Riko, who aren’t related to him by blood, to marry as he tries to enter the same school as them. Unfortunately, you don’t get to see who he marries in the end, which I was disappointed by, but you do see the female characters try to get the upper advantage over each other to win Keita’s affection which I found to be quite interesting. As you may have expected, Kiss x Sis is sexual in a lot of ways. From using objects as a way to show affection to almost having sex with your sister, if I can say one thing about this, it’s borderline from becoming a hentai. Well of course you couldn’t have an ecchi and harem anime without its clichés. You’ll see many clichés throughout this anime such as nose bleeds, boob grabbing, and panty shots. You’d expect these clichés to be dumb, but for some odd reason Kiss x Sis does it in a funny way in which you will forgive it. \\n\\n\r\nArt: (8/10)\\n\\n\r\nThe animation for this anime was produced by a company called Feel. If you haven’t heard or don’t know the animation company, Feel, they’re the ones who produced Mayo Chiki!, Yosuga no Sora, Outbreak Company, and My Teen Romantic Comedy SNAFU TOO. The art style and environment to this anime looks typical. I’m not saying that’s bad, but nothing really stood out to me. \\n\\n\r\nSound: (8/10)\\n\\n\r\nThe opening and ending theme songs sound J-popish, which I don’t really mind, but I didn’t find them to be memorable at all. The same goes for the background music, but it seemed to match each scene, which is fine in my book. The voice actors and actress did a fine job too, I couldn’t really complain.\\n\\n\r\nCharacters: (7/10)\\n\\n\r\nWhat’s an anime without its characters? The characters itself are pretty generic, but have a clear distinction between them. There are some clichéd side characters such as the loli and big breasted female character. For the rest, there’s actually some uniqueness to them. For example, one of the characters is bad at cooking, while the other is not. Using the character’s uniqueness, the writers use the character’s characteristics to make each character seem like the best fit for the main character to date. All the characters certainly elevate our main character by giving his harem role. \\n\\n\r\nEnjoyment: (8/10)\\n\\n\r\nThe reason why I gave this an 8 out of 10 is because I felt awkward and uncomfortable at times. There’s this one character, in the show, who is your essential loli. One of the many things I did not like about her is that she’s flashes her panties at Keita, which feels really weird and awkward considering she is in middle school, but hey, I give props to the creator for writing something that we usually don’t see. The thing I like about Kiss x Sis is that it tops the last perverted thing they did. If you’re going to make a harem and ecchi based anime, at least make it outrageous enough for you to like it and kiss x sis exactly does that.\\n\\n\r\nOverall: (7/10)\\n\\n\r\nOverall, I enjoyed this anime, but I felt empty after watching this. It felt like something was missing. I enjoyed the show, but I didn’t feel hooked with the overall storyline. After I finished, I asked myself, “Was that it? Is there any more?” I wasn’t satisfied with the story and I certainly wasn’t satisfied with the ecchi. It felt like it needed more. Kiss x Sis will certainly entertain you with outrageous sexual acts, but it lacks meaningful story that I can’t really connect.\\n",
            "date": "2015-08-06T22:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 195398,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4550811.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OtakuJKP",
                "username": "OtakuJKP"
            },
            "url": "https://myanimelist.net/reviews.php?id=195398"
        },
        {
            "content": "KissXSis is perhaps one of the most interesting series I have seen. It is basically a series that tries really hard to be softcore porn, and it works. While there are some ecchi series out there that actually do have strong plots to them, KissXSis is an entirely different case. Its approach to fanservice is not just through having big breasts and panty shots. It does so simply by making the scenarios fun to watch.\r\nIt is hard to really explain what is so enjoyable about KissXSis other than that the weird moments feel very genuine. While the absurdity of the series and its perverted natureis often funny, it is more to the romantic and sexual nature of the series that drives it. KissXSis is a series that is downright orgasmic in tone, which is quite a difficult feat to pull off when your series is about brother sister incest.\\n\\n\r\nWhat really works about this series is that the relationship between our characters feels real, which I can imagine is a difficult thing to accomplish with such a controversial premise. This is also the case because the characters are more realistic than most would believe. The series may have brother sister incest as a plot device, but Keita and his sisters, Ako and Riko, are not blood related. On a subconscious level, there is a psychological effect that prevents people from having a sexual attraction to those they were raised with closely; this is what makes most people find the idea of incest to be disgusting. \\n\\n\r\nHowever, in KisXSis, Keita and his brothers were not with each other from birth, yet were unnaturally close during childhood. Also the character's approach to this is interesting as well. Keita is the only person involved that has any qualms with the idea of a relationship with his sisters. Both Ako and Riko make their lust for him clear and their parents actually encourage it. Keita himself, is usually in a state of denial and does not want to believe in the idea, but he has a very hard time ignoring his true feelings. \\n\\n\r\nMost aspects of the series that occur are ones that are more so unlikely than unrealistic, and most of the unlikely aspects occur for comedic effect. The unlikely aspects of this show end up working to the show's advantage because comedy is largely based on subversion of expectations. There are several moments in the series that work so much better comedy wise by having most female characters as mischievous perverts rather than the obnoxious prudes that have infested anime ever since Love Hina. \\n\\n\r\nMusic wise, the series is pretty good. The ending theme in particular is really catchy and a lot of the music during emotional moments fit very well. The art on the other hand is pretty low quality and has a lot of skips in animation and reused clips.\\n\\n\r\nOverall, KissXSis was a very fun series to watch. I am tempted to say that it is a guilty pleasure, but I personally dislike that term due to it implying you have to feel guilty about what you like. While I suppose it can be argued that the series relies a bit too much on sexualization, I can at least confirm that it does that correctly.Overall, the only thing that I can really say is wrong with this series is that it doesn't try to be anything amazing. However, KissXSis does succeed at creating a fun story with likable characters and funny moments as well as being very arousing. Obviously it goes to say that if you do not like incest or fanservice then you would not like this anime about incest and fanservice, but if that is the case then why would you be reading this in the first place? If you are a fan of ecchi series and don't mind incest,, then this is a series you will enjoy.",
            "date": "2014-11-04T11:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 167409,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4215587.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iyamtebist",
                "username": "iyamtebist"
            },
            "url": "https://myanimelist.net/reviews.php?id=167409"
        },
        {
            "content": "Ecchi fans comes,\r\necchi fans watches,\r\necchi fans need this,\r\ntell it to me p...s.\r\nYeah, this is one fcked up anime, I mean, WTF is the point of it. I would give an gold medal to the animator (whole team) for the best ecchi anime and I would kill him (them) too because of how much this is messed up (from the incest side I mean). \r\nSo, from the synopsis you could have read there is incest, wincest for somebody. Althrough this anime is from 2010, I ve never saw it anywhere.\r\nWe are taken to the story of Keita, he have two step sister (they obviosly love him),mom and dad that should get gold medal too, for being the best perverted and funniest dad in Japan (seriosly he is tooo funny, atleast every scene with him made me laught...). This anime is pretty funny actually. The names of that two, not so innocent, step sisters: Riko, Ako. I must admit, they are cute... I meant KAWAII. As said they want Keitas D, he dont want them (from start), they still want him. Upon some time when he have to choose on which high school he wants, he chooses same high school where his two sisters are. They will help him with preparation for the entrance examination. In that time he will start get a little more exited about the love from the side of his step sisters. From that point almost every male viewer (I dont say every) will start getting that little boner from some scenes(still its only ecchi). You will be dragged to some \"Pre-main\" story scenes. What i want to say is, its not centered only around Keita. Also there will be more girls he will play with ͡° ͜ʖ ͡ -. How will it end? Try to guess. If you cant guess, go watch it. If you are female, dont watch it, because you will find some mans wishes there... \\n\\n\\n\\n",
            "date": "2016-09-29T13:12:00+00:00",
            "helpful_count": 5,
            "mal_id": 230551,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5713235.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ivaaan",
                "username": "Ivaaan"
            },
            "url": "https://myanimelist.net/reviews.php?id=230551"
        },
        {
            "content": "There are certain issues that it can be rather tricky to handle in fiction of any kind.  Drug addiction, suicide, sexual abuse, etc.  One of these topics is incest - and while some shows have it to act as a commentary of sorts, for every show that does this (the only example that comes to my head is Koi Kaze), there's a show that has incest for the sake of incest.  Like KissxSis.\r\nStory - 3/10\r\nThe story to KissXSis is a rather generic harem/romcom story, with the only thing that's really unique about it being the incest.  The plot of each episodecenters around Riko and Ako attempting to seduce their brother - and given the main \"appeal\" of this anime, you can probably guess what happens at the end.  The story tries to excuse the incest by saying that Keita (our male lead) and his sisters, Riko and Ako, aren't related by blood - they're related by marriage.  And I don't buy that excuse, because quite frankly, they're still related - it's still incest.  You can get a flu vaccine via that mist technique instead of having a shot, but that still doesn't change the fact that you got a vaccine.  At least the show has Keita's sisters be slightly older than he is.\\n\\n\r\nHalf of the events are ones that would work in a generic harem/romcom, but there are also events that are absolutely disgusting.  For example: in one episode, Riko and Ako both make a good luck charm for their brother.  While this sounds innocent enough, they do so by putting one of their pubes in the charm.\\n\\n\r\nArt - 6/10\\n\r\nI'm not a fan of the style they used here, but it wasn't unpleasant to look at - it's passable.  Nothing I'd write home about, but nothing I would condemn, either.\\n\\n\r\nSound - 4/10\\n\r\nThe sound isn't bad per say, it's just pretty forgettable - the opening is generic J-Pop, and the ending is also pretty generic.  The voice acting is...okay, I guess, but it's not something I'd say really stands out about this show.\\n\\n\r\nCharacter - 3/10\\n\r\nRiko and Ako are generic older sisters, who only interested in screwing their brother - they don't even talk about normal conversation topics (I do not remember a single moment where they talked about something like the weather or how they were doing at school).  Keita seems like he's resisting their efforts at first, but he then goes to reluctant to have them fall for him, to not having a problem with their advances by the end.\\n\\n\r\nThere was literally only 1 character who objected to Riko and Ako's efforts to seduce their brother - their teacher, Yuuzuki Kiryuu (and it's for that reason why I actually found her to be the one character I liked about the show), who happens to be a closet Otaku (I know that Otaku generally refers to males, but I forget the female counterpart), and she's really into cosplay (this is actually important during several scenes).  Everyone else doesn't have a problem with it - in fact, the parents of the 3 main characters actually encourage Riko and Ako.  It would have been one thing if they did this once as a joke, and then scolded the twin sisters the rest of the time.  But no, the story chooses not to redeem itself.\\n\\n\r\nEnjoyment - 1/10\\n\r\nI actually enjoy watching harems every now and then (it's not a perfect genre, but there are shows in the genre that I genuinely enjoy), but this was the first one that I watched (that I didn't have mental scars as a result of watching) where I did not have at least some enjoyment from watching it.\\n\\n\r\nOverall - 2/10\\n\r\nI'd just skip this one.  It's not really worth your time, and there are tons of better series out there that would take you the same amount of time to watch as it would take you to watch this one.\\n\\n\r\nAlternative recommendations: Koi Kaze, Heaven's Lost Property",
            "date": "2015-05-28T19:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 189056,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4362301.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RoarkTenjouin",
                "username": "RoarkTenjouin"
            },
            "url": "https://myanimelist.net/reviews.php?id=189056"
        },
        {
            "content": "this is one of those anime that is so pathetically bad that it makes you interested because it is so fucking weird, the story of a guy whose twin sisters are obsessively in love with their brother (sexually!) and that's that!\r\nyou know when they say we are friends with benefits? well this is family with benefits\r\nit's the funniest anime I've watched, no one makes any sense, when his father finds out he is involved with his sisters he encourages him! yes that's right! his father and mother wants him to bang his sister! so much so he get annoyed!\r\nin one of the most bizarre sceneever, one of the students pee on the main character accidentally twice!\\n\\n\r\nanother funny thing is his teacher finds out and try to stop them but guess what? she gets schooled and is forced to apologize!\\n\\n\r\nyeah you are dealing with this type of an anime, watch it at your own risk",
            "date": "2018-11-27T14:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 294829,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7529349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/YohanViLiebert",
                "username": "YohanViLiebert"
            },
            "url": "https://myanimelist.net/reviews.php?id=294829"
        }
    ],
    [
        {
            "content": "Where do I even begin? Oh, I know. Let me start by saying that Kiss x Sis was the first anime I'd ever watched.\r\n5 years later, and 200+ anime series watched, I decided to revisit the anime that started it all for me. And it was every bit as terrible and entertaining as I remember it being. In short, I'd describe Kiss x Sis as a masterclass in absolutely disgusting ecchi. If you're a nasty, sexually frustrated individual who dreams of incestuous encounters with your imaginary (or real, God help us) sister(s), then you might thoroughly enjoy the 288 minutes of pure degeneracy that thisseries offers.\\n\\n\r\nAnd when I mean \"incestuous encounters\", you're not getting the odd titty-grab, or the occasional slip-on-the-floor-turned-missionary ecchi tactics. You won't just be getting the innuendo. No, Kiss x Sis treats ecchi like a contact sport. As in, a lot of touching, a lot of the time.\\n\\n\r\nThere are two ways this anime can possibly be enjoyed: either as a so-bad-it's-good anime, or as...softcore porn.\\n\\n\r\nStory:\\n\\n\r\nThe structure of the anime is pretty skeletal; each episode is self contained, with little actually carrying over episode-to-episode. There is no overarching story, and very little story/character development (as it should be). Kiss x Sis doesn't pretend to be anything more than it should be. Every episode is essentially a buildup to the main sexual encounter between one of the female \"\"\"leads\"\"\" (be it the sisters or some other thot) and our protagonist. The some of the actual ecchi scenes are stunningly creative, with a buildup that, dare I say, is logical? Which brings me to main point for this section: some of the ecchi scenes are unoriginal, and pretty common to the genre, but the ecchi scenes that take up multiple MINUTES of screen time are not only creative, but pretty damn good.\\n\\n\r\nCharacters:\\n\\n\r\nThere are three characters that really matter in the Kiss x Sis universe, and its Keita and his two beloved (step) twin sisters Ako and Riko. All three are way too physically developed for their age.\\n\\n\r\nAko and Riko are pretty much archetypes of the same anime girls writers love to have in their self-insert fantasies. Ako is your studious, responsible, protective housewife sister. Riko is your tomboy, clever-but-charming sister. Both want to please Keita in any capacity.\\n\\n\r\nKeita is more noteworthy. Growing up in an household environment where feeling up your sisters is not only acceptable but encouraged, he's spoiled, innocent (in a weird and off-putting way), and quite the hands-on learner.\\n\\n\r\nSound:\\n\\n\r\nThe opening and ending are both lathered in infectious melodies. For better or for worse, you'll have Kiss x Sis on your mind in one capacity or the other through the soundtrack. As for the the soundtracks throughout the episodes, they're nothing to write home about. The...other \"noises\" and \"effects\" that Kiss x Sis brings to the table are actually pretty good.\\n\\n\r\nAnimation:\\n\\n\r\nArt style and animation are dead average. Not too good, but not terrible or weird looking by any stretch. Since the animation studio poured most of their budget into the longer ecchi sequences, all other scenes feel like an afterthought. But, that doesn't really detract from the anime, since all the scenes you'll probably care about is Keita getting adventurous with one of his sisters.\\n\\n\r\nEnjoyment:\\n\\n\r\nThis is a difficult section to write. By now you're probably in one of three camps: \"This guy REALLY enjoyed Kiss Sis\", \"this guy REALLY hates Kiss Sis\", or \"Just decide man, do you like this anime or not?\" When I ask myself whether I truly liked Kiss x Sis, my nasty perverted side says \"this anime was 10/10\". But my normie, rational side says \"this was a funny anime, but it's really disgusting and screwed up when you think about about it\".\\n\\n\r\nSo, let me be as clear as possible: I hate the fact that I, overall, intensely enjoyed Kiss x Sis.\\n\\n\r\nTL;DR 10/10,  probably gonna watch again when I'm bored. Oh, and I should mention that this beautiful piece of media was aired on television.\\n",
            "date": "2018-09-09T17:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 288627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7307744.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/fuck_bryan",
                "username": "fuck_bryan"
            },
            "url": "https://myanimelist.net/reviews.php?id=288627"
        },
        {
            "content": "What Kiss x Sis tries to be is a love/romcom story; what it really is: just another harem show with softcore sexless hentai, and \"incest\". I don't actually buy step-sibling romance as being incest, it's just people being oversensitive and overjudgmental with terms they don't even try to understand; the practice of incest is prohibited in most countries in real life for the risk of malformed children born of inbreeding, while two step-siblings don't share DNA, and thus can conceive a healthy child. It's just some borders put by society out of its need to expand their prejudice. Of course a review on Kiss xSis must also contain an opinion on incest, but moving on... While I'm fine with step-siblings romance, this show has found the worst way of portraying it.\\n\\n\r\nThis story revolves around Keita Suminoe, whose goal is to enter the same high school as his step-sisters, Ako and Riko, and of course, live a normal life. However, Ako and Riko are in love with him, in quite a yandere fashion, going as far as to becoming infamous in Keita's middle school, for constantly coming to confess their feelings. Over and over. To make the harem picture complete are: Miharu Mikuni, a... meek girl introduced only for fanservice (in lack of better terms); Yuzuki Kiryu, Ako and Riko's young homeroom teacher, who is desperately trying to keep the step-siblings from getting together due to her belief that they are blood siblings, but later founds herself smitten with him; and Mikazuki Kiryu, Yuzuki's younger sister and Keita's underclassmen, cause there has to be a loli character for an anime harem.\\n\\n\r\nBasically, everything about this anime is Ako and Riko trying to get in Keita's pants a little harder than the other girls. This, to the point flashing their lingerie or even bare breasts in front of their younger stepbrother comes as the most natural thing to do, and would sometimes try to engage in sexual intercourse too. This can't even be labeled as a comedy, despite all the embarrassing situations in which our characters find ourselves into, for they are mostly sexual. And frankly, at one point, the sister's desperate attempts at their brother become annoying in time.\\n\\n\r\nIf I was reviewing a hentai, I would have given it 10. But, as an anime, Kiss x Sis provided me little to no enjoyment, so I'm giving it a 2.",
            "date": "2018-09-09T08:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 288585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7103788.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/EvilMayDie64",
                "username": "EvilMayDie64"
            },
            "url": "https://myanimelist.net/reviews.php?id=288585"
        },
        {
            "content": "If your looking for a funny ecchi anime, this one is definitely nice to watch. It has nice story though i think it is kind of unorganized. The art is good and makes it all the more better for you to watch. And the characters are funny and very ecchi.\r\nDefinitely, fun to watch, and to say the truth i think i am overrating this anime, buy i am rating it on how much i enjoyed it and depending on if it gave me what it said it would give me(genres).",
            "date": "2012-10-29T19:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 76233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/asdcvvbbd1",
                "username": "asdcvvbbd1"
            },
            "url": "https://myanimelist.net/reviews.php?id=76233"
        },
        {
            "content": "Japan sure doesn't get bored of incest stories, especially if they're about biologically unrelated siblings. Kiss x Sis is one such story, where the male protagonist gets literally abused by his older sisters on a daily basis... but as time goes on he starts to enjoy his \"abuse\" and even takes charge in numerous pseudo-sexual encounters later on in the series. \r\nThis series has everything you can imagine apart from full blown sex. Guy licking chocolate off a girls lips? Check. Mutual masturbation? Check. Frottage? Check. Voyeurism? Check. And there's plenty of more stuff too! Ever seen an anime where 5 year olds French-kiss eachother? No? Well Kiss x Sis will definitvely suprise you then. This anime aims to turn the viewer on in every way imaginable.\\n\\n\r\nTreating this anime seriously would be pointless. The plot is... nearly non-existent here. Also, saying that this is a romcom would be a complete misstatement. This anime is a softcore hentai series in disguise. I will not lie to you now, the kissing scenes between the 3 main characters, Keita, Ako and Riko nearly gave me a stroke. Is that something a romcom anime is suppose to do? No sir. Because this is not a romcom, rather it's a collection of subtle (and not so subtle) sexual scenes with a banal plot wrapped around them. \\n\\n\r\nThe three main characters are shallow beyond belief. Some background information is given on them but their main and ONLY purpose is to either rub each other's sexual parts or to French kiss for periods exceeding 5-10 minutes. Keita for example is a guy whose father married a woman who happened to have two daughters (twins), those daughters fell in love with him and guess what? His father is perfectly fine with it. So is his step-mother. How convenient.\\n\\n\r\nThe rest of the cast is not worth mentioning at all. They're more shallow than an empty bathtub. They're only there to hide the fact that this is a straight up softcore hentai under the guise of a romcom. Some of them are not even properly introduced into the series, i.e we don't know what their names are. Feels a bit like porn? it does.\\n\\n\r\nSo what should you be looking forward to in this anime? And why the hell did I give it a rating of 7 (good)? Simple. Art is fantastic. Those kissing scenes really are quite something. Better yet the frottage scenes... oh gawd. No but seriously, art is really good. So is the voice acting. \\n\\n\r\nIf I was to rate this series solely on its story then it would be a 4 straight away. But I wasn't actually looking for a story when I picked this anime up. I knew exacly what I was getting myself into. Basically I'm rating this series as if it was a normal hentai and for a pseudo-hentai it does quite well.\\n\\n\r\nLooking for something that gets as close to sex as possible, without actually getting to it? Watch this series.\\n\\n",
            "date": "2012-08-18T12:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 70167,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=70167"
        },
        {
            "content": "Welcome to the beautiful world of marginal incest and threesomes. Kiss x Sis is about Suminoe Keita, a teenage student that is constantly under erotic attacks from his sisters (keep in mind they are not blood related). Despite being considered echii, there are many moments as the story progresses that make the anime walk the border between hentai and echii. \r\nRight from the start, Keita wakes up in his bed with his sisters sleeping in the same bed. After they wake up, they proceed to kiss him. French kiss him. Yeah, it escalates pretty quickly. \r\nThe main storyline is about Keita's relationship with his sistersand their attempts to seduce him. Nothing too big or complicated, it's simply a collection of everyday events that will make you laugh or raise your fanservice meters to the max.\\n\\n\r\nFor an anime that came out 4 years ago, the visuals where surprisingly beautiful. The character models are detailed and well-drawn, while the animation is fluent without tiring the viewers. The ecchi scenes where really nice with a good amount of detail and depth. Of course, no nudity is allowed even though Kiss x Sis flirts with it in many episodes.\\n\\n\r\nWhen it comes to sound, you got some mediocre themes with an easily skippable opening. The background music is hardly noticeable and you won't bother to search about the soundtrack and listen to it easily. However, there are some really natural moans and sighs in the ecchi scenes, which add realism. It's worth mentioning that Riko will come up with hilarious comments and jokes while she will still keep her serious nature.\\n\\n\r\nNot much depth in characters and I wasn't satisfied with Keita's indecive nature. One moment he blushes and tries to explain to his sisters why it's bad to sexually harass him and the next he's a full pervert making the assaults himself. And that happens even after he fully understands what he feels about his sisters. Reiko and Ako complete one another. While Reiko is somewhat antisocial, serious and always speaks in a calm way, Ako is loud, talkative and has a more comical nature. Not a bad duo.\\n\\n\r\nAs you progress, you will be bombarded with echii attacks. The fanservice will keep on rising, reaching some really perverted climaxes. But you will have to see what I mean for yourselves.\\n\\n\r\nOverall, it's a good echii anime with nice comical elements. If you are a fan of the genre, it's definitely worth watching it. Just make sure to keep a box of tissues next to you, just in case. \\n\\n\r\nStory: 7\\n\r\nArt: 8\\n\r\nSound: 8\\n\r\nCharacter: 8\\n\r\nEnjoyment: 8\\n\r\nOverall: 8",
            "date": "2014-01-27T14:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 130481,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3167841.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheSpicyDonut",
                "username": "TheSpicyDonut"
            },
            "url": "https://myanimelist.net/reviews.php?id=130481"
        },
        {
            "content": "Kiss x Sis is the best ecchi I have seen thus far. It will arouse you. The plot will also suck you in. You find yourself really rooting for the male lead's success. The plot has solid advancement, and while the end leaves you wanting more, that is what the OVAs are for.\r\nI didn't like the rather annoying censorship and the occasional focus on... urine. If urination is a total turn off for you, than this is not for you.\r\nMake sure you watch the OVAs as well. It is better to watch the TV series first, but I would say best to watch them OVAand TV series in the order they were released/aired.",
            "date": "2013-07-09T00:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 104501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2831569.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hraktuus",
                "username": "Hraktuus"
            },
            "url": "https://myanimelist.net/reviews.php?id=104501"
        },
        {
            "content": "Lets start with telling you guys that this certainly is an anime with much 'mild nudity', So if you really are into those kind of anime's you should watch this one because it also has an pretty good story in my opinion. Both the girls are really some interesting cute girls that make changes every time, which keeps you entertaining. They both support their brother in such a good way and get mad at each other which really does help make it an better story. This anime has pretty fun characters and can really enjoy you after every episode. From the jealous friends to thestalking teacher to the perverted sisters i can tell you its an fun anime to watch. You should certainly watch it if you like ecchi with a good story :)",
            "date": "2015-07-15T13:33:00+00:00",
            "helpful_count": 5,
            "mal_id": 193485,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4455208.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Layme",
                "username": "Layme"
            },
            "url": "https://myanimelist.net/reviews.php?id=193485"
        },
        {
            "content": "I heared a lot of this anime and I was kinda intrested how a really ecchi is (never seen a ecchi anime before) I watched this anime with the feeling \"Shame You!!\" but after the first episode I was like \"It isn't so bad, I kinda like it\". I finnished this anime within a day and came to the conclusion \"Never think a dirty ecchi or even henti is bad just beceause they are naked\" It is really good, but you just have to experions it yourself.\r\nStory 8/10: \r\nWell for my first dirty ecchi I don't really have experions, but even though it was incestit was good maked and gives you a good few about all 3 the teenagers.\\n\\n\r\nArt 8/10:\\n\r\nIt was nice done. Some parts like the kissing and the rubbing was very detailed, that maked me in the start more ashamed of myself but you get used to it and see how nice it works out.\\n\\n\r\nSound 9/10:\\n\r\nNot too much sounds around the whole thing. I expected much more dramatic sounds around the ecchi parts but it was fine done.\\n\\n\r\nCharacters 8/10:\\n\r\nI liked all 3 the maincharacters. The boy is so cute and innocent and then the twins so hillarious and dirty.\\n\\n\r\nEnjoyment 9/10:\\n\r\nFor my first ecchi I really enjoy it and after this im really planning to watch more anime like this one.\\n",
            "date": "2013-05-27T11:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 98621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Delllllleted",
                "username": "Delllllleted"
            },
            "url": "https://myanimelist.net/reviews.php?id=98621"
        },
        {
            "content": "Yahoo :D :\r\nUnfortunately, no Season 2 has been announced or released. However, due to a recent demand for DVDs and internet downloads of Kiss X Sis, I wouldn't be surprised if an announcement is on it's way\r\nIt would be awesome to see a second season out of this one. I mean the good ones you wants more to watch of right? ;)\r\nThis one is basically about a guy that get's to be in a every guys dream. To actually have fun with two girls and still be young... The problem is that it's he's sisters but after a while he's parent's tells him that theyaren't 100% related. So the girls fights over him.\\n\\n\r\nReally good anime overall and i will be looking out for a new season :D",
            "date": "2013-03-08T03:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 89045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2265829.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Simon1900",
                "username": "Simon1900"
            },
            "url": "https://myanimelist.net/reviews.php?id=89045"
        },
        {
            "content": "Kiss X Sis was an unusual cute, borderline hentai, ecchi anime with plenty of other things to enjoy about the series ;). \r\nThe Story: The overall plot and story were well made. A common plot line of typical stress related events leading to an eventual outcome of success or failure with the typical suspense added plot twist. It was done well in this aspect of combining suggestive incest and schoolwork. \r\nArt and Sound: Can't really complain about art and sound in any anime because all are usually well done, the ones I've watched so far. The sound/music choices could have been improved on but theyworked nonetheless.\\n\\n\r\nCharacters: The characters in Kiss X Sis (Tv) were unique, some in their own aspect as they were introduced individually or in pairs. Background reveals as the story went on also were okay and comedy was definitely a great add on to many scenes. \\n\\n\r\nEnjoyment: There were many moments when i laughed or chuckled because of the comedy woven in with the ecchi and or school life. The typical characters may have caused some stray off the path because of the amount of other \"look a-likes\" in other anime you can find. \\n\\n\r\nOverall I enjoyed this series and it was a great time killer. Keep in mind that this is my own opinion and whether you choose to think I'm an idiot or not is up to you. I would recommend this series maybe for people just starting to watch anime for introduction to a typical harem/ecchi/school anime or someone just looking for some laughs. This anime does have many superiors in some aspects but holds its own unique place.",
            "date": "2013-06-12T16:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 100849,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2608033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nebarto",
                "username": "Nebarto"
            },
            "url": "https://myanimelist.net/reviews.php?id=100849"
        },
        {
            "content": "The story? Well, It's lazy. 2 chicks like their brother, but hey, they're not blood-related so that instantly makes it okay, right...? If you just want fan service, this is your show. The best way to describe it is a show that has the Harem of Hagani, the sex of B gata h kei and the incest of Oriemo. This is the specimen you get. It's pure trash. Seriously. But, I still watched it, and it definitely is watchable... and I might even go so far as to say enjoyable. \r\nThere is pretty much no plot. The character development is almost non-existent and never reallydoes much to advance the plot. If you're looking for some sort of a plot, at all, this isn't for you. The art is average at best, with some bits being pretty awful. Be warned, there is a lot of NSFW stuff throughout. But, some of it is pretty fucking hilarious. Sometimes because it's good, but most of the time just out of how cringy it is. I really liked certain bits. If you're into the weird oriemo bullshit that is utter trash, you'll probably like this show. \\n\\n\r\nSo yeah, it's basically a hentai. But like, funny. I don't know how this would ever be shown on TV, so keep that in mind.",
            "date": "2018-03-20T12:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 274380,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6865314.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/FartPolice",
                "username": "FartPolice"
            },
            "url": "https://myanimelist.net/reviews.php?id=274380"
        },
        {
            "content": "So, the one thing that kept me watching was the fact that Keita was NOT blood related to Ako and Riko. In fact, the twins themselves did an AWESOME job of reminding other people of that as well. So, for those who wanna give this a shot:\r\n1. The best place and time to watch this is always alone.\r\n2. Don't brace yourself for a masterpiece.\r\n3. JUST LET IT HAPPEN.\r\nBut seriously, once you get to know the above, you feel a lot more comfortable watching it. The three are the main part you want to focus on. There were a little too many hyper sexual themes withsome of the supporting cast (like the high school teacher--HOLY CRAP). I think the most clever character was Riko. She got most of the best lines. She had that cute innocent look accompanied by that dirty little mind, which made her funnier. Besides, most of her funny crap got her in trouble with Ako, and that was just the way she was. I don't think she was necessarily trying to tick her off all the time--that was just her style!\\n\r\nThis style of anime was definitely a one-time deal for me--a YOLO moment, if you will. XD The one shot was quite fine.",
            "date": "2014-07-30T14:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 154507,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/427510.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CupcakeMeister",
                "username": "CupcakeMeister"
            },
            "url": "https://myanimelist.net/reviews.php?id=154507"
        },
        {
            "content": "KissXSis is one of the most ecchi series I've seen so far but it isn't the kind of ecchi I've seen so far. Usually you'd expect seduction, big breasts and panty shots. KissXSis went beyond that. There was always some kind of tension and it didn't always stay innocent.\r\nThe story is original but I felt they could make it a little deeper. I would have liked to see more of the main-characters past and the reason for the current situation.\r\nThere were some really funny moments and conversations but also a lot of pointless chatter. You see this quite often but sometimes the characters just saideach other's names.\\n\\n\r\nNo remarks on the animation. It's pretty recent and you can tell.\\n\\n\r\nKissXSis isn't the most funny show I've seen up until now and sometimes the ecchi was too bizarre for me to handle. If you think you can handle it or if you're into this kind of thing, you should watch it. (a friend of mine really liked it)",
            "date": "2012-09-10T08:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 72029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1430295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Degran",
                "username": "Degran"
            },
            "url": "https://myanimelist.net/reviews.php?id=72029"
        },
        {
            "content": "This is a awesome example for a ecchi anime.\r\nIt has the usual non blood-related sibling-in this case, twins- competing for their younger brother,Keita's attention and love.\r\nThe great art and colours are as amazing as they're ever gonna be while the enjoyment was enhanced by its art work.\r\nThe sound could have been greater but it has all the cliche, cheesy and sexual feel to it at different parts throughout the 24 mins of each episode.\r\nI am glad they did not follow completely through with the manga as I really hated the a$$hole teacher from chapter 20.\r\nOverall, i rate it as a 9/10 for its great artwork and i really love the characters especially Ako & Riko. They really work well together as twin sisters when they do ecchi stuff with Keita and also when they play their role as caring and loving sisters.\\n\r\nIf you like ecchi, love-romance, harem and a slice of life type of anime then 'Kiss X sis' will likely be up your alley.",
            "date": "2010-11-16T04:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 32082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/flarerain",
                "username": "flarerain"
            },
            "url": "https://myanimelist.net/reviews.php?id=32082"
        },
        {
            "content": "How do you make it so incest doesn't seem like incest? Make them stepsisters of course, silly! And make them older than the boy! Done!\r\nSo, you want an ecchi that pushes right to the edge of ecchi? Congrats. You found KissxSis, the strange story of sisters trying to find ways to be with their brother with some of the most awkward premises ever laid (pun not intended) out to get just that much closer to their dream.\r\nAnd I buy every minute of it.\r\nI'll be the first to say if you explained what was about to happen I'd wonder how that will ever be done soit actually works. The only real reason it does and why I can truly be okay with whatever weird plot I'm being fed...Ako and Riko are absolutely charming. That's it. I adore these sisters and truly their intentions are quite innocent (despite the premise). But overall, no matter what strange happens...there is a purity in how much they care for Keita. Their parents don't necessarily help the situation...but even with the parents and their silliness, you get a strong sense of a loving family bond, father and mother who deeply love each other and aren't plagued by taboo and other useless worries (leading to one of the funniest moments ever in an OVA) and a equally deep love for their kids like knowing the world will kind of work itself out, it doesn't matter if brother and sisters get together, with or without intervention it'll happen or it won't happen, there are more important things to worry about. \\n\\n\r\nThe main 12 episode series is quite sweet and doesn't really venture into dirty territory...they saved that for the OVAs which is an ongoing release (pun not intended). To truly accept the OVAs you need to have a thorough enjoyment of the series as a whole...some of my absolute favorite moments of the series comes from the OVAs.\\n\\n\r\nPros:\\n\r\nIf you like your ecchi with an incest harem twist, this may be just right for you.\\n\\n\r\nCons:\\n\r\nIf you like your ecchi with big boobs then this will disappoint. If any skin makes you scowl, then what are you watching ecchi for?\\n\r\nAnd I can't believe I'm gonna say this, but when things go a bit far...and you wish it just went a weeeee bit further...?...",
            "date": "2014-08-10T03:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 156019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/shodankid",
                "username": "shodankid"
            },
            "url": "https://myanimelist.net/reviews.php?id=156019"
        },
        {
            "content": "This Anime starts out mild manner, until the Main character or Keita Suminoe comes home to his Sisters, Riko Suminoe and Ako Suminoe that hug and kiss him which I don't find unusual, until they offer They start planning some other things for him which had me rolling on the floor laughing the whole time. I don't suggest this anime for anyone under the age of 16 as it has a Great Amount of Ecchi. \r\nSo in short I loved this anime because, it was simple and it was made for people who don't like the ecchi/Harem with the fighting aspect for anime and justwant Ecchi/Harem with a bit of slice of life.",
            "date": "2017-07-15T09:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 252922,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6403223.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Weeb_Sensei",
                "username": "Weeb_Sensei"
            },
            "url": "https://myanimelist.net/reviews.php?id=252922"
        },
        {
            "content": "First things first, I initially didn't know whether to watch the OVAs first or this series. Now that I've seen both, I'd recommend watching the first 3 episodes of the OVA before starting this series. The OVAs don't affect the story much but the first 3 episodes do take some toll in the series. Episode 4 of the OVA does happen after episode 7 of this series but it doesn't affect any part of the series. Everything else in the OVAs is just random stories that happen after this series is finished. But I hope this helps those who are just starting the series.\r\nThis maybe difficult to write about. More just putting my thoughts into words. I enjoyed this anime, I thought the comedy was hilarious and the characters are great. The relationship between the characters didn't even bother.\\n\\n\r\nThe anime revolves around Keita and his older twin sisters, Ako and Riko. At the start of the anime you find that Ako and Riko are in love with Keita and they both want him to do \"naughty\" things with them. And you also see that Keita wants both of them as well. BUT, you also find out that Keita and the twins aren't blood related and that they are step siblings. So the incest angle gets thrown out the window. I normally have a huge problem with incest angles but when they aren't blood related, I'm totally fine with it.\\n\\n\r\n Now that given said, you also find out that they've been siblings since they were in Kindergarten, and there's no problem there, but they still grew up together as siblings and you've always seen them as sisters. Now again, they aren't blood related so if they want to be together, there's no problem there. But if it was me, I know I wouldn't be able to do that, I'd only ever see them as sisters and nothing more. Though, Keita initially only sees them as sisters and nothing more, he does warm up to the thought of being with one of them (or both). So there's just an argument of you never know what would happen. But all in all, I don't mind the incest because as far as I'm concerned, there isn't any. \\n\\n\r\nThis series is rather dirty though. There's a lot of debauchery throughout the series and it mainly comes from the twins. I don't want to give anything away but they do kiss him a lot and play with his body parts, A LOT. It is rather ecchi in regards to what the characters do but you don't see anything other than ass, everything else you see is covered. But it is very sexual and very dirty. I'm 50/50 with the sexual nature of this series, half the time it made me cringe and the other half made me laugh.\\n\\n\r\nI thought the characters were magnificent, they were well developed and fresh and none were too similar, even the twins who wanted the same thing had their own personalities that were enjoyable to watch. There's of course a lot of stereotypical characters and themes but that shouldn't make you enjoy the series any less.\\n\\n\r\nThe story itself is fine, it mainly revolves around Keita as he studies and tries to get into the same high school and his sisters. Along the way, his sisters help him as much as they can, in good ways and bad ways *wink, wink*. There's hardly a story at all, each episode is just about what the twinsdo to try and woo their brother.\\n\\n\r\nLikes:\\n\r\n-I liked the characters, I thought they were entertaining and caring\\n\r\n-Mikuni, that poor girl goes through so much and it's just hard to watch\\n\r\n-The art was great, the highlights in each characters skin was what I really enjoyed. The complexion of their skin was really good and their body for the most part seemed very realistic.\\n\\n\r\nDislikes:\\n\r\n-Their parents are totally cool with their adolescent children potentially doing it all the time. The dad constantly reminds Keita that he isn't related by blood to his sisters and encourages him to get it on with them. The entire family is completely against Keita in his attempts to keep things platonic and everyone wants Keita to be with his sisters. It's ridiculous\\n\r\n-SPOILER!!!\\n\r\nNow I don't watch lewd anime like this to watch the characters have sex and do all their provocative stuff but when the whole series builds up to characters doing it and don't deliver is really frustrates me and lets me down. They spent the whole series making it seem like they were going to do it at some point and then they don't and that really bothered me.\\n",
            "date": "2016-09-07T15:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 228533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5586150.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Drevorn",
                "username": "Drevorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=228533"
        },
        {
            "content": "Kiss x Sis is a series that I genuinely regret ever watching. If there is a series that I consider the worst that I have seen, it is this one. The entire show made me think to myself \"WHAT THE FUCK ARE YOU DOING?\" so many times. Genuinely, this had made me convinced there's some sort of deep underlying psychological issue with some Japanese people from this anime.\r\nStory: 3/10\r\nThe story revolves around a 9th grader named Keita who is trying to get the grades he needs to go to the same high school as his older step-sisters Ako and Riko. There's one problem: HIS SISTERSARE MAKING SEXUAL ADVANCES ONTO HIM. So, he constantly gets distracted by them, and even getting tempted by them, which really upsetted me. The supporting characters weren't much of an improvement as well, considering they also try to make advances onto Keita. \\n\\n\r\nArt: 7/10\\n\r\nThe art was the most positive thing out of this, having a nice, clean look, but there was many scenes of fan service and despite all the shit this anime throws at the viewer, they couldn't draw nipples on the breasts when they were shown for God knows what reason. \\n\\n\r\nSound: 6/10\\n\r\nThe songs are catchy and cheerful, but once you learn what the songs are saying, boy they will make you uncomfortable. There's nothing better than have a song about how you want to be kissed and pounded by your younger step brother. Nope! Nothing at all... \\n\\n\r\nCharacter: 2/10\\n\r\nWhat really makes me so pissed at this show is the characters and how they interact with each other. Keita is the MC who starts out well, trying to not fall into the temptations of his sisters, but over time he starts conceding more and more into their advances, which made me say \"WHAT THE FUCK KEITA.\" Ako and Riko are Keita's older twin sisters by one year who are constantly trying to win his love in the most perverse fashion, all while dealing with other competitors. Miharu is a shy classmate of Keita who (somewhat) has feelings for Keita, but she is a gag of the show, having to piss EVERY OTHER SCENE (There is one scene of her pissing at the school that really made me uncomfortable. Can you guess what it is?). Mikazuki is a friend of Keita who is in love with him and tries to flash her panties every other time she sees him, not to mention she's the \"Lolita\" of the series. There's also the parents of Keita, Ako, and Riko who ARE OKAY with the twins chasing after him, which really questions their parenting and wonder \"WHY THE FUCK ARE YOU OKAY WITH THIS?\" The only remotely likeable character is Yuuzuki, the older sister of Mikazuki and homeroom teacher of the twins who sees the twins' advances as wrong and tries to stop them, but she also eventually starts to fall in love with Keita and fantasizes of having sex with him (Of course, what more do you expect from a virgin like her?) \\n\\n\r\nEnjoyment: 3/10 \\n\r\nI really felt uncomfortable with this series, constantly cringing and nearly yelling at my screen on the interactions the characters had with each other. I really wish that the adults of the series had a bit more of control and actually try to stop the twins' advances, but they didn't and that really made me upset. \\n\\n\r\nOverall: 3/10\\n\r\nNever had I seen a series that genuinely pissed me off more than this one. The thing that made this really shitty of a series was the plot and the characters, not to mention the character interactions, and it really left a bad taste for me. Unless you're into ecchi or incestious-based anime, then avoid this series. It will pretty much piss you off, cringe and wonder about the lax attitudes of the characters towards the situation.",
            "date": "2017-05-17T08:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 247911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5843414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OBruxo",
                "username": "OBruxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247911"
        },
        {
            "content": "It makes me fear about the future of the world after seeming a score more than a 3 on this show. This show is a sequel, which indicated that people actually enjoyed the first season. Now, I understand that this is fictional media and nothing like this would probably happen in real life, but at least Oreimo tried to create a story. This show literally didn't even try and attempted to operate itself as a gag manga with ecchi elements. If that was it's goal, it did the job decently well; however, if you view this show without a teenager's mind and thought about itfrom a moral standpoint, this show is horrendously bad. I'm not even considering incest, which I literally don't care about since it's anime and things happen. It's about the ways that the scenes that normal ways that gave teenage virgins, it's targeted audience, an erection that bothers me. While some shows like To Love RU expresses it as a gag, this show just literally make all the women always horny. There is nothing special about this except being the \"double twin incest anime\" with the crappy and cliché situations that the main character ends up in most the time. Unfortunately, I wished I could say that this show has something special, but all they have are bananas. They always have the bananas, it's the universal ecchi fruit, it's time to invent a new fruit America!",
            "date": "2017-04-20T16:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 245919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Nafiy",
                "username": "Nafiy"
            },
            "url": "https://myanimelist.net/reviews.php?id=245919"
        },
        {
            "content": "Let's be clear is not for everyone, I loved it but others hated it. Or you love it or you hate it; I think that the story was decent and the drawing is great. Even if is ecchi is not extreme so for me is more an r than a r+ in rating. The idea of they are brother and sisters for me is not so strange and infact they are step brother and step sisters. I loved characters. The ecchi parts worse than story parts so don't expect to fap on this anime.There isn't a season 2 and has been nearly 7 years sincelast episode and 2 since last OVA. Sorry for bad english.\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\nP.S.= Ako is better than riko.",
            "date": "2017-01-19T12:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 238642,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5983934.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/davidescion",
                "username": "davidescion"
            },
            "url": "https://myanimelist.net/reviews.php?id=238642"
        }
    ],
    [
        {
            "content": "Now this is an anime of incest. Yeah there are others and on a different level i don't wanna name (like yosuga no sora and akisora also others) but it's great coz the others are kinda wacky and basically just borderlline hentai maybe even hentai but this is a nice piece of incest. The main guy has two really good (not blood related) sisters and also a harem which has his sensei as well. Some sorbidden love this is. Also it was literally my first anime except typical famous shounen anime like you know those. It got me into anime basically. I found alot ofanime through this. afterwards i watched new genres of anime and basically got hooked into romances.\\n\\n\r\nThis anime has a great story. It revolves around the mc or protagonist keita and his sisters whom I love. This is actually a harem and incest anime but is pretty interesting.There's the manga that's still ongoing even after so long.\\n\\n\r\nThe art quality is really good and the illustration of ako is the nicest. Each frams were well done for some a while back. Continuing the story by making season's should have been done it not gettin anymore seasons now while the manga continues.\\n\\n\r\nThe character developing is kinda lacking though overall the anime is nice.\\n\r\nSo, a 9/10 should be okay",
            "date": "2018-12-22T04:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 296489,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7646308.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sorata7587",
                "username": "Sorata7587"
            },
            "url": "https://myanimelist.net/reviews.php?id=296489"
        },
        {
            "content": "*Sighs* \r\nlet's just get into this\r\nStory\r\n------\r\nA Romance Anime with twin sister harem? What could go wrong?\r\n*episodes later*\r\nOh fuck......\r\n(a little of an erection?)\r\nYea so how the fuck is this even considered to be an anime =,=\r\nHonestly I would have enjoyed the anime way more if the ecchi wasn't as bad as this. Kinda fucked myself here. Still better than Boku no Pico tho. That shit is straight gay pedophilia. (straight, gay and pedophilia? How does that work o,0)\r\n3/10\r\nArt\r\n------\r\nConsidering its ecchi the art can't beat DxD. So I mean I guess it is fine?\r\nThere are still many ecchi anime out there that has better art styles thatthis, *ehem* if you know what I mean...(big badonkers)\\n\r\nThough it's 2000s kind of art style gives a vintage and genuine feel i guess.\\n\r\n7/10\\n\\n\r\nSound\\n\r\n------\\n\r\nI can't imagine being a voice actor and being forced to act as a sister that is having orgasms because of her step brother. But they fucking nailed it. OP's music isn't that interesting to me.\\n\r\n8/10\\n\\n\r\nCharacter\\n\r\n------\\n\r\ni mean..... it's fucking half incest and that shit rare so\\n\r\n10/10\\n\\n\r\nOverall\\n\r\n------\\n\r\nI dropped the anime because of the ecchi honestly...\\n\r\nTo me, this anime should've just been hentai because the ecchi is just a lot and when there is too much of ecchi, the anime 'feel' just isn't there. It's like watching hentai but it's kind of censored. too censored.\\n\r\nThe ecchi really put the story down, sorry guys.\\n\r\nEnjoy this anime where its at the middle of the boundaries of anime and porn",
            "date": "2018-12-03T12:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 295204,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7600509.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/asyransih",
                "username": "asyransih"
            },
            "url": "https://myanimelist.net/reviews.php?id=295204"
        },
        {
            "content": "After watching this anime I was shocked and a little bit upset. It didnt understand at all the purpose of the story. It's art was ok nothing bad the eyes were a little to chibi for the face but  it didn't bother me. The fact that it was a show about two sisters trying to have sex with there step brother. It was a poor story that didn't go anywhere you could watch all the episodes out of order and it wouldn't matter they really didn't follow one strict line of story, yes, the objective was the same the whole 12 episodes. You knowI have to admit that it did make me laugh and it did make me go \"aaahhhhhh\" but it was the bad jokes and the ways the tried to have sex with me. The characters were normal and the male role of Keita Suminoe is boring and plain he's like any normal 15 year old boy with a partial sexual temptations for his sisters. All in all it was a okay show to watch to pass the time. And if you ever need an anime break from long complicated stories with to much graphics to handle, sit down eat some chips and watch this show. It's a nice thing to top off a good list of animes.",
            "date": "2012-08-12T20:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 69563,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1453921.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Mei-chan125",
                "username": "Mei-chan125"
            },
            "url": "https://myanimelist.net/reviews.php?id=69563"
        },
        {
            "content": "Alright I guess I should make a review for this, since I finished this show like early in the morning before school lol\r\nAnyways, this show is really great. Even though it does have its own boundaries on whether to decide it's ecchi or hentai, the story, plot, and characters overall were great. I really enjoyed this show because I found the whole love story between Ako, Riko, and Keita enjoyable and great, even though at some points it was overwhelming because of what Ako and Riko would actually do just to make Keita happy, and it shows how they really do care for him/love himvery deeply, which is pretty easy to understand the whole concept of the show lol\\n\\n\r\nI would not label this as incest, in my own professional opinion, because they really aren't related in any way, by blood of course, but many other people have their own sides/disputes on it in labeling it as incest. \\n\\n\r\nOverall, 10/10 amazing show :D",
            "date": "2014-06-13T12:11:00+00:00",
            "helpful_count": 3,
            "mal_id": 146873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3798729.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/yyaziK",
                "username": "yyaziK"
            },
            "url": "https://myanimelist.net/reviews.php?id=146873"
        },
        {
            "content": "Kiss x Sis is, in short, is a typical slice of life anime but with some perverted and romantic scenes, and the whole added incestuous taboo thing. The main character grew up with two step sisters, who have always been in love with him until current day, where Keita is in his final year of middle school. Since his step sisters are a grade above him, they do everything they can to help Keita study for his entrance exams, so they can go to the same high school next year. This along with the increased romantic tension is pretty much the gist of the plot.\\n\\n\r\nStory (6) - I'm giving the story a 6 because at the end of the day, it's not much more than what you would expect just from the description, however, I could totally see the story turning around and bringing the entire series to be a complete piece of shit, so at least they didn't totally fuck this one up. Most of the story is the two step-sisters, Ako and Riko, trying to please their brother Keita, as you would expect from this harem-type scenario. Then, once in a while we get to a scene where one of the sisters starts coming onto him. Keita will then get super uncomfortable, since he knows making out with one of his step sisters is wrong, blah blah blah, the sister will be aggressive, and then right before it actually gets interesting, the other sister will walk in, be jealous, and interrupt the scene. Every time. I understand that this is an ecchi, not a hentai, but every scene ending in the same way gets frustrating. However, I will admit the romantic development in this series is strong, as Keita will be more and more affectionate towards his sisters by the end of the series.\\n\\n\r\nArt (5) - Nothing spectacular, or anything that really blew me away. The facial expressions are kind of lame, it was really just your typical rull of the mill animation for a show that probably didn't have a huge budget. There were a few parts I liked, like then Riko puts chocolate lipstick on herself, but once again, not much that was super stellar. \\n\\n\r\nSound (6) - I actually took note of the sound being pretty good quality as far as the voices went. However, there's not much to base it off of when this is a romantic school-life show, I mean, what sound effects are you supposed to have? Wind chimes? \\n\\n\r\nCharacter (4) - I'm mainly giving this a 4 for the extremely weak supporting characters. They tried hard to throw in some side characters to give it story a different dynamic, but ultimately the supporting characters were annoying as hell and didn't contribute to much. It was just so average: the moe girl in the main characters' class that he has awkward encounters with, some random underclassmen that calls him senpai, the main character's friends who come and go once in a while that aren't really a part of the story, and so on. There were no characters besides the main three that didn't seem like filler. In addition, the step sisters Riko and Ako have hardly any personality or memorable characteristics. They're really just there to submit to / make out with Keita, the only character that got sufficient development. \\n\\n\r\nEnjoyment (6) - Although the story and characters weren't anything special, let's be real, the scenes were pretty hot. However if this was not an ecchi, and was just some generic romance story, I wouldn't have watched it in the first place. I would be bored out of my mind. If you're looking for a good romance to watch, this probably isn't it. But as someone who doesn't like romance series, I wasn't entirely bored with most of it which is somewhat impressive in itself. \\n\\n\r\nOverall (6) - I think a 6 is pretty generous, since the story, characters, and art were all kind of lame, however at the end of the day it's probably better and more interesting than your typical school-life/romance/SoL type thing. Probably due almost entirely to the ecchi aspect, but whatever. \\n\\n\r\nSo if you want a story based around a sexual fantasy, you probably came to the right place. As far as ecchi/harm/romance goes, this is pretty good in comparison. If you're looking for a series with some decent development and romance, I'd probably go elsewhere. But in general it was a pretty fun series, had a few funny moments, and might be worth watching just because it's so different than your typical show. The choice is yours",
            "date": "2014-02-14T16:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 132577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/754261.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/bloodgods",
                "username": "bloodgods"
            },
            "url": "https://myanimelist.net/reviews.php?id=132577"
        },
        {
            "content": "Whenever I say PLOT it means I'm talking about ASS & BREAST\n Kiss x Sis, By far a show that isn't afraid to flaunt what it is about. The story of this show revolves around Keita & his 2 step sisters Riko & Ako. Now, if you watched this show you pretty much know what its mostly about. If you haven't then let me warn you, if you're not into HAREM, ECCHIE, & possibly Hentai, this show is not for you. Because the PLOT is almost sufficating you in each episode & thickens as the story presses forward. But if you haven't watched it don'tlet the ecchiness &amp; harem &amp; slight hentai deter you from this heartfelt anime of 2 sisters wanting to be the center of their beloved brother's world. Now, I did not watch this anime because of the FANSERVICE, after a handful episodes &amp; if you have a heart you will actually grow an attachment to chacaters, moreso a perticular one amongst the sisters. By no means this slice of life anime is not only about PLOT there is a story to it with a side of hilaireous actions &amp; conversation between the characters. I'll cover more in detail in my breadown review.\\n\\n\nREVIEW &amp; scores ranging from 1-10, 1 being dreadful\\n\\n\n(7)STORY: As mentioned, this anime is NOT always about PLOT, PLOT, &amp; PLOT there's a connection between all the chacaters that each one is unique in their own way. From Keita's father always pushing him into manhood to his step-sisters constantly fighting for alone time with Keita.\\n\\n\\n\n(8)ART: The animation in this show is on par with a lot of popular animes. But when it comes to certain points in the show, it becomes more detailed in focoused so that you can understand what it is hinting at. For example, what does a peach have in common with a girl? You'll get that one when you watch the show ;)\\n\\n\\n\n(9)SOUND: When it came to sound they couldn't stress enough when it came to PLOT points in each episode to make you hear &amp; expirence what is happening to Keita as he comes into contact with different girls at certain points in each episode.\\n\\n\\n\n(8)CHARACTER:\\n\n- Keita- A guy that only wants to study &amp; do well in school, but can't because of his step sister's advances on him &amp; his chastity. But he is reluctant to look at his step-sisters not only as sisters as each episode passes by but more as any common girl at his school.\\n\\n\n- Riko- The youngest sister out of the twins. Riko happens to be the more more bold &amp; shameless, instead of beating around the bush like her older sister does she charges head on not really caring how anything turns out. The only thing I see that her &amp; Keita have in common is her intellagence . Their both not super bright, which is why she tends have a more of an understanding of Keita at certain points in each episode.\\n\\n\n- Ako- The oldest &amp; brightest out the twins. Ako a straight A student can't help but be a \"closet pervert\" when it comes to her step brother. Unlike her brash sister she considers outcomes on certain decisions she will make. But most of the time they backfire, &amp; she has to deal with the outcomes she wanted avoid from the start. The only thing I see Keita &amp; her have in common is their shyness in uncomfortable cituations or when they're put in the \"hot seat\".\\n\\n\\n\n(9)ENJOYMENT: All &amp; all this slice of life harem &amp; ecchie is a very enjoyable show if your not closed minded &amp; are willing to understand the relationships between each character.\\n\\n\n(9)OVERALL: I highly recommend this show to people who are a fan of ecchie &amp; harem &amp; borderline hentai animes. \\n\\n\nBy the way, I can't help but feel the OVAs are better. Just some food for thought.\\n\\n\nEnjoy guys =)",
            "date": "2014-02-14T16:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 132575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3541779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SkitZxX3",
                "username": "SkitZxX3"
            },
            "url": "https://myanimelist.net/reviews.php?id=132575"
        },
        {
            "content": "KissXSis, as an experience, is reminiscent of spending a night at a strip club. Alluring sights and sensations surround you, and the many feelings you go through, they leave you delightfully thirsty. It’s like having a girl grind her butt on your crotch, feeling that sweet softness through your pants. If she’s skinny, you might feel the sharper edges of her bone structure, and if she’s big, the accommodating embrace of cellulite. Either way, your senses are bombarded with hints of an incoming, pleasurable payoff. If, however, you watch this show for porn, you will have to boot another video: the anime never crosses theline into hentai territory - at least without clothes on.\\n\\n\r\nMake no mistake, KissXSis is thoroughly pornographic. Even without genitals touching or tits flashing, the romantic tease the show subjects you to is relentlessly titillating. The twin sisters are confident and intelligent, they’re young women with a firm fixation on what they want: the love of their non-related brother, Keita, who was married into the family through his father. They want Keita’s hand in marriage and compete over him.\\n\\n\r\nThe mother of the twins, and the father of the brother are beyond liberal, actively urging the sisters to marry the brother. The attitude of the parents is extreme to the point of parody, and it’s not very realistic, but they enable the premise to function. Even as there’s no actual incest happening, the anime plays with the character dynamic as if there was.\\n\\n\r\nHonestly, not every episode is worth watching. The external plot outside the emotional is about Keita studying for university entrance exams. It’s not very interesting, and some episodes offer literally no enjoyment of any category. However, the episodes that nail it, they go for the fucking throat. I personally haven’t seen or read any erotic works that could deliver as sensual a sexual experience as KissXSis. I’m almost positive that the show is designed for prolonged masturbation sessions, possibly toy assisted.\\n\\n\r\nWhile no genitals ever touch in KissXSis, there’s still much sex to enjoy. Several episodes have seduction scenes, the sisters dressing up, stealing kisses, even practicing for a threesome! My absolute favorite episode centered around kissing, and it concluded in a long, sensual scene involving chocolate lipstick and hugging.\\n\\n\r\nThe sisters are not the only characters romantically interested in the male audience surrogate. An otaku milf teacher joins the cast early on, accompanied by her shameless younger sister. There’s also a running gag about this timid girl and her piss always finding its way on Keita’s face.\\n\\n\r\nI truly suggest you watch KissXSis. It’s the most stimulating ecchi tease one can find in today’s market, outside of actually dating.",
            "date": "2015-03-22T11:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 183062,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4203491.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Otaku_Apologizt",
                "username": "Otaku_Apologizt"
            },
            "url": "https://myanimelist.net/reviews.php?id=183062"
        },
        {
            "content": "It's good, but it's not Eromanga-Sensei good, which is why I only gave it a 9. If Eromanga-Sensei didn't exist, it would obviously be a 10, but since we live in a perfect world with perfect anime, kiss x sis is not getting a 10. The plot of Kiss x Sis is also much harder to follow then Eromanga-Sensei's. In Eromanga, there is only one sister, making the incest much easier to comprehend, however in this show, they added two, making me feel quite light headed and unsure. There can not be any incest competition in these types of shows, it just ruins it. Furthermore,I felt like the character designs of the two sister's were too similar, making it hard to tell who was who in certain situations, whereas (again) in Eromanga, the character designs are much easier to tell apart.\\n",
            "date": "2018-11-02T15:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 293195,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7535634.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Boobsy",
                "username": "Boobsy"
            },
            "url": "https://myanimelist.net/reviews.php?id=293195"
        },
        {
            "content": "Kiss X Sis is an ecchi comedy about a young boy and his two stepsisters, and their numerous sexual advances towards him, which he tries to avoid, in typical anime fashion. The story takes off from here, and is a standard comedy SOL, showing the day-to-day lives of the protagonist Keita just trying to go about his life, as his onee-sans attempt to seduce him. The story and writing are very average. Serviceable, but I can't really commend them for being anything more than \"good enough\". I got a few laughs in here and there, but as said, it was nothing truly great. It isan ecchi at the end of the day, and clearly the focus here was on the fanservice, which is understandable, as it is highly prominent, and it's nice to finally have a show like this showing an onee-san and not an imouto, but this isn't enough to excuse shortcomings. Above all else, the onee-sans themselves aren't very noteworthy, feeling hardly any more developed than ones I'd find in a doujin, and the protagonist is just as undeveloped as all brown haired reserved male high school student students are.\\n\\n\r\nTo conclude, Kiss X Sis is very 'decent'. I wouldn't highly recommend it since if you want comedy, qt onee-sans or fanservice there are generally better ways you can get all of those, and this is just a poor merge of all. Not that bad though.",
            "date": "2018-10-10T08:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 291406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6943364.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SCLFI",
                "username": "SCLFI"
            },
            "url": "https://myanimelist.net/reviews.php?id=291406"
        },
        {
            "content": "You can view this show in one of two ways: as the author intended, and reading way too much into it.\r\nAs the author intended, Kiss x Sis is shit on all levels. The only meaningful conflict is, \"Has X tried to have sex with the protagonist yet?\" (I won't name the protagonist because I forgot his name and frankly I don't care to look) Even the MC's agency is taken away as in the beginning he tries to NOT FUCK HIS SISTERS (like a normal person) but every person, insect, and fiber of the universe tries to tell him otherwise till he gives in andplays Tapioca Hockey. The art is pretty good because this is as close to hentai as you can possibly get without showing on-screen penetration. Every other aspect of the show is equal in merit to invisible art.\\n\\n\r\nBy reading too deeply, a very different picture appears. Kiss x Sis is actually an allegory for the modern man in a postmodern age. The protagonist has a firmly held belief: \"It is wrong to fuck your underage sisters, even if they are 'not related by blood.'\" His belief is then assaulted from all sides by authority figures, his peers, his sisters themselves, and what amounts to the god of his world (the author). Facing this moral execution, and with no respite or support from people who share his belief, he slowly loses sight of his conscience and embraces the depraved. The belief could be religion, a personal creed, an idea about art, or anything else which holds one thing to be of higher value than another. The relativistic world grinds it to dust under its sheer weight. Our plight is not to forge our own meaning from the void, but rather to hold onto meaning so that we do not fall into the void in the first place. \\n\\n\r\nToo bad I know the author wasn't that clever.",
            "date": "2018-08-03T16:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 285500,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Anxious_Green",
                "username": "Anxious_Green"
            },
            "url": "https://myanimelist.net/reviews.php?id=285500"
        },
        {
            "content": "I'm just going to come out of the gate saying this, I've watched this twice. The first time was during \"that phase\" of my anime viewing period. Years later, about a week ago, I saw a clip on Youtube and laughed quite a bit. I thought \"Wow I forgot how funny this series is, I'm going to rewatch it.\" Well... based on my score, you can probably guess how well that went.\r\nJust as a warning, this anime isn't listed as hentai, but it comes close many times throughout the series. It IS soft core porn. \r\nThe story of Kiss x Sis is simple. Two sistersof our MC are horny and thus shenanigans commence. Its pretty predictable, and the overall story isn't important as each episode is structured to be its own mini story. I can't say I enjoyed or even cared where the characters were going, as I was waiting for it to end about half way through.\\n\\n\r\nThe art is mediocre at best. It has an art style that doesn't try to be different, doesn't try to unique. The actual animation is fine, usually only truly used to its best in \"those\" scenes.  I don't have much to say other than nice fanservice? Everything about the art and animation in Kiss x Sis is mediocre.\\n\\n\r\nSound wise, the music is forgettable. Not necessarily bad, but definitely not good either. Next with the voice actors, I should mention I only watched the sub. The voice actors in the sub were good though. They did a fine job portraying their respective characters, no complaints there.\\n\\n\r\nThe characters in this anime are unremarkable. The MC is the typical, reluctant to do anything sexual guy who happens to have the best luck with girls. The two sisters are horny as said earlier and end up doing kinky things with the MC. You got a teacher who is probably a pedophile. Theres a small perverted loli, and a girl who is constantly put in awkward situations for comedic and fanservice purposes. The dad in this anime is hilarious though. That man wants his boy to bust some nuts and that is respectable in my honest opinion. If you can't tell by now, most of these characters only qualities is that they serve to be arch types for any kinks the viewer may have. These don't feel like real people nor try to be. They feel like lifeless dolls that don't develop in meaningful ways, only existing to bring the next fanservice moment.  \\n\\n\r\nMy overall enjoyment of this series started at \"This is degenerate but kinda funny\" to \"Was that the final episode? Oh finally! Hold on, is that an OVA? FUUUUUUU....\" I recommend that you don't watch this. Even if you wanna watch it because its degenerate and you are interested in where the story may go. Don't. I was that guy and i regret my decision immensely.   \\n\\n\r\nThanks for reading my review of Kiss x Sis. If you have any comments on my review, please feel free to send me a message.",
            "date": "2018-03-16T08:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 273965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5268743.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/The_LoliLord",
                "username": "The_LoliLord"
            },
            "url": "https://myanimelist.net/reviews.php?id=273965"
        },
        {
            "content": "Have you ever been so drunk that you; upon laying thyne eyes on thou sisters pussy, thought that it was huge open wound that was potentially life threatening and proceeded to panic and put loads and loads of plasters on it to seal it up? Me neither. But the main protagonist of this series could say different.\r\nThis is a review for Kiss x Sis Season 1 AND its OVAs that come as a separate season.\r\nRight then. Lets begin. Or more like where do I begin?\r\nSince this review was written using only one hand (for a very good reason I can assure you), I'll try andkeep this simple.\\n\\n\r\nThe Story : 7\\n\r\nNot Much of a story ill be perfectly honest but it doesn't really need one since most of it 2 Hrony Sister battling for their younger step brothers love, which you can imagine results in more time devoted to things I that really shouldn't get that excited about. However it does stick to the story line well, and every episode on the TV season played nicely towards the eventual goal of which the story was situated on. Having 12 full length OVAs did take me by surprise, although they were all very good, they didn't really follow any story, and were little bits and sections that have played off from season 1, but weren't included. \\n\\n\r\nThe Artwork : 7\\n\r\nAnime industry standard right here. Nothing too special about it, but it was good nonetheless.\\n\\n\r\nThe Sound : 8\\n\r\nDue to my obvious lack of Japanese linguistic abilities, I cant really judge the voice acting, although the voices suited that characters nicely, even though most of the noise was moaning. *Wink wink smiley face\\n\\n\r\nThe Characters : 8\\n\r\nIts hard to say I dislike any of the characters in this anime, although there isn't much development and background to each of them, you quickly notice little quirks and funny things about them all that add together to create a funny and enjoyable show.\\n\\n\r\nThe Enjoyment : 10\\n\r\nOhboyohboyohboy yes I know that the other scores for different aspects of this anime don't really reflect that I gave it a 10, but just for sheer enjoyment and that fact that looked forward to every single episode, and that I loved every second of it was enough for me. \\n\\n\r\nOVERALL I must say this has been a very very enjoyable anime... for all the wrong reasons. In reality Kiss x sis is basically the most border line hentai anime I've ever had the pleasure of witnessing, and yet it has no real nudity, although I suppose it is debatable about what you would consider real nudity. Putting the fap content aside for a second, what you have is a light hearted very funny show, with likeable characters, and good art and sound.\\n\r\nPutting the fap content back in, and what you get is all the above... and humongous boner. 9/10 might fap again.",
            "date": "2016-04-20T13:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 216768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5251593.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KozuraKZO",
                "username": "KozuraKZO"
            },
            "url": "https://myanimelist.net/reviews.php?id=216768"
        },
        {
            "content": "Ecchi with a good plot. A \"decent ecchi\" perhaps.\r\nThis is my first review, so please bear with it.\r\nI originally thought that this anime was all about sex, physical contact, etc. But I was surprised that it was more than that. I admit that it was because of the fan service I started watching this series.\r\nStory: 8/10\r\nThe series has a very good plot. Their were scenes that made me happy, sad, surprised, and some even got me in the mood. There's something about everything in this anime - Romance, Comedy, Harem, Love Triangle, and Drama.\r\nArt: 8/10\r\nThe art was good also. The characters are drawn the wayan ecchi-anime-lover likes. I really liked Ako's hairstyle, Mikuni's eyes, and Riko's band-aid on her cheek. Because this is an ecchi anime, you'll expect that the female characters are very feminine.\\n\\n\r\nSound: 9/10\\n\\n\r\nI would give the sound a score of 9, since the background music really suites the atmosphere/emotions during specific scenes. There are emotional scenes, and the producers did a great job in providing the soundtrack.\\n\\n\r\nCharacter: 7/10\\n\\n\r\nThe characters were pretty unique, especially the teacher. To be more specific, you will somehow find a type of paraphilia in every character. Lolicon, mammagynophilia, exhibitionism, cosplay and eroge, and even urolagnia (in a funny way).\\n\\n\r\nEnjoyment: 9/10\\n\\n\r\nI really enjoyed watching this anime. I got hooked after watching the first episode. It was very amusing, and it really got me. There were also emotional times, especially in episode 11.\\n\\n\r\nOverall: 8/10\\n\\n\r\nIt was a really good watch. It has reached my \"must watch\" list. Other reviews (from other forums) say that it was typical, boring, and a waste of time, but I disagree. It blew my expectations away. Although it haven't reached \"Makoto Shinkai-level\" for greatness, it reached mine.\\n\\n\r\nI would really recommend this, especially to ecchi lovers, and to those who ran out of titles to watch.\\n\\n\r\nI myself, like ecchi, but no so much. I prefer mature/serious romance.",
            "date": "2012-07-01T19:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 65031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1365063.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Englandanni",
                "username": "Englandanni"
            },
            "url": "https://myanimelist.net/reviews.php?id=65031"
        },
        {
            "content": "Ok, so it's KissxSis review time I guess. Actually, there's not so much to say about this, so I guess it would be proper to call this more a warning.\r\nQuestion is: what do you want to watch?\r\nIf you're looking for some anime with a decent character-set, funny moments and a well developed light story with a sweet touch of fanservice, hear me: go look elsewhere. If you liked Sakurasou no Pet na Kanojo and the like and you want something similar, this is the wrong place to search in.\r\nThe story is just about an idiot who tries to enter the same school of his oldertwin sisters. He loves them but he tries not to admit it, they love him, (no but, here) and they always try to rape him.\\n\\n\r\nBut, said this, if you want something completely, absolutely and infinitely random (though not reaching the levels of randomness of something like \"Hentai Ouji to Warawanai Neko\"), filled with whole lots of fanservice and borderline ecchi, maybe you should give KissxSis a try. The story is not moving, the almost-hentai moments are concentrated in a bunch of episodes, while the rest is simply stasis.\\n\r\nOf course, like pretty much all the harem MC, our dear Keita will be a useless omega male type, you'll hate him, I guarantee; but he has something worth it (no, I'm not saying THAT, but yes, of corse he's got that too): what I mean is that he often gives in to his sisters' perversions. So you'll have moments when you wonder which one of your three arms should handle the laptop to hide it in a bolt-fast movement from your whole family entering your room, disturbed by the intense moaning of two cute and deviated twins.\\n\\n\r\nAnd with this we're pretty much done. Do not expect anything from this show, but if you want to laugh a little bit, and to get some pretty hardcore fanservice moments, go for it.",
            "date": "2013-12-23T13:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 125239,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3308177.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Bernakun",
                "username": "Bernakun"
            },
            "url": "https://myanimelist.net/reviews.php?id=125239"
        },
        {
            "content": "Kiss X Sis is not really a good anime. The story is all but interesting, the characters are a little too cliché to be either good or bad... Even the ost is particularly cheap.\r\nBut beyond this \"technical\" aspect, there is something more. In fact, the anime in quite fun and exciting thanks to the baseline which consist to show how it's cool to do some sex with your stepsisters/stepbrother.\r\n Fun because the author apparently don't care about  social issues and approach the topic with humor and a not really recommanded point of view. All along, the narration is trying to justify this incestuous relationby any means (like father's weird speech and the dialogues from the main characters), and you can see here and there some fetishs scenes which are brought in a normal fashion, without consideration for whether it's chocking or not.\\n\\n\r\nAnd it's also rather exciting due to several sexual content, that you can classify  between ecchi and hentai. A good point for this anime is that the author who used to make hentai too, tries to make something more erotic and sensual by using ecchi codes. You can't qualify these scenes of \"piece of art\", but there is still something interesting in it.\\n\\n\r\nSo I'd say I liked this anime. Even if the story, the ost and the characters are not really good, the sensual aspect and the uninhibited vision of the author are a plus you can't deny.\\n",
            "date": "2013-03-27T14:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 91173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1960124.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kandem",
                "username": "Kandem"
            },
            "url": "https://myanimelist.net/reviews.php?id=91173"
        },
        {
            "content": "I thought this was an odd anime yet so enjoyable\r\nI thought the story was decent not bad offered lots of interesting scenarios \r\nArt was well done no bulgy or messed up part you can catch sometimes \r\nSounded the same as always to me \r\nCharacter wow diverse much to seemed really unique to me and always had me smiling \r\nEnjoyment i think i smiled every episode and i like the more serious animes it was really enjoyable worth the watch \r\non a side note if i was Keita i would have gave in i could not imagine how his hormones stood in place i would havedied from no release from it",
            "date": "2012-07-29T21:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 68097,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887821.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/warsaw504",
                "username": "warsaw504"
            },
            "url": "https://myanimelist.net/reviews.php?id=68097"
        },
        {
            "content": "I've watched the first 3 OVAs and the first 3 episodes of (TV).  It's pretty bad so far.\r\nThe execution of the story is bad.  It's boring, and I find my mind drifting to thoughts of work.  I can maybe watch an episode at time before I lose interest.  The art style is bland and rather flat compared to today's standards.  The faces look like they took most of the art budget, but even so, they aren't that great.  The sound is pleasant, but nothing memorable.\r\nThe characters are not that great either.  The main 3 characters are not eveninteresting.  There's couple of his class mates that will become main characters that are interesting, but that's mostly due to lack of interaction so far.  The ecchi that I will remember most from this anime is drooling tongue kissing.  If that's your thing, go for it!  But I seriously you can find even better drooling tongue kissing elsewhere (not quite the same, but Nazo no Kanojo X comes to mind if saliva is your thing, I haven't watched it yet though).  That being said, a couple of the moves from the ova are pretty good.\\n\\n\r\nEnjoyment isn't there.  I've only dropped a couple anime so far.  My personal rule is if I start it, I finish it.  That being said, I've seen roughly 1/4 of this series and I'm considering dropping it.  \\n\\n\r\nOverall, I suggest you look elsewhere.  To Love Ru (Seasons 1 and darkness 1&2 are great), Oreimo, Infinite Stratos (S1, I remember the series didn't end well), Highschool DXD S1 and maybe S2, and Sora No Otoshimono S1 will all serve you much better.  I think what draws me into these other anime is that there's a spirit of adventure.",
            "date": "2017-06-19T14:49:00+00:00",
            "helpful_count": 0,
            "mal_id": 250373,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pyro226",
                "username": "pyro226"
            },
            "url": "https://myanimelist.net/reviews.php?id=250373"
        }
    ]
]