[
    [
        {
            "content": "Nice watch. Dependable male lead. Intriguing plot twists and action. Interesting space-age setting with heavy political overtones. \r\nThere were just a few hiccups for me:\r\nThe romance was contrived and devalued some of the characters, though perhaps it's just personal preference.\r\nThe story could have been more detailed overall; perhaps more worldbuilding, character backgrounds and development, and more explanation for each of the happenings. It may have made the romance worthwhile.\r\nWish it had a mature feeling, but at least you get the feeling that the young adults/children are young adults/children.",
            "date": "2015-09-26T00:46:00+00:00",
            "helpful_count": 267,
            "mal_id": 199631,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4851543.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mugisa",
                "username": "Mugisa"
            },
            "url": "https://myanimelist.net/reviews.php?id=199631"
        },
        {
            "content": "I don't normally write reviews, but I feel like I have to for this one.\r\nTHIS SHOW IS WORTH WATCHING. YES IT STARTS SLOW, DEAL WITH IT. GIVE IT A FAIR CHANCE.\r\nDO NOT JUDGE THE SHOW UNTIL YOU'VE FINISHED IT. Seriously, so many people dropped it early and missed out on arguably one of the better shows of the 2015 Fall season.\r\nSTORY (9): It starts off slow and kinda generic. You've seen it before, the big bad greedy corporation wants to cut funding for the hardworking dedicated student team finishes their big project. Corporate representative is sent to be evil and shut them down. Snore.\r\nExcept that'snow what the story is about. The classroom is just a single plot point to carry the show onto the next event, as it starts to pull the camera back to show what's going on with the behind the scenes. It evolves into a corporate and political drama where alliances are formed behind closed doors and plans are carefully laid to move everyone into positions. The story may be about kids building rocketships, but the show is a much more grand scale.\\n\\n\r\nThen you get gut punched by the intense moments, when the trap cards are activated or the action kicks off. It's just at the right level that you stay intrigued during the \"slower\" parts.\\n\\n\r\nArt/Sound (8): It looks and sounds good. I'm not really going to go in depth on it because I don't know what else to say. The animation is smooth, the art is well done, the backgrounds are gorgeous, and the effects are nice. There aren't any out of place sounds and the OP/ED are nice.\\n\\n\r\nCharacter (8): This is where a lot of people get confused. \"Why are there so many characters, who's the main character, why aren't these people getting more attention?\" Whoa there speedy, calm yourself down. There isn't what I consider a single \"main\" character, it's more like two primary characters, two secondary, and the supporting characters.\\n\\n\r\nKaito is the MC of the classroom side, while Nagisa is the MC of the corporate side. Both are important, and there's a solid overlap between them to where it never feels like one is taking the spotlight from the other. Iris and Mizuki both get good development and fill their rolls nicely. I'll warn that if you hate amnesiac characters with a burning passion it might take a little away, but it's not a critical plot point to the overall story. The other students do what they need to and don't get in the way.\\n\\n\r\nRomance is implied (and shown) but not plot critical, just enough to get you intrigued but not so much that it detracts from the story.\\n\\n\r\nEnjoyment (9): Honestly, it's one of the better shows this season. Once the plot got underway I was addicted. The pacing was excellent, the excitement was real, and it ends almost perfectly. All important plot points are wrapped up nicely, though there's just enough hooks that a second season can latch on to. \\n\\n\r\nOverall (9): I'll admit I'm rating it a point higher than it probably deserves, but I really wanted to counter all the negative reviews. Classroom Crisis is a very well done original work that absolutely needs more attention that it got. The slow start really hurt viewership and I feel it's unfair considering just how good the show ended up being. Seriously, you won't regret it, I promise.",
            "date": "2015-09-25T18:16:00+00:00",
            "helpful_count": 92,
            "mal_id": 199599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4008181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xSPYXEx",
                "username": "xSPYXEx"
            },
            "url": "https://myanimelist.net/reviews.php?id=199599"
        },
        {
            "content": "Without giving too much away about my personal life, I work in IT. My job involves tinkering with technology that helps improve people’s lives in ways they didn’t know they were being helped whilst never getting the recognition involved with being involved. Whilst I’m not the most knowledgeable when it comes to what’s current or how it’s implemented or how to use Linux for everyday life, I do know that this is a tough career path and even getting started can be a big pain. Interviews suck, especially when you pass many of them only to fail at the final stretch. The learning process isworse than Dark Soul’s. Multiple failed projects. Corporate decisions screwing you over. The works.\\n\\n\r\nSo I guess in a way, there is some merit in Classroom Crisis portraying that part of my life. Doesn’t change the fact that the show can go fuck itself though. You wouldn’t defend the more boring iterations of the Assassin’s Creed series solely based on how much effort was put into accurately portraying the time periods said games take place in. And it doesn’t help that the show’s actual handling of business politics is about as insightful as a Captain Planet episode - although I’m pretty sure Sly Sludge had more smarts than anyone in this mess.\\n\\n\r\nClassroom Crisis is once again another show following the trend started by Jun Maeda in that it’s written by a sort-of-established visual novel writer who had the same stupid “how hard can it be?” thought all of his predecessors had before proceeding to spontaneously combust himself due to his inability to escape the trappings of his preferred medium, ironically at the same time as Maeda’s own second combustion. But say what you like about Charlotte - I certainly have - at least stuff happens in it! Guy finds he has power, proceeds to abuse it, gets punished, is roped into a strange place, finds out he's part of something bigger, deals with tragedies, reverses a few only to run into something irreversible, sacrifices himself, and ultimately grows as a result even if his brain is too damaged to remember said growth. On the other hand, after three anime, Fumiaki Maruto still hasn’t seemed to grasp the definition of the word “story” at all. And with this show he seems to have forgotten the definition of the word “character” as well.\\n\\n\r\nMaruto’s last anime, Saekano: How To Be A Boring Heroine, shot itself in the foot before it left the starting gate with its intentions to focus on “character” at the expense of “story”, but at least the characters had identity. This time around, ninety percent of the cast don’t even get so much as a description worthy of a gaming instruction manual. They’re just a bunch of faceless gimmicky extras, led by a teacher who couldn’t be any more obnoxious unless he suddenly turned into a racoon who’d give you rabies every time you answered a question wrong. Actually I don’t recall the teacher doing anything in the show at all - let alone teach - unless you thinking talking big counts as doing something (it doesn't). The ratio of things that happen to him as opposed to things that happen by him is so one-sided I don’t think there’s a scale big enough to represent the number on the former side.\\n\\n\r\nThe only character who actually has some semblance of characterization that doesn’t make me want to blow my brains out is the transfer student and arrogant rich boy, Nagisa Kiryuu. And I’m being very generous here, because his characterization is pretty much Chazz Princeton’s from Yu-Gi-Oh GX without the unintentional humor in that he’s a brat from a respected family who gets beaten down by his older brothers because being rich equals being a Lex Luthor wannabe who doesn’t get that the guy was articulate in his evilness. Oh, and he eventually becomes nicer after being forced to work alongside the idiots surrounding him and discovering they’re not all that bad. Fan-fucking-tastic character writing. Next we’ll be showering critical accolades on a character story about a young boy who has his innocence shattered when he discovers that people die in war.\\n\\n\r\nThere’s this girl named Iris aka Rei Clone #4395714, and the show beats you over the head that she knew Nagisa in the past so ham-handedly that it might as well have had a neon sign pointing that shit out over her head every time she so much as appeared. But apart from that, she has absolutely no identity whatsoever and barely interacts with Nagisa or do really anything of significant importance whenever said neon sign isn’t turned on. She’s less of a character and more of “plot mcguffin with tits”. Not that being an emotional girl is any better, as Mizuki (had to look up her name because she’s that forgettable and unimportant to anything going on) discovered the hard way with her “I’m nice and maybe have a crush on this bad boy” routine. Maybe if you didn’t devote large sections of your show to explaining a bunch of political business stuff that I couldn’t give two shits for, I’d actually see these characters as someone worth giving a damn to get invested in.\\n\\n\r\nSo the characters are boring with no relatable or interesting flaws whatsoever, but that doesn’t mean...well actually yes it does mean your show is doomed from the start, especially when your story leans so heavily on them. But even if you had gotten the cast of The Breakfast Club to star in this thing, it’s been awhile since I’ve seen such an awful case of “story driving characters” rather than “characters driving story”. Again, like Saekano - and White Album 2 to a lesser extent - there doesn’t seem to be much of a driving element to Classroom Crisis’s plot at all. As such, I don’t know what I’m supposed to care about or even who’s supposed to be the main hero that holds everything together.\\n\\n\r\nAfter the anime starts with the world’s most boring and throwaway terrorist scenario, Nagisa informs A-Tec upon his rescue that their group is dissolving and they’ll have to go their separate ways, but that’s literally all there is. Why should I care if they dissolve? Will they lose their homes if they do so? What dreams do they want to accomplish by being in A-Tec? What is the importance of building these machines? Well we never know, because the situation is resolved due to some legal loopholes without much of a struggle on the characters’ end and there’s still two-thirds of the anime to go. It’s like watching an episodic family sitcom scenario except stretched to four times the length and without any laughs in it.\\n\\n\r\nWe then spend the next third having the characters live their lives. No seriously, that’s it. They just live their lives with the only central mechanic being Nagisa warming up to them - which as I’ve stated earlier doesn’t count as a story at all and certainly doesn’t have anything challenging about it - whilst dealing with their projects in the most saccharine way possible. They spend graduation by going to a beach, Nagisa has to pass a test, the characters resolve another random hostage situation that to be fair is better executed than the first one, the characters attend a school festival, and all I can think about whilst watching that shit was “wow, I am really bored. Hey, wasn’t there a plot point about the company stealing money for their own personal reasons? Are we ever going to get back to that? I feel like I’m watching Dragon Age: Origins’ ‘epic elements with no central narrative’ plot if it was channeling Dragon Age II’s ‘daily life of some random jackass without making anything actually happen’ snorefest”.\\n\\n\r\nWhat is up with visual novel writers and wanting to assemble all the pieces first before putting them altogether at once anyways? Not only do I not see why you can’t just put them together as you introduce said pieces, but you can still make mistakes when going all in at once when said assembly is complete. This becomes particularly true when Nagisa is forced to make a sacrifice in order to save his friends by involving himself into the company’s inner-workings in the final third of the show, putting him in a position of betrayals and internal danger. Sure it makes no sense why he couldn’t explain his plan to the others or why it took so long to get to some conflict that actually might go somewhere, but I’ll take it if it means we can finally have some actual driving tension to what’s going on.\\n\\n\r\nUnfortunately, even that is badly handled, because the show still won’t install any sense of importance to the proceedings to the point that everything feels padded. We have to sit through long long long scenes where Nagisa has to talk about business politics with characters we don’t know, and they barely affect the plot or involve the characters he’s supposed to be saving, making them incredibly tedious. The only part that resembles an actual driving conflict where stuff actually happens comes right near the end when the show reveals why A-Tec’s money has been withheld from them, along with some more plot twists that were sort of hinted at earlier on involving characters that barely contributed anything before now. Not going to spoil them, but let’s just say I didn’t throw out that Captain Planet reference in the beginning of this review lightly.\\n\\n\r\nSo you want to know what said conflict leads to? What actual character struggles result from their new discoveries? What these sudden plot developments actually lend to the narrative? So the fuck would I. Because Classroom Crisis thinks the best way to conclude itself would be to get sidetracked again with a kidnapping scheme caused by a boring asshole that exists solely to have a convenient excuse to have the characters utilize their individual skills for an agonizingly bad happy ending that was as soulless and token as they come. Mild spoilers: there's literally nothing to that ending but the good guys triumphing over the bad guys with no meaningful sacrifice or journey whatsoever, the shallowly naive message that dreams beat corporate, tons of loose ends that never added to anything, an incredibly tensionless rescue scene capped off with a nauseating and crowbarred-in love triangle element that made me want to hurl vomit all over my computer screen (seriously, what is up with Maruto and his fetish for love triangles?), and LOTS. OF. TALKING. The show literally just assembled the pieces, let them do the work, and then went off to have a milkshake without realizing that the autopilot navigation system has been faulty for months.\\n\\n\r\nThat's got to be the most anticlimactic way to pay off on all your buildup since that godawful Robotics;Notes anime! And speaking of R;N, this show sure seems to take an awful lot from that anime in addition to how it ends, doesn't it? Like the character types, poor pacing, sci-fi setting, saccharine humor, large sections of the plot, and even being written by a visual novel writer who's gone completely downhill after his breakout hit. As the 40-year old virgin's friends said in regards to the only date he's ever had in his life, \"fuck that\".\\n\\n\r\nI don’t usually spend this long on a review talking about the story, but it’s absolute dreadfulness kind of overshadows everything else. But that doesn’t mean everything else gets a free pass. The animation is really terrible, like something from a bad 90s OVA bar the OreImo designs. And the music is bland across the board, from the opening credits to the actual OST. Out of curiosity, I went to Wikipedia to find out what amateur composed this anime’s piece of air and found it to be none other than...the guy who did the triumphant bombast of Haikyuu and Gundam Build Fighter’s soundtracks? As well as Death Parade’s? I soon saw he also did Robotics;Notes’ blandness and it all made sense. Obviously, this is a guy who realized the same thing I did in that there’s no future for anime written by VN writers and vowed to bring that across in his compositions. And if the music guy thinks your anime is shit, who are you to argue?\\n\\n\r\nWe should really start listening to these semi-major anime industry guys more, less we end up with more cartoons like this fucking atrocity.",
            "date": "2015-09-28T04:28:00+00:00",
            "helpful_count": 63,
            "mal_id": 199955,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1147547.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Flawfinder",
                "username": "Flawfinder"
            },
            "url": "https://myanimelist.net/reviews.php?id=199955"
        },
        {
            "content": "This is my first review and I'll just write it to incite some more people to watch this show. This anime seems to be underrated which I totally understand, however, it's a great watch once you get into it.\r\nFirst thing first don't be deterred by the first episodes. It introduce a lot of characters right at the episode 1, and give the setting in the form of a documentary. Honestly, it's quite boring, listening to a off voice telling us about the company, giving a short presentation of every students and other details about the universe. The way everything is introduced is bad and it'sunderstandable that people would stop at this point. However, once you get past that, you find a captivating anime about corporation war while you may think with the opening that it's about space ships races.\\n\\n\r\nStory : 9\\n\r\nThe plot resolves around an elite classroom in space engine development which is about to be downsized since it brings no results for their alloted budget. A student is transferred in the class as a boss in other to do the downsizing but the story turn after a few episodes into political schemes, family conflicts, hidden past and romance. Overall, there are a lot of turnabout and cliffhanger which keeps make you want for more.\\n\\n\r\nArt and Sound : Good\\n\r\nNothing especially remarkable in the art. The characters designs are ok and the animation isn't bad. The spaceship aren't too flashy. It's agreeable to watch and I don't see bad points.\\n\r\nThe soundtrack on the other end is very good. The opening by Lay Duce is catchy and quite enjoyable, and the ending by Claris is also good. The OST fit in the situations and are pleasants to listen. I usually don't remember the OST but this one caught my ear. The studio even let you enjoy it by using it in scenes without dialogues.\\n\\n\r\nCharacters : 9\\n\r\nThe protagonists are well developed, with some interesting revelations and changes in their attitude and conduct as the story progress. The others students in the classroom don't have this opportunity but aren't bad. The antagonists are quite good, with a raging psychopath who only ask to be hated (he fulfills his role at least) and a calm and calculating one.\\n\\n\r\nEnjoyment : 10\\n\r\nI enjoyed it very much, the numerous turnabout and the character development keep you on your toes. You may need to pay attention to understand some corporates and political schemes but in the end, the episode is over before you know it.\\n\\n\r\nOverall : 9\\n\r\nYes, this anime is not flawless. Yes, it won't appeal to you if you're not interested in a corporation's interior conflict. I'm probably biased by giving it a 9 when I found the first 2 episodes quite average but this show how much the rest is captivating. It won't fit everyone's taste but I hope that you will give this anime a chance because I loved it.\\n\\n\r\nWorth mentionning : Some people may be turned off right away just by seeing Maruto Fumiaki in the composition, author of the very controversed Saekano. Well, I'm one of those who didn't like Saekano one bit, but I watched this anime without prejudice and it was a good watch in the end.",
            "date": "2015-09-25T16:49:00+00:00",
            "helpful_count": 38,
            "mal_id": 199591,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3718241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Asharynn",
                "username": "Asharynn"
            },
            "url": "https://myanimelist.net/reviews.php?id=199591"
        },
        {
            "content": "This is my first review and I write this because not many saw the best of this season that gave us Nihon. For all haters/fans this is just my opinion and you can think what you want don't be mad and write your own review if you want to critic an anime.\r\n[Story 9/10]\r\nCC Project contains a simple story to understand, a group of students / workers in a company in the future where manufactured rockets.A-tec is the name of the group which tried to carry out his last project and show it to the  company to stay or leave. Like any anime they willhave difficulty in achieving its goals and this is where it gets good, the fact is wanting to finish the chapter keep seeing more and more because you want to know what will happen next or where continuous.I wish i can write more about story to be clear but it would contain spoilers.\\n\\n\r\n[Art 9/10]\\n\r\nArt was very good it suits to many characters and their backgrounds were very distinctive, if there had been such a serious art or a pumpy one  all would be very different.\\n\\n\r\n[Sound 9/10]\\n\r\nIt was fine for me the sound for most of the anime is not a problem, in this case they put it in well and good choice for many of it.\\n\\n\r\n[Character 9/10]\\n\r\nThe characters for me was a 9/10, what I like is that everyone had a role and never despised the secondary or tertiary characters were all there giving and giving to make the best of the anime. I have to admit it was not a 10/10 for the last reaction of Iris, for God Let's face it guys that was not the Iris and to be honest #TeamMisuki pls.\\n\\n\r\n[Enjoyment 10/10]\\n\r\nI enjoyed this anime from Chapter 1, there are few anime that seem bored and start to get very good, I who have spent many days watching anime can say that if you like science fiction and unexpected events this is your anime! Not never let yourself be guided by comments or by this review, I'm just writing what I think and my purpose is not to change your mind whether this anime is good or not.\\n\\n\r\nThis is all guys try to finish this anime otherwise you will never know what i feel watching it! Recommend to give a try and have fun.\\n\\n\\n",
            "date": "2015-09-25T23:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 199623,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3643113.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Masuzu",
                "username": "Masuzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=199623"
        },
        {
            "content": "High school anime is the kind of anime that has taken up most of the seasonal slots as of late.  Since apparently, high school is end all be all for any person's life, it's only fitting to spawn hundreds of them in order to formulate a genre.  To add to this bunch, we have Classroom Crisis, a show about a bunch of stupid but apparently smart kids in a high school-like anime.  And boy, is this one in crisis.\r\nStory: In the far-off future where humanity has spread to every planet in the solar system (yes, even gas giants apparently), Classroom Crisis takesplace on a Japanese settlement on Mars, where a company called the Kirishina corporation takes charge as the frontrunner in rocket engineering thanks to developments to some rather powerful rocket engines.  Here, we have the specialty class known as A-TEC, a small class of incredibly smart high schoolers who are basically smaller, less mature engineers and business people who work for the large corporation .  (Without pay, of course.)  After a near impossible rescue attempt for the new transfer student of the class, A-TEC comes to terms with the fact that due to their wastefulness of their annual budget, that in about six months, their entire class will be disbanded.  And that folks, is the crisis for this series.  \\n\\n\r\nThe story of Classroom Crisis is a Crisis in and of itself; identity crisis, to be more precise.  While the show starts out with a bunch of high schoolers fighting for their right to stay in class (even though it was CLEARLY their own fault for putting themselves into this mess by overspending), Classroom Crisis tries to drag the reader through a story involving the ins and outs of a corrupted business, covering up different schemes, politics (for some god unknown reason), and with just a hint of both romance and attempted murder.  As a result of all of these factors going around, the show tosses the viewer around with the flow of the plot, sometimes dragging you to a place where you don't know what the hell is going on.  \\n\\n\r\nAt the same time with all of these seemingly random plot points going on, Classroom Crisis tries to squeeze in character development which both feels rushed and sometimes completely unnecessary.  Remember that romance bit I mentioned earlier?  For some reason, they sprinkle that in at the end without any indication as how or why any of that came to be.  In addition, the show really doesn't actually focus on its base storyline of A-TEC struggle for existence, mostly focusing on the characters that actually aren't part of A-TEC, aka the weird power struggle that created such a mess of a series.  \\n\\n\r\nIn end end, Classroom Crisis's story was a horrendous piece to watch.  Not only did it not follow to the letter on what it wanted to do, but it also pulled itself in directions that made not only made for a dreadful watching experience, but it also made character importance varied as to who was important and who wasn't, to the point that I personally could care less what was going on since there really isn't any way that you can get a sense as to what is really going on with the people in this series.  Plus, that ending was kind of random, to be honest.\\n\\n\r\nOverview:\\n\r\n-  Generic base idea  (High school show, really?)\\n\r\n-  Shifting story that changed what it wanted to focus\\n\r\n-  Random bits of unnecessary detail  (Seriously, why is there any semblance of romance here?!)\\n\r\n-   Artificial character development  (just seemed kind of forced rather than natural)\\n\r\n-   Random ending\\n\\n\r\nCharacters:  Characters in Classroom Crisis aren't really characters, per say.  Many of them are simply plot devices, or are completely forgotten halfway through because the story shifts in a way that those characters simply become irrelevant after a time.  So, I will attempt to pick out the ones that I assume are the true main characters in the series.  \\n\\n\r\nFirst is Sera Kaito, the teacher of the class of A-TEC.  As an employee of the Kirishina corporation, Kaito is a very smart person when it comes to engineering, but comes a bit short in every aspect.  He's sort of the newbie in the whole scheme of business characters since he is very absent minded about how business practices work, and as such gets very flustered.  Still though, he's a very motivated character that works towards his goal of \"saving A-TEC\", but in the end, there's not really much to his character.  He doesn't change at all in this series and frankly, sort of just derps around half the time due to the various situations that pop up around the whole series.  \\n\\n\r\nAnd then we have Kiryu Nagisa.  As the transfer student of A-TEC and the resident douchebag of the series, Nagisa is a very focused and slightly narcissistic individual who puts his mission first above anything else.  His personality is one that you love to hate.  Because he just barrels into the series and just well, does his job as someone who looks out for the company since A-TEC is really just a waste of time and money.  He is gradually shown to be the \"good guy\" of the series but really, there's nothing substantial about him.  As a character, he artificially changes to the point where he is considered to be a protagonist rather than an antagonist, but at that point, there's nothing about him to even care about.\\n\\n\r\nEveryone else in this series are just plot devices.  The entire group of A-TEC students barely get any role aside from supporting roles in the series, and since the entire show is devoted to the less than average story, any other character in the series really doesn't have much significance aside from this character playing this and having this role, and that character being that because he's this and his basic goal is this.  No one is really past a cardboard cutout of a character and there's no point of knowing who they are because no one is really all that memorable.  \\n\\n\r\nOverview:\\n\r\n-  Less than average cast  \\n\r\n-  Character development didn't make sense\\n\r\n-  Entire cast were basically plot devices\\n\\n\r\nArt: Contrary to the story and characters, the art for Classroom Crisis was decent.  While the characters themselves weren't detailed to the extent of being gloriously animated, the backgrounds and the level of detail in certain things like the rockets were relatively well animated.  But honestly, that's as much as I can say for the artwork.  It was pretty standard all the way through and there really wasn't much to say about it.  \\n\\n\r\nSound: As for the soundtrack, the OP and ED of the series really didn't have much to add to the series.  Out of every track, the OP was probably the best with its heroic sounding tone to it, but it really wasn't all that memorable.  Same thing goes for the rest of the track.  Like the artwork, it's good, but not memorable.  \\n\\n\r\nPersonal Enjoyment: When I first say Classroom Crisis, I thought that this might be quaint little series about a small group of kids or something, but I was dead wrong.  OH, so wrong.  It was to the point that I dreaded even watching the next episode and honestly didn't care about everything that was going on because everything felt so forced to the point I didn't give a crap whether or not the classroom was saved.  Because even though the whole corporation was corrupted and hellbent on getting money wherever they wanted to, it's still YOUR goddamn fault that you put yourselves to the point of getting yourselves kicked out and/or out of a job.\\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nNo, not really.  There wasn't anything to like about it because the show played itself out so horribly in numerous aspects.  As it was made to be a story based anime due to its lack of focus on its characters, I expected the show to at least create a cohesive story, which it didn't.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nIf there's anything that I really don't like about this anime personally, it has to be the BS plot twists and romance in the show.  I also don't like any of the characters at all, and I think that even thinking that any of them were half decent characters would be a mistake.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nThis show is a crisis in and of itself.  There's nothing significant about it other than its mess of a plot and its inability to properly tell a story.  Sure, you get some semblance as to what is going on, but not enough for you to know that is happening on an episode by episode basis.  Hell, two characters fall in love for some reason even though you only see them alone with each other for a grand total of 3 scenes.  I would not recommend this anime, at all.",
            "date": "2015-09-25T16:59:00+00:00",
            "helpful_count": 10,
            "mal_id": 199594,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=199594"
        },
        {
            "content": "I WILL JUST WRITE THE REASON WHY YOU MUST WACTH THIS ANIME:\r\n-You addicted to anime, yet you bore of typical school anime. You should watch it to refresh your mind.\r\n-Realist and logical male lead. Some typical anime have nerd, otaku, unrealist, talkaktive, and passive male lead character. But, in this series, the MC has strong personality, ambitious, and mature mind set. (It's like Shiba Tatsuya mix Hachiman)\r\n-YOU SEARCH FOR RELATIONSHIP DEVELOPMENT. There's no romance genre in this series, but from what I saw, there's a minor romance between MC and heroines. Yes, add \"s\", because there's 2 possible lover for MC, and those two wasbest friend. The MC not a bastard guy who not sensitive with romance, he handles those 2 fairly, so they dont break their friendship because of a guy.\\n\\n\r\n-Serious conflict, but carefree characters. Many conflicts in this series choose serious ways, but almost all characters handle those conflict with smile, trust, and working together to overcome troubles.\\n\\n\r\nThat's all the reason why you must watch this series. This 7,11 mark is bullshit. I think some guys who gave it mark not an anime addict person, so they still not bore in some mainstream anime.",
            "date": "2018-09-08T21:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 288515,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5310625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/El-Satrio",
                "username": "El-Satrio"
            },
            "url": "https://myanimelist.net/reviews.php?id=288515"
        },
        {
            "content": "My first review so don't hurt me too much okay?\r\nGenre: Slice of Life, Sci-Fi\r\nWhen i first came across Classroom Crisis i thought to myself: Hey the artwork looks good! lemme watch it for a little bit. So i went to MAL and naturally i saw bad/mediocre reviews about it.  this got me to be really scared, since i didnt want to watch a anime that would eat away my brain cells, but boy, am i glad that i didnt drop it, so lets get to the actual review.\r\nStory: 7 (MAL rating), 7.5 (my rating)\r\nto be honest, along with some people, i found the introductionto this anime to be average. Like too much talking. ugh. But it helps contribute to what happens later in the story. But as the show progresses, the show stops being boring and becomes rather interesting! \\n\\n\r\nThe story is basically about a wonder group called A-TEC thats in a verge of being downsized (ded'd) because of an incident that managed to destroy 15 billion dollars in a single day. Such amaze, not even I could do that! The plot is pretty straightforward so those who dont like to think too much while watching can enjoy this anime pretty nicely. Its a casual anime so its pretty fine.\\n\\n\r\nArt: 9 (MAL rating), 9.5 (my rating)\\n\r\nwhat actually GOT me into this anime was the artstyle. Like seriously, if an anime has mediocre art ill be like 'nope skipping it cya'. Well, this was to be expected from the same studio that brought to us that adorable piece of anime called Oreimo. Really nice ones. The artstyle was also consistent. That means everything is proportional. A good example of bad animation would be Rail Wars' episode 1. Aligning eyes are to hard for you? hah. no. I'd rather have the colors to be a bit more vivid tho.\\n\\n\r\nSound: 9\\n\r\ni think i had an eargasm when i first heard the OP. the BGM was outstanding too. Not much to say here, other than me writhing on the floor. dang that music is great.\\n\\n\r\nCharacter: 7\\n\r\nAs an anime with decent plot and a generous 13 episode limit, i wished they would elaborate on the other A-TEC members. They elaborated a good portion of Mizuki, Iris and Nagisa to a point where i loved all 3 of them, so its all good. It was too be expected though, since they were the main characters. But still.\\n\\n\r\nEnjoyment: 8\\n\r\nit wouldve gotten a 9 for me if the intro was a bit better. But the rest of the anime got really interesting, so im giving it a 8.\\n\\n\r\nOverall: 8\\n\r\nSometimes people dont look at the animes that isnt a sequel like Non Non Biyori, WORKING!!! or adaptations such as God Eater, or manga adaptations such as Gakkou Gurashi. Classroom Crisis gets overshadowed by all these big anime titles, but i encourage you. Pick this series up and you wont be disappointed. \\n",
            "date": "2015-10-02T06:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 200331,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4790692.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yuniAnxi",
                "username": "yuniAnxi"
            },
            "url": "https://myanimelist.net/reviews.php?id=200331"
        },
        {
            "content": "This show proved to be the biggest surprise for me this season, one which I'm happy to say ended very well.\r\nI won't bring any spoilers beyond the general trends of where the episodes head.\r\nThe first few episodes give a very strong slice-of-life comedy drama vibe. It seems like that will be the trend for the whole series, which would make it a rather simple, \"done-before\" anime.\r\nHowever, even from the very first scene, the writers slowly began to change the trajectory of the story. Bits and pieces and hints are strategically placed and begin to grow: corporate intrigue; complex backstories; mysteries and secrets; hidden parts ofcharacter personalities; and so on.\\n\\n\r\nThey continue to build up until they start to reach a tipping point, which drags the whole show into a new direction. With a well-placed twist and glimpses at deeper characterization, the show is brought to a good climax and ends on a hopeful note for a second season.\\n\\n\r\nIt should be noted that this is very happily free of a lot of over-used and aggravating tropes. Nowhere do we see some of the romance tropes that make the reader sigh of disappointment, nor do we have horribly annoying characters. Even the presence of some tropes are used for humor, and work well enough.\\n\\n\r\nWhile this isn't an incredible masterpiece, it certainly is a good show. I give it 9/10 for the sake of being a show I thoroughly enjoyed watching, and hope eagerly for a second season.\\n\\n\r\nStory: 9/10. The twists were well-placed and the plot flowed in an interesting manner. Some might think the beginning lags, but I actually find the contrast of the beginning episodes with where it goes as one of the better points of the show. I like the surprise and slow sinking feeling you get as the show progresses from slice-of-life to something deeper.\\n\\n\r\nArt: 9/10. I enjoy the art. The character designs are neat; emotions are well expressed; locations are well-drawn; I have no complaints.\\n\\n\r\nSound: 9/10. The sounds always fit the environment. I don't have any tracks that especially stick with me, but they fit the mood well.\\n\\n\r\nCharacter: 10/10. For spoilerish reasons, I can't say why, but several characters were very well developed by the end. I quite enjoyed them.\\n\\n\r\nEnjoyment: 10/10. Slow in the beginning, but that only added to the enjoyment as the show progressed. It always moved uphill, ending on an excellent note.\\n\\n\r\nOverall: 9/10. A very good show.",
            "date": "2015-09-25T19:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 199603,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/agentyoda",
                "username": "agentyoda"
            },
            "url": "https://myanimelist.net/reviews.php?id=199603"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nEvery year, my family and I go to the cottage we have up north. We ride on the pontoon, we go to the local ice cream store, and we sit around the campfire making s’mores. These separate events are fun, but what makes them so awesome is getting to spend them with my family.\r\nI remember one night when Craig, a cousin of mine, brought a telescope with him. It was a clear night, allowing the stars to brightly shine against the dark backdrop. He had been practicing viewing objects in outer space, and, by thatpoint, he could consistently find Saturn. So he set up the telescope, aiming the device at what looked like to me some arbitrary spot in the sky.\\n\\n\r\nWhen I peered through the scope, I saw a tiny, beige dot. It was Saturn. I was amazed to see this celestial object thousands of miles away mere inches from my eye. From that night onward, I learned to respect outer space, more so than I had ever previously done before.\\n\\n\r\nClassroom Crisis is an anime that likewise focuses on outer space, and contrary to its name, this anime is certainly not a crisis.\\n\\n\r\nSTORY\\n\\n\r\nClassroom Crisis initially does not seem as if it will do much. The setting is a school. The main group is a club. Their work is bland. And, honestly, the first three episodes are difficult to get through.\\n\\n\r\nThis difficulty arises from two areas. The first area is the tameness. “Nothing happens” in the beginning because the anime more or less sets up its world. What A-TEC is, which big players are involved, and why any of this matters. It is a lot of explanation, albeit necessary explanation. The second area is the constant negativity. Besides the occasional comedic relief, Classroom Crisis’s first three episodes come off as very unfair. Absolutely nothing is going right for Kaito, Mizuki, and the other members: their budget is cut, their facilities are shut down, and their team breaks away from itself.\\n\\n\r\nThis is what makes episode five an oddity. On the one hand, the beach and the bathhouse stereotypes come off as out-of-place within the anime given the outer space and political motifs. On the other hand, there are reasons for this episode to exist, such as sparking Iris’s recovery from her amnesia and Mizuki witnessing Nagisa’s scars. But the biggest reason is to give the audience a bit of fun; the vast majority of the anime up until this episode was filled with that aforementioned negativity.\\n\\n\r\nRegardless, getting through the first half does pay dividends. The political machinations behind the scenes start to make sense once Nagisa’s actions start to shake up the field. The plot twist that was cleverly concealed is made known. And the true reason for why Kirishina Corporation pursued A-TEC so heavily finally surfaces.\\n\\n\r\nThe narrative unfolds itself following its slower start, revealing what Classroom Crisis does best: conflict and resolution. Many of the conflicts within the show are small – rushing to make a deal, fighting off bad guys on a spaceship – while others are huge, existing across much of the season – the dismantling of A-TEC, Iris’s newfound fear. But regardless, the conflicts are always filled with purpose, giving the anime a lot of untold strength.\\n\\n\r\nAnd the same can be said for the resolutions that the anime constructs. Each resolution provides closure for the audience, makes sense in the context of the story, and completes the conflict that was created beforehand. Since the resolutions achieve success across all of these levels, they make for satisfying conclusions to the anime.\\n\\n\r\nThe ending makes this clear. The anime incorporates a lot of full-circle framing to “return the story to the beginning” while also providing a lot of satisfaction in its conclusion. For example, the group brings Sasayama back on as the executive of A-TEC, and the final bit of drama matches the first bit of drama – rescuing Nagisa from a harrowing predicament. But it is Kaito and the gang dissolving A-TEC of their own volition that caps off the anime in as perfect a way as possible.\\n\\n\r\nInterestingly, the anime has other parts to it that go unexplored, such as the SWINPR races and the other civilizations on Mars and elsewhere. Classroom Crisis ignores these parts because it understands that they are not the point. They add to the setting, but they are not what is important to the show. Purposely ignoring these extra bits puts more emphasis on the plot and the conflicts and the characters which in turn strengthens these different parts.\\n\\n\r\nAnother of these parts is the themes, one of which is about learning to rely on others. The major plot points – Nagisa against the Kiryu family and Iris against her fears – follow characters who try to do it all on their own. They only triumph when they start to rely on the people around them. A-TEC also embodies this idea; they save themselves through their support for each other.\\n\\n\r\nClassroom Crisis’s most prominent theme, the futility of revenge, carries the most weight. Nagisa’s words work best here: “Revenge is only carried out by fools.” This is seen with both Nagisa and with A-TEC. The former has an entire subplot dedicated to exacting revenge against the Kiryu family, revenge that ultimately fails. The latter does not seek revenge but instead vies to help themselves, help that ultimately succeeds. And it is not until Nagisa drops his revenge and starts relying on those around him that he starts to see success, too.\\n\\n\r\nTaking both of these themes together gets at the main message: revenge will get one nowhere, but friends will take one everywhere.\\n\\n\r\nANIMATION\\n\\n\r\nThe artistic direction for Classroom Crisis is, unfortunately, not that impressive. The anime takes place within the same set of locations, namely the A-TEC hangar, the academy, and the headquarters for Kirishina Corporation. This is not to say that art is subpar but rather there is not a whole lot of detail. This goes the same for the lighting and the camera work, both of which are lacking attention.\\n\\n\r\nThe same can be said for the anime’s actual animation. The anime is filled with a lot of talking, meaning the characters hardly see extensive movement. There are specific scenes where this is not true, such as the ones involving Angelina due to her combat capabilities and Iris due to her spaceship flying. But the majority of the anime is not wholly concerned with intricate animation. Like the art, this is not to say that the animation is subpar but instead passable and only passable.\\n\\n\r\nOne of the most interesting tactics that Classroom Crisis uses is the comedic way of drawing its characters. Sparingly, the anime likes to exaggerate the facial features of its characters – specifically the eyes and the mouth. Because this tactic is so infrequent, when it does happen, it adds a considerable amount of comedic value to the anime, giving the show higher strength in this department.\\n\\n\r\nThe character designs are likewise a positive. Mizuki in particular has a wonderful design. Her long hair with ponytail contrasts with her tomboyish work clothes, but it is her larger-than-normal eyes that accentuate her attractiveness the most. Iris’s design symbolizes her personality: her purple hair (a cold color), her expressionless face (no emotion), and her blue-and-white jumper suit (cold and plain colors) match her calm persona. And the other members of A-TEC look unique within the show without treading into goofy-hair and ridiculous-fashion territories.\\n\\n\r\nCHARACTERS\\n\\n\r\nAnother strong aspect of Classroom Crisis is its characters. A large portion of the cast is mostly there for simple purposes. But Mizuki, Kaito, and Iris, and especially Nagisa, have a lot of importance and a lot of clout throughout the season.\\n\\n\r\nStarting with Mizuki, she is not a character that can necessarily be described as having a lot of development. She is the younger sister to Kaito Sera. She has the looks, the brains, and the personality. The latter is what makes Mizuki who she is: she leads the club with a smile on her face and optimism in her heart. So it is not all that surprising that she starts to take an interest in Nagisa, a man whose mannerisms and persona opposes Mizuki’s completely. Using a cliché, “opposites attract.”\\n\\n\r\nAnd that is what happens. Mizuki continues to try to understand Nagisa, learning about his troubling past while becoming closer to him. At some point, she realizes that her curiosity is no longer a fleeting feeling but instead love for the man who tries so hard and does so much.\\n\\n\r\nMizuki does not just help Nagisa, though. She takes care of her brother at home, she is best friends with Iris, and she leads the rest of A-TEC in a poised and confident manner. In this way, she is reminiscent of her brother since she is always looking out for everyone else. (They are definitely siblings.) More than just being helpful, she is the ideal side character because she does not steal the limelight from those that need it most – namely Iris and Nagisa – but rather increases said light’s intensity.\\n\\n\r\nAs was said, Kaito is similar, although he does not connect with the other characters on an individual basis. As A-TEC’s teacher, Kaito makes it his mission to give the kids he mentors the resources they need to accomplish the tasks they set out to do. He is a bit scatterbrained despite being a genius (or perhaps because he is a genius), but his heart is always in the right place. He puts his students and his customers first, aiming to make the people around him as happy as they can be.\\n\\n\r\nHe tries. He tries a lot. Usually he fails, but Kaito never gives up. This trait is what makes Mizuki and the rest proud of him, and it is this trait that gives his character strength. When everything is falling apart, they know they can turn to Kaito to make something happen. And he does, time and again. In the end, he is the one that delivers the final presentation, and, thanks to his words, Kaito rallies A-TEC and dumbfounds the enemy, proving that he is more than just a girlfriendless, twenty-three-year-old nerd.\\n\\n\r\nWhere the characters really start to shine is with Iris. Iris’s characterization is admittedly a bland one: she is the emotionless type who has an immeasurable love for Mizuki. Iris has nothing notable about her with the exception of one detail: she is an ace pilot. And that is all she is for roughly six episodes.\\n\\n\r\nAt the halfway marker, Iris becomes unable to fly – a poetic dilemma if there ever was one. Her conflict coincides with her amnesia, giving her the chance to slowly recollect who she had been many years ago. To the point that she fully comes to understand her origins, adding to the suspense and plot of the show.\\n\\n\r\nAs the anime nears its conclusion, she has a heart-to-heart with Mizuki, she musters the courage to fly once more, and she “reunites” with Nagisa. Her full character arc not only allowed her to grow as a person but also allowed her to, like Kaito, be more than just the characteristics that defined her. That is, she became a well-rounded character.\\n\\n\r\nWithout a doubt, the best character in Classroom Crisis is Nagisa – this is to be expected given that this anime is more or less a story centered on him. Nagisa, in the beginning, is nothing short of a jerk, being mean towards the other characters indefinitely. When not hounding A-TEC, Nagisa has a complicated relationship with his brother, Yuji, a relationship that is far from savory. He also focuses on nothing but his work, foregoing fun in favor of fortune.\\n\\n\r\nFortunately, Nagisa starts to open up the more time he spends with Mizuki, Kaito, and the rest of A-TEC. He recounts the physical and mental abuse he received at the hands of Yuji, forming the basis for the revenge he seeks. He starts to work with A-TEC, helping with the cultural festival, seeing their kindhearted nature when they help to rescue Angelina, and thinking about them as friends rather than foes.\\n\\n\r\nDespite his changes, Nagisa lets the fires of revenge for Yuji and his other brother, Kazuhisa, consume him, betraying A-TEC and his newfound friends. And after all his revenge seeking, he loses spectacularly.\\n\\n\r\nThe aftermath of his downfall ultimately changes Nagisa for the better. His beautiful moment with Mizuki lets him know that he does not have to struggle alone. His predicament with Yuji lets him (however slightly) reconcile with his brother. And his final words towards Kazuhisa lets him prove to everyone that he has finally become who he always could have been all along.\\n\\n\r\nSo while not every single character within Classroom Crisis is stellar, the ones that need to be are.\\n\\n\r\nSOUND\\n\\n\r\nThe audio of Classroom Crisis is a toss-up, but there is no questioning that the opening and ending themes are well-executed.\\n\\n\r\nThe OP starts with space-like sounds and a quick lyric to set the mood. The track then quickly moves into a strong bout of singing from the vocalists that is fun to follow. As the track progresses, the singing goes higher in pitch to fit the higher tension that the track has built. The track is very similar to the story; the track starts off adequately then continues to improve the further it moves along. And if nothing else, the OP is fun to listen to, both in and out of the show.\\n\\n\r\nThe ED is a mellow track, one that helps to soothe the drama that ensued minutes prior in the episode. It starts and ends the same way as the OP: using eerie, space-like sounds that are cool to hear. The middle of the track starts off slower than its OP counterpart, but the ED truly starts to shine on its own after the halfway point where the track picks up the pace and the lyrics echo. The ED is more or less an homage to the wonderful relationship that Mizuki and Iris share (indicated by the visuals that accompany the track), turning it into the best piece out of all of the music given.\\n\\n\r\nVoice acting sees a mix of both strong and weak performances. Ari Ozawa as Mizuki brings a bubbly voice that captures the girl’s equally bubbly spirits. On the opposite end, Yuu Kobayashi as Angelina is annoying to hear. (Even if that is partially the point.) And Yuuma Uchida as Nagisa is somewhere in the middle since, despite the emotion he puts into his voice, it is a bit too old for the high-school student.\\n\\n\r\nThe remainder of the tracks from the original soundtrack are certainly extensive. Jazz tracks for the carefree moments, spidery tracks for the disturbing moments (Episode five, where Nagisa is talking with Yuji, is an example of this track.), and triumphant tracks for the uplifting moments.\\n\\n\r\nMany more types of tracks exist, such as harrowing, tense ones, haunting, violin ones, and funky, bongo ones. Those, like the first few examples, both fit and work. But none of them particularly standout except for one: the preview track for upcoming episodes. Its funky beat and quickness is pretty catchy. Sadly, one fun track does not a strong OST make.\\n\\n\r\nENJOYMENT\\n\\n\r\nI will admit that, when I first started this one, I was getting ready to harp on it when it came time for me to write about it. Those first three episodes were aggravating because nothing good was happening. “Good” in the sense that our protagonists get some kind of bone thrown their way. But when that bone did was nowhere in sight for so long, I was more than irate.\\n\\n\r\nThen the middle of the anime arrived where events were no longer so one-sided. The odds were still stacked against A-TEC, but now it felt as if the proceedings were “fair.” The comedic, pouting faces were also working, alleviating some of the frustration. Plus, Iris only caring about Mizuki was often funny. Still, I was not wholly captivated by what the anime had in store.\\n\\n\r\nThe most entertaining section of the anime was the last quarter or so. Iris’s dilemma, Nagisa’s kidnapping, and A-TEC dismantling themselves had a lot of emotion in them. And, of course, the kiss between Mizuki and Nagisa was without a doubt the best moment the show offered.\\n\\n\r\nThe anime also gave me the chance to write yet another really long piece, this time about conflict and resolution. I am always appreciative of any anime that gives me the chance to better myself, doing more than just providing a well-put-together anime.\\n\\n\r\nYet I cannot say I liked the show all that much. I did not dislike, but I did not love it, either. The beginning contributes to this feeling, but it is the characters that cause this the most. The characters are well-written, but unfortunately I never took a liking to them, making them forgettable compared to a lot of other anime out there.\\n\\n\r\nClassroom Crisis might not be the best anime ever, but it certainly does a whole lot right. Its story, while unfair in the beginning, is conflicting and complete. Its characters, while not memorable, are handled well throughout the season. And its art and music, while not incredible, have strengths of their own. Saturn is far away, but one does not need a telescope to see just how nice this anime really is.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, strong conflicts and resolutions, alongside strong themes on revenge and reliance, craft an unsurprisingly strong narrative\\n\\n\r\nAnimation: Fine, about average artistic direction, about average actual animation, funny comedic expressions, and above average character designs\\n\\n\r\nCharacters: Great, Mizuki, Kaito, and Iris, and especially Nagisa, are well-written characters that support and develop in their own ways from start to finish\\n\\n\r\nSound: Fine, good OP, good ED, okay OST, okay VA performances\\n\\n\r\nEnjoyment: Fine, the latter half is entertaining, but the frustrating first half and the forgettable characters hurt the experience\\n\\n\r\nFinal Score: 7/10",
            "date": "2016-03-19T04:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 213317,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=213317"
        },
        {
            "content": "[This review contains moderately major spoilers. I've left out major spoilers, however.]\r\nI am glad that I watched this.\r\nI would probably recommend this to others.\r\nI have watched this once, subtitled.\r\nI probably won't watch this again.\r\n---- Positives ----\r\nThe engineers vs. executives battle is moderately interesting.\r\nI'm not used to watching series about internal company struggles, so I thought that this concept was fresh.\r\nThe A-TEC characters seem competent.\r\nAlthough there isn't much detail explaining to what degree and for what reasons they're competent, the A-TEC members each seem to hold their own during their crisis, in the end at least. Some of them had a shaky path, one in particular.Besides proper A-TEC members, Kiryuu Nagisa is also shown to be very competent. Competent male leads can be in low supply at times, so this difference is welcome.\\n\\n\r\nDespite negatives, the series is still entertaining.\\n\r\nAlthough there isn't much impact throughout the series, it was generally entertaining to follow.\\n\\n\r\nGlasses-wearing ninja office lady.\\n\r\nBecause how often do you see that?\\n\\n\r\n---- Negatives ----\\n\\n\r\nA-TEC nonchalantly overcomes an impossible hurdle.\\n\r\nWhen A-TEC's budget is slashed and they're relocated, they pull off the miracle win by still accomplishing their large goal through willpower or unity or something, but even if they technically say that it was difficult, I never felt any sense of difficulty or real urgency. There ~was~ urgency on paper, but it didn't ever feel like there was. This series is similar to Amagi Brilliant Park in format, and in that series, there was a very well demonstrated sense of urgency. There were multiple reasons, in fact, for why they had to fight back, so it was easy to get behind the characters and cheer them on. This series? Not so much.\\n\r\nOpportunity for cancel: None. There was ample time that could have been spent on this instead of other areas of the series, such as all the focus on Kiryuu Nagisa vs. the executives.\\n\\n\r\nThey're fighting for their jobs against a company that apparently wants them all gone.\\n\r\nThe worst case scenario for these characters seemed to be leaving the company that was actively trying to get rid of them. Unemployment isn't fun, but their future at Kirishina Corporation didn't seem like it would be pleasant at the time. \"No! We must persevere and show the company that hates us that they shouldn't hate us.\".\\n\r\nOpportunity for cancel: Yes. Apparently, there was some motivational history behind this company, and the company had access to high-tech machinery, so the fight back may have been mainly reactionary, and not meant as a long-term solution. Regarding that, things work out nicely in the end, helping to counter this negative. The company tries to get rid of them, so they continue trying against the odds, and what happens at the end wraps everything up nicely.\\n\\n\r\nThe romance is out of the blue.\\n\r\nThe romance that sprouts in this series was missing a lot of supporting scenes. Because of that lack of scenes, the romance just sort of happened suddenly, and I didn't feel anything on behalf of either of the characters regarding the romance.\\n\r\nOpportunity for cancel: No. This series could have divided up its time to more effectively support events like this.\\n\\n\r\nShould-have-shot-them-when-you-had-the-chance.\\n\r\nThere's one scene near the end that was terribly unnecessary. It's a moderate spoiler, but it gets resolved unremarkably without any large impact on the plot, so I'll talk about it without mentioning specific characters. Person B is evil and is doing evil things. Person A and crew break in to stop the evil deeds. Person A has Person B cornered. Hooray. Person A is furious and is in a position to strike down Person B. However, Person A decides not to deliver the final blow, saying that the higher-ups will deal with Person B's punishment for doing evil things. Person A then runs off to stop the main evil deed, without binding Person B. Just. Leaves. Person B. There. Does nothing. Surely Person B won't run around and come for revenge. Surely we shouldn't hand them off to someone else to keep an eye on them. So, literally 40 seconds later [or less, depending on when you start counting], Person B sneaks up and shoots Person A. It's just sad. The series doesn't pull stunts like that for all the prior episodes, and then it just has to pull that near the end. Although good for another reason, the oddest part is that it doesn't largely effect the next episode, so I'm not sure why ~that~ event was chosen by the writers.\\n\r\nOpportunity for cancel: No. This series seems to be an original series. Even if it wasn't, and was instead based on a light novel or manga, and this scene was in the original, I'd consider it cringe-worthy enough to write out of the anime.\\n\\n\r\nTime wasn't well-spent.\\n\r\nThis negative relates to the other negatives. Basically, time wasn't divided up effectively, and on top of that, how the types of time slots were spent didn't effectively push the series. So, both high-level scene planning and low-level scene planning could have been better.\\n\r\nOpportunity for cancel: No, but the series was still enjoyable to some degree.",
            "date": "2016-10-14T21:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 231798,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5753100.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sorata861",
                "username": "sorata861"
            },
            "url": "https://myanimelist.net/reviews.php?id=231798"
        },
        {
            "content": "Classroom Crisis is an anime that I've seen get praise this season. Not a lot of praise, but a bit of praise. Thing is, Classroom Crisis is bad. It's objectively not good. I can understand why people could like this, but at the same time, I can't.\r\nStory: 2\r\nClassroom Crisis gives an abysmal attempt at crafting its story. From the beginning, we are confronted with a conflict. Good, plots need a conflict. Couple more episodes, though, and we begin seeing more and more problems arise. There are so many different conflicts and so many different plotlines, it just becomes difficult to keep track of.\r\nThere is amain plot, saving A-TEC from being dismantled, but for some reason, a third of the way through the anime, this gets put on the backburner for 4-5 episodes, and instead we get to focus on these other problems that are thrown at us. Why?? The main plot was good enough. Even Nagisa's revolution is a good subplot to have. If Classroom Crisis was limited to those two, there would not have been a problem. But then Iris has her issue, and then a tacked on romance, and then a plot twist that contributes nothing to the actual plot, in the end. There's also a bunch of different villains, with practically no motivation, and no real contribution to the plot.\\n\\n\r\nWhile the ending, without any spoilers, was an alright conclusion in itself, it was cliche and out of place. Classroom Crisis, which should be more aptly named Classroom Crises, was simply a mess in its storytelling.\\n\\n\r\nArt + Sound: 7\\n\\n\r\nI'm not stickler for art and sound. I don't particularly listen for insert songs or background music, nor do I search for inconsistencies or mistakes in the art. TrySail's OP is actually great, in my opinion, and the art is pretty, to say the least. But there's nothing special about either.\\n\\n\r\nCharacter: 3\\n\\n\r\nThe people in the Kirishina Corporation are so normal. Classroom Crisis is filled with such cookie-cutter cliche characters that I can't even name them all, but I'll name a few notables: Sera Kaito (energetic, somewhat-absent-minded \"mature\" one), Sera Mizuki (also energetic, happy-go-lucky teen girl), Shirasaki Iris (quiet, tough dandere who'd do anything for her friend), Kiryuu Nagisa (evil-for-no-reason, first villain-turned-anti-hero), Angelina-sensei (tough assistant teacher who has a mysterious past (seriously? why? it's never explained)), Kiryuu Yuuji (Nagisa's boss and brother, second villain, no motivation), Kiryuu Kazuhisa (main villain, still no real motivation).\\n\\n\r\nThe rest of the characters can be written off. The only ones I ever really took note of were Nagisa, because you kinda have to, Iris, because I love my stoic danderes, Mizuki, because she has so much presence (also the tiny hint of yuri, that ended up being destroyed), and some student who I couldn't tell if they were a boy, a girl, or neither.\\n\\n\r\nAnyways, the characters suck. A few of them do have some development, but most are left to gather dust.\\n\\n\r\nEnjoyment: 2\\n\\n\r\nI did not enjoy Classroom Crisis. It was too hard to want to follow, there is just nothing to grasp onto with it. It's just terrible.\\n\\n\r\nOverall: 4\\n\\n\r\nClassroom Crisis was bad. The attempt at character development, decent ending, and a somewhat traceable plot kept it floating just under mediocre. Classroom Crisis isn't good, and I don't understand why it gets the praise that it does. On the flipside, Classroom Crisis isn't the worst anime ever released. I guess. Please, do not make a second season. I do not want more of this. I don't care about the Kiryuu's father.",
            "date": "2015-09-28T00:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 199944,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4279261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/sleepwalker",
                "username": "sleepwalker"
            },
            "url": "https://myanimelist.net/reviews.php?id=199944"
        },
        {
            "content": "This anime was a tease: The premise was enough to get me to watch it (or rather, to convince me to TLC it), but it turned out to be as uninteresting as Ben Stein reading the Yellow Pages.  \r\n******************SPOILER WARNING**************************\r\nWhen I saw that the show was going to be set in an advanced engineering high school run by a megacorp on a space colony, that sounded amazing, and when the first episode showed that the program was being shut down and they needed to save it, I thought it was also going to be great!  Love Live was one of my favorite highschool anime, and they did the \"save the school\" plot very well, so I was expecting similar themes running in Classroom Crisis- namely, the class pulling together and making a stand to save the program with their own hands.  Now, this did technically happen sorta, but it was merely a background event, and most of the class did not have much in the way of character development or exploration.  \\n\\n\r\nWhat ended up taking center stage most of the time was the business end of the corporation, intra-family backstabbing at the top of the ladder, and political bullshit less interesting than the US primary races happening now.  Only towards the end did we get some interesting development with our resident anti-hero/anti-villain (he swayed back and forth for a while) essentially finding out that he was a kagemusha for one of the other students, but that didn't even get revealed properly at the end to the other characters, so it was a bit of a waste of a plot point for so few of the characters to even find out about it.\\n\\n\r\n***************SPOILER WARNING OVER************************\\n\\n\r\nWith that said, if I weren't forced to watch it for TLC purposes, I would have dropped this show quicker than a hot frying pan.  It was far too boring most of the time, and we didn't have too many well-developed characters to like.  I give it a 4/10.",
            "date": "2015-09-29T00:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 200052,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1687231.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JAKQ7111",
                "username": "JAKQ7111"
            },
            "url": "https://myanimelist.net/reviews.php?id=200052"
        },
        {
            "content": "I never wrote a review before but I felt like I have to write one for this anime.\r\nMy friend recommended it to me, seeing the average score being 6 to 7 on \r\nseveral sites, I was a bit sceptical. I watched the first 3 or 4 episodes and I honestly thought it was pretty boring and I was about to drop it.\r\nHowevermy friend told me that the beginning is indeed a bit slow, but it's still worth to watch. So I kept watching.\r\nAnd he was right, I ended up actually enjoying it. Even though I'm not into political or spaceship stuff, they managed to makeit quite interesting. \\n\r\nI'm a bit disappointed though, some characters had interesting backstories but they didn't really affect the character itself (looking at you, Nagisa)\\n\\n\r\nI wish there was more character development and more about the backstory. And I did enjoy the romance.\\n\r\nThe anime had great potential but sadly they still kept it kind of generic. Still worth to watch though.",
            "date": "2018-08-31T04:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 287814,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322373.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stinew",
                "username": "Stinew"
            },
            "url": "https://myanimelist.net/reviews.php?id=287814"
        },
        {
            "content": "This is my first fully writen anime review :\r\nClassroom☆Crisis is a very enjoyable show with a slow start\r\nWhen i first start wathing this anime a few months ago , i put it on hold after the first episode because i felt that the story seems too boring . At the start of this month i decide to give this anime a second shot and it did supprise me.\r\nFirst , the frist few episode start of very slow with introducing the character and setting . After that, the story start to unravel with each episode better or as good as before .\r\nStory :8/10\r\nThe story resolves aroundthe elite class A-TEC and the main protagonist \"Kiryuu Nagisa \". The story is good overall but i wish it had more details\\n\\n\r\nArt and sound : 8.5\\n\r\nThe Art is nothing special because the art feels the same as a normal mecha anime.\\n\r\nThe OST was very suited for the anime . The opening and ending was very good .\\n\\n\r\nCharacter: 8\\n\r\nThe mains was very well developed but some other student don't have the air time to shine\\n\r\nEnjoyment and Overall : 10 and 9\\n\\n\r\nThis anime is not perfect but it is a very good show if you gone past the first few episodes . The anime has very good character development although slow paced at first . The sound and art is above the average mecha anime.\\n",
            "date": "2016-06-13T21:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 220716,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5355579.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Luke_Exia",
                "username": "Luke_Exia"
            },
            "url": "https://myanimelist.net/reviews.php?id=220716"
        },
        {
            "content": "!WARNING: THIS REVIEW CONTAINS SPOILERS AND IS VERY BIASED!\r\nTl;dr: If you are like me, and you hate harems and love watching anime's with romance, then i DO NOT suggest watching classroom crisis.\r\nThe story was not all that interesting, basically, they were sprouting out a bunch of weird politics they just made up for the purpose of this anime. \r\nThe sound and art was more than decent, almost the only part that was good.....\r\nThe characters...some of the characters seemed like robots, for example, a group a people just quit the team, but then they came back because they just wanted to see how the team leaderwould do.....i don't know if that makes sense or not, but basically only the main characters had a little development, the rest were just there for props.\\n\\n\r\nNOW!!!!! \\n\r\nThe main point that upset me SO MUCH to give it such a low score: THE ROMANCE\\n\\n\r\nThe romance was a complete JOKE! i would've gave this anime a decent score, but then the ending made this anime completely appalling. They had a  good romance going, and the way it developed was good. But then the other girl regained her memory, and now the anime has become a harem. The man male has 3 girls all wanting him, and the anime just plays it off as a joke.\\n\r\nI felt like i was deceived into watching it just to get the ending i most hated. \\n\\n\r\nEverything in my review is based on my own opinion. Everyone has different opinions, and mine on this anime is not good.\\n\\n\r\nI do not expect everyone to agree. Some people like it, some people don't. And to be honest, I would've given this anime a 6-7 if it weren't for the ending.\\n\\n\r\n I wrote this so to share what i feel about this anime.",
            "date": "2016-01-18T19:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 208882,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4300679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Asuranaru",
                "username": "Asuranaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=208882"
        },
        {
            "content": "This anime is amazing!\r\nEvery episode turned out to be interesting and packed with excitment. The story moves on and develops constantly, and that is great! \r\nIn just 13 episodes, things change and evolve so much, it is impossible not to get entertained. \r\nThe animation quality is great, the characters are not annoying and none of them are a classic copy paste we see these days. They have their own story, passions and deep motivations.\r\nIt evolves in a lot more than just a classroom of students.\r\nOverall a very good anime, it covers sci-fi,action,drama,psychological, political,romance, adventure and it does it in a consistent and excellently measured way.\r\nI'msurprised. I went in to watch it without expecting anything. And it turned out to be a remarcable experience.\\n\r\nDefinitely a great story, that advanced and grew stronger with each episode, something very important that we dont see a lot these days!\\n\r\nI highly recommend Classroom Crisis, totally worth investing your time. \\n\\n\r\nVery entertaining!",
            "date": "2017-02-17T05:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 240753,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3505977.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JAMPS",
                "username": "JAMPS"
            },
            "url": "https://myanimelist.net/reviews.php?id=240753"
        },
        {
            "content": "Much like an actual rocket, this show takes a while to get off the ground before finding its story and really speeding up. What I expected to be a rocket mechanic slice of life veered into Dan Brown and John Grisham territory with corporate intrigue. There are a few plot holes in the story, but nothing so major that the story and character interactions more than make up for them with how well they are done.\r\nIf you can get past the first four or five episodes and liked the politics/economy parts of Log Horizon, definitely check this anime out.",
            "date": "2016-05-19T00:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 218874,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MuffledSilence",
                "username": "MuffledSilence"
            },
            "url": "https://myanimelist.net/reviews.php?id=218874"
        },
        {
            "content": "Classroom Crisis is way too far from any mainstream anime that I've ever seen. The cute design of characters and colorful approach to artstyle could be misleading as to what the core story of the show really is about. This isn't about cool kids building rocket ships, school festivals or teen drama -- nope. CC is heavily leaning on political matters, hungry corporations, and the manipulations taking place behind the scenes. If this is too much for you, then you are definitely correct about not watching this anime.\r\nClassroom Crisis is, plainly put, about a group of bright students working as spaceship engineers, who are toldthat their class is to be downsized due to the extreme expenses of their projects and very recent failure of flying one of their rocket spaceship. The cast is mostly notable for the funny and easy-going teacher, Kaito Sera, his younger sister named Mizuki, and her best friend Iris, the main pilot for projects. Together, they fight against the corporation responsible for them that is trying to shut them down.\\n\\n\r\nStorywise, however, CC is as heavy as politics can go. Most anime featuring students would differ them by design and personality, as well as focus on the teenagers in play. This show does not rely on any of these, considering that A-TEC is only a small dot on the entire story map. The concept of gifted children working on rocketships is just a device to attract younger audience to the anime, in order to make up for what would be a story focusing heavily on politics, money and greed. If you checked out CC because of the cute Mizuki smiling at you with the rainbow over her head, then you'd be in for quite the surprise.\\n\\n\r\nOtherwise, the anime is quite enjoyable. Even if most viewers wouldn't identify with the concept of elections and huge corporations trying to take over the world, sympathizing with the characters is easy since they are quite likeable, and very fun to watch. I personally found the character development to be great, and the romance happened just when it was needed, without taking much space of the plot. Some characters also do a good job keeping the anime funny and relieving, with Angelina-sensei being extremely funny to me whenever she appeared.\\n\\n\r\nArt isn't top notch, but done right and looks good. Colorful, futuristic and really fun. Only a bunch of characters really stand out among the others, but that isn't much of a big issue. It's easier to track the main characters because of that, and relate to them more often than not.\\n\\n\r\nGiving this an 8 for great art, great storytelling, nice characters and overall a story well-thought out. Give this a thought if you're in for something more mature, but also light and not too nerve-wrecking to watch.",
            "date": "2016-10-18T17:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 232025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4912868.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JinKun",
                "username": "JinKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=232025"
        },
        {
            "content": "I like its simple lively pastel-colored arts animation and upbeat music. Who would've thought that there would be a space-themed school anime that also talks about business and politics in a straightforward manner? It really does start slow and I wasn't able to connect with the characters that much that I would've like at least one character that would make a good impression on me or create a memorable moment right from the start, not in the last 3-4 episodes,  However, Classroom Crisis managed to focus on its overall message it wants to present with only 13 episodes.  Thumbs up!",
            "date": "2017-03-22T19:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 243195,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/keyzc",
                "username": "keyzc"
            },
            "url": "https://myanimelist.net/reviews.php?id=243195"
        }
    ],
    [
        {
            "content": "Nice watch. Dependable male lead. Intriguing plot twists and action. Interesting space-age setting with heavy political overtones. \r\nThere were just a few hiccups for me:\r\nThe romance was contrived and devalued some of the characters, though perhaps it's just personal preference.\r\nThe story could have been more detailed overall; perhaps more worldbuilding, character backgrounds and development, and more explanation for each of the happenings. It may have made the romance worthwhile.\r\nWish it had a mature feeling, but at least you get the feeling that the young adults/children are young adults/children.",
            "date": "2015-09-26T00:46:00+00:00",
            "helpful_count": 267,
            "mal_id": 199631,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4851543.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mugisa",
                "username": "Mugisa"
            },
            "url": "https://myanimelist.net/reviews.php?id=199631"
        },
        {
            "content": "I don't normally write reviews, but I feel like I have to for this one.\r\nTHIS SHOW IS WORTH WATCHING. YES IT STARTS SLOW, DEAL WITH IT. GIVE IT A FAIR CHANCE.\r\nDO NOT JUDGE THE SHOW UNTIL YOU'VE FINISHED IT. Seriously, so many people dropped it early and missed out on arguably one of the better shows of the 2015 Fall season.\r\nSTORY (9): It starts off slow and kinda generic. You've seen it before, the big bad greedy corporation wants to cut funding for the hardworking dedicated student team finishes their big project. Corporate representative is sent to be evil and shut them down. Snore.\r\nExcept that'snow what the story is about. The classroom is just a single plot point to carry the show onto the next event, as it starts to pull the camera back to show what's going on with the behind the scenes. It evolves into a corporate and political drama where alliances are formed behind closed doors and plans are carefully laid to move everyone into positions. The story may be about kids building rocketships, but the show is a much more grand scale.\\n\\n\r\nThen you get gut punched by the intense moments, when the trap cards are activated or the action kicks off. It's just at the right level that you stay intrigued during the \"slower\" parts.\\n\\n\r\nArt/Sound (8): It looks and sounds good. I'm not really going to go in depth on it because I don't know what else to say. The animation is smooth, the art is well done, the backgrounds are gorgeous, and the effects are nice. There aren't any out of place sounds and the OP/ED are nice.\\n\\n\r\nCharacter (8): This is where a lot of people get confused. \"Why are there so many characters, who's the main character, why aren't these people getting more attention?\" Whoa there speedy, calm yourself down. There isn't what I consider a single \"main\" character, it's more like two primary characters, two secondary, and the supporting characters.\\n\\n\r\nKaito is the MC of the classroom side, while Nagisa is the MC of the corporate side. Both are important, and there's a solid overlap between them to where it never feels like one is taking the spotlight from the other. Iris and Mizuki both get good development and fill their rolls nicely. I'll warn that if you hate amnesiac characters with a burning passion it might take a little away, but it's not a critical plot point to the overall story. The other students do what they need to and don't get in the way.\\n\\n\r\nRomance is implied (and shown) but not plot critical, just enough to get you intrigued but not so much that it detracts from the story.\\n\\n\r\nEnjoyment (9): Honestly, it's one of the better shows this season. Once the plot got underway I was addicted. The pacing was excellent, the excitement was real, and it ends almost perfectly. All important plot points are wrapped up nicely, though there's just enough hooks that a second season can latch on to. \\n\\n\r\nOverall (9): I'll admit I'm rating it a point higher than it probably deserves, but I really wanted to counter all the negative reviews. Classroom Crisis is a very well done original work that absolutely needs more attention that it got. The slow start really hurt viewership and I feel it's unfair considering just how good the show ended up being. Seriously, you won't regret it, I promise.",
            "date": "2015-09-25T18:16:00+00:00",
            "helpful_count": 92,
            "mal_id": 199599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4008181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xSPYXEx",
                "username": "xSPYXEx"
            },
            "url": "https://myanimelist.net/reviews.php?id=199599"
        },
        {
            "content": "Without giving too much away about my personal life, I work in IT. My job involves tinkering with technology that helps improve people’s lives in ways they didn’t know they were being helped whilst never getting the recognition involved with being involved. Whilst I’m not the most knowledgeable when it comes to what’s current or how it’s implemented or how to use Linux for everyday life, I do know that this is a tough career path and even getting started can be a big pain. Interviews suck, especially when you pass many of them only to fail at the final stretch. The learning process isworse than Dark Soul’s. Multiple failed projects. Corporate decisions screwing you over. The works.\\n\\n\r\nSo I guess in a way, there is some merit in Classroom Crisis portraying that part of my life. Doesn’t change the fact that the show can go fuck itself though. You wouldn’t defend the more boring iterations of the Assassin’s Creed series solely based on how much effort was put into accurately portraying the time periods said games take place in. And it doesn’t help that the show’s actual handling of business politics is about as insightful as a Captain Planet episode - although I’m pretty sure Sly Sludge had more smarts than anyone in this mess.\\n\\n\r\nClassroom Crisis is once again another show following the trend started by Jun Maeda in that it’s written by a sort-of-established visual novel writer who had the same stupid “how hard can it be?” thought all of his predecessors had before proceeding to spontaneously combust himself due to his inability to escape the trappings of his preferred medium, ironically at the same time as Maeda’s own second combustion. But say what you like about Charlotte - I certainly have - at least stuff happens in it! Guy finds he has power, proceeds to abuse it, gets punished, is roped into a strange place, finds out he's part of something bigger, deals with tragedies, reverses a few only to run into something irreversible, sacrifices himself, and ultimately grows as a result even if his brain is too damaged to remember said growth. On the other hand, after three anime, Fumiaki Maruto still hasn’t seemed to grasp the definition of the word “story” at all. And with this show he seems to have forgotten the definition of the word “character” as well.\\n\\n\r\nMaruto’s last anime, Saekano: How To Be A Boring Heroine, shot itself in the foot before it left the starting gate with its intentions to focus on “character” at the expense of “story”, but at least the characters had identity. This time around, ninety percent of the cast don’t even get so much as a description worthy of a gaming instruction manual. They’re just a bunch of faceless gimmicky extras, led by a teacher who couldn’t be any more obnoxious unless he suddenly turned into a racoon who’d give you rabies every time you answered a question wrong. Actually I don’t recall the teacher doing anything in the show at all - let alone teach - unless you thinking talking big counts as doing something (it doesn't). The ratio of things that happen to him as opposed to things that happen by him is so one-sided I don’t think there’s a scale big enough to represent the number on the former side.\\n\\n\r\nThe only character who actually has some semblance of characterization that doesn’t make me want to blow my brains out is the transfer student and arrogant rich boy, Nagisa Kiryuu. And I’m being very generous here, because his characterization is pretty much Chazz Princeton’s from Yu-Gi-Oh GX without the unintentional humor in that he’s a brat from a respected family who gets beaten down by his older brothers because being rich equals being a Lex Luthor wannabe who doesn’t get that the guy was articulate in his evilness. Oh, and he eventually becomes nicer after being forced to work alongside the idiots surrounding him and discovering they’re not all that bad. Fan-fucking-tastic character writing. Next we’ll be showering critical accolades on a character story about a young boy who has his innocence shattered when he discovers that people die in war.\\n\\n\r\nThere’s this girl named Iris aka Rei Clone #4395714, and the show beats you over the head that she knew Nagisa in the past so ham-handedly that it might as well have had a neon sign pointing that shit out over her head every time she so much as appeared. But apart from that, she has absolutely no identity whatsoever and barely interacts with Nagisa or do really anything of significant importance whenever said neon sign isn’t turned on. She’s less of a character and more of “plot mcguffin with tits”. Not that being an emotional girl is any better, as Mizuki (had to look up her name because she’s that forgettable and unimportant to anything going on) discovered the hard way with her “I’m nice and maybe have a crush on this bad boy” routine. Maybe if you didn’t devote large sections of your show to explaining a bunch of political business stuff that I couldn’t give two shits for, I’d actually see these characters as someone worth giving a damn to get invested in.\\n\\n\r\nSo the characters are boring with no relatable or interesting flaws whatsoever, but that doesn’t mean...well actually yes it does mean your show is doomed from the start, especially when your story leans so heavily on them. But even if you had gotten the cast of The Breakfast Club to star in this thing, it’s been awhile since I’ve seen such an awful case of “story driving characters” rather than “characters driving story”. Again, like Saekano - and White Album 2 to a lesser extent - there doesn’t seem to be much of a driving element to Classroom Crisis’s plot at all. As such, I don’t know what I’m supposed to care about or even who’s supposed to be the main hero that holds everything together.\\n\\n\r\nAfter the anime starts with the world’s most boring and throwaway terrorist scenario, Nagisa informs A-Tec upon his rescue that their group is dissolving and they’ll have to go their separate ways, but that’s literally all there is. Why should I care if they dissolve? Will they lose their homes if they do so? What dreams do they want to accomplish by being in A-Tec? What is the importance of building these machines? Well we never know, because the situation is resolved due to some legal loopholes without much of a struggle on the characters’ end and there’s still two-thirds of the anime to go. It’s like watching an episodic family sitcom scenario except stretched to four times the length and without any laughs in it.\\n\\n\r\nWe then spend the next third having the characters live their lives. No seriously, that’s it. They just live their lives with the only central mechanic being Nagisa warming up to them - which as I’ve stated earlier doesn’t count as a story at all and certainly doesn’t have anything challenging about it - whilst dealing with their projects in the most saccharine way possible. They spend graduation by going to a beach, Nagisa has to pass a test, the characters resolve another random hostage situation that to be fair is better executed than the first one, the characters attend a school festival, and all I can think about whilst watching that shit was “wow, I am really bored. Hey, wasn’t there a plot point about the company stealing money for their own personal reasons? Are we ever going to get back to that? I feel like I’m watching Dragon Age: Origins’ ‘epic elements with no central narrative’ plot if it was channeling Dragon Age II’s ‘daily life of some random jackass without making anything actually happen’ snorefest”.\\n\\n\r\nWhat is up with visual novel writers and wanting to assemble all the pieces first before putting them altogether at once anyways? Not only do I not see why you can’t just put them together as you introduce said pieces, but you can still make mistakes when going all in at once when said assembly is complete. This becomes particularly true when Nagisa is forced to make a sacrifice in order to save his friends by involving himself into the company’s inner-workings in the final third of the show, putting him in a position of betrayals and internal danger. Sure it makes no sense why he couldn’t explain his plan to the others or why it took so long to get to some conflict that actually might go somewhere, but I’ll take it if it means we can finally have some actual driving tension to what’s going on.\\n\\n\r\nUnfortunately, even that is badly handled, because the show still won’t install any sense of importance to the proceedings to the point that everything feels padded. We have to sit through long long long scenes where Nagisa has to talk about business politics with characters we don’t know, and they barely affect the plot or involve the characters he’s supposed to be saving, making them incredibly tedious. The only part that resembles an actual driving conflict where stuff actually happens comes right near the end when the show reveals why A-Tec’s money has been withheld from them, along with some more plot twists that were sort of hinted at earlier on involving characters that barely contributed anything before now. Not going to spoil them, but let’s just say I didn’t throw out that Captain Planet reference in the beginning of this review lightly.\\n\\n\r\nSo you want to know what said conflict leads to? What actual character struggles result from their new discoveries? What these sudden plot developments actually lend to the narrative? So the fuck would I. Because Classroom Crisis thinks the best way to conclude itself would be to get sidetracked again with a kidnapping scheme caused by a boring asshole that exists solely to have a convenient excuse to have the characters utilize their individual skills for an agonizingly bad happy ending that was as soulless and token as they come. Mild spoilers: there's literally nothing to that ending but the good guys triumphing over the bad guys with no meaningful sacrifice or journey whatsoever, the shallowly naive message that dreams beat corporate, tons of loose ends that never added to anything, an incredibly tensionless rescue scene capped off with a nauseating and crowbarred-in love triangle element that made me want to hurl vomit all over my computer screen (seriously, what is up with Maruto and his fetish for love triangles?), and LOTS. OF. TALKING. The show literally just assembled the pieces, let them do the work, and then went off to have a milkshake without realizing that the autopilot navigation system has been faulty for months.\\n\\n\r\nThat's got to be the most anticlimactic way to pay off on all your buildup since that godawful Robotics;Notes anime! And speaking of R;N, this show sure seems to take an awful lot from that anime in addition to how it ends, doesn't it? Like the character types, poor pacing, sci-fi setting, saccharine humor, large sections of the plot, and even being written by a visual novel writer who's gone completely downhill after his breakout hit. As the 40-year old virgin's friends said in regards to the only date he's ever had in his life, \"fuck that\".\\n\\n\r\nI don’t usually spend this long on a review talking about the story, but it’s absolute dreadfulness kind of overshadows everything else. But that doesn’t mean everything else gets a free pass. The animation is really terrible, like something from a bad 90s OVA bar the OreImo designs. And the music is bland across the board, from the opening credits to the actual OST. Out of curiosity, I went to Wikipedia to find out what amateur composed this anime’s piece of air and found it to be none other than...the guy who did the triumphant bombast of Haikyuu and Gundam Build Fighter’s soundtracks? As well as Death Parade’s? I soon saw he also did Robotics;Notes’ blandness and it all made sense. Obviously, this is a guy who realized the same thing I did in that there’s no future for anime written by VN writers and vowed to bring that across in his compositions. And if the music guy thinks your anime is shit, who are you to argue?\\n\\n\r\nWe should really start listening to these semi-major anime industry guys more, less we end up with more cartoons like this fucking atrocity.",
            "date": "2015-09-28T04:28:00+00:00",
            "helpful_count": 63,
            "mal_id": 199955,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1147547.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Flawfinder",
                "username": "Flawfinder"
            },
            "url": "https://myanimelist.net/reviews.php?id=199955"
        },
        {
            "content": "This is my first review and I'll just write it to incite some more people to watch this show. This anime seems to be underrated which I totally understand, however, it's a great watch once you get into it.\r\nFirst thing first don't be deterred by the first episodes. It introduce a lot of characters right at the episode 1, and give the setting in the form of a documentary. Honestly, it's quite boring, listening to a off voice telling us about the company, giving a short presentation of every students and other details about the universe. The way everything is introduced is bad and it'sunderstandable that people would stop at this point. However, once you get past that, you find a captivating anime about corporation war while you may think with the opening that it's about space ships races.\\n\\n\r\nStory : 9\\n\r\nThe plot resolves around an elite classroom in space engine development which is about to be downsized since it brings no results for their alloted budget. A student is transferred in the class as a boss in other to do the downsizing but the story turn after a few episodes into political schemes, family conflicts, hidden past and romance. Overall, there are a lot of turnabout and cliffhanger which keeps make you want for more.\\n\\n\r\nArt and Sound : Good\\n\r\nNothing especially remarkable in the art. The characters designs are ok and the animation isn't bad. The spaceship aren't too flashy. It's agreeable to watch and I don't see bad points.\\n\r\nThe soundtrack on the other end is very good. The opening by Lay Duce is catchy and quite enjoyable, and the ending by Claris is also good. The OST fit in the situations and are pleasants to listen. I usually don't remember the OST but this one caught my ear. The studio even let you enjoy it by using it in scenes without dialogues.\\n\\n\r\nCharacters : 9\\n\r\nThe protagonists are well developed, with some interesting revelations and changes in their attitude and conduct as the story progress. The others students in the classroom don't have this opportunity but aren't bad. The antagonists are quite good, with a raging psychopath who only ask to be hated (he fulfills his role at least) and a calm and calculating one.\\n\\n\r\nEnjoyment : 10\\n\r\nI enjoyed it very much, the numerous turnabout and the character development keep you on your toes. You may need to pay attention to understand some corporates and political schemes but in the end, the episode is over before you know it.\\n\\n\r\nOverall : 9\\n\r\nYes, this anime is not flawless. Yes, it won't appeal to you if you're not interested in a corporation's interior conflict. I'm probably biased by giving it a 9 when I found the first 2 episodes quite average but this show how much the rest is captivating. It won't fit everyone's taste but I hope that you will give this anime a chance because I loved it.\\n\\n\r\nWorth mentionning : Some people may be turned off right away just by seeing Maruto Fumiaki in the composition, author of the very controversed Saekano. Well, I'm one of those who didn't like Saekano one bit, but I watched this anime without prejudice and it was a good watch in the end.",
            "date": "2015-09-25T16:49:00+00:00",
            "helpful_count": 38,
            "mal_id": 199591,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3718241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Asharynn",
                "username": "Asharynn"
            },
            "url": "https://myanimelist.net/reviews.php?id=199591"
        },
        {
            "content": "This is my first review and I write this because not many saw the best of this season that gave us Nihon. For all haters/fans this is just my opinion and you can think what you want don't be mad and write your own review if you want to critic an anime.\r\n[Story 9/10]\r\nCC Project contains a simple story to understand, a group of students / workers in a company in the future where manufactured rockets.A-tec is the name of the group which tried to carry out his last project and show it to the  company to stay or leave. Like any anime they willhave difficulty in achieving its goals and this is where it gets good, the fact is wanting to finish the chapter keep seeing more and more because you want to know what will happen next or where continuous.I wish i can write more about story to be clear but it would contain spoilers.\\n\\n\r\n[Art 9/10]\\n\r\nArt was very good it suits to many characters and their backgrounds were very distinctive, if there had been such a serious art or a pumpy one  all would be very different.\\n\\n\r\n[Sound 9/10]\\n\r\nIt was fine for me the sound for most of the anime is not a problem, in this case they put it in well and good choice for many of it.\\n\\n\r\n[Character 9/10]\\n\r\nThe characters for me was a 9/10, what I like is that everyone had a role and never despised the secondary or tertiary characters were all there giving and giving to make the best of the anime. I have to admit it was not a 10/10 for the last reaction of Iris, for God Let's face it guys that was not the Iris and to be honest #TeamMisuki pls.\\n\\n\r\n[Enjoyment 10/10]\\n\r\nI enjoyed this anime from Chapter 1, there are few anime that seem bored and start to get very good, I who have spent many days watching anime can say that if you like science fiction and unexpected events this is your anime! Not never let yourself be guided by comments or by this review, I'm just writing what I think and my purpose is not to change your mind whether this anime is good or not.\\n\\n\r\nThis is all guys try to finish this anime otherwise you will never know what i feel watching it! Recommend to give a try and have fun.\\n\\n\\n",
            "date": "2015-09-25T23:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 199623,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3643113.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Masuzu",
                "username": "Masuzu"
            },
            "url": "https://myanimelist.net/reviews.php?id=199623"
        },
        {
            "content": "High school anime is the kind of anime that has taken up most of the seasonal slots as of late.  Since apparently, high school is end all be all for any person's life, it's only fitting to spawn hundreds of them in order to formulate a genre.  To add to this bunch, we have Classroom Crisis, a show about a bunch of stupid but apparently smart kids in a high school-like anime.  And boy, is this one in crisis.\r\nStory: In the far-off future where humanity has spread to every planet in the solar system (yes, even gas giants apparently), Classroom Crisis takesplace on a Japanese settlement on Mars, where a company called the Kirishina corporation takes charge as the frontrunner in rocket engineering thanks to developments to some rather powerful rocket engines.  Here, we have the specialty class known as A-TEC, a small class of incredibly smart high schoolers who are basically smaller, less mature engineers and business people who work for the large corporation .  (Without pay, of course.)  After a near impossible rescue attempt for the new transfer student of the class, A-TEC comes to terms with the fact that due to their wastefulness of their annual budget, that in about six months, their entire class will be disbanded.  And that folks, is the crisis for this series.  \\n\\n\r\nThe story of Classroom Crisis is a Crisis in and of itself; identity crisis, to be more precise.  While the show starts out with a bunch of high schoolers fighting for their right to stay in class (even though it was CLEARLY their own fault for putting themselves into this mess by overspending), Classroom Crisis tries to drag the reader through a story involving the ins and outs of a corrupted business, covering up different schemes, politics (for some god unknown reason), and with just a hint of both romance and attempted murder.  As a result of all of these factors going around, the show tosses the viewer around with the flow of the plot, sometimes dragging you to a place where you don't know what the hell is going on.  \\n\\n\r\nAt the same time with all of these seemingly random plot points going on, Classroom Crisis tries to squeeze in character development which both feels rushed and sometimes completely unnecessary.  Remember that romance bit I mentioned earlier?  For some reason, they sprinkle that in at the end without any indication as how or why any of that came to be.  In addition, the show really doesn't actually focus on its base storyline of A-TEC struggle for existence, mostly focusing on the characters that actually aren't part of A-TEC, aka the weird power struggle that created such a mess of a series.  \\n\\n\r\nIn end end, Classroom Crisis's story was a horrendous piece to watch.  Not only did it not follow to the letter on what it wanted to do, but it also pulled itself in directions that made not only made for a dreadful watching experience, but it also made character importance varied as to who was important and who wasn't, to the point that I personally could care less what was going on since there really isn't any way that you can get a sense as to what is really going on with the people in this series.  Plus, that ending was kind of random, to be honest.\\n\\n\r\nOverview:\\n\r\n-  Generic base idea  (High school show, really?)\\n\r\n-  Shifting story that changed what it wanted to focus\\n\r\n-  Random bits of unnecessary detail  (Seriously, why is there any semblance of romance here?!)\\n\r\n-   Artificial character development  (just seemed kind of forced rather than natural)\\n\r\n-   Random ending\\n\\n\r\nCharacters:  Characters in Classroom Crisis aren't really characters, per say.  Many of them are simply plot devices, or are completely forgotten halfway through because the story shifts in a way that those characters simply become irrelevant after a time.  So, I will attempt to pick out the ones that I assume are the true main characters in the series.  \\n\\n\r\nFirst is Sera Kaito, the teacher of the class of A-TEC.  As an employee of the Kirishina corporation, Kaito is a very smart person when it comes to engineering, but comes a bit short in every aspect.  He's sort of the newbie in the whole scheme of business characters since he is very absent minded about how business practices work, and as such gets very flustered.  Still though, he's a very motivated character that works towards his goal of \"saving A-TEC\", but in the end, there's not really much to his character.  He doesn't change at all in this series and frankly, sort of just derps around half the time due to the various situations that pop up around the whole series.  \\n\\n\r\nAnd then we have Kiryu Nagisa.  As the transfer student of A-TEC and the resident douchebag of the series, Nagisa is a very focused and slightly narcissistic individual who puts his mission first above anything else.  His personality is one that you love to hate.  Because he just barrels into the series and just well, does his job as someone who looks out for the company since A-TEC is really just a waste of time and money.  He is gradually shown to be the \"good guy\" of the series but really, there's nothing substantial about him.  As a character, he artificially changes to the point where he is considered to be a protagonist rather than an antagonist, but at that point, there's nothing about him to even care about.\\n\\n\r\nEveryone else in this series are just plot devices.  The entire group of A-TEC students barely get any role aside from supporting roles in the series, and since the entire show is devoted to the less than average story, any other character in the series really doesn't have much significance aside from this character playing this and having this role, and that character being that because he's this and his basic goal is this.  No one is really past a cardboard cutout of a character and there's no point of knowing who they are because no one is really all that memorable.  \\n\\n\r\nOverview:\\n\r\n-  Less than average cast  \\n\r\n-  Character development didn't make sense\\n\r\n-  Entire cast were basically plot devices\\n\\n\r\nArt: Contrary to the story and characters, the art for Classroom Crisis was decent.  While the characters themselves weren't detailed to the extent of being gloriously animated, the backgrounds and the level of detail in certain things like the rockets were relatively well animated.  But honestly, that's as much as I can say for the artwork.  It was pretty standard all the way through and there really wasn't much to say about it.  \\n\\n\r\nSound: As for the soundtrack, the OP and ED of the series really didn't have much to add to the series.  Out of every track, the OP was probably the best with its heroic sounding tone to it, but it really wasn't all that memorable.  Same thing goes for the rest of the track.  Like the artwork, it's good, but not memorable.  \\n\\n\r\nPersonal Enjoyment: When I first say Classroom Crisis, I thought that this might be quaint little series about a small group of kids or something, but I was dead wrong.  OH, so wrong.  It was to the point that I dreaded even watching the next episode and honestly didn't care about everything that was going on because everything felt so forced to the point I didn't give a crap whether or not the classroom was saved.  Because even though the whole corporation was corrupted and hellbent on getting money wherever they wanted to, it's still YOUR goddamn fault that you put yourselves to the point of getting yourselves kicked out and/or out of a job.\\n\\n\r\nDid I enjoy this anime?\\n\\n\r\nNo, not really.  There wasn't anything to like about it because the show played itself out so horribly in numerous aspects.  As it was made to be a story based anime due to its lack of focus on its characters, I expected the show to at least create a cohesive story, which it didn't.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nIf there's anything that I really don't like about this anime personally, it has to be the BS plot twists and romance in the show.  I also don't like any of the characters at all, and I think that even thinking that any of them were half decent characters would be a mistake.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nThis show is a crisis in and of itself.  There's nothing significant about it other than its mess of a plot and its inability to properly tell a story.  Sure, you get some semblance as to what is going on, but not enough for you to know that is happening on an episode by episode basis.  Hell, two characters fall in love for some reason even though you only see them alone with each other for a grand total of 3 scenes.  I would not recommend this anime, at all.",
            "date": "2015-09-25T16:59:00+00:00",
            "helpful_count": 10,
            "mal_id": 199594,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=199594"
        },
        {
            "content": "I WILL JUST WRITE THE REASON WHY YOU MUST WACTH THIS ANIME:\r\n-You addicted to anime, yet you bore of typical school anime. You should watch it to refresh your mind.\r\n-Realist and logical male lead. Some typical anime have nerd, otaku, unrealist, talkaktive, and passive male lead character. But, in this series, the MC has strong personality, ambitious, and mature mind set. (It's like Shiba Tatsuya mix Hachiman)\r\n-YOU SEARCH FOR RELATIONSHIP DEVELOPMENT. There's no romance genre in this series, but from what I saw, there's a minor romance between MC and heroines. Yes, add \"s\", because there's 2 possible lover for MC, and those two wasbest friend. The MC not a bastard guy who not sensitive with romance, he handles those 2 fairly, so they dont break their friendship because of a guy.\\n\\n\r\n-Serious conflict, but carefree characters. Many conflicts in this series choose serious ways, but almost all characters handle those conflict with smile, trust, and working together to overcome troubles.\\n\\n\r\nThat's all the reason why you must watch this series. This 7,11 mark is bullshit. I think some guys who gave it mark not an anime addict person, so they still not bore in some mainstream anime.",
            "date": "2018-09-08T21:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 288515,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5310625.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/El-Satrio",
                "username": "El-Satrio"
            },
            "url": "https://myanimelist.net/reviews.php?id=288515"
        },
        {
            "content": "My first review so don't hurt me too much okay?\r\nGenre: Slice of Life, Sci-Fi\r\nWhen i first came across Classroom Crisis i thought to myself: Hey the artwork looks good! lemme watch it for a little bit. So i went to MAL and naturally i saw bad/mediocre reviews about it.  this got me to be really scared, since i didnt want to watch a anime that would eat away my brain cells, but boy, am i glad that i didnt drop it, so lets get to the actual review.\r\nStory: 7 (MAL rating), 7.5 (my rating)\r\nto be honest, along with some people, i found the introductionto this anime to be average. Like too much talking. ugh. But it helps contribute to what happens later in the story. But as the show progresses, the show stops being boring and becomes rather interesting! \\n\\n\r\nThe story is basically about a wonder group called A-TEC thats in a verge of being downsized (ded'd) because of an incident that managed to destroy 15 billion dollars in a single day. Such amaze, not even I could do that! The plot is pretty straightforward so those who dont like to think too much while watching can enjoy this anime pretty nicely. Its a casual anime so its pretty fine.\\n\\n\r\nArt: 9 (MAL rating), 9.5 (my rating)\\n\r\nwhat actually GOT me into this anime was the artstyle. Like seriously, if an anime has mediocre art ill be like 'nope skipping it cya'. Well, this was to be expected from the same studio that brought to us that adorable piece of anime called Oreimo. Really nice ones. The artstyle was also consistent. That means everything is proportional. A good example of bad animation would be Rail Wars' episode 1. Aligning eyes are to hard for you? hah. no. I'd rather have the colors to be a bit more vivid tho.\\n\\n\r\nSound: 9\\n\r\ni think i had an eargasm when i first heard the OP. the BGM was outstanding too. Not much to say here, other than me writhing on the floor. dang that music is great.\\n\\n\r\nCharacter: 7\\n\r\nAs an anime with decent plot and a generous 13 episode limit, i wished they would elaborate on the other A-TEC members. They elaborated a good portion of Mizuki, Iris and Nagisa to a point where i loved all 3 of them, so its all good. It was too be expected though, since they were the main characters. But still.\\n\\n\r\nEnjoyment: 8\\n\r\nit wouldve gotten a 9 for me if the intro was a bit better. But the rest of the anime got really interesting, so im giving it a 8.\\n\\n\r\nOverall: 8\\n\r\nSometimes people dont look at the animes that isnt a sequel like Non Non Biyori, WORKING!!! or adaptations such as God Eater, or manga adaptations such as Gakkou Gurashi. Classroom Crisis gets overshadowed by all these big anime titles, but i encourage you. Pick this series up and you wont be disappointed. \\n",
            "date": "2015-10-02T06:28:00+00:00",
            "helpful_count": 8,
            "mal_id": 200331,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4790692.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yuniAnxi",
                "username": "yuniAnxi"
            },
            "url": "https://myanimelist.net/reviews.php?id=200331"
        },
        {
            "content": "This show proved to be the biggest surprise for me this season, one which I'm happy to say ended very well.\r\nI won't bring any spoilers beyond the general trends of where the episodes head.\r\nThe first few episodes give a very strong slice-of-life comedy drama vibe. It seems like that will be the trend for the whole series, which would make it a rather simple, \"done-before\" anime.\r\nHowever, even from the very first scene, the writers slowly began to change the trajectory of the story. Bits and pieces and hints are strategically placed and begin to grow: corporate intrigue; complex backstories; mysteries and secrets; hidden parts ofcharacter personalities; and so on.\\n\\n\r\nThey continue to build up until they start to reach a tipping point, which drags the whole show into a new direction. With a well-placed twist and glimpses at deeper characterization, the show is brought to a good climax and ends on a hopeful note for a second season.\\n\\n\r\nIt should be noted that this is very happily free of a lot of over-used and aggravating tropes. Nowhere do we see some of the romance tropes that make the reader sigh of disappointment, nor do we have horribly annoying characters. Even the presence of some tropes are used for humor, and work well enough.\\n\\n\r\nWhile this isn't an incredible masterpiece, it certainly is a good show. I give it 9/10 for the sake of being a show I thoroughly enjoyed watching, and hope eagerly for a second season.\\n\\n\r\nStory: 9/10. The twists were well-placed and the plot flowed in an interesting manner. Some might think the beginning lags, but I actually find the contrast of the beginning episodes with where it goes as one of the better points of the show. I like the surprise and slow sinking feeling you get as the show progresses from slice-of-life to something deeper.\\n\\n\r\nArt: 9/10. I enjoy the art. The character designs are neat; emotions are well expressed; locations are well-drawn; I have no complaints.\\n\\n\r\nSound: 9/10. The sounds always fit the environment. I don't have any tracks that especially stick with me, but they fit the mood well.\\n\\n\r\nCharacter: 10/10. For spoilerish reasons, I can't say why, but several characters were very well developed by the end. I quite enjoyed them.\\n\\n\r\nEnjoyment: 10/10. Slow in the beginning, but that only added to the enjoyment as the show progressed. It always moved uphill, ending on an excellent note.\\n\\n\r\nOverall: 9/10. A very good show.",
            "date": "2015-09-25T19:08:00+00:00",
            "helpful_count": 8,
            "mal_id": 199603,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/agentyoda",
                "username": "agentyoda"
            },
            "url": "https://myanimelist.net/reviews.php?id=199603"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nEvery year, my family and I go to the cottage we have up north. We ride on the pontoon, we go to the local ice cream store, and we sit around the campfire making s’mores. These separate events are fun, but what makes them so awesome is getting to spend them with my family.\r\nI remember one night when Craig, a cousin of mine, brought a telescope with him. It was a clear night, allowing the stars to brightly shine against the dark backdrop. He had been practicing viewing objects in outer space, and, by thatpoint, he could consistently find Saturn. So he set up the telescope, aiming the device at what looked like to me some arbitrary spot in the sky.\\n\\n\r\nWhen I peered through the scope, I saw a tiny, beige dot. It was Saturn. I was amazed to see this celestial object thousands of miles away mere inches from my eye. From that night onward, I learned to respect outer space, more so than I had ever previously done before.\\n\\n\r\nClassroom Crisis is an anime that likewise focuses on outer space, and contrary to its name, this anime is certainly not a crisis.\\n\\n\r\nSTORY\\n\\n\r\nClassroom Crisis initially does not seem as if it will do much. The setting is a school. The main group is a club. Their work is bland. And, honestly, the first three episodes are difficult to get through.\\n\\n\r\nThis difficulty arises from two areas. The first area is the tameness. “Nothing happens” in the beginning because the anime more or less sets up its world. What A-TEC is, which big players are involved, and why any of this matters. It is a lot of explanation, albeit necessary explanation. The second area is the constant negativity. Besides the occasional comedic relief, Classroom Crisis’s first three episodes come off as very unfair. Absolutely nothing is going right for Kaito, Mizuki, and the other members: their budget is cut, their facilities are shut down, and their team breaks away from itself.\\n\\n\r\nThis is what makes episode five an oddity. On the one hand, the beach and the bathhouse stereotypes come off as out-of-place within the anime given the outer space and political motifs. On the other hand, there are reasons for this episode to exist, such as sparking Iris’s recovery from her amnesia and Mizuki witnessing Nagisa’s scars. But the biggest reason is to give the audience a bit of fun; the vast majority of the anime up until this episode was filled with that aforementioned negativity.\\n\\n\r\nRegardless, getting through the first half does pay dividends. The political machinations behind the scenes start to make sense once Nagisa’s actions start to shake up the field. The plot twist that was cleverly concealed is made known. And the true reason for why Kirishina Corporation pursued A-TEC so heavily finally surfaces.\\n\\n\r\nThe narrative unfolds itself following its slower start, revealing what Classroom Crisis does best: conflict and resolution. Many of the conflicts within the show are small – rushing to make a deal, fighting off bad guys on a spaceship – while others are huge, existing across much of the season – the dismantling of A-TEC, Iris’s newfound fear. But regardless, the conflicts are always filled with purpose, giving the anime a lot of untold strength.\\n\\n\r\nAnd the same can be said for the resolutions that the anime constructs. Each resolution provides closure for the audience, makes sense in the context of the story, and completes the conflict that was created beforehand. Since the resolutions achieve success across all of these levels, they make for satisfying conclusions to the anime.\\n\\n\r\nThe ending makes this clear. The anime incorporates a lot of full-circle framing to “return the story to the beginning” while also providing a lot of satisfaction in its conclusion. For example, the group brings Sasayama back on as the executive of A-TEC, and the final bit of drama matches the first bit of drama – rescuing Nagisa from a harrowing predicament. But it is Kaito and the gang dissolving A-TEC of their own volition that caps off the anime in as perfect a way as possible.\\n\\n\r\nInterestingly, the anime has other parts to it that go unexplored, such as the SWINPR races and the other civilizations on Mars and elsewhere. Classroom Crisis ignores these parts because it understands that they are not the point. They add to the setting, but they are not what is important to the show. Purposely ignoring these extra bits puts more emphasis on the plot and the conflicts and the characters which in turn strengthens these different parts.\\n\\n\r\nAnother of these parts is the themes, one of which is about learning to rely on others. The major plot points – Nagisa against the Kiryu family and Iris against her fears – follow characters who try to do it all on their own. They only triumph when they start to rely on the people around them. A-TEC also embodies this idea; they save themselves through their support for each other.\\n\\n\r\nClassroom Crisis’s most prominent theme, the futility of revenge, carries the most weight. Nagisa’s words work best here: “Revenge is only carried out by fools.” This is seen with both Nagisa and with A-TEC. The former has an entire subplot dedicated to exacting revenge against the Kiryu family, revenge that ultimately fails. The latter does not seek revenge but instead vies to help themselves, help that ultimately succeeds. And it is not until Nagisa drops his revenge and starts relying on those around him that he starts to see success, too.\\n\\n\r\nTaking both of these themes together gets at the main message: revenge will get one nowhere, but friends will take one everywhere.\\n\\n\r\nANIMATION\\n\\n\r\nThe artistic direction for Classroom Crisis is, unfortunately, not that impressive. The anime takes place within the same set of locations, namely the A-TEC hangar, the academy, and the headquarters for Kirishina Corporation. This is not to say that art is subpar but rather there is not a whole lot of detail. This goes the same for the lighting and the camera work, both of which are lacking attention.\\n\\n\r\nThe same can be said for the anime’s actual animation. The anime is filled with a lot of talking, meaning the characters hardly see extensive movement. There are specific scenes where this is not true, such as the ones involving Angelina due to her combat capabilities and Iris due to her spaceship flying. But the majority of the anime is not wholly concerned with intricate animation. Like the art, this is not to say that the animation is subpar but instead passable and only passable.\\n\\n\r\nOne of the most interesting tactics that Classroom Crisis uses is the comedic way of drawing its characters. Sparingly, the anime likes to exaggerate the facial features of its characters – specifically the eyes and the mouth. Because this tactic is so infrequent, when it does happen, it adds a considerable amount of comedic value to the anime, giving the show higher strength in this department.\\n\\n\r\nThe character designs are likewise a positive. Mizuki in particular has a wonderful design. Her long hair with ponytail contrasts with her tomboyish work clothes, but it is her larger-than-normal eyes that accentuate her attractiveness the most. Iris’s design symbolizes her personality: her purple hair (a cold color), her expressionless face (no emotion), and her blue-and-white jumper suit (cold and plain colors) match her calm persona. And the other members of A-TEC look unique within the show without treading into goofy-hair and ridiculous-fashion territories.\\n\\n\r\nCHARACTERS\\n\\n\r\nAnother strong aspect of Classroom Crisis is its characters. A large portion of the cast is mostly there for simple purposes. But Mizuki, Kaito, and Iris, and especially Nagisa, have a lot of importance and a lot of clout throughout the season.\\n\\n\r\nStarting with Mizuki, she is not a character that can necessarily be described as having a lot of development. She is the younger sister to Kaito Sera. She has the looks, the brains, and the personality. The latter is what makes Mizuki who she is: she leads the club with a smile on her face and optimism in her heart. So it is not all that surprising that she starts to take an interest in Nagisa, a man whose mannerisms and persona opposes Mizuki’s completely. Using a cliché, “opposites attract.”\\n\\n\r\nAnd that is what happens. Mizuki continues to try to understand Nagisa, learning about his troubling past while becoming closer to him. At some point, she realizes that her curiosity is no longer a fleeting feeling but instead love for the man who tries so hard and does so much.\\n\\n\r\nMizuki does not just help Nagisa, though. She takes care of her brother at home, she is best friends with Iris, and she leads the rest of A-TEC in a poised and confident manner. In this way, she is reminiscent of her brother since she is always looking out for everyone else. (They are definitely siblings.) More than just being helpful, she is the ideal side character because she does not steal the limelight from those that need it most – namely Iris and Nagisa – but rather increases said light’s intensity.\\n\\n\r\nAs was said, Kaito is similar, although he does not connect with the other characters on an individual basis. As A-TEC’s teacher, Kaito makes it his mission to give the kids he mentors the resources they need to accomplish the tasks they set out to do. He is a bit scatterbrained despite being a genius (or perhaps because he is a genius), but his heart is always in the right place. He puts his students and his customers first, aiming to make the people around him as happy as they can be.\\n\\n\r\nHe tries. He tries a lot. Usually he fails, but Kaito never gives up. This trait is what makes Mizuki and the rest proud of him, and it is this trait that gives his character strength. When everything is falling apart, they know they can turn to Kaito to make something happen. And he does, time and again. In the end, he is the one that delivers the final presentation, and, thanks to his words, Kaito rallies A-TEC and dumbfounds the enemy, proving that he is more than just a girlfriendless, twenty-three-year-old nerd.\\n\\n\r\nWhere the characters really start to shine is with Iris. Iris’s characterization is admittedly a bland one: she is the emotionless type who has an immeasurable love for Mizuki. Iris has nothing notable about her with the exception of one detail: she is an ace pilot. And that is all she is for roughly six episodes.\\n\\n\r\nAt the halfway marker, Iris becomes unable to fly – a poetic dilemma if there ever was one. Her conflict coincides with her amnesia, giving her the chance to slowly recollect who she had been many years ago. To the point that she fully comes to understand her origins, adding to the suspense and plot of the show.\\n\\n\r\nAs the anime nears its conclusion, she has a heart-to-heart with Mizuki, she musters the courage to fly once more, and she “reunites” with Nagisa. Her full character arc not only allowed her to grow as a person but also allowed her to, like Kaito, be more than just the characteristics that defined her. That is, she became a well-rounded character.\\n\\n\r\nWithout a doubt, the best character in Classroom Crisis is Nagisa – this is to be expected given that this anime is more or less a story centered on him. Nagisa, in the beginning, is nothing short of a jerk, being mean towards the other characters indefinitely. When not hounding A-TEC, Nagisa has a complicated relationship with his brother, Yuji, a relationship that is far from savory. He also focuses on nothing but his work, foregoing fun in favor of fortune.\\n\\n\r\nFortunately, Nagisa starts to open up the more time he spends with Mizuki, Kaito, and the rest of A-TEC. He recounts the physical and mental abuse he received at the hands of Yuji, forming the basis for the revenge he seeks. He starts to work with A-TEC, helping with the cultural festival, seeing their kindhearted nature when they help to rescue Angelina, and thinking about them as friends rather than foes.\\n\\n\r\nDespite his changes, Nagisa lets the fires of revenge for Yuji and his other brother, Kazuhisa, consume him, betraying A-TEC and his newfound friends. And after all his revenge seeking, he loses spectacularly.\\n\\n\r\nThe aftermath of his downfall ultimately changes Nagisa for the better. His beautiful moment with Mizuki lets him know that he does not have to struggle alone. His predicament with Yuji lets him (however slightly) reconcile with his brother. And his final words towards Kazuhisa lets him prove to everyone that he has finally become who he always could have been all along.\\n\\n\r\nSo while not every single character within Classroom Crisis is stellar, the ones that need to be are.\\n\\n\r\nSOUND\\n\\n\r\nThe audio of Classroom Crisis is a toss-up, but there is no questioning that the opening and ending themes are well-executed.\\n\\n\r\nThe OP starts with space-like sounds and a quick lyric to set the mood. The track then quickly moves into a strong bout of singing from the vocalists that is fun to follow. As the track progresses, the singing goes higher in pitch to fit the higher tension that the track has built. The track is very similar to the story; the track starts off adequately then continues to improve the further it moves along. And if nothing else, the OP is fun to listen to, both in and out of the show.\\n\\n\r\nThe ED is a mellow track, one that helps to soothe the drama that ensued minutes prior in the episode. It starts and ends the same way as the OP: using eerie, space-like sounds that are cool to hear. The middle of the track starts off slower than its OP counterpart, but the ED truly starts to shine on its own after the halfway point where the track picks up the pace and the lyrics echo. The ED is more or less an homage to the wonderful relationship that Mizuki and Iris share (indicated by the visuals that accompany the track), turning it into the best piece out of all of the music given.\\n\\n\r\nVoice acting sees a mix of both strong and weak performances. Ari Ozawa as Mizuki brings a bubbly voice that captures the girl’s equally bubbly spirits. On the opposite end, Yuu Kobayashi as Angelina is annoying to hear. (Even if that is partially the point.) And Yuuma Uchida as Nagisa is somewhere in the middle since, despite the emotion he puts into his voice, it is a bit too old for the high-school student.\\n\\n\r\nThe remainder of the tracks from the original soundtrack are certainly extensive. Jazz tracks for the carefree moments, spidery tracks for the disturbing moments (Episode five, where Nagisa is talking with Yuji, is an example of this track.), and triumphant tracks for the uplifting moments.\\n\\n\r\nMany more types of tracks exist, such as harrowing, tense ones, haunting, violin ones, and funky, bongo ones. Those, like the first few examples, both fit and work. But none of them particularly standout except for one: the preview track for upcoming episodes. Its funky beat and quickness is pretty catchy. Sadly, one fun track does not a strong OST make.\\n\\n\r\nENJOYMENT\\n\\n\r\nI will admit that, when I first started this one, I was getting ready to harp on it when it came time for me to write about it. Those first three episodes were aggravating because nothing good was happening. “Good” in the sense that our protagonists get some kind of bone thrown their way. But when that bone did was nowhere in sight for so long, I was more than irate.\\n\\n\r\nThen the middle of the anime arrived where events were no longer so one-sided. The odds were still stacked against A-TEC, but now it felt as if the proceedings were “fair.” The comedic, pouting faces were also working, alleviating some of the frustration. Plus, Iris only caring about Mizuki was often funny. Still, I was not wholly captivated by what the anime had in store.\\n\\n\r\nThe most entertaining section of the anime was the last quarter or so. Iris’s dilemma, Nagisa’s kidnapping, and A-TEC dismantling themselves had a lot of emotion in them. And, of course, the kiss between Mizuki and Nagisa was without a doubt the best moment the show offered.\\n\\n\r\nThe anime also gave me the chance to write yet another really long piece, this time about conflict and resolution. I am always appreciative of any anime that gives me the chance to better myself, doing more than just providing a well-put-together anime.\\n\\n\r\nYet I cannot say I liked the show all that much. I did not dislike, but I did not love it, either. The beginning contributes to this feeling, but it is the characters that cause this the most. The characters are well-written, but unfortunately I never took a liking to them, making them forgettable compared to a lot of other anime out there.\\n\\n\r\nClassroom Crisis might not be the best anime ever, but it certainly does a whole lot right. Its story, while unfair in the beginning, is conflicting and complete. Its characters, while not memorable, are handled well throughout the season. And its art and music, while not incredible, have strengths of their own. Saturn is far away, but one does not need a telescope to see just how nice this anime really is.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, strong conflicts and resolutions, alongside strong themes on revenge and reliance, craft an unsurprisingly strong narrative\\n\\n\r\nAnimation: Fine, about average artistic direction, about average actual animation, funny comedic expressions, and above average character designs\\n\\n\r\nCharacters: Great, Mizuki, Kaito, and Iris, and especially Nagisa, are well-written characters that support and develop in their own ways from start to finish\\n\\n\r\nSound: Fine, good OP, good ED, okay OST, okay VA performances\\n\\n\r\nEnjoyment: Fine, the latter half is entertaining, but the frustrating first half and the forgettable characters hurt the experience\\n\\n\r\nFinal Score: 7/10",
            "date": "2016-03-19T04:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 213317,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=213317"
        },
        {
            "content": "[This review contains moderately major spoilers. I've left out major spoilers, however.]\r\nI am glad that I watched this.\r\nI would probably recommend this to others.\r\nI have watched this once, subtitled.\r\nI probably won't watch this again.\r\n---- Positives ----\r\nThe engineers vs. executives battle is moderately interesting.\r\nI'm not used to watching series about internal company struggles, so I thought that this concept was fresh.\r\nThe A-TEC characters seem competent.\r\nAlthough there isn't much detail explaining to what degree and for what reasons they're competent, the A-TEC members each seem to hold their own during their crisis, in the end at least. Some of them had a shaky path, one in particular.Besides proper A-TEC members, Kiryuu Nagisa is also shown to be very competent. Competent male leads can be in low supply at times, so this difference is welcome.\\n\\n\r\nDespite negatives, the series is still entertaining.\\n\r\nAlthough there isn't much impact throughout the series, it was generally entertaining to follow.\\n\\n\r\nGlasses-wearing ninja office lady.\\n\r\nBecause how often do you see that?\\n\\n\r\n---- Negatives ----\\n\\n\r\nA-TEC nonchalantly overcomes an impossible hurdle.\\n\r\nWhen A-TEC's budget is slashed and they're relocated, they pull off the miracle win by still accomplishing their large goal through willpower or unity or something, but even if they technically say that it was difficult, I never felt any sense of difficulty or real urgency. There ~was~ urgency on paper, but it didn't ever feel like there was. This series is similar to Amagi Brilliant Park in format, and in that series, there was a very well demonstrated sense of urgency. There were multiple reasons, in fact, for why they had to fight back, so it was easy to get behind the characters and cheer them on. This series? Not so much.\\n\r\nOpportunity for cancel: None. There was ample time that could have been spent on this instead of other areas of the series, such as all the focus on Kiryuu Nagisa vs. the executives.\\n\\n\r\nThey're fighting for their jobs against a company that apparently wants them all gone.\\n\r\nThe worst case scenario for these characters seemed to be leaving the company that was actively trying to get rid of them. Unemployment isn't fun, but their future at Kirishina Corporation didn't seem like it would be pleasant at the time. \"No! We must persevere and show the company that hates us that they shouldn't hate us.\".\\n\r\nOpportunity for cancel: Yes. Apparently, there was some motivational history behind this company, and the company had access to high-tech machinery, so the fight back may have been mainly reactionary, and not meant as a long-term solution. Regarding that, things work out nicely in the end, helping to counter this negative. The company tries to get rid of them, so they continue trying against the odds, and what happens at the end wraps everything up nicely.\\n\\n\r\nThe romance is out of the blue.\\n\r\nThe romance that sprouts in this series was missing a lot of supporting scenes. Because of that lack of scenes, the romance just sort of happened suddenly, and I didn't feel anything on behalf of either of the characters regarding the romance.\\n\r\nOpportunity for cancel: No. This series could have divided up its time to more effectively support events like this.\\n\\n\r\nShould-have-shot-them-when-you-had-the-chance.\\n\r\nThere's one scene near the end that was terribly unnecessary. It's a moderate spoiler, but it gets resolved unremarkably without any large impact on the plot, so I'll talk about it without mentioning specific characters. Person B is evil and is doing evil things. Person A and crew break in to stop the evil deeds. Person A has Person B cornered. Hooray. Person A is furious and is in a position to strike down Person B. However, Person A decides not to deliver the final blow, saying that the higher-ups will deal with Person B's punishment for doing evil things. Person A then runs off to stop the main evil deed, without binding Person B. Just. Leaves. Person B. There. Does nothing. Surely Person B won't run around and come for revenge. Surely we shouldn't hand them off to someone else to keep an eye on them. So, literally 40 seconds later [or less, depending on when you start counting], Person B sneaks up and shoots Person A. It's just sad. The series doesn't pull stunts like that for all the prior episodes, and then it just has to pull that near the end. Although good for another reason, the oddest part is that it doesn't largely effect the next episode, so I'm not sure why ~that~ event was chosen by the writers.\\n\r\nOpportunity for cancel: No. This series seems to be an original series. Even if it wasn't, and was instead based on a light novel or manga, and this scene was in the original, I'd consider it cringe-worthy enough to write out of the anime.\\n\\n\r\nTime wasn't well-spent.\\n\r\nThis negative relates to the other negatives. Basically, time wasn't divided up effectively, and on top of that, how the types of time slots were spent didn't effectively push the series. So, both high-level scene planning and low-level scene planning could have been better.\\n\r\nOpportunity for cancel: No, but the series was still enjoyable to some degree.",
            "date": "2016-10-14T21:58:00+00:00",
            "helpful_count": 5,
            "mal_id": 231798,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5753100.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sorata861",
                "username": "sorata861"
            },
            "url": "https://myanimelist.net/reviews.php?id=231798"
        },
        {
            "content": "Classroom Crisis is an anime that I've seen get praise this season. Not a lot of praise, but a bit of praise. Thing is, Classroom Crisis is bad. It's objectively not good. I can understand why people could like this, but at the same time, I can't.\r\nStory: 2\r\nClassroom Crisis gives an abysmal attempt at crafting its story. From the beginning, we are confronted with a conflict. Good, plots need a conflict. Couple more episodes, though, and we begin seeing more and more problems arise. There are so many different conflicts and so many different plotlines, it just becomes difficult to keep track of.\r\nThere is amain plot, saving A-TEC from being dismantled, but for some reason, a third of the way through the anime, this gets put on the backburner for 4-5 episodes, and instead we get to focus on these other problems that are thrown at us. Why?? The main plot was good enough. Even Nagisa's revolution is a good subplot to have. If Classroom Crisis was limited to those two, there would not have been a problem. But then Iris has her issue, and then a tacked on romance, and then a plot twist that contributes nothing to the actual plot, in the end. There's also a bunch of different villains, with practically no motivation, and no real contribution to the plot.\\n\\n\r\nWhile the ending, without any spoilers, was an alright conclusion in itself, it was cliche and out of place. Classroom Crisis, which should be more aptly named Classroom Crises, was simply a mess in its storytelling.\\n\\n\r\nArt + Sound: 7\\n\\n\r\nI'm not stickler for art and sound. I don't particularly listen for insert songs or background music, nor do I search for inconsistencies or mistakes in the art. TrySail's OP is actually great, in my opinion, and the art is pretty, to say the least. But there's nothing special about either.\\n\\n\r\nCharacter: 3\\n\\n\r\nThe people in the Kirishina Corporation are so normal. Classroom Crisis is filled with such cookie-cutter cliche characters that I can't even name them all, but I'll name a few notables: Sera Kaito (energetic, somewhat-absent-minded \"mature\" one), Sera Mizuki (also energetic, happy-go-lucky teen girl), Shirasaki Iris (quiet, tough dandere who'd do anything for her friend), Kiryuu Nagisa (evil-for-no-reason, first villain-turned-anti-hero), Angelina-sensei (tough assistant teacher who has a mysterious past (seriously? why? it's never explained)), Kiryuu Yuuji (Nagisa's boss and brother, second villain, no motivation), Kiryuu Kazuhisa (main villain, still no real motivation).\\n\\n\r\nThe rest of the characters can be written off. The only ones I ever really took note of were Nagisa, because you kinda have to, Iris, because I love my stoic danderes, Mizuki, because she has so much presence (also the tiny hint of yuri, that ended up being destroyed), and some student who I couldn't tell if they were a boy, a girl, or neither.\\n\\n\r\nAnyways, the characters suck. A few of them do have some development, but most are left to gather dust.\\n\\n\r\nEnjoyment: 2\\n\\n\r\nI did not enjoy Classroom Crisis. It was too hard to want to follow, there is just nothing to grasp onto with it. It's just terrible.\\n\\n\r\nOverall: 4\\n\\n\r\nClassroom Crisis was bad. The attempt at character development, decent ending, and a somewhat traceable plot kept it floating just under mediocre. Classroom Crisis isn't good, and I don't understand why it gets the praise that it does. On the flipside, Classroom Crisis isn't the worst anime ever released. I guess. Please, do not make a second season. I do not want more of this. I don't care about the Kiryuu's father.",
            "date": "2015-09-28T00:52:00+00:00",
            "helpful_count": 6,
            "mal_id": 199944,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4279261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/sleepwalker",
                "username": "sleepwalker"
            },
            "url": "https://myanimelist.net/reviews.php?id=199944"
        },
        {
            "content": "This anime was a tease: The premise was enough to get me to watch it (or rather, to convince me to TLC it), but it turned out to be as uninteresting as Ben Stein reading the Yellow Pages.  \r\n******************SPOILER WARNING**************************\r\nWhen I saw that the show was going to be set in an advanced engineering high school run by a megacorp on a space colony, that sounded amazing, and when the first episode showed that the program was being shut down and they needed to save it, I thought it was also going to be great!  Love Live was one of my favorite highschool anime, and they did the \"save the school\" plot very well, so I was expecting similar themes running in Classroom Crisis- namely, the class pulling together and making a stand to save the program with their own hands.  Now, this did technically happen sorta, but it was merely a background event, and most of the class did not have much in the way of character development or exploration.  \\n\\n\r\nWhat ended up taking center stage most of the time was the business end of the corporation, intra-family backstabbing at the top of the ladder, and political bullshit less interesting than the US primary races happening now.  Only towards the end did we get some interesting development with our resident anti-hero/anti-villain (he swayed back and forth for a while) essentially finding out that he was a kagemusha for one of the other students, but that didn't even get revealed properly at the end to the other characters, so it was a bit of a waste of a plot point for so few of the characters to even find out about it.\\n\\n\r\n***************SPOILER WARNING OVER************************\\n\\n\r\nWith that said, if I weren't forced to watch it for TLC purposes, I would have dropped this show quicker than a hot frying pan.  It was far too boring most of the time, and we didn't have too many well-developed characters to like.  I give it a 4/10.",
            "date": "2015-09-29T00:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 200052,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1687231.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JAKQ7111",
                "username": "JAKQ7111"
            },
            "url": "https://myanimelist.net/reviews.php?id=200052"
        },
        {
            "content": "I never wrote a review before but I felt like I have to write one for this anime.\r\nMy friend recommended it to me, seeing the average score being 6 to 7 on \r\nseveral sites, I was a bit sceptical. I watched the first 3 or 4 episodes and I honestly thought it was pretty boring and I was about to drop it.\r\nHowevermy friend told me that the beginning is indeed a bit slow, but it's still worth to watch. So I kept watching.\r\nAnd he was right, I ended up actually enjoying it. Even though I'm not into political or spaceship stuff, they managed to makeit quite interesting. \\n\r\nI'm a bit disappointed though, some characters had interesting backstories but they didn't really affect the character itself (looking at you, Nagisa)\\n\\n\r\nI wish there was more character development and more about the backstory. And I did enjoy the romance.\\n\r\nThe anime had great potential but sadly they still kept it kind of generic. Still worth to watch though.",
            "date": "2018-08-31T04:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 287814,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322373.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stinew",
                "username": "Stinew"
            },
            "url": "https://myanimelist.net/reviews.php?id=287814"
        },
        {
            "content": "This is my first fully writen anime review :\r\nClassroom☆Crisis is a very enjoyable show with a slow start\r\nWhen i first start wathing this anime a few months ago , i put it on hold after the first episode because i felt that the story seems too boring . At the start of this month i decide to give this anime a second shot and it did supprise me.\r\nFirst , the frist few episode start of very slow with introducing the character and setting . After that, the story start to unravel with each episode better or as good as before .\r\nStory :8/10\r\nThe story resolves aroundthe elite class A-TEC and the main protagonist \"Kiryuu Nagisa \". The story is good overall but i wish it had more details\\n\\n\r\nArt and sound : 8.5\\n\r\nThe Art is nothing special because the art feels the same as a normal mecha anime.\\n\r\nThe OST was very suited for the anime . The opening and ending was very good .\\n\\n\r\nCharacter: 8\\n\r\nThe mains was very well developed but some other student don't have the air time to shine\\n\r\nEnjoyment and Overall : 10 and 9\\n\\n\r\nThis anime is not perfect but it is a very good show if you gone past the first few episodes . The anime has very good character development although slow paced at first . The sound and art is above the average mecha anime.\\n",
            "date": "2016-06-13T21:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 220716,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5355579.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Luke_Exia",
                "username": "Luke_Exia"
            },
            "url": "https://myanimelist.net/reviews.php?id=220716"
        },
        {
            "content": "!WARNING: THIS REVIEW CONTAINS SPOILERS AND IS VERY BIASED!\r\nTl;dr: If you are like me, and you hate harems and love watching anime's with romance, then i DO NOT suggest watching classroom crisis.\r\nThe story was not all that interesting, basically, they were sprouting out a bunch of weird politics they just made up for the purpose of this anime. \r\nThe sound and art was more than decent, almost the only part that was good.....\r\nThe characters...some of the characters seemed like robots, for example, a group a people just quit the team, but then they came back because they just wanted to see how the team leaderwould do.....i don't know if that makes sense or not, but basically only the main characters had a little development, the rest were just there for props.\\n\\n\r\nNOW!!!!! \\n\r\nThe main point that upset me SO MUCH to give it such a low score: THE ROMANCE\\n\\n\r\nThe romance was a complete JOKE! i would've gave this anime a decent score, but then the ending made this anime completely appalling. They had a  good romance going, and the way it developed was good. But then the other girl regained her memory, and now the anime has become a harem. The man male has 3 girls all wanting him, and the anime just plays it off as a joke.\\n\r\nI felt like i was deceived into watching it just to get the ending i most hated. \\n\\n\r\nEverything in my review is based on my own opinion. Everyone has different opinions, and mine on this anime is not good.\\n\\n\r\nI do not expect everyone to agree. Some people like it, some people don't. And to be honest, I would've given this anime a 6-7 if it weren't for the ending.\\n\\n\r\n I wrote this so to share what i feel about this anime.",
            "date": "2016-01-18T19:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 208882,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4300679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Asuranaru",
                "username": "Asuranaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=208882"
        },
        {
            "content": "This anime is amazing!\r\nEvery episode turned out to be interesting and packed with excitment. The story moves on and develops constantly, and that is great! \r\nIn just 13 episodes, things change and evolve so much, it is impossible not to get entertained. \r\nThe animation quality is great, the characters are not annoying and none of them are a classic copy paste we see these days. They have their own story, passions and deep motivations.\r\nIt evolves in a lot more than just a classroom of students.\r\nOverall a very good anime, it covers sci-fi,action,drama,psychological, political,romance, adventure and it does it in a consistent and excellently measured way.\r\nI'msurprised. I went in to watch it without expecting anything. And it turned out to be a remarcable experience.\\n\r\nDefinitely a great story, that advanced and grew stronger with each episode, something very important that we dont see a lot these days!\\n\r\nI highly recommend Classroom Crisis, totally worth investing your time. \\n\\n\r\nVery entertaining!",
            "date": "2017-02-17T05:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 240753,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3505977.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/JAMPS",
                "username": "JAMPS"
            },
            "url": "https://myanimelist.net/reviews.php?id=240753"
        },
        {
            "content": "Much like an actual rocket, this show takes a while to get off the ground before finding its story and really speeding up. What I expected to be a rocket mechanic slice of life veered into Dan Brown and John Grisham territory with corporate intrigue. There are a few plot holes in the story, but nothing so major that the story and character interactions more than make up for them with how well they are done.\r\nIf you can get past the first four or five episodes and liked the politics/economy parts of Log Horizon, definitely check this anime out.",
            "date": "2016-05-19T00:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 218874,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MuffledSilence",
                "username": "MuffledSilence"
            },
            "url": "https://myanimelist.net/reviews.php?id=218874"
        },
        {
            "content": "Classroom Crisis is way too far from any mainstream anime that I've ever seen. The cute design of characters and colorful approach to artstyle could be misleading as to what the core story of the show really is about. This isn't about cool kids building rocket ships, school festivals or teen drama -- nope. CC is heavily leaning on political matters, hungry corporations, and the manipulations taking place behind the scenes. If this is too much for you, then you are definitely correct about not watching this anime.\r\nClassroom Crisis is, plainly put, about a group of bright students working as spaceship engineers, who are toldthat their class is to be downsized due to the extreme expenses of their projects and very recent failure of flying one of their rocket spaceship. The cast is mostly notable for the funny and easy-going teacher, Kaito Sera, his younger sister named Mizuki, and her best friend Iris, the main pilot for projects. Together, they fight against the corporation responsible for them that is trying to shut them down.\\n\\n\r\nStorywise, however, CC is as heavy as politics can go. Most anime featuring students would differ them by design and personality, as well as focus on the teenagers in play. This show does not rely on any of these, considering that A-TEC is only a small dot on the entire story map. The concept of gifted children working on rocketships is just a device to attract younger audience to the anime, in order to make up for what would be a story focusing heavily on politics, money and greed. If you checked out CC because of the cute Mizuki smiling at you with the rainbow over her head, then you'd be in for quite the surprise.\\n\\n\r\nOtherwise, the anime is quite enjoyable. Even if most viewers wouldn't identify with the concept of elections and huge corporations trying to take over the world, sympathizing with the characters is easy since they are quite likeable, and very fun to watch. I personally found the character development to be great, and the romance happened just when it was needed, without taking much space of the plot. Some characters also do a good job keeping the anime funny and relieving, with Angelina-sensei being extremely funny to me whenever she appeared.\\n\\n\r\nArt isn't top notch, but done right and looks good. Colorful, futuristic and really fun. Only a bunch of characters really stand out among the others, but that isn't much of a big issue. It's easier to track the main characters because of that, and relate to them more often than not.\\n\\n\r\nGiving this an 8 for great art, great storytelling, nice characters and overall a story well-thought out. Give this a thought if you're in for something more mature, but also light and not too nerve-wrecking to watch.",
            "date": "2016-10-18T17:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 232025,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4912868.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JinKun",
                "username": "JinKun"
            },
            "url": "https://myanimelist.net/reviews.php?id=232025"
        },
        {
            "content": "I like its simple lively pastel-colored arts animation and upbeat music. Who would've thought that there would be a space-themed school anime that also talks about business and politics in a straightforward manner? It really does start slow and I wasn't able to connect with the characters that much that I would've like at least one character that would make a good impression on me or create a memorable moment right from the start, not in the last 3-4 episodes,  However, Classroom Crisis managed to focus on its overall message it wants to present with only 13 episodes.  Thumbs up!",
            "date": "2017-03-22T19:46:00+00:00",
            "helpful_count": 2,
            "mal_id": 243195,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229430.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/keyzc",
                "username": "keyzc"
            },
            "url": "https://myanimelist.net/reviews.php?id=243195"
        }
    ],
    [
        {
            "content": "Classroom Crisis was only a small interest of mine, and when I read some reviews I was not expecting much from the show. I went in with no expectations and at first was really pleased with what I saw. Unfortunately what followed after the first couple of episodes was a roller coaster ride of lack of interest and anger. I do not often find myself thinking that a show didn't live up to its potential. We all can look back on something and see what we think could have been better, or what we might change. Those are just opinions and generally the story pansout in such a way that I don't feel strongly about my own opinions. However I found myself thinking that this show really chose the worst path to follow. With that out of the way lets get into the different sections.\\n\\n\r\nStory 6\\n\\n\r\nThe story is something that really had me torn. You start off with some business people panicking over some kidnap scenario. This is where we switch to what I'm going to call side A of the story. Side A contains a classroom full of rocket scientist and engineers who work on rockets for the school/company which they attend. The kidnapped person at the start of the show was supposed to be a new transfer student into their class. The class decides to rescue the kidnapped kid after they find out about it, and send their new ship and pilot to the place he was being held. The pilot crashes the ship due to technical difficulties and goes inside to find the student safe and sound. \\n\\n\r\nNot a bad way to start, seems a little over the top maybe but not bad. I was hooked when the transfer student who is named Nagisa Kiryuu is frustrated at the pilot for saving him. The start of the next episode shows him back with the class and telling them that he is there to cut their funding and shut them down. This premise was exciting to me. However this story path never gets fully explored, and the story splits itself into two stories. Side A is the class and the genius teacher trying to keep their class alive and build their rocket. Side B is the political/business side story of Nagisa as he does many things.\\n\\n\r\nUnfortunately in my opinion they focused to much into Side A. The classroom's story awas full of odd plot holes and strange behavioral and dysfunctions that only drag you out of the anime to make you think \"Why is this situation allowed to even happen?\". However this side of the story is pretty straightforward. Situations occur and the classroom has to deal with their situation and hopefully save their class by the end of it. \\n\\n\r\nSide B was what I was truly interested in. I love the way they presented Nagisa. I had the Amagi Brilliant Park vibe coming from him and I was drawn to that. Most of the first part of the show however is mostly about  Side A and the odd mixture of student/boss relationship between Nagisa and the class. However as this story line progress's in a less straightforward manner, it allowed for twists to crop up at the end. The last section of the show is dedicated to learning more about Nagisa, the corporation hes working for, the mysterious pilot and many other interesting tidbits of story that involves Nagisa.\\n\\n\r\nI don't want to complain a lot about the story because I feel that if the characters were made better, it wouldn't have been as big of an issue. The story is interesting and the twist's at the end were not outrageous or poorly planned. I felt that the show was paced well and had a solid backbone to build an interesting anime around. \\n\\n\r\nArt & Sound 7\\n\\n\r\nArt was beautiful. The characters and scenery were truly well done. The sound again was decent. Nothing outstanding however nothing terrible either.\\n\\n\r\nCharacters 4\\n\\n\r\nNow we can get into what really makes me frustrated about this anime. Anime is always full of interesting or odd characters. This show however has stupid characters +  stupid interactions.\\n\\n\r\nLets start of with Nagisa. Nagisa seems to be a young genius business man. The second hes introduced he seams intimidating in that leadership fashion. When he does speak or handle a situation you see how well he does it and how fast he does it. His age may make you think he is a novice, but through actions and rumors the viewer finds out he really is amazing at his job. However when he goes to class he is constantly picked on by his classmates/workers. Nobody respects or listens to him and ultimately his position turns into tragic back story character. His role is to learn about friendship, compassion, and begin to heal with the new \"family\" he has joined. This was a let down to me. At first they seemed to be trying to balance the power's between Nagisa and the teacher by having Nagisa weak at school but strong in business and politics and vice versa. This would have been acceptable but then Nagisa just became a worthless tool to progress his backstory and only ever turned back into his original persona to conveniently finish off some business items.\\n\\n\r\nHis classmates consist of Sera Kaito, who is the genius engineer who teaches the class. Sera Kaito is an over excited idiot outside of building rockets. He often thinks something can happen with just saying that he will make it happen and through the show runs into trouble because he has no foresight. Later in the show he does have  fatherly and sagely moments that don't fit him. The other two important characters to mention are Sera Mizuki, who plays as the wizened teenage girl who is to heal Nagisa and also act as the cheerful middle man between Sera and Nagisa. She is cheerful and nosy to the point that you cant help but hate her. She mellows out eventually but by that point its really hard to accept her. Then you have Iris shirasake, who plays into Nagisa's backstory and is really only there for that purpose. She really has no depth at all. Even at the end, with the emotions she posse's you hardly can empathize with her at all. \\n\\n\r\nThen you have the pointless class room fillers. There are about 10 characters in the classroom and they only serve the purpose of being snobby little brats.You start with getting to know a little bit about everybody but it doesn't really matter. Eventually some classmates have a falling out and leave but soon enough they come back and rejoin the others without so much as an apology and the others accept them without a single bit of resentment. Skipping over this amazing showing of human goodness we can talk about what else they do. They constantly bother Nagisa and seem to not have any concept that they are workers. I should say that this in itself wouldn't bother me if it wasn't such crazy amount of harassment. They might have been more interesting if they spent more time developing their odd quirks like the super hacker classmate or the lab coat engineer girl..etc. That how you will have to remember them because that's how little attention these characters get.\\n\\n\r\nOther than these characters you have certain political and business characters and again little is to be said about them. They are there to progress the tragic kid, coming into adulthood story.\\n\\n\r\nIn summary you have insanely annoying characters with little to no development and odd interaction among one another that doesn't really fit into the typical mold of today's society.\\n\\n\r\nEnjoyment 5\\n\\n\r\nI was fully prepared to write a shining review for this anime but I just cant after I finished it. The story has several interesting angels to explore and I cant really complain about it. There are a few plot holes, or possibly things I don't understand about it but again nothing so bad as to detract from the experience. The art and sound are fine enough to watch without being distracted in a negative way. The characters are what kills this anime. Between the odd mood swings and questionable judgment calls from the characters you hardly have enough time to find enjoyment in even some of the more relaxed and smile driven episodes. This anime is not terrible, and I think people should give it a try. \\n\\n\\n\r\nTLDR; Watch it, its not terrible. I think it could have been better, but who am I to judge that.",
            "date": "2015-10-12T21:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 201140,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=201140"
        },
        {
            "content": "Humanity has successfully expanded beyond our fragile blue home and has established colonies throughout the solar system. At the forefront of this gigantic leap for humanity is the Kirishina Group, a Japanese conglomerate that is in no way related to the Buddhist deity. In order to maintain their competitive advantage, the company conducts research on rocket engines through the group A-tec, which happens to be composed of dependable high school students smart enough to be learning rocket science. However, their new transfer student may be troublesome, as he is also their new boss!\r\nClassroom Crisis, regardless of execution, is a differentiated attempt to mix political intrigue,future fantasy, and your ordinary high school setting all in one. Though there are many holes in the setting and execution, it's an entertaining and plot-heavy work. So is it worth your valuable time? If you're looking for a harem, comedy, or deep political intrigue this is not a good match- it's too much of a chimera to satisfy any one of those categories. If you're just looking for a fresh idea and an interesting story, I'd try a few episodes and see if it's a fit.\\n\\n\r\nAnimation:\\n\r\nThis is the first work that I've seen from the relatively new studio Lay-duce, and to be honest I'm not too thrilled. Though the show looks modern and crisp, it definitely isn't a high budget show; I had many gripes about the animation in general. Character lines and backgrounds are all very stingy and plain, and I don't particularly like the styling of the vehicles or mechs either. Furthermore, despite taking place on a colony in Mars, you'd soon forget that it wasn't Earth if not for the occasional space scenes. Really, the only innovative contribution is the nice, flat UIs on the screens throughout the show Animation doesn't fare too well for character designs either, expect a plethora of similar-looking supporting characters. Emotions aren't particularly keen either as our transfer student has fewer expressions than there are fingers on my hand. Mizuki, one of our heroines, helps alleviate his lack of humanity but only slightly.\\n\\n\r\nSurprisingly enough, there are a few attempts to cast the show in a dark aura with some violence and blood. However, just like the introduction sequence where they interleave a company crisis with Mizuki happily putting on her clothes, there just isn't a consistent feeling in the atmosphere. Expect a few decent action sequences, though nothing to really get excited over. Also surprisingly enough, there is more character relationship progress here than in many harems, and you'll get a few kissing scenes. This isn't an ecchi show though so expect some relatively conservative camera angles.\\n\\n\r\nSound:\\n\r\nContrary to the animation, the sound experience is good. The show opens with a fast-paced, pop piece with a palatable melody. The ED though is in a class of its own. The electro-infused song by Claris, famous in my mind for their work on Oreimo, is an extremely catchy and melodic work. The funk-based BGM is slightly above average also with brass infused instrumentation.\\n\\n\r\nThe VA cast does a pretty good job overall though certain lead roles are given to relatively junior seiyuus. Though supposedly a supporting character, Yuu Kobayashi gives the standout performance (and occasional comedic relief) as super accountant Angelina. There are some up and coming VAs as well such as Sora Amamiya, but in this case she's relegated to a rather boring role. If you're a Yui Horie fan, I wouldn't watch this just for her as her role has no more than a scant dozen or so lines.\\n\\n\r\nStory:\\n\r\nThe story is really the melding of two different plots. On the one hand, A-tec is being phased out as Krishima supposedly is attempting to reorganize and diversify its business. Thus, we see a classroom setting in crisis as the students and teacher struggle to cope with budget cuts (but really, is giving high school students billions of dollars really a good idea?) and tease out every possible idea to keep the group together. On the other hand is a rising star in the form of our transfer student. Nagisa, typically a girl's name if you're not too used to Japanese names, is just a magnet for crises be it kidnappings or attempts at political manipulations. As he becomes a student of A-tec, despite not having mastered quantum physics, as well as the boss in charge of A-tec, the members of A-tec are essentially forced to take part in his life's dramas.\\n\\n\r\nThe show follows the two plots in parallel as they become more intertwined and eventually merge before the climax. Though there is one eventual climax, multiple crises throughout the show. The show then finishes off with an open ended conclusion that leaves the possibility for a follow up.\\n\\n\r\nThe overall experience comes across as somewhat mixed. Let's start with the positives. I liked that the show was unique (yes I know there's a transfer student and yes the school setting is overused) in its attempt to combine business, politics, and school life. The overall progression was a bit bumpy but the many plot twists kept my interest level fairly high throughout the show. I also liked that the show wasn't centered around a harem, something way too overused these days.\\n\\n\r\nThere were quite a few annoyances with the story as well though. Despite being labeled as a show about rocket engines, I don't think the story writers were anywhere near qualified enough for the subject. For instance, a \"clean\" school hangar and a NASA clean room are worlds apart. Furthermore, the concept of \"maximum speed\" is meaningless assuming you have a constant source of acceleration in space. Technical competence aside, the story also reused plot elements repeatedly; the most of annoying of which is that characters don't seem to learn. More than once do we see the same character fail to finish off an opponent, only to have that come back to haunt them. Finally, the show just never settles on a mood, is it a happy show about kids enjoying their youth or a dark, somber work about the struggles of a ridiculed family outcast?\\n\\n\r\nCharacter:\\n\r\nUnfortunately, I can't really reward that many points in this section either. The protagonist, Nagisa, is just pitiful, both in his past and in personality. Though distinguished from the majority of nice harem leads, he feels very one-sided in his personality and goals. This makes it feel out of place when he faces defeat or in his rather sudden feelings for other characters. Despite being a supposedly dynamic character, he just isn't relatable or likable. From the start, you pretty much can discern that Mizuki and Iris will be important characters. Mizuki is by far the more likable of the two as Iris is just your typical emotionless sidekick with occasional crazy spasms. Though I liked that there was relationship progress in the show, it did not feel organic at all and was rather rushed. In addition, let's not get me started on supporting characters; you could eliminate over half the characters and accomplish the same experience, and possibly actually give Mizuki and Sera some character exposition.\\n\\n\r\nValue:\\n\r\nThis is an oddball of a show. Despite technically subpar scores in the other categories, it was actually a very enjoyable watch. In the context of a rather mixed bag of a season for me, this show comes out as one of the more distinguished ones. It isn't complicated enough to merit re-watching, and isn't good enough to be memorable in the long run. However, if you have a gap between two other shows that you'd like to fill, this crisis may be a fair candidate, at the very least expect it to be entertaining.",
            "date": "2015-11-04T22:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 202697,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202697"
        }
    ]
]