[
    [
        {
            "content": "\"Cooking is as masculine as judo, kickboxing or tae kwan do. Anyone can fight but it takes a special man to craft the perfect Bolognese sauce\"\r\nQuoted from a manly midget chef...\r\nYou know the first thing that crossed my mind when I read that quote was covering a cow with ketchup then proceed to pound the cow into bolognese sauce. \r\nIm just kidding of course, that isn't call MANLY... that's called animal abuse...\r\nSo chances are if you stumble upon this anime, you're not watching it just to fill up your boring life with some boring junk. No.. You hunt for exotic food on a daily basis.And you need an anime that teaches you the RIGHT way to do it... \\n\r\nWell, introducing Toriko, the only anime currently airing that will not only satisfy that hunger urge but will also teach you how to be more MANLY than you were before.\\n\\n\r\nWhat would you say if I said that World Peace could be obtain if everyone in the world combined their powers to produced the most delicious full course menu in the universe?\\n\r\nYou would probably say \"BURRRRRP!!\" Cause that's how the end of World Hunger sounds like. Now all that's left is the homeless people.\\n\\n\r\n(Now people, feeding the homeless to the hungry would solve those two world problems, but we wouldn't want to resort to cannibalism now do we?)\\n\\n\r\nLet's see how this anime can be used to solve other problems?\\n\\n\r\nProblem (Art)\\n\r\nSo you just opened up an art gallery and you're not raking any cash because an art gallery is partially a public good. (No duh..)\\n\r\nSolution:\\n\r\nOpen up a mini restaurant in your gallery. Watch Toriko (especially the one piece crossover) and get inspiration on drawing animals which apparently looks like it had sex with food and produced offspring. Make your visitors hungry and they'll pay a visit to your mini restaurant for brunch. Problem solved \\n\r\nToriko has a huge variety of animal species, though not as much as Pokemon which has a total of 600++ up to date, but at least some of them are edible and each is designed with it's own unique features. The artwork for Toriko is similar to One Piece. If you like One Piece, then you definitely would love this. If you like Two Piece then go to the toilet... *crickets* Yeah, yeah lame joke... pfft...\\n\\n\r\nProblem (Sound)\\n\r\nSo you work with a bunch of unmotivated voice actors who does english dubs for an anime.\\n\r\nAnd they sound horrible (more than usual anyways)\\n\r\nSolution:\\n\r\nGet them to watch Toriko. The seiyuus for this anime are top notch. They portray their character well in the anime. It's like the directors forced the seiyuus to starve during the recording to make them sound like a bunch of hungry men. What can I say about the opening? One word... \"GATSU!!\" No seriously, it's like getting your guts punched with a thousand fists of manliness.\\n\\n\r\nProblem (Character)\\n\r\nSo you have a son, and he's a wimp. Nothing wrong about that, but he is due to national service soon. And you don't want the other kids to bully him.\\n\r\nSolution:\\n\r\nGet him to watch Toriko. Make him into a man. Toriko is an exampled role model.He says his prayers before and after eating his meal. How often do you see people say their grace before they eat? Not only that, Toriko only kills animals that he deems worthy to be eaten. He does not just willy nilly kill any of God's creation. Only a REAL man could do that.\\n\r\nFor every manly character, there will have to be a less manly guy to enhance the manliness of the main character.\\n\r\nFor Batman, there is Robin. For Sherlock Holmes, there is Dr. Watson. In this case, for Toriko, there is Komatsu. Komatsu has his own set of special culinary abilities that furthur compliments Toriko's manliness. If Toriko was the fork and spoon, Komatsu is probably the condiments. \\n\r\nWhat about the wimpy son problem?\\n\r\nHeck, just show the government his MAL profile that he is currently watching \"Toriko\" He'll be exempted for life.\\n\r\nIn fact, \"Toriko\" isn't really an anime.\\n\r\nThe German government classified \"Toriko\" as \"Handbuch für Männlichkeit\"\\n\r\nTranslation, Handbook for masculinity. Yeah, everything sounds manlier in German.\\n\\n\r\nThe only problem about this anime is that it was further degraded from its masculinity compared to the manga due to a significant degree of censorship. Lower your hopes for gore and blood. On the bright side, with the absence of graphic violence, how kids who haven't hit puberty can watch the anime and start training the the path of manliness...\\n\\n\r\nOverall, as proven above, watching Toriko solves a whole tons of problems. I give this anime a rating of 8. Cause that's the number of packs you'll have after watching this anime. Yes, that's right, 8 packs! One more pack and you can play tick-tack-toe on your abs. How awesome is that? Not as awesome as Toriko though. Tough luck kiddo.",
            "date": "2011-04-12T10:00:00+00:00",
            "helpful_count": 150,
            "mal_id": 35975,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=35975"
        },
        {
            "content": "WARNING: In my Review I go on tangents, but that's just the way I roll because I like barbeque sauce on my chicken nuggets. And don't you forget it.\r\nThere are two reasons that I watch anime:\r\n1) I want to see something with depth that is intellectually stimulating where the characters and story weave a fascinating tale with twists and turns. One Anime that did this for me was Kaiji.\r\n2) I just want to relax and experience an enjoyable adventure with a memorable cast of characters. In this category I mostly look for the theme and eye candy (meaning the quality of the art).\r\nI watch Torikofor the second reason.\\n\\n\r\nI actually tried watching Toriko when it first came out and didn't like it. With this season being one of the worst seasons of anime for me I decided to give Toriko another chance. And I am REALLY glad that I did.\\n\\n\r\nSummary/Review:\\n\r\nToriko takes place during the \"Gourmet Age\" where food is not merely a delicacy but also a sought after commodity. In this world rare and exquisite food exists and is often extremely hard to attain. There are two main factions, the IGO, (which are a bunch of Gourmet Hunters) and an evil group (Bishikokai or something like that) who desire to control the food supply because food is essentially power.\\n\\n\r\nCharacters 8/10\\n\r\nNot the best characters nor the most memorable. However, they do have their moments and grow on you.\\n\\n\r\nStory 9/10\\n\r\nHilarious. It's about food, and food is power.\\n\\n\r\nVisuals 10/10\\n\r\nLooks awesome. Nice fight scenes.\\n\\n\r\nMisc. 10/10\\n\r\nI love the pacing and feel that almost every episode gives me my money's worth rather than feeling cheated and held at gunpoint like with many other Anime.\\n\\n\\n\r\nRandom Thoughts/Comparisons:\\n\r\nI thought One Piece was good. Then I later realized I liked Fairy Tail better. The reason I like Fairy Tail better is because, while very similar, it does not suffer as much from \"Dragon Ball Z syndrome\". One Piece just takes soooo long to get its point across and it drags on and on. It's awesome but the lengthening just dilutes what could be greatness and it's frustrating.\\n\\n\r\nThen I realized I like Toriko better than Fairy Tail. While Fairy Tail's pacing is good, Toriko's pacing is phenomenal. It doesn't drag out arcs. It moves fast and leaves you wanting more rather than hanging for weeks on end (like One Piece).\\n\\n\r\nToriko is stereotypical. It's almost how Dragon Ball Z would be if it centered around food and had ridiculously enjoyable pacing. As a matter of fact, Toriko is what I always wished Dragon Ball Z had been.\\n\\n\\n\r\nConclusion:\\n\r\nThe art is beautiful and imaginative. Some of the monsters are huge and give off vibes of epicness. It's just such an enjoyable Anime to chill back and watch. Turn your brain off and just enjoy mindless action with its beautiful visuals. If you try and take it seriously you will definitely not enjoy it. But if you don't take it seriously you are truly in for a full course meal...\\n\\n\r\nP.S. \\n\r\nI usually don't care to write reviews but I hope that a few people read this and give Toriko a chance because it doesn't get the credit it deserves. I was one of the many who overlooked this gem.\\n\\n\r\nIf Komatsu ends up getting Gourmet Cells I will say this is the best Anime ever!",
            "date": "2011-11-10T21:01:00+00:00",
            "helpful_count": 87,
            "mal_id": 47243,
            "reviewer": {
                "episodes_seen": 31,
                "image_url": "https://cdn.myanimelist.net/images/userimages/914197.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KidCaramel",
                "username": "KidCaramel"
            },
            "url": "https://myanimelist.net/reviews.php?id=47243"
        },
        {
            "content": "The story of Toriko takes place in the Gourmet Age. In that world people live to eat. Wars can erupt over delicious food.  The main character Toriko and his partner Komatsu travel around the world to find exquisite ingredients. Toriko hunts, his partner cooks. This is the basic premise and I’ll be honest, it sounds stupid. Teenage heroes of other anime are trying to save humanity, planets, their family and friends from cool-looking edgy evil forces. But Toriko, a twenty five years old adult male, is chasing after food. It isn’t primarily a comedy anime to excuse the premise. Although soon it becomes clearthat evil people can use rare food for their evil ends, it still isn’t enough to make most viewers take Toriko seriously. \\n\\n\r\nI’d like people to watch it but I will be honest. Toriko is mediocre at best. Despite its simple and not-too-intelligent premise, the story unfolds itself and turns out to be very complicated. For the first time in the history of shounen anime, the main character’s voracious appetite has a convincing reason: some people in this world have gourmet cells which can evolve and ultimately level up as they consume high-quality food.  Because these cells demand an immense amount of energy, characters usually eat a lot. This constant need for better food makes the story dynamic. Villains and heroes vie for the best food to become stronger which opens up possibilities of immense change. As they get stronger, they search for the ultimate food that can make one the most powerful. Thus, many different groups, both righteous and evil, clash with each other over food. As the story progresses it gets very complex but nothing is out of control, the anime preserves its integrity. In other words, the basic premise is nicely developed.\\n\\n\r\nThe animation successfully creates its original world. There’s a lot of talk on food. The beast and plants of the world are an amalgamation of different species of ours. They often look childish.  Moreover, the world is very colorful. Bright colors are preferred for animation. This adds to the childish aura of the anime. Nevertheless, the animation is well done. Colorful scenes make fight scenes more fluid and add an extra dimension. As it’s expected from all 100+ episodes anime series, the budget of each episode is low. But when it comes to major fights it does not disappoint. Nothing top notch, yet well done. \\n\\n\r\nThe sound is not exceptional either. Voice acting is well done. It brings out what it aims to do. Music is not so great as to be memorable. It still fits the general mood of the anime. You don’t feel like songs are out of place. \\n\\n\r\nOne positive side of Toriko is that it doesn’t have many filler episodes. The number of filler episodes is 18 (13% of total) which is significantly lower than almost all long-running anime.\\n\\n\r\nToriko isn’t great at character department either. Though many characters are usual clichés, there are some positively peculiar ones among them. One positive thing is that they are older than 21. This is consciously chosen because they usually consume a lot of alcoholic beverages. However, it isn’t used in a meaningful way. They don’t differ much from younger shounen heroes. The main character Toriko is a nice lead. What he lacks, his partner Komatsu provides. They complete each other (sadly, this isn’t a love story). Toriko’s friends Sani, Coco shine in terms of power. The anime does not fall into the trap of overpowered main character standing alone against the enemy, reducing the rest to a bunch of useless spectators who are there only to get impressed by the main character. Also, female characters do not have overgrown breasts, an oddity in this age.\\n\\n\r\nOverall, I enjoyed Toriko. Unlike other shounen, it requires a little more patience to be immersed in its world. But it’s painfully mediocre.\\n",
            "date": "2013-08-27T06:42:00+00:00",
            "helpful_count": 66,
            "mal_id": 111359,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/170301.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pessoa",
                "username": "Pessoa"
            },
            "url": "https://myanimelist.net/reviews.php?id=111359"
        },
        {
            "content": "How do you completely ruin a manga adaptation? Well, it looks like the creators of this anime have the right answer, because like they did their best to make this anime fail.\r\nI mean, let's talk about it for a moment, what didn't they do?\r\nFiller Characters: they added unnecessary filler characters and changed the storyline sometimes so the filler character could play a role in canon episodes. Why would anyone even do that?\r\nNot enough?\r\nWell, they also made sure to censor all the blood, I mean, almost getting killed and yet just having a few scratches is just natural!\r\nWait, still not enough for you?\r\nToriko smokes in themanga, and that's actually pretty cool, but well, apparently the creators of the anime didn't find it cool enough, because Toriko doesn't seem to be smoking in the anime!\\n\r\nAnd the awfully lazy art, oh god, don't get me started on this...\\n\r\nBottom line:\\n\r\nEven the nice soundtrack couldn't cover up for all the terrible mistakes they made while adapting this manga into an anime show.",
            "date": "2015-07-10T13:26:00+00:00",
            "helpful_count": 61,
            "mal_id": 192902,
            "reviewer": {
                "episodes_seen": 54,
                "image_url": "https://cdn.myanimelist.net/images/userimages/506209.jpg",
                "scores": {
                    "animation": 4,
                    "character": 10,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tampampam",
                "username": "Tampampam"
            },
            "url": "https://myanimelist.net/reviews.php?id=192902"
        },
        {
            "content": "Most people have told me they find the idea of Toriko to be stupid. After first, I had my doubts. \"How could a show about cooking have made its way up the latter in SJ?\"\r\nOh boy, was I in for a ride. \r\nThe best thing about this show, it combines old style fighting anime with a twist. The daily fight to find something new and exciting to tempt your tastebuds! The idea is probably one of the most original ideas I have ever seen. The exaction is well done and absolutely hilarious as I find myself laughing and cheering at every turn.\r\nBiggest issue seems tobe the character designs. I'm sorry but, I adore them! I love the hideously eyesore like costumes and the ridiculous hair! My favorite character is Sunny and he's the most ridiculous of all! I think it as a fun edge to the show.\\n\\n\r\nIn fact, I love the whole cast! From the ever hungry and cheerful Toriko, the curious and skillful Komatsu, the kind and gentlemanly Coco, the determined Tina, the cute and loyal Terry, the outgoing and passionate Rin, and, of course, the Beauty freak with a straight forward, self-centered nature, Sunny!\\n\\n\r\nIts seriously the most colorful (and I mean that both figuratively and literally) cast of characters I've come across. \\n\\n\r\nWhat can I say? I thoroughly enjoy certainly made a fan out of me! I plan to keep watching!",
            "date": "2011-10-01T02:54:00+00:00",
            "helpful_count": 31,
            "mal_id": 44513,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359736.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/EzmierTheSwift",
                "username": "EzmierTheSwift"
            },
            "url": "https://myanimelist.net/reviews.php?id=44513"
        },
        {
            "content": "WARNING: Anime doesn't cover all of the manga. Toriko is a series where MANLY MEN have gritty fights against villains & monsters for the sake of heroism & food.\r\nMany people have told me how much they hated the anime & prefer reading its manga, which is fine but I'm here to give my honest opinions about the animes pros & cons. \r\nToriko's concept is one of hunting & cooking where our heroes \"The 4 Heavenly Kings\" (Toriko, Coco, Sunny & Zebra) explore the unknown lands of the Gourmet Age where exotic food stimulates power resulting into a war which purpose is to obtain \"GOD\"; themost sacred dish on the planet.\\n\\n\r\nAs a story, Toriko slowly builds up into hype moments where strength is taken to gargantuan levels & takes careful consideration of minor details which later deliver in the payoff in both exposition & combat. Most arcs can range from exploring, fighting or just eating which can vary per viewer but thankfully there aren't any major filler arcs that affect the overall story. (Most of them just range from stand alones or 2 eps)\\n\\n\r\nSimilar to Dragon Ball & One Piece, Toriko carries that same adventurous feel & welcomes its viewer into a imaginative world filled with unique animals & technology. A highlight of the series are its subtle references to Fist of The North Star with Toriko, Coco & Zebra being based on Kenshiro, Toki & Raoh among other things. \\n\\n\r\nAs expected of battle shonens the series does deliver on fights sadly most of these battles do contain watered down violence. This is the main reason why most people just ignore the anime yet the adaptation serves better as a gateway due to its few crossovers with One Piece along with its soundtrack & usage of atmosphere in either the laid back scenes or the intense ones.\\n\\n\r\nFlaws of the anime include its later decrease in animation quality around the 100s & the filler ending to the series as the manga is still ongoing. Also I'm certain characters such as Komatsu & Tina will affect viewing experience in a negative way. While I suggest to do what you think is better (watching or reading) please give the series a chance as it was only recently in 2013 where people began to become fans of the series. While some scenes can feel dragged & its food concept ridiculous, don't forget that even Dragon Ball pokes fun in itself due its name choices (such as Trunks, Dr. Briefs, Tambourine, Drum & Piano). \\n\\n\r\nDon't let misconceptions affect your judgement as you may end up liking the series whether you watch or read it. Toriko is not the greatest series but does pay tribute to shonens of the 80s & 90s where it follows a straight forward story that offers imagination, gritty battles, monstrous villains & heroic characters.\\n\\n",
            "date": "2014-04-27T13:01:00+00:00",
            "helpful_count": 30,
            "mal_id": 141563,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1375999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/THEAnimeHERO",
                "username": "THEAnimeHERO"
            },
            "url": "https://myanimelist.net/reviews.php?id=141563"
        },
        {
            "content": "Okay, so to start I originally watched the first 20ish episodes of Toriko a couple years ago but then put it down because it just wasn't that appealing to me. Two weeks ago I decided to pick up the manga because I heard it was better than the anime. Still skeptical I powered past what happened in the anime, in the manga. After that, it was all downhill for me. \r\nI read through over 300 chapters of Toriko in a week. The characters and progressing story had me going through dozens of chapters a day. While the concept of a food world/combat may be aturn off for some, Toriko utilizes this to a high degree making each arc dynamic and different. I would highly recommend anyone to read this shonen. And I also recommend people to stay away from the anime because of the inconstancies between the show and manga, lack of brutality (edited out for child viewers), and also length. The anime only goes up to the Gourmet Festival.\\n\\n\r\nI am really enjoying Toriko and I feel it still has its best work ahead of it! \\n\\n\r\nPLEASE READ THE MANGA!!! And if you do watch the anime first, then watch it, then pick up the manga. I promise you it is totally worth it.",
            "date": "2015-06-09T23:34:00+00:00",
            "helpful_count": 14,
            "mal_id": 189980,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630282.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/luffytora0556",
                "username": "luffytora0556"
            },
            "url": "https://myanimelist.net/reviews.php?id=189980"
        },
        {
            "content": "A somewhat familiar anime to audiences of the One Piece journey. With that being said, \"somewhat\" is the keyword.\r\nThe story, is simply juicy and riveting. Similar to One Piece, Toriko is made up of an immensely gargantuan world filled with many surprises, wonders, and mysteries. \r\nThe art is on par with any modern era Japanese anime. The emphasis and exaggeration on the food (especially \"key\" food items) is mouth watering. You'll soon find yourself engulfed in a sparkling, tender, and juicy piece of prime rib. The environment and color of the anime is beautiful and breathtaking at times. \r\nThe sound, is decent. The OP andED could be much better as the music is not very catchy. \\n\\n\r\nThe characters, need to develop more. I know the anime is called \"Toriko\" but I don't feel a close bond with any of the characters yet. With that being said, the story has A LOT of room to develop so they have plenty of time to fix this issue. \\n\\n\r\nPros - Food is very well detailed and exaggerated (in a good way of course :D). World is vast which makes room for a HUGE adventure and a LONG lasting series. The art and environment is absolutely beautiful! \\n\\n\r\nCons - Character development/connection not there (may take some time, be patient), awkward fight scenes (if you are used to Bleach, Naruto, and One Piece fight scenes you may be disappointed, but bear in mind this anime does not fail on some cool combat moves in here), OP and ED need to go. \\n\\n\r\nOverall, if you love food and a world filled with mysterious creatures, give this anime a shot!\\n\r\n8 out of 10.",
            "date": "2012-04-10T04:10:00+00:00",
            "helpful_count": 9,
            "mal_id": 58449,
            "reviewer": {
                "episodes_seen": 48,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7924.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/killerrbee",
                "username": "killerrbee"
            },
            "url": "https://myanimelist.net/reviews.php?id=58449"
        },
        {
            "content": "I bet you’re wondering “how can a shounen about food be interesting”. I thought the same thing until I watched it, and honestly it completely blew my expectations away... at first. I’ll explain what I mean later\r\nPros:\r\n- Unique concept and setting (Can you name another battle manga about food?)\r\n- Godly world building. Seriously, it’s one of the best in anime/manga \r\n- Amazing, brutal action sequences\r\n- The hype is over 9000!!\r\nThese are the only pros I can think of for Toriko unfortunately, because i felt this series had a lot more flaws.\r\nPlot: 3/10\r\nThe story takes place in the Gourmet age, a world where people live andexplore  various delicious foods to eat. Our main protagonist Toriko, and his partner Komatsu explore the world to find rare and exquisite ingredients, to accomplish Toriko’s dream of creating the best full course meal. Toriko’s the gournet hunter who hunts for food and defeats any enemies that comes their way, meanwhile Komatsu’s the chief who prepares the food. \\n\\n\r\nThe plot is simple and repetitive e.g. Toriko and co. go on a quest to find a food-> Toriko arrives and has to fight some monster who doesn’t actually give af about the food-> villains shows up, Toriko fights them and wins-> Toriko gets a powerup from eating said food, then decides if he’ll put it on his full course. Rinse repeat for 150 episodes and you have Toriko\\n\\n\r\nThere’s a lot of nonsensical powerups our 4 heavenly kings receive that become forgotten after the arc they’re introduced, the calories aspects to moves gets dropped. \\n\\n\r\nCharacters: 5/10\\n\\n\r\nThere’s a diverse, large cast of characters, but they lack basic characterisation and meaningful character development. Our main characters, the four heavenly kings are just as bad in this aspect because they’re really static and never really grow or change much throughout the course of the series. The villains are poorly written and generic.\\n\\n\r\nAnimation: 1/10\\n\\n\r\nThe show has bad animation, its heavily censored, the fights aren’t as brutal or have any blood as it goes on, and it’s filled with filler. \\n\\n\r\nOverall: 1/10\\n\\n\r\nThe Toriko anime is shit.\\n\r\nThey introduced a anime only character (Tina), made her important as a “canon character” by having her tag along with Toriko and Co’s adventures when she wasn’t needed. The anime leaves out a lot of the description which enriches the lore and makes the world building so great.  \\n\\n\r\nIf you really want to start Toriko, I recommend reading the manga from the beginning.",
            "date": "2018-10-04T05:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 290880,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=290880"
        },
        {
            "content": "If you like food... and like watching tv shows about food... this anime is for you, despite 99% of the food in this anime not existing my stomach growls every time I watch Toriko... and before I know it I have my face in a tray of Nacho's HA!\r\nToriko will take you on what is best described as a laid back gourmet adventure and you will love every minute of it... WARNING: make sure you have plenty of food on hand ;)",
            "date": "2013-05-22T20:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 98089,
            "reviewer": {
                "episodes_seen": 82,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1176925.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mad_Maestro",
                "username": "Mad_Maestro"
            },
            "url": "https://myanimelist.net/reviews.php?id=98089"
        },
        {
            "content": "Honestly if you watch this without thinking too much about it you well get a pretty normal shonen anime. The only character I have too much of a problem with is Komatsu, as alot of people say.\r\nNow, he is not a detestable character and I do not loathe him, although I do hate incompetence he displays at times. However I do believe that they should have made Komatsu a women, this would have drastically changed the dynamic of the story and probably have made it better.\r\nNow, I read somewhere that the author had intended at first to make Komatsu a woman, but in doing sowould create a reverse harem, because of the time she would spend with Toriko and his brothers. However I still believe that would have been the better choice for it would have changed the dynamic of the entire show making a female Komatsu a love interest for Toriko. \\n\\n\r\nOther than that, everything was fine, it wasn't AMAZING, but it was average at best, and there is plenty of action as well. I thought it was alirght, it is worth watching so yeah.",
            "date": "2015-10-21T16:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 201705,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4257429.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dlite96",
                "username": "Dlite96"
            },
            "url": "https://myanimelist.net/reviews.php?id=201705"
        },
        {
            "content": "So... We have food and fighting.Some people may think food fight but they are way off.This anime by \"Shimabukuro Mitsutoshi\" delivers a wide range of combinations and flavor that is hard to imagine.However once you do,you're ready to jump into battle with the characters just to try and sneak a bite of the overwhelming varieties of food.\"Toriko\" ended up being the first food anime i watched,after episode 1 i had to show people so i called up some friends.We started the first episode and didn't stop until 15 or so,from that point we watched it every time we hung out.The story was easily captivating enoughto keep us entertained and wanting more.The fights gradually get better and better as it goes.All around \"Toriko\" is a fun and memorable crowd pleasing anime,that is of course if you like \"DBZ\"\"One piece\" mixed with food.As \"Funimation\" says,you should be watching. Warning this anime may make you hungry,even if you're full!!!    \\n\\n\\n",
            "date": "2015-10-04T16:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 200535,
            "reviewer": {
                "episodes_seen": 103,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4913250.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FK420",
                "username": "FK420"
            },
            "url": "https://myanimelist.net/reviews.php?id=200535"
        },
        {
            "content": "GUTS ! GUTS GUTS ! GUTS GUTS !\r\nAs toriko became one of my favorite anime, I had to write a review to explain why.\r\nImagine a world, much more bigger than earth, that seems endless, where you can find an infinite number of natural cooking's ingredients. Some of them are very rare and valuable, and that's why, there are people whose job is to hunt them. \r\nWe often follow toriko and komatsu (a boy whose dream is to become one of the best cook in the world) in their epic adventures to find and ingredient. It could as well be a terrifying and powerful monster orsmall mushroom that live in a place very hard to reach. Every arcs is surprising and imaginative.\\n\\n\r\nThe plot is simple, no headache to understand here, but very interesting and original. A world where cooking is much more important than everything else. Famous people are cooks, even the government is involved in foods, restaurants, ingredients, cooking tv show...etc\\n\\n\r\nToriko follow the shonen's rules. He become much more stronger in each episode, and is able to hunt ingredients of higher quality.\\n\\n\r\nColored graphics are beautifull. Most of the time, the story take place in natural environment. You'll feel like traveling.\\n\\n\r\nThis anime is really addictive.\\n\\n\r\nGochisousama deshita :)\\n\\n\\n\\n",
            "date": "2013-04-11T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 93365,
            "reviewer": {
                "episodes_seen": 98,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1435673.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lapinmagik",
                "username": "lapinmagik"
            },
            "url": "https://myanimelist.net/reviews.php?id=93365"
        },
        {
            "content": "Toriko is one those Shonen battle anime like DBZ, Naruto, One piece, Bleach, etc... But whats makes this different this series is that the mayor point in the story is to eat food to gain more power, to be more accurate the main characters have this thing call gourmet cell inside their bodies that certain food will give them power up's when eaten. The main character are these gourmet hunters that travel around the world founding good food to eat, sometimes they have to fight monsters, other time they have to fight the environment and there time that they fight with other humans. The soundand the animation are really good with this anime is no master piece but it has it moments when you see a really good food that will make you hungry just by looking at it. I will recommend anyone who loves Shonen battle anime to give this one a go, but be ware this anime continue in the manga.",
            "date": "2015-06-05T13:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 189618,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuMangaGamer",
                "username": "OtakuMangaGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=189618"
        }
    ],
    [
        {
            "content": "\"Cooking is as masculine as judo, kickboxing or tae kwan do. Anyone can fight but it takes a special man to craft the perfect Bolognese sauce\"\r\nQuoted from a manly midget chef...\r\nYou know the first thing that crossed my mind when I read that quote was covering a cow with ketchup then proceed to pound the cow into bolognese sauce. \r\nIm just kidding of course, that isn't call MANLY... that's called animal abuse...\r\nSo chances are if you stumble upon this anime, you're not watching it just to fill up your boring life with some boring junk. No.. You hunt for exotic food on a daily basis.And you need an anime that teaches you the RIGHT way to do it... \\n\r\nWell, introducing Toriko, the only anime currently airing that will not only satisfy that hunger urge but will also teach you how to be more MANLY than you were before.\\n\\n\r\nWhat would you say if I said that World Peace could be obtain if everyone in the world combined their powers to produced the most delicious full course menu in the universe?\\n\r\nYou would probably say \"BURRRRRP!!\" Cause that's how the end of World Hunger sounds like. Now all that's left is the homeless people.\\n\\n\r\n(Now people, feeding the homeless to the hungry would solve those two world problems, but we wouldn't want to resort to cannibalism now do we?)\\n\\n\r\nLet's see how this anime can be used to solve other problems?\\n\\n\r\nProblem (Art)\\n\r\nSo you just opened up an art gallery and you're not raking any cash because an art gallery is partially a public good. (No duh..)\\n\r\nSolution:\\n\r\nOpen up a mini restaurant in your gallery. Watch Toriko (especially the one piece crossover) and get inspiration on drawing animals which apparently looks like it had sex with food and produced offspring. Make your visitors hungry and they'll pay a visit to your mini restaurant for brunch. Problem solved \\n\r\nToriko has a huge variety of animal species, though not as much as Pokemon which has a total of 600++ up to date, but at least some of them are edible and each is designed with it's own unique features. The artwork for Toriko is similar to One Piece. If you like One Piece, then you definitely would love this. If you like Two Piece then go to the toilet... *crickets* Yeah, yeah lame joke... pfft...\\n\\n\r\nProblem (Sound)\\n\r\nSo you work with a bunch of unmotivated voice actors who does english dubs for an anime.\\n\r\nAnd they sound horrible (more than usual anyways)\\n\r\nSolution:\\n\r\nGet them to watch Toriko. The seiyuus for this anime are top notch. They portray their character well in the anime. It's like the directors forced the seiyuus to starve during the recording to make them sound like a bunch of hungry men. What can I say about the opening? One word... \"GATSU!!\" No seriously, it's like getting your guts punched with a thousand fists of manliness.\\n\\n\r\nProblem (Character)\\n\r\nSo you have a son, and he's a wimp. Nothing wrong about that, but he is due to national service soon. And you don't want the other kids to bully him.\\n\r\nSolution:\\n\r\nGet him to watch Toriko. Make him into a man. Toriko is an exampled role model.He says his prayers before and after eating his meal. How often do you see people say their grace before they eat? Not only that, Toriko only kills animals that he deems worthy to be eaten. He does not just willy nilly kill any of God's creation. Only a REAL man could do that.\\n\r\nFor every manly character, there will have to be a less manly guy to enhance the manliness of the main character.\\n\r\nFor Batman, there is Robin. For Sherlock Holmes, there is Dr. Watson. In this case, for Toriko, there is Komatsu. Komatsu has his own set of special culinary abilities that furthur compliments Toriko's manliness. If Toriko was the fork and spoon, Komatsu is probably the condiments. \\n\r\nWhat about the wimpy son problem?\\n\r\nHeck, just show the government his MAL profile that he is currently watching \"Toriko\" He'll be exempted for life.\\n\r\nIn fact, \"Toriko\" isn't really an anime.\\n\r\nThe German government classified \"Toriko\" as \"Handbuch für Männlichkeit\"\\n\r\nTranslation, Handbook for masculinity. Yeah, everything sounds manlier in German.\\n\\n\r\nThe only problem about this anime is that it was further degraded from its masculinity compared to the manga due to a significant degree of censorship. Lower your hopes for gore and blood. On the bright side, with the absence of graphic violence, how kids who haven't hit puberty can watch the anime and start training the the path of manliness...\\n\\n\r\nOverall, as proven above, watching Toriko solves a whole tons of problems. I give this anime a rating of 8. Cause that's the number of packs you'll have after watching this anime. Yes, that's right, 8 packs! One more pack and you can play tick-tack-toe on your abs. How awesome is that? Not as awesome as Toriko though. Tough luck kiddo.",
            "date": "2011-04-12T10:00:00+00:00",
            "helpful_count": 150,
            "mal_id": 35975,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=35975"
        },
        {
            "content": "WARNING: In my Review I go on tangents, but that's just the way I roll because I like barbeque sauce on my chicken nuggets. And don't you forget it.\r\nThere are two reasons that I watch anime:\r\n1) I want to see something with depth that is intellectually stimulating where the characters and story weave a fascinating tale with twists and turns. One Anime that did this for me was Kaiji.\r\n2) I just want to relax and experience an enjoyable adventure with a memorable cast of characters. In this category I mostly look for the theme and eye candy (meaning the quality of the art).\r\nI watch Torikofor the second reason.\\n\\n\r\nI actually tried watching Toriko when it first came out and didn't like it. With this season being one of the worst seasons of anime for me I decided to give Toriko another chance. And I am REALLY glad that I did.\\n\\n\r\nSummary/Review:\\n\r\nToriko takes place during the \"Gourmet Age\" where food is not merely a delicacy but also a sought after commodity. In this world rare and exquisite food exists and is often extremely hard to attain. There are two main factions, the IGO, (which are a bunch of Gourmet Hunters) and an evil group (Bishikokai or something like that) who desire to control the food supply because food is essentially power.\\n\\n\r\nCharacters 8/10\\n\r\nNot the best characters nor the most memorable. However, they do have their moments and grow on you.\\n\\n\r\nStory 9/10\\n\r\nHilarious. It's about food, and food is power.\\n\\n\r\nVisuals 10/10\\n\r\nLooks awesome. Nice fight scenes.\\n\\n\r\nMisc. 10/10\\n\r\nI love the pacing and feel that almost every episode gives me my money's worth rather than feeling cheated and held at gunpoint like with many other Anime.\\n\\n\\n\r\nRandom Thoughts/Comparisons:\\n\r\nI thought One Piece was good. Then I later realized I liked Fairy Tail better. The reason I like Fairy Tail better is because, while very similar, it does not suffer as much from \"Dragon Ball Z syndrome\". One Piece just takes soooo long to get its point across and it drags on and on. It's awesome but the lengthening just dilutes what could be greatness and it's frustrating.\\n\\n\r\nThen I realized I like Toriko better than Fairy Tail. While Fairy Tail's pacing is good, Toriko's pacing is phenomenal. It doesn't drag out arcs. It moves fast and leaves you wanting more rather than hanging for weeks on end (like One Piece).\\n\\n\r\nToriko is stereotypical. It's almost how Dragon Ball Z would be if it centered around food and had ridiculously enjoyable pacing. As a matter of fact, Toriko is what I always wished Dragon Ball Z had been.\\n\\n\\n\r\nConclusion:\\n\r\nThe art is beautiful and imaginative. Some of the monsters are huge and give off vibes of epicness. It's just such an enjoyable Anime to chill back and watch. Turn your brain off and just enjoy mindless action with its beautiful visuals. If you try and take it seriously you will definitely not enjoy it. But if you don't take it seriously you are truly in for a full course meal...\\n\\n\r\nP.S. \\n\r\nI usually don't care to write reviews but I hope that a few people read this and give Toriko a chance because it doesn't get the credit it deserves. I was one of the many who overlooked this gem.\\n\\n\r\nIf Komatsu ends up getting Gourmet Cells I will say this is the best Anime ever!",
            "date": "2011-11-10T21:01:00+00:00",
            "helpful_count": 87,
            "mal_id": 47243,
            "reviewer": {
                "episodes_seen": 31,
                "image_url": "https://cdn.myanimelist.net/images/userimages/914197.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/KidCaramel",
                "username": "KidCaramel"
            },
            "url": "https://myanimelist.net/reviews.php?id=47243"
        },
        {
            "content": "The story of Toriko takes place in the Gourmet Age. In that world people live to eat. Wars can erupt over delicious food.  The main character Toriko and his partner Komatsu travel around the world to find exquisite ingredients. Toriko hunts, his partner cooks. This is the basic premise and I’ll be honest, it sounds stupid. Teenage heroes of other anime are trying to save humanity, planets, their family and friends from cool-looking edgy evil forces. But Toriko, a twenty five years old adult male, is chasing after food. It isn’t primarily a comedy anime to excuse the premise. Although soon it becomes clearthat evil people can use rare food for their evil ends, it still isn’t enough to make most viewers take Toriko seriously. \\n\\n\r\nI’d like people to watch it but I will be honest. Toriko is mediocre at best. Despite its simple and not-too-intelligent premise, the story unfolds itself and turns out to be very complicated. For the first time in the history of shounen anime, the main character’s voracious appetite has a convincing reason: some people in this world have gourmet cells which can evolve and ultimately level up as they consume high-quality food.  Because these cells demand an immense amount of energy, characters usually eat a lot. This constant need for better food makes the story dynamic. Villains and heroes vie for the best food to become stronger which opens up possibilities of immense change. As they get stronger, they search for the ultimate food that can make one the most powerful. Thus, many different groups, both righteous and evil, clash with each other over food. As the story progresses it gets very complex but nothing is out of control, the anime preserves its integrity. In other words, the basic premise is nicely developed.\\n\\n\r\nThe animation successfully creates its original world. There’s a lot of talk on food. The beast and plants of the world are an amalgamation of different species of ours. They often look childish.  Moreover, the world is very colorful. Bright colors are preferred for animation. This adds to the childish aura of the anime. Nevertheless, the animation is well done. Colorful scenes make fight scenes more fluid and add an extra dimension. As it’s expected from all 100+ episodes anime series, the budget of each episode is low. But when it comes to major fights it does not disappoint. Nothing top notch, yet well done. \\n\\n\r\nThe sound is not exceptional either. Voice acting is well done. It brings out what it aims to do. Music is not so great as to be memorable. It still fits the general mood of the anime. You don’t feel like songs are out of place. \\n\\n\r\nOne positive side of Toriko is that it doesn’t have many filler episodes. The number of filler episodes is 18 (13% of total) which is significantly lower than almost all long-running anime.\\n\\n\r\nToriko isn’t great at character department either. Though many characters are usual clichés, there are some positively peculiar ones among them. One positive thing is that they are older than 21. This is consciously chosen because they usually consume a lot of alcoholic beverages. However, it isn’t used in a meaningful way. They don’t differ much from younger shounen heroes. The main character Toriko is a nice lead. What he lacks, his partner Komatsu provides. They complete each other (sadly, this isn’t a love story). Toriko’s friends Sani, Coco shine in terms of power. The anime does not fall into the trap of overpowered main character standing alone against the enemy, reducing the rest to a bunch of useless spectators who are there only to get impressed by the main character. Also, female characters do not have overgrown breasts, an oddity in this age.\\n\\n\r\nOverall, I enjoyed Toriko. Unlike other shounen, it requires a little more patience to be immersed in its world. But it’s painfully mediocre.\\n",
            "date": "2013-08-27T06:42:00+00:00",
            "helpful_count": 66,
            "mal_id": 111359,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/170301.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Pessoa",
                "username": "Pessoa"
            },
            "url": "https://myanimelist.net/reviews.php?id=111359"
        },
        {
            "content": "How do you completely ruin a manga adaptation? Well, it looks like the creators of this anime have the right answer, because like they did their best to make this anime fail.\r\nI mean, let's talk about it for a moment, what didn't they do?\r\nFiller Characters: they added unnecessary filler characters and changed the storyline sometimes so the filler character could play a role in canon episodes. Why would anyone even do that?\r\nNot enough?\r\nWell, they also made sure to censor all the blood, I mean, almost getting killed and yet just having a few scratches is just natural!\r\nWait, still not enough for you?\r\nToriko smokes in themanga, and that's actually pretty cool, but well, apparently the creators of the anime didn't find it cool enough, because Toriko doesn't seem to be smoking in the anime!\\n\r\nAnd the awfully lazy art, oh god, don't get me started on this...\\n\r\nBottom line:\\n\r\nEven the nice soundtrack couldn't cover up for all the terrible mistakes they made while adapting this manga into an anime show.",
            "date": "2015-07-10T13:26:00+00:00",
            "helpful_count": 61,
            "mal_id": 192902,
            "reviewer": {
                "episodes_seen": 54,
                "image_url": "https://cdn.myanimelist.net/images/userimages/506209.jpg",
                "scores": {
                    "animation": 4,
                    "character": 10,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tampampam",
                "username": "Tampampam"
            },
            "url": "https://myanimelist.net/reviews.php?id=192902"
        },
        {
            "content": "Most people have told me they find the idea of Toriko to be stupid. After first, I had my doubts. \"How could a show about cooking have made its way up the latter in SJ?\"\r\nOh boy, was I in for a ride. \r\nThe best thing about this show, it combines old style fighting anime with a twist. The daily fight to find something new and exciting to tempt your tastebuds! The idea is probably one of the most original ideas I have ever seen. The exaction is well done and absolutely hilarious as I find myself laughing and cheering at every turn.\r\nBiggest issue seems tobe the character designs. I'm sorry but, I adore them! I love the hideously eyesore like costumes and the ridiculous hair! My favorite character is Sunny and he's the most ridiculous of all! I think it as a fun edge to the show.\\n\\n\r\nIn fact, I love the whole cast! From the ever hungry and cheerful Toriko, the curious and skillful Komatsu, the kind and gentlemanly Coco, the determined Tina, the cute and loyal Terry, the outgoing and passionate Rin, and, of course, the Beauty freak with a straight forward, self-centered nature, Sunny!\\n\\n\r\nIts seriously the most colorful (and I mean that both figuratively and literally) cast of characters I've come across. \\n\\n\r\nWhat can I say? I thoroughly enjoy certainly made a fan out of me! I plan to keep watching!",
            "date": "2011-10-01T02:54:00+00:00",
            "helpful_count": 31,
            "mal_id": 44513,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/359736.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/EzmierTheSwift",
                "username": "EzmierTheSwift"
            },
            "url": "https://myanimelist.net/reviews.php?id=44513"
        },
        {
            "content": "WARNING: Anime doesn't cover all of the manga. Toriko is a series where MANLY MEN have gritty fights against villains & monsters for the sake of heroism & food.\r\nMany people have told me how much they hated the anime & prefer reading its manga, which is fine but I'm here to give my honest opinions about the animes pros & cons. \r\nToriko's concept is one of hunting & cooking where our heroes \"The 4 Heavenly Kings\" (Toriko, Coco, Sunny & Zebra) explore the unknown lands of the Gourmet Age where exotic food stimulates power resulting into a war which purpose is to obtain \"GOD\"; themost sacred dish on the planet.\\n\\n\r\nAs a story, Toriko slowly builds up into hype moments where strength is taken to gargantuan levels & takes careful consideration of minor details which later deliver in the payoff in both exposition & combat. Most arcs can range from exploring, fighting or just eating which can vary per viewer but thankfully there aren't any major filler arcs that affect the overall story. (Most of them just range from stand alones or 2 eps)\\n\\n\r\nSimilar to Dragon Ball & One Piece, Toriko carries that same adventurous feel & welcomes its viewer into a imaginative world filled with unique animals & technology. A highlight of the series are its subtle references to Fist of The North Star with Toriko, Coco & Zebra being based on Kenshiro, Toki & Raoh among other things. \\n\\n\r\nAs expected of battle shonens the series does deliver on fights sadly most of these battles do contain watered down violence. This is the main reason why most people just ignore the anime yet the adaptation serves better as a gateway due to its few crossovers with One Piece along with its soundtrack & usage of atmosphere in either the laid back scenes or the intense ones.\\n\\n\r\nFlaws of the anime include its later decrease in animation quality around the 100s & the filler ending to the series as the manga is still ongoing. Also I'm certain characters such as Komatsu & Tina will affect viewing experience in a negative way. While I suggest to do what you think is better (watching or reading) please give the series a chance as it was only recently in 2013 where people began to become fans of the series. While some scenes can feel dragged & its food concept ridiculous, don't forget that even Dragon Ball pokes fun in itself due its name choices (such as Trunks, Dr. Briefs, Tambourine, Drum & Piano). \\n\\n\r\nDon't let misconceptions affect your judgement as you may end up liking the series whether you watch or read it. Toriko is not the greatest series but does pay tribute to shonens of the 80s & 90s where it follows a straight forward story that offers imagination, gritty battles, monstrous villains & heroic characters.\\n\\n",
            "date": "2014-04-27T13:01:00+00:00",
            "helpful_count": 30,
            "mal_id": 141563,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1375999.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/THEAnimeHERO",
                "username": "THEAnimeHERO"
            },
            "url": "https://myanimelist.net/reviews.php?id=141563"
        },
        {
            "content": "Okay, so to start I originally watched the first 20ish episodes of Toriko a couple years ago but then put it down because it just wasn't that appealing to me. Two weeks ago I decided to pick up the manga because I heard it was better than the anime. Still skeptical I powered past what happened in the anime, in the manga. After that, it was all downhill for me. \r\nI read through over 300 chapters of Toriko in a week. The characters and progressing story had me going through dozens of chapters a day. While the concept of a food world/combat may be aturn off for some, Toriko utilizes this to a high degree making each arc dynamic and different. I would highly recommend anyone to read this shonen. And I also recommend people to stay away from the anime because of the inconstancies between the show and manga, lack of brutality (edited out for child viewers), and also length. The anime only goes up to the Gourmet Festival.\\n\\n\r\nI am really enjoying Toriko and I feel it still has its best work ahead of it! \\n\\n\r\nPLEASE READ THE MANGA!!! And if you do watch the anime first, then watch it, then pick up the manga. I promise you it is totally worth it.",
            "date": "2015-06-09T23:34:00+00:00",
            "helpful_count": 14,
            "mal_id": 189980,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630282.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/luffytora0556",
                "username": "luffytora0556"
            },
            "url": "https://myanimelist.net/reviews.php?id=189980"
        },
        {
            "content": "A somewhat familiar anime to audiences of the One Piece journey. With that being said, \"somewhat\" is the keyword.\r\nThe story, is simply juicy and riveting. Similar to One Piece, Toriko is made up of an immensely gargantuan world filled with many surprises, wonders, and mysteries. \r\nThe art is on par with any modern era Japanese anime. The emphasis and exaggeration on the food (especially \"key\" food items) is mouth watering. You'll soon find yourself engulfed in a sparkling, tender, and juicy piece of prime rib. The environment and color of the anime is beautiful and breathtaking at times. \r\nThe sound, is decent. The OP andED could be much better as the music is not very catchy. \\n\\n\r\nThe characters, need to develop more. I know the anime is called \"Toriko\" but I don't feel a close bond with any of the characters yet. With that being said, the story has A LOT of room to develop so they have plenty of time to fix this issue. \\n\\n\r\nPros - Food is very well detailed and exaggerated (in a good way of course :D). World is vast which makes room for a HUGE adventure and a LONG lasting series. The art and environment is absolutely beautiful! \\n\\n\r\nCons - Character development/connection not there (may take some time, be patient), awkward fight scenes (if you are used to Bleach, Naruto, and One Piece fight scenes you may be disappointed, but bear in mind this anime does not fail on some cool combat moves in here), OP and ED need to go. \\n\\n\r\nOverall, if you love food and a world filled with mysterious creatures, give this anime a shot!\\n\r\n8 out of 10.",
            "date": "2012-04-10T04:10:00+00:00",
            "helpful_count": 9,
            "mal_id": 58449,
            "reviewer": {
                "episodes_seen": 48,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7924.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/killerrbee",
                "username": "killerrbee"
            },
            "url": "https://myanimelist.net/reviews.php?id=58449"
        },
        {
            "content": "I bet you’re wondering “how can a shounen about food be interesting”. I thought the same thing until I watched it, and honestly it completely blew my expectations away... at first. I’ll explain what I mean later\r\nPros:\r\n- Unique concept and setting (Can you name another battle manga about food?)\r\n- Godly world building. Seriously, it’s one of the best in anime/manga \r\n- Amazing, brutal action sequences\r\n- The hype is over 9000!!\r\nThese are the only pros I can think of for Toriko unfortunately, because i felt this series had a lot more flaws.\r\nPlot: 3/10\r\nThe story takes place in the Gourmet age, a world where people live andexplore  various delicious foods to eat. Our main protagonist Toriko, and his partner Komatsu explore the world to find rare and exquisite ingredients, to accomplish Toriko’s dream of creating the best full course meal. Toriko’s the gournet hunter who hunts for food and defeats any enemies that comes their way, meanwhile Komatsu’s the chief who prepares the food. \\n\\n\r\nThe plot is simple and repetitive e.g. Toriko and co. go on a quest to find a food-> Toriko arrives and has to fight some monster who doesn’t actually give af about the food-> villains shows up, Toriko fights them and wins-> Toriko gets a powerup from eating said food, then decides if he’ll put it on his full course. Rinse repeat for 150 episodes and you have Toriko\\n\\n\r\nThere’s a lot of nonsensical powerups our 4 heavenly kings receive that become forgotten after the arc they’re introduced, the calories aspects to moves gets dropped. \\n\\n\r\nCharacters: 5/10\\n\\n\r\nThere’s a diverse, large cast of characters, but they lack basic characterisation and meaningful character development. Our main characters, the four heavenly kings are just as bad in this aspect because they’re really static and never really grow or change much throughout the course of the series. The villains are poorly written and generic.\\n\\n\r\nAnimation: 1/10\\n\\n\r\nThe show has bad animation, its heavily censored, the fights aren’t as brutal or have any blood as it goes on, and it’s filled with filler. \\n\\n\r\nOverall: 1/10\\n\\n\r\nThe Toriko anime is shit.\\n\r\nThey introduced a anime only character (Tina), made her important as a “canon character” by having her tag along with Toriko and Co’s adventures when she wasn’t needed. The anime leaves out a lot of the description which enriches the lore and makes the world building so great.  \\n\\n\r\nIf you really want to start Toriko, I recommend reading the manga from the beginning.",
            "date": "2018-10-04T05:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 290880,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=290880"
        },
        {
            "content": "If you like food... and like watching tv shows about food... this anime is for you, despite 99% of the food in this anime not existing my stomach growls every time I watch Toriko... and before I know it I have my face in a tray of Nacho's HA!\r\nToriko will take you on what is best described as a laid back gourmet adventure and you will love every minute of it... WARNING: make sure you have plenty of food on hand ;)",
            "date": "2013-05-22T20:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 98089,
            "reviewer": {
                "episodes_seen": 82,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1176925.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mad_Maestro",
                "username": "Mad_Maestro"
            },
            "url": "https://myanimelist.net/reviews.php?id=98089"
        },
        {
            "content": "Honestly if you watch this without thinking too much about it you well get a pretty normal shonen anime. The only character I have too much of a problem with is Komatsu, as alot of people say.\r\nNow, he is not a detestable character and I do not loathe him, although I do hate incompetence he displays at times. However I do believe that they should have made Komatsu a women, this would have drastically changed the dynamic of the story and probably have made it better.\r\nNow, I read somewhere that the author had intended at first to make Komatsu a woman, but in doing sowould create a reverse harem, because of the time she would spend with Toriko and his brothers. However I still believe that would have been the better choice for it would have changed the dynamic of the entire show making a female Komatsu a love interest for Toriko. \\n\\n\r\nOther than that, everything was fine, it wasn't AMAZING, but it was average at best, and there is plenty of action as well. I thought it was alirght, it is worth watching so yeah.",
            "date": "2015-10-21T16:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 201705,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4257429.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dlite96",
                "username": "Dlite96"
            },
            "url": "https://myanimelist.net/reviews.php?id=201705"
        },
        {
            "content": "So... We have food and fighting.Some people may think food fight but they are way off.This anime by \"Shimabukuro Mitsutoshi\" delivers a wide range of combinations and flavor that is hard to imagine.However once you do,you're ready to jump into battle with the characters just to try and sneak a bite of the overwhelming varieties of food.\"Toriko\" ended up being the first food anime i watched,after episode 1 i had to show people so i called up some friends.We started the first episode and didn't stop until 15 or so,from that point we watched it every time we hung out.The story was easily captivating enoughto keep us entertained and wanting more.The fights gradually get better and better as it goes.All around \"Toriko\" is a fun and memorable crowd pleasing anime,that is of course if you like \"DBZ\"\"One piece\" mixed with food.As \"Funimation\" says,you should be watching. Warning this anime may make you hungry,even if you're full!!!    \\n\\n\\n",
            "date": "2015-10-04T16:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 200535,
            "reviewer": {
                "episodes_seen": 103,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4913250.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FK420",
                "username": "FK420"
            },
            "url": "https://myanimelist.net/reviews.php?id=200535"
        },
        {
            "content": "GUTS ! GUTS GUTS ! GUTS GUTS !\r\nAs toriko became one of my favorite anime, I had to write a review to explain why.\r\nImagine a world, much more bigger than earth, that seems endless, where you can find an infinite number of natural cooking's ingredients. Some of them are very rare and valuable, and that's why, there are people whose job is to hunt them. \r\nWe often follow toriko and komatsu (a boy whose dream is to become one of the best cook in the world) in their epic adventures to find and ingredient. It could as well be a terrifying and powerful monster orsmall mushroom that live in a place very hard to reach. Every arcs is surprising and imaginative.\\n\\n\r\nThe plot is simple, no headache to understand here, but very interesting and original. A world where cooking is much more important than everything else. Famous people are cooks, even the government is involved in foods, restaurants, ingredients, cooking tv show...etc\\n\\n\r\nToriko follow the shonen's rules. He become much more stronger in each episode, and is able to hunt ingredients of higher quality.\\n\\n\r\nColored graphics are beautifull. Most of the time, the story take place in natural environment. You'll feel like traveling.\\n\\n\r\nThis anime is really addictive.\\n\\n\r\nGochisousama deshita :)\\n\\n\\n\\n",
            "date": "2013-04-11T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 93365,
            "reviewer": {
                "episodes_seen": 98,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1435673.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lapinmagik",
                "username": "lapinmagik"
            },
            "url": "https://myanimelist.net/reviews.php?id=93365"
        },
        {
            "content": "Toriko is one those Shonen battle anime like DBZ, Naruto, One piece, Bleach, etc... But whats makes this different this series is that the mayor point in the story is to eat food to gain more power, to be more accurate the main characters have this thing call gourmet cell inside their bodies that certain food will give them power up's when eaten. The main character are these gourmet hunters that travel around the world founding good food to eat, sometimes they have to fight monsters, other time they have to fight the environment and there time that they fight with other humans. The soundand the animation are really good with this anime is no master piece but it has it moments when you see a really good food that will make you hungry just by looking at it. I will recommend anyone who loves Shonen battle anime to give this one a go, but be ware this anime continue in the manga.",
            "date": "2015-06-05T13:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 189618,
            "reviewer": {
                "episodes_seen": 147,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635261.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuMangaGamer",
                "username": "OtakuMangaGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=189618"
        }
    ]
]