[
    [
        {
            "content": "I can actually make a 3 word summary for this anime. It would go like this : KILL, KILL, KILL.\r\nHeartless killing, endless dying. That pretty much made up the story. Almost every character was just blood thirsty, all except this anime&rsquo;s Romeo and Juliet, aka Gennosuke and Oboro. It&rsquo;s another story of forbidden love, I suppose. The forbidden love was a foot note for me &ndash; I was more engrossed by the fight scenes and the dramatic deaths of the ninjas.\r\nThe concept was actually new to me, but I was able to understand most of it. I was familiar with Samurai &ndash; themed anime, butI have never watched a serious shinobi anime like this one (that&rsquo;s right &ndash; Flame of Recca doesn&rsquo;t count). I&rsquo;m not sure what separates the two, but from what I notice, Ninjas are less moral and are more likely into killing, that&rsquo;s why the Iga and Kouga ninjas were chosen to fight it out with each other to come up with the decision on who will succeed the third shogun. I am not sure whether or not this really happened (I don&rsquo;t think so) but there were a lot of historical references that were explained (thank God!). It's another opportunity to learn about Japanese culture and history!\\n\\n\r\nSo the characters ended up killing each other in the way they knew how &ndash; using their different techniques of course. They all had unique techniques, from super sticky phlegm to blood sucking skin to deadly glances. These techniques gave spice to the already violent carnage.\\n\\n\r\nLike their techniques, their respective practitioners were equally impressive and different (Although the girls looked alike, and Koshirou and Yashamaru as well). I was sad that some were only shown for a short time, because their personalities and character made it seem like they were going to stick around longer.\\n\\n\r\nI have to commend the voice acting for this one. Even though I&rsquo;m not that fluent in Japanese, I know well enough Japanese slang to tell that the language they&rsquo;re using was the one used in that era. They seem to say &ldquo;Gozaimasu&rdquo; a lot. Generally, the seiyus brought out the personalities of their respective characters, and that&rsquo;s always a good thing.\\n\\n\r\nThe drawing style was pretty good, but I found that it can be a bit exaggerated sometimes. Body proportions were kinda weird. Everyone and everything seemed to be big. The women had huge, nipple-less chests (Found out from all the naked girl fight scenes). The men had overly large frames, but they are ninjas so I&rsquo;m not sure about that. The wrinkles on the elders were a bit too extreme. They were kind with Danjou, but poor Ogen. She was so beautiful in her youth and when she got old they made her look REALLY old. There were a lot of hair too - everyone just seemed so hairy. The landscapes and backgrounds were nicely drawn though, and I did detect a hint of CG just to compliment some scenes. I was kinda ticked that a lot of the scenes were in the dark, which made it hard for me to tell what was happening. Oh well, they didn&rsquo;t have light then anyway. When the scenes were during the daytime, you could tell the colors were done nicely and complimented each other instead of clashing with each other.\\n\\n\r\nI noticed there was a great variety of BGM &ndash; most of them were gloomy though. It did fit the series well, but that&rsquo;s about it. They didn&rsquo;t heighten the mood of the scene or anything like that. The opening theme singer&rsquo;s voice (which is actually Oboro&rsquo;s seiyu) sounded a bit operatic, so I didn&rsquo;t like the opening theme that much. I liked both the ending songs though, they seemed more current compared to the opening theme. Anyway, all in all the music fit the mood of the anime.\\n\\n\r\nAgain I was hesitant with this one &ndash; Didn&rsquo;t really want to watch it at first since I thought it was going to be too serious, but it ended up to be very exciting and likable. Let&rsquo;s not forget the violence and gore either, It may seem like I like shojo more, but I actually love violent series just as much.",
            "date": "2007-06-19T04:19:00+00:00",
            "helpful_count": 190,
            "mal_id": 381,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=381"
        },
        {
            "content": "Story: (9/10) - Great\r\nThe story is simple - two warring ninja clans kill each other. Don't let the simple plot fool you though, there is a forbidden love story thrown into the mix aswell, and that is pulled off well. The best way to describe this would be a ultra-violent Romeo and Juliet sort of story. I enjoyed the story very much, but it had it's flaws. Many of the characters that appear only last for a few episodes, and I felt that they could have been kept along just a bit longer. But, after all, the main premise of this anime is two ninjaclans killing each other, so I'm not really that upset.\\n\\n\r\nArt: (10/10) - Outstanding\\n\r\nThis is some of the best art I have ever seen in Anime, period. I am not exaggerating one bit. Even if you don't like the plot, the sound, or the characters, you should watch this Anime just for the art. If I could rate the art eleven out of ten, I would. Simply epic art. Much detail is put into everything that you see. The backgrounds are rich and colorful, but not too colorful, and seem to pop out of the screen at you. The characters are well designed, and convincing. Even some of the CGI, although it is rarely used, is well done. The only bad point I would give the art would be that some of the characters were designed rather oddly, with massive deformations which takes away from the otherwise blatant realism of this Anime.\\n\\n\r\nSound: 9/10 - Great\\n\r\nThere really isn't much to say about the sound. I watched this series dubbed for the first five episodes then switched over to subtitles. The dub is well done, but it is very strange watching Ninja's in seventeenth century Japan speaking English. The subtitles are well done, but they were a tad bit small for my taste, although I do have rather bad vision. The one bad point about the sound is that a lot of the characters that are voiced are given very unrealistic voices, and it is hard to see a character in real life speaking that way. Also, some of the sound effects are a bit overdone.\\n\\n\r\nCharacter: 8/10 - Very Good\\n\r\nThe characters aren't anything special in themselves, but a good amount of character development is done. As said earlier, the two main characters resemble Romeo and Juliet, in a forbidden love scenario. A complaint I have about the characters is also as mentioned before in the art section -- many of them are massively deformed with huge tumors and the like. I am not sure if they meant to do this to show that they had no modern medicine, but some of the deformations are so over the top that they would be almost impossible in real life unless the character was suffering from a severe case of elephantiasis. Also, some of the characters are killed off way too soon, and I feel that they could have had use in the plot.\\n\\n\r\nEnjoyment - 10/10 - Outstanding\\n\r\nI watched this show in a matter of three days, which is pretty good if you ask me. This series if very, very enjoyable, one of the best around. If you have some spare time, I would recommend putting aside a weekend and marathoning it with some friends. This anime has a rather good re watch value also.\\n\\n\r\nOverall: 9/10 - Great\\n\r\nThis is a very good anime series, and despite some of it's flaws, is a must see for any fan. I would say that about 95% of the people who watch this will like it. I would say that this series is appropriate for children over the age of fifteen, because it does include violence, scenes of rape, nudity, blood, and mildly suggestive themes. Main Verdict - Buy, rent, or download this anime -- it is great!\\n\\n",
            "date": "2008-07-05T00:31:00+00:00",
            "helpful_count": 133,
            "mal_id": 6011,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66491.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sick_Bastard",
                "username": "Sick_Bastard"
            },
            "url": "https://myanimelist.net/reviews.php?id=6011"
        },
        {
            "content": "Oh my word, this has got to be the greatest ninja/shinobi anime ever made.\r\nIt is romantic, gory, action-packed, dramatic, deep and beautiful in every way. \r\nThe story is a revamp of the old Kouga/Iga ninja conflict. It is interesting and involving. The story is a historical piece, but it becomes so much more because it reminds you that the people involved were PEOPLE, who had lives and loves and everything in-between. The plot follows a bloody death match; there's execution-style story-telling, and it reels you in from the first episode to the chilling final one.  \r\nThe art was excellent. Couldn't do any better. Ithas a unique style, the colour pallet  was amazing, the background art was gorgeous and the animation was astounding (excellent fight scenes). \\n\\n\r\nThe characters were deep and three-dimensional. There are more than 10 people you will see who has the focus on the anime on them, but each is interesting and has a backstory to them so it helps us understand who they are. \\n\\n\r\nIf you think Naruto is the greatest ninja anime ever, this isn't for you, because you wouldn't know quality if it stuck you in the eye with a kunai. There was nothing unfabulous about this anime, so do watch it.",
            "date": "2008-10-26T04:48:00+00:00",
            "helpful_count": 114,
            "mal_id": 8968,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=8968"
        },
        {
            "content": "I absolutely adored Basilisk. Firstly, it probably had the most beautiful and well designed graphics in all the animes i have watched. The characters are well drawn, and the backgrounds and sceneries are simply breathtaking. It is most certainly a breath of fresh air from lesser animes with low quality graphics.\r\nSecondly, Basilisk is extremely fast paced. Expect to see lots of action in every episode, and at least one person dying in each episode. This is widely in contrast with slow paced but highly raved about anime like Naruto. Furthermore, the fight scenes are well paced and thought out. It is anyone's guess who getsto fight who next, keeping one in much suspense throughout the show.\\n\\n\r\nAlso, this anime is not just about killing and fighting and killing and fighting. Because, underneath these violence belies the main crux of the story, which is the tragic love between both main characters of the opposing clans which spanned two generations. The final episode is a fitting albeit predictable (to most) ending to the story, and is simply touching. Expect to shed more than a few buckets of tears, if you are the emotional sort.\\n\\n\r\nMoreover, the reminiscence episode in the middle of the series brings in a tone of bittersweet happiness of the characters' past, which showed that the beginning of an acceptance of each clan before the killings started. \\n\\n\r\nLastly, i have to express my surprise that this series is not more well known than it is. And has grown to become one of my favorite animes. Highly recommended to all.",
            "date": "2008-03-31T10:04:00+00:00",
            "helpful_count": 82,
            "mal_id": 3511,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38510.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nugget05",
                "username": "nugget05"
            },
            "url": "https://myanimelist.net/reviews.php?id=3511"
        },
        {
            "content": "* CONTAINS MAJOR SPOILERS*\nI don't normally write reviews but i just finished this anime and now i only wish i could go back in time to warn myself to stay away from it. Let me say this, i don't doubt that many people enjoyed this very much and i am sure lots of people consider this to be a great anime. So i am writing this review for people like me, people that aren't soulless emotionless individuals who enjoy watching the suffering of others. After reading most of the reviews for this i was expecting to see an anime with a lot of good ninjafights some tragedy and some romance. So i guess in that sense i was not disappointed. but there is a limit to how much tragedy i can see in an anime and still enjoy it. I guess i should have been tipped off when i read people comparing this to Romeo and Juliet, but i went ahead and watched it anyway, now i know better. \\n\\n\nStory: There may be reasons i don't like this anime but i am not here to simply trash it. So i will try to be objective here. I give the story an 8, aside from being thoroughly depressing the story was pretty good. It wasn't entirely unique but all in all they did a good job telling it. There was the initial romance which i enjoyed, the fighting was always intense and since you didn't know what everyones abilities were right from the start it kept you guessing at what was going to happen in each fight, and there were also some twists in it that i didn't see coming initially. \\n\\n\nArt: I gave the art an 8, it was good but like with the story not outstanding. My biggest problem here would have to with some of the character designs. The characters in this really varied in realism, almost like they took too different shows and combined them. One being more realistic and the other being more science fiction horror. A lot of the characters looked normal even more realist then other anime. But then you have characters that looked entirely inhuman, had grotesque deformities, or ridiculous abilities.\\n\\n\nSound: Again i gave this an 8, it wasn't cluttered with a lot of unnecessary background noise or random sound effects and it did a good job staying consistent with what was going on in the anime.\\n\\n\nCharacter: The characters i gave a 6. this score is lower mainly because most of the characters die before you even really get to know them. Then they try to remedy this by having entire episodes devoted to these characters, in the form of flashbacks and such, after they have already died. I also would have liked more depth into Oboro and Gennosuke, but between all of the fighting and deception there isn't a lot of time for character growth.\\n\\n\nEnjoyment: There isn't a lot i can say here without revealing any spoilers, but i basically gave this a 1 because i didn't enjoy watching it at all. The fights were interesting but tragic and aside from Tenzen, who i was happy to see bite the big one, i never felt good watching these people die sad and tragic deaths. Then to top it all off, i am just going to say it this anime does not have a happy ending, and i am sorry but after 24 depressing episodes i would have liked to at least be able to walk away a little happy, or at least to have been glad that i watched the anime. Instead i was left thinking wow that was a waist time, hell if all i wanted was to feel like crap i could of saved some time and watched the news or pulled my own finger nails out.\\n\\n\nOverall: I gave this a 2 basically because for me what it all boils down to is wether or not i enjoyed the anime. I have watched a lot of anime that have been bad in one or more of these categories, and as long as i went away feeling glad that i spent the time to watch something, i considered it a good anime. This anime wasn't lacking in any particular category, but i thoroughly did not enjoy watching it so i consider this to be a failure of an anime.",
            "date": "2010-01-23T02:52:00+00:00",
            "helpful_count": 29,
            "mal_id": 22616,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Groder",
                "username": "Groder"
            },
            "url": "https://myanimelist.net/reviews.php?id=22616"
        },
        {
            "content": "Embrace the endless fighting, killing, and the hatred and sorrow that come with it. Basilisk brings the viewers into a cycle of war between two powerful ninja clans. Throughout centuries, the Iga clan and the Kouga clan have known none other than animosity and vengeance towards each other. Amidst this purgatory, the head of Iga and the head of Kouga love each other and decided to end the centuries of conflict through the act of marriage.\r\nThe story might sound familiar and you might have already predicted their vetoed aspiration to marry might not go smoothly, but Basilisk will still entertain you, not via its compellingstory, but the journey through its death valley and the flesh enriching characters walking on it.\\n\\n\r\nThe highlight of the series is its character designs. The distinct physical appearances that match their unique fighting styles are visually pleasing. On the inside, their individual personalities and the way each character thinks and behaves are unexampled and unmistakably their own. People die mercilessly in Basilisk but none were discarded carelessly. It is clear, with much effort put into defining each of these characters; their deaths are as delineating as they were alive.\\n\\n\r\n“These are not samurais, they are ninjas, and they do not know honour.” A very harsh world is portrayed here. Behind the post of a ninja and their duties to their respective clans, their humanity and emotions surface between battles and through flashbacks. Each character is not just a chess piece to be manipulated at will. They fall in love; are fuelled by personal desires and self-esteem, the characters might not work under their clan jurisdiction in total faith. A lack of oversight from clan leaders might give rise to a costly mistake, for each individual will choose which choice to take themselves.\\n\\n\r\nThe animation is great. The fighting is fluid but each move is profound and every contact is crisp both in visual and sound. The ninjas don’t wear bright orange jackets or have fancy haircuts that give them away like eyesore in the darkness. The art pallet in Basilisk is dark, gloomy and stays true to the hellish period with endless bloodshed when peace is an unobtainable luxury. The supernatural element added to the show makes attacks exciting and unpredictable. Many scenes are gory from decapitation to blood rivers and some rape scenes are present which need a pair of headphones if watching with other ears around. At times, it was irritating to not see clearly such fine animated choreography under a deservedly brighter spotlight.\\n\\n\r\nI watched this in English dubbed. It was pleasing to hear honourifics being spoken out loud comfortably. The voice actresses didn’t waver or fear screaming of pleasure in those sex scenes, and the males were never afraid to pronounce bizarre exclaims. However, the girls were too quiet in certain dialogue, but this is usual in English dubbed anime. Sound effects were good. Shout out to its latter ending soundtrack.\\n\\n\r\nBasilisk doesn’t cram fanservice but Gonzo certainly knows how to draw the female body parts, from lips to legs, in an erotic manner. The nudity is far between, but when on screen it doesn’t inflate to eclipse the action.\\n\\n\r\nA strong contender for the historical, adventure genre, Basilisk is Gonzo at their best.\\n",
            "date": "2013-10-07T09:15:00+00:00",
            "helpful_count": 24,
            "mal_id": 115903,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1115101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BoaCC",
                "username": "BoaCC"
            },
            "url": "https://myanimelist.net/reviews.php?id=115903"
        },
        {
            "content": "Ouroboros is a symbol from ancient Greece which depicts a serpent that devours its own tail. It often symbolizes the cycle of rebirth, a cycle that constantly begins anew and never ends. Why am I referencing Ouroboros? I felt it was the only appropriate comparison to make with Basilisk, the story of hatred that is born anew every generation. \r\nTwo rival Ninja Clans, the Kouga and the Iga, have been feuding for over 200 years and only 50 years ago, an anti-war pact was enacted to prevent any further bloodshed. No one remembers or cares to remember how the feud even started but in theminds of both the Kouga and Iga, the reason doesn’t matter.  But now Gennosuke, young leader of the Kouga ninja, falls in love with the beautiful leader of the Iga, Oboro. Together, they hope they can end the longstanding feud between their two clans. However, the pact that prevented the clans from massacring one another just nullified. Will their love endure amidst the hatred and bloodshed that has plagued their clans for centuries?\\n\\n\r\nBasilisk is a show that will challenge your fortitude. The violence is visceral, and the story maintains a bleak tone throughout. Basilisk succeeds at showing hatred at its essence. Characters commit ghastly acts towards one another, throwing away any ounce of humanity they once had.  The story starts off relatively light in tone but gradually delves deeper murkiest parts of human depravity. Day after day, ninjas on both sides of the war are killed off like gnats in increasingly depraved ways. Ninjas on both sides are not afraid to use the vilest methods of torture and violence to make their enemies suffer. And each death not only puts a strain on their comrades, but also strains the relationship between Gennosuke and Oboro. The war causes a struggle between their hearts and minds as they ask themselves, “Am I able to kill the one I love?” They are stuck between their responsibilities as the leaders of their clans, and their romantic relationship. This dilemma makes the show much more engaging because it has a noticeable effect on both characters and makes it easier for the viewer to sympathize with them.\\n\r\nBasilisk is, in part, an action show. However, the battles rely on wit and cunning as opposed to sheer brawn. The ninjas on both sides have a plethora of unique powers and abilities at their disposal and use them in interesting ways. Most of the battles are relatively quick but are very tense as it is hard to tell who will win or lose.\\n\\n\r\nBasilisk’s cast is quite expansive. It has a cast of over 20 characters with 10 major characters in each clan. Not every character gets development but in this story it isn’t necessary. Some characters die early on and as a result, we learn little about them and develop no attachment to them. But it is all purposeful because the deaths of these characters facilitate the development of other characters. Throughout the story, relationships between characters become increasingly complex due to their feelings towards one another becoming increasingly pronounced. The supporting characters themselves are all relatively simple in terms of depth but still memorable in their own right.\\n\\n\r\n The story centers on the romance between the main couple. Gennosuke is a stern, honorable ninja who will do what is necessary to preserve the peace and protect those closest to him. Oboro is a clumsy ninja who is inept at combat but has a strong will a maternal aura around her. And despite her being emotional and clumsy, she also has a strong will and will do anything to protect her loved ones. The contrast between these two characters creates for fantastic chemistry as the love they share feels real. The moments they spend together are heartfelt and intimate and add an extra layer of believability as they express their dreams and profess how much they care for on another. \\n\\n\r\nHowever, with all of Basilisk’s strong points there are undoubtedly a few weaknesses. I felt the world building wasn’t adequate. I felt the setting of feudal Japan needed to be fleshed out a bit more because there was a political subplot which was reintroduced several times in the story but not adequately expanded upon. This is a big issue considering politics played a pivotal role in the story. I would’ve liked two stories occurring at the same time, one dealing with politics and the other dealing with the ninja. I feel this is appropriate especially do the epic feel of the story. There is a lot of room for potential and it disappointed me to see it not taken advantage of. Another issue I had with the story deals with a particular character named Tenzen. The show tried to establish a backstory for him but it was done in such a muddled way that it was basically incomprehensible. When you consider that his motivation, backstory and origin of his unique ability were one of the major mysteries of the show, you would assume it would be handled more competently.\\n\\n\r\nNormally, I would give Basilisk a 7 but I am not going to. Why? Because it ended on an incredibly strong note that not only tied everything up, but it was also incredibly moving. The ending was handled with such precision and care that I couldn’t help but bump it up. It isn’t too often that show has such a phenomenal ending and I believe that deserves praise.\\n\\n\r\nBasilisk is a romantic tragedy that succeeds when it is at its darkest. It is unrelenting in its depiction of violence, perversion and brutality but it isn’t just cruel. At its heart, Basilisk is a tale of love and compassion that is being counterbalanced by hatred and animosity. By the end of the show, you will receive chills every time you read the words, “And so my beloved….please die.” \\n",
            "date": "2015-03-30T20:27:00+00:00",
            "helpful_count": 19,
            "mal_id": 184173,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1325759.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PoeticJustice",
                "username": "PoeticJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=184173"
        },
        {
            "content": "In 1614 Japan, there is a dispute poisoning the tokugawa shogunate, over which grandson of Leyasu, the retired shogun, will assume power when Hidetada, Leyasu's son, decides to step down from his current position as shogun. This conflict threatens to tear the whole of Japan apart if not settled soon. In order to settle this growning conflict it has been decided that the the peace agreement between the Iga and Kouga ninja clans be abolished in order to renew their ancient feud. Instead of this governmental dispute becoming a problem for the whole of Japan, a small scale war has been arranged. The ten topninja of each clan is to take part in this affair, and the clan to have the last shinobi breathing is the victor.\\n\\n\r\nThe storyline plays out in this way. To begin the bloodshed, the heads of the clan (past lovers separated by trajedy and hatred) kill one another and the scene is set for the decimation of both clans. The Iga are able to intercept the news first, and kill the messenger of the Kouga clan. They take an early lead in the bloodshed, killing a number of Kouga members before Gennosuke and Oboro (the new clan heads and betrothed couple) are even informed. But when Gennosuke gets word not only is the union of the clans in shambles but the terrible power of his eyes is also revealed. Despite all this, he is a level headed man, yearning for peace. So he and the remanents of his people head out to confront Hittori Hanzo about the purpose of this conflict. The Iga (after Oboro binds her eyes which possess their own power) is led by the powerful and seemingly immortal Tenzen, whose goal is to stop them on their path. by the time both clans reach their destination there are only two members of each left fighting. And even in the last two episodes watchers are still left wondering not only which clan will be the victor, but even whether or not love has the power to blind the eyes of this ancient predjudice.\\n\\n\r\nI both loved and hated this anime. It was a simplistic story but brilliantly handled. Although the powers of the characters was a little far-fetched at times their development in the story was heart wrenching. This was one of those rare animes that get the watcher attached to every character, by inserting well-placed bits of character history and personality quirks; but at the same time does not lead to an anemic plot or boring fillers. I have to admit that i Cried over every death from Hotarubi until Gennosuke. I do not cry often but it was the product of brilliant story weaving, I am a sucker for good character development. The music of this anime was very good but it was missing a little bit of something, at one or two places the theme music for the characters and things did not fit as well as I would have liked. But, overall it was very appropriate for the time period and mood. This is a 10/10 for me. This is THE BEST ninja anime in a very long time; the pinnacle of this genre! The percentage of character development and fluff to fighting was perfectly balanced just enough to keep watchers on the edge of their seats at all times wanting more. Everyone who is a fan of good, quality storylines need to see this anime.",
            "date": "2009-04-17T11:09:00+00:00",
            "helpful_count": 17,
            "mal_id": 14253,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171839.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ZetsumeiSeikirai",
                "username": "ZetsumeiSeikirai"
            },
            "url": "https://myanimelist.net/reviews.php?id=14253"
        },
        {
            "content": "One of the most interesting action packed shonens I have ever seen, this show deserves far more credit then its received, truly a show that&rsquo;s gone under the radar for some time. Incredible characters, incredible storyline and drama, with very intense moments. With that said what makes this anime so great? Its style is one thing, the show doesnt leave you a moment to breath, it immediately jumps into the conflict and pushes its viewers into the middle of a giant epic battle between two warring ninja clans.\r\nOn one side is Genouske, the head Ninja of one clan and Oboro the head of the otherclan. The two love each other but now have both their clans in a battle with each other and no way of avoiding the inevitable clash.\\n\\n\r\nBasilisk is indeed my favorite Ninja anime of all time, for Naruto fans I will use both in comparison since many people know of Naruto. First of all basilisk gives the true real life sense of being a ninja. basilisk has fantasy like battles if you enjoy those,  but it primarily focuses on Ninja tactics of assassination and stealth. Naruto is more about a child looking to become the greatest(hmm pokemon? ). \\n\\n\r\nEvery battle is eye popping violence with incredible animation and a very unique style of fighting. Even though its a Shonen, the show boasts a very strong romance story line which makes each episode that much better. \\n\\n\r\nIf nothing else if you enjoy crazy fighting mixed with a very epic tale of two lovers, then you will really enjoy this show, basilisk is one of my favorite Animes and I recommend  you get your hands on it now if you wish to be blown away\\n\\n",
            "date": "2008-09-11T22:10:00+00:00",
            "helpful_count": 16,
            "mal_id": 7873,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91846.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Alderban",
                "username": "Alderban"
            },
            "url": "https://myanimelist.net/reviews.php?id=7873"
        },
        {
            "content": "Normally I try to avoid spoilers in my reviews, but this time it isn't possible. You have been warned. Do not read any further if you don't want to be spoiled.\r\nBasilisk has a simple plot. Two star crossed lovers with families that hate each other end up dying tragically. In spite of the simple concept it's capably done. The basic premise is that these two ninja clans, Koga and Iga, had a treaty that stopped them from killing each other for several years. This treaty is dissipated because the shogun is retiring and hasn't chosen a successor. He has two choices so the clan leadersare asked to choose ten people each. They'll fight to the death to determine which of the two candidates will become the next shogun. This comes at a time when the clans are about to be unified by their next leaders, Gennosuke and Oboro, marrying. The fact that the clans start out in a truce and the tragedy comes from the truce being annulled and them allowing old hatreds to destroy their hope of peace rather than the two lovers not being able to get together is a nice change from the usual story and provides for some good tension. Tenzen makes for a legitimately creepy antagonist. The fact that he comes back to life whenever he dies makes him a significant threat and the fact that he attempts to rape several women and tortures Kagero makes him the kind of unapologetic git who you want to see die. The flashbacks are an effective way to help develop the characters, especially those who die early on. The only major problem with the story is that there's a plot hole. In the beginning Iga finds out that their clans are officially at war first. So they trick Gennosuke and Josuke, another Koga ninja, into visiting their village while five Iga ninja, Tenzen, Hotarubi, Nenki, Koshirou and Rousai, try to secretly kill as many of their opponents as possible. This is a good tactic, the problem is that they leave Gennosuke alive, in spite of secretly killing Josuke. The reason given is that Tenzen doesn't know what Gennosuke's ability is and wants to attack him with caution, but it's a weak explanation since Tenzen and his group attack several other ninja that they don't know the abilities of. They even sneak up to the Koga village where several ninja with unknown abilities are. So, they'll go to an area where there's a virtual army of enemy ninja but they won't execute a sneak attack on one solitary man who's surrounded by their people? That is idiotic and doesn't make any sense.\\n\\n\r\nMoving on to the characters. Most of them are pretty three dimensional and developed either through flashbacks or through the main narrative except for Josuke who's a perverted moron, Tenzen who's a complete sociopath and all of the female characters who fit simple tropes like the frail love interest, the woman defined entirely by her lover or the jealous girl. The character designs are varied, for the men, the women are all traditionally attractive with large breasts and full lips. The abilities are also interesting and range from being able to kill somebody by looking them in the eye, to stretching, to shape shifting to butterflies... Okay, the women have ridiculous abilities. Most of which are virtually useless from a practical standpoint. You have Hotarubi who can distract people with shiny butterflies. Akeginu who can slow people down but, for some reason, has to take off her top to do so, no that isn't a joke, Okoi who can drain someone's blood by entangling them with her body so that she touches their skin with as much of her skin as possible, I know that might seem useful but consider how unlikely you are to be able to do that during an actual fight, and Kagero, who can poison men with her breath when she's either having sex or aroused. We're told that it doesn't work on women, probably because they didn't want to introduce the possibility of yuri. I swear I'm not making that ability up either. You never see Ogen's ability since she dies in the first episode. Oboro doesn't actually have any powers. She can cancel out a person's ninja arts by looking at them, but it's made clear that that's just something she was born with rather than actually developing. They make a big deal about how Oboro tried to learn to fight but remained useless anyway. Okay, martial arts, throwing shuriken, and sword fighting don't work that way. These are all things that you learn through practice and dedication not through having some kind of inborn talent. But she's the frail love interest so she isn't allowed to be competent. All of this makes me think that Segawa Masaki is a misogynistic prick\\n\\n\r\nBasilisk earns a yuri factor of 1/10. All of the women are canonically straight and none of them get scenes that are even slightly suggestive with each other.\\n\\n\r\nThe voice acting, at least in the Japanese version, is very well done. The art is incredible. The fight scenes are awesome, even though most of them end very quickly. My final rating for Basilisk is a 6.3. I considered giving it a 7  but the sheer level of misogyny is just so unpleasant that I couldn't do it. But if you can forgive the gross levels of misogyny it's worth watching once.",
            "date": "2011-06-11T16:23:00+00:00",
            "helpful_count": 14,
            "mal_id": 37764,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=37764"
        },
        {
            "content": "Basilisk is the story about two warring ninja clans who were experiencing a period of peace with both their heirs engaging in an intimate relationship. However, the peace treaty that kept the peace was broken and they were ordered by the emperor to kill each other and the story focuses on the battles that take place and the characters in it.\r\nThe story is a very dark and depressing story. That doesn't mean that it isn't good, in fact i thought it was a very meaningful show but it is quite mature.Those who are not fans of dark shows and prefer something more lighthearted, please avoidthis. Other than that the action in this show was fantastic as displayed through the numerous battles that take place. The romance occurs on a more suttle level but helps to add to the immense drama that unfolds throughout the anime. The story is very different from most animes because of the realism that is emphasized(WARNING:death is common in this show), it is filled with suspense and is unpredictable, definitely worth watching if you don't mind the gore and dark themes present. Another word of caution is that the story can be complicated and may take a while to understand so do give it some patience when watching the show.\\n\\n\r\nThe art was quite good. Since the story takes place in the Tokugawa era, the setting and scenery is very different from your modern day anime. The characters are drawn in a different yet eye-catching manner with dark settings to enhance the atmosphere. Some may complain that the darkness in the setting acts in contradiction and may make it harder to see what's going on so do expect this at some parts. Otherwise the blood and gore may not be so appeasing to the eyes but nonetheless provide realism to the story.\\n\\n\r\nThe sound was probably the worst area in the show. The voice actors were fairly ok. But other than that not much was done in the sound department. Only a little background music to enhance the depressing and eerie atmosphere from time to time.\\n\\n\r\nCharacters might i say were the best part of this show. Each characters was given some depth and we get to see the story from these characters perspectives from tim to time not just the main characters' perspective. Each character is elaborated on to show their reasons for their actions and it also serves to create more drama in the show. Many meaningful and deep messages are embedded in the thoughts and actions of the characters. And from the sheer number fo characters that were present in the show i must say that the producers did a fairly good job.\\n\\n\r\nI enjoyed he fighting scenes in the show due to its more unique and lifelike styles, unlike the shonen styles. The blood(gore) makes the battles more real and life-threatening and therefore builds up the suspense that makes the audience hunger for more at the end of each episode(WARNING:can be addictive). Comedy is evidently absent in this dark and dramatic anime. Thus i found the story interesting and meaningful more than enjoyable in the sense of fun.\\n\\n\r\nIn conclusion, This show is meant for a mature audience due to the violence gore and partial nudity. Besides that the dark tones make it unpleasant to the lighthearted but otherwise bring out a meaningful and engaging story. If you are looking for some action and drama then this anime may be worth trying, but be aware that it is complex and requires patient and deep understanding.\\n\\n\r\nAnd for those who do enjoy the anime, there is also a movie produced based on this story. The name of the movie is &quot;Shinobi&quot;, not bad at all, though slightly different from the anime.",
            "date": "2008-10-24T08:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 8904,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=8904"
        },
        {
            "content": "If you want to lose faith in humanity or enjoy a show with heavy gore without a real plot, this is the show for you.\r\nI thought I could handle gore since I'd done so with SNK. I also read all the glowing reviews about this show, so I gave it a go. \r\nArt- 3/10 Poor- The art style and character designs for several characters were so beautifully dramatic. They were probably the best things in this anime. If there there wasn't several characters that were freakishly deformed monstrosities and there wasn't so many close up shots of the nude curvy women (since the guys wesee nude are only the freakish characters), I would have given the art style a 8/10.  \\n\\n\r\nCharacters- 1/10 Pathetic - You don't get to learn much about the characters because there is so much death. Regardless, I didn't want to know about most of them considering how they were almost all ruthless killers.The bonds within each clan is hardly expressed and it seems fake when it is. \\n\\n\r\nPlot- 1/10 Pathetic -This show is much more violent than SNK. Not to mention there's very little lingering/remorse after a character dies. About 90% of it is violent, grotesque, and nightmarish killing/plotting and remaining 10%is about the star-crossed lovers who give the impression that they're actually bad actors pretending to be in love. I watched to the end because I thought there would be a bright ending for this show's Romeo and Juliet... *spoiler alert star* sadly they were just as dumb as Romeo and Juliet *spoiler alert end*. Some characters purposefully get into fights they're obviously not going to win by any means, which is frustrating. There was a \"purpose\" to the all the murders, but it seemed like blood shed for absolutely no reason other than blood lust. Also, I'm not a fan of rape and attempted rape in shows. \\n\\n\r\nMusic & Voice Acting- 4/10 Decent- Nothing really stood out to me, other than the fact that the voice actors and characters matched pretty well. The background music was okay.\\n\\n\r\nOverall enjoyment- 1/10 Pathetic- I didn't enjoy it at all. If someone wanted to torture me with a show, this is is the show they would use. I loathe for myself for ever watching this gruesome and pointless show. I'm probably scarred for life. \\n",
            "date": "2015-06-15T02:01:00+00:00",
            "helpful_count": 13,
            "mal_id": 190346,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674652.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/midnight_gem",
                "username": "midnight_gem"
            },
            "url": "https://myanimelist.net/reviews.php?id=190346"
        },
        {
            "content": "I had been meaning to watch this anime for some time, but I didn't expect anything special. To my surprise Basilisk turned out to be an incredibly enjoyable anime. It starts off a bit slow and even confusing, but after a few episodes you start to get the hang of things.\r\nThe plot is basically a Battle Royale or survival game between two clans named Kouga and Iga. Each clan has 10 ninjas or elite warriors with supernatural abilities. Many of these ninjas are amazing characters. You have \"beautiful heroes\" and \"ugly monsters\" on both sides. No clan is fully good or fully evil, which issomething I appreciated a lot. It's up to the viewer which clan to root for. I am #TeamKouga for sure though, mainly because their characters appealed to me more and Iga had one too many rapists...\\n\r\n(There's a central romance to the plot as well.)\\n\\n\r\nI caught myself cheering at times when Kouga used teamwork to outsmart the Iga or to kill them. Gyoubu, the psychically strong \"chameleon\", was involved in a few of those. He was probably my favorite character of all. Rarely do I get this engaged while watching a new anime series. \\n\\n\r\nSome scenes were surprisingly powerful emotionally. A great soundtrack adds to that.  \\n\\n\r\nTo sum it up; Basilisk is a fantastic anime for those looking for medieval action-fantasy with romance.",
            "date": "2017-12-28T08:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 266637,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6184703.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Voldo",
                "username": "Voldo"
            },
            "url": "https://myanimelist.net/reviews.php?id=266637"
        },
        {
            "content": "Right to the point: if you prefer either an uplifting ending or an ending that says the next season will be even better look elsewhere because most (not all) characters want to just kill.\r\nIt's not a horrible series altogether but the journey is much better then the destination, not to speak too highly of the journey though.\r\nThe action, animation, and character design are pretty good. However it's just not my personal taste to end a series with tragedy. If that's your thing though you'll likely enjoy this series.\r\nAlso ninja fans should be delighted to hear that this series is pirate-free.",
            "date": "2009-12-27T23:28:00+00:00",
            "helpful_count": 11,
            "mal_id": 21786,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/114430.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jabcreations",
                "username": "jabcreations"
            },
            "url": "https://myanimelist.net/reviews.php?id=21786"
        },
        {
            "content": "First let me wipe up my tears. \r\nBasilisk: The Kouga Ninja Scrolls is beautiful and heartbreaking. \r\nThe story can only be described as a much more bloody and violent Romeo and Juliet with ninjas instead. The main characters, Gennosuke and Oboro are deeply in love, but each belongs to a different clan. The Kouga and the Iga. The Kouga and Iga have been warring for more than 400 years and the hate between the two is stifling. The only thing that keeps these two clans from literally ripping each others throats out, is the no-hostilities act. But peace is only a fairy tale. This actis nullified upon the decision that a shogun must be picked. And the winning clan, each who supports one future shogun, must fight to the death until only one clan survives. Thus begins a journey of no small amount of bloodshed. \\n\\n\r\nIf you think this is just another prettied up Romeo and Juliet you should prepare yourself. Basilisk is full of violence and blood. Each of the ten members picked from each clan must fight each other. But these battles are heavy and brutal. In each episode someone dies and it is very quick. You meet the 20 people, and then you watch them battle to the death. This story is definitely not for anyone under 14-15 at the least. It is filled with blood, extreme violence, nudity, rape, and sexual themes. My downside with the characters is that you see only some of them once and them bam. Their dead. I was disappointed that a little more history wasn't put into some of the characters. I really wanted to see more of the ones that die early on in the series. But the series was fast paced and it worked well. I was never disappointed with an episode because each one was filled with something new or another battle. And most if not all of the battles ended in one episode. So they weren't prolonging them like most other animes. And the techniques of the ninja? Whoa. Some of them were far beyond what I thought they were going to be. Some were goofy, others were viscous but one person just really pissed me off throughout the entire series. I was happy when he died. \\n\\n\r\nMwhahahha....haha....ha. Ahem. \\n\\n\r\nBut behind all this is a tragedy with no mercy spared. The love was genuine between Oboro and Gennosuke and I hated watching the pain they were both being put through while having to fight each other. It was heart wrenching. I was dreading the end because I felt I knew how it must end. Let's just say that  I ended up shedding a few years worth of tears. So if your the emotional type of person, like me, then be prepared.\\n\\n\r\nThe art of the story of beautiful when they used it, but otherwise some of the characters were, frankly, disgusting. The shogun in the first episode has this huge unreal disgusting growth or abnormality jutting out from his chin. And he's fat and ugly. I think it was detail that made everything about a character stand out. Old people had wrinkles out the butt and fat people had roles the size of Mt. Everest and it was just to the extreme. Most of the women (well the ninja ones) were sexy looking and it really bothered me that their hair covered up their faces like all the time. But otherwise I enjoyed the art style. \\n\\n\r\nGenerally I'm a person who watches anime with romance and happiness. I was depressed when watching this, but also enthralled. I just had to watch to know what happened. The sadness that I felt while watching this series does not stop me from loving it. It is now my top favorite. \\n\\n\r\nThis was also something that I finished in 2 days. Unless you'd like to account for the sleeping I had to do. But since it only spans 24 episodes its quick, enjoyable and well worth the time spent to watch it. A mere weekend would suffice to finish this series. \\n\\n\r\nMy only complaint is that this anime (I haven't read the manga yet) is poorly advertised and known. I hadn't even heard of this until I went searching and saw recommendations for it. And still I didn't decide to watch it until now. Actually I bought it before I watched it (I tend to have good luck when deciding on buying anime before watching it) and I am so happy that I did. It was well beyond worth the money I spent on it. I would recommend this to anyone. Although I suggest you keep a box of tissue's with you on the last disc.",
            "date": "2009-02-21T16:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 12622,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65305.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Suzuhana",
                "username": "Suzuhana"
            },
            "url": "https://myanimelist.net/reviews.php?id=12622"
        },
        {
            "content": "I can't really think of anything to start off this review, so I'll just get right into what I think of Basilisk: Kouga Ninpou Chou.\r\nThe show started off strong, with various characters being introduced with strange but interesting powers. Put in a Romeo and Juliet like love story in between two warring villages, and you have yourself Basilisk: Kouga Ninpou Chou.\r\nHowever, after everything was established, I quickly got disinterested with the whole story. This is due to almost all the characters having no depth or worthwhile personality attached to them. Many of them only had cool powers and an unexplained hatred for the other clan.This is one of the most crucial things to making a decent anime, and Basilisk gets it completely wrong. When characters start dying left and right, how am I supposed to feel bad for them if I barely know anything about them? A lot of them don't even have decent character relationships with one another.\\n\\n\r\nThis leads to a story that gets increasingly repetitive, which ultimately reduces tension and increases predictability. If you ask me, a show that showcases two clans fighting to the death should create a good amount of tension to get you invested in what is being shown to you. I can't get invested into the story if all I am seeing are these meaningless characters getting killed. If Basilisk focused more on these various side characters, it would have been much better off.\\n\\n\r\nThere are a few instances where the anime tries to make us care for these characters, sure, but many of them are not well-integrated into the story at all. Even these few backstories and flashbacks shown don't give us much to grieve upon with these characters, just a bunch of simple stuff that we have seen a million times and done better.\\n\\n\r\nThe Romeo and Juliet storyline between Oboro and Gennosuke is handled decently enough. However, it's a Romeo and Juliet storyline, it pretty hard to make a bad Romeo and Juliet storyline considering how many times it has been done before. Hell, two years after this was released, Gonzo produced an actual Romeo and Juliet anime called Romeo x Juliet. \\n\\n\r\nOboro herself is a pretty okay character. She has well justified reasons for her actions, and has a strong sense of compassion to make up for her lack of physical abilities. I don't favour Gennosuke as much though. He makes pretty confusing decisions, and other than that, he is a stoic character that doesn't talk much, which is pretty run of the mill if you ask me.\\n\\n\r\nI'll talk about one last character before I move on, and that is Yakushiji Tenzen. He is by far the best character in the anime. Talking about him in depth would bring about too many spoilers, but he is very interesting to say the least.\\n\\n\r\nThe fight scenes in the anime are pretty entertaining to watch, and the animation holds up during these scenes. My problem with this is the amount and length of these scenes. Given the studio we are dealing with, this was probably the best course of action to have good looking fights but have them scattered around, but I guess I'm a little too greedy and would have liked just a little more. The artstyle is easy enough to look at, and the character designs were also well-done. \\n\\n\r\nAs for sound, the only thing really worth mentioning is the OP, which is my favourite part of the show (which when you think about it, doesn't say much about the quality of Basilisk as a whole). I watched the show in sub, and the voice acting wasn't bad, but it wasn't up to par with many of the other things I have heard.\\n\\n\r\nBasilisk is a show that could have been so much more. I really only have one problem with it, which is the characters, but they are handled so poorly that it stems to many other parts of the show, including its story, making it a dis-interesting and borderline edgy mess. I get that the show was moreso trying to focus on the depravity of people when pushed into a situation such as this, but that message gets buried underneath the mountain of underdeveloped characters. I can't recommend this show to anyone really, but if it still piques your curiosity, maybe you will find that you like it a lot more than I did.",
            "date": "2015-06-02T12:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 189402,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3231513.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TokyoSanchez",
                "username": "TokyoSanchez"
            },
            "url": "https://myanimelist.net/reviews.php?id=189402"
        },
        {
            "content": "The story about two ninjas who are in love but come from two families that are in a hatred war against each other. As the two ninjas are trying to create peace between their families there is a battle between trying to possess a scroll which will lead to the winning clan being supported by the Tokugawa government and the death of the losing clan.\r\nThere is a lot of amazing kills in this anime, if you like blood  and just a kill after kill after kill type anime you will LOVE this one. The characters are amazing and strong, each have a great powerthat makes it all the more entertaining. \\n\r\nA bit of romance make these genre of anime all the greatest the two fighting for their love but it being very difficult. \\n\\n\r\nIn general if you like historical, ninjas, violence. powerful characters, a strange sense of humor, a bit of nudity and a lot of killing this is an amazing anime",
            "date": "2014-11-24T18:42:00+00:00",
            "helpful_count": 9,
            "mal_id": 169819,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4177575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/koukky",
                "username": "koukky"
            },
            "url": "https://myanimelist.net/reviews.php?id=169819"
        },
        {
            "content": "I usually NEVER watch anime  that involve historical setting and older anime design, but after getting hooked on the 1st episode and finishing the entire series in 3 days, needless to say that I'm glad I picked this one up. This was exactly the type of anime I needed to cleanse my palate after watching one too many Rom-Coms where the pairing I root for neglect to get together...AGAIN! This was a simple Romeo & Juliet story set in the Edo era, but what I appreciate is that the story doesn't necessarily revolve around the love of the couple. I mean, when there areShinobi with a bunch of different 'magical' powers, a 400 year grudge, and political manipulations the story has a host of other places it can veer towards. Don't be fooled though, NO ONE lives happily ever after. What really drew me in were the deaths: it was never as simple as a sword to the heart or even super ninja fighting. Each death was different and, dare I say, beautiful? Near the end when there are only a few people left on either side I was sad to see some characters go though. The only reason I didn'tgive this series a solid 10 was because (SPOILER ALERT) I felt that Gennosuke should have gone on a complete rampage once Oboro killed herself and killed all of those high ranking political manipulators in the Tokugawa  government. I know peace came to both clans after EVERYBODY died, but I still felt a bit gypped. Thanks to this series I won't be so reluctant to venture into historical anime with older design aesthetic.",
            "date": "2014-08-17T17:49:00+00:00",
            "helpful_count": 9,
            "mal_id": 156949,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4027129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Annalisse88",
                "username": "Annalisse88"
            },
            "url": "https://myanimelist.net/reviews.php?id=156949"
        },
        {
            "content": "Normally when people say an anime has \"potential,\" I scoff and think that it's a total excuse for not being able to give it an honest rating. However, I cannot find any other word to describe this anime than \"potential.\"\r\nStory: 7/10\r\nAs the synopsis suggests, the story centers heavily on fighting and action, so there's not that much story development. All you need to know is that the two clans are trying to kill each other. This doesn't dampen the anime in any way since it was intended as an action anime, but I think there was a major issue with pacing. It was both rushedand painfully slow at the same time. By rushed I mean the story needs to kill off 18 characters (there's 10 for each side and obviously it's going to be 1v1 at the end) in a mere 24 episodes. This means many of the characters barely contribute anything to the story (some of them honestly only appear for 10 min and then they die), and I think the story would've been a lot better had they reduced the number of characters per clan. But I know the producers didn't have much control over this since it was based on the manga, but then I wish they would have extended the series to be longer to allow more story development for each character.\\n\r\nBut it was also painfully slow for the action scenes. You'll notice moments in the fights where the two foes just stand and stare at each other for way too long. Normally that kind of stuff builds anticipation, but here they exaggerated it way too much and it gets to the point where you just want the action to start already. \\n\r\nIf they had just fixed these minor pacing problems, the story would have been fantastic. And just keep in mind that this anime is dark; you won't find many comedic scenes that usually come with action anime. \\n\\n\r\nArt: 10/10\\n\r\nI definitely liked this kind of animation style, even though this was my first time watching a historical anime. The people and environment are all nicely drawn, and there's definitely a focus on very dark colors, reflecting the tragic mood of this anime. \\n\\n\r\nSound: 10/10\\n\r\nI think the opening and ending themes were nice, as well as the various themes used in the sad moments. There's also a flute tune which serves as an emotional motif which I thought was extremely fitting of the story. Nothing wrong here.\\n\\n\r\nCharacter: 8/10\\n\r\nI mentioned this previously, but there's very little character development save for 3 or 4 characters, and the other 17 or so are just basically ignored. It was strange because for the 3 or 4 that they developed, they did it extremely well and I found myself becoming pretty attached to the main characters, but the scenes with the minor characters just felt too filler-like because of how brief and undeveloped they were. It was almost like the producers were just looking for excuses to kill off the characters. But you won't be disappointed by the two main characters as you watch each one's love for another shatter from their clan clash and how they struggle between their love for each other and their duties to their families. \\n\\n\r\nEnjoyment:7/10\\n\r\nThe pacing kind of ruined the enjoyment for me, as well as the episodes where all you see is a bunch of minor characters get killed off for no reason. But the anime does pick up near the end however, since most of the characters are dead at that point which left a lot of room for story and character development, so I think the last 5 or so episodes were extremely well done.\\n\\n\r\nOverall: 7/10\\n\r\nI understand a lot of the complaints I had were not the fault of the producers since they had to stick to the manga, but there definitely were some small things that they could have fixed which would have had a major impact. There really was a lot of potential for this anime, but I definitely wouldn't say they did a bad job. If you're looking for action and a dark story, give Basilisk a watch, but don't hope for too much in complex character development or plot twists.",
            "date": "2014-03-30T12:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 137925,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=137925"
        },
        {
            "content": "Okay so first of all the best episodes are the first and the last ones. All of the chracters were actually created perfectly i would love to watch them in a different anime where there isnt so many logical errors and so many deaths.\r\nNormally this many logical errors will bother me but after one point it becomes so funny that i started enjoying the anime but not like seinen more like a comedy anime with all these great chracters specially Tenzen:\r\n*kinda spoiler*\r\nLike he wants  Oboro to forget her lover and care about their clan so he tries to rape her yellig:  IM GONNEGIVE YOU THE SPIRIT OF IGA and then he grabs her boobs yelling: OHH THE BOOBS THAT GENNOUKE SAMA COULDNT TOUCH \\n\\n\r\nNormally i get super angry when someone tries to rape but this was unlogical and funny i  didnt even take it srsly\\n\\n\r\nLike during the whole show everyone dies and dramatic shit actually happens and he just wants some pussy even when in the end..\\n\\n\r\nSo yeah it was just funny but all of the chracters are pretty good (not oboro) ESPECIALLY OGEN AND DANJO",
            "date": "2018-01-29T13:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 270048,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/princessleaa",
                "username": "princessleaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=270048"
        }
    ],
    [
        {
            "content": "I can actually make a 3 word summary for this anime. It would go like this : KILL, KILL, KILL.\r\nHeartless killing, endless dying. That pretty much made up the story. Almost every character was just blood thirsty, all except this anime&rsquo;s Romeo and Juliet, aka Gennosuke and Oboro. It&rsquo;s another story of forbidden love, I suppose. The forbidden love was a foot note for me &ndash; I was more engrossed by the fight scenes and the dramatic deaths of the ninjas.\r\nThe concept was actually new to me, but I was able to understand most of it. I was familiar with Samurai &ndash; themed anime, butI have never watched a serious shinobi anime like this one (that&rsquo;s right &ndash; Flame of Recca doesn&rsquo;t count). I&rsquo;m not sure what separates the two, but from what I notice, Ninjas are less moral and are more likely into killing, that&rsquo;s why the Iga and Kouga ninjas were chosen to fight it out with each other to come up with the decision on who will succeed the third shogun. I am not sure whether or not this really happened (I don&rsquo;t think so) but there were a lot of historical references that were explained (thank God!). It's another opportunity to learn about Japanese culture and history!\\n\\n\r\nSo the characters ended up killing each other in the way they knew how &ndash; using their different techniques of course. They all had unique techniques, from super sticky phlegm to blood sucking skin to deadly glances. These techniques gave spice to the already violent carnage.\\n\\n\r\nLike their techniques, their respective practitioners were equally impressive and different (Although the girls looked alike, and Koshirou and Yashamaru as well). I was sad that some were only shown for a short time, because their personalities and character made it seem like they were going to stick around longer.\\n\\n\r\nI have to commend the voice acting for this one. Even though I&rsquo;m not that fluent in Japanese, I know well enough Japanese slang to tell that the language they&rsquo;re using was the one used in that era. They seem to say &ldquo;Gozaimasu&rdquo; a lot. Generally, the seiyus brought out the personalities of their respective characters, and that&rsquo;s always a good thing.\\n\\n\r\nThe drawing style was pretty good, but I found that it can be a bit exaggerated sometimes. Body proportions were kinda weird. Everyone and everything seemed to be big. The women had huge, nipple-less chests (Found out from all the naked girl fight scenes). The men had overly large frames, but they are ninjas so I&rsquo;m not sure about that. The wrinkles on the elders were a bit too extreme. They were kind with Danjou, but poor Ogen. She was so beautiful in her youth and when she got old they made her look REALLY old. There were a lot of hair too - everyone just seemed so hairy. The landscapes and backgrounds were nicely drawn though, and I did detect a hint of CG just to compliment some scenes. I was kinda ticked that a lot of the scenes were in the dark, which made it hard for me to tell what was happening. Oh well, they didn&rsquo;t have light then anyway. When the scenes were during the daytime, you could tell the colors were done nicely and complimented each other instead of clashing with each other.\\n\\n\r\nI noticed there was a great variety of BGM &ndash; most of them were gloomy though. It did fit the series well, but that&rsquo;s about it. They didn&rsquo;t heighten the mood of the scene or anything like that. The opening theme singer&rsquo;s voice (which is actually Oboro&rsquo;s seiyu) sounded a bit operatic, so I didn&rsquo;t like the opening theme that much. I liked both the ending songs though, they seemed more current compared to the opening theme. Anyway, all in all the music fit the mood of the anime.\\n\\n\r\nAgain I was hesitant with this one &ndash; Didn&rsquo;t really want to watch it at first since I thought it was going to be too serious, but it ended up to be very exciting and likable. Let&rsquo;s not forget the violence and gore either, It may seem like I like shojo more, but I actually love violent series just as much.",
            "date": "2007-06-19T04:19:00+00:00",
            "helpful_count": 190,
            "mal_id": 381,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5763.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jet2r0cks",
                "username": "jet2r0cks"
            },
            "url": "https://myanimelist.net/reviews.php?id=381"
        },
        {
            "content": "Story: (9/10) - Great\r\nThe story is simple - two warring ninja clans kill each other. Don't let the simple plot fool you though, there is a forbidden love story thrown into the mix aswell, and that is pulled off well. The best way to describe this would be a ultra-violent Romeo and Juliet sort of story. I enjoyed the story very much, but it had it's flaws. Many of the characters that appear only last for a few episodes, and I felt that they could have been kept along just a bit longer. But, after all, the main premise of this anime is two ninjaclans killing each other, so I'm not really that upset.\\n\\n\r\nArt: (10/10) - Outstanding\\n\r\nThis is some of the best art I have ever seen in Anime, period. I am not exaggerating one bit. Even if you don't like the plot, the sound, or the characters, you should watch this Anime just for the art. If I could rate the art eleven out of ten, I would. Simply epic art. Much detail is put into everything that you see. The backgrounds are rich and colorful, but not too colorful, and seem to pop out of the screen at you. The characters are well designed, and convincing. Even some of the CGI, although it is rarely used, is well done. The only bad point I would give the art would be that some of the characters were designed rather oddly, with massive deformations which takes away from the otherwise blatant realism of this Anime.\\n\\n\r\nSound: 9/10 - Great\\n\r\nThere really isn't much to say about the sound. I watched this series dubbed for the first five episodes then switched over to subtitles. The dub is well done, but it is very strange watching Ninja's in seventeenth century Japan speaking English. The subtitles are well done, but they were a tad bit small for my taste, although I do have rather bad vision. The one bad point about the sound is that a lot of the characters that are voiced are given very unrealistic voices, and it is hard to see a character in real life speaking that way. Also, some of the sound effects are a bit overdone.\\n\\n\r\nCharacter: 8/10 - Very Good\\n\r\nThe characters aren't anything special in themselves, but a good amount of character development is done. As said earlier, the two main characters resemble Romeo and Juliet, in a forbidden love scenario. A complaint I have about the characters is also as mentioned before in the art section -- many of them are massively deformed with huge tumors and the like. I am not sure if they meant to do this to show that they had no modern medicine, but some of the deformations are so over the top that they would be almost impossible in real life unless the character was suffering from a severe case of elephantiasis. Also, some of the characters are killed off way too soon, and I feel that they could have had use in the plot.\\n\\n\r\nEnjoyment - 10/10 - Outstanding\\n\r\nI watched this show in a matter of three days, which is pretty good if you ask me. This series if very, very enjoyable, one of the best around. If you have some spare time, I would recommend putting aside a weekend and marathoning it with some friends. This anime has a rather good re watch value also.\\n\\n\r\nOverall: 9/10 - Great\\n\r\nThis is a very good anime series, and despite some of it's flaws, is a must see for any fan. I would say that about 95% of the people who watch this will like it. I would say that this series is appropriate for children over the age of fifteen, because it does include violence, scenes of rape, nudity, blood, and mildly suggestive themes. Main Verdict - Buy, rent, or download this anime -- it is great!\\n\\n",
            "date": "2008-07-05T00:31:00+00:00",
            "helpful_count": 133,
            "mal_id": 6011,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66491.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sick_Bastard",
                "username": "Sick_Bastard"
            },
            "url": "https://myanimelist.net/reviews.php?id=6011"
        },
        {
            "content": "Oh my word, this has got to be the greatest ninja/shinobi anime ever made.\r\nIt is romantic, gory, action-packed, dramatic, deep and beautiful in every way. \r\nThe story is a revamp of the old Kouga/Iga ninja conflict. It is interesting and involving. The story is a historical piece, but it becomes so much more because it reminds you that the people involved were PEOPLE, who had lives and loves and everything in-between. The plot follows a bloody death match; there's execution-style story-telling, and it reels you in from the first episode to the chilling final one.  \r\nThe art was excellent. Couldn't do any better. Ithas a unique style, the colour pallet  was amazing, the background art was gorgeous and the animation was astounding (excellent fight scenes). \\n\\n\r\nThe characters were deep and three-dimensional. There are more than 10 people you will see who has the focus on the anime on them, but each is interesting and has a backstory to them so it helps us understand who they are. \\n\\n\r\nIf you think Naruto is the greatest ninja anime ever, this isn't for you, because you wouldn't know quality if it stuck you in the eye with a kunai. There was nothing unfabulous about this anime, so do watch it.",
            "date": "2008-10-26T04:48:00+00:00",
            "helpful_count": 114,
            "mal_id": 8968,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/105654.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/iamjoe",
                "username": "iamjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=8968"
        },
        {
            "content": "I absolutely adored Basilisk. Firstly, it probably had the most beautiful and well designed graphics in all the animes i have watched. The characters are well drawn, and the backgrounds and sceneries are simply breathtaking. It is most certainly a breath of fresh air from lesser animes with low quality graphics.\r\nSecondly, Basilisk is extremely fast paced. Expect to see lots of action in every episode, and at least one person dying in each episode. This is widely in contrast with slow paced but highly raved about anime like Naruto. Furthermore, the fight scenes are well paced and thought out. It is anyone's guess who getsto fight who next, keeping one in much suspense throughout the show.\\n\\n\r\nAlso, this anime is not just about killing and fighting and killing and fighting. Because, underneath these violence belies the main crux of the story, which is the tragic love between both main characters of the opposing clans which spanned two generations. The final episode is a fitting albeit predictable (to most) ending to the story, and is simply touching. Expect to shed more than a few buckets of tears, if you are the emotional sort.\\n\\n\r\nMoreover, the reminiscence episode in the middle of the series brings in a tone of bittersweet happiness of the characters' past, which showed that the beginning of an acceptance of each clan before the killings started. \\n\\n\r\nLastly, i have to express my surprise that this series is not more well known than it is. And has grown to become one of my favorite animes. Highly recommended to all.",
            "date": "2008-03-31T10:04:00+00:00",
            "helpful_count": 82,
            "mal_id": 3511,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38510.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nugget05",
                "username": "nugget05"
            },
            "url": "https://myanimelist.net/reviews.php?id=3511"
        },
        {
            "content": "* CONTAINS MAJOR SPOILERS*\nI don't normally write reviews but i just finished this anime and now i only wish i could go back in time to warn myself to stay away from it. Let me say this, i don't doubt that many people enjoyed this very much and i am sure lots of people consider this to be a great anime. So i am writing this review for people like me, people that aren't soulless emotionless individuals who enjoy watching the suffering of others. After reading most of the reviews for this i was expecting to see an anime with a lot of good ninjafights some tragedy and some romance. So i guess in that sense i was not disappointed. but there is a limit to how much tragedy i can see in an anime and still enjoy it. I guess i should have been tipped off when i read people comparing this to Romeo and Juliet, but i went ahead and watched it anyway, now i know better. \\n\\n\nStory: There may be reasons i don't like this anime but i am not here to simply trash it. So i will try to be objective here. I give the story an 8, aside from being thoroughly depressing the story was pretty good. It wasn't entirely unique but all in all they did a good job telling it. There was the initial romance which i enjoyed, the fighting was always intense and since you didn't know what everyones abilities were right from the start it kept you guessing at what was going to happen in each fight, and there were also some twists in it that i didn't see coming initially. \\n\\n\nArt: I gave the art an 8, it was good but like with the story not outstanding. My biggest problem here would have to with some of the character designs. The characters in this really varied in realism, almost like they took too different shows and combined them. One being more realistic and the other being more science fiction horror. A lot of the characters looked normal even more realist then other anime. But then you have characters that looked entirely inhuman, had grotesque deformities, or ridiculous abilities.\\n\\n\nSound: Again i gave this an 8, it wasn't cluttered with a lot of unnecessary background noise or random sound effects and it did a good job staying consistent with what was going on in the anime.\\n\\n\nCharacter: The characters i gave a 6. this score is lower mainly because most of the characters die before you even really get to know them. Then they try to remedy this by having entire episodes devoted to these characters, in the form of flashbacks and such, after they have already died. I also would have liked more depth into Oboro and Gennosuke, but between all of the fighting and deception there isn't a lot of time for character growth.\\n\\n\nEnjoyment: There isn't a lot i can say here without revealing any spoilers, but i basically gave this a 1 because i didn't enjoy watching it at all. The fights were interesting but tragic and aside from Tenzen, who i was happy to see bite the big one, i never felt good watching these people die sad and tragic deaths. Then to top it all off, i am just going to say it this anime does not have a happy ending, and i am sorry but after 24 depressing episodes i would have liked to at least be able to walk away a little happy, or at least to have been glad that i watched the anime. Instead i was left thinking wow that was a waist time, hell if all i wanted was to feel like crap i could of saved some time and watched the news or pulled my own finger nails out.\\n\\n\nOverall: I gave this a 2 basically because for me what it all boils down to is wether or not i enjoyed the anime. I have watched a lot of anime that have been bad in one or more of these categories, and as long as i went away feeling glad that i spent the time to watch something, i considered it a good anime. This anime wasn't lacking in any particular category, but i thoroughly did not enjoy watching it so i consider this to be a failure of an anime.",
            "date": "2010-01-23T02:52:00+00:00",
            "helpful_count": 29,
            "mal_id": 22616,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Groder",
                "username": "Groder"
            },
            "url": "https://myanimelist.net/reviews.php?id=22616"
        },
        {
            "content": "Embrace the endless fighting, killing, and the hatred and sorrow that come with it. Basilisk brings the viewers into a cycle of war between two powerful ninja clans. Throughout centuries, the Iga clan and the Kouga clan have known none other than animosity and vengeance towards each other. Amidst this purgatory, the head of Iga and the head of Kouga love each other and decided to end the centuries of conflict through the act of marriage.\r\nThe story might sound familiar and you might have already predicted their vetoed aspiration to marry might not go smoothly, but Basilisk will still entertain you, not via its compellingstory, but the journey through its death valley and the flesh enriching characters walking on it.\\n\\n\r\nThe highlight of the series is its character designs. The distinct physical appearances that match their unique fighting styles are visually pleasing. On the inside, their individual personalities and the way each character thinks and behaves are unexampled and unmistakably their own. People die mercilessly in Basilisk but none were discarded carelessly. It is clear, with much effort put into defining each of these characters; their deaths are as delineating as they were alive.\\n\\n\r\n“These are not samurais, they are ninjas, and they do not know honour.” A very harsh world is portrayed here. Behind the post of a ninja and their duties to their respective clans, their humanity and emotions surface between battles and through flashbacks. Each character is not just a chess piece to be manipulated at will. They fall in love; are fuelled by personal desires and self-esteem, the characters might not work under their clan jurisdiction in total faith. A lack of oversight from clan leaders might give rise to a costly mistake, for each individual will choose which choice to take themselves.\\n\\n\r\nThe animation is great. The fighting is fluid but each move is profound and every contact is crisp both in visual and sound. The ninjas don’t wear bright orange jackets or have fancy haircuts that give them away like eyesore in the darkness. The art pallet in Basilisk is dark, gloomy and stays true to the hellish period with endless bloodshed when peace is an unobtainable luxury. The supernatural element added to the show makes attacks exciting and unpredictable. Many scenes are gory from decapitation to blood rivers and some rape scenes are present which need a pair of headphones if watching with other ears around. At times, it was irritating to not see clearly such fine animated choreography under a deservedly brighter spotlight.\\n\\n\r\nI watched this in English dubbed. It was pleasing to hear honourifics being spoken out loud comfortably. The voice actresses didn’t waver or fear screaming of pleasure in those sex scenes, and the males were never afraid to pronounce bizarre exclaims. However, the girls were too quiet in certain dialogue, but this is usual in English dubbed anime. Sound effects were good. Shout out to its latter ending soundtrack.\\n\\n\r\nBasilisk doesn’t cram fanservice but Gonzo certainly knows how to draw the female body parts, from lips to legs, in an erotic manner. The nudity is far between, but when on screen it doesn’t inflate to eclipse the action.\\n\\n\r\nA strong contender for the historical, adventure genre, Basilisk is Gonzo at their best.\\n",
            "date": "2013-10-07T09:15:00+00:00",
            "helpful_count": 24,
            "mal_id": 115903,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1115101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BoaCC",
                "username": "BoaCC"
            },
            "url": "https://myanimelist.net/reviews.php?id=115903"
        },
        {
            "content": "Ouroboros is a symbol from ancient Greece which depicts a serpent that devours its own tail. It often symbolizes the cycle of rebirth, a cycle that constantly begins anew and never ends. Why am I referencing Ouroboros? I felt it was the only appropriate comparison to make with Basilisk, the story of hatred that is born anew every generation. \r\nTwo rival Ninja Clans, the Kouga and the Iga, have been feuding for over 200 years and only 50 years ago, an anti-war pact was enacted to prevent any further bloodshed. No one remembers or cares to remember how the feud even started but in theminds of both the Kouga and Iga, the reason doesn’t matter.  But now Gennosuke, young leader of the Kouga ninja, falls in love with the beautiful leader of the Iga, Oboro. Together, they hope they can end the longstanding feud between their two clans. However, the pact that prevented the clans from massacring one another just nullified. Will their love endure amidst the hatred and bloodshed that has plagued their clans for centuries?\\n\\n\r\nBasilisk is a show that will challenge your fortitude. The violence is visceral, and the story maintains a bleak tone throughout. Basilisk succeeds at showing hatred at its essence. Characters commit ghastly acts towards one another, throwing away any ounce of humanity they once had.  The story starts off relatively light in tone but gradually delves deeper murkiest parts of human depravity. Day after day, ninjas on both sides of the war are killed off like gnats in increasingly depraved ways. Ninjas on both sides are not afraid to use the vilest methods of torture and violence to make their enemies suffer. And each death not only puts a strain on their comrades, but also strains the relationship between Gennosuke and Oboro. The war causes a struggle between their hearts and minds as they ask themselves, “Am I able to kill the one I love?” They are stuck between their responsibilities as the leaders of their clans, and their romantic relationship. This dilemma makes the show much more engaging because it has a noticeable effect on both characters and makes it easier for the viewer to sympathize with them.\\n\r\nBasilisk is, in part, an action show. However, the battles rely on wit and cunning as opposed to sheer brawn. The ninjas on both sides have a plethora of unique powers and abilities at their disposal and use them in interesting ways. Most of the battles are relatively quick but are very tense as it is hard to tell who will win or lose.\\n\\n\r\nBasilisk’s cast is quite expansive. It has a cast of over 20 characters with 10 major characters in each clan. Not every character gets development but in this story it isn’t necessary. Some characters die early on and as a result, we learn little about them and develop no attachment to them. But it is all purposeful because the deaths of these characters facilitate the development of other characters. Throughout the story, relationships between characters become increasingly complex due to their feelings towards one another becoming increasingly pronounced. The supporting characters themselves are all relatively simple in terms of depth but still memorable in their own right.\\n\\n\r\n The story centers on the romance between the main couple. Gennosuke is a stern, honorable ninja who will do what is necessary to preserve the peace and protect those closest to him. Oboro is a clumsy ninja who is inept at combat but has a strong will a maternal aura around her. And despite her being emotional and clumsy, she also has a strong will and will do anything to protect her loved ones. The contrast between these two characters creates for fantastic chemistry as the love they share feels real. The moments they spend together are heartfelt and intimate and add an extra layer of believability as they express their dreams and profess how much they care for on another. \\n\\n\r\nHowever, with all of Basilisk’s strong points there are undoubtedly a few weaknesses. I felt the world building wasn’t adequate. I felt the setting of feudal Japan needed to be fleshed out a bit more because there was a political subplot which was reintroduced several times in the story but not adequately expanded upon. This is a big issue considering politics played a pivotal role in the story. I would’ve liked two stories occurring at the same time, one dealing with politics and the other dealing with the ninja. I feel this is appropriate especially do the epic feel of the story. There is a lot of room for potential and it disappointed me to see it not taken advantage of. Another issue I had with the story deals with a particular character named Tenzen. The show tried to establish a backstory for him but it was done in such a muddled way that it was basically incomprehensible. When you consider that his motivation, backstory and origin of his unique ability were one of the major mysteries of the show, you would assume it would be handled more competently.\\n\\n\r\nNormally, I would give Basilisk a 7 but I am not going to. Why? Because it ended on an incredibly strong note that not only tied everything up, but it was also incredibly moving. The ending was handled with such precision and care that I couldn’t help but bump it up. It isn’t too often that show has such a phenomenal ending and I believe that deserves praise.\\n\\n\r\nBasilisk is a romantic tragedy that succeeds when it is at its darkest. It is unrelenting in its depiction of violence, perversion and brutality but it isn’t just cruel. At its heart, Basilisk is a tale of love and compassion that is being counterbalanced by hatred and animosity. By the end of the show, you will receive chills every time you read the words, “And so my beloved….please die.” \\n",
            "date": "2015-03-30T20:27:00+00:00",
            "helpful_count": 19,
            "mal_id": 184173,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1325759.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PoeticJustice",
                "username": "PoeticJustice"
            },
            "url": "https://myanimelist.net/reviews.php?id=184173"
        },
        {
            "content": "In 1614 Japan, there is a dispute poisoning the tokugawa shogunate, over which grandson of Leyasu, the retired shogun, will assume power when Hidetada, Leyasu's son, decides to step down from his current position as shogun. This conflict threatens to tear the whole of Japan apart if not settled soon. In order to settle this growning conflict it has been decided that the the peace agreement between the Iga and Kouga ninja clans be abolished in order to renew their ancient feud. Instead of this governmental dispute becoming a problem for the whole of Japan, a small scale war has been arranged. The ten topninja of each clan is to take part in this affair, and the clan to have the last shinobi breathing is the victor.\\n\\n\r\nThe storyline plays out in this way. To begin the bloodshed, the heads of the clan (past lovers separated by trajedy and hatred) kill one another and the scene is set for the decimation of both clans. The Iga are able to intercept the news first, and kill the messenger of the Kouga clan. They take an early lead in the bloodshed, killing a number of Kouga members before Gennosuke and Oboro (the new clan heads and betrothed couple) are even informed. But when Gennosuke gets word not only is the union of the clans in shambles but the terrible power of his eyes is also revealed. Despite all this, he is a level headed man, yearning for peace. So he and the remanents of his people head out to confront Hittori Hanzo about the purpose of this conflict. The Iga (after Oboro binds her eyes which possess their own power) is led by the powerful and seemingly immortal Tenzen, whose goal is to stop them on their path. by the time both clans reach their destination there are only two members of each left fighting. And even in the last two episodes watchers are still left wondering not only which clan will be the victor, but even whether or not love has the power to blind the eyes of this ancient predjudice.\\n\\n\r\nI both loved and hated this anime. It was a simplistic story but brilliantly handled. Although the powers of the characters was a little far-fetched at times their development in the story was heart wrenching. This was one of those rare animes that get the watcher attached to every character, by inserting well-placed bits of character history and personality quirks; but at the same time does not lead to an anemic plot or boring fillers. I have to admit that i Cried over every death from Hotarubi until Gennosuke. I do not cry often but it was the product of brilliant story weaving, I am a sucker for good character development. The music of this anime was very good but it was missing a little bit of something, at one or two places the theme music for the characters and things did not fit as well as I would have liked. But, overall it was very appropriate for the time period and mood. This is a 10/10 for me. This is THE BEST ninja anime in a very long time; the pinnacle of this genre! The percentage of character development and fluff to fighting was perfectly balanced just enough to keep watchers on the edge of their seats at all times wanting more. Everyone who is a fan of good, quality storylines need to see this anime.",
            "date": "2009-04-17T11:09:00+00:00",
            "helpful_count": 17,
            "mal_id": 14253,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/171839.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ZetsumeiSeikirai",
                "username": "ZetsumeiSeikirai"
            },
            "url": "https://myanimelist.net/reviews.php?id=14253"
        },
        {
            "content": "One of the most interesting action packed shonens I have ever seen, this show deserves far more credit then its received, truly a show that&rsquo;s gone under the radar for some time. Incredible characters, incredible storyline and drama, with very intense moments. With that said what makes this anime so great? Its style is one thing, the show doesnt leave you a moment to breath, it immediately jumps into the conflict and pushes its viewers into the middle of a giant epic battle between two warring ninja clans.\r\nOn one side is Genouske, the head Ninja of one clan and Oboro the head of the otherclan. The two love each other but now have both their clans in a battle with each other and no way of avoiding the inevitable clash.\\n\\n\r\nBasilisk is indeed my favorite Ninja anime of all time, for Naruto fans I will use both in comparison since many people know of Naruto. First of all basilisk gives the true real life sense of being a ninja. basilisk has fantasy like battles if you enjoy those,  but it primarily focuses on Ninja tactics of assassination and stealth. Naruto is more about a child looking to become the greatest(hmm pokemon? ). \\n\\n\r\nEvery battle is eye popping violence with incredible animation and a very unique style of fighting. Even though its a Shonen, the show boasts a very strong romance story line which makes each episode that much better. \\n\\n\r\nIf nothing else if you enjoy crazy fighting mixed with a very epic tale of two lovers, then you will really enjoy this show, basilisk is one of my favorite Animes and I recommend  you get your hands on it now if you wish to be blown away\\n\\n",
            "date": "2008-09-11T22:10:00+00:00",
            "helpful_count": 16,
            "mal_id": 7873,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91846.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Alderban",
                "username": "Alderban"
            },
            "url": "https://myanimelist.net/reviews.php?id=7873"
        },
        {
            "content": "Normally I try to avoid spoilers in my reviews, but this time it isn't possible. You have been warned. Do not read any further if you don't want to be spoiled.\r\nBasilisk has a simple plot. Two star crossed lovers with families that hate each other end up dying tragically. In spite of the simple concept it's capably done. The basic premise is that these two ninja clans, Koga and Iga, had a treaty that stopped them from killing each other for several years. This treaty is dissipated because the shogun is retiring and hasn't chosen a successor. He has two choices so the clan leadersare asked to choose ten people each. They'll fight to the death to determine which of the two candidates will become the next shogun. This comes at a time when the clans are about to be unified by their next leaders, Gennosuke and Oboro, marrying. The fact that the clans start out in a truce and the tragedy comes from the truce being annulled and them allowing old hatreds to destroy their hope of peace rather than the two lovers not being able to get together is a nice change from the usual story and provides for some good tension. Tenzen makes for a legitimately creepy antagonist. The fact that he comes back to life whenever he dies makes him a significant threat and the fact that he attempts to rape several women and tortures Kagero makes him the kind of unapologetic git who you want to see die. The flashbacks are an effective way to help develop the characters, especially those who die early on. The only major problem with the story is that there's a plot hole. In the beginning Iga finds out that their clans are officially at war first. So they trick Gennosuke and Josuke, another Koga ninja, into visiting their village while five Iga ninja, Tenzen, Hotarubi, Nenki, Koshirou and Rousai, try to secretly kill as many of their opponents as possible. This is a good tactic, the problem is that they leave Gennosuke alive, in spite of secretly killing Josuke. The reason given is that Tenzen doesn't know what Gennosuke's ability is and wants to attack him with caution, but it's a weak explanation since Tenzen and his group attack several other ninja that they don't know the abilities of. They even sneak up to the Koga village where several ninja with unknown abilities are. So, they'll go to an area where there's a virtual army of enemy ninja but they won't execute a sneak attack on one solitary man who's surrounded by their people? That is idiotic and doesn't make any sense.\\n\\n\r\nMoving on to the characters. Most of them are pretty three dimensional and developed either through flashbacks or through the main narrative except for Josuke who's a perverted moron, Tenzen who's a complete sociopath and all of the female characters who fit simple tropes like the frail love interest, the woman defined entirely by her lover or the jealous girl. The character designs are varied, for the men, the women are all traditionally attractive with large breasts and full lips. The abilities are also interesting and range from being able to kill somebody by looking them in the eye, to stretching, to shape shifting to butterflies... Okay, the women have ridiculous abilities. Most of which are virtually useless from a practical standpoint. You have Hotarubi who can distract people with shiny butterflies. Akeginu who can slow people down but, for some reason, has to take off her top to do so, no that isn't a joke, Okoi who can drain someone's blood by entangling them with her body so that she touches their skin with as much of her skin as possible, I know that might seem useful but consider how unlikely you are to be able to do that during an actual fight, and Kagero, who can poison men with her breath when she's either having sex or aroused. We're told that it doesn't work on women, probably because they didn't want to introduce the possibility of yuri. I swear I'm not making that ability up either. You never see Ogen's ability since she dies in the first episode. Oboro doesn't actually have any powers. She can cancel out a person's ninja arts by looking at them, but it's made clear that that's just something she was born with rather than actually developing. They make a big deal about how Oboro tried to learn to fight but remained useless anyway. Okay, martial arts, throwing shuriken, and sword fighting don't work that way. These are all things that you learn through practice and dedication not through having some kind of inborn talent. But she's the frail love interest so she isn't allowed to be competent. All of this makes me think that Segawa Masaki is a misogynistic prick\\n\\n\r\nBasilisk earns a yuri factor of 1/10. All of the women are canonically straight and none of them get scenes that are even slightly suggestive with each other.\\n\\n\r\nThe voice acting, at least in the Japanese version, is very well done. The art is incredible. The fight scenes are awesome, even though most of them end very quickly. My final rating for Basilisk is a 6.3. I considered giving it a 7  but the sheer level of misogyny is just so unpleasant that I couldn't do it. But if you can forgive the gross levels of misogyny it's worth watching once.",
            "date": "2011-06-11T16:23:00+00:00",
            "helpful_count": 14,
            "mal_id": 37764,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=37764"
        },
        {
            "content": "Basilisk is the story about two warring ninja clans who were experiencing a period of peace with both their heirs engaging in an intimate relationship. However, the peace treaty that kept the peace was broken and they were ordered by the emperor to kill each other and the story focuses on the battles that take place and the characters in it.\r\nThe story is a very dark and depressing story. That doesn't mean that it isn't good, in fact i thought it was a very meaningful show but it is quite mature.Those who are not fans of dark shows and prefer something more lighthearted, please avoidthis. Other than that the action in this show was fantastic as displayed through the numerous battles that take place. The romance occurs on a more suttle level but helps to add to the immense drama that unfolds throughout the anime. The story is very different from most animes because of the realism that is emphasized(WARNING:death is common in this show), it is filled with suspense and is unpredictable, definitely worth watching if you don't mind the gore and dark themes present. Another word of caution is that the story can be complicated and may take a while to understand so do give it some patience when watching the show.\\n\\n\r\nThe art was quite good. Since the story takes place in the Tokugawa era, the setting and scenery is very different from your modern day anime. The characters are drawn in a different yet eye-catching manner with dark settings to enhance the atmosphere. Some may complain that the darkness in the setting acts in contradiction and may make it harder to see what's going on so do expect this at some parts. Otherwise the blood and gore may not be so appeasing to the eyes but nonetheless provide realism to the story.\\n\\n\r\nThe sound was probably the worst area in the show. The voice actors were fairly ok. But other than that not much was done in the sound department. Only a little background music to enhance the depressing and eerie atmosphere from time to time.\\n\\n\r\nCharacters might i say were the best part of this show. Each characters was given some depth and we get to see the story from these characters perspectives from tim to time not just the main characters' perspective. Each character is elaborated on to show their reasons for their actions and it also serves to create more drama in the show. Many meaningful and deep messages are embedded in the thoughts and actions of the characters. And from the sheer number fo characters that were present in the show i must say that the producers did a fairly good job.\\n\\n\r\nI enjoyed he fighting scenes in the show due to its more unique and lifelike styles, unlike the shonen styles. The blood(gore) makes the battles more real and life-threatening and therefore builds up the suspense that makes the audience hunger for more at the end of each episode(WARNING:can be addictive). Comedy is evidently absent in this dark and dramatic anime. Thus i found the story interesting and meaningful more than enjoyable in the sense of fun.\\n\\n\r\nIn conclusion, This show is meant for a mature audience due to the violence gore and partial nudity. Besides that the dark tones make it unpleasant to the lighthearted but otherwise bring out a meaningful and engaging story. If you are looking for some action and drama then this anime may be worth trying, but be aware that it is complex and requires patient and deep understanding.\\n\\n\r\nAnd for those who do enjoy the anime, there is also a movie produced based on this story. The name of the movie is &quot;Shinobi&quot;, not bad at all, though slightly different from the anime.",
            "date": "2008-10-24T08:04:00+00:00",
            "helpful_count": 13,
            "mal_id": 8904,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=8904"
        },
        {
            "content": "If you want to lose faith in humanity or enjoy a show with heavy gore without a real plot, this is the show for you.\r\nI thought I could handle gore since I'd done so with SNK. I also read all the glowing reviews about this show, so I gave it a go. \r\nArt- 3/10 Poor- The art style and character designs for several characters were so beautifully dramatic. They were probably the best things in this anime. If there there wasn't several characters that were freakishly deformed monstrosities and there wasn't so many close up shots of the nude curvy women (since the guys wesee nude are only the freakish characters), I would have given the art style a 8/10.  \\n\\n\r\nCharacters- 1/10 Pathetic - You don't get to learn much about the characters because there is so much death. Regardless, I didn't want to know about most of them considering how they were almost all ruthless killers.The bonds within each clan is hardly expressed and it seems fake when it is. \\n\\n\r\nPlot- 1/10 Pathetic -This show is much more violent than SNK. Not to mention there's very little lingering/remorse after a character dies. About 90% of it is violent, grotesque, and nightmarish killing/plotting and remaining 10%is about the star-crossed lovers who give the impression that they're actually bad actors pretending to be in love. I watched to the end because I thought there would be a bright ending for this show's Romeo and Juliet... *spoiler alert star* sadly they were just as dumb as Romeo and Juliet *spoiler alert end*. Some characters purposefully get into fights they're obviously not going to win by any means, which is frustrating. There was a \"purpose\" to the all the murders, but it seemed like blood shed for absolutely no reason other than blood lust. Also, I'm not a fan of rape and attempted rape in shows. \\n\\n\r\nMusic & Voice Acting- 4/10 Decent- Nothing really stood out to me, other than the fact that the voice actors and characters matched pretty well. The background music was okay.\\n\\n\r\nOverall enjoyment- 1/10 Pathetic- I didn't enjoy it at all. If someone wanted to torture me with a show, this is is the show they would use. I loathe for myself for ever watching this gruesome and pointless show. I'm probably scarred for life. \\n",
            "date": "2015-06-15T02:01:00+00:00",
            "helpful_count": 13,
            "mal_id": 190346,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674652.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/midnight_gem",
                "username": "midnight_gem"
            },
            "url": "https://myanimelist.net/reviews.php?id=190346"
        },
        {
            "content": "I had been meaning to watch this anime for some time, but I didn't expect anything special. To my surprise Basilisk turned out to be an incredibly enjoyable anime. It starts off a bit slow and even confusing, but after a few episodes you start to get the hang of things.\r\nThe plot is basically a Battle Royale or survival game between two clans named Kouga and Iga. Each clan has 10 ninjas or elite warriors with supernatural abilities. Many of these ninjas are amazing characters. You have \"beautiful heroes\" and \"ugly monsters\" on both sides. No clan is fully good or fully evil, which issomething I appreciated a lot. It's up to the viewer which clan to root for. I am #TeamKouga for sure though, mainly because their characters appealed to me more and Iga had one too many rapists...\\n\r\n(There's a central romance to the plot as well.)\\n\\n\r\nI caught myself cheering at times when Kouga used teamwork to outsmart the Iga or to kill them. Gyoubu, the psychically strong \"chameleon\", was involved in a few of those. He was probably my favorite character of all. Rarely do I get this engaged while watching a new anime series. \\n\\n\r\nSome scenes were surprisingly powerful emotionally. A great soundtrack adds to that.  \\n\\n\r\nTo sum it up; Basilisk is a fantastic anime for those looking for medieval action-fantasy with romance.",
            "date": "2017-12-28T08:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 266637,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6184703.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Voldo",
                "username": "Voldo"
            },
            "url": "https://myanimelist.net/reviews.php?id=266637"
        },
        {
            "content": "Right to the point: if you prefer either an uplifting ending or an ending that says the next season will be even better look elsewhere because most (not all) characters want to just kill.\r\nIt's not a horrible series altogether but the journey is much better then the destination, not to speak too highly of the journey though.\r\nThe action, animation, and character design are pretty good. However it's just not my personal taste to end a series with tragedy. If that's your thing though you'll likely enjoy this series.\r\nAlso ninja fans should be delighted to hear that this series is pirate-free.",
            "date": "2009-12-27T23:28:00+00:00",
            "helpful_count": 11,
            "mal_id": 21786,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/114430.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/jabcreations",
                "username": "jabcreations"
            },
            "url": "https://myanimelist.net/reviews.php?id=21786"
        },
        {
            "content": "First let me wipe up my tears. \r\nBasilisk: The Kouga Ninja Scrolls is beautiful and heartbreaking. \r\nThe story can only be described as a much more bloody and violent Romeo and Juliet with ninjas instead. The main characters, Gennosuke and Oboro are deeply in love, but each belongs to a different clan. The Kouga and the Iga. The Kouga and Iga have been warring for more than 400 years and the hate between the two is stifling. The only thing that keeps these two clans from literally ripping each others throats out, is the no-hostilities act. But peace is only a fairy tale. This actis nullified upon the decision that a shogun must be picked. And the winning clan, each who supports one future shogun, must fight to the death until only one clan survives. Thus begins a journey of no small amount of bloodshed. \\n\\n\r\nIf you think this is just another prettied up Romeo and Juliet you should prepare yourself. Basilisk is full of violence and blood. Each of the ten members picked from each clan must fight each other. But these battles are heavy and brutal. In each episode someone dies and it is very quick. You meet the 20 people, and then you watch them battle to the death. This story is definitely not for anyone under 14-15 at the least. It is filled with blood, extreme violence, nudity, rape, and sexual themes. My downside with the characters is that you see only some of them once and them bam. Their dead. I was disappointed that a little more history wasn't put into some of the characters. I really wanted to see more of the ones that die early on in the series. But the series was fast paced and it worked well. I was never disappointed with an episode because each one was filled with something new or another battle. And most if not all of the battles ended in one episode. So they weren't prolonging them like most other animes. And the techniques of the ninja? Whoa. Some of them were far beyond what I thought they were going to be. Some were goofy, others were viscous but one person just really pissed me off throughout the entire series. I was happy when he died. \\n\\n\r\nMwhahahha....haha....ha. Ahem. \\n\\n\r\nBut behind all this is a tragedy with no mercy spared. The love was genuine between Oboro and Gennosuke and I hated watching the pain they were both being put through while having to fight each other. It was heart wrenching. I was dreading the end because I felt I knew how it must end. Let's just say that  I ended up shedding a few years worth of tears. So if your the emotional type of person, like me, then be prepared.\\n\\n\r\nThe art of the story of beautiful when they used it, but otherwise some of the characters were, frankly, disgusting. The shogun in the first episode has this huge unreal disgusting growth or abnormality jutting out from his chin. And he's fat and ugly. I think it was detail that made everything about a character stand out. Old people had wrinkles out the butt and fat people had roles the size of Mt. Everest and it was just to the extreme. Most of the women (well the ninja ones) were sexy looking and it really bothered me that their hair covered up their faces like all the time. But otherwise I enjoyed the art style. \\n\\n\r\nGenerally I'm a person who watches anime with romance and happiness. I was depressed when watching this, but also enthralled. I just had to watch to know what happened. The sadness that I felt while watching this series does not stop me from loving it. It is now my top favorite. \\n\\n\r\nThis was also something that I finished in 2 days. Unless you'd like to account for the sleeping I had to do. But since it only spans 24 episodes its quick, enjoyable and well worth the time spent to watch it. A mere weekend would suffice to finish this series. \\n\\n\r\nMy only complaint is that this anime (I haven't read the manga yet) is poorly advertised and known. I hadn't even heard of this until I went searching and saw recommendations for it. And still I didn't decide to watch it until now. Actually I bought it before I watched it (I tend to have good luck when deciding on buying anime before watching it) and I am so happy that I did. It was well beyond worth the money I spent on it. I would recommend this to anyone. Although I suggest you keep a box of tissue's with you on the last disc.",
            "date": "2009-02-21T16:51:00+00:00",
            "helpful_count": 10,
            "mal_id": 12622,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65305.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Suzuhana",
                "username": "Suzuhana"
            },
            "url": "https://myanimelist.net/reviews.php?id=12622"
        },
        {
            "content": "I can't really think of anything to start off this review, so I'll just get right into what I think of Basilisk: Kouga Ninpou Chou.\r\nThe show started off strong, with various characters being introduced with strange but interesting powers. Put in a Romeo and Juliet like love story in between two warring villages, and you have yourself Basilisk: Kouga Ninpou Chou.\r\nHowever, after everything was established, I quickly got disinterested with the whole story. This is due to almost all the characters having no depth or worthwhile personality attached to them. Many of them only had cool powers and an unexplained hatred for the other clan.This is one of the most crucial things to making a decent anime, and Basilisk gets it completely wrong. When characters start dying left and right, how am I supposed to feel bad for them if I barely know anything about them? A lot of them don't even have decent character relationships with one another.\\n\\n\r\nThis leads to a story that gets increasingly repetitive, which ultimately reduces tension and increases predictability. If you ask me, a show that showcases two clans fighting to the death should create a good amount of tension to get you invested in what is being shown to you. I can't get invested into the story if all I am seeing are these meaningless characters getting killed. If Basilisk focused more on these various side characters, it would have been much better off.\\n\\n\r\nThere are a few instances where the anime tries to make us care for these characters, sure, but many of them are not well-integrated into the story at all. Even these few backstories and flashbacks shown don't give us much to grieve upon with these characters, just a bunch of simple stuff that we have seen a million times and done better.\\n\\n\r\nThe Romeo and Juliet storyline between Oboro and Gennosuke is handled decently enough. However, it's a Romeo and Juliet storyline, it pretty hard to make a bad Romeo and Juliet storyline considering how many times it has been done before. Hell, two years after this was released, Gonzo produced an actual Romeo and Juliet anime called Romeo x Juliet. \\n\\n\r\nOboro herself is a pretty okay character. She has well justified reasons for her actions, and has a strong sense of compassion to make up for her lack of physical abilities. I don't favour Gennosuke as much though. He makes pretty confusing decisions, and other than that, he is a stoic character that doesn't talk much, which is pretty run of the mill if you ask me.\\n\\n\r\nI'll talk about one last character before I move on, and that is Yakushiji Tenzen. He is by far the best character in the anime. Talking about him in depth would bring about too many spoilers, but he is very interesting to say the least.\\n\\n\r\nThe fight scenes in the anime are pretty entertaining to watch, and the animation holds up during these scenes. My problem with this is the amount and length of these scenes. Given the studio we are dealing with, this was probably the best course of action to have good looking fights but have them scattered around, but I guess I'm a little too greedy and would have liked just a little more. The artstyle is easy enough to look at, and the character designs were also well-done. \\n\\n\r\nAs for sound, the only thing really worth mentioning is the OP, which is my favourite part of the show (which when you think about it, doesn't say much about the quality of Basilisk as a whole). I watched the show in sub, and the voice acting wasn't bad, but it wasn't up to par with many of the other things I have heard.\\n\\n\r\nBasilisk is a show that could have been so much more. I really only have one problem with it, which is the characters, but they are handled so poorly that it stems to many other parts of the show, including its story, making it a dis-interesting and borderline edgy mess. I get that the show was moreso trying to focus on the depravity of people when pushed into a situation such as this, but that message gets buried underneath the mountain of underdeveloped characters. I can't recommend this show to anyone really, but if it still piques your curiosity, maybe you will find that you like it a lot more than I did.",
            "date": "2015-06-02T12:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 189402,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3231513.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TokyoSanchez",
                "username": "TokyoSanchez"
            },
            "url": "https://myanimelist.net/reviews.php?id=189402"
        },
        {
            "content": "The story about two ninjas who are in love but come from two families that are in a hatred war against each other. As the two ninjas are trying to create peace between their families there is a battle between trying to possess a scroll which will lead to the winning clan being supported by the Tokugawa government and the death of the losing clan.\r\nThere is a lot of amazing kills in this anime, if you like blood  and just a kill after kill after kill type anime you will LOVE this one. The characters are amazing and strong, each have a great powerthat makes it all the more entertaining. \\n\r\nA bit of romance make these genre of anime all the greatest the two fighting for their love but it being very difficult. \\n\\n\r\nIn general if you like historical, ninjas, violence. powerful characters, a strange sense of humor, a bit of nudity and a lot of killing this is an amazing anime",
            "date": "2014-11-24T18:42:00+00:00",
            "helpful_count": 9,
            "mal_id": 169819,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4177575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/koukky",
                "username": "koukky"
            },
            "url": "https://myanimelist.net/reviews.php?id=169819"
        },
        {
            "content": "I usually NEVER watch anime  that involve historical setting and older anime design, but after getting hooked on the 1st episode and finishing the entire series in 3 days, needless to say that I'm glad I picked this one up. This was exactly the type of anime I needed to cleanse my palate after watching one too many Rom-Coms where the pairing I root for neglect to get together...AGAIN! This was a simple Romeo & Juliet story set in the Edo era, but what I appreciate is that the story doesn't necessarily revolve around the love of the couple. I mean, when there areShinobi with a bunch of different 'magical' powers, a 400 year grudge, and political manipulations the story has a host of other places it can veer towards. Don't be fooled though, NO ONE lives happily ever after. What really drew me in were the deaths: it was never as simple as a sword to the heart or even super ninja fighting. Each death was different and, dare I say, beautiful? Near the end when there are only a few people left on either side I was sad to see some characters go though. The only reason I didn'tgive this series a solid 10 was because (SPOILER ALERT) I felt that Gennosuke should have gone on a complete rampage once Oboro killed herself and killed all of those high ranking political manipulators in the Tokugawa  government. I know peace came to both clans after EVERYBODY died, but I still felt a bit gypped. Thanks to this series I won't be so reluctant to venture into historical anime with older design aesthetic.",
            "date": "2014-08-17T17:49:00+00:00",
            "helpful_count": 9,
            "mal_id": 156949,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4027129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Annalisse88",
                "username": "Annalisse88"
            },
            "url": "https://myanimelist.net/reviews.php?id=156949"
        },
        {
            "content": "Normally when people say an anime has \"potential,\" I scoff and think that it's a total excuse for not being able to give it an honest rating. However, I cannot find any other word to describe this anime than \"potential.\"\r\nStory: 7/10\r\nAs the synopsis suggests, the story centers heavily on fighting and action, so there's not that much story development. All you need to know is that the two clans are trying to kill each other. This doesn't dampen the anime in any way since it was intended as an action anime, but I think there was a major issue with pacing. It was both rushedand painfully slow at the same time. By rushed I mean the story needs to kill off 18 characters (there's 10 for each side and obviously it's going to be 1v1 at the end) in a mere 24 episodes. This means many of the characters barely contribute anything to the story (some of them honestly only appear for 10 min and then they die), and I think the story would've been a lot better had they reduced the number of characters per clan. But I know the producers didn't have much control over this since it was based on the manga, but then I wish they would have extended the series to be longer to allow more story development for each character.\\n\r\nBut it was also painfully slow for the action scenes. You'll notice moments in the fights where the two foes just stand and stare at each other for way too long. Normally that kind of stuff builds anticipation, but here they exaggerated it way too much and it gets to the point where you just want the action to start already. \\n\r\nIf they had just fixed these minor pacing problems, the story would have been fantastic. And just keep in mind that this anime is dark; you won't find many comedic scenes that usually come with action anime. \\n\\n\r\nArt: 10/10\\n\r\nI definitely liked this kind of animation style, even though this was my first time watching a historical anime. The people and environment are all nicely drawn, and there's definitely a focus on very dark colors, reflecting the tragic mood of this anime. \\n\\n\r\nSound: 10/10\\n\r\nI think the opening and ending themes were nice, as well as the various themes used in the sad moments. There's also a flute tune which serves as an emotional motif which I thought was extremely fitting of the story. Nothing wrong here.\\n\\n\r\nCharacter: 8/10\\n\r\nI mentioned this previously, but there's very little character development save for 3 or 4 characters, and the other 17 or so are just basically ignored. It was strange because for the 3 or 4 that they developed, they did it extremely well and I found myself becoming pretty attached to the main characters, but the scenes with the minor characters just felt too filler-like because of how brief and undeveloped they were. It was almost like the producers were just looking for excuses to kill off the characters. But you won't be disappointed by the two main characters as you watch each one's love for another shatter from their clan clash and how they struggle between their love for each other and their duties to their families. \\n\\n\r\nEnjoyment:7/10\\n\r\nThe pacing kind of ruined the enjoyment for me, as well as the episodes where all you see is a bunch of minor characters get killed off for no reason. But the anime does pick up near the end however, since most of the characters are dead at that point which left a lot of room for story and character development, so I think the last 5 or so episodes were extremely well done.\\n\\n\r\nOverall: 7/10\\n\r\nI understand a lot of the complaints I had were not the fault of the producers since they had to stick to the manga, but there definitely were some small things that they could have fixed which would have had a major impact. There really was a lot of potential for this anime, but I definitely wouldn't say they did a bad job. If you're looking for action and a dark story, give Basilisk a watch, but don't hope for too much in complex character development or plot twists.",
            "date": "2014-03-30T12:44:00+00:00",
            "helpful_count": 8,
            "mal_id": 137925,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=137925"
        },
        {
            "content": "Okay so first of all the best episodes are the first and the last ones. All of the chracters were actually created perfectly i would love to watch them in a different anime where there isnt so many logical errors and so many deaths.\r\nNormally this many logical errors will bother me but after one point it becomes so funny that i started enjoying the anime but not like seinen more like a comedy anime with all these great chracters specially Tenzen:\r\n*kinda spoiler*\r\nLike he wants  Oboro to forget her lover and care about their clan so he tries to rape her yellig:  IM GONNEGIVE YOU THE SPIRIT OF IGA and then he grabs her boobs yelling: OHH THE BOOBS THAT GENNOUKE SAMA COULDNT TOUCH \\n\\n\r\nNormally i get super angry when someone tries to rape but this was unlogical and funny i  didnt even take it srsly\\n\\n\r\nLike during the whole show everyone dies and dramatic shit actually happens and he just wants some pussy even when in the end..\\n\\n\r\nSo yeah it was just funny but all of the chracters are pretty good (not oboro) ESPECIALLY OGEN AND DANJO",
            "date": "2018-01-29T13:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 270048,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/princessleaa",
                "username": "princessleaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=270048"
        }
    ],
    [
        {
            "content": "A great piece of art. I wish other animes had such depth and strong storyline. It's amazing how authors pictured the phenomena of the blind hatred between people, when both sides think they're 'different' and treat the other side as animals rather than humans, although virtually being identical human beings and living their life the same way. This story is always present in real life, assuming the fact that the world is drowning in the hatred and blood. \r\nI absolutely love the connection between Gennosuke's idea (stopping pointless hostility) and his doujutsu. He's never harmful except when threatened. What I would also like to mentionis the balance between two rival sides, it's very important that in such kind of story there's no spoiled one -- both clans don't regret to use nasty tricks and all sorts of deception when it comes to slaying enemy ninja. So it's only a question of your choice which side to support.\\n\\n\r\nFinally, there's a special part inside my heart for Hyoma. Imo, this full of wisdom character is the authors gentle way to touch the topic of Zen. He's the image of absolutely enlightened person or absolutely Present, (if you know what I mean), so that he even doesn't need any eye vision. I would not disagree with people who call the part where Hyoma and young Gennosuke are practicing a 'filler'. The culmination of that episode is brilliant, when they reach the top of the mountain and young Gennosuke refuses to remove the eye bandage because he can feel and enjoy the moment without seeing details and analyzing them with his mind and that's when he obtains his real inner power. \\n\\n\r\nGenerally, the idea of inner power is dominant in this anime. It's absolutely clear from the last episode and the end of that ninja scroll story and those who 'burst into tears' didn't actually get the main motive of the story. It can be partly gathered from Oboro's and Gennosuke's dialogue about their spirits as two parts of a single one. The ending says that the spiritual power of lovers is so great that there's no necessity to care about their Earth life that much. They finish it with honor and respect to the gore of fallen, doing their best for their loved ones and their clans, then passing away and slowly floating down the stream hugging, which is actually a very touching metaphor for proceeding their travel in the Eternal as the single entity henceforth.\\n\\n\r\nBasilisk deserves 10 out of 10 for each parameter.",
            "date": "2015-05-16T11:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 187981,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/bmxsesh",
                "username": "bmxsesh"
            },
            "url": "https://myanimelist.net/reviews.php?id=187981"
        },
        {
            "content": "Basilisk has an ownage story line with really well drawn battle scenes. Their skills are all unpredictable and you wont know all the skills till the end. there isnt much things that are bad but if you have to say one it would be my favourite character died to early.",
            "date": "2008-02-16T13:32:00+00:00",
            "helpful_count": 7,
            "mal_id": 2543,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36514.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZeSzHoMaRu",
                "username": "ZeSzHoMaRu"
            },
            "url": "https://myanimelist.net/reviews.php?id=2543"
        },
        {
            "content": "Read on my blog with far better presentation: https://rogueshogunate.com/2019/04/27/fantasyjareds-anime-corner-week-2-basilisk-kouga-ninpou-chou/\r\n*MINOR SPOILERS, will warn in advance!*\r\nIf there exists one unanimously shared opinion held by the human race, I would imagine it is, in juvenile terms, that ninja are downright awesome. Whether it be the sheer agility they possess, their determination to succeed, the destructive apparatus frequently associated with them, potentially tragic backstories, or even simply their badass attire (seriously, where the hell do ninja shop for clothing?), I have yet to meet someone who would refer to them as lackadaisical or mundane. Pretend to play the devil’s advocate all you want, but we know what you’re thinkinginside.\\n\\n\r\nOnto today’s show of discussion, however, we are going to look at what has been commonly referred to as one of the bona fide ninja anime experiences. Produced by studio Gonzo and released over the course of 2005 with its fitting 24-episode runtime, a vast majority of people I have come across online seem to agree that Basilisk (sometimes referred to as Basilisk: The Kouga Ninja Scrolls) is an intense, action-packed show with little lacking in the story department. But why Basilisk? What is it that makes this spectacularly stellar Shōgun-centered story of sorrow so special to me and countless other people? How is it that Basilisk, a show seemingly chosen by aleatory means, quickly became my new favorite anime of all time? Fortunately for you guys and gals, that is precisely what I am about to explain.\\n\\n\r\nWe begin with another continuous story, though the interesting thing to note about Basilisk is that most of the episodes actually start with a fascinating little introduction segment that I feel does a damn efficient job at explaining the basic premise.\\n\\n\r\n“Two tribes sworn to hate. Their bloodstained bodies left out in the open to rot. Their souls longing for a peace that they failed to find. As they sought to break the shackles of darkness and heal the wounds of the past, fate denied their quest, and thrust them into war. The bridges of hope some dared to build between them were torn asunder. Their dreams were ripped from their hearts with a sword, with a destiny revealed at last.”\\n\\n\r\nSweet dreams tonight, by the way.\\n\\n\r\n*Story summary nullified thanks to MAL guidelines*\\n\\n\r\nThe first aspect of Basilisk that I must commend rather auspiciously is that between the historical references, constantly rising tension, and depth of the story right off the bat (while still being surprisingly comfortable to jump into despite the mammoth-sized premise), all of the above strongly contribute to an engaging and original tale of tragedy and warfare from beginning to end. The story as a whole plays it surprisingly straight as well, seldom falling back on comedy since the main appeal lies in the serious conflicts and clashes that occur between the opposing factions.\\n\\n\r\nAnother aspect that I find Basilisk to particularly excel in is the pacing department. For instance, virtually every one of the main characters is given just enough screen time to genuinely feel like a real character with their own personalities and motivations. I don’t say a real human because honestly, I would question if some of the tribes’ best fighters are even humans to begin with, but the development is strong and abundant here nonetheless. Perhaps the shining example of this statement lies within our protagonists, Gennosuke and Oboro. These two solemnly believe in a future where their factions can live in harmony, but as a result of the world they live in, they don’t get much of a say in the matter as they cannot change a 400-year long grudge overnight. Because of this, whether they like it or not, the former lovers must grow further apart from each other in their desperate attempt to control the war. Without the solid pacing, this conflict would feel far more trivial and/or less important than it actually is to the story.\\n\\n\r\nThe independent elements of the narrative are also quite strong. To begin with, the main suspense of the story primarily comes from which characters are going to brawl next, and who out of them is going to remain alive. Here, it is predominantly thanks to the enticing scripting, well-established characters, and stunningly thrilling action that the suspense in Basilisk remains as strong as it is.\\n\\n\r\nBut what makes the action in Basilisk work so well? While the fight scenes can border on the short side, whenever they occur, the cinematography thrashes out at the viewer with gory, fast-paced mayhem as the opposing ninja tribes lash out their many attacks and cunning surprises in the process. In that sense, I honestly find Basilisk as the damn poster boy for bloodbaths such as Castlevania, Drifters, and Higurashi no Naku Koro ni. Another point of interest is that it can actually be quite difficult to tell which characters are going to survive in the numerous battles, similar to Akame ga Kill. Furthermore, building upon the compelling cast and noteworthy action is that each of the 10 Kouga and Iga ninja have their own special ninja arts, with each characters’ being distinct, memorable, and most certainly destructive.\\n\\n\r\nTo illustrate this point, take Koshiro Chikuma’s ability. While it is true that he is fantastic at dual-wielding kama (essentially weaponized sickles), Koshiro can also summon what I can only describe as miniature black-hole projectiles simply by softly blowing the air toward his targets. He must have grown up in Black Lagoon’s Roanapur to learn that shit, and here I was hoping he’d be giving out free concussions. At any rate, seeing and learning about each ninja’s signature technique is honestly one of the most fun parts of the show, but for now I shall digress.\\n\\n\r\nAdditionally, the animation and art direction of Basilisk is as tight as 2005 could possibly muster. For starters, the artwork is surprisingly realistic overall, even for some of the tribe members that aren’t meant to be. The backgrounds are also very distinct, as each highly detailed backdrop of the series is carefully crafted around this ancient Japanese flair that I simply cannot get enough of. Moreover, the surroundings are constructed around Japan’s Sengoku period, which end up fitting the theme of Basilisk’s earlier, vicious world incredibly well. That is also to speak nothing of the creative, fitting character designs and fluid consistency all across the board, which provokes me to say with my utmost certainty that the animation in Basilisk spared no expense whatsoever. In fact, if you had told me the show had aired five or so years later, I probably would have believed you.\\n\\n\r\nTo add upon the excellent animation and artwork aspects, cinematography is something I always consider quite heavily when it comes to anime, and Basilisk doesn’t slouch here either. Countless scenes in the series are presented with such visual flair and effort (probably a result of the phenomenal animation), showcasing quickly moving artwork alongside everchanging environments. From forests to dojos, oceans to towns, there exists plenty of variety within the world of Basilisk. These hold particularly true when you get to the copious amounts of fight scenes, which blitz through frames of animation like a cheetah on roller blades.\\n\\n\r\nThe fact that Basilisk gets the sound department as its own talking point really illustrates how strong this aspect of the series is. Starting with the music here, while taste in composition is obviously subjective, I’d imagine it difficult to speak ill against the soundtrack of Basilisk. Above is the opening to the series, which features seamlessly transitioned shots on top of solid choreography all throughout. Good examples of this are Tenzen’s chilling moment in the spotlight around forty seconds in, or Gennosuke playing his recorder with Oboro’s hair blowing against the wind around a minute and twenty seconds in. The song itself is also fantastic, with a nice pace to it that really kicks in around two-thirds into the opening.\\n\\n\r\nI’d imagine it difficult to speak ill against the soundtrack of Basilisk. The opening to the series features seamlessly transitioned shots on top of solid choreography all throughout. Good examples of this are Tenzen’s chilling moment in the spotlight around forty seconds in, or Gennosuke playing his recorder with Oboro’s hair blowing against the wind around a minute and twenty seconds in. The song itself is also fantastic, with a nice pace to it that really kicks in around two-thirds into the opening.\\n\\n\r\nAnother stellar example of Basilisk’s soundtrack is the ending theme, of which there are actually two of. I’ve always personally preferred Hime Murasaki, as I think the instrumentation and tone better match the theme of the show. The other is called Wild Eyes, which sounds surprisingly optimistic for a series such as Basilisk, though it is still a good tune nevertheless.\\n\\n\r\nOf further notice is the spectacular background music which lies within Basilisk. I mentioned earlier the ancient Japanese flair I enjoyed from the backgrounds, and the music aims for the same dartboard in that sense.\\n\\n\r\nFinally, the voice acting I found pretty impressive as a whole. I watched the English Dub to be precise, and despite what some others may tell you, I strongly enjoyed the dub’s voicing of Basilisk’s colorful cast. Each actor matches their respective character role conspicuously well and range from decent to outstanding performances, with my favorite being Mark Stoddard’s take on the mendacious, cruel Tenzen. I have also heard many positive words regarding the Japanese voices, even though I obviously cannot speak for that myself.\\n\\n\r\nAs if Basilisk didn’t have enough going for it already, the series has to be up there with shows like B: The Beginning, Black Cat, and Future Diary as one of my personal favorite casts in the anime world. While the number of supporting characters in Basilisk almost rivals the amount of terrible jokes in 2002’s The Master of Disguise, they are actually rather nicely balanced in terms of screen time and development. I have touched upon Basilisk’s pacing and its impact on the characters earlier, but also worth noting is how unique, relatable, and important most are to the story. C. Jarrett, an Amazon user, has to say about the cast as follows:\\n\\n\r\n“They’re all characters you can buy into. Not one-dimensional heroes who would never exist in the world we live in, they’re characters that have very human flaws, something that’s sorely needed in animated shows in general, and deal with very serious issues in a human and believable way. Gennosuke of the Kouga has a very mature yet zen energy. His unknown ability is revealed in the most shocking and dazzling of ways, frightening the Iga clan into helplessness in one of the most badass anime scenes of all time. Oboro is the perfect compliment, though not to imply she exists to compliment Gennosuke. She’s an incredible, fully-fledged character. Sweet, naive, and gives the story a warmth and innocence the other characters continually take away from the world around her. Her presence is like a personification of their world being torn apart and seeing her lashing out at the inevitability of it all is truly sorrowful. This is how main characters should be. They show insecurities, strengths, weaknesses, and a perseverance at the notion of getting to overcome their situation and see each other again as friends instead of enemies. I bought into them wholeheartedly. You will root for them the whole way which is what makes this a tragic anime through-and-through.”\\n\\n\r\nIf I had to pick a favorite character, I would go with Koshiro Chikuma. I won’t regurgitate his already explained fighting capabilities, but in terms of development, Koshiro is way up there out of the supporting cast. He puts his life on the line to protect Oboro, the Iga heir, but is commonly being pushed around by Tenzen (also of the Iga clan), who we quickly find out to be the primary antagonist in this show. I really sympathize with Koshiro because he is among the most humane members of the Iga tribe when you get down to it (albeit for spoilerific reasons presented further below), but pitted against the Kouga, it’s like his only purpose in life is to kill or be killed. And despite Koshiro’s status as a veteran fighter, the mental pain he is forced to endure as the story progresses really makes the viewer feel for the lad.\\n\\n\r\n*MINOR SPOILERS HERE!*\\n\\n\r\nHowever, it’s when the story picks up after the first third that Koshiro really starts to shine in my eyes. The poor man is utterly blinded after Gennosuke of the Kouga uses his ninja technique on him, and from this point onward his character changes rather conspicuously from a threatening warrior to a thoughtful, emotionally destroyed soul with cognitive dissonance. Koshiro also begins to question Tenzen’s malevolent actions, and whenever Oboro is threatened or put in harm’s way, he practically falls to the ground in a state of melancholic defeat. There is also an incredibly cheerless scene with Koshiro shortly after he’s blinded where someone is approaching him near a river, completely unable to identify who it is. In a state of panic, he attempts to assault the unknown figure, only to figure out that it was only Akeginu of his fellow Iga clan. This emotionally demolishes Koshiro, as losing his vision had almost made him harm one of his own tribe members. Because of these moments and more to come, I feel that he is among the most strongly developed characters in the show and I always enjoy seeing him on screen.\\n\\n\r\n*MINOR SPOILERS END*\\n\\n\r\nOne tangent to note that holds true for both sides, however, is that the more comrades they lose in battle, the tribes don’t just lose offensive support, but legitimate friends as well, with a dedicated flashback episode later in the show exemplifying this perfectly. And while Basilisk makes this incredibly evident for many of the lives lost, further contributing to the tragic aspect of the series, the clans still choose pursue this violent path of chaos that neither side truly benefits from. This is, however, entirely justified within the context of the show.\\n\\n\r\nTo quote ThatAnimeSnob on Reddit, “You aren’t supposed to take the conflict at face value, but rather consider the following: The two factions were training all their lives for fighting. (Jared’s Note: This is illustrated very well regarding one scene in particular, with a discernibly young boy training outside with his mother, albeit against a mere fly.) Due to the 400-year long grudge, they hated each other and wanted to kill every member of the opposing clan. What with the next Shōgun being decided based on who would win, it was important to fight to the death. The ninja weren’t just following these orders, but were happy with them too…Honor was more important than life for them.”\\n\\n\r\nDespite the notable strengths of Basilisk, no piece of fiction on this planet is what I would consider flawless, and even this series is unfortunately not an exception to that rule. Despite this, the drawbacks to Basilisk are thankfully not too severe in the grand scheme of things, I state while desperately attempting not to use the word “however” for the novemdecillionth time.\\n\\n\r\nTo preface this series of points, easily the most heinous of Basilisk’s crimes (in my opinion) is that the tenth episode is a rather ridiculously redundant recap of the show thus far, with some of the elder characters not in the Kouga or Iga reminiscing the current situation in the show. Not only is it presented far too early to leave much impact, but a distinctly minimal portion of the episode is actually dedicated to new information. Toss in the fact that many of the shots are reused animation, and you have bar none the worst episode in the entire series. It’s not abhorrent or anything, and seeing Lord Ieyasu or Masahiro (son of Hanzō the 1st) interpreting prior events is actually quite entertaining, not to mention the brand new parts not being half bad. But countless scenes from prior episodes here are replayed and rehashed pretty shamelessly. Therefore, I must question, the hell was the point of this?\\n\\n\r\nAnother problem I experienced with Basilisk is that I feel some of the characters could have benefited from additional screen time and/or development, such as the blind and commonly silent bodyguard of Gennosuke, Hyouma Muroga. For a vast majority of the early story, he’s just sort of there with the Kouga, which acts as quite the juxtaposition compared to the rest of the clan at that point in the narrative.\\n\\n\r\nIn addition, it’s interesting I bring that up because I have heard a complaint by one person online that Basilisk shouldn’t have focused on story to begin with, but rather the action. This reminds me of a time when I discussed Black Cat with one of my friends, with him stating that if it had focused more on thrilling fight segments rather than dreadfully discombobulating attempts at story, then it would have possessed far more merit. However, while I can agree with the argument a reasonable amount for a show like Black Cat (where the middle can drag on and the ending being somewhat confusing and unneeded), in Basilisk, the entire driving point and area of audience interest comes from the story itself, so I cannot agree with that sentiment for this particular series. Removing the plot in Basilisk would be like reading the text of a Shakespeare play as opposed to watching a live performance of one.\\n\\n\r\nI’ve even heard one person online argue that certain development is “wasted” on certain characters, Gyoubu’s relationship with his father being the example used. And I’m sorry, but I fail to see a world where developing a character and their backstory is a bad thing. Plus, learning more about the ninja and their motivations against each other is one of the biggest aspects of Basilisk storywise, which is why I consider this an especially weak argument.\\n\\n\r\n*Quote nullified due to MAL guidelines*\\n\\n\r\nWhen all is said and done, despite a few shortcomings with the development of some plot points and characters alongside a near pointless recap episode, Basilisk still manages to break through those chains on virtually every other front. The melancholic, action-packed story references history now and again to create an interesting, fictitious twist on a time period that actually occurred in our world. The presentational aspects are phenomenal, with fluid, creative, and consistent animation, artwork, cinematography, and sound design far ahead of its time. Basilisk is also paced very nicely, going quicker than most but remaining engaging in spite of this. And while the characters hold some flaws, their discernible personalities, inherent uniqueness, fantastic designs, and relatability make for one of my favorite casts in all of fiction.\\n\\n\r\nFrom rewatch value to impact, or memorability to sheer enjoyment, Basilisk is a show that I enjoyed on a near unparalleled level as of writing this. Top that off with one of the most bittersweet, heartfelt, and well-written endings that I’ve ever had the pleasure to experience, and you have one hell of a fulfilling great time, with no alcohol required.\\n\\n\r\nBasilisk (2005) can easily be watched for free on Funimation and Crackle’s official websites, the latter being where I watched it, for reference. It is also viewable on Amazon Prime Video and Hulu, though you do have to pay for those. Also be sure not to confuse Basilisk with its supposedly god-awful follow-up made in 2018, Basilisk: The Ouka Ninja Scrolls. For some reason, the ratings all across the board for that one are downright laughable, so avoid running into that mess if you can help it, but I’ll digress there.\\n\\n\r\n“We are all the same in birth and in death. All of us are human. We need to break these bindings of hatred and revenge which hold us. We need to open our eyes to the other side. To the Iga, even if it is only one of them. Then that one we’ll try to know and better understand.”\\n\\n\r\n-Gennosuke Kouga, from Basilisk",
            "date": "2019-04-27T16:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 307277,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5636409.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ToxicJared",
                "username": "ToxicJared"
            },
            "url": "https://myanimelist.net/reviews.php?id=307277"
        },
        {
            "content": "Basilisk: Kouga Ninpou Chou is a Battle Royale anime in which both teams are balanced. There are two teams; Kouga and Iga clans.\r\nBoth sides have ninjas with unique skills. Even if a ninja's skill looks useless, it will still counter another ninja and you will see that \" useless skill \" being a great weapon.\r\nStory is kind of frustrating, I mean it really is stupid. But well, I guess it isn't THAT bad...\r\nSome characters will make you hate them way too much and you will enjoy seeing their demise.\r\nIn the end it is a good anime. Nothing more nothing less",
            "date": "2019-02-01T08:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 300598,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7771170.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheGreatHako",
                "username": "TheGreatHako"
            },
            "url": "https://myanimelist.net/reviews.php?id=300598"
        },
        {
            "content": "When I started watching this anime, after a friend recommended it to me, I didn't really like it too much. The characters that were introduced didn't appeal to me because of their looks, and I didn't understand what was happening. \r\nBut after a few episodes, as the story started to develop and it became clear what the situation in this anime was and I got to know the characters more, I started to like this anime more and more, and I ended up looking forward to every next episode, hence the overall score of a 9. \r\nThe storyline developed at just the right pace, explanaitionwas given where necessary, but there were some things left to the viewers imagination, which I really liked. This anime also contained symbolism of various sorts, which gave the story this extra bit of depth. The plot was never predictable, which made it exciting to watch, again and again. \\n\\n\r\nThe art was a bit different from what I was used to, but I've really come to like it. The way the characters were portrayed was realistic, but not too much. \\n\\n\r\nThe music was very fitting for the setting: traditional Japanese music may require some getting used to, but since it fitted the situations so well it managed to make tears come to my eyes during the final episodes. \\n\\n\r\nIn Basilisk, on of the things I enjoyed most was how the characters really seemed to be real. Their actions were never predictable, their motives gradually showed themselves throughout the series and they were all unique, not simple stereotypes. \\n\\n\r\nAll in all, Basilisk is an anime that will capture you, if you have the patience to wait for the story to establish itself. Real world adult problems are addressed as well, and I am sure that every viewer will be able to identify him/herself with one of the characters in some way, making it worth to watch for anyone, but in particular for those who take an interest in pre-Meiji reformation Japan or ninja's and pride in Japan's old days :P",
            "date": "2015-04-26T15:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 186534,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304300.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PhaiaFox",
                "username": "PhaiaFox"
            },
            "url": "https://myanimelist.net/reviews.php?id=186534"
        },
        {
            "content": "Basilisk is a very good anime to watch.  The different type of fighting styles from each of the 2 ninja clans is very neat to see.  It really is a contest to see who has the best skills among them all.  Being able to infiltrate each others camps, to sneak attacks, to just plain fooling the other side thinking it's this way when it's not.\r\nThe characters were done very well to represent the type of fighting style they used as it reflected who they were and went right along with their personalities.\r\nThe story is the basis of love but the hatred fromthe clans makes it impossible for either side let it happen.  Which is your typical story for most things.  So the fighting is what's gonna make you want to watch each episode to see what all the characters can do.",
            "date": "2009-09-25T10:11:00+00:00",
            "helpful_count": 6,
            "mal_id": 19097,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/234659.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ZeroDesolation",
                "username": "ZeroDesolation"
            },
            "url": "https://myanimelist.net/reviews.php?id=19097"
        },
        {
            "content": "this anime was great i enjoyed it...its lik a romeo n Juliet..i cried at the end of the story that was very sad wat happened to the girl..i didnt think i would lik this anime but boy was i wrong...it was interesting and i was into it all the way to the end..",
            "date": "2009-04-08T21:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 13983,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/10504.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tanola",
                "username": "tanola"
            },
            "url": "https://myanimelist.net/reviews.php?id=13983"
        },
        {
            "content": "Based on the manga by Masaki Segawa which itself is based on the novel The Kouga Ninja Scrolls by Futaro Yamada published in 1958, follows the story of two ninja clans, Tsubagakure of the Iga and Manjidani of Kouga. They are tasked to battle each other to determine which grandson of Tokugawa Ieyasu will become the next shogun. Breaking the peace agreement between the clans, 10 deadly ninja from each clan unleash a century old hatred for each other. \r\nThe 24 episode series was pure entertainment from start to finish. If you were a fan of Ninja Scroll then you will love this series. Oncethe foundations have been set in episode one, what follows is an all out war between the clans. The sheer variety of ninja and their abilities make for some interesting battles. However what hooked me on this series was not the battles, but the step further Gonzo took, in terms of character development for each ninja. You get to understand the motivations of the ninja, why the hatred is there, the suffering some ninja have due to their particular art form. The series has an epic feel about it, due to the moving soundtrack, high quality animation and story. There are scenes which will make you have a lump in your throat - sorry as a man i will not publicy say i cried!! ;) and there is a scene which you will have hatred for one particular hairy ninja!! After all the entertainment of action, violence and nudity, the one thing i did take away from the series, was why? why the need for such bloodshed, such a war. The sacrifices people will do for each other and the love of their people. It also shows how such a war can destroy peoples dreams/lives for political justification, a theme we still see in our times. \\n\\n\r\nThe anime follows the manga pretty closely, but i feel the anime slightly humanises some of the ninja more and in my opinion makes the anime superior. The anime is violent and has nudity, but nothing too excessive, and personally think of it as a mature anime. Animation quality is top notch and shows what Gonzo can do with the right budget. \\n\\n\r\nOpening and closing themes are pretty catchy, shame about the 1 minute speech every episode! Thank god for fast forward. \\n\\n\r\nAll in all highly recommeded series and worth the investment in time if you enjoy historical action tragedy fantasy, with some moving drama. Phew!!",
            "date": "2009-01-02T03:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 10953,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/128420.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mard80",
                "username": "mard80"
            },
            "url": "https://myanimelist.net/reviews.php?id=10953"
        },
        {
            "content": "I remember finding this show on netflix when it very first came out. Kind of looked like the average 20 something episode generic fight slash kill series youd expect, but its a genuinely well written show. It doesnt have many bumps, and progresses through a good amount of story in a short period of time. I definitely enjoyed the large amount of foreshadowing that was subtle, but the references were in plain sight for the viewer to put the pieces together. Romeo and Juliet meet ninja clans would be the easiest way to describe the story.  \r\nI've yet to be more impressed by ananime coming full circle than i was with Basilisk. There was no better way they could have presented the ending, it was tragically beautiful. Simply Perfect.",
            "date": "2016-01-06T15:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 207920,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1389927.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kuramaownsu",
                "username": "kuramaownsu"
            },
            "url": "https://myanimelist.net/reviews.php?id=207920"
        },
        {
            "content": "Ok, so I figured this series would be a hole in one for me... a romantic (whether that be tragic or not) historical, ninja-drama....is right up my alley.  The overarching story is good, one you've heard before ...forbidden love, warring clans, etc... With a slight twist on the reason why, but familiar grounds.\r\nBased on all those things...again normally this would be a home run but ....it was not.  I COULD have been, but wasn't....\r\n**Potential minor spoilers ahead**\r\nSo...considering how truly difficult it was for me to watch this show for pretty much the ENTIRE first half....I mean I literally almost stopped watching it numeroustimes .. I feel my rating of 7 is pretty kind.  And below is where I will tell you what the turning point was and why, etc...\\n\\n\r\nSo for me the story and all that are fine...right, they are good. Sound was fair, art was fine, etc... That leaves the main focal points being characters and story...and we already said story was fine.\\n\\n\r\nThe concept of supernatural abilities and ninjas ...sounds AWESOME to me.  BUT, what failed for me MAJORLY was how it was implemented....to me they took over the top ridiculous ass characters and shoved them into this serious and dramatic show...and if they were meant to be funny, ok, maybe but they just friggin sucked and made me want to stop watching.  It was not until most of those ridiculous ass characters were killed off that I could finally get into the show and enjoy the other really neat characters and story.\\n\\n\r\nFor me the spider/phlegm ninja (really...phlegm, and a spider ball on his back...WTF), a hairy ass ...hair ninja, slimer...literally was like a damn rotten corpse walking around that could turn into ooze, a balloon man, and 90 year old rubber man....  I HATED these characters...every second of screentime they had made me want to rate this damn show a 2 and stop watching it.  The one guy literally had tufts....tufts of hair growing out of his nose, and he could use it to fight with....LOL.  I mean, soooooo stupid.  This TRULY almost killed this show for me....it was just beyond awful.\\n\\n\r\nSo....my advice for anyone wanting to watch a cool supernatural ninja historical drama...is if you like ridiculous ass characters (think One Piece characters - which let me be clear....they WORK fine there...it's a totally different kind of show), maybe you'll LOVE this...but even then, I honestly don't see how anyone could enjoy those chars....  If you're like me though and felt that was over the top stupid to even have those in the show...and you can make it through like 10 or more episodes because you're super persistent....then there may be a silver lining for you.  I will talk about that below...\\n\\n\r\nSo again, for me the above literally RUINED the entire first half of the show for me.  HOWEVER, don't think all the characters were pulled out of the trash like those...others had legit super interesting abilities and were interesting characters....they didn't feel like damn mutants or aliens that found there way in to the wrong damn show.  They had abilities that fit with the setting / story, and were still unique and intriguing.  Some of those great characters though, had WAY too little screentime, while the ones that made me want to shoot myself for watching this seemed to have WAY too much...BUT my point is hang in there, there are really interesting and cool chars.\\n\\n\r\nIf you can get over that first half or that sort of thing doesn't bother you, this really does get much better toward then end.  It's more focused on just a few chars, who are cool, but not alien mutants in a ninja show... so the story really starts to shine a bit better and let's you appreciate the existing chars much better.\\n\\n\r\nI won't speak of the end, as I don't want to give anything away though, but let me just say that if I were to have rated this after the first few episodes...it would've got like a 2...it just seemed over the top stupid to me.  If I would've rated it halfway through, I would have at least gave it say a 5....I started to appreciate the things that I did not loathe more by that point.  BUT....if they would have made the first half more focused on legit ninja/powers and those type of chars.....this show may have got like a 9 from me....maybe....it was great at parts for sure.  BUT I cannot ignore how grueling it was to make it through the first part, so I really do think my 7 is a pretty \"nice\" rating considering that....but I am glad I watched this as the second half had lots of feels, focused on the much better chars, and so I really did enjoy that portion.\\n\\n\r\nIf you decide to watch this...good luck. I think if you love ninja shows, and can get past the oddities that someone decided to throw in here, I really do think you'll enjoy it.  Just hope you are a patient person...",
            "date": "2018-03-17T10:52:00+00:00",
            "helpful_count": 2,
            "mal_id": 274084,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6256102.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stacycmc",
                "username": "Stacycmc"
            },
            "url": "https://myanimelist.net/reviews.php?id=274084"
        },
        {
            "content": "Unlike many of the reviews prior to my own, the story here is a story that far surpasses what was understood.  If you have seen Ninja Scroll (movie & /or series) & The Blade Of Kamui, you can almost tie the 3 movies together.  Not only is there a forbidden, Romeo & Juliet-type love going on here.  This was a time when the government was trying to get rid of both ninja and samurai.  If you go through the characters of these 3 titles, you will run across similar names.  This particular story is indeed a bloody battle of the2 clans, but if you are like me & truly get into the story, it is worth watching.",
            "date": "2010-01-20T00:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 22531,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185188.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jazz007",
                "username": "Jazz007"
            },
            "url": "https://myanimelist.net/reviews.php?id=22531"
        },
        {
            "content": "Basilisk takes a page from Berserk and makes the first episode an intolerable piece of garbage. To say that this anime has one of the worst introductions I've ever seen would be a colossal understatement.\r\nThe first episode is exposition from beginning to end, showing us scenes and characters with absolutely no context to back-up the action in front of us. It is the kind of episode that only makes sense after you've watched the entire series.... and while I am not opposed to heavy exposition in the first episode(s) of a series, Basilisk takes it up to 11 with absolutely incomprehensible jibberish.... so disregard thefirst episode for all that I will say after this point.\\n\\n\\n\r\nSTORY:\\n\r\nThe story is very flimsy and just an excuse to set-up the action of the series. To say that Basilisk's story is token once again, would be an understatement. The basic set up is this; Two rival clans are tasked to fight a proxy war of succession in the name of the Tokugawa Shogunate (Government) and the winner of the war will be rewarded whereas the loser will be destroyed (somehow). The set-up is meaningless and never properly explained beyond \"Fight in our name yata yata yata\".\\n\\n\r\nThe story is not Basilisk's strong point.\\n\\n\\n\r\nART:\\n\r\nThe art of the anime is very strong, it has a very, VERY \"Japanese\" tone and feel to it, possibly the most 'traditional Japanese' style I've seen in an anime. The architecture is lovely and the scenery is often gorgeous. From the simple , almost hut-like inn rooms, to the salt-storage room... to the large Sunpu castle... to the small city structures of Manjidani and Tsubagakure... it is all wonderfully designed and displayed through gorgeous artwork.\\n\\n\r\nThe animation can range from very good to 'just okay' but not once did I ever see a major animation shortcut or significant drop in quality. The creators went to great length to show what they wanted to show as vividly as possible.\\n\\n\r\nIf you care about artistry, this anime will not let you down.\\n\\n\\n\r\nCHARACTER: \\n\r\nThis is where this anime truly shines above everything else. Every single character , and there are a LOT, is developed. Though we don't get into the backstory of each one, even the ones that are not given backstory we can have a pretty good idea of what they're about. Characters like Udono Jousuke, we know are rambunctious, but hilarious, jackasses... characters like Nenki are stuck-up, arrogant and prideful... characters like Gyobu are given brief glimpses of development which tell us exactly where he is coming from, what his motivations are and what his potential weakness is.\\n\\n\r\nThe characterization is so strong that unfortunately, the two main leads 'feel' very weak in comparison. Protagonist Gennosuke and Oboro , the leaders of their respective clans... feel very underdeveloped and underwhelming... their supporting cast is so much stronger and vibrant that we can only resent the show when we are stuck with Gennosuke and Oboro scenes, scenes that drag down the entire show.\\n\\n\r\nIt's a bit hard to explain without revealing spoilers, but from a brilliant cast of grey-morality characters, we have a boring Mary Sue duo that produce almost nothing interesting.... that being said, the supporting cast is so strong that they carry the bland-as-hell leads which almost crush the anime with their dull, plodding George Lucas-esque love story.\\n\\n\\n\\n\r\nOVERALL:\\n\r\nFrom a terrible beginning develops a fantastic anime which ends somewhat anti-climactically. That is to say, the beginning is awful and it drags a bit towards the end, but everything in between is absolute gold. \\n\\n\r\nI know this sounds like strange compliments but;\\n\r\nThe pacing in this show (Aside from the beginning and end) is absolutely perfect.\\n\r\nThe directing in the show is absolutely perfect.\\n\\n\r\nThis show is very well done. The story is garbage, the two main leads are garbage, but everything else was done so well, so effectively that I can honestly give a positive recommendation despite that.\\n\\n\\n\\n\r\nRundown;\\n\r\nIf you like action, especially ninja action, this is for you.\\n\r\nIf you care about art, architecture and traditional Japanese culture, this is for you.\\n\r\nIf you want a complex story with twists and turns; This is NOT for you, do NOT waste your time.\\n\r\nIf you want a strong lead and a deep, well-made love story; This is NOT for you.\\n\\n\r\nOverall, could have been wonderful but as it stands, it is only \"Good\".",
            "date": "2016-02-04T13:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 210105,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061511.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Dominick_Destine",
                "username": "Dominick_Destine"
            },
            "url": "https://myanimelist.net/reviews.php?id=210105"
        },
        {
            "content": "Basilisk is in a nutshell, Romeo and Juliet with ninjas.  The fighting scenes and ninja techniques are phenomenal and there are no orange jumpsuits anywhere.  Real Ninjas.  As in all good anime there are some characters who you will be rooting for and others whom you can't wait to die.  I found myself torn halfway through the series. This anime does a great job of balancing the love story with the fast paced action of ninja combat.  One thing I did not like was the design of most characters the male characters are for the most part gross looking andhalf of the female characters look like raccoons.  In spite of that a very good anime should please fans of many different genres.",
            "date": "2008-12-11T18:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 10303,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118401.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ace9010",
                "username": "Ace9010"
            },
            "url": "https://myanimelist.net/reviews.php?id=10303"
        },
        {
            "content": "It wasn't the worst thing I'd ever seen, but it definitely left me disappointed. I really love historical fiction and its hard to find one that sticks to its period consistently. This one manages to make their supernatural characters feel like Edo period Ninjas in a pretty unique way. Its got a cast of pretty fleshed out characters which is impressive since there are so many. What I dislike about the story is how goddamn depressing everything is. I realize this is supposed to be a brutal tragedy but feel that it was just overdone. It feels like the writers are literally psychopathic sadists asthey find more horrible ways to treat the female protagonist. The poor girl can't catch a break and it veers on the side of fetishized abuse. The male lead goes through his own hardships as well, but nothing like the constant shitting on Oboro. To me the show was much too focused on the senseless violence and emotional whipping around. To really satisfy me, I need just  hint of positive consequence and Basilisk really never gets there. The end is *spoilers* the worst case scenario and any amount of development in the characters really doesn't matter. Development is very thin to begin with and I guess that's the point since the theme is something resembling the \"war never changes \" trope. Still, something should have come out of it besides the extinction of some trouble making tribes. For gore lovers, its great! Just don't go into it thinking its got some deep philosophical purpose or a twist that makes you think. Its a straight forward story about horrible people doing increasingly unspeakable things and receiving justice for it. If it were strictly a killing show, it would be a pretty fun hot-mess. If it were strictly a drama, it would make some pretty smart statements. But throwing the two together at this volume is really jarring and unsatisfying.",
            "date": "2017-05-17T01:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 247892,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5075212.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/matcha_maiden",
                "username": "matcha_maiden"
            },
            "url": "https://myanimelist.net/reviews.php?id=247892"
        },
        {
            "content": "I gave this anime a 6/10 because it has some work behind it and all that.\r\nSHIIIKAAASHI (read that with the voice of the narrator in Gyakkyou Burai Kaiji)\r\nHow can this anime be so praised? To me it's just the work of an author who's so edgy he might fall off a cliff like -spoliers-.\r\nSeriously, the train of thought of this guy was \"Ah.. I don't know how to make people feel sympathy for my characters.. I KNOW, LET'S JUST RAPE AND TORTURE THE WOMEN AND THEN MAYBE THEY WILL FEEL SORRY FOR THEM!\"\r\n!SPOILERS!\r\n\"Eh, this guy has a sister, let's rape and kill her.\"\r\n\"Oh, and whywouldn't we rape the main heroine as well?\"\\n\r\n\"I got an idea, in the lasts episodes, let's rape AND torture this girl (10min strait each)! Wow, that really sounds like a good idea. A woman screaming for 10min is so cool, the people watching will surely feel sorry for her now!\"\\n\r\n! SPOILERS END!\\n\\n\r\nLike, what the absolute F? If you take all of the anime you could make 2 standalone episodes just about rape and torture.\\n\\n\r\nIf you want an anime about impossible love, go watch Akatsuki no Yona.\\n\r\nIf you want an anime with sword fights and special powers, go watch Ninja Scroll.\\n\r\nIf you want something about samurais that is really gory, go read Vagabond.\\n\\n\r\nA dark atmosphere doesn't make an anime a good drama, nor does it make it a good anime in the first place.\\n\\n\r\n(sorry if I made any mistakes, english isn't my primary language)\\n",
            "date": "2016-07-01T02:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 222556,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4866077.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ezecc",
                "username": "Ezecc"
            },
            "url": "https://myanimelist.net/reviews.php?id=222556"
        },
        {
            "content": "I don't usually watch this kind of anime but the blurb at the back of the DVD said it was a romance tragedy and it was spot on. \r\nThis story will have you watching it while holding your seat. I loved how there was more than one romance and how some of the characters used psychology to overcome their enemy. \r\nCharacter design for this is amazing, most characters have a backstory or a current story worth investing in, this even includes the minor characters who will annoy you. \r\nYou will be so into this is may be hard to stop watching. I warn you now.\r\nItsgreat fun and totally worth a watch.",
            "date": "2017-01-24T07:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 239013,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5012949.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sailorchibirose",
                "username": "Sailorchibirose"
            },
            "url": "https://myanimelist.net/reviews.php?id=239013"
        },
        {
            "content": "War is a terrible thing. One should never even wish for it to fell upon him or others. This show portraits the horrors of war in a really good manner. People lose ones they love, and the ending is not always happy.\r\nUnlike many other shows, this one does have the courage to show likeable characters die, and unlike sooo many shows it actually does tell you \"You don't forget the ones that died\".\r\nWow, huge intro to this review, but I really felt that many shows just shrug off the ones that die, and that so many shows have characters that in the end just forgetall those they loved and lost. Luckily this is not one of those.\\n\\n\\n\r\nStory [7]\\n\\n\r\nI wouldn't mind giving story a higher grade than 7, but I can't force myself to do so. Unfortunately (or fortunately, depends how you look at it) the story is pretty generic. It has been said million times so far. A story about two ninja clans in war, two people in love and their followers is nothing new, and if you've seen one of them, you know what this one is like. The difference is how it is played. Luckily, this one doesn't go generic way of killing all but main characters. You will see characters you came to like die in a second, and the ones you expected to live through die next second. There is no safe character in this war/love story.\\n\\n\\n\r\nArt [8]\\n\\n\r\nMeh. I can't say it's bad. But I can't say it's good either. While fighting is nicely done most of the time, characters are just out of proportions and unlike themselves (art meaning)  at other times. The colors, the reflections of sun, the colors of the trees and overall \"atmosphere\" art is really done great.\\n\\n\\n\r\nSound [9]\\n\\n\r\nSoundtrack for this one goes almost completely non-vocal style (I think only exception being op). And it hits top marks with it. Music never interferes with character talks, it never interrupts fights or bothers. It is there almost all the time, you can hear it and enjoy in it, but it's not going to distract you from watching the show. I gave it 9 just because of the fact many, and I mean many characters sounded so similar it was really hard to voice-recognize them. If you don't mind not recognizing characters by their voice, put 10 here.\\n\\n\\n\r\nCharacter [9]\\n\\n\r\nTo start off, huge cast. I see many people mention underdeveloped characters. But I disagree with that. I actually think characters are very well developed. The fact that I cared more for secondary characters than for the main ones tells a lot considering main characters have most of the screen time. 20 characters here in total (some minor ones in background). They go from harmless sexual maniacs to crazy old man. These characters have their emotions, they have their loves and their fears. One of my favorite characters in this shows acts all tough most of the time, but when shown with the one he loved in flashback, it is obvious even he enjoys peace when with loved one. Most of the characters in this show are like that. They are all strong and powerful, but they are also caring and gentle. \\n\r\nWhen it comes to characters, this is closest to reality I've seen so far. They are doing their duties flawlessly, but they are still people touched and hurt by the horrors of the war.\\n\\n\\n\r\nEnjoyment [9]\\n\\n\r\nAs always, I won't comment this one. Those who read this review probably noticed a lot of \"I this...\", \"I that...\". Enjoyment is different from person to person, the fact I enjoyed it doesn't mean others will too.\\n\\n\\n\r\nOverall [8]\\n\\n\r\nWith some art flaws, not so good voice acting and generic story, this show gets \"only\" 8. That in no way means I didn't like it. I did, and a lot. It is a really great show, and a definite recommendation.\\n\r\nThere is a if you liked this you'll like that.\\n\r\nI say, if you didn't like shows which just write off characters and horrors of war (for me it was valkyrie chronicles), you'll definitively like this one.",
            "date": "2010-05-24T09:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 26352,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/98374.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nina4life",
                "username": "nina4life"
            },
            "url": "https://myanimelist.net/reviews.php?id=26352"
        },
        {
            "content": "For 400 years the Iga and Kouga ninja clans have been feuding with reason long forgotten. Now at the beginning of the Edo period the retired Toguwara Ieyusu has revoked the anti war pact created by Hattori Hanzai that has kept the two clans apart. A list has been created with the 10 best ninjas from each clan must fight it out to the death. To the winner glory and the spoils of war. The problem is nobody has told  the two young heirs to the clan heads, Oboro and Gennosuke, who are promised to each other to be married and are determined touse their marriage to end the feud between their two clans. However, why must the clans fight it out to the death and what is the real reason for the ninja war?\\n\\n\r\nThere you have it a Romeo and Juliet story with ninjas. Awesome!\\n\\n\r\nThe story is very good, however, it is a bit slow to get going. With the exception of the first episode which sets up the story very nicely, showing Oboro's grandmother and Gennosuke's grandfather in love until Oda Nobunga massacres the Iga village with \"Kouga help\" turning their love into intense hatred and when they die (sorry spoiler!) it gives one of the best scenes in the series, it takes until episode 7 for the series to get interesting and episode 9 for the story to get going.Up until then we're are shown fights between ninjas with super human powers, many with deformities, from the cool to the weird to the grotesque,fighting it out in spectacular sequences. However, once the story gets going it is highly addictive.\\n\\n\r\nWe are treated to a couple of filler episodes, one which gives a recap which was useful as I lost tracked of who was dead and another which added nothing to the story.\\n\\n\r\nTo be honest I didn't care for many of the ninjas if they didn't make it to episode 7 and once they were dead I was glad we wouldn't be seeing them again. However, once past episode 7 there is some proper character developments making the characters more human and turning inter clan feuding in to lusts for revenge making the death scenes more emotional and making you feel for the characters. Also to add a nice touch some of the surviving characters towards the end are shown to actually question why they are fighting.\\n\\n\r\nThe animation is not bad with much of the scenes at night or in the shade. They are ninjas after all. The background music was very good and the opening and ending songs fitted the series perfectly.\\n\\n\r\nObviously from the synopsis and the fact there are ninjas you are going to get blood, violent deaths and lots of it so be warned if you don't enjoy seeing that kind of thing. However, if you enjoy historical epics you will enjoy this but my advice would be to stick with it because you could easily drop it before you get to episode 7. You won't be disappointed!",
            "date": "2012-08-30T06:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 71183,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=71183"
        },
        {
            "content": "Get a cauldron and stir in large amounts of gore, a hint of romance, some exceedingly intense eyebrows and you have Basilisk. This is a very melodramatic anime with plenty of death and disturbing situations for those who enjoy creepier adult themes. At first glance the storyline seems very predictable and linear but the more you watch, the more it slowly evolves into something more. With slow story progression, the series relies heavily on violent action scenes that assist in keeping the viewer entertained as the story unfolds. The ending is decent but leaves something to be desired.\r\nAll of the characters are interesting and uniquebut because the series is fairly short it doesn’t allow for very much character development, which is disappointing once you become invested in the show and its plot. For someone who appreciates delving deeper into the motivations and emotional states of characters, there is a lot of missed potential here. \\n\\n\r\nThere is some fanservice in this anime that was likely entered to ease the often apprehensive mood. Despite clear objectification, the female characters display strength in their own way and are highly resilient. To that extent, there are some disturbing sequences in regards to how women are treated by the rest of the vastly male cast. Viewers beware, there is a rape scene.\\n\\n\r\nIn the beginning I was not very fond of the artstyle but as the show continued I found that it does flatter the era that is expressed – dark overbearing lineart accentuates the turmoil and anger contained in this series. The animation is fairly fluid for its time but there are a few segments that are lacking. For example, during a specific running sequence the characters are only bounced back and forth to display movement which feels effortless when compared to other action scenes. \\n\\n\r\nAn aspect of this anime that really drew me in was the music, it is so well-suited and enhances the mood; from passive to sorrowful, everything is expressed in flutes and unintelligible chanting. Unfortunately, the voice acting in the English dubbed version is subpar in regards to phrasing and the delivery of lines, and often the voice work is garbled by loud music and sound effects. \\n\\n\r\nDespite its faults I found Basilisk a good anime with strong action scenes and interesting characters. If you decide to try it I’d suggest watching at least 4 episodes before choosing whether to continue or quit.",
            "date": "2016-04-03T14:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 215377,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302368.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gundime",
                "username": "Gundime"
            },
            "url": "https://myanimelist.net/reviews.php?id=215377"
        },
        {
            "content": "Just recently finished watching the series again after more than 3 years. It was among some of the first anime shows I watched when first getting into anime. Watched it on Netflix in dub and decided to watch in Japanese this time since Ive grown to like subbed rather that dubbed. I was very entertained even after a second watch and came to MAL to check its rating and was disappointed to discover its low rating. \r\nBasilisk is a pretty good watch. Yes it has the cliched Romeo and Juliet plot going on but Ive watched 2 versions of Romeo and Juliet and I wouldrather watch Basilisk any day over those. There are a lot of elements that are differentiate the show from a typical R&J series. First Oboro and Gennoske are both the leaders of their respective clans which makes the pairing a little more difficult. Second the action is quite spectacular, both clans are literally in an official death match sanctioned by the late shogunate, if anything one could at least appreciate the cool fight scenes. The story also goes a little more in dept of supporting character roles. Its a bit more dramatic when each side suffers losses. Although the fate of the 2 doomed lovers is the same as R&J it feels a little more tragic and heartbreaking, whereas in Romeo and Juliet their deaths are somewhat accidental. (SPOILER) Oboro chooses to die for Gennoske rather than taking her own life because Romeo is dead already. Anyway its not a flowery end and kind of leaves a bitter taste but a feeling that lingers much more than a happy ending.\\n\\n\r\nAnyway Id give Basilisk a solid 8/10. I rated it 10 because I feel it deserves more than what it now has but in honesty its definitely a solid 8. \\n\\n\r\nSome of the flaws that might not appeal to people is the artwork, some of the characters have very unreal figures, however that didnt quite bother me, other than that the art was beautiful especially the landscapes. Pretty good considering its from 05. \\n\\n\r\nThe music was pretty good, not a masterpiece but it captured the moments well, especially dramatic scenes. OP was OK, I liked the ED better though.\\n\\n\r\nIve already gone over plot and how I feel about it overall, so I recommend Basilisk, for anyone who enjoys action (with blood), or romance (tragic).",
            "date": "2016-01-14T19:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 208537,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3355623.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KR5-S14Kouki",
                "username": "KR5-S14Kouki"
            },
            "url": "https://myanimelist.net/reviews.php?id=208537"
        }
    ],
    [
        {
            "content": "I watched the live-action movie before watching the anime series. Wow, I am so glad I did that because I would have been disappointed with the live-action because it does the anime NO justice. \r\nThis series is definitely a LOT more mature with pretty gruesome murders/other mature scenes, lots of blood, etc. I'm not that squeamish and I had to turn off the sounds or turn away sometimes because it was kind of graphic and shocking, but that just means the creators did THAT good of a job with making you empathize with the characters.\r\nThe story follows two lovers, Gennosuke and Oboro who are theleaders of the Kouga and Iga ninja clans. The two clans have a bitter history and were ruled by an anti-war pact that was suddenly lifted along with an order to commence a ninpou competition, giving the ninjas of both clans an opportunity of a lifetime to start going at each others' throats. Ten ninjas from each clan have been chosen to take part in the competition and must fight to the death. For the lovers Gennosuke and Oboro, they are torn between their love and their duty to their respective clans. \\n\\n\r\nThis anime is about CHARACTERS. I must say that some of the characters in this anime are very unique and some have amazing depth and quality to them that make them more than just blood-thirsty superhuman ninjas. I've been told that these characters are much colder in the manga, and I'm so glad that in the anime, they have some depth. \\n\\n\r\nThere are so many beautiful scenes in this anime, not necessarily because it's well drawn or super detailed, but because they provide a moment of stillness and a time for reminiscence among the numerous bloodthirsty-action packed scenes. That's why I LOVE the flashbacks in this anime because they are absolutely beautiful and tells the backstory of these characters. \\n\\n\r\nThat being said, my opinion is that the character depth was not extremely well distributed among the two clans, as one clan just seems to have more straightforward bloodthirsty members than the other. \\n\\n\r\nBut watch this anime. It's so beautiful and tragic and..gahhh...just great!\\n\\n\\n\\n\\n\\n",
            "date": "2016-01-01T21:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 207506,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/fairknightess79",
                "username": "fairknightess79"
            },
            "url": "https://myanimelist.net/reviews.php?id=207506"
        },
        {
            "content": "I must say that i am not a die hard fan of animes that involve historical figures and change some facts with the help of fantasy,but Basilisk was,in my opinion,truly awesome.Why?Well,it has some really kick ass graphic,the characters are well designed and the background is astonishing.Another thing that really surprised me when I watched it was that the action starts immediately,it doesn't offer you time to get bored of it and you instantly feel like you want to know what is going to happen next,which was really exciting.\r\n    The story may seem for some like a cliche,you know the story,awoman and a man love each other but they cannot be together because of the hatred between families,but this action filled cliche offers something more.Once the pact was nullified between the villages,only Iga became aware of the situation and gave the anime some funny moments too by not letting their \"new chief in charge\" find out about it and trying to kill as many kougas as they can.I think i would've enjoyed more a love story that evolves by the end of the anime.\\n\\n\r\n      The characters are very different from each other and you learn about their lives,secrets,feelings and their relationship with the others,which will make you sympathize with both clans and maybe shed some tears when they are finally killed.\\n\\n\r\n      Overall,Basilisk is an amazing anime which I'm really surprised that it doesn't appeal more to the viewers.I recommend it whole-heartedly to all of the ninja and action lovers and I'm pretty sure you won't be disappointed..",
            "date": "2016-05-04T02:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 217827,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1155317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sr467",
                "username": "sr467"
            },
            "url": "https://myanimelist.net/reviews.php?id=217827"
        },
        {
            "content": "Basilisk at its core is basically just a ninja adaptation of Romeo and Juliet. Thus when it comes to the plot of the anime, I doubt that any of it will seem significantly fresh or too unpredictable. If you are able to get past the unoriginal storyline, however, I think that there is still a lot to like about Basilisk. \r\nThe story moves at good pace: fast enough to prevent any dull moments; but takes time to develop the plot. As this is an anime about ninja, there is plenty of the action and fight sequences that one may expect from a series from thisgenre. I definitely feel my favorite part of the anime was probably the abundance of interesting characters. Although there were probably too many to fully develop, I thought that most of the Iga and Kouga ninja interesting and not too one-dimensional (except for the ones that die too early in the series). \\n\\n\r\nThere were numerous things that I disliked about the anime. My biggest gripe is the gratuitous amount of nudity and violence. A lot of the time I found the blood and boobs a bit unnecessary, taking away a lot of the poignancy of certain scenes. My other complaint is the lack of elaboration on the sub-story of Oboro and Gennosuke. Other viewers seemed to find the underlying love story interesting but I found it a bit too underdeveloped.\\n\\n\r\nAll-in-all, I liked Basilisk and would recommend the the anime to anyone looking for an action-packed, fan-service-filled, animated romp. The art is beautiful, the characters great and the plot not horrible. The story is definitely not a feel good anime, so anyone looking to find a happy-go-lucky series should probably look somewhere else. For all others, try a few episodes and see how you like it.",
            "date": "2011-10-26T23:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 46289,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/821779.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/moonglade",
                "username": "moonglade"
            },
            "url": "https://myanimelist.net/reviews.php?id=46289"
        },
        {
            "content": "Violent but with an engaging plot.\r\nPLOT: Extremely straightforward Romeo & Juliet type storyline set in feudal Japan – with added ninjas.  This concept may be a bit overdone, but Basilisk manages to get the balance just right, tempering the bouts of extreme and bloody violence with touching moments of humour and romance. I found the storytelling to be excellent and very well balanced – I got completely sucked into the word of the Iga & Kouga ninja’s and really cared about their fates.  Basilisk does an excellent job of its character development with lots of well-placed flashbacks. Unfortunately for most characters these flashbacksare their death flags, but often they reappear in other characters flashbacks and so they continue to be developed even after they have been sliced into tiny pieces!\\n\\n\r\nThat’s another striking aspect of Basilisk – the action scenes. As the setting is a ninja war obviously the fight scenes form the main core of the series, and they are spectacular! A broad range of unique ninja techniques makes for interesting and varied action scenes, but present throughout all of them is a huge amount of blood – the death toll is massive. There is also quite a bit of historical fact woven into the plot – the setting is quite realistic. However Basilisk is definitely for older anime viewers due to the gritty violence and mature themes that run throughout the series. The only gripe I have with the show is that my favourite characters were short-lived and I didn’t like Oboro at all – for a main character she is utterly useless for the duration and ate up too much screen time with her constant crying.\\n\\n\r\nANIMATION: I loved the animation and the character designs. The animation is fluid with gorgeous and varied backgrounds – fight choreography is never dull or repetitive and makes for gripping viewing, but the slower reflective scenes are also presented well. The character designs are very striking and varied with lots of emphasis on the eyes and hair of the characters. Plenty of heavy shading is used and the characters facial expressions are extremely varied and add plenty of emotion to any given scene. Lots of attention to detail is on display with the historically accurate costumes and backgrounds too which all makes the viewing experience pleasurable.\\n\\n\r\nMUSIC & VOICE ACTING: I wasn’t much fussed on the OP but felt that it probably fitted well with the tone of the series – liked the ED though, even if it is quite typical of anime EDs. The score was also quite fitting as it has lots of traditional Japanese instruments and blends into the tone of the show extremely well. Voice acting was also superb. All the characters show a huge range of emotion over the course of series and the seiyuu all pulled off these extremes well. Very much an ensemble piece so it’s hard to pick out standout characters.\\n\\n\r\nOverall Basilisk falls into my ‘Good GONZO’ category, it has excellent visuals and storytelling and a very satisfying conclusion. The reason I marked it down is that I personally felt that the two main characters could have been better developed and weren’t as interesting as the short-lived side characters. I also felt that the show occasionally got a bit too wrapped up in its own melodrama and spent too much time on long lingering close ups of Oboro’s eyes! But these are minor gripes and more about my personal preferences than anything else.",
            "date": "2013-04-19T01:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 94189,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194488.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Caraniel",
                "username": "Caraniel"
            },
            "url": "https://myanimelist.net/reviews.php?id=94189"
        },
        {
            "content": "Ninja battle to the death royale in the spirit and '90s-esque visual appearance of _Ninja Scroll_ (despite its 2005 production). What makes _Basilisk_ special is that it resists the trend towards dilution of the 'ninja' concept into just super-powered samurais throwing chi-balls and shuriken in the vein of _Naruto_ (although there are still plenty of bizarre powers and characters such as the snake-like Jimushi Jubei) but takes a much more brutal and yakuza-film-like approach: \"all warfare is deception\". _Basilisk_ plays with deception, information, and vision to an extent I can't remember seeing in any other series. For example, based on the first episode, one expectsa quick descent into all-out warfare, and the tragic Romeo & Juliet ending of our two protagonists blatantly foreshadowed and my own reaction was to wonder how this plotline could possibly take up a full 2 cours/24 full episodes and whether I had perhaps made a mistake - and episode 2 totally confounds my expectations by *one side stealing the announcement* while the other side remains totally unaware that there is even a war on! This provides tremendous dramatic tension as they must balance the reward of ambushes and surprise attacks against the risk of alerting the others that they are no longer at peace. The issue of knowledge remains a theme throughout with shapeshifter Saemon's many appearances, particularly in impersonating a dead ninja and fooling his girlfriend Hotarubi; cruel as that was, the knife is twisted even further in one of the most memorable deaths in _Basilisk_. The protagonists are too good and pure to be at all sympathetic or interesting, but thankfully they only occasionally take center stage and the other characters get ample time on screen, the better to enjoy the twists and well-animated violence. (While many ninja shows set the action at night almost to a fault, _Basilisk_ fairly evenly allocates day/night scenes.) Overall, definitely one of the best ninja anime I've seen.",
            "date": "2016-06-23T13:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 221630,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419845.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/gwern",
                "username": "gwern"
            },
            "url": "https://myanimelist.net/reviews.php?id=221630"
        },
        {
            "content": "Long Story short. I've really tried to like, even love, this anime...\r\n[FREE OF SPOILERS]\r\nThe story started with a strong plot, introducing us a bunch of good characters that you hoped they were going to correctly develop. However, the story continues and you see no real explanation for any of their actions, and all that's left is the lack of consistency in the story line and its characters.\r\nPersonally, the only characters that I could say that has been explained, are firmly consistent in their actions, and have been developed during the show are Oboro and Tenzen. Why?, you could ask; because along the story Oboro andTenzen makes decisions that fits with her personality. Once you are watching the show you start to see flaws in a lot of the characters personalities, contradicting themselves and making the show really unpleasant to see. For instance, Gennosuke and Saemon Kisaragi during the show, they listen to things the other characters say or they make some statements, and you clearly see that they have change their mind, but in the end they make mistakes that they shouldn't really make, and have no real explanation.\\n\\n\r\nThe art of the show is the only thing that seems respectable for me, it makes the combat flow and it fits very well the scenes. You know everything that is happening on the screen, and that's very complicated to achieve on these kind of animes.\\n\\n\r\nThe sound is really mediocre, the only thing that stands out is the opening, but that's all, and for an anime of 24 episodes... It doesn't work for me. The best example of an ost well made would be the one on Rurouni Kenshin...\\n\\n\r\nAfter all, I saw the anime because I wanted to see how it could end, pretty obvious, but I encourage everyone to try it and watch at least 5 or 6 episodes, if you don't like it that's ok, drop it like its hot.\\n\\n\r\nGreetings!",
            "date": "2017-11-15T02:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 263255,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5388764.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Daniatlas",
                "username": "Daniatlas"
            },
            "url": "https://myanimelist.net/reviews.php?id=263255"
        },
        {
            "content": "This is a must watch for Ninja based anime lovers.\r\nAn intense,deep,dramatic,dark & beautiful story based on the Ninja clashes between Iga & Kouga clans during the Sengoku era...The strongest point of this Anime is the story,intense & bloody fight scenes,mature romance plot & heavy violence between the two ninja clans makes this anime truly enjoyable.\r\nThe 400 old grudge that drives their hatred for one another,love stories that never comes to fruition because of betrayal,deception,dirty politics & so on.\r\nEvery significant characters in this story are very interesting...Various bloodthirsty Ninja's that harbors various kind of supernatural secrets techniques,the intense & bloody fight scenes makes this anime trulyenjoyable...characters has fairly good backstories\\n\r\nContains some heavy emotional scenes,very good & sweet romance plot that ends up in a tragic way...😭😔",
            "date": "2017-10-17T23:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 261083,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6515508.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/M3Cyberpunk",
                "username": "M3Cyberpunk"
            },
            "url": "https://myanimelist.net/reviews.php?id=261083"
        },
        {
            "content": "A much underrated anime - and one of the few examples in which the anime has more in-depth characterisation than the manga. It is the excellent characterisation that makes Basilisk stand out; nearly all of the individuals appearing in the story are two-dimensional and have more depth than you would suspect at first glance. While the plot itself is relatively simple, the series is worth watching because of how it is handled. The repercussions of someone being hurt are not glossed over and the anime is much, much more than just a blood-fest. If you are looking for something that is just about the action,then this story is not necessarily the right choice because you are forced to sit down and think about what is transpiring on-screen. Though not incredibly complex in nature, the series does raise a few questions about vengeance and corrupt politics. \\n\\n\r\nAnother highlight is that the animation remains relatively consistent and the musical score is nice. \\n",
            "date": "2009-10-13T13:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 19648,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/245723.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 0,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HobbitsReadBooks",
                "username": "HobbitsReadBooks"
            },
            "url": "https://myanimelist.net/reviews.php?id=19648"
        },
        {
            "content": "This anime seemed more realistic to the point of having ninja clans battle each other for the Shogun's enjoyment or to settle a score. This also screamed Japanese Romeo&Juliet and it made me wonder why didn't the two clans, who are obviously big enough together, attack and defy the Shogun's wives, more so than him. But the artwork was amazing and again, realistic, the music was catchy and the characters well developed as well as some of their backgrounds and relationships.Over-all it was a good anime that truly says \"Ignorance Is Bliss\" and \"Keep your friends close...But Keep your Enemies Closer\".",
            "date": "2012-03-31T08:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 57539,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1217679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Heta-rashi1",
                "username": "Heta-rashi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=57539"
        },
        {
            "content": "Dark, violent, and tragic, Basilisk tells the story of two warring ninja clans during the era of the Tokugawa Shoguns.  The plot picks up immediately and is fairly fast-paced.  Between intense action sequences, however, is also an exploration of the motives (both personal and political, petty and profound) behind the struggle, as well as its very real human cost - especially in the case of two star-crossed lovers.  Beneath the surface, the story lends itself a very Shakespearean air.\r\nOne caveat is that you'll have to suspend disbelief when it comes to their \"ninja skills,\" some of which come off more like \"superpowers\" than anything a ninja could possess - acquired or genetic.\\n\\n\r\nAnother notion viewers may find difficult to grasp are some of driving factors behind decisions characters choose, or seem forced, to make.  It is just as much an expose into historical Japanese culture, which - unlike the highly individualistic West - emphasized duty and obligation over personal feelings or desires, seen as \"selfish\" or even dangerous to society.  Also, they are much less likely to verbally express emotion, so expressions and gestures - even small ones - communicate much.  Some touching moments betray more than words ever could.\\n\\n\r\nThe animation, of course, is top-notch.  Everything is beautifully illustrated with clean lines, deep shades, and vibrant hues.  Especially striking are the full moon and falling sakura in the opening and ending credits.  Breathtaking!\\n\\n\r\nThe show is definitely for mature audiences, featuring bloody violence, nudity, and sexual content.\\n\\n\r\nDeeply compelling from start to finish, Basilisk is very highly recommended!",
            "date": "2011-09-30T17:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 44481,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/spoons",
                "username": "spoons"
            },
            "url": "https://myanimelist.net/reviews.php?id=44481"
        },
        {
            "content": "First review Im ever writing and thats just only because this anime is terrible. Terrible, but decent. Probably the best way to describe this anime - lacking any sense whatsoever. Simply put, it has some great ideas but creators shown complete inability to make those elements work together therefore making it laughable at best. \r\nI couldve gone in depth and write 20 page essay, whats wrong, why plus some suggestions on improving. Not saying I could've wrote better one, but... Oh, cmon. Im so dissapointed in the way how this anime has been messed up that i feel I could actually write better one. Theirmistakes are basic. Watching some anime series I had sometimes that feeling 'it wouldve been better if...' But its nothing compared to what I feel watching this series.\\n\\n\r\n Great potential. Great animation. You MAY like it. Watch couple episodes, but do not expect series to get better with time as some do.\\n\\n\r\nGot here cause of some comparisions to Berserk and Samurai X. Not even close.",
            "date": "2014-07-04T15:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 150357,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/aranval",
                "username": "aranval"
            },
            "url": "https://myanimelist.net/reviews.php?id=150357"
        },
        {
            "content": "The Kouga and the Iga clan are in peace after many hundred years fighting.  \r\nThe current shogun, after seeing a representative of each clan fight each other, becomes afraid of their power and in order to get rid of such fearsome creatures, resolves to use them to decide his political issue on the choice of a successor to his post.\r\nEach clan representing one candidate to be the next shogun, and the war starts once again. The best 10 fighters from each clan shall battle to death refueling a hate that was only pretended to be forgotten.   \r\nHowever, unknowing that the war hasbegun once again, the successors of each clan: Kouga Gennosuke and Oboro Iga are living their happiest days in love with each other, blessed by ignorance.\\n\\n\r\nThe stage set, the story starts focusing on the characters and their fights. Fights that happen with the other clan, among their own clans or even with their inner selves. The plot advances in a very dark tone, blended with action and romance all of it in the right amount, making for a perfect combination, if I may say.\\n\\n\r\nThe art in Basilisk is outstanding. The best I've seen so far and the same goes for the music. The way one complements the other and both complement and enhance every single minute of the anime is unparalleled. The characters design and sceneries are really beautiful. Also, I must confess, I was driven to tears more than once while watching it, and much of this was due to the powerful work of Nakagawa Kou behind the soundtrack composition, although there's a lot of credit to the voice actors/actresses, who were brilliant, as well. \\n\\n\r\nIt's really easy to get mixed feelings towards some characters in Basilisk, which proves just how well built and developed they are. They go through inner conflicts, have their own thoughts and act for their own reasons. Some of them really surprised me, which, considering the constant cliches we have in so many shows out there, was another quite welcome characteristic of this show. \\n\\n\r\nI've watched Basilisk 6 years ago, and I can assuredly say it's beautiful and moving from beginning to end. I can still remember quite vividly the impressions, emotions, music, art and story of the anime. A feat that very few achieved and, although I wish for otherwise, even less will in the future.  \\n\\n\r\n10/10",
            "date": "2011-01-13T03:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 33713,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18037.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Adanadhel",
                "username": "Adanadhel"
            },
            "url": "https://myanimelist.net/reviews.php?id=33713"
        },
        {
            "content": "This samurai anime in the Edo-period is quite enjoyable and it's one of the better ones with stunning visuals and jam-packed action.\r\nStory: The plot's really simple: kill everyone, blood's everywhere and fighting is a rather pointless means of achieving results. Through flashbacks we learn more from the characters' backgrounds. The first few episodes I was expecting a real sympathy for either Iga or Koga, but I gathered that I could not have real sympathy for either side. My attention focused more on the fights than the story which was not the thick plot I expected beforehand. The story's entertaining but don't expect a very originalplot.\\n\\n\r\nArt: The visuals are really stunning. Nice use of panoramas and the fights are really well executed. I like the Edo era and its authenticity is something I appreciate. Some characters look strange though such as Shogen and Jingoro. This diminishes the otherwise realistic representation of the environment.\\n\\n\r\nSound: The sound itself is realistic, even the gorey sounds. The music fits really well and makes use of classical instruments which makes you feel you're really in the past. None of the music really stands out for me, so it can't earn more than a decent 7.\\n\\n\r\nCharacter: This left me wanting more. Most characters had one particular character trait and it was just repeated over and over again. Some of the men were perverts and they stayed that way, some of the women could fight but were actually squishy. Even from the two main characters we don't learn that much except that they were always good persons, why they want peace was never really clear. Well there's this mantra about stopping the endless cycle of hate, but you don't really get any further than that.\\n\\n\r\nEnjoyment: I'll be short on this one, the fights are great and the background stories entertaining.It did lack this \"I gotta see the next episode right now\" feeling but the series is definitely not a bore!\\n\\n\r\nOverall: I was expecting an anime like \"Samurai Champloo\" providing an alternate history on the Tokugawa era. But that wasn't really the case. With great art and exciting fight scenes I could enjoy myself with the series.It's unconventional to have an anime without a clearly distinct good vs evil story, I give the writers props for that.  For entertainment value, it's a solid 8.",
            "date": "2011-11-25T14:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 48033,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/875393.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/shion_shu",
                "username": "shion_shu"
            },
            "url": "https://myanimelist.net/reviews.php?id=48033"
        },
        {
            "content": "Though I gave Basilisk a fair rating of 6, I have to say that I'm quite disappointed in this anime. Believe me, I'd love to make a great review, but this entire series really WAS nothing more than mindless slaughter.\r\nStory - 3. They give extensive background and put great effort into the details of the story; however, the story did nothing to build on the events that took place. In fact, so much so that the background seemed more like it was shaped in order to try and make sense of why there'd be nothing but death. This series really does show that there isno such thing as good and bad in war.\\n\\n\r\nArt - 10. Though I gave a poor rating for the story, I was fascinated by the art. Basilisk did a great job pulling off actions which I questioned the possibility of achieving.\\n\\n\r\nSound - 5. Really, they had no real soundtrack, the opening was the same throughout the entire series, and it rubbed me the wrong way.\\n\\n\r\nCharacter - 10. Great Character development, they all had expressed background history and how they related to one another. Basilisk also did a good job in showing that everyone really does have two faces. Everyone had a face they'd show towards their enemy, and a face they showed towards friends and family.\\n\\n\r\nEnjoyment - 2. Awful, As much as they story was developed, I've already written, that nothing goes on but fights, death, and hell. It may have a tad bit of romantic love, but it really was nothing more than foreshadow and buildup towards the climax. In the end, love is tossed aside in this show like it never existed.\\n\\n\r\nOverall - 6. That's what the average is, a fair 6, but this really isn't a series worth watching, unless the watcher has a twisted obsession for watching the darkness in humans who know nothing but war against each other.\\n\\n\r\nEDIT: I will give them props however, for they did create quite a touching ending in the last episode before the final battle. I was unaware that the maker could do such a thing at the time because I've only seen until episode 23 when I wrote this review, and I've seen nothing less than bloodshed and hell bent warriors.",
            "date": "2012-07-08T01:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 65655,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1311859.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 2,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/weiluntong",
                "username": "weiluntong"
            },
            "url": "https://myanimelist.net/reviews.php?id=65655"
        },
        {
            "content": "Giving this a ten because i believe it should have more attention.\r\nnot many people know about this anime, it has a kind of Romero and Juliet feel to it. But in Japanese version. I won't go for any spoilers here. \r\nthis anime has good fight scenes, good romance and tragic end. recommended for those who is looking for some tragedy or romance anime. This anime is sad and is intended for mature audience to watch. it has blood and some gore in it but if you are over 18+ and looking for some mature romance anime then this might be a good one for you.\r\ninmy opinion it deserve a better score but since it has so much blood i can understand some people got turn off by that.",
            "date": "2014-09-19T16:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 161041,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2736891.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TakunDes",
                "username": "TakunDes"
            },
            "url": "https://myanimelist.net/reviews.php?id=161041"
        },
        {
            "content": "Without expecting much i ran into this anime ...\r\nThere are several ways one can feel about any piece of entertainment, like anime series, game, movie or novel. \r\nAmongs thouse we liked there are pieces who are simply decent \r\nThere are pieces we enjoyed watching but we forget about them 5 min later as we move on to other things and diffrent titles.\r\nAnd there are some that we enjoy that much we actualy seek anything ralated to it desperatly trying to prolong that experience.\r\nBasilisk isnt series that qualifies to eighter to this categories.\r\nIt is one of thouse rare masterpieces - completed within its form - thatburns a mark on souls of thouse who choose to expeirence it, lingering in ones hart, cousing unrest of the spirits withing ourselfs.\\n\\n\r\nIt is a rare trait to any piece of movie, anime, game, novel to be able to tough ones innermost feelings, to apeal to emotions and values hidden in day-to-day lifes. In my life I only encountered a few things affecting me that deeply.\\n\\n\r\nThe story told in Baslisk is that powerfull. It runs deeper that in the animations and brodcasted emotions are boyond what we can normaly see and hear.\\n\\n\r\nIt almost feels like anime is just a convinient means to tell us the timeless archetypical story transcendenting time and cultures about human hatered. The afterfoughts running in ones head after watching this anime are perhaps the most importand part of this expierience I try to describe.\\n\\n\r\nIn case of form - perhaps, or rather apparently, I will be biassed. I remember for example I haterd the opening song first time I heart it, but then somewhere in beetween next and enxt epissode evrything faded away and becoame a part of this huge hart gripping emotion. \\n\\n\r\nEvrything about this anime is compleate. \\n\r\nI cant imagine it with better graphics now - although it is obvious there are hundreds of show done better.\\n\r\nI cant imagine this with better animation now - although I have seen scores of better animated anime\\n\r\nI cant possibly imagine this any other way that this first time I have seen it. \\n\r\nI probably dont want to watch this again at all.\\n\r\nI dont want to ruin that feeling I have in my chest right now.\\n\r\nIn this form - only in my memory - that expirience called Basiliskk is PERFECT\\n\\n\r\nIf I can say any substantial advice right now - dont watch this anime in chunks one episode per day. \\n\r\nTo get the best experience try wartching this in just a few sessions, with high volume on headphones durring the night. I swallowed it in just  one weekend taking just 3 breaks to release some heat, and swollen pain in the chest, but I could easly watch the entire show in one go as the story could keep you tied up to monitor with the uncertainty each next episode bringed.\\n\\n\r\nEspecialy first 12 episodes are very very intense - I dont remember anything similar happening to me since playing fate stay night Visual Novel for the frist time , even though I usualy dont watch more than 2 3 episodes of diffrent anime series per day. \\n\\n\\n\r\nI know\\n\r\nIt is silly for my to prize this anime that much, I know that you must be laughing at me right now. For grown up man to moved that much  by some not so widely recognised series. \\n\r\nAnyway I Am sattisfied now. I am happy to have experience this cleansing feelign now. I hope you can achive this catarsis as well, becouse in this sole moment I can see clearly, untill my sight become obscured by daily life again...\\n\\n\\n\r\noh and I forgot - I l even came to love the opening song now ...\\n\\n\\n\r\nTo finish with what I started this review\\n\\n\r\nThis isnt one of thouse most popular and loved pieces of work where evrybody cant wait to see another part of it. \\n\r\nI can never say it is the best thing I have ever seen myself even.\\n\r\nIt is though a special category on its  own - a rare piece that change our parsonality a little bit, that we will carry on within us, even after we forget about what it was about someday ...\\n\\n\r\nScores:\\n\r\nStory           10\\n\r\nArt                8\\n\r\nSound           8\\n\r\nCharacters   9\\n\r\nEnjoyment   10            \\n\r\n(I wouldnt say I enjoyed this though - this is not somethiing you can mesure with \"joy\" - My score in this category is for feelings awakend by this title)\\n\r\nOverall         10\\n\\n\r\nPS. I gave it 10 overaly even though it is obvious that it doesnt deserve so objectively speaking. Other would probably not recive this series the way I did so, I think giving this series a 9 or even 8 would be more appropriate normaly. So this score of 10 is only becouse of my personal \"Perfect\" Experience with this series I had.\\n\\n\\n\\n\r\nI know this has been long - It is only fiitting to commemorate  this great Anime though.\\n\r\nThanks for hearing me out\\n\\n\\n\\n",
            "date": "2013-02-03T16:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 85763,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2093957.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Angmir",
                "username": "Angmir"
            },
            "url": "https://myanimelist.net/reviews.php?id=85763"
        }
    ]
]