[
    [
        {
            "content": "Astarotte no Omocha! (or \"Astarotte's Toy!\" in English), is a harem, ecchi, comedy series that follows the escapades of Astarotte Ygvar, a ten year old succubus princess who is under the conviction of forming a man-harem, in order to guzzle \"man juice\" so as to preserve her youth and beauty. With the clear direction established, the series becomes a collection of episodic antics involving young , tsundere Astarotte and her boy-toys, all aiming towards the token \"hunk of the week\" and a hearty showering of baby butter to top it [and her] all off.\r\n\tHave you got all that? Good. Now forget everything I just toldyou, because this series has -next to nothing to do with any of that-. Sadly, a large sum of people that read the plot synopsis are going to think that this series is all about a ten year old girl sucking down throat yogurt, but that isn't the case. So what should someone going into Astarotte no Omocha! expect out of it?\\n\\n\r\n\tWell first thing's first, it's still an ecchi series. It's not going to magically cure your phobia of seeing a 10 year old girl in a sexually suggestive scenario or an overly large bosom stuffed into all too restrictive clothing. Though, in a world where the tag \"ecchi\" is near synonymous with \"seemingly random and all-too-frequent upskirts, due to a sudden gust of wind or poor choice of panning camera angles, that only serve to have the protagonist slugged  into the stratosphere\", Astarotte no Omocha! dares to be different. Most of the H content comes solely from the risque and colourfully abundant array of outfits that the characters squeeze themselves into, and take it from me, the wardrobes of each character in this show are vast and vibrant. In fact, for a series with an ecchi brand there's very little direct fanservice; what that means is that, until episode 9 (obligatory beach episode), the only \"fanservice\" that's delivered is thinly veiled clips that cater to a specific fetish. \\n\\n\r\n\tThough, even if the series is speckled with these \"fetish-tastic\" scenes, all the usual triteness you'd expect from an ecchi anime takes a backseat to story-telling and character development. If you plan to watch Astarotte no Omocha! strictly to see a loli eat a bowl of man chowder, you'll find yourself instead using adjectives like \"heart-warming\" or \"touching\"; the end of the series could even squeeze a tear from the coldest of hearts.\\n\\n\r\n\tI mentioned before that, despite the plot synopsis, this show isn't about Astarotte forming a man-harem to gargle mayonnaise. While that theme serves as a  sort of whispered guideline, it's forgettable at best; it's mentioned here and there throughout the series, but beyond episode one it's rarely ever spoken of beyond the occasional badgering of Judith. Instead, this anime is about the young princess Astarotte vainly proclaiming she's capable, and willing, to round up a troupe of men if, and only if, a human is present amongst them and the events that transpire afterward. However, only one male love interest is present, despite the calls for a harem.\\n\\n\r\n\tEnter Naoya, the human \"recruited\" by Astarotte's subjects to serve as a member of her harem, and father (yes, you read that right) of Asuha, a spunky young girl around the same age as the princess. Though despite him being conscripted to sleep with Lotte, he never actually slips into her bed, unless it's to tuck her in for the night or offer her a glass of warm milk (of the bovine variety). Their relationship is more akin to a big brother and little sister than anything sexual. He also acts as one of two butlers (being labelled Astarotte's personal \"toy\" after her phobia of men slowly disipates, but she only mentions that title once or twice instead of constantly lawding it over the protag, unlike some choice JCStaff series) serving at the princess's castle, alongside the maid, Effie, the captain of Astarottes personal guard, Zelda, and the person responsible for dragging Naoya into their world in the first place, Judith.\\n\\n\r\n\tA handful of other characters are also introduced as the series progresses, all of whom are unique enough to be enjoyable; none of them have especially unique personalities, sure, but they all have such colourful and unique outfits or appearances that you won't have trouble remembering any of them (for one reason or another). I suppose this is also a good time to say that, despite Lotte being voiced by Kugimiya Rie, she is the \"good\" type of tsundere; she actually acts in a matter befitting a 10 year old girl, of royal descent, who dislikes the male gender (and doesn't spit out an endless stream of \"urusai\" when angered or embarassed). See; Taiga.\\n\\n\r\n\tAlongside Kugimiya Rie there's a handful of other well-known voice actors, including Tamura Yukari (as Asuha) and Horie Yui (as Effie) who provide the voices for Furude Rika and Hanyuu, respectively, from the Higurashi series. Satou Rina, known for her work as Misaka Mikoto from Index and Negi Springfield from Negima, plays the part of Naoya, while Saito Chiwa, who voices two of my favourite characters, Rebecca Miyamoto from Pani Poni Dash! and Francesca Lucchini from Strike Witches, performs the role of the rabbit-eared sage, Ingrid. The intro theme is your average J-rock song that's enjoyable but nothing you haven't heard before, while the ending theme is a soft and slow ballad by the artist Azusa, both of which are relatively calm. But the background music is the area where audio truly shines in this series; it plays at the right times, it fits the mood, it's not too loud, theres alot of variety, it's all very pleasent to listen to and it all rounds off this anime into one nice little package.\\n\\n\r\n\tAll in all, Astarotte no Omocha! is a show everyone should try at least once. Even if ecchi isn't something you enjoy, it's easy to look past that and see how many good things this anime has going for it. A refreshing new spin on the ecchi genre that goes above and beyond what one would expect despite being labelled with such a misleading synopsis, a story that's quirky most of the time and lovable the rest, with a cast of interesting  characters, excellent voice acting and music, a budding romantic relationship and a vast repertoire of fetish coverage, all in one.\\n\\n\r\n\tSadly, if you're looking for an anime to sate your bukake fetish, you're going to have to look elsewhere.",
            "date": "2011-06-28T20:24:00+00:00",
            "helpful_count": 305,
            "mal_id": 38442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/superspats",
                "username": "superspats"
            },
            "url": "https://myanimelist.net/reviews.php?id=38442"
        },
        {
            "content": "I think some people have the wrong idea about this anime, don't read the damn synopsis, this anime has nothing to do with anything the Synopsis says. Trust me, I've actually read the manga (well...like four chapters you get the jest of it)\r\nAstarotte no Omocha! isn't an Ecchi Loli anime. It is a Medieval Fantasy RomCom that just so happens to have Lolis in it. Oh yeah, did I mention there are viking elements in it? Yes this anime has Yggdrasil, uses Nordic mythos names and also mentions other realms of Yggdrasil, there certainly was some research involved in this anime and I comment that.\r\nPlot:The main plot may turn people off, a loli succubus that has to gather a male harem. Well in truth this anime has no real plot, per say. It is the type of anime that will have plot from episodes 10-12. There is actually only one male in the 'harem' and he acts more of like a onii-chan figure, but i'll come to that later. Overall, the plot is nothing special at the moment but don't really expect one, even if it is following the manga pretty well. 7/10\\n\\n\r\nCharacters: Here at the moment I am only going to address Lotte as Naoya hasn't really been talked about yet. \\n\r\nLotte is your typical Rie Tsundere character in every way. Just lolified instead of flat-chested. She is dependent on her servants, can't really do anything with help from the supporting cast and Naoya. She takes the role of a Princess forced with duties that she doesn't want as she hates men due to seeing what Sigmund Freud and other mind-examiners (sorry forgot how to spell the word..psycia...something) call a \"Primal Scene\". Overrall, she is only here to be angry, sad, and a loli. 6/10 (no that isn't bad a 6 means Fair, like as an an ok)\\n\\n\r\nArt: If you read my Dog days review you know I love fantasy scenes. No problems here. The Animation is ok but I personally watch the anime just for the backgrounds, I don't have to look at the characters really, well-drawn as they are in their own way. 8/10\\n\\n\r\nSound: no problems with the Acting. The OP and ED are forgettable as you will just stare at the art. 6/10\\n\\n\r\nEnjoyment: I'm a fan of the manga and the anime follows the manga so far, i'm just watching a slightly edited and animated version of the manga. 8/10\\n\\n\r\nOverall: 7/10\\n\\n\r\nAstarotte no Omocha! will be watched by lolicons, as this is the loli anime of the season. But, if you aren't a loli (like moi) I advise you to watch it while you have some spare time in-between watching Hoshizora e Kakaru Hashi and Hanasaku Iroha (well, that is what I'm doing) as it is a nice tale and worth some notice.",
            "date": "2011-04-19T16:44:00+00:00",
            "helpful_count": 83,
            "mal_id": 36227,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/248217.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/P_D_S",
                "username": "P_D_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=36227"
        },
        {
            "content": "I don't know what made me watch this show. I really shouldn't have. I could think of a hundred much better ways of spending 288 minutes of my life (at least one of which would be thinking of 99 other ways), other than watching this awful pedophilia-themed snore-inducing train wreck of a show. Some spoilers to follow, should you care.\r\nStory: 1\r\nYou see that summary up at the top of the page? That's the entire plot. There is no development at all besides what is in that paragraph. Naoya, the 23 year old guy who looks like he's about 14 and is voiced by a girl,is taken from his world to be employed as a member of a 10-year old girl's harem so that she can drink his sperm every day. She hates men and is Rie Kugimiya. They pretend to have a plot near the end where the portal to the monster world is trying to erase Naoya and his daughter, so it starts with them losing their voices, but it seems by the very next episode the creators forgot that the characters were supposed to not be able to hear one another and just went ahead with it anyhow. So if you're not watching for the plot, it's gotta be something else, right?\\n\\n\r\nArt: 2\\n\r\nIt's not that bad. If you're a pedophile. Every 5 minutes or so you get some sort of phallic imagery alongside the underaged characters. Nothing else really stands out. It's just dull and unimpressive. So if you're not watching for the art, it's gotta be something else, right?\\n\\n\r\nSound: 1\\n\r\nRie Kugimiya can die in a fire. I really, really hate her voice. A few times in this show I actually just muted and watched it silent for a while because her screams make me that angry. That, and every character has a high, squeaky voice. The OP/ED are forgettable and uninspired, and the only voice I liked was that of the mosquito in the last episode. Unless you're watching for the assorted squeaks of Japan you could otherwise find in a bale of laboratory mice, it's gotta be for something else, right?\\n\\n\r\nCharacter: 1\\n\r\nHere's where my real beef with the show stands. You find out eventually that Naoya was actually taken to the land of monsters years ago (11 years to be exact), when he was 12, and while he was 12, impregnated the queen, the result of which is his daughter Asuha. I'm not sure if they ever address it directly, but that makes her step-sisters with the princess Astarotte. But then they go to the same school later, and sit together in the same class. That makes them the same age, or at most 9 months apart which would mean more likely than not they would belong in separate classes. Therefore we can only conclude they were born at the same time, suggesting fraternal twins (clearly not identical, one is blonde and the other is blue). In the two characters biographies, it's written that Asuha is the older sister and Astarotte is the younger, but both are 10 years old. Therefore... Naoya must also be Astarotte's father. Which puts a pretty interest twist on things when he is taken back into the land of monsters to provide a faucet for her succubus necessities. By episode 12, he even says to her that he's fallen in love with her. He KNOWS that she's at the most distant, his step-daughter. And yet he's there for that very purpose anyhow. What is WRONG with you, Japan?\\n\\n\r\nEnjoyment: 1\\n\r\nI found many other better things to do while watching this show. \\n\\n\r\nOverall: 2\\n\r\nI would have given this show a 1, but I don't feel any show can ever match the only show I've ever given a 1 - Shingetsutan Tsukihime. That is, I would have given it at 1, if a Tsukihime anime even existed. So unless you've already made your list of a hundred things you could do with 288 minutes that would be better than watching this show and are looking for something further to do, stick away from this miserable, steaming, heap of crap.",
            "date": "2011-06-27T14:26:00+00:00",
            "helpful_count": 60,
            "mal_id": 38385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/157985.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Cheating",
                "username": "Cheating"
            },
            "url": "https://myanimelist.net/reviews.php?id=38385"
        },
        {
            "content": "In a world where a cute little blond haired, green eyed succubus girl has to suck the love juice out of men in order to a survive, we have my waifu... or protagonist, Astarotte Ygvar, which sounds like it could be Swedish. Now, not much can be said of series considering there is but one episode currently aired, so the entirety of this review will be formed from the opinions made after watching episode one.\r\nIf you suki kawaii little tsundere lolis who hontoni kirai men, and get off on the idea that she has to construct a male harem, as well as consume the lovejuices from said male harem, in order to keep her pure, virgin,  maiden like appearance and good health, then this show is definitely for you! On top of these excellent points about the main girl, we also are introduced to a rather stimulating bath scene with many various attractive women bathing together in an open bath, I think the rice pickers call that an onsen? wakarimasen lol\\n\\n\r\nAs for the other characters of this show, I only am attracted to my perfect maiden flat chested blond loli, so I don’t have much details to report yet. Though from what I can tell, that guard “Zelda” is probably a closet yuri lolicon who wants to violate the loli hime-sama in more ways than even myself. So she’s definitely the second best character of the show. If you suki women who are in to little girls, that’s another good reason to watch this show.\\n\\n\r\nAs for the male counterparts, well let us be honest, if you are watching this show or have any interest in this show, chances are character development and plot and male characters are not anything you have interest in to begin with, so let us just say the main male is a sod who is a total bro and totally wants this little girl to feast on his Sauzfryma for scientific and medical benefits to the blond loli.\\n\\n\r\nSo, to sum it up; if you suki blond tsundere loli, lesbian lolicon women, and bro lolicon men who are going to violate little girls for their own good, this show is a definite must-see for the spring season!",
            "date": "2011-04-12T14:08:00+00:00",
            "helpful_count": 60,
            "mal_id": 35984,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341852.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sartaj",
                "username": "Sartaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=35984"
        },
        {
            "content": "THIS CONTAINS A LOT OF SPOILERS SO YOU CAN READ WHAT YOU'RE GETTING INTO IF YOU DECIDE TO WATCH IT OR NOT AND FOR THOSE WHO WANT TO READ A REVIEW WITH SPOILERS AND SKIP 4 HOURS OF MEDIOCRITY IN 2 MINUTES...\r\nStory\r\nI really was enjoying this anime for the idea it has from the episodes 1 to 6 with the fatherly love that may seem is there, but i was dissapointed half way through because things are not like that, wanting to put together a 10 year old girl with a 23 year old guy, but to make the things less uncomfortable in their eyesthey made the main dude Naoya look like a 15 y/o boy and to top that he was ''raped'' (as seen in the OVA) by Lotte's mother the queen Marcelida when he was a kid and they had a baby named Asuha, who in fact is Lotte's elder half sister.\\n\\n\r\nIt's never explained why Asuha was sent to the human world (just implyig it was for her own safety) and Lotte is never aware of this, she till the end will never know that the guy she's in love with is kind of his step father nor that he slept with her mother and sure will never know that Asuha is her half sister, because Marcelida requested Naoya not to tell this to anyone (and i was looking if in the manga the reason was explained, but is not) and that bothered me, i felt that Marcelida was careless towards Asuha, who she didn't see for like 7 years and didn't show affection, that really bothered me even more, they wanted to make us see that she wasn't a bad slut mom with the last episode's scene, they didn't even talked to each other technically, they were speaking but because of the tree magic thing, they didn't heard what they were saying to each other and it was a pointless scene, it was dissapointing to see that they just talked in the fifth episode after finally the three of them were reunited (in slut mom's eyes was a special moment), they just said some words but never talked directly and slutty just flies away from them.\\n\\n\r\nThere are some plot holes like, how is it that Naoya had a lot of magic, being human? (you see this in the OVA, the conversation between the Bat and Marcelida about Naoya having a lot of magic so she can use it to go back to her world) is never explained, and is important because if he didn't had magic, Marcelida wouldn't have f***ed him and would never come back to where she belongs and never had a child and thus the main story of the anime not existing or the fact that she sent Asuha to the human world because she was in danger is Bulls**t because Asuha and Lotte were 3 y/o so they would remember being sisters, if Lotte remembered seeing her mom sleeping with a guy when she was 4, why didn't they remember they were sisters and spend time together? and why wouldn't Marcelida hide Lotte too, why just Asuha? why? to keep being a slut sucking and fu**ing her harem of d**ks?.\\n\\n\r\nMarcelida and Naoya are the ones to blame for the love Lotte feels for Naoya, for not telling the truth to her, Naoya knowing all of this is worse tho. Mediocre.\\n\\n\r\nArt & Sound\\n\r\nI think these two things are the best from the anime, the art style was average, the landscape and the characters were drawn ok. The VA was average, Kugimiya is here as a meh tsundere, the backrgound music was also average, the OP and the ED were just meh. Overall both were average.\\n\\n\r\nCharacter\\n\r\nThe characters were mediocre. -Lotte reminded me of Louise from Zero no tsukaima because of how annoying they can be half the time (and obviously because Kugimiya does both VA) minus the violence towards the protagonist but the hatred towards men because her mother made a promise that they were going to rest in the same room that night but she saw a man from Marcelida's harem entering the room when she was headed to enter and saw her mom sucking him and she felt betrayed and traumatized by that.\\n\r\n-Asuha is cheerful, but i don't know why she doesn't ask herself why her mother did those things, she never asked herself, why she sent her to the human world, why Marcelida wants to hide the fact that she's her child and why she doesn't seem interested on her, that's bull...\\n\r\n-Naoya was the toy of Lotte but felt more like a butler, he is the only guy in her harem, and the only one she needs apparently and as stated before he and Marcelida are the ones to blame for not telling the truth to Lotte about everything, maybe she wouldn't fall in love with Naoya but is not her fault, she didn't know she fell for her (blood/step?) father, the one that her mother banged, the one who knew all of that was him and still found out that he loves her, even tho he's 13 years older, that's fucked up and Marcelida too, knowing that she fu**ed him, she will let her daughter be with him, that's even worse. The support characters were meh, overall was mediocre.\\n\\n\r\nEnjoyment\\n\r\nWell i just enjoyed parts of the episodes 1 to 6 and some things from the last two, i would have really enjoyed this if it wasn't for the bad story with Marcelida and Naoya being the ''adults'' that did nothing good to their kids, like how they were related all four of them, the plot holes, everything that was a let down, and i think the age difference wasn't what bothered me the most, but how all of them were related but one of them will never know. It was a mediocre enjoyment.",
            "date": "2015-08-20T20:56:00+00:00",
            "helpful_count": 31,
            "mal_id": 196655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=196655"
        },
        {
            "content": "Astarotte no Omocha! is pretty much what I call \"filler anime of the season.\" In other words, an anime you will find easy to forget and probably never watch again.\r\nCharacters: Average to poor. Typical stuff you'd find in other animes like the big boobed girl, the little girl who's older than she looks that's very very very little, your moe characters, the tsundere, etc. Yeah pretty much average, typical (some times boring characters). I didn't really find any character interesting at all. \r\nStory: Average to poor. Story? I think that the majority of the series was used to show up new characters that really didn'tdo much for protagonists. Sometimes it moves slow, some times fast and some times at a different pace, geez can we get a decent pace, that way I'm not wondering \"hey where the heck did that guy go that was introduced in so and so episode? Oh well.\"\\n\\n\r\nArt: Pretty average. I didn't particularly like it. It was just too colorful and simple. Almost no detail to anything other than the reused backgrounds every once in a while.\\n\\n\r\nSound: Easily forgettable. I don't even know how the opening theme starts, to show you just how forgettable it is. I kind of remember the ending theme, but it's also, easily forgettable. Also that piano piece they played in the anime was/is reused throughout the anime over and over and over and over again. Pretty annoying.\\n\\n\r\nEnjoyment/Overall: I give it a mediocre score. It was good for some laughs, maybe some eye candy for you lolicons, but that's about it. An easily forgettable anime if you are more into the story/characters of animes. Do I recommend it? I would say probably not.",
            "date": "2011-06-28T02:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 38410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=38410"
        },
        {
            "content": "Unless you are a very young child, I don't think you'll like this anime that much. Sure, a bit of ecchi in it, but the \"I don't give a shit what happens to these people\" just overwhelms you.\r\nThe characters and story aren't that well developed and I just wanted to finish watching this one as fast as possible just to get rid of it from my life.\r\nIt did manage to entertain me somewhat though, but not until like 4 episodes in, until then I just wanted to kill myself. I just think I'm too old for this kind of boring anime.",
            "date": "2012-02-06T13:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 53361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kuroto",
                "username": "Kuroto"
            },
            "url": "https://myanimelist.net/reviews.php?id=53361"
        },
        {
            "content": "Astarotte no Omocha (which will be referred to now on as \"Lotte's Toy\") is, for the most part, a romantic comedy with ecchi and loli elements. The series initially gets some opposition for the backdrop of the story, and I'm here to tell you that initial expectations are probably wrong...at least at first. \r\nThe plot revolves around Princess Astarotte (Lotte) who has turned 10 years old, and as a succubus, has to consume the life seed (semen) of males in order to live. The issue is that Lotte hates men and it is up to our male lead (Naoya) to help change the princess's feelings.\\n\\n\r\nTo be clear, I have to point out that no sexual acts take place in this show. While there are some that are hinted at, it is never involving a loli either. While the engine for the plot is questionable at best, the results of it should bring a smile to your face. \\n\\n\r\nLotte's Toy is almost all about Lotte's interaction with Naoya and how their relationship grows. While a few of the secondary characters have direct effect in this (mainly the queen and Asuha), a lot of the side characters are there just to fill space. All of the characters are pretty average. Your enjoyment of the show will most likely change based on how much you like their interactions and not the characters themselves. \\n\\n\r\nThe level of ecchi content varies. In the first few episodes it is pretty tame, but during the middle and later portions (before the final episodes), they might overuse the fan service at expense of the characters. But, as a point of reference, the level of fan service is actually low to moderate. There is plenty of implied things (Asuha does not wear panties and this is pointed out in almost every episode), but it's not really an all out striptease. \\n\\n\r\nIf you enjoy touching stories or the interactions of the characters in shows like Shakugan No Shana or Toradora, then you should give Lotte's Toy a try. It's not going to blow you away, but you might be surprised how grown up this seemingly juvenile show can be.",
            "date": "2011-07-07T14:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 38817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=38817"
        },
        {
            "content": "I love this anime to be honest it very entertaining, and it has some moments that are funny but i don't think its perfect because..how old is the blond girl in it as old as his daughter? Also the guy in it looks like hes 10 in the beginning I thought he was her older brother. I mean he might be, but anyway forgot that lets talk about whats good I think the color and how they designed the characters was very creative I enjoyed that part and I definitely recommend this anime. I like watching it on http://www.crunchyroll.com/astarottes-toy what site do you watch yourson?\\n\r\nPlease reply and tell me what YOU think and this is only my second review so please don't hate mine because I know its not great but I honestly tried my best last time somebody said it was too short so I'm trying to make it longer please give me some tips?\\n",
            "date": "2013-11-24T17:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 121327,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3358375.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Life0fMusic",
                "username": "Life0fMusic"
            },
            "url": "https://myanimelist.net/reviews.php?id=121327"
        },
        {
            "content": "*Astarotte no Omocha!* (This is anime is intended for older audiences, watch with caution!)\r\nStory: 9 (Great)\r\nNaoya Tohara is the first male to be brought into sucubuss, Princess Lotte's harem. As Lotte is close to becoming and adult succumbs, she needs a male so she can drink his man gravy. I wish I was kidding. If you plan on watching this, I hope your memory is very selective if you don't want to feel dirtier than you did before with a couple facts involiving this anime.\r\nFirst: Princess Lotte is 10 years old, and looks her age, if not younger. She is the princess of Ygvarland andas I mentioned earlier, a sucubuss to be. Demanding a human to come to her land (as she is a fairy of some sort, in another realm). \\n\r\nNow for our male lead, Noaya, is a 23 year old man, who looks slightly bit younger, and has a daughter, whose 10, the same age as Lotte. If my calculations are collect he has a kid when he was 12, and was dumped on him when he was 15-16 (12 and pregnant anyone?).\\n\r\nNow, Ignore everything I just said.\\n\r\nAfter getting past the awkward stages of epsidode one (like a first date), everything is completely the opposite. If you came here to see a 10 year old girl suck a lollipop (hint hint), this is not the anime for you. Rather, this anime is a comedy, cute romantic anime. There is fanservice, if you seeing granny panties on a prepubescent young girl at least. It doesn't follow the storyline, but rather Princess Lotte trying to fit in, and gaining new friends along the way. It does hint sexual themes (and not to subtly I might add), I still recommend this for mature audiences, so watch with caution!\\n\\n\r\nArt: 7 (Good)\\n\r\nThe art isn't completely bad, but I've seen worse, and I've seen better. The characters were drawn well, men were handsome, girls were cute. The scenes were fluent and nice, and very well done. It was lacking in a better color scheme, but overall very well animated!\\n\\n\r\nSound: 9 (Great)\\n\r\nThe opening and closing themes were catchy, colorful, and very modern. I watched it everytime, and I loved it. The voice acting was great, reflected the characters personalities greatly. The voices were crisp, and as I watched it in subbed, was very fluent. Some animes are very hard to watch in subbed, this was quite the contrary. Some points the characters spoke to fast, or I couldn't quite understand them. Overall I give it a solid 9!\\n\\n\r\nCharacter: 7 (Good)\\n\r\nThe characters devolved well in the first five episodes, but it snowballed towards the ending. They weren't coming closer together, just same characters, different situations. Princess Lotte had a justified personality (meaning she wasnt and asswhole for the sake of being and asswhole), and overall was an adorable character. Noayan doesn't play a huge part as it implies in the synopsis, but rather his daughter Ashua takes the spotlight and is always with Lotte. Ashua is a sweet girl, teensy bit annoying at some parts (aren't we all?) and thier relationship is cute. I give it a 7 :)\\n\\n\r\nEnjoyment: 8 (Very Good)\\n\r\nI enjoyed the adventures of Lotte and Ashua, and was a very good anime. The characters were nice, and the colors were amazing.\\n\\n\r\nOverall: 8 (Very Good)\\n\r\nAfter adding the numbers together, and averaging there total, it got a well deserved solid 8. While enjoyable, there are a couple of flaws, but very rarely. I recommend this to older audiences, and hope that you will/have enjoyed this anime.\\n\\n\r\n ***If you liked my review, feel free to comment on my profile, or give me a thumbs up. If you didn't like my review, I would appreciate some feedback in the comment section of my profile, on how to improve. I will try to get back to you as soon as possible. Enjoy!!!\\n",
            "date": "2014-03-24T14:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 136785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PeachySmoothie",
                "username": "PeachySmoothie"
            },
            "url": "https://myanimelist.net/reviews.php?id=136785"
        },
        {
            "content": "There is a reason why I decide to try out shows each season without reading the synopsis. One, is because I am somewhat of a completionist and don't care but two it could ruin something. So it is often hard to appreciate anything in this show because the synopsis does just that, and basically summarizes all the bad points in this show. The first episode would seem to confirm that this is indeed the case too. I was sort of taken aback by the plot.\r\nHowever, when Naoya finally arrives in the world of demons in episode two the story changes completely. Hired to be herharem member, Naoya becomes a father like figure to the young princess. As Lotte deals with making friends, meeting her busy mother, and anything else that could happen to a 10 year old girl Naoya is there to help. Now I will admit that just because it is completely different than what it appears to be at first glance, that doesn't mean that everything is perfect. The story does not grab you attention very well, and there's a lot of ups and downs. The heartwarming moments that I loved about this show were great, but sometimes the lead up to that moment just was not as good.\\n\\n\r\nWhen Naoya moves in he brings his daughter Asusa. This energetic kid is very outgoing and quickly becomes friends with the princess. She is always there to help the princess. Of course, Asuha and Lotte are 10 and Naoya is 23 which places any real controversy on her birth when he was 13. This amounts to all the backstory in the show, as there isn't much to learn about many of the characters. However, they interact quite well and have a lot of personality.\\n\\n\r\nI usually like shows that are labeled for pedo's. Why? Well, generally the plot has to be much better, and deals with the maturing of kids rather than an illicit relationship with them. This is the category  Astarotte no Omocha falls into. While not amazing in the story department, the show is still enjoyable and meaningful. Don't be afraid to try this show, as there is only a little ecchi and you will see why there will never be an relationship, or who might get Naoya, by episode 4.\\n\\n\r\nThank you for reading my review, and I hope it was helpful in some way to you. Questions and remarks welcome!\\n",
            "date": "2011-07-27T06:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 40091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=40091"
        },
        {
            "content": "If you've gotten further than the description of this show, you're probably wondering how low of a MAL rating you're willing to tough out for 12 episodes of loli fanservice. If it's fanservice you're looking for, you're in luck, because there's tons of it. Unfortunately, besides the plethora of pantie shots, skirt lifts, ridiculous outfits designed to facilitate these things, and brief moments of semi-nudity, there's little else worth mentioning about this show except how bad it is. \r\nThere are some shows that take a ludicrous premise and make it work - where they could have just gone with predictably lewd, they surprise with atleast a modicum of character depth or stories that consist of more than just an excuse to see the characters wearing (or not) various outfits in a variety of ridiculous situations.\\n\\n\r\nThis is the show that Lotte no Omocha wants to and fails to be. Rather than a simple ecchi comedy, it attempts to craft a love story between characters who are at once both vapid and painfully tedious. Watching them fumble their way through twelve episodes of overly dramatic and predictably resolved conflicts is absolutely uninteresting, as the writers failed to give them any kind of depth or emotional IQ. Lotte acts out and storms off, her harem friend says 'hime-sama' a number of times with a very concerned look before saying and doing the exact right thing, causing Lotte to tear up and say 'Naoya' a few times before apologizing and leaving the viewer wondering why they were fighting in the first place. \\n\\n\r\nLotte functions only as the troubled loli character - she has trouble with things like wetting herself, making friends (she has none to start off with), and is in a big fight with her mother over an inexplicably unresolved problem. These things are also treated with the utmost seriousness and lots of very sad music. Naoya, despite being 23 and the father of a child (apparently raised by himself) since he was 13, is confused and flustered by things like having an erection or falling in love yet doesn't think twice about the fact that he was hired to get a blowjob from a 10-year-old fantasy creature from another world. The rest of the characters are barely worth mentioning except that their main function is to provide the viewer with a wider variety of panties and breasts to look at as this trainwreck plays out.\\n\\n\r\nAll of this is brought to life with generally mediocre-to-cheap-looking animation that makes heavy use of montages and flashbacks as you can see the animators sweating their budget.\\n\\n\r\nThis is a show that's actually worse than the already weak premise. No amount of Rie Kugimiya or pantie shots made it better, and there's no reason why you should subject yourself to it.",
            "date": "2016-02-24T15:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 211631,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=211631"
        },
        {
            "content": "This is the first review I've written, so just a little disclaimer about how I review things.\r\nI'm a pretty generous reviewer. So this might just be a 10/10 out of nowhere.\r\nAlso, some anime's that people don't necessarily think as great shows, well... I do. For some reason, certain shows that people sort of hate, I really enjoy. And just letting it out right now, this show was so awesome. :~)\r\nShit man. this is one of the greatest rom com thingy shows i've seen. after getting back into anime for having not watched any for a long period of time, this show turned me into anemotional little girl for a little bit. true, there are some sort of incestuous themes kinda going through. Sort of? Yeah. But that doesn't ruin the show whatsoever. Holy shit man, this show is so cute. It might just be that I'm getting back into anime or something, but jesus, I haven't gotten this emotional since Toradora or Chobits. I was actually afraid to watch the last episode because I didn't know if the end would be happy or sad!\\n\\n\r\nAnyway, it's a great show in my opinion. Funny, cute, charismatic and lovable characters. There isn't one character that I dislike. Except that wolf dude. well not really but whatever. Nice writing. Good world building too. I always find myself coming to animes that deal with monster worlds, or races of people lookin monsters like succubi or wolfmen. But not like, Hardcore Vampire edgy-ness. Not into that. Monsters that are pretty subtle in the shows and act very similar to people. Like that one show The Devil Is A Part Timer.\\n\\n\r\nI would explain more about why I like the show, but y'know. Spoilers.\\n\\n\r\nAnd I also might be giving the show a generous score but hey, I REALLY enjoyed it. It's whatever floats your boat, and this anime, for some odd reason, just got me right in the feels.\\n\\n\r\nRemember, this is a pretty lighthearted review. I usually like all of the shows I watch. There have only been a few animes that are too cringey for me to stand for. But usually, when I watch an anime, they just make my day. So thats part of the reason why I give pretty high reviews. I'm not going all intellectual and critical on this show for a review or anything. Just putting my overall emotions from the show into words.\\n\\n\r\nLast words of recommendations... If you like Rom-coms (with some Ecchi in there) then this is a good show.",
            "date": "2015-03-20T14:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 182867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2954601.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MrShishkebab",
                "username": "MrShishkebab"
            },
            "url": "https://myanimelist.net/reviews.php?id=182867"
        },
        {
            "content": "This Anime certainly surprised me. At first i thought it was gonna be bad and its starts out pretty terrible but as i continued to watch it i really enjoyed it. The good thing about this anime is that they did an amazing job with the romance it wasn't right away but it didn't take way too long either. I was pretty attached  to the characters and the episodes ended with me really feeling the emotions of the characters. Like in between episodes id think about it all day and be insanely curious to what was gonna happen next. Although I liked this animethere was some bad moments. The back stories could have used some work and some really weird things that i thought were not needed. I really enjoyed this anime so i hope you read this and can enjoy it too.",
            "date": "2012-10-19T23:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 75363,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1402463.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AkuDaiki",
                "username": "AkuDaiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=75363"
        },
        {
            "content": "First of this anime contains a lolicon theme. So if your very sensitive to child-adult relatioinships then its best you let it slide. But despite the male being older than he looks might let you forgive and forget. I had watched this anime and yes the lolicon did shock me a little. But I always pretended that the male protagonist is younger at age (idk) 15. Its about a succubus who has to create a harem to live. Its very sexual and the jokes are used a lot in the subject matter. it is funny if you are willing to accept it. It is shortand sometimes abruptly rushed and questions are needed. But for anime its not too bad. The animation is good and the music is great. The ending song is a personal favorite of mine. The ending actually is somewhat promising. Its charming and again if your willing to accept the anime then you will leave with a smile. It did to me. To be honest, the manga (which contains more content and plot development than the anime) has more lolicon material than this one does (such as an accidental butt grope). ^^'''  I recommend it just for entertainment. Don't take it seriously. This anime also shares its dramatic and emotional parts too and it is somewhat sad. You will not gong crying or bawling over it but it will give you a whack in the face and you end up feeling sorry for the character. The voice acting is also great. It matches the characters personality and design perfectly. But that's the power of Japanese voice actors.\\n\\n\r\nTo my eyes, its a romance anime and about learning to trust and understand caring and possibly a parent-to-child relationship. Similar to Clannad had with family value. I recommend this anime highly. its short and gives laughs. And if you need assistants for anime understandings either check up with me (I have had 20 years of experience of studying anime's meanings and such0 and/or read the manga too. Its lolicon with several ecchi jokes and references but its not too harsh and over the top. I think its a good anime.",
            "date": "2012-03-11T10:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 55765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/halo44327",
                "username": "halo44327"
            },
            "url": "https://myanimelist.net/reviews.php?id=55765"
        },
        {
            "content": "The only way I'm even able to go through watching this is because I'm watching it with my friends. I literally made an account just to talk about how much I hate this anime. It may look like a fun happy cutesy story somebody can watch and have a pretty good time. But really its just boring, disgusting, and is basically pedophilia. The only way you can enjoy this is if you basically ignore the fact that this anime is about some twenty-year-old guy (who for some reason has a female voice actor?) who basically has to get it with a bunch of little girls.It also has some other dude who falls in love with the protagonist (who is a little girl) and he's much older than she is. There's a whole bunch of other examples I could put out here to prove how disgusting this anime is but I think I've proved my point. There's also a bunch of panty shots and what not of little girls but that's not why I hate this anime. What really grinds my gears is two things. The First being the fact that they basically make light of the whole story in which a 10-year-old girl needs to get a harem of men including the male protagonist who has a daughter (what?!) who is also around 10 years old. Whats even more baffling is the fact that he's in his early twenties meaning he had her when he barely started puberty! I won't write any spoilers but let's just say \"A much older female was enjoying herself with a young boy and a surprise came from it\" Anyways back to the portrayal of all this, the anime tries to make it seem like all the disgusting crap that happens in this anime is normal and okay but really its not, everyone knows its not (in real life that is). Of course, there's the argument that its a comedy so of course it's light-hearted, but that doesn't make up for the pedophilia. Also every episode they try to hit you with a sentimental moment but you really feel nothing from them and you just want it to stop because of how boring and stale it is. And with all the pedophilia and what not its impossible to take this serious to any degree, which makes the sentimental moments that much worse.  Most of the jokes are pretty stale(in my opinion) though I did laugh at a few of them. And THEY CONTINUE WITH ALL THE PEDOPHILIA SO MUCH. I wish I could take it as a joke but this isn't just a one time thing its literally the entire foundation of the entire anime! Honestly, the only good thing about this anime is the art, it's well done and it looks great (visually). The sounds okay, I mean there was nothing that really put me in awe but it wasn't as god awful as the actual content. I'd say watch at your own peril, the only sexual parts of this anime are the lewd lolis which I personally don't enjoy, but hey if it floats your boat... In my opinion, I'd say stay away from this anime, even if all the anime in the world was completely eradicated and this was the only one left I'd still say its a waste of time. This isn't the thing I hate most in the world but this anime is a stale piece of bread with boring characters and a boring story, and the pedophilia is added dog feces. There are plenty of great anime out there you can watch, trust me when I say you won't be missing anything if you dont watch this. I said it before, Ill say it again, I absolutely hate this anime, but if you wanna watch it anyways I wont stop you... (But dont watch it)\\n",
            "date": "2018-08-26T03:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 287394,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ih8AstorottesToy",
                "username": "Ih8AstorottesToy"
            },
            "url": "https://myanimelist.net/reviews.php?id=287394"
        },
        {
            "content": "Astarotte is about a fantasy world with a lot of fantasy ideas thrown in. In Astarotte-land, the inhabitants think of humans as fairy tale creatures and pray to the world tree loosely based off of Norse mythology, which happens to connect different worlds. Astarotte-land is ruled by succubi, creatures that live off by \"sucking\" essence off others. In this world we find princess Kugimiya er... Astarotte who is a typical tsundere loli that hates males, which makes her life miserable since she must rely on male \"essence\" once she becomes an adult. After hearing about the rarity of humans, Astarotte boasts that she will starther \"harem\" only if her servants bring her a human male. You should clearly see where this is going...\\n\\n\r\nAstarotte is your typical fan-service-filled comedic romance with a very strong lean towards the former of the two. Since Astarotte-land is filled with non-humans, you get all your favorite cosplay-type characters such as a cowgirl, wolfgirl, succubus (think Lala in ToLoveRu), S&M, etc; if you're into those things... Watch this if you're into lots of panty-based fan service and other underhanded forms of humor such as getting milk to drink from a cowgirl. To be honest, despite the high-profile VAs, this was a let-down of a series.\\n\\n\r\nAnimation:\\n\r\nThe animation is fair but not great as the production quality isn't that great at times. The series is fantasy so expect a very saturated and varied color palette. Backgrounds are a bit lacking in detail but are imaginative though also somewhat strange at time (I don't understand the dwellings...). Character models are, well, appropriate given my description above. The character designs were good though some of the clothing obviously caters to certain niches. The primary form of fan service here is definitely panty shots, they pretty much sneaked one in whenever they possibly could. This was definitely over used. Naoya is also seen cross-dressing (as punishment/or not) a few times in the series. There aren't really any real battles nor anything terribly serious for the majority of the series.\\n\\n\r\nSound:\\n\r\nThe OP is a fairly slow rock piece that failed to capture my attention. The ED is an even slower piece though the melody is slightly more catchy. You'll find some insert songs including one for Kugimiya fans. The BGM is totally forgettable, partly because it's mixed in at such a low volume. It does create a light mood but can also induce slumber.\\n\\n\r\nThe VA cast is full of veterans such as Rie Kugimiya, Yui Horie, Rina Satou to name a few. You get your by now almost patented \"umu\" and tsundere behavir from Kugimiya. The VA cast doesn't dissapoint, though I still think Satou's female voices are better, though it does make a bit of sense in this series as Naoya's supposed to be girl-like in appearance (so why not voice too I guess?).\\n\\n\r\nStory:\\n\r\nNaoya is offered a ridiculous wage to work as a member of Astarotte's harem in another world. Thus you have your typical case of being \"forced\" into a relationship with initial tension and eventual acceptance. The series sticks pretty much to the book with this one and you can easily predict the plotline, though they do throw a few loose curve balls at you, including Asuha; she's Naoya's sister, right?\\n\\n\r\nDon't expect a very contiguous storyline as half-episodic side adventures abound. There's just enough semblance of a plot to keep me watching but they really go out of their way to provide scenarios for fan service. The series does eventually converge back on the main plot line and builds to a climax/conclusion but the entire ending sequence didn't feel very natural, almost contrived. As with some other shows of late, there are some pretty interesting concepts that the story introduces but then never fully develops/makes use of. Also, don't expect many plot holes to be answered as the show seeks to fill those holes with just more panty shots. In summary, the story isn't very good. It's a bit original in the setting aspect but doesn't really make use of it.\\n\\n\r\nThere is some humor in this though it's for the most part very light (fan-service type) though occasionally very implicit.\\n\\n\r\nCharacter:\\n\r\nAstarotte is your typical somewhat spoiled loli with a ultra-tsundere personality. Her relationship with Naoya does develop but, with the plotline, feels superficial. Naoya is a very mysterious character. You get glimpses of his past that just begs more questions that you'll never get answered. This really can't be considered a romance because there's this third wheel named Asuha, who eventually gets more screentime with Astarotte than Naoya; thus a third of the series is really girls hanging out while constantly being under an abnormally strong wind.\\n\\n\r\nThere are also numerous supporting characters that are introduced but don't really play a very significant role in the series, other than serving as cameo appearances by VAs.\\n\\n\r\nValue:\\n\r\nSo many potentially interesting possible developments based on the setup were wasted... In the end you're just going to have to settle for Rie Kugimiya tsundere-ness and that's about it. Given the times, I think the short girl tsundere type has outlived its popularity.",
            "date": "2015-11-01T14:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 202441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202441"
        },
        {
            "content": "Please note: The story explanation you get before watching is NOT accurate! There is NO sex in this. \r\nStory: Light hearted, much of the time. I enjoyed it, and it was sweet, well written, but please don't take the OVA as canon, if you watch it. Plot holes and they act as if the last 2 episodes never happened.\r\nArt: Pretty good, except some of the faces. Not much else to say about it.\r\nSound: Actually quite well done in this show. I liked it.\r\nCharacter: Iffy. Developed quite well for Lotte, okay for her mother, and barely for anyone else.\r\nOver all, this was a good watch, andalthough I am picking at it a bit here, I suggest watching it. And remember, there is NO sex in this. But there is ecchi to it 'till the very end. Just not loads of it, as they wanted to develop characters.",
            "date": "2015-05-22T15:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 188564,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630075.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tyone123",
                "username": "tyone123"
            },
            "url": "https://myanimelist.net/reviews.php?id=188564"
        },
        {
            "content": "Story: so the story pretty much starts out with Lotte who is ten and now with her coming of age and being a succubus she has 2 start making a harem or atleast find a guy for her harem that of course she has a problem with because she does not like guys she a guy named Naoya comes into the fold after being sent into her world by a tree also it wont stay there until he can have is daughter is there and also the fact (dont wanna spoil much) that he had a kid when he was 13 yup lol but otherwiselook at myanimelist thing of it and thats pretty much the anime\\n\\n\r\nArt: art was good nothing bad about it \\n\\n\r\nSound: i wont download the Op or Ed at all didnt really care for them that much ohterwise everyone sounded good\\n\\n\r\nCharacter: will first state that all the side characters were good otherwise lets get into the main. Nayoa is actually a pretty cool and nice guy he does eventually grow on Lotte and of course without having there moments at the start of the anime. Lotte is the main girl and is the one who hates men (again wont spoil why you gotta find out in the anime) but she a pretty care free and normal succubus. Asuha is pretty crazy for a 10 year old she barely wears in panites and often gets on lotte bad side but yeah she pretty care free aswell.\\n\\n\r\nEnjoyment: honestly i personally didnt enjoy this anime that much easily read the person that a review for (pretty sure they gave it a 6 and a 2) that pretty much whats wrong with it SO many plot holes and also the hit and miss (atleast for me) the comedy just gives that \"ill just watch it this time and forget about it\"\\n\\n\r\nOverall: giving this a 6 the comedy was a hit and miss i did enjoy this but not to a extent personally this was a more of a sit back anime like sit back relax and enjoy i personally wont ever watch it again but this anime is decent",
            "date": "2017-03-12T22:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 242457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=242457"
        }
    ],
    [
        {
            "content": "Astarotte no Omocha! (or \"Astarotte's Toy!\" in English), is a harem, ecchi, comedy series that follows the escapades of Astarotte Ygvar, a ten year old succubus princess who is under the conviction of forming a man-harem, in order to guzzle \"man juice\" so as to preserve her youth and beauty. With the clear direction established, the series becomes a collection of episodic antics involving young , tsundere Astarotte and her boy-toys, all aiming towards the token \"hunk of the week\" and a hearty showering of baby butter to top it [and her] all off.\r\n\tHave you got all that? Good. Now forget everything I just toldyou, because this series has -next to nothing to do with any of that-. Sadly, a large sum of people that read the plot synopsis are going to think that this series is all about a ten year old girl sucking down throat yogurt, but that isn't the case. So what should someone going into Astarotte no Omocha! expect out of it?\\n\\n\r\n\tWell first thing's first, it's still an ecchi series. It's not going to magically cure your phobia of seeing a 10 year old girl in a sexually suggestive scenario or an overly large bosom stuffed into all too restrictive clothing. Though, in a world where the tag \"ecchi\" is near synonymous with \"seemingly random and all-too-frequent upskirts, due to a sudden gust of wind or poor choice of panning camera angles, that only serve to have the protagonist slugged  into the stratosphere\", Astarotte no Omocha! dares to be different. Most of the H content comes solely from the risque and colourfully abundant array of outfits that the characters squeeze themselves into, and take it from me, the wardrobes of each character in this show are vast and vibrant. In fact, for a series with an ecchi brand there's very little direct fanservice; what that means is that, until episode 9 (obligatory beach episode), the only \"fanservice\" that's delivered is thinly veiled clips that cater to a specific fetish. \\n\\n\r\n\tThough, even if the series is speckled with these \"fetish-tastic\" scenes, all the usual triteness you'd expect from an ecchi anime takes a backseat to story-telling and character development. If you plan to watch Astarotte no Omocha! strictly to see a loli eat a bowl of man chowder, you'll find yourself instead using adjectives like \"heart-warming\" or \"touching\"; the end of the series could even squeeze a tear from the coldest of hearts.\\n\\n\r\n\tI mentioned before that, despite the plot synopsis, this show isn't about Astarotte forming a man-harem to gargle mayonnaise. While that theme serves as a  sort of whispered guideline, it's forgettable at best; it's mentioned here and there throughout the series, but beyond episode one it's rarely ever spoken of beyond the occasional badgering of Judith. Instead, this anime is about the young princess Astarotte vainly proclaiming she's capable, and willing, to round up a troupe of men if, and only if, a human is present amongst them and the events that transpire afterward. However, only one male love interest is present, despite the calls for a harem.\\n\\n\r\n\tEnter Naoya, the human \"recruited\" by Astarotte's subjects to serve as a member of her harem, and father (yes, you read that right) of Asuha, a spunky young girl around the same age as the princess. Though despite him being conscripted to sleep with Lotte, he never actually slips into her bed, unless it's to tuck her in for the night or offer her a glass of warm milk (of the bovine variety). Their relationship is more akin to a big brother and little sister than anything sexual. He also acts as one of two butlers (being labelled Astarotte's personal \"toy\" after her phobia of men slowly disipates, but she only mentions that title once or twice instead of constantly lawding it over the protag, unlike some choice JCStaff series) serving at the princess's castle, alongside the maid, Effie, the captain of Astarottes personal guard, Zelda, and the person responsible for dragging Naoya into their world in the first place, Judith.\\n\\n\r\n\tA handful of other characters are also introduced as the series progresses, all of whom are unique enough to be enjoyable; none of them have especially unique personalities, sure, but they all have such colourful and unique outfits or appearances that you won't have trouble remembering any of them (for one reason or another). I suppose this is also a good time to say that, despite Lotte being voiced by Kugimiya Rie, she is the \"good\" type of tsundere; she actually acts in a matter befitting a 10 year old girl, of royal descent, who dislikes the male gender (and doesn't spit out an endless stream of \"urusai\" when angered or embarassed). See; Taiga.\\n\\n\r\n\tAlongside Kugimiya Rie there's a handful of other well-known voice actors, including Tamura Yukari (as Asuha) and Horie Yui (as Effie) who provide the voices for Furude Rika and Hanyuu, respectively, from the Higurashi series. Satou Rina, known for her work as Misaka Mikoto from Index and Negi Springfield from Negima, plays the part of Naoya, while Saito Chiwa, who voices two of my favourite characters, Rebecca Miyamoto from Pani Poni Dash! and Francesca Lucchini from Strike Witches, performs the role of the rabbit-eared sage, Ingrid. The intro theme is your average J-rock song that's enjoyable but nothing you haven't heard before, while the ending theme is a soft and slow ballad by the artist Azusa, both of which are relatively calm. But the background music is the area where audio truly shines in this series; it plays at the right times, it fits the mood, it's not too loud, theres alot of variety, it's all very pleasent to listen to and it all rounds off this anime into one nice little package.\\n\\n\r\n\tAll in all, Astarotte no Omocha! is a show everyone should try at least once. Even if ecchi isn't something you enjoy, it's easy to look past that and see how many good things this anime has going for it. A refreshing new spin on the ecchi genre that goes above and beyond what one would expect despite being labelled with such a misleading synopsis, a story that's quirky most of the time and lovable the rest, with a cast of interesting  characters, excellent voice acting and music, a budding romantic relationship and a vast repertoire of fetish coverage, all in one.\\n\\n\r\n\tSadly, if you're looking for an anime to sate your bukake fetish, you're going to have to look elsewhere.",
            "date": "2011-06-28T20:24:00+00:00",
            "helpful_count": 305,
            "mal_id": 38442,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/382449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/superspats",
                "username": "superspats"
            },
            "url": "https://myanimelist.net/reviews.php?id=38442"
        },
        {
            "content": "I think some people have the wrong idea about this anime, don't read the damn synopsis, this anime has nothing to do with anything the Synopsis says. Trust me, I've actually read the manga (well...like four chapters you get the jest of it)\r\nAstarotte no Omocha! isn't an Ecchi Loli anime. It is a Medieval Fantasy RomCom that just so happens to have Lolis in it. Oh yeah, did I mention there are viking elements in it? Yes this anime has Yggdrasil, uses Nordic mythos names and also mentions other realms of Yggdrasil, there certainly was some research involved in this anime and I comment that.\r\nPlot:The main plot may turn people off, a loli succubus that has to gather a male harem. Well in truth this anime has no real plot, per say. It is the type of anime that will have plot from episodes 10-12. There is actually only one male in the 'harem' and he acts more of like a onii-chan figure, but i'll come to that later. Overall, the plot is nothing special at the moment but don't really expect one, even if it is following the manga pretty well. 7/10\\n\\n\r\nCharacters: Here at the moment I am only going to address Lotte as Naoya hasn't really been talked about yet. \\n\r\nLotte is your typical Rie Tsundere character in every way. Just lolified instead of flat-chested. She is dependent on her servants, can't really do anything with help from the supporting cast and Naoya. She takes the role of a Princess forced with duties that she doesn't want as she hates men due to seeing what Sigmund Freud and other mind-examiners (sorry forgot how to spell the word..psycia...something) call a \"Primal Scene\". Overrall, she is only here to be angry, sad, and a loli. 6/10 (no that isn't bad a 6 means Fair, like as an an ok)\\n\\n\r\nArt: If you read my Dog days review you know I love fantasy scenes. No problems here. The Animation is ok but I personally watch the anime just for the backgrounds, I don't have to look at the characters really, well-drawn as they are in their own way. 8/10\\n\\n\r\nSound: no problems with the Acting. The OP and ED are forgettable as you will just stare at the art. 6/10\\n\\n\r\nEnjoyment: I'm a fan of the manga and the anime follows the manga so far, i'm just watching a slightly edited and animated version of the manga. 8/10\\n\\n\r\nOverall: 7/10\\n\\n\r\nAstarotte no Omocha! will be watched by lolicons, as this is the loli anime of the season. But, if you aren't a loli (like moi) I advise you to watch it while you have some spare time in-between watching Hoshizora e Kakaru Hashi and Hanasaku Iroha (well, that is what I'm doing) as it is a nice tale and worth some notice.",
            "date": "2011-04-19T16:44:00+00:00",
            "helpful_count": 83,
            "mal_id": 36227,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/248217.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/P_D_S",
                "username": "P_D_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=36227"
        },
        {
            "content": "I don't know what made me watch this show. I really shouldn't have. I could think of a hundred much better ways of spending 288 minutes of my life (at least one of which would be thinking of 99 other ways), other than watching this awful pedophilia-themed snore-inducing train wreck of a show. Some spoilers to follow, should you care.\r\nStory: 1\r\nYou see that summary up at the top of the page? That's the entire plot. There is no development at all besides what is in that paragraph. Naoya, the 23 year old guy who looks like he's about 14 and is voiced by a girl,is taken from his world to be employed as a member of a 10-year old girl's harem so that she can drink his sperm every day. She hates men and is Rie Kugimiya. They pretend to have a plot near the end where the portal to the monster world is trying to erase Naoya and his daughter, so it starts with them losing their voices, but it seems by the very next episode the creators forgot that the characters were supposed to not be able to hear one another and just went ahead with it anyhow. So if you're not watching for the plot, it's gotta be something else, right?\\n\\n\r\nArt: 2\\n\r\nIt's not that bad. If you're a pedophile. Every 5 minutes or so you get some sort of phallic imagery alongside the underaged characters. Nothing else really stands out. It's just dull and unimpressive. So if you're not watching for the art, it's gotta be something else, right?\\n\\n\r\nSound: 1\\n\r\nRie Kugimiya can die in a fire. I really, really hate her voice. A few times in this show I actually just muted and watched it silent for a while because her screams make me that angry. That, and every character has a high, squeaky voice. The OP/ED are forgettable and uninspired, and the only voice I liked was that of the mosquito in the last episode. Unless you're watching for the assorted squeaks of Japan you could otherwise find in a bale of laboratory mice, it's gotta be for something else, right?\\n\\n\r\nCharacter: 1\\n\r\nHere's where my real beef with the show stands. You find out eventually that Naoya was actually taken to the land of monsters years ago (11 years to be exact), when he was 12, and while he was 12, impregnated the queen, the result of which is his daughter Asuha. I'm not sure if they ever address it directly, but that makes her step-sisters with the princess Astarotte. But then they go to the same school later, and sit together in the same class. That makes them the same age, or at most 9 months apart which would mean more likely than not they would belong in separate classes. Therefore we can only conclude they were born at the same time, suggesting fraternal twins (clearly not identical, one is blonde and the other is blue). In the two characters biographies, it's written that Asuha is the older sister and Astarotte is the younger, but both are 10 years old. Therefore... Naoya must also be Astarotte's father. Which puts a pretty interest twist on things when he is taken back into the land of monsters to provide a faucet for her succubus necessities. By episode 12, he even says to her that he's fallen in love with her. He KNOWS that she's at the most distant, his step-daughter. And yet he's there for that very purpose anyhow. What is WRONG with you, Japan?\\n\\n\r\nEnjoyment: 1\\n\r\nI found many other better things to do while watching this show. \\n\\n\r\nOverall: 2\\n\r\nI would have given this show a 1, but I don't feel any show can ever match the only show I've ever given a 1 - Shingetsutan Tsukihime. That is, I would have given it at 1, if a Tsukihime anime even existed. So unless you've already made your list of a hundred things you could do with 288 minutes that would be better than watching this show and are looking for something further to do, stick away from this miserable, steaming, heap of crap.",
            "date": "2011-06-27T14:26:00+00:00",
            "helpful_count": 60,
            "mal_id": 38385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/157985.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Cheating",
                "username": "Cheating"
            },
            "url": "https://myanimelist.net/reviews.php?id=38385"
        },
        {
            "content": "In a world where a cute little blond haired, green eyed succubus girl has to suck the love juice out of men in order to a survive, we have my waifu... or protagonist, Astarotte Ygvar, which sounds like it could be Swedish. Now, not much can be said of series considering there is but one episode currently aired, so the entirety of this review will be formed from the opinions made after watching episode one.\r\nIf you suki kawaii little tsundere lolis who hontoni kirai men, and get off on the idea that she has to construct a male harem, as well as consume the lovejuices from said male harem, in order to keep her pure, virgin,  maiden like appearance and good health, then this show is definitely for you! On top of these excellent points about the main girl, we also are introduced to a rather stimulating bath scene with many various attractive women bathing together in an open bath, I think the rice pickers call that an onsen? wakarimasen lol\\n\\n\r\nAs for the other characters of this show, I only am attracted to my perfect maiden flat chested blond loli, so I don’t have much details to report yet. Though from what I can tell, that guard “Zelda” is probably a closet yuri lolicon who wants to violate the loli hime-sama in more ways than even myself. So she’s definitely the second best character of the show. If you suki women who are in to little girls, that’s another good reason to watch this show.\\n\\n\r\nAs for the male counterparts, well let us be honest, if you are watching this show or have any interest in this show, chances are character development and plot and male characters are not anything you have interest in to begin with, so let us just say the main male is a sod who is a total bro and totally wants this little girl to feast on his Sauzfryma for scientific and medical benefits to the blond loli.\\n\\n\r\nSo, to sum it up; if you suki blond tsundere loli, lesbian lolicon women, and bro lolicon men who are going to violate little girls for their own good, this show is a definite must-see for the spring season!",
            "date": "2011-04-12T14:08:00+00:00",
            "helpful_count": 60,
            "mal_id": 35984,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341852.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Sartaj",
                "username": "Sartaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=35984"
        },
        {
            "content": "THIS CONTAINS A LOT OF SPOILERS SO YOU CAN READ WHAT YOU'RE GETTING INTO IF YOU DECIDE TO WATCH IT OR NOT AND FOR THOSE WHO WANT TO READ A REVIEW WITH SPOILERS AND SKIP 4 HOURS OF MEDIOCRITY IN 2 MINUTES...\r\nStory\r\nI really was enjoying this anime for the idea it has from the episodes 1 to 6 with the fatherly love that may seem is there, but i was dissapointed half way through because things are not like that, wanting to put together a 10 year old girl with a 23 year old guy, but to make the things less uncomfortable in their eyesthey made the main dude Naoya look like a 15 y/o boy and to top that he was ''raped'' (as seen in the OVA) by Lotte's mother the queen Marcelida when he was a kid and they had a baby named Asuha, who in fact is Lotte's elder half sister.\\n\\n\r\nIt's never explained why Asuha was sent to the human world (just implyig it was for her own safety) and Lotte is never aware of this, she till the end will never know that the guy she's in love with is kind of his step father nor that he slept with her mother and sure will never know that Asuha is her half sister, because Marcelida requested Naoya not to tell this to anyone (and i was looking if in the manga the reason was explained, but is not) and that bothered me, i felt that Marcelida was careless towards Asuha, who she didn't see for like 7 years and didn't show affection, that really bothered me even more, they wanted to make us see that she wasn't a bad slut mom with the last episode's scene, they didn't even talked to each other technically, they were speaking but because of the tree magic thing, they didn't heard what they were saying to each other and it was a pointless scene, it was dissapointing to see that they just talked in the fifth episode after finally the three of them were reunited (in slut mom's eyes was a special moment), they just said some words but never talked directly and slutty just flies away from them.\\n\\n\r\nThere are some plot holes like, how is it that Naoya had a lot of magic, being human? (you see this in the OVA, the conversation between the Bat and Marcelida about Naoya having a lot of magic so she can use it to go back to her world) is never explained, and is important because if he didn't had magic, Marcelida wouldn't have f***ed him and would never come back to where she belongs and never had a child and thus the main story of the anime not existing or the fact that she sent Asuha to the human world because she was in danger is Bulls**t because Asuha and Lotte were 3 y/o so they would remember being sisters, if Lotte remembered seeing her mom sleeping with a guy when she was 4, why didn't they remember they were sisters and spend time together? and why wouldn't Marcelida hide Lotte too, why just Asuha? why? to keep being a slut sucking and fu**ing her harem of d**ks?.\\n\\n\r\nMarcelida and Naoya are the ones to blame for the love Lotte feels for Naoya, for not telling the truth to her, Naoya knowing all of this is worse tho. Mediocre.\\n\\n\r\nArt & Sound\\n\r\nI think these two things are the best from the anime, the art style was average, the landscape and the characters were drawn ok. The VA was average, Kugimiya is here as a meh tsundere, the backrgound music was also average, the OP and the ED were just meh. Overall both were average.\\n\\n\r\nCharacter\\n\r\nThe characters were mediocre. -Lotte reminded me of Louise from Zero no tsukaima because of how annoying they can be half the time (and obviously because Kugimiya does both VA) minus the violence towards the protagonist but the hatred towards men because her mother made a promise that they were going to rest in the same room that night but she saw a man from Marcelida's harem entering the room when she was headed to enter and saw her mom sucking him and she felt betrayed and traumatized by that.\\n\r\n-Asuha is cheerful, but i don't know why she doesn't ask herself why her mother did those things, she never asked herself, why she sent her to the human world, why Marcelida wants to hide the fact that she's her child and why she doesn't seem interested on her, that's bull...\\n\r\n-Naoya was the toy of Lotte but felt more like a butler, he is the only guy in her harem, and the only one she needs apparently and as stated before he and Marcelida are the ones to blame for not telling the truth to Lotte about everything, maybe she wouldn't fall in love with Naoya but is not her fault, she didn't know she fell for her (blood/step?) father, the one that her mother banged, the one who knew all of that was him and still found out that he loves her, even tho he's 13 years older, that's fucked up and Marcelida too, knowing that she fu**ed him, she will let her daughter be with him, that's even worse. The support characters were meh, overall was mediocre.\\n\\n\r\nEnjoyment\\n\r\nWell i just enjoyed parts of the episodes 1 to 6 and some things from the last two, i would have really enjoyed this if it wasn't for the bad story with Marcelida and Naoya being the ''adults'' that did nothing good to their kids, like how they were related all four of them, the plot holes, everything that was a let down, and i think the age difference wasn't what bothered me the most, but how all of them were related but one of them will never know. It was a mediocre enjoyment.",
            "date": "2015-08-20T20:56:00+00:00",
            "helpful_count": 31,
            "mal_id": 196655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=196655"
        },
        {
            "content": "Astarotte no Omocha! is pretty much what I call \"filler anime of the season.\" In other words, an anime you will find easy to forget and probably never watch again.\r\nCharacters: Average to poor. Typical stuff you'd find in other animes like the big boobed girl, the little girl who's older than she looks that's very very very little, your moe characters, the tsundere, etc. Yeah pretty much average, typical (some times boring characters). I didn't really find any character interesting at all. \r\nStory: Average to poor. Story? I think that the majority of the series was used to show up new characters that really didn'tdo much for protagonists. Sometimes it moves slow, some times fast and some times at a different pace, geez can we get a decent pace, that way I'm not wondering \"hey where the heck did that guy go that was introduced in so and so episode? Oh well.\"\\n\\n\r\nArt: Pretty average. I didn't particularly like it. It was just too colorful and simple. Almost no detail to anything other than the reused backgrounds every once in a while.\\n\\n\r\nSound: Easily forgettable. I don't even know how the opening theme starts, to show you just how forgettable it is. I kind of remember the ending theme, but it's also, easily forgettable. Also that piano piece they played in the anime was/is reused throughout the anime over and over and over and over again. Pretty annoying.\\n\\n\r\nEnjoyment/Overall: I give it a mediocre score. It was good for some laughs, maybe some eye candy for you lolicons, but that's about it. An easily forgettable anime if you are more into the story/characters of animes. Do I recommend it? I would say probably not.",
            "date": "2011-06-28T02:36:00+00:00",
            "helpful_count": 20,
            "mal_id": 38410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Charliegone",
                "username": "Charliegone"
            },
            "url": "https://myanimelist.net/reviews.php?id=38410"
        },
        {
            "content": "Unless you are a very young child, I don't think you'll like this anime that much. Sure, a bit of ecchi in it, but the \"I don't give a shit what happens to these people\" just overwhelms you.\r\nThe characters and story aren't that well developed and I just wanted to finish watching this one as fast as possible just to get rid of it from my life.\r\nIt did manage to entertain me somewhat though, but not until like 4 episodes in, until then I just wanted to kill myself. I just think I'm too old for this kind of boring anime.",
            "date": "2012-02-06T13:55:00+00:00",
            "helpful_count": 7,
            "mal_id": 53361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kuroto",
                "username": "Kuroto"
            },
            "url": "https://myanimelist.net/reviews.php?id=53361"
        },
        {
            "content": "Astarotte no Omocha (which will be referred to now on as \"Lotte's Toy\") is, for the most part, a romantic comedy with ecchi and loli elements. The series initially gets some opposition for the backdrop of the story, and I'm here to tell you that initial expectations are probably wrong...at least at first. \r\nThe plot revolves around Princess Astarotte (Lotte) who has turned 10 years old, and as a succubus, has to consume the life seed (semen) of males in order to live. The issue is that Lotte hates men and it is up to our male lead (Naoya) to help change the princess's feelings.\\n\\n\r\nTo be clear, I have to point out that no sexual acts take place in this show. While there are some that are hinted at, it is never involving a loli either. While the engine for the plot is questionable at best, the results of it should bring a smile to your face. \\n\\n\r\nLotte's Toy is almost all about Lotte's interaction with Naoya and how their relationship grows. While a few of the secondary characters have direct effect in this (mainly the queen and Asuha), a lot of the side characters are there just to fill space. All of the characters are pretty average. Your enjoyment of the show will most likely change based on how much you like their interactions and not the characters themselves. \\n\\n\r\nThe level of ecchi content varies. In the first few episodes it is pretty tame, but during the middle and later portions (before the final episodes), they might overuse the fan service at expense of the characters. But, as a point of reference, the level of fan service is actually low to moderate. There is plenty of implied things (Asuha does not wear panties and this is pointed out in almost every episode), but it's not really an all out striptease. \\n\\n\r\nIf you enjoy touching stories or the interactions of the characters in shows like Shakugan No Shana or Toradora, then you should give Lotte's Toy a try. It's not going to blow you away, but you might be surprised how grown up this seemingly juvenile show can be.",
            "date": "2011-07-07T14:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 38817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=38817"
        },
        {
            "content": "I love this anime to be honest it very entertaining, and it has some moments that are funny but i don't think its perfect because..how old is the blond girl in it as old as his daughter? Also the guy in it looks like hes 10 in the beginning I thought he was her older brother. I mean he might be, but anyway forgot that lets talk about whats good I think the color and how they designed the characters was very creative I enjoyed that part and I definitely recommend this anime. I like watching it on http://www.crunchyroll.com/astarottes-toy what site do you watch yourson?\\n\r\nPlease reply and tell me what YOU think and this is only my second review so please don't hate mine because I know its not great but I honestly tried my best last time somebody said it was too short so I'm trying to make it longer please give me some tips?\\n",
            "date": "2013-11-24T17:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 121327,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3358375.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Life0fMusic",
                "username": "Life0fMusic"
            },
            "url": "https://myanimelist.net/reviews.php?id=121327"
        },
        {
            "content": "*Astarotte no Omocha!* (This is anime is intended for older audiences, watch with caution!)\r\nStory: 9 (Great)\r\nNaoya Tohara is the first male to be brought into sucubuss, Princess Lotte's harem. As Lotte is close to becoming and adult succumbs, she needs a male so she can drink his man gravy. I wish I was kidding. If you plan on watching this, I hope your memory is very selective if you don't want to feel dirtier than you did before with a couple facts involiving this anime.\r\nFirst: Princess Lotte is 10 years old, and looks her age, if not younger. She is the princess of Ygvarland andas I mentioned earlier, a sucubuss to be. Demanding a human to come to her land (as she is a fairy of some sort, in another realm). \\n\r\nNow for our male lead, Noaya, is a 23 year old man, who looks slightly bit younger, and has a daughter, whose 10, the same age as Lotte. If my calculations are collect he has a kid when he was 12, and was dumped on him when he was 15-16 (12 and pregnant anyone?).\\n\r\nNow, Ignore everything I just said.\\n\r\nAfter getting past the awkward stages of epsidode one (like a first date), everything is completely the opposite. If you came here to see a 10 year old girl suck a lollipop (hint hint), this is not the anime for you. Rather, this anime is a comedy, cute romantic anime. There is fanservice, if you seeing granny panties on a prepubescent young girl at least. It doesn't follow the storyline, but rather Princess Lotte trying to fit in, and gaining new friends along the way. It does hint sexual themes (and not to subtly I might add), I still recommend this for mature audiences, so watch with caution!\\n\\n\r\nArt: 7 (Good)\\n\r\nThe art isn't completely bad, but I've seen worse, and I've seen better. The characters were drawn well, men were handsome, girls were cute. The scenes were fluent and nice, and very well done. It was lacking in a better color scheme, but overall very well animated!\\n\\n\r\nSound: 9 (Great)\\n\r\nThe opening and closing themes were catchy, colorful, and very modern. I watched it everytime, and I loved it. The voice acting was great, reflected the characters personalities greatly. The voices were crisp, and as I watched it in subbed, was very fluent. Some animes are very hard to watch in subbed, this was quite the contrary. Some points the characters spoke to fast, or I couldn't quite understand them. Overall I give it a solid 9!\\n\\n\r\nCharacter: 7 (Good)\\n\r\nThe characters devolved well in the first five episodes, but it snowballed towards the ending. They weren't coming closer together, just same characters, different situations. Princess Lotte had a justified personality (meaning she wasnt and asswhole for the sake of being and asswhole), and overall was an adorable character. Noayan doesn't play a huge part as it implies in the synopsis, but rather his daughter Ashua takes the spotlight and is always with Lotte. Ashua is a sweet girl, teensy bit annoying at some parts (aren't we all?) and thier relationship is cute. I give it a 7 :)\\n\\n\r\nEnjoyment: 8 (Very Good)\\n\r\nI enjoyed the adventures of Lotte and Ashua, and was a very good anime. The characters were nice, and the colors were amazing.\\n\\n\r\nOverall: 8 (Very Good)\\n\r\nAfter adding the numbers together, and averaging there total, it got a well deserved solid 8. While enjoyable, there are a couple of flaws, but very rarely. I recommend this to older audiences, and hope that you will/have enjoyed this anime.\\n\\n\r\n ***If you liked my review, feel free to comment on my profile, or give me a thumbs up. If you didn't like my review, I would appreciate some feedback in the comment section of my profile, on how to improve. I will try to get back to you as soon as possible. Enjoy!!!\\n",
            "date": "2014-03-24T14:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 136785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PeachySmoothie",
                "username": "PeachySmoothie"
            },
            "url": "https://myanimelist.net/reviews.php?id=136785"
        },
        {
            "content": "There is a reason why I decide to try out shows each season without reading the synopsis. One, is because I am somewhat of a completionist and don't care but two it could ruin something. So it is often hard to appreciate anything in this show because the synopsis does just that, and basically summarizes all the bad points in this show. The first episode would seem to confirm that this is indeed the case too. I was sort of taken aback by the plot.\r\nHowever, when Naoya finally arrives in the world of demons in episode two the story changes completely. Hired to be herharem member, Naoya becomes a father like figure to the young princess. As Lotte deals with making friends, meeting her busy mother, and anything else that could happen to a 10 year old girl Naoya is there to help. Now I will admit that just because it is completely different than what it appears to be at first glance, that doesn't mean that everything is perfect. The story does not grab you attention very well, and there's a lot of ups and downs. The heartwarming moments that I loved about this show were great, but sometimes the lead up to that moment just was not as good.\\n\\n\r\nWhen Naoya moves in he brings his daughter Asusa. This energetic kid is very outgoing and quickly becomes friends with the princess. She is always there to help the princess. Of course, Asuha and Lotte are 10 and Naoya is 23 which places any real controversy on her birth when he was 13. This amounts to all the backstory in the show, as there isn't much to learn about many of the characters. However, they interact quite well and have a lot of personality.\\n\\n\r\nI usually like shows that are labeled for pedo's. Why? Well, generally the plot has to be much better, and deals with the maturing of kids rather than an illicit relationship with them. This is the category  Astarotte no Omocha falls into. While not amazing in the story department, the show is still enjoyable and meaningful. Don't be afraid to try this show, as there is only a little ecchi and you will see why there will never be an relationship, or who might get Naoya, by episode 4.\\n\\n\r\nThank you for reading my review, and I hope it was helpful in some way to you. Questions and remarks welcome!\\n",
            "date": "2011-07-27T06:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 40091,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=40091"
        },
        {
            "content": "If you've gotten further than the description of this show, you're probably wondering how low of a MAL rating you're willing to tough out for 12 episodes of loli fanservice. If it's fanservice you're looking for, you're in luck, because there's tons of it. Unfortunately, besides the plethora of pantie shots, skirt lifts, ridiculous outfits designed to facilitate these things, and brief moments of semi-nudity, there's little else worth mentioning about this show except how bad it is. \r\nThere are some shows that take a ludicrous premise and make it work - where they could have just gone with predictably lewd, they surprise with atleast a modicum of character depth or stories that consist of more than just an excuse to see the characters wearing (or not) various outfits in a variety of ridiculous situations.\\n\\n\r\nThis is the show that Lotte no Omocha wants to and fails to be. Rather than a simple ecchi comedy, it attempts to craft a love story between characters who are at once both vapid and painfully tedious. Watching them fumble their way through twelve episodes of overly dramatic and predictably resolved conflicts is absolutely uninteresting, as the writers failed to give them any kind of depth or emotional IQ. Lotte acts out and storms off, her harem friend says 'hime-sama' a number of times with a very concerned look before saying and doing the exact right thing, causing Lotte to tear up and say 'Naoya' a few times before apologizing and leaving the viewer wondering why they were fighting in the first place. \\n\\n\r\nLotte functions only as the troubled loli character - she has trouble with things like wetting herself, making friends (she has none to start off with), and is in a big fight with her mother over an inexplicably unresolved problem. These things are also treated with the utmost seriousness and lots of very sad music. Naoya, despite being 23 and the father of a child (apparently raised by himself) since he was 13, is confused and flustered by things like having an erection or falling in love yet doesn't think twice about the fact that he was hired to get a blowjob from a 10-year-old fantasy creature from another world. The rest of the characters are barely worth mentioning except that their main function is to provide the viewer with a wider variety of panties and breasts to look at as this trainwreck plays out.\\n\\n\r\nAll of this is brought to life with generally mediocre-to-cheap-looking animation that makes heavy use of montages and flashbacks as you can see the animators sweating their budget.\\n\\n\r\nThis is a show that's actually worse than the already weak premise. No amount of Rie Kugimiya or pantie shots made it better, and there's no reason why you should subject yourself to it.",
            "date": "2016-02-24T15:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 211631,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3695623.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/cuteisanarchy",
                "username": "cuteisanarchy"
            },
            "url": "https://myanimelist.net/reviews.php?id=211631"
        },
        {
            "content": "This is the first review I've written, so just a little disclaimer about how I review things.\r\nI'm a pretty generous reviewer. So this might just be a 10/10 out of nowhere.\r\nAlso, some anime's that people don't necessarily think as great shows, well... I do. For some reason, certain shows that people sort of hate, I really enjoy. And just letting it out right now, this show was so awesome. :~)\r\nShit man. this is one of the greatest rom com thingy shows i've seen. after getting back into anime for having not watched any for a long period of time, this show turned me into anemotional little girl for a little bit. true, there are some sort of incestuous themes kinda going through. Sort of? Yeah. But that doesn't ruin the show whatsoever. Holy shit man, this show is so cute. It might just be that I'm getting back into anime or something, but jesus, I haven't gotten this emotional since Toradora or Chobits. I was actually afraid to watch the last episode because I didn't know if the end would be happy or sad!\\n\\n\r\nAnyway, it's a great show in my opinion. Funny, cute, charismatic and lovable characters. There isn't one character that I dislike. Except that wolf dude. well not really but whatever. Nice writing. Good world building too. I always find myself coming to animes that deal with monster worlds, or races of people lookin monsters like succubi or wolfmen. But not like, Hardcore Vampire edgy-ness. Not into that. Monsters that are pretty subtle in the shows and act very similar to people. Like that one show The Devil Is A Part Timer.\\n\\n\r\nI would explain more about why I like the show, but y'know. Spoilers.\\n\\n\r\nAnd I also might be giving the show a generous score but hey, I REALLY enjoyed it. It's whatever floats your boat, and this anime, for some odd reason, just got me right in the feels.\\n\\n\r\nRemember, this is a pretty lighthearted review. I usually like all of the shows I watch. There have only been a few animes that are too cringey for me to stand for. But usually, when I watch an anime, they just make my day. So thats part of the reason why I give pretty high reviews. I'm not going all intellectual and critical on this show for a review or anything. Just putting my overall emotions from the show into words.\\n\\n\r\nLast words of recommendations... If you like Rom-coms (with some Ecchi in there) then this is a good show.",
            "date": "2015-03-20T14:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 182867,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2954601.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MrShishkebab",
                "username": "MrShishkebab"
            },
            "url": "https://myanimelist.net/reviews.php?id=182867"
        },
        {
            "content": "This Anime certainly surprised me. At first i thought it was gonna be bad and its starts out pretty terrible but as i continued to watch it i really enjoyed it. The good thing about this anime is that they did an amazing job with the romance it wasn't right away but it didn't take way too long either. I was pretty attached  to the characters and the episodes ended with me really feeling the emotions of the characters. Like in between episodes id think about it all day and be insanely curious to what was gonna happen next. Although I liked this animethere was some bad moments. The back stories could have used some work and some really weird things that i thought were not needed. I really enjoyed this anime so i hope you read this and can enjoy it too.",
            "date": "2012-10-19T23:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 75363,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1402463.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AkuDaiki",
                "username": "AkuDaiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=75363"
        },
        {
            "content": "First of this anime contains a lolicon theme. So if your very sensitive to child-adult relatioinships then its best you let it slide. But despite the male being older than he looks might let you forgive and forget. I had watched this anime and yes the lolicon did shock me a little. But I always pretended that the male protagonist is younger at age (idk) 15. Its about a succubus who has to create a harem to live. Its very sexual and the jokes are used a lot in the subject matter. it is funny if you are willing to accept it. It is shortand sometimes abruptly rushed and questions are needed. But for anime its not too bad. The animation is good and the music is great. The ending song is a personal favorite of mine. The ending actually is somewhat promising. Its charming and again if your willing to accept the anime then you will leave with a smile. It did to me. To be honest, the manga (which contains more content and plot development than the anime) has more lolicon material than this one does (such as an accidental butt grope). ^^'''  I recommend it just for entertainment. Don't take it seriously. This anime also shares its dramatic and emotional parts too and it is somewhat sad. You will not gong crying or bawling over it but it will give you a whack in the face and you end up feeling sorry for the character. The voice acting is also great. It matches the characters personality and design perfectly. But that's the power of Japanese voice actors.\\n\\n\r\nTo my eyes, its a romance anime and about learning to trust and understand caring and possibly a parent-to-child relationship. Similar to Clannad had with family value. I recommend this anime highly. its short and gives laughs. And if you need assistants for anime understandings either check up with me (I have had 20 years of experience of studying anime's meanings and such0 and/or read the manga too. Its lolicon with several ecchi jokes and references but its not too harsh and over the top. I think its a good anime.",
            "date": "2012-03-11T10:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 55765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/halo44327",
                "username": "halo44327"
            },
            "url": "https://myanimelist.net/reviews.php?id=55765"
        },
        {
            "content": "The only way I'm even able to go through watching this is because I'm watching it with my friends. I literally made an account just to talk about how much I hate this anime. It may look like a fun happy cutesy story somebody can watch and have a pretty good time. But really its just boring, disgusting, and is basically pedophilia. The only way you can enjoy this is if you basically ignore the fact that this anime is about some twenty-year-old guy (who for some reason has a female voice actor?) who basically has to get it with a bunch of little girls.It also has some other dude who falls in love with the protagonist (who is a little girl) and he's much older than she is. There's a whole bunch of other examples I could put out here to prove how disgusting this anime is but I think I've proved my point. There's also a bunch of panty shots and what not of little girls but that's not why I hate this anime. What really grinds my gears is two things. The First being the fact that they basically make light of the whole story in which a 10-year-old girl needs to get a harem of men including the male protagonist who has a daughter (what?!) who is also around 10 years old. Whats even more baffling is the fact that he's in his early twenties meaning he had her when he barely started puberty! I won't write any spoilers but let's just say \"A much older female was enjoying herself with a young boy and a surprise came from it\" Anyways back to the portrayal of all this, the anime tries to make it seem like all the disgusting crap that happens in this anime is normal and okay but really its not, everyone knows its not (in real life that is). Of course, there's the argument that its a comedy so of course it's light-hearted, but that doesn't make up for the pedophilia. Also every episode they try to hit you with a sentimental moment but you really feel nothing from them and you just want it to stop because of how boring and stale it is. And with all the pedophilia and what not its impossible to take this serious to any degree, which makes the sentimental moments that much worse.  Most of the jokes are pretty stale(in my opinion) though I did laugh at a few of them. And THEY CONTINUE WITH ALL THE PEDOPHILIA SO MUCH. I wish I could take it as a joke but this isn't just a one time thing its literally the entire foundation of the entire anime! Honestly, the only good thing about this anime is the art, it's well done and it looks great (visually). The sounds okay, I mean there was nothing that really put me in awe but it wasn't as god awful as the actual content. I'd say watch at your own peril, the only sexual parts of this anime are the lewd lolis which I personally don't enjoy, but hey if it floats your boat... In my opinion, I'd say stay away from this anime, even if all the anime in the world was completely eradicated and this was the only one left I'd still say its a waste of time. This isn't the thing I hate most in the world but this anime is a stale piece of bread with boring characters and a boring story, and the pedophilia is added dog feces. There are plenty of great anime out there you can watch, trust me when I say you won't be missing anything if you dont watch this. I said it before, Ill say it again, I absolutely hate this anime, but if you wanna watch it anyways I wont stop you... (But dont watch it)\\n",
            "date": "2018-08-26T03:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 287394,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Ih8AstorottesToy",
                "username": "Ih8AstorottesToy"
            },
            "url": "https://myanimelist.net/reviews.php?id=287394"
        },
        {
            "content": "Astarotte is about a fantasy world with a lot of fantasy ideas thrown in. In Astarotte-land, the inhabitants think of humans as fairy tale creatures and pray to the world tree loosely based off of Norse mythology, which happens to connect different worlds. Astarotte-land is ruled by succubi, creatures that live off by \"sucking\" essence off others. In this world we find princess Kugimiya er... Astarotte who is a typical tsundere loli that hates males, which makes her life miserable since she must rely on male \"essence\" once she becomes an adult. After hearing about the rarity of humans, Astarotte boasts that she will starther \"harem\" only if her servants bring her a human male. You should clearly see where this is going...\\n\\n\r\nAstarotte is your typical fan-service-filled comedic romance with a very strong lean towards the former of the two. Since Astarotte-land is filled with non-humans, you get all your favorite cosplay-type characters such as a cowgirl, wolfgirl, succubus (think Lala in ToLoveRu), S&M, etc; if you're into those things... Watch this if you're into lots of panty-based fan service and other underhanded forms of humor such as getting milk to drink from a cowgirl. To be honest, despite the high-profile VAs, this was a let-down of a series.\\n\\n\r\nAnimation:\\n\r\nThe animation is fair but not great as the production quality isn't that great at times. The series is fantasy so expect a very saturated and varied color palette. Backgrounds are a bit lacking in detail but are imaginative though also somewhat strange at time (I don't understand the dwellings...). Character models are, well, appropriate given my description above. The character designs were good though some of the clothing obviously caters to certain niches. The primary form of fan service here is definitely panty shots, they pretty much sneaked one in whenever they possibly could. This was definitely over used. Naoya is also seen cross-dressing (as punishment/or not) a few times in the series. There aren't really any real battles nor anything terribly serious for the majority of the series.\\n\\n\r\nSound:\\n\r\nThe OP is a fairly slow rock piece that failed to capture my attention. The ED is an even slower piece though the melody is slightly more catchy. You'll find some insert songs including one for Kugimiya fans. The BGM is totally forgettable, partly because it's mixed in at such a low volume. It does create a light mood but can also induce slumber.\\n\\n\r\nThe VA cast is full of veterans such as Rie Kugimiya, Yui Horie, Rina Satou to name a few. You get your by now almost patented \"umu\" and tsundere behavir from Kugimiya. The VA cast doesn't dissapoint, though I still think Satou's female voices are better, though it does make a bit of sense in this series as Naoya's supposed to be girl-like in appearance (so why not voice too I guess?).\\n\\n\r\nStory:\\n\r\nNaoya is offered a ridiculous wage to work as a member of Astarotte's harem in another world. Thus you have your typical case of being \"forced\" into a relationship with initial tension and eventual acceptance. The series sticks pretty much to the book with this one and you can easily predict the plotline, though they do throw a few loose curve balls at you, including Asuha; she's Naoya's sister, right?\\n\\n\r\nDon't expect a very contiguous storyline as half-episodic side adventures abound. There's just enough semblance of a plot to keep me watching but they really go out of their way to provide scenarios for fan service. The series does eventually converge back on the main plot line and builds to a climax/conclusion but the entire ending sequence didn't feel very natural, almost contrived. As with some other shows of late, there are some pretty interesting concepts that the story introduces but then never fully develops/makes use of. Also, don't expect many plot holes to be answered as the show seeks to fill those holes with just more panty shots. In summary, the story isn't very good. It's a bit original in the setting aspect but doesn't really make use of it.\\n\\n\r\nThere is some humor in this though it's for the most part very light (fan-service type) though occasionally very implicit.\\n\\n\r\nCharacter:\\n\r\nAstarotte is your typical somewhat spoiled loli with a ultra-tsundere personality. Her relationship with Naoya does develop but, with the plotline, feels superficial. Naoya is a very mysterious character. You get glimpses of his past that just begs more questions that you'll never get answered. This really can't be considered a romance because there's this third wheel named Asuha, who eventually gets more screentime with Astarotte than Naoya; thus a third of the series is really girls hanging out while constantly being under an abnormally strong wind.\\n\\n\r\nThere are also numerous supporting characters that are introduced but don't really play a very significant role in the series, other than serving as cameo appearances by VAs.\\n\\n\r\nValue:\\n\r\nSo many potentially interesting possible developments based on the setup were wasted... In the end you're just going to have to settle for Rie Kugimiya tsundere-ness and that's about it. Given the times, I think the short girl tsundere type has outlived its popularity.",
            "date": "2015-11-01T14:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 202441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202441"
        },
        {
            "content": "Please note: The story explanation you get before watching is NOT accurate! There is NO sex in this. \r\nStory: Light hearted, much of the time. I enjoyed it, and it was sweet, well written, but please don't take the OVA as canon, if you watch it. Plot holes and they act as if the last 2 episodes never happened.\r\nArt: Pretty good, except some of the faces. Not much else to say about it.\r\nSound: Actually quite well done in this show. I liked it.\r\nCharacter: Iffy. Developed quite well for Lotte, okay for her mother, and barely for anyone else.\r\nOver all, this was a good watch, andalthough I am picking at it a bit here, I suggest watching it. And remember, there is NO sex in this. But there is ecchi to it 'till the very end. Just not loads of it, as they wanted to develop characters.",
            "date": "2015-05-22T15:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 188564,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630075.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tyone123",
                "username": "tyone123"
            },
            "url": "https://myanimelist.net/reviews.php?id=188564"
        },
        {
            "content": "Story: so the story pretty much starts out with Lotte who is ten and now with her coming of age and being a succubus she has 2 start making a harem or atleast find a guy for her harem that of course she has a problem with because she does not like guys she a guy named Naoya comes into the fold after being sent into her world by a tree also it wont stay there until he can have is daughter is there and also the fact (dont wanna spoil much) that he had a kid when he was 13 yup lol but otherwiselook at myanimelist thing of it and thats pretty much the anime\\n\\n\r\nArt: art was good nothing bad about it \\n\\n\r\nSound: i wont download the Op or Ed at all didnt really care for them that much ohterwise everyone sounded good\\n\\n\r\nCharacter: will first state that all the side characters were good otherwise lets get into the main. Nayoa is actually a pretty cool and nice guy he does eventually grow on Lotte and of course without having there moments at the start of the anime. Lotte is the main girl and is the one who hates men (again wont spoil why you gotta find out in the anime) but she a pretty care free and normal succubus. Asuha is pretty crazy for a 10 year old she barely wears in panites and often gets on lotte bad side but yeah she pretty care free aswell.\\n\\n\r\nEnjoyment: honestly i personally didnt enjoy this anime that much easily read the person that a review for (pretty sure they gave it a 6 and a 2) that pretty much whats wrong with it SO many plot holes and also the hit and miss (atleast for me) the comedy just gives that \"ill just watch it this time and forget about it\"\\n\\n\r\nOverall: giving this a 6 the comedy was a hit and miss i did enjoy this but not to a extent personally this was a more of a sit back anime like sit back relax and enjoy i personally wont ever watch it again but this anime is decent",
            "date": "2017-03-12T22:34:00+00:00",
            "helpful_count": 0,
            "mal_id": 242457,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=242457"
        }
    ]
]