[
    [
        {
            "content": "[Spoiler Warning]\r\nWhen looking upon the surface of Rokujouma no Shinryakusha!?, one may find that it is \"just another romantic comedy\". However, it is much more than that. Yes, the interactions between the characters are hilarious and they will get you to laugh every time. However, the true genius behind this show is its strong \"parody\" element.\r\nThe plot of this anime involves many different girls invading \"Apartment 106\" (the Rokujouma), a place in which our main character, Koutarou, lives. For one reason or another, everyone seems to have great affection for this particular building (Koutarou because it is extremely cheap to rent). Thus, the characters arelocked in a never-ending conflict against each other, always duking it out to see who can lay claim to the apartment. Truth be told however, their resolve isn't that great; all of the girls end up befriending Koutarou and each other, and by the end of the anime, they all live together in harmony. So if we have a plot that doesn't exactly pan out how it was supposed to, what is there left in Rokujouma no Shinryakusha? The characters, the characters, the characters.\\n\\n\r\nEvery last one of the girls were created to mock the various stereotypical anime character archetypes. Two of the biggest parody characters are the cosplaying Mahou Shoujo and the tsundere mage.  Does the tsundere mage (Theia) not totally scream Louise from Zero no Tsukaima? Her entire character seemed like a shoutout to pettankos everywhere, and how seemingly ridiculous their tsundere personalties are. Then there's Yurika (cosplayer), who just cannot seem to convince those around her that she's an actual Mahou Shoujo. Instead, everyone writes her off as just another girl in \"that\" phase, never really taking her seriously. In a similar vein to Theia, Yurika's character was used as an absolute jab against Mahou Shoujo anime of all sorts.\\n\\n\r\nThen we have the ubiquitous Senpai, damsel in distress, and \"daughter of a magnate\" characters. The main character, Koutarou, is in love with his senpai Sakuraba, who happens to love him as well. However, the two of them are never able to profess their feelings to each other (gee, where else have we seen THIS situation before...) Another girl who is in love with him (ghost girl Sanae), seems to not be able to do anything without Koutarou. In fact, she can't even eat without him; he needs to allow her to \"possess\" him in order for her to intake food. Then there's Kiriha, who is probably the most mellow of all the girls. However, it is later discovered in the anime that she is the daughter of an incredibly powerful man, and he is the reason why she has to invade the Rokujouma. Instead of listening to her father, the princess runs away and leaves her past, opting to live with her friends instead. (Rich girl refusing to listen to her pre-ordained fate, anyone?)\\n\\n\r\nAs can be seen, I could talk about the characters for days. They are simply that lovable, and that's what sets Rokujouma no Shinryakusha!? apart from most other harem anime. Whereas others would focus on fanservice and romance, Shinryakusha is more interested in character development and solid comedy. I honestly cannot express just how funny this anime was for me (from Sanae \"possessing\" Koutarou, to just about every single Yurika moment). A certainly refreshing take on the harem genre, Rokujouma no Shinryakusha!? is a must-watch parody-anime for those seeking enjoyable characters and great laughs.\\n\\n\\n",
            "date": "2014-09-30T21:03:00+00:00",
            "helpful_count": 146,
            "mal_id": 163087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2981555.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kyuutoryuu",
                "username": "Kyuutoryuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=163087"
        },
        {
            "content": "It pains me to see how unpopular this show is. It’s really sad to see it overshadowed by cliche, nonsensical, and fan service reliant harem shows. You want a good harem show? It’s right in front of you.\r\nRokujoma (how I’ll refer to show) follows Koutarou Satomi and his life with 7 girls, 5 of them want his apartment. You’re probably thinking, “Okay, what’s so special about the show?”\r\nWell, unlike most harems, it doesn’t use fan-service for cheap laughs. It literally had almost no fan-service. A harem that doesn’t have an ecchi tag is as rare as a protagonist who isn’t oblivious. There was a beachepisode, but even that wasn’t filler. It actually contributed to the plot. Anyways, the comedy is consistent. The gags never get old and the new jokes are refreshing and funny. This shows holds a special place in my heart for not resorting to anime falls and boob grabs.\\n\\n\r\nThe overall plot is arguably the weakest part of the anime. I've read the light novel, so I didn't have any problems understanding anything, but for someone who is only an anime-viewer, it feels like everything is all over the place. One moment, a villain is introduced, who has some sort of connection with one of the main characters, and then the next moment another villain appears for another main character, so it's pretty easy to be left in a daze. However, at the very least, the plot isn't just used as an excuse to show shameless fan-service or how OP the protagonist is. The plot, for the most part, is reasonable and logical. It just wasn't organized/formatted in the best way. In short, the story is definitely engaging and entertaining, but is a bit hard to follow and understand.  \\n\\n\r\nHow the romance is approached is one of the show’s greatest qualities. All the girls don’t just suddenly fall in love with the protagonist 3 episodes in. In fact, in the end, out of the 7 girls, really only one of them has fully acknowledged that they like the main protagonist. The romance doesn’t go at some abnormal pace. Their feelings for the protagonist actually feel authentic. They see his good qualities, but they’re not crazy for him. They simply understand he’s a good guy and one of the best friends you can ever have. When the romance progresses into something more, then it was worth the wait, because you got to see legitimate reasons as to why the girls fell in love with Koutarou. \\n\\n\r\nThe show also has a nice slice of life feel to it. You get to see their school life and what they’re like at home. It’s certainly delightful to have a calm and serene atmosphere in the stead of exaggerated and melodramatic drama. \\n\\n\r\nI don’t have much to say about the art and sound. I highly doubt you’ll have a problem with the art. The heroines are cute and the scenery is nice.\\n\\n\r\nAs for the sound, the op and ed are upbeat and catchy. They both have a friendly feel to it. I don’t think I’ve ever skipped the opening. The voice actors are amazing; the voices of the characters are perfect. \\n\\n\r\nThe characters are all lovable. They’re not the most unique and realistic characters, but none of them reek generic or one-dimensional. The heroines have back-stories to add depth to their character and they don’t completely abuse any tropes. Koutarou is a great main protagonist. He’s not the standard spineless super nice male lead. He’s kind, but has his own interests too. Not to mention, he has a back bone. He doesn't let himself get stepped all over. He's got pride , something a lot of protagonists lack. \\n\\n\r\nThe cast is nothing short of adorable. The way they act and their relationships with one another are hilarious, but endearing.\\n\\n\r\nRokujouma is what a harem show should be; Good comedy that doesn't utilize fan service, romance that feels genuine, relaxing slice of life moments, and one of the most likable casts you will ever see. Give it a shot and you'll see why I'm so disappointed that it's barely talked about.",
            "date": "2015-01-04T13:57:00+00:00",
            "helpful_count": 65,
            "mal_id": 176201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3914907.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zeroskye",
                "username": "Zeroskye"
            },
            "url": "https://myanimelist.net/reviews.php?id=176201"
        },
        {
            "content": "So somewhere, someone finally got the message that the harem genre is getting stale and is in dire need of a new twist. So why not instead of girls going after a male harem lead, we make the entire cast go after something else instead? \r\nOh I don't know, maybe a cheap apartment unit filled with PLOT DEVICES? \r\nNew Meta. \r\nNo one has ever done that before in the history of harem animes. \r\nWhy make an anime to pander to a certain audience when you can pander to every single harem fan? The anime is a culmination of genres from all across the harem spectrum.It has magic, supernatural, science fiction, all fit into one convenient dorm room at the price of 5000 yen a month. \\n\\n\r\nHowever, while at first glance \"Rokujouma no Shinryakusha!?\" may seem like an innocent entry to our beloved genre but as I dig deeper it seems the anime depicts important aspects that resonates within our modern societies. \\n\\n\r\nThe series begins with Kotaro Satomi, another independent spirit high schooler whom went out of his way to live on his own. He found a really cheap room in a dorm where he could call a home and made haste to secure his newly found independence. But little did he know with his new independence lies foreign interests, with an invasion in mind for their personal gain. Right of the bat we could see that the road to a secure and peaceful life is not an easy one. Despite already acquiring the dorm unit legally, Kotaro Satomi is challenged by foreign invaders whom claim their right to the room and do not acknowledge this process simply because they had personal interest at stake. These girls have a common motivation.\\n\\n\r\nThey all wanted the D. The Dorm room to be exact. \\n\\n\r\nSo let's take a look at all these interests at stake here.\\n\\n\r\nWe begin with Sanae Higashihongan, a ghost girl. She depicts claims that historical rights precedes any other form of contract. Being the longest \"unliving\" tenant, her claim to the dorm room was because \"she was there first.\" A simple claim many would be familiar with in our modern society when discussing land settlements. Nevertheless, she has proven that she could integrate with her new host, both benefiting from a mutually beneficial partnership.  \\n\\n\r\nYurika Nijino is a magical girl. Often confused for a cosplayer, she represent the unfavourable view some hobbies are observed by certain part of society. Despite being made the comic relief and joke amongst the cast, she is undoubtedly one of the strongest, being able to avert crisis many times in the series. With this power she sees the responsibility of securing the dorm room which is a good source of PLOT DEVICE. Being a clutz, Yurika projects an image that even a powerful entity is not immune from ridicule and mistakes.\\n\\n\r\nKiriha Kurano is a descendant of the Earth People. Her story depicts a civilization that at one point was blessed with great accomplishment but was forced to move underground for unknown reasons. Her people wanting to once again regain their glory days was split between two camps. Kiriha was a moderate aiming for a peaceful integration of their societies whereas the other significant following was leaning more towards terrorism. Nothing less than a violent invasion would satisfy them even at the cost of innocent lives.\\n\\n\r\nTheiamillis Gre Fortorthe is an intergalactic alien princess. She depicts a spoiled generation blessed with the technological advances her predecessors passed down. She has little regard to moderation and often risk blowing thing out of proportion. The lack of an adult figure present in her life could be a contributing factor as she was left in the care of her babysitter, Ruth, who is her voice of reason. Theia symbolises adult negligence and her moral code was shaped by media she observed for example the Blue Knight fairytale that she is engrossed with. Her need to conquer the dorm room was established by her predecessor as a test and her relentlessness was a symbol of a generation that needs to constantly proof themselves. \\n\\n\r\nRuthkhania Nye Pardomshiha is Theia's certified babysitter. She depicts my irrational fear of beetles. Yeap that's pretty much it.  \\n\\n\r\nThen there's also other characters whom have no interest in the dorm room.\\n\\n\r\nHarumi Sakuraba is a senior and president of the knitting club whom Kotaro Satomi is a part of. She depicts the sweeping craze that is plaguing our young minds in this era known as \"Senpai Please Notice Me\" Kotaro Satomi is constantly trying to win her affection but unwitting created a distance between them as her acts very reserved around her, comparatively with the other girls. \\n\\n\r\nShizuka Kasagi, the landlady whom is the driving force behind the establishment of the Corona Convention. The convention of course is merely for show as such with many treaties in history. Despite being a strong figure established for peaceful resolutions, her indecisiveness to actually solve who owns the dorm room had subsequently caused many other proxy wars to take place, much to the despair of her own self. (Much like a certain world organization) \\n\\n\r\nWhile initially leading me to believe that this anime was going to be about the tenants fighting it out in games and political manoeuvring to gain ownership of the dorm as shown in the second episode. Eventually it just became a slice of not your usual life where the girls try to curry favour with Kotaro because they all knew he was the rightful owner of the room and because screw metas, we're going back to male harem lead.\\n\\n\r\nI take no issue with the art style as I did enjoy the variety of special effects each associated with the specific theme. Animation was done up to the current industry standards so I have no problem with that as well. Music wise to be fair, I know how the anime industry love recycling their soundtracks but I was expecting with the different themes involved, each female character would actually get some kind of distinctive character soundtrack. The opening song is somewhat catchy but not one that would stick in your head for a while.\\n\\n\r\nWhile I did enjoy the series, I was expecting more from a title that was ambitious enough to combined a huge diversity of themes as their female cast. Each girl was given about two episodes for their arc which of course fell short to actually provide a real insight into their personality, probably just a tease for viewers to actually pick up the light novel. But then again, I might be expecting too much out of the harem genre. Overall, the diversity is a nice change in pace. The lack of harem cast overbearingness is a step in the right direction. The little twist at the end was a gentle slap to my face for forgetting something happened in the first episode which I cast aside due to the escalation of female invaders. So give it a try, draw your own conclusions on what this anime is about or take it at face value for what it is. \\n",
            "date": "2014-09-27T16:35:00+00:00",
            "helpful_count": 43,
            "mal_id": 162535,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=162535"
        },
        {
            "content": "For some reason, just by looking at the cover photo of Rokujouma no Shinryakusha, makes me think that 1) it would be really funny and 2) the action scenes won't be really serious. After watching, I guess my intuition was right.\r\nStory: 8/10\r\nAn anime which has a magic girl, a shrine maid, a ghost and a noble girl for its main characters, I have never seen something like this before. The story is based mostly around the 4 parties and them trying to 'invade' the apartment room, which is for some reason, special to them. The story is also divided into stories about each main character.\r\nNow,if you think you're going to expect a lot of action scenes because of that, well you're wrong. The anime is mostly towards a funny, romance-y route. A bonus to that is the it's a harem. The harem and ecchi isn't overdone, unlike other anime which only use fan-service to make the anime much more popular. The comedy side was nicely done and thank god there are no falling and grabbing boobs and getting slapped. The action part of the anime is actually quite ok. Most of the action is around Koutarou, and his mind-blowing 'skills'.\\n\\n\r\nArt: 9/10\\n\\n\r\nI don't know why, but whenever I look at the art of the anime, I instantly think that it will be a comedy+romance or maybe an action+romance. It's probably just me. The art is very nice, the colors weren't dull. The animation is also very nice, such as Korama and Kurama when they move. \\n\\n\r\nSound: 8/10\\n\\n\r\nThe OST fits each scene, whether the scene is funny or serious. It isn't overplayed or unnecessary. The OP is very catchy and fits the happy theme of the anime. The ED is very calm but it doesn't quite fit the anime. It's more for a drama genre, though it doesn't bother me that much.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nWow, a 10/10 for character? No bitchy, annoying characters in this anime? Surprisingly, for a harem anime, yes.\\n\\n\r\nSatomi Koutarou, the main protagonist of a harem anime. He's very caring and always tries to make everyone happy, if he has done something wrong to them. Though, for a harem anime he is just a bit dense on the people around him. \\n\\n\r\nHigashihongan Sanae, the cute girl ghost that lives in the apartment room. She is very cheerful around Koutarou, though she is a ghost and can't taste food without her possessing Koutarou.\\n\\n\r\nFortorthe Theiamillia Gre (who has a name like this?!?!), the noble girl who is very smart in script-writing. She works really hard to try to make things successful. She sometimes gets angry with Koutarou, but not in a mean way (if that made sense).\\n\\n\r\nKurano Kiriha, the shrine maiden who is very elegant and good at cooking. She is very helpful to Koutarou, like helping him in tough situations. She tries to do things very peacefully, even if the things she do have to be harmful to others.\\n\\n\r\nAnd lastly, probably my favorite female character in the anime,\\n\\n\r\nNijino Yurika, the clumsy magical girl who really likes to eat food and can be outstanding, in her on way. She is very mindful of others, though people won't believe on the crazy things she say. The facial expressions and her sometimes just chomping on food in the background is probably the funniest thing in the anime. \\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nThis anime was funny and also had a good story. This anime was so interesting that I watched through it in one sitting.\\n\\n\r\nOverall: 9/10\\n\\n\r\nIf you're looking for a unique story with unique and funny characters, then this anime is for you. Would I re-watch it? YAS c:",
            "date": "2015-03-01T03:05:00+00:00",
            "helpful_count": 30,
            "mal_id": 181441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=181441"
        },
        {
            "content": "Ok, lets just cut to the chase, what do we have in here? Well, is nothing more than your usual harem type anime, where everything and anything in it was all about the harem, nothing more and nothing less, so I'm just gonna present my ratings the way it is:\r\nStory, enjoyment and overall: Mediocre 5.\r\nThe title of the anime is \"Rokujouma no Shinryakusha!?\" I can't help by notice Takehaya san's misused of the punctuation like the question mark and exclamation point , well I guess them Japs have a lot to learn about its proper usage, but enough of that, there isn't any story atall and its plot was simply too shallow to say the least, which something that one would commonly find in any anime with a harem genre, I gave it a 5 co'z there is no denying that it just another anime with such genre where guy has a lot of girls and doesn't know what to do with them, so should I explain more? I don't think so since it was pretty obvious. My enjoyment for this anime only stems from the moe that every guys likes about them girls as to who would the guy should be with, so overall there is really nothing to elaborate on something that was the usual, plain and simple.\\n\\n\\n\r\nArt and character: Good 7.\\n\\n\r\nI can never understand as to why every character should have a cow lick- that is, if that's what those strands of hair hanging out on the sides of every female character we see, now I don't if that's illustrator  Tomosane Ariike's style or something he just put for the heck of it, but it was really cute, so a 7 it is for this anime's art. Now, for the character, I'm giving it a 7 co'z I like the female character's in this anime, most especially, Yurika Nijino who is the quintessential bimbo, Sanae, the usual clingy girl (I know she is a ghost), Kiriha Kurano the usual buxom girl,  Harumi Sakuraba the potential wife material and Ruthkhania Nye Pardomshiha who is the usual on the side girl, but not so with  Theiamillis Gre Fortorthe whom despite being the quintessential  tsundere is someone I like to hate, now I kinda feel bad for Shizuka Kasagi as a support character, she basically has the potential to be part of the harem however writer  Takehaya san , doesn't think so, so, even though I like them female characters, they were the usual I can only limit it to a 7.\\n\\n\r\nSound: Decent 4.\\n\\n\r\nSince I don't have much to say about it, but I can't help but notice that  Kiriha Kurano's seiyuu,  Masumi Tazawa, seemly has a mature voice that doesn't fit a typical character who is suppose to be a teenager. \\n\\n",
            "date": "2014-09-28T11:51:00+00:00",
            "helpful_count": 16,
            "mal_id": 162749,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=162749"
        },
        {
            "content": "Rokujouma no Shinryakusha is a classic example of \"Don't judge a book with its cover\" and in the anime with its first episode. Rokujouma no Shinryakusha stands as an odd one in the world of harem anime in a really fab way. \r\nIf you're looking for something different from hackneyed harem this one is for you! \r\nThe central character of this anime is actually not a character, it's a Rokujouma (a small apartment) around which the whole story revolves. The protagonist is your usual high-school guy looking for a cheap stay in the city. His life takes a complimentary turn when the apartment he rentsturns out to be haunted, targeted by aliens, a shrine of earth god and a place for evil-cute magical girls to gather their powers. Yup, all that at once; sounds pretty bad right ? Indeed I had zero hope from this anime, the first episode wasn't only perplexing but also a bit equivocal to where the anime would head. Yet I gave this one a second try and I am glad I did, the twists in the story oh lord from the beginning to the very end the story keeps building stronger and stronger. From the encounter of Ghost hunters to the battle 'Earth People' this anime has it all though cheesy a lot of time, this story is definitely worth a listen.\\n\\n\r\nTl;dr : Fun plot twists, great story, worth a listen. \\n\\n\r\nOther than your usual useless protagonist, Satomi Kotarou, who actually turns out to be not so useless. This anime has all of those characters you encounter in a harem: the tsundere, the clingy one (literally clingy this time), the airhead one, the one who adds -sama behind your name and the one with big boobs. Oh did I mention, they are also alien, ghost, sailor moon and um some other aliens. Rokujouma no Shinryakusha has gathered all those elements of the harem and has done it right. Especially the fan-favorite Mahou Shojo Rainbow Yurika who is no doubt the cutest anime character of Summer 2014. \\n\r\nAlso there is that one character who turns Super Saiyan every time she is aroused (not in a weird way). \\n\\n\r\nTl;dr : Awesome characters; ghost, aliens, earth people, mahou shojo and the character I don't want to spoil about the sweet loving very normal knitting club member.  \\n\\n\r\nPros : \\n\r\n + Harem done right \\n\r\n + Wide variety of characters  \\n\r\n + Surprisingly good action\\n\r\n + This anime just feels too good \\n\\n\r\nCons : \\n\r\n - Bad first impression\\n\r\n - The feel good part gets a bit cheesy sometimes..\\n\r\n - Leaves with a lot of unanswered questions",
            "date": "2014-09-29T04:38:00+00:00",
            "helpful_count": 13,
            "mal_id": 162875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2579473.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lucax",
                "username": "lucax"
            },
            "url": "https://myanimelist.net/reviews.php?id=162875"
        },
        {
            "content": "To sum up the entire story in a simple sentence:\r\n\"A mini-harem show with some decent amount of story and rather interesting character backgrounds. Its action and comedy will either leave you on the edge of your seat or on the floor laughing.\"\r\nNow for those wanting to read a little more about it: \r\nBefore you continue to read, take a good look at the recommendations. This show literally feels like a cross between \"Kore wa Zombie desu ka?\" and \"Ryuugajou Nanana no Maizoukin\". \r\nWarning though: For those that are not a big fan of Harem-like shows...this may not be for you. \r\nStory (7 of 10): Surprisingly,the story seems rather straightforward and blunt. A boy named Koutarou moves into an apartment that he later discovers is haunted by a girl named Sanae. Within the next night various characters make their appearance either by flying through a window and ramming headfirst into a wall or using other various methods of entry. As more and more girls appear, what was a peaceful life for Koutarou turns into a free-for-all over Kou's living space. I'm not saying this is a great story as there are a few dull points. However this beats some of the harem-like shows in terms of story. \\n\\n\r\nArt (8 of 10): From an animator perspective, I haven't seen any issues with any lazy animation or still images. Despite that, the art style seems like the standard anime art style as there seems to be no unique part to it (unique in a way that is like the incredible use of color in No Game, No Life or the unique chibi-like style that Nichijou has). I will mention that I do love some of the splash images (favorite being during the opening). \\n\\n\r\nSound (8 of 10): Personally, I don't much take for openings and endings. However, let me share you my thoughts on both as we reach the topic of sound. Opening: Combined with its fast-paced rhythm and the animation, the opening kept me entertained and I would find myself watching the opening each time or repeatedly. Speaking of which...I'm listening to the opening right now. Ending: To be perfectly honest, this ending makes me want Milk Tea. The song itself fits with the show and does not feel out-of-place. In terms of that, they chose well with that. With the VA work, each character's voice actor seems well matched for the character personality as well. Personally enjoyed listening to Ruthkhania Pardomshiha's seiyu Saori Hayami (who voices Miyuki Shiba in Mahouka Koukou no Rettousei - another show I am currently watching) as well as some of the other starting VAs and other veteran VAs. \\n\\n\r\nCharacter (8 of 10): The variety of characters make for an interesting mix of interactions and comedic moments. From your usual uppity Tsundere to the shy and easily embarrassed girl, this anime seems to have its share of both usual characters types as well as some different character types. With this being slightly a harem-like anime, the main male protagonist is dense as usual. However, I will give the show props for having a few characters reach out to him past his density. Unlike most harem shows I've seen, Rokujouma spends a even amount of time in its series going through the basic backgrounds of each girl in terms of arcs. (Think of it like a shounen-like arc structure). The time spent in each arc gives us more than enough to understand where each girl came from. \\n\\n\r\nEnjoyment (9 of 10): Not sure if I've said much of this yet, but allow me to share on this one. This show has given me several laughs as well as some tense times. I've throughly enjoyed this series and continue to (which surprises me as it is seems to be becoming more harem-like). I'd share some of my favorite parts, but that would mean spoiling...so I'd rather avoiding having any baby seals getting clubbed for me spoiling something. \\n\\n\r\nOverall (9 of 10): As this series itself progressed, I found myself enjoying most of the moments. The simple humor as well as some of the light action sequences made for great show. I generally am not a huge fan of harems or harem-like shows, but, like Highschool DxD, Rokujouma is one of those exceptions. \\n\\n\r\nRecommend Watching?: Yes...unless you really hate anything to do with Harems or harem-like shows.",
            "date": "2014-10-13T16:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 164731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2559167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hawk2",
                "username": "Hawk2"
            },
            "url": "https://myanimelist.net/reviews.php?id=164731"
        },
        {
            "content": "Not every modern day harem is complete garbage, I, I Swear! Prepare for something that while done before is still alright, but leaves something to be desired.\r\nStory: 6 \r\nThe harem genre in general seems to be hitting a stagnant point where there is just nothing new being made that breaks the mold set by other shows before it. That's where Rokujouma no Shinryakusha seems to at least be a bit different. There's not much fan-service and the story itself is at least above average when compared to others in the genre. However due to its limited run time of 12 episodes in the end you'llbe left wanting more, but that's not necessarily a bad thing. While it does change it up slightly it still reminded me of another harem Sora no Otoshimono, with the lead being surrounded by girls that can/have to fight. This is why its awkward because unless there is a second season its hard to judge the story. In itself it does a good job of setting up likeable characters and giving some development for each, but in the end no remarkable distance is achieved story wise. This would be fine however if the characters themselves weren't already well known tropes.\\n\\n\r\nArt: 7\\n\\n\r\nThe art looks rather nice. It's a style I personally enjoy and all the characters are clean looking with fluid motions. Backgrounds are nothing spectacular, but action sequences look pretty good. It won't blow you away. It will however get the job done nicely and look good doing it. Character designs themselves are all pretty standard and what you would expect from any modern day harem.\\n\\n\r\nSound: 7\\n\\n\r\nBackground music here is nothing amazing. I liked it, but can't remember any specific piece. I did however like both the OP and ED for my own reasons, never skipped either, and I was especially fond of the ED. Sound effects are decent enough. You'll  get what you expect. A few funny/cute noises to go with the actions of the characters that suit the situation as well as decent enough environmental noises. The voice acting was my favorite part, not entirely sure why though. The characters all have their roles voiced well however and not many/any annoying voices to be heard. So all is good here.\\n\\n\r\nCharacter: 5\\n\\n\r\n(This section might be a bit spoilery, but not really passed the first episode, just fair warning.)\\n\\n\r\nThe characters are what you would expect from any other harem, but each has a small magical/super-natural twist. We have a girl from another universe/future with her servant who are there to take over the room for her family's honor. A girl from an underground society who is there to invade the earth. A magical girl who's mission is to watch and wait to protect the magic in the room from being used for evil. Then we have the local tenant, the ghost of a girl whose parent's were killed. With the main character being  the pretty usual average guy that doesn't really realize he's in a harem (Even then he's still pretty likeable as a character).\\n\\n\r\nEach falls into a trope that you are probably used to. There are no relationship developments that you probably won't see coming. Which is what saddened me because they did a generally good job developing the characters into their roles, as opposed to you knowing instantly how who is going to react to what from the start. This left me feeling the characters we're just kind of OK, but not annoying like most shows where the tropes define almost everything a character does.\\n\\n\r\nEnjoyment/Overview: 8/6\\n\\n\r\nThe story while done to death still manages to bring something relatively new to the table, and has a good way of presenting itself. There is a large amount of every kind of scene to give everyone something to look forward to, but at the same time you'll be left hanging. I'm  assuming that there is a planned second season because this show desperately needs it to succeed as something unique. As it stands now it ends in an awkward place. It hints at a romance blooming between the MC and one of the girls in his harem, and there is still no decided champion of the room, whilst evil is still lurking around the corner.\\n\\n\r\nFor what it is I enjoyed it more than I expected and that was mainly due to them slightly switching up the formula, and having somewhat interesting characters that are all fro the most part likeable. If you like harem anime this is definitely something you should watch, but be aware that it doesn't end with a winner for the MC's affection. Even if you don't generally like harems this might still have something for you in the way of comedy, and in the case of a second season maybe even romance. Overall it was pretty enjoyable even though it's pretty average.",
            "date": "2014-11-04T17:15:00+00:00",
            "helpful_count": 10,
            "mal_id": 167443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482521.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FreakyTy",
                "username": "FreakyTy"
            },
            "url": "https://myanimelist.net/reviews.php?id=167443"
        },
        {
            "content": "When Koutaru Satomi's dad gets a new job in a remote location he thanks his lucky stars when he finds a 6 Tatami Apartment (Rokujouma) for only 5000 Yen a month. He doesn't care that  its so cheep because people claim it's haunted. When the ghost actually shows up followed by a Magical Girl, Alien Princess (with attendant) and leader of the invading underground dwellers he is not giving up his room without a fight. A very low key and quiet fight lest they suffer the wrath of the cute classmate karateka Landlady. \r\nNone of the characters is  just a stereotype all ofthem have their quirks and foibles. From Koutaru's obsession with caching beetles to Magical Gil Rainbow Yurika's constant state of dead broke and the petanko tsundere Princess Theiamillis Gre Forthorthe's deep commitment to the romantic tragedy of The Silver Princess and the Blue Knight, each of the inhabitants of  Corona House room 106 is a fully realized character. Because  they are constantly battling for and therefore in the 100 sq ft of space of room 106 they can't hide from each other and the humor comes not from stupid misunderstandings but the deep knowledge of each other that only true and good friends develop.\\n\\n\r\nAnd they are good people that you wouldn't mind spending hours in a small room with. This is a slow gentle romance and you can watch each of the girls well and truly and believably fall in love with Koutaru, and his slow opening of his heart to each of them.\\n\\n\r\nWhile the animation and sound production values are good but not great (though its one of the few series that I don't skip OP and EDs when binging) the tragedy of this series is that it only has one season. The episodes cover the first 7 volumes out of 30+ and only just barely get through the setup of what is one of the sweetest and most unique harem romances ever written. \\n\r\n(Translation by J-novel Club)\\n\\n\r\nEven so. if ever I just want to feel good I watch this. From the unique premise, to the wonderful characters (no bland MC here), to the passion of competition over room 106, there is always something to bring a little joy to your day.",
            "date": "2018-12-01T13:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 295054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SteelBlaidd",
                "username": "SteelBlaidd"
            },
            "url": "https://myanimelist.net/reviews.php?id=295054"
        },
        {
            "content": "Nah man, nah. There are five girls who NEED this one room for their own personal reasons and it's just a harem of bullshit. At best it was a cute anime. There were battle scenes that took place just by coincidence and everyone's friendship came together to help the person in trouble every time.  At one point, an antagonist went to talk to a high-council type group to exact revenge on room 106 (or whatever it was) and we never heard from them again.  The story was rushed to get through all girls' storylines and it was just generally too much.",
            "date": "2015-03-20T10:11:00+00:00",
            "helpful_count": 9,
            "mal_id": 182848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1975152.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/uxie22",
                "username": "uxie22"
            },
            "url": "https://myanimelist.net/reviews.php?id=182848"
        },
        {
            "content": "The best part of this show is the beginning. It's lighthearted, it's fun, the girls are cute, and the guy doesn't suck. Great. If it could have stayed like that for twelve episodes, I'd have an eight on my hands. Maybe I'm being generous, but you get it.\r\nHowever, as I watched, I go the feeling that 'Rokujouma no Shinryakusha!?' either didn't take itself seriously enough, or took itself way too seriously, but only sometimes.\r\nI had trouble figuring out what the show wanted to be besides a harem (which it wasn't even doing that well, to be honest. Felt more like the people around him happenedto be girls, rather than his harem).\\n\\n\r\nDid it want to be a drama? If so, there wasn't enough of it, and the presentation was crap. One of these women came from space to invade a bedroom and is literally light years from all of her friends and family save her servant/secretary/pilot/(?). Why did that not come up once? Why does the magical girl not use her magic to prove her magical girl-ness? Why are the earth people invading only from this one room in Japan? When you try to make a drama, you cannot get away with plot devices like you could in a comedy.\\n\\n\r\nDid it even want to be a comedy? Well, it shouldn't have been trying to be so dramatic. The comedic vibe is ruined whenever it tries. The sudden shift into darker themes coupled with the lack of showing and the overabundance of telling to an under-informed audience kills the comedic tone set up at the beginning of the anime.\\n\\n\r\nMaybe it wanted to be a romance? Lol, jk.\\n\\n\r\nI really wanted to like it, and I loved it up to episode three, but after episode four, the drama starts to kick in and whenever those scenes happen, it feels like I'm slogging through a badly written book. It's not it's the worst show ever, and it certainly has it's good parts (essentially all the times it's not trying to solicit unearned emotions from the audience). It could have been a very fun show, but 'Rokujouma no Shinryakusha!?' tried so hard to be more than just 'fun' that it shot itself in the foot. I never forced myself to watch the next episode, but I often found myself hoping it wouldn't be a plot episode, or that it'd wrap itself up quickly if it was.\\n\\n\r\nI can't outright recommend the show, but I can't honestly say that you should avoid it either. Can't even say to give this show the three episode test as the first three are the better episodes. This anime is quite enjoyable, considering what I've said about it, I'm just annoyed by inconsistent quality. I mean, if it was consistently bad, that'd be one thing, but it was only bad sometimes, and I really liked when it wasn't bad, so I'm conflicted.",
            "date": "2016-12-01T00:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 234686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5531564.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Krynnymuffin",
                "username": "Krynnymuffin"
            },
            "url": "https://myanimelist.net/reviews.php?id=234686"
        },
        {
            "content": "Pls read the whole thing to see gd and bad points and overall rating by me thx! so hi guys it has been a veeeerrrry long time since i wrote an anime review. But the current animes ive watched so far especially this one has made me wanna write a 'hopefully no spoiler otherwise i have to take it down' anime review. So... abt this anime, this anime is well like some of u guys said, its a gem, a giant diamond hidden in the dust and gravel of mainstream animes and other 'harems with ecchi' animes. This really was a find indeed. so ifanyone were to be reading this comment or the comments arnd this anime or anything abt this anime, what are u waiting for? Just do it! watch it! the reason why its gd to me u may ask? Firstly,well, its a harem without ecchi, which is something hard to find these days i suppose. Secondly, the story is quite interesting (and amusing at some point too) cant really say which specific part is cause that would be spoilers. Thirdly,Its freaking entertaining! The awkward situations, the beach episode, the fun times they all had together despite their origins and 'interesting backgrounds' to the way Sanae possesses Koutaro to the part that Tulip gets worked up to the part Ruth gets worked up to the part... oops ive said too much. Well its a nice anime that is not too hard to watch for me. And Plus Koutaro is not too dense like Kirito or Ichika or other verrry dense characters! So thats what makes this anime even more great. However, to everything there are gd and bad points.the first bad point, in this anime, a harem is like an open door, where its too easy! true its anime, but for single forever alone teens like me i get soooooo jealous (maybe thats just to me idk lol)\\n\r\nSecond, i think the creators were trying to get Sanae closer to Koutaro by the way she posseses him? its a little on the 'trying too hard side' tbh. \\n\r\nThirdly,not allThe characters get to go on a date with koutaro! Now thats just sad! Anyways thats all for my review. Thx for reading (if u are reading till the end) \\n\r\nOverall rating 8.5/10\\n\r\nBtw am i the only one who ships Ruth with Koutaro?? Join me in shipping them together! hahahahahahah! Mustive got too amused with the episode where they almost... XD anyways guys have a great day and tell me if my review was gd kay? cause i wanna see if im rusty in typing non spoiler reviews! :)\\n\r\np.s this anime is TOO underrated i swear! This is gd stuff why is everyone is watching all the mainstream society stuff?? hahahaha\\n\r\np.p.s another disadvantage would be that this anime has too little episodes and its a one shot with no OVA or second season! This anime was so gd i finished within 2 days but not im starting to regret it cause theres not enough episodessssss arghhhhh! But it was fun and totally worth my time, take my word for it!",
            "date": "2016-06-16T08:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 220873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5276735.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yato-God69",
                "username": "Yato-God69"
            },
            "url": "https://myanimelist.net/reviews.php?id=220873"
        },
        {
            "content": "Quick short review for you guys who enjoys Comedy genre, i highly suggest this anime. \r\nStory are quite good, though doesn't make sense. Each characters has it's own signature. \r\nAnd this anime is pretty \"family-friendly\", though there is some part that might not suitable to watch with your parents (beach scene, probably).\r\nThe only bad part on this anime is how he could get suddenly fell to the ground and then all of sudden, an appearing of a coin rotating and then met with Goddess Statue(?), and then he woke up realizing nothing.\r\n*i am Indonesian so my English is not really good, tehe",
            "date": "2019-01-03T06:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 297912,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6795149.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/r1vai",
                "username": "r1vai"
            },
            "url": "https://myanimelist.net/reviews.php?id=297912"
        },
        {
            "content": "Living alone is a dream for many students or freshman in college.  The idea of becoming independent and your own person in a place to call your own can make anyone feel good and more mature than before.  But what would happen if your nice and quiet, independent life becomes invaded by strange figures of supernatural lore?  Rokujouma no Shinryakusha!?, or Invaders of the Rokujouma.\r\nStory (6.99/10):  The story of Rokujouma follows the story of Satomi Koutarou over the course of his life in high school.  In order to not trouble his father as he travels overseas, Koutarou decided to staybehind in Japan and search for an apartment for himself to live in so that he may continue going to school in Japan.  As a result, he was able to find an apartment with a monthly rent of 5000 yen (which is about 46 American) and began living his high school life.  However, all is not well as he  is soon met by four strange girls who all want to have his apartment for themselves.  And, as the tenant of the apartment, he becomes reluctant to leave.  And thus, the comedy ensues.\\n\\n\r\nThe plot of this show is very simple and likable.  A plus for the series is the fact that the story follows a very easy to follow arc after arc setup, each arc spanning about two or so episodes each.  However, because the story follows this very strict formula, the anime feels very rigid and cut into block after block of story material without any sort of proper flow in between them.  In addition, because the story follows such a rigid setup for plot, each arc felt a bit rushed due to the amount of story that they had to get through in a span of about 40 or so minutes.  This resulted in some unfavorable pacing for the show that, while unpleasant, wasn't enough to make the show completely dissatisfactory in any way.\\n\\n\r\nNow, for the arcs for the show.  What I think was a decent plus for the show was the focus that they had, which was, while rushed, focus on the four \"invaders\" of the apartment.  As a result of this, we were able to get a good amount of character development in each of them, making them a bit more three dimensional than just generic \"harem\" girls, which turns out to be false, as essentially, none of these girls wants the guy's D.  However, because of the aforementioned rigid arc setup of this show, the girls didn't get a lot of character development, at least as not as much as I would've liked, and as characters as a whole, felt a bit incomplete.  \\n\\n\r\nAnd finally, I have to talk about the ending for this show.  I don't like it.  There are upsides and downsides as to how the series ended, but for me, this series ended in a way that felt a bit like a \"read the manga\" ending.  The show in addition to giving some focus as to who the main 4 female characters of this show are and why they want the apartment for themselves, hinted throughout the entirety of the show some sort of mystical or transcendence deity or idea, which was not only unexplained to all hell, but was sort of slapped on at the end in one scene that confused me so much.  Not to mention there's not really a complete resolution to the show as a whole, which, unless this gets a second season, leaves me to have to deduct points because of just how, as a fan, unsatisfactory it left me because it really is open-ended and frustrating because of what they are teasing at as to how much they have left to reveal in the plot.\\n\\n\r\nOverview:\\n\r\n+ Dedicated arcs for development\\n\r\n+/-  Rigid arc setup (Gives easy to follow plot, but rushed pacing)\\n\r\n-  \"Read the manga ending\"  (It seems like there are a lot of these kinds of endings lately.)\\n\\n\r\nCharacters (7.20/10): The cast for Rokujouma is fairly diverse, giving us characters of various points of importance that make for both some memorable characters, and characters that we just don't really care for.\\n\\n\r\nThe first up is our main protagonist/harem master/tenant, Satomi Koutarou.  As a high schooler displaying his independence, Koutarou can be explained as a defiant character who wishes to help out anyone in need, true to his own ideals, basic Harem protagonist stuff.  There are however some nice parts to him that make themselves very apparent and slightly different from the other harem protagonists in existence.  For one thing, he knits.  From the start of the series, (rather, at the start of the series as the idea is basically shelved away), Koutarou is shown to have a strong desire to learn to knit as he must complete a task that he set for himself for reasons that they don't really make clear.  The other is the fact that he has some sort of magical whatever that makes him OP as all hell.  While these things do make him a lot more interesting as a character, the ideas get shelved very early on, or get ex-machina'd and show up whenever the plot demands, making them seem a little pointless because of just how convenient the magical bullshit shows up.\\n\\n\r\nAnd then we have the real stars of the show, the four invaders.  Sanae, Theia, Kiriha, and Yurika.  These four are the main reason focus for this anime, and thus the whole reason for its existence.  With their roles as a ghost, alien, underground person (basically like a mole person, but human), and a magical girl, let's just say that they are rather...interesting characters.  Each of them has a very distinct personality with various quicks, as well as a reason for wanting the apartment in the first place, leading to them having to fight over the apartment for complete control over it.  As the series goes on, you start to learn more about who these girls are an there is development, as mentioned before, that makes the series a bit different when you watch a different show of a similar caliber.  While I didn't see as much development as there could potentially be for these girls, I'm happy that Silver Link put in the effort to try and exemplify the importance of these girls and not make them complete 2-D cutouts.  (Sanae best girl.)\\n\\n\r\nApart from the five main characters, we have additional side characters to the series, which are split into three main categories.  The first one belongs to and only to the character known as Sakurabo.  (She doesn't really feel like a main character.)  Sakurabo is the Senpai for Koutarou, as well as may or may not have feelings for him, but that's up for debate.  Sakurabo is a character that makes me feel conflicted, as she is shown to have a good deal of plot significance (more towards the end), but is shown to be more of a side character that shows up from time to time, or makes trouble for our main protagonist.  Personally, I like her character, but the way that she was handled didn't give me a satisfactory result as to the potential that she could've had.  \\n\\n\r\nThe other two side character groups consist of the constant character, characters that are present throughout the series like Makkenji, the landlady, the dolls Karama and Koroma, and Ruth, and the arc specific characters.  As for the constant characters, while lacking in some screen time and development, these characters were more prominent in the series and more or less helped with moving the plot along.  For the most part, these characters were actually fairly decent and some were rather underused, which I felt is a flaw in the series, as some of the characters weren't used to the full potential that they could've been.  As for the arc specific characters, they don't really serve much purpose beyond moving the plot along.  They're not bad, as they give the main four girls incentive and help establish what their reason for wanting the apartment in the first place, but after that specific girl's arc is over, the arc specific characters disappear completely. \\n\\n\r\nOverall, i felt as though the cast for the show was decent and memorable enough to leave a positive impression for the cast.  While a good chunk of them were very underused and certain character aspects were left open-ended, the cast overall was fairly good and fitted well with the overall feel of the show.\\n\\n\r\nOverview:\\n\r\n+  The Harem girls.  (Sanae still best girl.)\\n\r\n+/-  Somewhat generic Harem protagonist\\n\r\n-  Underused potential with most of the cast\\n\\n\r\nArt and Sound (7.81/10 and 7.87/10):  As for overall appearance, the show was produced by Silver Link, and actually looks rather nice.  (Silver Link does some good work)  The overall look of the show is slightly moe with the appearance of the girls, but the detail of the characters looks very nice and nothing stood out as very jarring looking.  In addition, the show also sports some comedic scenes where they change the look of the character to exemplify certain emotions (normal comedy anime stuff) giving a nice bit of tone change for a brief moment.  (This is usually used with Yurika due to just how pathetic of a character she is.)  The artwork isn't bad by any means, but it does look pretty standard with what production studies are making these days.\\n\\n\r\nThere was one thing in the series in terms of artwork that seemed a bit odd to me, and that is the side ahoges.  Regardless of who the girl is, every girl in this series has a stupid bit of hair sticking up from the side of their head.  It just looks odd as it's just so blatantly there and for a long time, I was confused as to why that was even in the character design in the first place.  \\n\\n\r\nAs for the soundtrack, Rokujouma sports what I would call one of the more enjoyable OP's this season for a good amount of reasons.  #1, it's catchy.  The song, while slightly generic, is very catchy.  It's a nice upbeat song that can boosts spirits rather easily.  What really stood out in terms of significance for the song, is the fact that the four voice actresses who do the voices for the four girls sing the song.  Basically, you have the harem girls sing the song which for me showed me just how devoted this show was to idolizing the main female protagonists, which is a nice plus.  The ending for this show sports a more mysterious and mystical feel for its tune.  While I do feel like it deserves a listen and attention to, (as I do feel it is a good song as well), to me, it doesn't stack in comparison to its opening counterpart.  (funny how they sing about milk tea though.)  \\n\\n\r\nAnd finally, because I have been praising this show so much for how much emphasis they put on their harem girls, I have to praise the performance of Oomori Nichika as the voice of Yurika specifically.  The reason being is because she nails the character EXTREMELY well due to just how pathetic she is able to make Yurika sound in any given conversation.  (This just stood out to me because of just how Yurika sounds when talking.)\\n\\n\r\nOverview:\\n\r\n+  Good art (albeit weird with the multitude of side ahoges)\\n\r\n+  Catchy songs\\n\\n\r\nPersonal Enjoyment (8.33/10):  When it comes to anime, fluff is the best way to describe this show.  The kind of \"filler\" show that gives you a way to waste your time while also giving you something that is rather interesting and enjoyable.  When I first heard about this show, I was quite intrigued by just how seemingly random the story idea and the characters were.  (Not to mention I watch harems as much as I breathe air, so this was an instant to-watch.)  As I watched the series, I did feel that sense of nonsensical and somewhat random plot development that fluff shows normally had, which in some sense, did work well for this show.  I did enjoy this show a lot, I will admit.  What I didn't like however was how it ended because honestly, ending a show in a manner where you don't completely finish a story is complete and utter bull.  Let's get to the three questions, shall we?\\n\\n\r\nDid I like this show?\\n\\n\r\nYes, I did.  There were a lot of good aspects to it from an entertainment standpoint which holds well for what this show was really supposed to be, entertainment.  The plot was mostly focused on the four main girls of the series, which I find to be different and exciting due to how little other harem shows focus on the girls in their series regardless of how core they are to the show in general.  \\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nAside from the bullshit ending and rigid plot structure, I also didn't like how Sanae (the ghost girl) was handled in the series.  For one thing, she's a ghost, therefore she should not be seen or even remotely materialized in any way shape or form.  And another thing is in the first episode where the landlady character just completely accepts the fact that these four girls with seemingly made-up titles are just completely accepted.  Like \"You're an alien?  Oh, that's cool.\"  Like, there's not even any sense of wavering over the idea.  I can understand that it's an anime, but even in anime, there has to be at least some degree of disbelief.  (Maybe I'm over-thinking it\\n\\n\r\nAnd finally, would I recommend this show?\\n\\n\r\nIf you want to watch something that doesn't require you to think hard, then this would be a good pick for you.  Rokujouma is a very peculiar harem show as the girls for the most part don't actually fall in love with the guy, and contrary to possibly 90% of the other harems out there, doesn't really have fanservice.  (Well, aside from Kiriha's perks) Rokujouma is really one of those turn off your brain shows and can actually be a rather fun watch as the show never really takes itself too seriously and the characters are rather likable.  (Plus the beetle gag is pretty funny.)\\n\\n\r\nOverall Score: (7.30/10)",
            "date": "2014-10-03T23:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 163505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=163505"
        },
        {
            "content": "This show starts out really strong. The premise is interesting and really engaging. I like that the harem isn’t the sole driving force of the show. There is a plot and the harem theme ties into it seamlessly. The animation is pretty good and the voice acting is ok. Best of all, it has intrigue and originality. \r\nWhat really turned me off of this show was what happens to the plot. Around the middle it slows violently and becomes almost tedious. The main plot established at the beginning is nearly dropped and replaced by character development. While character development is important but it becomes fillerwhen it doesn’t follow the story. Clearly the producers were shooting for a second season. It seems that they forgot that there must be a first season for there to be a second. The ending is forced to crowbar in reminders of what happened in the beginning and it only serves to remind you of how little the plot has progressed. I am hoping for a second season but mostly to answer the questions that were raised in the beginning.\\n\\n\r\nIt is by no means a bad show. Instead I think it was a good idea that was poorly executed. It is definitely worth a shot.",
            "date": "2016-02-23T23:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 211580,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MadHatter90",
                "username": "MadHatter90"
            },
            "url": "https://myanimelist.net/reviews.php?id=211580"
        },
        {
            "content": "Rokujouma no Shinraykusha!? is not any ordinary harem anime I've seen. For the first time, there wasn't a single character that I would find annoying, and well, you'll get some laughs with this anime. There are times that you would not get the storyline, and I didn't get the ending that much but every episode, you'll get to see why the anime is turning into a harem-type anime. \r\nThe characters are the standouts of the anime. You have your main character, Koutaro, who bought a cheap apartment then meets girls who are trying to get the apartment for their own needs. The girls are supernatural:a ghost, a magician, a descendant of the earth people, and aliens. Well, you don't normally see those kind of characters mixed in a kind of harem anime, but it clicked.\\n\\n\r\nArt is pretty nice. I just don't get it why they need to cover the eyes and nose of the side characters. It's pretty disturbing for me. But, then again, since they need to focus on the main c's, who cares about that thing then. Storyline, you get to see a glimpse of the girls of the story, so that's pretty good. But, 12 episodes isn't enough in this anime, there are a lot of parts that I need to know. So hopefully, we get to see this in the next season if there would be. (That cliffhanger in the ending though.)\\n\\n\r\nI enjoyed the series, pretty good harem anime, VAs are pretty good, and well, improvement will be seen on the next season. If you haven't watch this series, you probably should. Get some laughs if you want to.",
            "date": "2015-06-12T19:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 190193,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635020.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SeiIsFab",
                "username": "SeiIsFab"
            },
            "url": "https://myanimelist.net/reviews.php?id=190193"
        },
        {
            "content": "At first, I thought I saw a season 2 of Ryuugajou Nanana no Maizoukin as the synopsis is almost identical. And I thought it would be a same plot as Nanana. Turn out it's wrong. Rokujouma no Shinryakusha!? is a really great romcom series. Unlike most romcom series I know, Rokujouma is not your usual romcom. Usual romcom made the girls somehow have to cling to the MC to shows her characters. But Rokujouma isn't like that. I had only found this unlikely romcom pattern only in Haganai.\r\nRokujouma started with your usual romcom start. It doesn't start really good for me. But as the storywent, it come really great. Each of the harem has their own 'route'. Each of the route really came really great: a good pace with the plot, how each the problem solved in every episode satisfied me, and how I wonder how the story would turn out, everything is made well. I can't complain about it.\\n\\n\r\nThe art is really good, not any lazy drawing there. There are some 3DCG there and it isn't unnatural to see the animation. The character design is one of the selling point in this series. The variation of character design is really amusing. I can't complain in this part too.\\n\\n\r\nThe OP and ED is your stereotypical OP and ED for a romcom series, a cheerful song as the OP and a good ending song. Too bad it's just good, not great or the best. The BGM is quite good, it matched with the story mood.\\n\\n\r\nThe character is another great point in this series. You have the cheerful ghost, tsundere alien princess, a good-manner and well-endowed princess, and the clumsy but helpful magic girl. It might filled all of the fetish you have. The heroines is really a set of romcom heroine you might find. But, it's still amusing to see them. The main character is really good, he really deserved to be harem king with all of the harem king traits. But, what the best is actually the side characters. The senpai, the landlady, even the alien assistant is really amusing characters. I feel like they all invade my heart here. lol\\n\\n\r\nI really enjoy this series, every part of this series is really lovely. There are flaw, I knew it, but it didn't ruin the experience. There are several times I came as happy as the characters there. It's great experience to watch this series.\\n\\n\r\nAs this series came to the end, I really wish there are another season for this series. It's not your everyday romcom and with every aspect is well made. I really recommend this series to you who wants a refreshing romcom with a good character, great story, and wants to enjoy every aspect of it.\\n\\n\r\nThanks for reading my review.",
            "date": "2014-10-09T22:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 164257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452111.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xgunawan",
                "username": "xgunawan"
            },
            "url": "https://myanimelist.net/reviews.php?id=164257"
        },
        {
            "content": "This anime is amusing enough, with great deposits of potential. It puts a skinflint student into a run down apartment with cheap rent. Then their appearance make many characters you see only in hardcore shonen animes,  Ghost, Magical Girl, a princess of Ancient Cilivisation of Aliens, an Invasion Commander of the Underground Dwellers and so on, so the story is practically overflowing with gag material.\r\nSadly, execution of the story is poor at best, beginning as comedy  with good foundations, then taking a turn to shonen crap story, where all the main characters unite under the flags of friendship and hard work and completelyruin the bad guys as well as the storyline.\\n\r\nPersonally, my boiling point was when the skinflint student MC was changed into Blue Knight of bullshit yore MC.\\n\r\nAll in all, DO NOT BELIEVE the comedy genre tag, this anime has as much comedy as Bleach, and it's on a similiar level. This anime is a live specimen how to ruin a good comedy with shonen, so if you're alright with being disappointed with character development of characters you feel you could grow on, this anime might be for you. You might need some help, too. Seriously, what's wrong with you?",
            "date": "2016-04-26T06:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 217209,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1472429.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XanWasting",
                "username": "XanWasting"
            },
            "url": "https://myanimelist.net/reviews.php?id=217209"
        },
        {
            "content": "[Spoiler Free Review!]\r\nIn other reviews, people seem to be branding this anime as \"underrated\". However, I just can't see it myself. I'm always reluctant to disagree with the masses, since it makes me question whether or not my opinion is valid (like, have I missed something?), but if I had to sum up this anime in one word, it would be: \"Average\". \r\nStory: 7\r\nRokujouma no Shinryakusha is a twelve episode, comedy, romance, harem. Although, it doesn't feel that way. Those tags are quite misleading in the sense that there isn't all that much romance in this anime. There are some crushes and a bit offlirting every other episode, but there really isn't any substantial romance. Instead, the anime focuses on episodic short stories revolving around the array of vibrant characters. One of its strongest aspects is the comedy. Whilst it's not exactly side-splitting, you get a couple of giggles here and there. The episodic stories are surprisingly fun. I quite often found myself drawn in by the one-episode plot twists. However, it almost feels *too* episodic. Very little relates most episodes to one another, so it feels very segmented, meaning you're not really drawn into the next episode. In addition, if you focus on the actual content of the stories themselves, none of it really seems to make much sense or follow any rules. \\n\\n\r\nArt: 6\\n\\n\r\nThe art and animation is decent. The character designs are unique from one another, though there aren't any that stand out when being compared to other anime. The overall art style isn't unique either and is sometimes inconsistent. The characters and spells are extremely vivid and bright, whereas most backgrounds seemed dull and bland. This created an odd contrast which didn't really work out. In terms of how it's drawn, it's very typical. However, there's a reason typical things are typical and that's because they work. There isn't really anything to dislike about the art but, at the same time, there's nothing that stands out.\\n\\n\r\nSound: 6\\n\\n\r\nSimilar to the art in Rokujouma no Shinryakusha, the sound is decent. The opening is pretty catchy and so is the ending. However, they don't sound unique at all and can be somewhat annoying sometimes with how babyish the singer's voice sounds. The background music isn't exactly film-score quality, either. It just sounds like typical slice-of-life jingles.\\n\\n\r\nCharacters: 7\\n\\n\r\nInitially, I saw the vast number of characters as a negative aspect. In the first episode, the anime introduces far too many characters that are so drastically different. I found myself saying \"oh c'mon, you can't be serious\" when they introduced a ghost girl, a magical girl, an underground girl and an alien girl within the space of about five minutes. Seems ridiculous, right? Anyway, I sucked it up and tried to look beyond the such blatant disregard for realism. Thankfully, over the course of the anime, you'll find yourself growing more and more fond of the likable characters and their cute mannerisms. Although it does bother me that there's one male character and about eight girl ones. I just can't relate to it because of how unrepresentative and unrealistic that degree of harem is. Overall, solid characters and, whilst not particularly unique, they are the show's strength.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nI didn't enjoy this anime as greatly as I have others, but it's decent if you're looking for something chill to pass the time. \\n\\n\r\nOverall: 6 \\n\\n\r\nChaotic, random story-lines just don't really shout \"quality\" and, to me, it's almost lazy writing. Although, Rokujouma no Shinryakusha has it's strong points. I'd recommend it if you're really into slice-of-lifes or harems. But be warned: there are anime that are much better within these genres. If you're looking for something thrilling, captivating and romantic then your best bet is to look elsewhere.",
            "date": "2015-06-26T17:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 191364,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4640167.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Blue_Miku",
                "username": "Blue_Miku"
            },
            "url": "https://myanimelist.net/reviews.php?id=191364"
        },
        {
            "content": "I gave this one a try because I had nothing else to watch.\r\nIts a very cute anime. \r\nIts a harem, ecchi genre but has a very unique and quite a chaotic plot. \r\nA guy moves into an room that he finds really cheap and wants to keep it. Suddenly he is found fighting with 4 girls for his room, each that wants the room for their own insane reasons. You have a ghost, an underground girl, an alien (+ her assistant) and a \"magical\" girl. After getting their shit kicked out by causing a ruckus and demolishing the room by the guy's landlord -- shetells everyone to sign a testament that they will resolve their quarrel without fighting. And thus they end up playing different games to get points and the one with the highest points gets the room.\\n\\n\r\nI laughed my ass off. The \"magical\" girl is sooooo funny. Her voice is the best. The others are good as well. For some reason I really like the opening theme. Although the guy's character is kind of the same as in every harem anime, the plot itself pulls this anime out of the quicksand.\\n\\n\r\nI recommend it highly. \\n\r\nJust don't expect lot of ecchi, its not that kind of anime.",
            "date": "2015-03-09T17:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 182069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=182069"
        }
    ],
    [
        {
            "content": "[Spoiler Warning]\r\nWhen looking upon the surface of Rokujouma no Shinryakusha!?, one may find that it is \"just another romantic comedy\". However, it is much more than that. Yes, the interactions between the characters are hilarious and they will get you to laugh every time. However, the true genius behind this show is its strong \"parody\" element.\r\nThe plot of this anime involves many different girls invading \"Apartment 106\" (the Rokujouma), a place in which our main character, Koutarou, lives. For one reason or another, everyone seems to have great affection for this particular building (Koutarou because it is extremely cheap to rent). Thus, the characters arelocked in a never-ending conflict against each other, always duking it out to see who can lay claim to the apartment. Truth be told however, their resolve isn't that great; all of the girls end up befriending Koutarou and each other, and by the end of the anime, they all live together in harmony. So if we have a plot that doesn't exactly pan out how it was supposed to, what is there left in Rokujouma no Shinryakusha? The characters, the characters, the characters.\\n\\n\r\nEvery last one of the girls were created to mock the various stereotypical anime character archetypes. Two of the biggest parody characters are the cosplaying Mahou Shoujo and the tsundere mage.  Does the tsundere mage (Theia) not totally scream Louise from Zero no Tsukaima? Her entire character seemed like a shoutout to pettankos everywhere, and how seemingly ridiculous their tsundere personalties are. Then there's Yurika (cosplayer), who just cannot seem to convince those around her that she's an actual Mahou Shoujo. Instead, everyone writes her off as just another girl in \"that\" phase, never really taking her seriously. In a similar vein to Theia, Yurika's character was used as an absolute jab against Mahou Shoujo anime of all sorts.\\n\\n\r\nThen we have the ubiquitous Senpai, damsel in distress, and \"daughter of a magnate\" characters. The main character, Koutarou, is in love with his senpai Sakuraba, who happens to love him as well. However, the two of them are never able to profess their feelings to each other (gee, where else have we seen THIS situation before...) Another girl who is in love with him (ghost girl Sanae), seems to not be able to do anything without Koutarou. In fact, she can't even eat without him; he needs to allow her to \"possess\" him in order for her to intake food. Then there's Kiriha, who is probably the most mellow of all the girls. However, it is later discovered in the anime that she is the daughter of an incredibly powerful man, and he is the reason why she has to invade the Rokujouma. Instead of listening to her father, the princess runs away and leaves her past, opting to live with her friends instead. (Rich girl refusing to listen to her pre-ordained fate, anyone?)\\n\\n\r\nAs can be seen, I could talk about the characters for days. They are simply that lovable, and that's what sets Rokujouma no Shinryakusha!? apart from most other harem anime. Whereas others would focus on fanservice and romance, Shinryakusha is more interested in character development and solid comedy. I honestly cannot express just how funny this anime was for me (from Sanae \"possessing\" Koutarou, to just about every single Yurika moment). A certainly refreshing take on the harem genre, Rokujouma no Shinryakusha!? is a must-watch parody-anime for those seeking enjoyable characters and great laughs.\\n\\n\\n",
            "date": "2014-09-30T21:03:00+00:00",
            "helpful_count": 146,
            "mal_id": 163087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2981555.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kyuutoryuu",
                "username": "Kyuutoryuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=163087"
        },
        {
            "content": "It pains me to see how unpopular this show is. It’s really sad to see it overshadowed by cliche, nonsensical, and fan service reliant harem shows. You want a good harem show? It’s right in front of you.\r\nRokujoma (how I’ll refer to show) follows Koutarou Satomi and his life with 7 girls, 5 of them want his apartment. You’re probably thinking, “Okay, what’s so special about the show?”\r\nWell, unlike most harems, it doesn’t use fan-service for cheap laughs. It literally had almost no fan-service. A harem that doesn’t have an ecchi tag is as rare as a protagonist who isn’t oblivious. There was a beachepisode, but even that wasn’t filler. It actually contributed to the plot. Anyways, the comedy is consistent. The gags never get old and the new jokes are refreshing and funny. This shows holds a special place in my heart for not resorting to anime falls and boob grabs.\\n\\n\r\nThe overall plot is arguably the weakest part of the anime. I've read the light novel, so I didn't have any problems understanding anything, but for someone who is only an anime-viewer, it feels like everything is all over the place. One moment, a villain is introduced, who has some sort of connection with one of the main characters, and then the next moment another villain appears for another main character, so it's pretty easy to be left in a daze. However, at the very least, the plot isn't just used as an excuse to show shameless fan-service or how OP the protagonist is. The plot, for the most part, is reasonable and logical. It just wasn't organized/formatted in the best way. In short, the story is definitely engaging and entertaining, but is a bit hard to follow and understand.  \\n\\n\r\nHow the romance is approached is one of the show’s greatest qualities. All the girls don’t just suddenly fall in love with the protagonist 3 episodes in. In fact, in the end, out of the 7 girls, really only one of them has fully acknowledged that they like the main protagonist. The romance doesn’t go at some abnormal pace. Their feelings for the protagonist actually feel authentic. They see his good qualities, but they’re not crazy for him. They simply understand he’s a good guy and one of the best friends you can ever have. When the romance progresses into something more, then it was worth the wait, because you got to see legitimate reasons as to why the girls fell in love with Koutarou. \\n\\n\r\nThe show also has a nice slice of life feel to it. You get to see their school life and what they’re like at home. It’s certainly delightful to have a calm and serene atmosphere in the stead of exaggerated and melodramatic drama. \\n\\n\r\nI don’t have much to say about the art and sound. I highly doubt you’ll have a problem with the art. The heroines are cute and the scenery is nice.\\n\\n\r\nAs for the sound, the op and ed are upbeat and catchy. They both have a friendly feel to it. I don’t think I’ve ever skipped the opening. The voice actors are amazing; the voices of the characters are perfect. \\n\\n\r\nThe characters are all lovable. They’re not the most unique and realistic characters, but none of them reek generic or one-dimensional. The heroines have back-stories to add depth to their character and they don’t completely abuse any tropes. Koutarou is a great main protagonist. He’s not the standard spineless super nice male lead. He’s kind, but has his own interests too. Not to mention, he has a back bone. He doesn't let himself get stepped all over. He's got pride , something a lot of protagonists lack. \\n\\n\r\nThe cast is nothing short of adorable. The way they act and their relationships with one another are hilarious, but endearing.\\n\\n\r\nRokujouma is what a harem show should be; Good comedy that doesn't utilize fan service, romance that feels genuine, relaxing slice of life moments, and one of the most likable casts you will ever see. Give it a shot and you'll see why I'm so disappointed that it's barely talked about.",
            "date": "2015-01-04T13:57:00+00:00",
            "helpful_count": 65,
            "mal_id": 176201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3914907.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zeroskye",
                "username": "Zeroskye"
            },
            "url": "https://myanimelist.net/reviews.php?id=176201"
        },
        {
            "content": "So somewhere, someone finally got the message that the harem genre is getting stale and is in dire need of a new twist. So why not instead of girls going after a male harem lead, we make the entire cast go after something else instead? \r\nOh I don't know, maybe a cheap apartment unit filled with PLOT DEVICES? \r\nNew Meta. \r\nNo one has ever done that before in the history of harem animes. \r\nWhy make an anime to pander to a certain audience when you can pander to every single harem fan? The anime is a culmination of genres from all across the harem spectrum.It has magic, supernatural, science fiction, all fit into one convenient dorm room at the price of 5000 yen a month. \\n\\n\r\nHowever, while at first glance \"Rokujouma no Shinryakusha!?\" may seem like an innocent entry to our beloved genre but as I dig deeper it seems the anime depicts important aspects that resonates within our modern societies. \\n\\n\r\nThe series begins with Kotaro Satomi, another independent spirit high schooler whom went out of his way to live on his own. He found a really cheap room in a dorm where he could call a home and made haste to secure his newly found independence. But little did he know with his new independence lies foreign interests, with an invasion in mind for their personal gain. Right of the bat we could see that the road to a secure and peaceful life is not an easy one. Despite already acquiring the dorm unit legally, Kotaro Satomi is challenged by foreign invaders whom claim their right to the room and do not acknowledge this process simply because they had personal interest at stake. These girls have a common motivation.\\n\\n\r\nThey all wanted the D. The Dorm room to be exact. \\n\\n\r\nSo let's take a look at all these interests at stake here.\\n\\n\r\nWe begin with Sanae Higashihongan, a ghost girl. She depicts claims that historical rights precedes any other form of contract. Being the longest \"unliving\" tenant, her claim to the dorm room was because \"she was there first.\" A simple claim many would be familiar with in our modern society when discussing land settlements. Nevertheless, she has proven that she could integrate with her new host, both benefiting from a mutually beneficial partnership.  \\n\\n\r\nYurika Nijino is a magical girl. Often confused for a cosplayer, she represent the unfavourable view some hobbies are observed by certain part of society. Despite being made the comic relief and joke amongst the cast, she is undoubtedly one of the strongest, being able to avert crisis many times in the series. With this power she sees the responsibility of securing the dorm room which is a good source of PLOT DEVICE. Being a clutz, Yurika projects an image that even a powerful entity is not immune from ridicule and mistakes.\\n\\n\r\nKiriha Kurano is a descendant of the Earth People. Her story depicts a civilization that at one point was blessed with great accomplishment but was forced to move underground for unknown reasons. Her people wanting to once again regain their glory days was split between two camps. Kiriha was a moderate aiming for a peaceful integration of their societies whereas the other significant following was leaning more towards terrorism. Nothing less than a violent invasion would satisfy them even at the cost of innocent lives.\\n\\n\r\nTheiamillis Gre Fortorthe is an intergalactic alien princess. She depicts a spoiled generation blessed with the technological advances her predecessors passed down. She has little regard to moderation and often risk blowing thing out of proportion. The lack of an adult figure present in her life could be a contributing factor as she was left in the care of her babysitter, Ruth, who is her voice of reason. Theia symbolises adult negligence and her moral code was shaped by media she observed for example the Blue Knight fairytale that she is engrossed with. Her need to conquer the dorm room was established by her predecessor as a test and her relentlessness was a symbol of a generation that needs to constantly proof themselves. \\n\\n\r\nRuthkhania Nye Pardomshiha is Theia's certified babysitter. She depicts my irrational fear of beetles. Yeap that's pretty much it.  \\n\\n\r\nThen there's also other characters whom have no interest in the dorm room.\\n\\n\r\nHarumi Sakuraba is a senior and president of the knitting club whom Kotaro Satomi is a part of. She depicts the sweeping craze that is plaguing our young minds in this era known as \"Senpai Please Notice Me\" Kotaro Satomi is constantly trying to win her affection but unwitting created a distance between them as her acts very reserved around her, comparatively with the other girls. \\n\\n\r\nShizuka Kasagi, the landlady whom is the driving force behind the establishment of the Corona Convention. The convention of course is merely for show as such with many treaties in history. Despite being a strong figure established for peaceful resolutions, her indecisiveness to actually solve who owns the dorm room had subsequently caused many other proxy wars to take place, much to the despair of her own self. (Much like a certain world organization) \\n\\n\r\nWhile initially leading me to believe that this anime was going to be about the tenants fighting it out in games and political manoeuvring to gain ownership of the dorm as shown in the second episode. Eventually it just became a slice of not your usual life where the girls try to curry favour with Kotaro because they all knew he was the rightful owner of the room and because screw metas, we're going back to male harem lead.\\n\\n\r\nI take no issue with the art style as I did enjoy the variety of special effects each associated with the specific theme. Animation was done up to the current industry standards so I have no problem with that as well. Music wise to be fair, I know how the anime industry love recycling their soundtracks but I was expecting with the different themes involved, each female character would actually get some kind of distinctive character soundtrack. The opening song is somewhat catchy but not one that would stick in your head for a while.\\n\\n\r\nWhile I did enjoy the series, I was expecting more from a title that was ambitious enough to combined a huge diversity of themes as their female cast. Each girl was given about two episodes for their arc which of course fell short to actually provide a real insight into their personality, probably just a tease for viewers to actually pick up the light novel. But then again, I might be expecting too much out of the harem genre. Overall, the diversity is a nice change in pace. The lack of harem cast overbearingness is a step in the right direction. The little twist at the end was a gentle slap to my face for forgetting something happened in the first episode which I cast aside due to the escalation of female invaders. So give it a try, draw your own conclusions on what this anime is about or take it at face value for what it is. \\n",
            "date": "2014-09-27T16:35:00+00:00",
            "helpful_count": 43,
            "mal_id": 162535,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/383982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DangoSage",
                "username": "DangoSage"
            },
            "url": "https://myanimelist.net/reviews.php?id=162535"
        },
        {
            "content": "For some reason, just by looking at the cover photo of Rokujouma no Shinryakusha, makes me think that 1) it would be really funny and 2) the action scenes won't be really serious. After watching, I guess my intuition was right.\r\nStory: 8/10\r\nAn anime which has a magic girl, a shrine maid, a ghost and a noble girl for its main characters, I have never seen something like this before. The story is based mostly around the 4 parties and them trying to 'invade' the apartment room, which is for some reason, special to them. The story is also divided into stories about each main character.\r\nNow,if you think you're going to expect a lot of action scenes because of that, well you're wrong. The anime is mostly towards a funny, romance-y route. A bonus to that is the it's a harem. The harem and ecchi isn't overdone, unlike other anime which only use fan-service to make the anime much more popular. The comedy side was nicely done and thank god there are no falling and grabbing boobs and getting slapped. The action part of the anime is actually quite ok. Most of the action is around Koutarou, and his mind-blowing 'skills'.\\n\\n\r\nArt: 9/10\\n\\n\r\nI don't know why, but whenever I look at the art of the anime, I instantly think that it will be a comedy+romance or maybe an action+romance. It's probably just me. The art is very nice, the colors weren't dull. The animation is also very nice, such as Korama and Kurama when they move. \\n\\n\r\nSound: 8/10\\n\\n\r\nThe OST fits each scene, whether the scene is funny or serious. It isn't overplayed or unnecessary. The OP is very catchy and fits the happy theme of the anime. The ED is very calm but it doesn't quite fit the anime. It's more for a drama genre, though it doesn't bother me that much.\\n\\n\r\nCharacter: 10/10\\n\\n\r\nWow, a 10/10 for character? No bitchy, annoying characters in this anime? Surprisingly, for a harem anime, yes.\\n\\n\r\nSatomi Koutarou, the main protagonist of a harem anime. He's very caring and always tries to make everyone happy, if he has done something wrong to them. Though, for a harem anime he is just a bit dense on the people around him. \\n\\n\r\nHigashihongan Sanae, the cute girl ghost that lives in the apartment room. She is very cheerful around Koutarou, though she is a ghost and can't taste food without her possessing Koutarou.\\n\\n\r\nFortorthe Theiamillia Gre (who has a name like this?!?!), the noble girl who is very smart in script-writing. She works really hard to try to make things successful. She sometimes gets angry with Koutarou, but not in a mean way (if that made sense).\\n\\n\r\nKurano Kiriha, the shrine maiden who is very elegant and good at cooking. She is very helpful to Koutarou, like helping him in tough situations. She tries to do things very peacefully, even if the things she do have to be harmful to others.\\n\\n\r\nAnd lastly, probably my favorite female character in the anime,\\n\\n\r\nNijino Yurika, the clumsy magical girl who really likes to eat food and can be outstanding, in her on way. She is very mindful of others, though people won't believe on the crazy things she say. The facial expressions and her sometimes just chomping on food in the background is probably the funniest thing in the anime. \\n\\n\r\nEnjoyment: 10/10\\n\\n\r\nThis anime was funny and also had a good story. This anime was so interesting that I watched through it in one sitting.\\n\\n\r\nOverall: 9/10\\n\\n\r\nIf you're looking for a unique story with unique and funny characters, then this anime is for you. Would I re-watch it? YAS c:",
            "date": "2015-03-01T03:05:00+00:00",
            "helpful_count": 30,
            "mal_id": 181441,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426345.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/torrapamii",
                "username": "torrapamii"
            },
            "url": "https://myanimelist.net/reviews.php?id=181441"
        },
        {
            "content": "Ok, lets just cut to the chase, what do we have in here? Well, is nothing more than your usual harem type anime, where everything and anything in it was all about the harem, nothing more and nothing less, so I'm just gonna present my ratings the way it is:\r\nStory, enjoyment and overall: Mediocre 5.\r\nThe title of the anime is \"Rokujouma no Shinryakusha!?\" I can't help by notice Takehaya san's misused of the punctuation like the question mark and exclamation point , well I guess them Japs have a lot to learn about its proper usage, but enough of that, there isn't any story atall and its plot was simply too shallow to say the least, which something that one would commonly find in any anime with a harem genre, I gave it a 5 co'z there is no denying that it just another anime with such genre where guy has a lot of girls and doesn't know what to do with them, so should I explain more? I don't think so since it was pretty obvious. My enjoyment for this anime only stems from the moe that every guys likes about them girls as to who would the guy should be with, so overall there is really nothing to elaborate on something that was the usual, plain and simple.\\n\\n\\n\r\nArt and character: Good 7.\\n\\n\r\nI can never understand as to why every character should have a cow lick- that is, if that's what those strands of hair hanging out on the sides of every female character we see, now I don't if that's illustrator  Tomosane Ariike's style or something he just put for the heck of it, but it was really cute, so a 7 it is for this anime's art. Now, for the character, I'm giving it a 7 co'z I like the female character's in this anime, most especially, Yurika Nijino who is the quintessential bimbo, Sanae, the usual clingy girl (I know she is a ghost), Kiriha Kurano the usual buxom girl,  Harumi Sakuraba the potential wife material and Ruthkhania Nye Pardomshiha who is the usual on the side girl, but not so with  Theiamillis Gre Fortorthe whom despite being the quintessential  tsundere is someone I like to hate, now I kinda feel bad for Shizuka Kasagi as a support character, she basically has the potential to be part of the harem however writer  Takehaya san , doesn't think so, so, even though I like them female characters, they were the usual I can only limit it to a 7.\\n\\n\r\nSound: Decent 4.\\n\\n\r\nSince I don't have much to say about it, but I can't help but notice that  Kiriha Kurano's seiyuu,  Masumi Tazawa, seemly has a mature voice that doesn't fit a typical character who is suppose to be a teenager. \\n\\n",
            "date": "2014-09-28T11:51:00+00:00",
            "helpful_count": 16,
            "mal_id": 162749,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=162749"
        },
        {
            "content": "Rokujouma no Shinryakusha is a classic example of \"Don't judge a book with its cover\" and in the anime with its first episode. Rokujouma no Shinryakusha stands as an odd one in the world of harem anime in a really fab way. \r\nIf you're looking for something different from hackneyed harem this one is for you! \r\nThe central character of this anime is actually not a character, it's a Rokujouma (a small apartment) around which the whole story revolves. The protagonist is your usual high-school guy looking for a cheap stay in the city. His life takes a complimentary turn when the apartment he rentsturns out to be haunted, targeted by aliens, a shrine of earth god and a place for evil-cute magical girls to gather their powers. Yup, all that at once; sounds pretty bad right ? Indeed I had zero hope from this anime, the first episode wasn't only perplexing but also a bit equivocal to where the anime would head. Yet I gave this one a second try and I am glad I did, the twists in the story oh lord from the beginning to the very end the story keeps building stronger and stronger. From the encounter of Ghost hunters to the battle 'Earth People' this anime has it all though cheesy a lot of time, this story is definitely worth a listen.\\n\\n\r\nTl;dr : Fun plot twists, great story, worth a listen. \\n\\n\r\nOther than your usual useless protagonist, Satomi Kotarou, who actually turns out to be not so useless. This anime has all of those characters you encounter in a harem: the tsundere, the clingy one (literally clingy this time), the airhead one, the one who adds -sama behind your name and the one with big boobs. Oh did I mention, they are also alien, ghost, sailor moon and um some other aliens. Rokujouma no Shinryakusha has gathered all those elements of the harem and has done it right. Especially the fan-favorite Mahou Shojo Rainbow Yurika who is no doubt the cutest anime character of Summer 2014. \\n\r\nAlso there is that one character who turns Super Saiyan every time she is aroused (not in a weird way). \\n\\n\r\nTl;dr : Awesome characters; ghost, aliens, earth people, mahou shojo and the character I don't want to spoil about the sweet loving very normal knitting club member.  \\n\\n\r\nPros : \\n\r\n + Harem done right \\n\r\n + Wide variety of characters  \\n\r\n + Surprisingly good action\\n\r\n + This anime just feels too good \\n\\n\r\nCons : \\n\r\n - Bad first impression\\n\r\n - The feel good part gets a bit cheesy sometimes..\\n\r\n - Leaves with a lot of unanswered questions",
            "date": "2014-09-29T04:38:00+00:00",
            "helpful_count": 13,
            "mal_id": 162875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2579473.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lucax",
                "username": "lucax"
            },
            "url": "https://myanimelist.net/reviews.php?id=162875"
        },
        {
            "content": "To sum up the entire story in a simple sentence:\r\n\"A mini-harem show with some decent amount of story and rather interesting character backgrounds. Its action and comedy will either leave you on the edge of your seat or on the floor laughing.\"\r\nNow for those wanting to read a little more about it: \r\nBefore you continue to read, take a good look at the recommendations. This show literally feels like a cross between \"Kore wa Zombie desu ka?\" and \"Ryuugajou Nanana no Maizoukin\". \r\nWarning though: For those that are not a big fan of Harem-like shows...this may not be for you. \r\nStory (7 of 10): Surprisingly,the story seems rather straightforward and blunt. A boy named Koutarou moves into an apartment that he later discovers is haunted by a girl named Sanae. Within the next night various characters make their appearance either by flying through a window and ramming headfirst into a wall or using other various methods of entry. As more and more girls appear, what was a peaceful life for Koutarou turns into a free-for-all over Kou's living space. I'm not saying this is a great story as there are a few dull points. However this beats some of the harem-like shows in terms of story. \\n\\n\r\nArt (8 of 10): From an animator perspective, I haven't seen any issues with any lazy animation or still images. Despite that, the art style seems like the standard anime art style as there seems to be no unique part to it (unique in a way that is like the incredible use of color in No Game, No Life or the unique chibi-like style that Nichijou has). I will mention that I do love some of the splash images (favorite being during the opening). \\n\\n\r\nSound (8 of 10): Personally, I don't much take for openings and endings. However, let me share you my thoughts on both as we reach the topic of sound. Opening: Combined with its fast-paced rhythm and the animation, the opening kept me entertained and I would find myself watching the opening each time or repeatedly. Speaking of which...I'm listening to the opening right now. Ending: To be perfectly honest, this ending makes me want Milk Tea. The song itself fits with the show and does not feel out-of-place. In terms of that, they chose well with that. With the VA work, each character's voice actor seems well matched for the character personality as well. Personally enjoyed listening to Ruthkhania Pardomshiha's seiyu Saori Hayami (who voices Miyuki Shiba in Mahouka Koukou no Rettousei - another show I am currently watching) as well as some of the other starting VAs and other veteran VAs. \\n\\n\r\nCharacter (8 of 10): The variety of characters make for an interesting mix of interactions and comedic moments. From your usual uppity Tsundere to the shy and easily embarrassed girl, this anime seems to have its share of both usual characters types as well as some different character types. With this being slightly a harem-like anime, the main male protagonist is dense as usual. However, I will give the show props for having a few characters reach out to him past his density. Unlike most harem shows I've seen, Rokujouma spends a even amount of time in its series going through the basic backgrounds of each girl in terms of arcs. (Think of it like a shounen-like arc structure). The time spent in each arc gives us more than enough to understand where each girl came from. \\n\\n\r\nEnjoyment (9 of 10): Not sure if I've said much of this yet, but allow me to share on this one. This show has given me several laughs as well as some tense times. I've throughly enjoyed this series and continue to (which surprises me as it is seems to be becoming more harem-like). I'd share some of my favorite parts, but that would mean spoiling...so I'd rather avoiding having any baby seals getting clubbed for me spoiling something. \\n\\n\r\nOverall (9 of 10): As this series itself progressed, I found myself enjoying most of the moments. The simple humor as well as some of the light action sequences made for great show. I generally am not a huge fan of harems or harem-like shows, but, like Highschool DxD, Rokujouma is one of those exceptions. \\n\\n\r\nRecommend Watching?: Yes...unless you really hate anything to do with Harems or harem-like shows.",
            "date": "2014-10-13T16:47:00+00:00",
            "helpful_count": 11,
            "mal_id": 164731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2559167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hawk2",
                "username": "Hawk2"
            },
            "url": "https://myanimelist.net/reviews.php?id=164731"
        },
        {
            "content": "Not every modern day harem is complete garbage, I, I Swear! Prepare for something that while done before is still alright, but leaves something to be desired.\r\nStory: 6 \r\nThe harem genre in general seems to be hitting a stagnant point where there is just nothing new being made that breaks the mold set by other shows before it. That's where Rokujouma no Shinryakusha seems to at least be a bit different. There's not much fan-service and the story itself is at least above average when compared to others in the genre. However due to its limited run time of 12 episodes in the end you'llbe left wanting more, but that's not necessarily a bad thing. While it does change it up slightly it still reminded me of another harem Sora no Otoshimono, with the lead being surrounded by girls that can/have to fight. This is why its awkward because unless there is a second season its hard to judge the story. In itself it does a good job of setting up likeable characters and giving some development for each, but in the end no remarkable distance is achieved story wise. This would be fine however if the characters themselves weren't already well known tropes.\\n\\n\r\nArt: 7\\n\\n\r\nThe art looks rather nice. It's a style I personally enjoy and all the characters are clean looking with fluid motions. Backgrounds are nothing spectacular, but action sequences look pretty good. It won't blow you away. It will however get the job done nicely and look good doing it. Character designs themselves are all pretty standard and what you would expect from any modern day harem.\\n\\n\r\nSound: 7\\n\\n\r\nBackground music here is nothing amazing. I liked it, but can't remember any specific piece. I did however like both the OP and ED for my own reasons, never skipped either, and I was especially fond of the ED. Sound effects are decent enough. You'll  get what you expect. A few funny/cute noises to go with the actions of the characters that suit the situation as well as decent enough environmental noises. The voice acting was my favorite part, not entirely sure why though. The characters all have their roles voiced well however and not many/any annoying voices to be heard. So all is good here.\\n\\n\r\nCharacter: 5\\n\\n\r\n(This section might be a bit spoilery, but not really passed the first episode, just fair warning.)\\n\\n\r\nThe characters are what you would expect from any other harem, but each has a small magical/super-natural twist. We have a girl from another universe/future with her servant who are there to take over the room for her family's honor. A girl from an underground society who is there to invade the earth. A magical girl who's mission is to watch and wait to protect the magic in the room from being used for evil. Then we have the local tenant, the ghost of a girl whose parent's were killed. With the main character being  the pretty usual average guy that doesn't really realize he's in a harem (Even then he's still pretty likeable as a character).\\n\\n\r\nEach falls into a trope that you are probably used to. There are no relationship developments that you probably won't see coming. Which is what saddened me because they did a generally good job developing the characters into their roles, as opposed to you knowing instantly how who is going to react to what from the start. This left me feeling the characters we're just kind of OK, but not annoying like most shows where the tropes define almost everything a character does.\\n\\n\r\nEnjoyment/Overview: 8/6\\n\\n\r\nThe story while done to death still manages to bring something relatively new to the table, and has a good way of presenting itself. There is a large amount of every kind of scene to give everyone something to look forward to, but at the same time you'll be left hanging. I'm  assuming that there is a planned second season because this show desperately needs it to succeed as something unique. As it stands now it ends in an awkward place. It hints at a romance blooming between the MC and one of the girls in his harem, and there is still no decided champion of the room, whilst evil is still lurking around the corner.\\n\\n\r\nFor what it is I enjoyed it more than I expected and that was mainly due to them slightly switching up the formula, and having somewhat interesting characters that are all fro the most part likeable. If you like harem anime this is definitely something you should watch, but be aware that it doesn't end with a winner for the MC's affection. Even if you don't generally like harems this might still have something for you in the way of comedy, and in the case of a second season maybe even romance. Overall it was pretty enjoyable even though it's pretty average.",
            "date": "2014-11-04T17:15:00+00:00",
            "helpful_count": 10,
            "mal_id": 167443,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/482521.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/FreakyTy",
                "username": "FreakyTy"
            },
            "url": "https://myanimelist.net/reviews.php?id=167443"
        },
        {
            "content": "When Koutaru Satomi's dad gets a new job in a remote location he thanks his lucky stars when he finds a 6 Tatami Apartment (Rokujouma) for only 5000 Yen a month. He doesn't care that  its so cheep because people claim it's haunted. When the ghost actually shows up followed by a Magical Girl, Alien Princess (with attendant) and leader of the invading underground dwellers he is not giving up his room without a fight. A very low key and quiet fight lest they suffer the wrath of the cute classmate karateka Landlady. \r\nNone of the characters is  just a stereotype all ofthem have their quirks and foibles. From Koutaru's obsession with caching beetles to Magical Gil Rainbow Yurika's constant state of dead broke and the petanko tsundere Princess Theiamillis Gre Forthorthe's deep commitment to the romantic tragedy of The Silver Princess and the Blue Knight, each of the inhabitants of  Corona House room 106 is a fully realized character. Because  they are constantly battling for and therefore in the 100 sq ft of space of room 106 they can't hide from each other and the humor comes not from stupid misunderstandings but the deep knowledge of each other that only true and good friends develop.\\n\\n\r\nAnd they are good people that you wouldn't mind spending hours in a small room with. This is a slow gentle romance and you can watch each of the girls well and truly and believably fall in love with Koutaru, and his slow opening of his heart to each of them.\\n\\n\r\nWhile the animation and sound production values are good but not great (though its one of the few series that I don't skip OP and EDs when binging) the tragedy of this series is that it only has one season. The episodes cover the first 7 volumes out of 30+ and only just barely get through the setup of what is one of the sweetest and most unique harem romances ever written. \\n\r\n(Translation by J-novel Club)\\n\\n\r\nEven so. if ever I just want to feel good I watch this. From the unique premise, to the wonderful characters (no bland MC here), to the passion of competition over room 106, there is always something to bring a little joy to your day.",
            "date": "2018-12-01T13:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 295054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SteelBlaidd",
                "username": "SteelBlaidd"
            },
            "url": "https://myanimelist.net/reviews.php?id=295054"
        },
        {
            "content": "Nah man, nah. There are five girls who NEED this one room for their own personal reasons and it's just a harem of bullshit. At best it was a cute anime. There were battle scenes that took place just by coincidence and everyone's friendship came together to help the person in trouble every time.  At one point, an antagonist went to talk to a high-council type group to exact revenge on room 106 (or whatever it was) and we never heard from them again.  The story was rushed to get through all girls' storylines and it was just generally too much.",
            "date": "2015-03-20T10:11:00+00:00",
            "helpful_count": 9,
            "mal_id": 182848,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1975152.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/uxie22",
                "username": "uxie22"
            },
            "url": "https://myanimelist.net/reviews.php?id=182848"
        },
        {
            "content": "The best part of this show is the beginning. It's lighthearted, it's fun, the girls are cute, and the guy doesn't suck. Great. If it could have stayed like that for twelve episodes, I'd have an eight on my hands. Maybe I'm being generous, but you get it.\r\nHowever, as I watched, I go the feeling that 'Rokujouma no Shinryakusha!?' either didn't take itself seriously enough, or took itself way too seriously, but only sometimes.\r\nI had trouble figuring out what the show wanted to be besides a harem (which it wasn't even doing that well, to be honest. Felt more like the people around him happenedto be girls, rather than his harem).\\n\\n\r\nDid it want to be a drama? If so, there wasn't enough of it, and the presentation was crap. One of these women came from space to invade a bedroom and is literally light years from all of her friends and family save her servant/secretary/pilot/(?). Why did that not come up once? Why does the magical girl not use her magic to prove her magical girl-ness? Why are the earth people invading only from this one room in Japan? When you try to make a drama, you cannot get away with plot devices like you could in a comedy.\\n\\n\r\nDid it even want to be a comedy? Well, it shouldn't have been trying to be so dramatic. The comedic vibe is ruined whenever it tries. The sudden shift into darker themes coupled with the lack of showing and the overabundance of telling to an under-informed audience kills the comedic tone set up at the beginning of the anime.\\n\\n\r\nMaybe it wanted to be a romance? Lol, jk.\\n\\n\r\nI really wanted to like it, and I loved it up to episode three, but after episode four, the drama starts to kick in and whenever those scenes happen, it feels like I'm slogging through a badly written book. It's not it's the worst show ever, and it certainly has it's good parts (essentially all the times it's not trying to solicit unearned emotions from the audience). It could have been a very fun show, but 'Rokujouma no Shinryakusha!?' tried so hard to be more than just 'fun' that it shot itself in the foot. I never forced myself to watch the next episode, but I often found myself hoping it wouldn't be a plot episode, or that it'd wrap itself up quickly if it was.\\n\\n\r\nI can't outright recommend the show, but I can't honestly say that you should avoid it either. Can't even say to give this show the three episode test as the first three are the better episodes. This anime is quite enjoyable, considering what I've said about it, I'm just annoyed by inconsistent quality. I mean, if it was consistently bad, that'd be one thing, but it was only bad sometimes, and I really liked when it wasn't bad, so I'm conflicted.",
            "date": "2016-12-01T00:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 234686,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5531564.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Krynnymuffin",
                "username": "Krynnymuffin"
            },
            "url": "https://myanimelist.net/reviews.php?id=234686"
        },
        {
            "content": "Pls read the whole thing to see gd and bad points and overall rating by me thx! so hi guys it has been a veeeerrrry long time since i wrote an anime review. But the current animes ive watched so far especially this one has made me wanna write a 'hopefully no spoiler otherwise i have to take it down' anime review. So... abt this anime, this anime is well like some of u guys said, its a gem, a giant diamond hidden in the dust and gravel of mainstream animes and other 'harems with ecchi' animes. This really was a find indeed. so ifanyone were to be reading this comment or the comments arnd this anime or anything abt this anime, what are u waiting for? Just do it! watch it! the reason why its gd to me u may ask? Firstly,well, its a harem without ecchi, which is something hard to find these days i suppose. Secondly, the story is quite interesting (and amusing at some point too) cant really say which specific part is cause that would be spoilers. Thirdly,Its freaking entertaining! The awkward situations, the beach episode, the fun times they all had together despite their origins and 'interesting backgrounds' to the way Sanae possesses Koutaro to the part that Tulip gets worked up to the part Ruth gets worked up to the part... oops ive said too much. Well its a nice anime that is not too hard to watch for me. And Plus Koutaro is not too dense like Kirito or Ichika or other verrry dense characters! So thats what makes this anime even more great. However, to everything there are gd and bad points.the first bad point, in this anime, a harem is like an open door, where its too easy! true its anime, but for single forever alone teens like me i get soooooo jealous (maybe thats just to me idk lol)\\n\r\nSecond, i think the creators were trying to get Sanae closer to Koutaro by the way she posseses him? its a little on the 'trying too hard side' tbh. \\n\r\nThirdly,not allThe characters get to go on a date with koutaro! Now thats just sad! Anyways thats all for my review. Thx for reading (if u are reading till the end) \\n\r\nOverall rating 8.5/10\\n\r\nBtw am i the only one who ships Ruth with Koutaro?? Join me in shipping them together! hahahahahahah! Mustive got too amused with the episode where they almost... XD anyways guys have a great day and tell me if my review was gd kay? cause i wanna see if im rusty in typing non spoiler reviews! :)\\n\r\np.s this anime is TOO underrated i swear! This is gd stuff why is everyone is watching all the mainstream society stuff?? hahahaha\\n\r\np.p.s another disadvantage would be that this anime has too little episodes and its a one shot with no OVA or second season! This anime was so gd i finished within 2 days but not im starting to regret it cause theres not enough episodessssss arghhhhh! But it was fun and totally worth my time, take my word for it!",
            "date": "2016-06-16T08:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 220873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5276735.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Yato-God69",
                "username": "Yato-God69"
            },
            "url": "https://myanimelist.net/reviews.php?id=220873"
        },
        {
            "content": "Quick short review for you guys who enjoys Comedy genre, i highly suggest this anime. \r\nStory are quite good, though doesn't make sense. Each characters has it's own signature. \r\nAnd this anime is pretty \"family-friendly\", though there is some part that might not suitable to watch with your parents (beach scene, probably).\r\nThe only bad part on this anime is how he could get suddenly fell to the ground and then all of sudden, an appearing of a coin rotating and then met with Goddess Statue(?), and then he woke up realizing nothing.\r\n*i am Indonesian so my English is not really good, tehe",
            "date": "2019-01-03T06:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 297912,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6795149.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/r1vai",
                "username": "r1vai"
            },
            "url": "https://myanimelist.net/reviews.php?id=297912"
        },
        {
            "content": "Living alone is a dream for many students or freshman in college.  The idea of becoming independent and your own person in a place to call your own can make anyone feel good and more mature than before.  But what would happen if your nice and quiet, independent life becomes invaded by strange figures of supernatural lore?  Rokujouma no Shinryakusha!?, or Invaders of the Rokujouma.\r\nStory (6.99/10):  The story of Rokujouma follows the story of Satomi Koutarou over the course of his life in high school.  In order to not trouble his father as he travels overseas, Koutarou decided to staybehind in Japan and search for an apartment for himself to live in so that he may continue going to school in Japan.  As a result, he was able to find an apartment with a monthly rent of 5000 yen (which is about 46 American) and began living his high school life.  However, all is not well as he  is soon met by four strange girls who all want to have his apartment for themselves.  And, as the tenant of the apartment, he becomes reluctant to leave.  And thus, the comedy ensues.\\n\\n\r\nThe plot of this show is very simple and likable.  A plus for the series is the fact that the story follows a very easy to follow arc after arc setup, each arc spanning about two or so episodes each.  However, because the story follows this very strict formula, the anime feels very rigid and cut into block after block of story material without any sort of proper flow in between them.  In addition, because the story follows such a rigid setup for plot, each arc felt a bit rushed due to the amount of story that they had to get through in a span of about 40 or so minutes.  This resulted in some unfavorable pacing for the show that, while unpleasant, wasn't enough to make the show completely dissatisfactory in any way.\\n\\n\r\nNow, for the arcs for the show.  What I think was a decent plus for the show was the focus that they had, which was, while rushed, focus on the four \"invaders\" of the apartment.  As a result of this, we were able to get a good amount of character development in each of them, making them a bit more three dimensional than just generic \"harem\" girls, which turns out to be false, as essentially, none of these girls wants the guy's D.  However, because of the aforementioned rigid arc setup of this show, the girls didn't get a lot of character development, at least as not as much as I would've liked, and as characters as a whole, felt a bit incomplete.  \\n\\n\r\nAnd finally, I have to talk about the ending for this show.  I don't like it.  There are upsides and downsides as to how the series ended, but for me, this series ended in a way that felt a bit like a \"read the manga\" ending.  The show in addition to giving some focus as to who the main 4 female characters of this show are and why they want the apartment for themselves, hinted throughout the entirety of the show some sort of mystical or transcendence deity or idea, which was not only unexplained to all hell, but was sort of slapped on at the end in one scene that confused me so much.  Not to mention there's not really a complete resolution to the show as a whole, which, unless this gets a second season, leaves me to have to deduct points because of just how, as a fan, unsatisfactory it left me because it really is open-ended and frustrating because of what they are teasing at as to how much they have left to reveal in the plot.\\n\\n\r\nOverview:\\n\r\n+ Dedicated arcs for development\\n\r\n+/-  Rigid arc setup (Gives easy to follow plot, but rushed pacing)\\n\r\n-  \"Read the manga ending\"  (It seems like there are a lot of these kinds of endings lately.)\\n\\n\r\nCharacters (7.20/10): The cast for Rokujouma is fairly diverse, giving us characters of various points of importance that make for both some memorable characters, and characters that we just don't really care for.\\n\\n\r\nThe first up is our main protagonist/harem master/tenant, Satomi Koutarou.  As a high schooler displaying his independence, Koutarou can be explained as a defiant character who wishes to help out anyone in need, true to his own ideals, basic Harem protagonist stuff.  There are however some nice parts to him that make themselves very apparent and slightly different from the other harem protagonists in existence.  For one thing, he knits.  From the start of the series, (rather, at the start of the series as the idea is basically shelved away), Koutarou is shown to have a strong desire to learn to knit as he must complete a task that he set for himself for reasons that they don't really make clear.  The other is the fact that he has some sort of magical whatever that makes him OP as all hell.  While these things do make him a lot more interesting as a character, the ideas get shelved very early on, or get ex-machina'd and show up whenever the plot demands, making them seem a little pointless because of just how convenient the magical bullshit shows up.\\n\\n\r\nAnd then we have the real stars of the show, the four invaders.  Sanae, Theia, Kiriha, and Yurika.  These four are the main reason focus for this anime, and thus the whole reason for its existence.  With their roles as a ghost, alien, underground person (basically like a mole person, but human), and a magical girl, let's just say that they are rather...interesting characters.  Each of them has a very distinct personality with various quicks, as well as a reason for wanting the apartment in the first place, leading to them having to fight over the apartment for complete control over it.  As the series goes on, you start to learn more about who these girls are an there is development, as mentioned before, that makes the series a bit different when you watch a different show of a similar caliber.  While I didn't see as much development as there could potentially be for these girls, I'm happy that Silver Link put in the effort to try and exemplify the importance of these girls and not make them complete 2-D cutouts.  (Sanae best girl.)\\n\\n\r\nApart from the five main characters, we have additional side characters to the series, which are split into three main categories.  The first one belongs to and only to the character known as Sakurabo.  (She doesn't really feel like a main character.)  Sakurabo is the Senpai for Koutarou, as well as may or may not have feelings for him, but that's up for debate.  Sakurabo is a character that makes me feel conflicted, as she is shown to have a good deal of plot significance (more towards the end), but is shown to be more of a side character that shows up from time to time, or makes trouble for our main protagonist.  Personally, I like her character, but the way that she was handled didn't give me a satisfactory result as to the potential that she could've had.  \\n\\n\r\nThe other two side character groups consist of the constant character, characters that are present throughout the series like Makkenji, the landlady, the dolls Karama and Koroma, and Ruth, and the arc specific characters.  As for the constant characters, while lacking in some screen time and development, these characters were more prominent in the series and more or less helped with moving the plot along.  For the most part, these characters were actually fairly decent and some were rather underused, which I felt is a flaw in the series, as some of the characters weren't used to the full potential that they could've been.  As for the arc specific characters, they don't really serve much purpose beyond moving the plot along.  They're not bad, as they give the main four girls incentive and help establish what their reason for wanting the apartment in the first place, but after that specific girl's arc is over, the arc specific characters disappear completely. \\n\\n\r\nOverall, i felt as though the cast for the show was decent and memorable enough to leave a positive impression for the cast.  While a good chunk of them were very underused and certain character aspects were left open-ended, the cast overall was fairly good and fitted well with the overall feel of the show.\\n\\n\r\nOverview:\\n\r\n+  The Harem girls.  (Sanae still best girl.)\\n\r\n+/-  Somewhat generic Harem protagonist\\n\r\n-  Underused potential with most of the cast\\n\\n\r\nArt and Sound (7.81/10 and 7.87/10):  As for overall appearance, the show was produced by Silver Link, and actually looks rather nice.  (Silver Link does some good work)  The overall look of the show is slightly moe with the appearance of the girls, but the detail of the characters looks very nice and nothing stood out as very jarring looking.  In addition, the show also sports some comedic scenes where they change the look of the character to exemplify certain emotions (normal comedy anime stuff) giving a nice bit of tone change for a brief moment.  (This is usually used with Yurika due to just how pathetic of a character she is.)  The artwork isn't bad by any means, but it does look pretty standard with what production studies are making these days.\\n\\n\r\nThere was one thing in the series in terms of artwork that seemed a bit odd to me, and that is the side ahoges.  Regardless of who the girl is, every girl in this series has a stupid bit of hair sticking up from the side of their head.  It just looks odd as it's just so blatantly there and for a long time, I was confused as to why that was even in the character design in the first place.  \\n\\n\r\nAs for the soundtrack, Rokujouma sports what I would call one of the more enjoyable OP's this season for a good amount of reasons.  #1, it's catchy.  The song, while slightly generic, is very catchy.  It's a nice upbeat song that can boosts spirits rather easily.  What really stood out in terms of significance for the song, is the fact that the four voice actresses who do the voices for the four girls sing the song.  Basically, you have the harem girls sing the song which for me showed me just how devoted this show was to idolizing the main female protagonists, which is a nice plus.  The ending for this show sports a more mysterious and mystical feel for its tune.  While I do feel like it deserves a listen and attention to, (as I do feel it is a good song as well), to me, it doesn't stack in comparison to its opening counterpart.  (funny how they sing about milk tea though.)  \\n\\n\r\nAnd finally, because I have been praising this show so much for how much emphasis they put on their harem girls, I have to praise the performance of Oomori Nichika as the voice of Yurika specifically.  The reason being is because she nails the character EXTREMELY well due to just how pathetic she is able to make Yurika sound in any given conversation.  (This just stood out to me because of just how Yurika sounds when talking.)\\n\\n\r\nOverview:\\n\r\n+  Good art (albeit weird with the multitude of side ahoges)\\n\r\n+  Catchy songs\\n\\n\r\nPersonal Enjoyment (8.33/10):  When it comes to anime, fluff is the best way to describe this show.  The kind of \"filler\" show that gives you a way to waste your time while also giving you something that is rather interesting and enjoyable.  When I first heard about this show, I was quite intrigued by just how seemingly random the story idea and the characters were.  (Not to mention I watch harems as much as I breathe air, so this was an instant to-watch.)  As I watched the series, I did feel that sense of nonsensical and somewhat random plot development that fluff shows normally had, which in some sense, did work well for this show.  I did enjoy this show a lot, I will admit.  What I didn't like however was how it ended because honestly, ending a show in a manner where you don't completely finish a story is complete and utter bull.  Let's get to the three questions, shall we?\\n\\n\r\nDid I like this show?\\n\\n\r\nYes, I did.  There were a lot of good aspects to it from an entertainment standpoint which holds well for what this show was really supposed to be, entertainment.  The plot was mostly focused on the four main girls of the series, which I find to be different and exciting due to how little other harem shows focus on the girls in their series regardless of how core they are to the show in general.  \\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nAside from the bullshit ending and rigid plot structure, I also didn't like how Sanae (the ghost girl) was handled in the series.  For one thing, she's a ghost, therefore she should not be seen or even remotely materialized in any way shape or form.  And another thing is in the first episode where the landlady character just completely accepts the fact that these four girls with seemingly made-up titles are just completely accepted.  Like \"You're an alien?  Oh, that's cool.\"  Like, there's not even any sense of wavering over the idea.  I can understand that it's an anime, but even in anime, there has to be at least some degree of disbelief.  (Maybe I'm over-thinking it\\n\\n\r\nAnd finally, would I recommend this show?\\n\\n\r\nIf you want to watch something that doesn't require you to think hard, then this would be a good pick for you.  Rokujouma is a very peculiar harem show as the girls for the most part don't actually fall in love with the guy, and contrary to possibly 90% of the other harems out there, doesn't really have fanservice.  (Well, aside from Kiriha's perks) Rokujouma is really one of those turn off your brain shows and can actually be a rather fun watch as the show never really takes itself too seriously and the characters are rather likable.  (Plus the beetle gag is pretty funny.)\\n\\n\r\nOverall Score: (7.30/10)",
            "date": "2014-10-03T23:45:00+00:00",
            "helpful_count": 6,
            "mal_id": 163505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=163505"
        },
        {
            "content": "This show starts out really strong. The premise is interesting and really engaging. I like that the harem isn’t the sole driving force of the show. There is a plot and the harem theme ties into it seamlessly. The animation is pretty good and the voice acting is ok. Best of all, it has intrigue and originality. \r\nWhat really turned me off of this show was what happens to the plot. Around the middle it slows violently and becomes almost tedious. The main plot established at the beginning is nearly dropped and replaced by character development. While character development is important but it becomes fillerwhen it doesn’t follow the story. Clearly the producers were shooting for a second season. It seems that they forgot that there must be a first season for there to be a second. The ending is forced to crowbar in reminders of what happened in the beginning and it only serves to remind you of how little the plot has progressed. I am hoping for a second season but mostly to answer the questions that were raised in the beginning.\\n\\n\r\nIt is by no means a bad show. Instead I think it was a good idea that was poorly executed. It is definitely worth a shot.",
            "date": "2016-02-23T23:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 211580,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MadHatter90",
                "username": "MadHatter90"
            },
            "url": "https://myanimelist.net/reviews.php?id=211580"
        },
        {
            "content": "Rokujouma no Shinraykusha!? is not any ordinary harem anime I've seen. For the first time, there wasn't a single character that I would find annoying, and well, you'll get some laughs with this anime. There are times that you would not get the storyline, and I didn't get the ending that much but every episode, you'll get to see why the anime is turning into a harem-type anime. \r\nThe characters are the standouts of the anime. You have your main character, Koutaro, who bought a cheap apartment then meets girls who are trying to get the apartment for their own needs. The girls are supernatural:a ghost, a magician, a descendant of the earth people, and aliens. Well, you don't normally see those kind of characters mixed in a kind of harem anime, but it clicked.\\n\\n\r\nArt is pretty nice. I just don't get it why they need to cover the eyes and nose of the side characters. It's pretty disturbing for me. But, then again, since they need to focus on the main c's, who cares about that thing then. Storyline, you get to see a glimpse of the girls of the story, so that's pretty good. But, 12 episodes isn't enough in this anime, there are a lot of parts that I need to know. So hopefully, we get to see this in the next season if there would be. (That cliffhanger in the ending though.)\\n\\n\r\nI enjoyed the series, pretty good harem anime, VAs are pretty good, and well, improvement will be seen on the next season. If you haven't watch this series, you probably should. Get some laughs if you want to.",
            "date": "2015-06-12T19:29:00+00:00",
            "helpful_count": 6,
            "mal_id": 190193,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635020.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SeiIsFab",
                "username": "SeiIsFab"
            },
            "url": "https://myanimelist.net/reviews.php?id=190193"
        },
        {
            "content": "At first, I thought I saw a season 2 of Ryuugajou Nanana no Maizoukin as the synopsis is almost identical. And I thought it would be a same plot as Nanana. Turn out it's wrong. Rokujouma no Shinryakusha!? is a really great romcom series. Unlike most romcom series I know, Rokujouma is not your usual romcom. Usual romcom made the girls somehow have to cling to the MC to shows her characters. But Rokujouma isn't like that. I had only found this unlikely romcom pattern only in Haganai.\r\nRokujouma started with your usual romcom start. It doesn't start really good for me. But as the storywent, it come really great. Each of the harem has their own 'route'. Each of the route really came really great: a good pace with the plot, how each the problem solved in every episode satisfied me, and how I wonder how the story would turn out, everything is made well. I can't complain about it.\\n\\n\r\nThe art is really good, not any lazy drawing there. There are some 3DCG there and it isn't unnatural to see the animation. The character design is one of the selling point in this series. The variation of character design is really amusing. I can't complain in this part too.\\n\\n\r\nThe OP and ED is your stereotypical OP and ED for a romcom series, a cheerful song as the OP and a good ending song. Too bad it's just good, not great or the best. The BGM is quite good, it matched with the story mood.\\n\\n\r\nThe character is another great point in this series. You have the cheerful ghost, tsundere alien princess, a good-manner and well-endowed princess, and the clumsy but helpful magic girl. It might filled all of the fetish you have. The heroines is really a set of romcom heroine you might find. But, it's still amusing to see them. The main character is really good, he really deserved to be harem king with all of the harem king traits. But, what the best is actually the side characters. The senpai, the landlady, even the alien assistant is really amusing characters. I feel like they all invade my heart here. lol\\n\\n\r\nI really enjoy this series, every part of this series is really lovely. There are flaw, I knew it, but it didn't ruin the experience. There are several times I came as happy as the characters there. It's great experience to watch this series.\\n\\n\r\nAs this series came to the end, I really wish there are another season for this series. It's not your everyday romcom and with every aspect is well made. I really recommend this series to you who wants a refreshing romcom with a good character, great story, and wants to enjoy every aspect of it.\\n\\n\r\nThanks for reading my review.",
            "date": "2014-10-09T22:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 164257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452111.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/xgunawan",
                "username": "xgunawan"
            },
            "url": "https://myanimelist.net/reviews.php?id=164257"
        },
        {
            "content": "This anime is amusing enough, with great deposits of potential. It puts a skinflint student into a run down apartment with cheap rent. Then their appearance make many characters you see only in hardcore shonen animes,  Ghost, Magical Girl, a princess of Ancient Cilivisation of Aliens, an Invasion Commander of the Underground Dwellers and so on, so the story is practically overflowing with gag material.\r\nSadly, execution of the story is poor at best, beginning as comedy  with good foundations, then taking a turn to shonen crap story, where all the main characters unite under the flags of friendship and hard work and completelyruin the bad guys as well as the storyline.\\n\r\nPersonally, my boiling point was when the skinflint student MC was changed into Blue Knight of bullshit yore MC.\\n\r\nAll in all, DO NOT BELIEVE the comedy genre tag, this anime has as much comedy as Bleach, and it's on a similiar level. This anime is a live specimen how to ruin a good comedy with shonen, so if you're alright with being disappointed with character development of characters you feel you could grow on, this anime might be for you. You might need some help, too. Seriously, what's wrong with you?",
            "date": "2016-04-26T06:04:00+00:00",
            "helpful_count": 5,
            "mal_id": 217209,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1472429.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/XanWasting",
                "username": "XanWasting"
            },
            "url": "https://myanimelist.net/reviews.php?id=217209"
        },
        {
            "content": "[Spoiler Free Review!]\r\nIn other reviews, people seem to be branding this anime as \"underrated\". However, I just can't see it myself. I'm always reluctant to disagree with the masses, since it makes me question whether or not my opinion is valid (like, have I missed something?), but if I had to sum up this anime in one word, it would be: \"Average\". \r\nStory: 7\r\nRokujouma no Shinryakusha is a twelve episode, comedy, romance, harem. Although, it doesn't feel that way. Those tags are quite misleading in the sense that there isn't all that much romance in this anime. There are some crushes and a bit offlirting every other episode, but there really isn't any substantial romance. Instead, the anime focuses on episodic short stories revolving around the array of vibrant characters. One of its strongest aspects is the comedy. Whilst it's not exactly side-splitting, you get a couple of giggles here and there. The episodic stories are surprisingly fun. I quite often found myself drawn in by the one-episode plot twists. However, it almost feels *too* episodic. Very little relates most episodes to one another, so it feels very segmented, meaning you're not really drawn into the next episode. In addition, if you focus on the actual content of the stories themselves, none of it really seems to make much sense or follow any rules. \\n\\n\r\nArt: 6\\n\\n\r\nThe art and animation is decent. The character designs are unique from one another, though there aren't any that stand out when being compared to other anime. The overall art style isn't unique either and is sometimes inconsistent. The characters and spells are extremely vivid and bright, whereas most backgrounds seemed dull and bland. This created an odd contrast which didn't really work out. In terms of how it's drawn, it's very typical. However, there's a reason typical things are typical and that's because they work. There isn't really anything to dislike about the art but, at the same time, there's nothing that stands out.\\n\\n\r\nSound: 6\\n\\n\r\nSimilar to the art in Rokujouma no Shinryakusha, the sound is decent. The opening is pretty catchy and so is the ending. However, they don't sound unique at all and can be somewhat annoying sometimes with how babyish the singer's voice sounds. The background music isn't exactly film-score quality, either. It just sounds like typical slice-of-life jingles.\\n\\n\r\nCharacters: 7\\n\\n\r\nInitially, I saw the vast number of characters as a negative aspect. In the first episode, the anime introduces far too many characters that are so drastically different. I found myself saying \"oh c'mon, you can't be serious\" when they introduced a ghost girl, a magical girl, an underground girl and an alien girl within the space of about five minutes. Seems ridiculous, right? Anyway, I sucked it up and tried to look beyond the such blatant disregard for realism. Thankfully, over the course of the anime, you'll find yourself growing more and more fond of the likable characters and their cute mannerisms. Although it does bother me that there's one male character and about eight girl ones. I just can't relate to it because of how unrepresentative and unrealistic that degree of harem is. Overall, solid characters and, whilst not particularly unique, they are the show's strength.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nI didn't enjoy this anime as greatly as I have others, but it's decent if you're looking for something chill to pass the time. \\n\\n\r\nOverall: 6 \\n\\n\r\nChaotic, random story-lines just don't really shout \"quality\" and, to me, it's almost lazy writing. Although, Rokujouma no Shinryakusha has it's strong points. I'd recommend it if you're really into slice-of-lifes or harems. But be warned: there are anime that are much better within these genres. If you're looking for something thrilling, captivating and romantic then your best bet is to look elsewhere.",
            "date": "2015-06-26T17:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 191364,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4640167.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Blue_Miku",
                "username": "Blue_Miku"
            },
            "url": "https://myanimelist.net/reviews.php?id=191364"
        },
        {
            "content": "I gave this one a try because I had nothing else to watch.\r\nIts a very cute anime. \r\nIts a harem, ecchi genre but has a very unique and quite a chaotic plot. \r\nA guy moves into an room that he finds really cheap and wants to keep it. Suddenly he is found fighting with 4 girls for his room, each that wants the room for their own insane reasons. You have a ghost, an underground girl, an alien (+ her assistant) and a \"magical\" girl. After getting their shit kicked out by causing a ruckus and demolishing the room by the guy's landlord -- shetells everyone to sign a testament that they will resolve their quarrel without fighting. And thus they end up playing different games to get points and the one with the highest points gets the room.\\n\\n\r\nI laughed my ass off. The \"magical\" girl is sooooo funny. Her voice is the best. The others are good as well. For some reason I really like the opening theme. Although the guy's character is kind of the same as in every harem anime, the plot itself pulls this anime out of the quicksand.\\n\\n\r\nI recommend it highly. \\n\r\nJust don't expect lot of ecchi, its not that kind of anime.",
            "date": "2015-03-09T17:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 182069,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=182069"
        }
    ],
    [
        {
            "content": "What would you do if, all of a sudden, random people entered your house and caused an unimaginable amount of mess? Well, that's what this anime is about as not only does it show us the situation, it also presents its aftermath.\r\nMost people would think that this is a harem manga right off the bat because of the cover. That's what I thought too until I started watching it. Harem anime is usually intertwined with ecchi, claiming that all harem anime is ecchi. Well, this show refuted that idea. Just because it's a harem, it doesn't mean there should be fanservice. If it weren't forthis show, I would've forgotten that fact.\\n\\n\r\nThe characters were memorable, and I don't say that to all anime. Perhaps what made them memorable was the fact that they had their own tag. Unlike most harem characters, however, their tag is not defined by their personalities. Rather, it's defined by their identity. One can simply forget a tsundere girl or an ojou-sama heroine, but I bet you won't forget a loli ghost or a magical girl or a flat-chested alien or a big-breasted underground lady. It's these tags that made them stand out, making them different from your typical harem characters.\\n\\n\r\nDid I enjoy myself? Definitely! The show was funny, cute and hart-warming. It just goes to show that you don't need fanservice to make a good harem anime. All you need are invaders that'll claim your interest 'till the very end!",
            "date": "2016-07-30T03:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 225406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=225406"
        },
        {
            "content": "Four strange figures and four grounds as well as strange. Direct composing an awkward situation since the first episode, this anime without delay to build up comedy. This causes the instantaneous no curiosity arising against later episodes: if the first course was so funny, what about the other eleven episode? And even then it would not be the most creative comedy because it is still too dependent on slapsticks, he was still able to meet the expectations to make the audience laugh thanks to the crazy whims of the characters are always unpredictable. Unfortunately, after about a third of the first part, this anime isas if suddenly forgot that the strangeness of these figures is the biggest advantage he has - the main raw material of comedy. He began giving the girl characters nuanced stories more seriously, complete with their sworn enemies, who eventually remove all the playful on their background. Theiamillis reasons for control room 106 as a test before the throne turns out is a noble mission for the sake of his family name, the reason Kiriha who want to make the room 106 as a base invasion turned out to be a secret tactic to avoid major disasters, and so on.",
            "date": "2017-04-11T13:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 245273,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=245273"
        },
        {
            "content": "Honest review for \"Rokujouma no Shinryakusha!?\"\r\nI came into this show purely based on what I thought would be an interesting story line with some good laughs and interesting characters. I was happy with the first couple of episodes because it seemed to be living up to what i expected but not at its maximum height. Obviously with most anime the build up and development just makes the overall story better but this show honestly just dropped and dropped the further it went on. \r\nLet me explain. The super simplified version of the show and what it was supposed to be was a hand full ofcharacters fighting over a certain pieces of property for their own personal gain. The protagonist gets stuck in the middle of the ordeal and creates and point system that will help determine who gets to have the land. Going in under that assessment you think it will be hitting you with and laugh and maybe slight character improvements later on. Nope. The first couple of episodes pull it off but then suddenly the show decides to give every girl their own two episode back story that ultimately has zero purpose at all and then skips on to the next girl. All in all the property they fight for is slightly mentioned in some way and reiterates as to why they need it, though at that point when they lose the plot you simply just won't care. \\n\\n\r\nI write this honest review to you because most of the reviews this show receives is based off of a fans die heart opinion and seems to just give the wrong message to those who go in blind. Sure the characters were creative and the show had promise but in the end its a completely different show and you'll be wondering why you started watching it to begin with. \\n\\n\r\nMy score may be higher then what my review gives the impression of what it really should be but I did like the art style and i cared for one or two characters. I had a hard time finishing it in the end but i still did watch. its almost a 3. \\n\\n",
            "date": "2016-07-04T15:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 223138,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1109959.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/foeapple",
                "username": "foeapple"
            },
            "url": "https://myanimelist.net/reviews.php?id=223138"
        },
        {
            "content": "Hi!\r\nIn this review this is just such a good anime.When you look at this you might think from looking at the cover.\"Ugh this is just another Harem anime\"not really.In order for me to call an anime a harem the character must be ENGULFED with girls embarrassed and loves the main character so very much.\r\nThe story is very good,all the girls want a tiny room (Room 106) (ONLY 5,000 YEN)(Lol) they all chase and persuade him to get the room for their purposes.\r\nThe art is amazing with my favorite character (Theia!)\r\nThe sound was pretty good when they almost got attacked by something so (No Spoilers!)\r\nThe characterswere amazing,One Ailen Tsundre,A ghost,One underground person,A \"Cosplayer\",and finally one manager who owns the building and gets ticked off if the building is damaged.\\n\r\nI enjoyed this so much I would re watch this anytime forever.\\n\r\n                                                 Thanks for reading my review!",
            "date": "2016-06-08T16:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 220301,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5463554.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mashiro-Shiina-8",
                "username": "Mashiro-Shiina-8"
            },
            "url": "https://myanimelist.net/reviews.php?id=220301"
        },
        {
            "content": "Spoiler free! (also this is my first review so give me a chance :3)\r\nStory:7/10\r\nThe story is good and entertaining tho there were moments when the story got a little boring for me but thats just my own opinion\r\nArt:8/10\r\nNow the art was very good very colorful very sharp and clean\r\nSound:9/10 \r\nThe sound was great the opening was catchy and the OST always was very appealing \r\nCharacter:5/10 \r\nThis is were the anime suffers in my opinion. now each character got there own arch in the series lasting between 2-3 episodes each.some of the characters should have gotten WAY more background such as Kiriha, Theia and Sanae\r\nEnjoyment:6/10\r\nThis animewas entertaining and funny at times tho pass episode 5 for me the anime gets somewhat boring but its still entertaining enough to watch still a good watch if your bored \\n\\n\r\nOverall:7/10\\n\r\nnow overall this anime was good and i recommend to watch it tho i see many people watching this when there bored or are in a drought of anime and have nothing to watch still a really good watch.\\n",
            "date": "2016-02-07T16:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 210379,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4472009.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Salmo69",
                "username": "Salmo69"
            },
            "url": "https://myanimelist.net/reviews.php?id=210379"
        },
        {
            "content": "I will have to say the series really have disappointed me.\r\nIt had potential, but never really developed any of them. Many elements were used in this anime, but it seems to be just there for making the series broader and cover a bigger range but no depth.\r\nSpoiler Free, general overview:\r\nYes, this is a comedy. Yes, there might be some parody component, BUT,\r\nthat doesn't mean the story and character development can be ignored.\r\nThe concept is somewhat interesting, but the way the story develops ruined it.\r\nthe good parts first:\r\nFor the art and sound of this anime, it is if not better, at least the average: characters arecute, background is beautiful, the musics are nice.\\n\\n\r\nNow the others:\\n\r\n\"protagonist meets girls\", basically the entire story summarizes in those 3 words. Is there anywhere that is funny? NO. Exciting? NO. When there are interesting stories that happen, it is either quickly skipped over or used poorly to TRY and conceive some comedic elements which failed.\\n\\n\r\nBiggest issues: poorly developed characters, illogical story progression, idiotic character behaviors\\n\\n\r\n(Spoilers)\\n\r\nI will list 3 examples:\\n\\n\r\n1. No matter what happens, the protagonist who is supposedly a normal human being goes to protect the female characters. There is nothing wrong with this, but there is no where that describes if the protagonist puts himself in danger in doing that, or if the female character is in danger. There is also no where that shows whether or not the protagonist thinks about a strategy or puts the surrounding into consideration when the fight starts. So under normal circumstances, I will have to conclude the protagonist is an idiot.\\n\\n\r\n2. Female characters all love the protagonists. Also nothing wrong with this, except when no reason at all is described. One of the biggest example being Ruth(Lucy), where one night, the protagonist hugged her in his sleep, and, SURPRISE, she likes him! WHAT?! and what did the protagonist ever do? NOTHING.\\n\\n\r\n3. Apparently the entire setting is up to the audience to make up in order for things to make sense:\\n\r\nfor example, in episode 8, suddenly Harumi, who is supposed to be a normal girl suddenly summons a sword, and says \"This is your sword\", guess what the protagonist says?\\n\r\n\"wakarimashita\"  \"I understand\"\\n\r\nwait, what did you understand, please do tell me!!! Because I am so confused D:\\n\r\nIf one day, I see a fight break out, a friend of mine summoned a sword, and tells me it's mine, the last thing I say will be \"I understand\"...\\n\\n\r\nI will go and check out the light novel later, but I am assuming the anime skipped many details in order to fit the story into 12 episodes. I guess the anime at least succeeded in promoting the LN.",
            "date": "2015-11-28T05:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 204328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1543079.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/lcd",
                "username": "lcd"
            },
            "url": "https://myanimelist.net/reviews.php?id=204328"
        },
        {
            "content": "Sin duda es un muy buen anime cuando sabes apreciar qué es lo que lo hace especial, y sin entrar en muchos detalles la clave es sencilla: no lo veas como un anime intentando ser diferente, si no como un anime que trata de mostrarte lo que todos los demás animes del género hacen: los clichés son totalmente a propósito.\r\nLa historia en general carece de sentido, pero esto lo hace mejor ya que aprovecha todas las situaciones ilógicas para hacer reír al espectador.\r\nSupongo que el manga continua más allá de lo que vemos en el anime ya que ciertas escenas hacen pensar que la historiano acaba en el capitulo 12. \\n\\n\r\nLo recomiendo mucho si lo que se busca es una comedia harem agradable y que no cae en demasiado fanservice.",
            "date": "2018-10-15T08:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 291804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7485644.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Pache-kun",
                "username": "Pache-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=291804"
        },
        {
            "content": "Anime never ceases to astound me. To think how many anime showed promise in its first few episodes only to break down completely in the middle. \r\nUnfortunately, Rokujouma is one of them.\r\nInitially, this is just your normal haremish anime which just uses the grand old concept of girls moving suddenly into your room, with a good comic setting. Nothing wrong with that. And they play games in order to decide the room allotments. Nothing wrong with that. But when they suddenly change the narrative from playing games to something else, like I don't know, supernatural interference, then you suddenly contort the characters in such away that you don't know them anymore. That's when it goes to shit.\\n\\n\r\nTo start with, the initial few episodes were laudable and funny in their own way. Everything looked like we will experience a slice of life with nothing to worry about. Then suddenly one of the girls starts to develop a problem with the hero during a beach episode. Then another girl develops a problem, then another. The cycle continues. And it all ends in the same way: The so called normal hero suddenly being able to absorb infinite energies that he shouldn't have been able to, along with the all the other girls just teaming up and destroying the enemy. EVERY TIME. What is this? The gender-swapped Avengers?????\\n\\n\r\nAt  one point, this grows really annoying, so much that at a time when one of the girls has to face her enemy fair and square, when the suspense is built up fairly, and when the interesting element comes within, the hero just rushes in to save her and determines by some writ law, that they will all gang up on the enemy and destroy her, even when the enemy was actually the one who arranged a magically isolated location so that no one else would get hurt and she would get to test her skills well. And said hero doesn't even trust the girl's claims at all, just because of a selfish desire to preserve his inferiority complex.\\n\\n\r\nI am getting ahead of myself in this part, but long story short, don't watch this anime if you think that you liked the first few episodes. Cause then you will definitely hate the last few. This is that kind of anime.",
            "date": "2018-09-12T10:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 288842,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6567160.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/JeremiahOrange",
                "username": "JeremiahOrange"
            },
            "url": "https://myanimelist.net/reviews.php?id=288842"
        },
        {
            "content": "If you are looking to know whether you should watch this show or not, here is a couple of things you should know.\r\nThe whole \"friendship\" and \"protecting friends\" is very present in this show, so if you don't like it, you probably are better off watching something else.\r\nThe world in which this story is written is a mess. I heard the novel is a lot better in this regard, but this is the anime review. I still have the question as to why there are aliens, underground humans, ghosts and magical girls in this story, and what is the connection between them (if there iseven one). I would not be complaining if there were plans for a second season, given that they would have the chance of explaining something, but it's been 4 years since the release of this.\\n\\n\r\nLastly, Harem show. If you don't like that, this is not your show.\\n\\n\r\nNow, the review. Some spoilers ahead.\\n\\n\r\nMan, is this a mess. I mean, I liked it but damn. I wished it was less of confusing cliché fest. I know they kind of foreshadowed Koutarou's secret whatever power at the beggining, but is still felt like it came out of nowhere.\\n\\n\r\nI liked all of the characters, even if some of them have a personality as deep as a puddle.\\n\r\nMC is still kind of your typical Harem MC but less of an astronomical idiot.\\n\r\nKiriha's backstory was a bit unpolished, but I like her calm and colected attitude.\\n\r\nTheia would be one of may favorite characters if she was just slightly less annoying. Miss princess is nice but should really get off her white horse in her marble palace.\\n\r\nRuth is a character that really ticks me off. I liked her until they started the whole bettle thing. Like, really. There are a trillion better ways to add more to a character than that.\\n\r\nYurika is way to much of a cliché character for me to really like her, but she has her moments.\\n\r\nSanae feels like the typical childhood friend character without being one. Well, she is still really cute and likable so I don't have that much of problem with her.\\n\r\nShizuka, more known by the name Landlord (really?), was awfully created. If you want to make her into the calm and collected until she gets pissed off and goes super sayan character, you need to do it better. She lacked hte impact that those characters tend to make. It felt half-assed Also, I know her super human strengh is supposed to be a gag, but if you are going to have her participate in a fight, give a proper explanation for it. One thing is having her be super strong for the sake of a gag. Another is having that gag strengh be part of a fight. It just doesn't work.\\n\r\nMakkenji is a place holder character that annoys me a lot. Not because of the character itself, but how the story treats him. He ends being a pure plot tool that only appears when convinient. They didn't develop him and, honestly, I'm not sure I even wanted them to, since, instead of the cool and hilarious friend they hinted at him being, they would probably turn him into \"that pervert friend of the MC\", which is even worse.\\n\r\nFinally, best girl, also known as Harumi. I love her character, although I may be slightly biased. Shy and introverted, but with a pure heart.\\n\\n\r\nI had fun watching this show even if sometimes I felt like hitting my ahead against the wall in some situations. It probably doesn't deserve this, but I'm stilll giving this show an 8/10.",
            "date": "2018-09-05T11:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 288178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6727186.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nyord7",
                "username": "Nyord7"
            },
            "url": "https://myanimelist.net/reviews.php?id=288178"
        },
        {
            "content": "After reading a few of the reviews I find myself not being able to relate to any of the positive reviews. So here's my opinion of the anime and I'm gonna make it short.\r\n*spoiler FREE\r\nFirstly for the story. It was going well right up until they introduce the other characters, like Kiriha and Fortorthe. All the other character introductions were so forced and lazy and they couldn't care less to give them a more elaborate backstory. All the scenes to create tension are so half assed that when a resolution scene or forgiving scene comes, it feels disingenuous and without merit.\r\nCharacters are again, lazily developedand so on, with some exceptions. The development of the characters are so off that whenever they do something different from usual it feels like they've done a 180 in mere minutes. \\n\\n\r\nThanks for reading my rant. I hope you'll find this useful.\\n",
            "date": "2018-11-30T18:59:00+00:00",
            "helpful_count": 0,
            "mal_id": 295006,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/zarosen",
                "username": "zarosen"
            },
            "url": "https://myanimelist.net/reviews.php?id=295006"
        }
    ]
]