[
    [
        {
            "content": "The concept of flags seems interesting right? Death flags, friendship flags, even a romance flag to top it all off. The low score this anime has is something I strongly disagree with. I think people are reading the synopsis and jumping the gun when they read about the concept. This is NOT an Action/Adventure whatsoever. This is a Comedy/Harem anime!\r\nWith that in mind this anime has a concept that is unique and did a good job showing it for the genre that this anime is under. It made some really good comedy and actually has some serious parts in it.\r\nThis anime has sprung a lotof good points, but still has some bad qualities that may annoy people. The story is a concept that is new and did a great job showing and did a good job with the building of plot and story line to make a wonderful comedy. The art is something that I loved about the show and enjoyed greatly. The characters along with the background are all bright colors that fit the comedy mood of the show greatly. The characters are the best part of this anime and wouldn't be nearly as good without them. The openings and endings are super catchy and always made me want to listen more to it and just plain out enjoyed them. I'd recommend this to anyone who is looking for a slice-of-life/harem to watch, not just looking for a cool show with the concept of flags.\\n\\n\r\nWhere do I begin with this?\\n\r\nYou get a boy named Souta, and he has the ability to see flags over people's head to see their true intention. It's a concept that hasn't been touched from what i've seen and it was perfectly fine for the genre that this anime is under. Along the way he gains friends and tries to find out the truth about why he has the flags and how to get rid of them.\\n\\n\r\nThe back story for Souta is actually very interesting and made the series even better knowing it isn't just all upbeat and happy-go-lucky. The characters also have some sort of connection with him rather than all of them just being some random strangers he meets along the way (though some of them are).\\n\\n\r\nThe underlying plot that this anime has is a good lead that makes way for the plot that is actually stirring and building through out the entire anime. The ending was something I honestly didn't expect to happen and really made me think of how it did a wonderful job building up to it.\\n\\n\r\nThe art for this anime is possibly one of the best i've seen for the spring season to come this year. The art is very colorful and support the mood for the anime gives of beautifully. The art is super clean and even the background and details in the surroundings that the characters go through are all neatly drawn.\\n\\n\r\nThe characters are all drawn beautifully and have qualities that are unique to themselves. Each character didn't have a generic hairstyle that you see are common in all anime and are unique and have a wonderful color scheme to support each one. \\n\\n\r\nThe sound for this anime was very upbeat and helped support the aura that the anime gives off. The opening was upbeat and pretty catchy and made me want to listen to it every time an episode was released. The background music was wonderful and fit the mood of the situations they got themselves into perfectly which was a nice touch since the anime did have a serious side to it. \\n\\n\r\nThe voice actors were all wonderfully chosen and portrayed each character well. They all fit the emotion and really brought out the life of each character and made the anime a lot more enjoyable.\\n\\n\r\nThe characters can be a hit or miss depending on the person. I personally enjoyed them all and made the anime even better to watch. The genre of the anime is harem so there will many types of personalities clashing and making the anime seem a little less appealing.\\n\\n\r\nThe anime starts off with Souta and introducing Nanami and the pace picks up from there. A bunch of new characters are thrown in and at first it may seem bland and dull, but as the series progress you learn a bit more about everyone and make them all seem unique rather than just added to become a harem.\\n\\n\r\nYou get a big diverse group of girls. You get a childhood friend that is just reunited with him, a robot girl, a rich girl, and a boy who is VERY feminine. To top all of that you get a princess, 13th in line to be exact. All of that may seem like a horrible combination, but the interactions they all have with each other makes the anime a really good comedy and brings out the feeling the anime is trying to give off perfectly.\\n\\n\r\nIf there's things I had to complain about the characters it would be towards the ending. I'm not going to spoil anything, but it was honestly confusing until you really think about the events that happened and connect the pieces like a puzzle. While i'm at it, the ending was full of cliche moments that I literally just laughed at them the entire time, it was really predictable about what each character would say and the events that happen.\\n\\n\r\nI really enjoyed this and was really hesitant to start this up since it was getting such horrible feedback, but i'm glad I gave it a try. The characters were some of the funniest i've seen and made the series a lot more enjoyable as a whole. Not one aspect of this failed for the genre this is under, keep in mind this is NOT an action/adventure. If you're looking for something to watch with a unique concept this is definitely it!",
            "date": "2014-10-13T01:14:00+00:00",
            "helpful_count": 112,
            "mal_id": 164643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3667805.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jarrbearr",
                "username": "Jarrbearr"
            },
            "url": "https://myanimelist.net/reviews.php?id=164643"
        },
        {
            "content": "What an ending. \r\nFlag Matrix: Harem Edition. \r\nAlso known as \"If Her Flag Breaks\".\r\nI honestly feel as though they should have done something different with this show. I'm glad they tried something new, but it was way too obnoxious for me to appreciate it, at all. \r\nThey should have stayed away from being a harem in general. The plot was intriguing and had a lot of potential, so why fill it up with annoying and cliche harem devices? The harem was way too big, too. Around 12 or 13 girls. Seriously? Come on, man. \r\nIf this show was, instead of a silly and ridiculously largeharem, a serious series that actually took a darker look at Souta's condition and the story then it would have been much better. They sort of just compiled Matrix-esque story elements into the harem madness and boom, they created this show. With flags.\\n\\n\r\nThat piece of text right there was part of a post I made after watching the last episode of this series. \\n\r\nIf Her Flag Breaks is an anime that had a good amount of premise, but eventually failing and falling into a pit full of burning flags and every single type of girl that could be included in any harem anime, ever. \\n\r\nI was excited for this show when it first came out. The PV made me think \"Oh my god! A romantic comedy about a main character who actually feels DEPRESSED from his supernatural condition? This is gonna be great!\" and the actual series made me think \"I don't want to be here anymore.\" \\n\\n\r\nWith that aside, I'll split the review into separate paragraphs to explain my feelings for each aspect of this series. I'll try to be quick about it, since nobody likes reading long reviews when all they really want is an opinion on the show before starting it. Or they do want long reviews to learn about other people's feelings on the disaster we all just witnessed. Either way, here you go. \\n\\n\r\nStory: 5\\n\r\nI don't even know where to go with this. The story, for the most part, is fairly simple. At least we think it is. Hatate Souta has a sort of \"curse\" brought upon him, where he has the ability to see people's \"flags\". These flags mark a certain person's feelings and emotions or they simply predict the upcoming events of their lives. Death Flags, for example, will appear on someone's head if they're soon to, well, perish. Souta also has the ability to break these flags, giving him the ability to change fate itself. The only way he can break these flags are... uhhmm... what was it again? Oh, well, he has to know something... personal about said dying person and he has to... errr... \\n\r\nAnyway, eventually Souta starts to learn about this power of his and along the way, more and more girls pile up at his dormitory and fall in love with him for absolutely no reason at all. Just like any harem. Or, if there is a reason, it's an extremely stupid one. For some odd reason, just like in any harem, these girls that Souta has just met care about him deeply. Why is this? Well, ask the plot, because it... sort of explains it. I think. Too much was going on,  I... I couldn't really tell. \\n\r\nI won't explain the story for you, because I just can't. All I can say is, like I said before, it basically becomes the Matrix featuring a harem. Well, not exactly, but something similar to it. \\n\r\nThe plot is executed horrifically. The show spends most of it's time trying to \"develop\" the outrageously large harem it's constructed, though all in all, they end up with forced personalities that are actually kind of annoying. Well, some of them are annoying. I'll just count this as part of my Character section, so I'll tell you I gave the characters a 6 out of 10. Although they weren't developed very well and their feelings were forced, some of them I actually liked. \"Some of them\" actually meaning two out of the 13 or so girls that were involved. \\n\r\nSouta, on the other hand, isn't really an interesting character. Sure, I liked how he was actually depressed because of his power and his \"past\" was actually tragic enough to create a logical reason as to why Souta would be a big ball of gloominess, but other than that, his personality was bland. As are most main characters in a harem series. \\n\\n\r\nWell, that's it for Story and Character. Sorry for skipping around, sometimes I end up turning into a different direction when it comes to talking about certain topics. \\n\\n\r\nArt: 6 \\n\r\nI didn't care for the artwork. The style was strange, as it made every girl look like they had, what I call, \"babyfaces\". Seriously, every single one of them looked like they were 9 years old or something. Don't get me wrong, I've seen plenty of anime where young girls are depicted to look MUCH younger than they actually are, but there's something about the way their faces look that makes them appear baby-ish. Other than that there's nothing to really talk about in this section. \\n\\n\r\nSound: 10 \\n\r\nThis is literally the only thing I actually enjoyed throughout the entire show. The soundtrack was phenomenal. I loved every bit of it. I feel as though... this series does not deserve the music it had used. Give it to something better! Argh. \\n\r\nOn the other hand, I didn't care for the opening or ending. The opening is catchy, but not anything special. \\n\\n\r\nEnjoyment: 5 \\n\r\nI constantly questioned where this show was going, over and over. This and that happened, and I'm just sitting here waiting for something to finally make sense! \\n\\n\r\nI only recommend this to people who want a chance to turn their brain off and enjoy a typical, senseless harem. Ignore the plot, because it's plain garbage. \\n\\n\r\nOne more thing. The show isn't even that funny. \\n\r\nWhen I saw the synopsis, before watching the PV, I figured it may turn out to be another genius romcom like Noucome. I was wrong. Horribly. \\n\r\nThis is partially, or I should say, mainly, a romantic comedy. It's neither romantic nor comedic. It tries but it fails. \\n\\n\r\nWell, my friends, the Spring season is over. Some shows are notable, and some are not. This show is the latter. While I have to mention, though, I did love several of the series this Spring and I cannot wait for the summer simulcasts to begin. \\n\\n\r\nHave a good day. May the harem gods rain mercy down upon your soul, for after watching this show, you're certainly going to need it.",
            "date": "2014-06-30T09:44:00+00:00",
            "helpful_count": 80,
            "mal_id": 149577,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3671701.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hime-In-A-Box",
                "username": "Hime-In-A-Box"
            },
            "url": "https://myanimelist.net/reviews.php?id=149577"
        },
        {
            "content": "I've got to say, I noticed quite a few people bashing \"Kanojo ga Flasg wo Oraretara\" and I must say I truly believe it's not that bad of an anime. I actually really enjoyed this anime, and it was a great harem in my opinion, ^_^.\r\nTruthfully, I thought this show was going to be one of those happy-going anime with everybody always having a great time, smiling, enjoying life to the fullest, although I must say I was really surprised with how this anime was executed. Make sure to notice how I say \"surprised\" because I believe this is the reason people are bashing thisshow. It's actually much more dark than you'd believe and the story is actually pretty interesting. When I first saw this anime, I thought it was going to be about some kid who makes flags for a school club or something lol.. It's actually about a teenager who has an ability to see flags on other people's heads regarding various things such as a \"love flag\" where he can tell that she's falling in love with him. Or perhaps a \"trusting flag\" or something along those lines :P. The story actually gets pretty in-depth later on as the anime progresses, and as the story slowly progresses he has a great time with his harem\\n\\n\r\nNow, the art was a huge let down to lots of people. I see plenty of people complaining about the art all the time.. I personally didn't really notice anything but I am not that picky. I thought the drawings were cute and it was fine in my opinion. I enjoyed the art, I thought it wasn't that bad.\\n\\n\r\nThe sound was pretty good actually. The opening was another factor that led me to believe this was one of those plot-less happy go going anime haha. I found the OP to be a little annoying at the beginning, but for some strange reason it grew on me and I love it now LOL. (yes I'm a guy)\\n\\n\r\nThe characters were probably my favorite part, each really unique for his special harem. All the girls are different so you'll love some and hate some & there's sooooooooo many girls it's hard not to like one. For the most part they're all cute in their own way and you get to know each one better with each episode. I surprisingly really liked the MC, he's pretty sick. He goes through a lot of traumatic experiences and seems somewhat depressed, although has a cool attitude and has all the girls fall for him easily!\\n\\n\r\nI enjoyed this series a lot. I see plenty of people saying they didn't but I did! so make sure to give it a try just in case you're like me ;) \\n\\n\r\nOverall, the show is a nice mixture of genres & leaves you wanting more. Near the end of the show it gains the genre of action for the last 2 episodes, but I liked it tbh since I'm an action fan as well haha, it fits the plot holes pretty nice as well.",
            "date": "2014-06-29T20:12:00+00:00",
            "helpful_count": 27,
            "mal_id": 149447,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3880295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/crew7",
                "username": "crew7"
            },
            "url": "https://myanimelist.net/reviews.php?id=149447"
        },
        {
            "content": "*Minor spoilers, but not really* /UPDATED 7-1-14/\r\nWhere do I start. This anime had a lot of potential with an interesting unraveling plot. But it just dragged on and had annoying moments.   \r\nStory: 5/10- The main reason I started watching this anime was because of the Synopsis I read. I thought \"oh cool, this sounds different!\" And it started off pretty nicely. But I am not a fan of Harem, so this probably why I gave it a six. I love the underlining plot with Souta, the protagonist. I find his character interesting. He has a tragic past & not only that, he seespeople's \"flags.\" But it's a curse. While trying to get by in school, he's also faced with a ton of girls that I wish had a more common sense. The only one that seems to be the opposite of the other girls is Nanami. I'm sorry, but the girls he lives with are annoying and always trying to flirt with him. It takes the seriousness away from the actual storyline. The main plot is definitely a win in my book if it weren't for the unnecessary scenes they have. But hey, the girls are devoted to him in sweet ways, so that's a plus and they were willing to do anything for him\\n\\n\r\nLet me talk about the last episode & more (spoiler free) It's a complicated plot especially towards the end. Somethings don't make 100% sense to where you have a relief to be like \"OHH that makes sense.\" I feel like this anime was trying to do too many things at once. Comedy was mediocre and they really go heavy on the harem element of this. While they were trying to have funny moments, they also tried to splash a little depression your way! Not saying that's a bad thing. I love dark animes, but they did it in a way were it was kind of a turn off. If you don't pay close attention to every part, you'll be left confused. I know I'm not confident even to say I know what exactly happened. The ending was just like a \"wtf just happened\" type of feel.\\n\\n\r\nEpisode 13 didn't make a whole lot of sense to me. Whether it was the random fighting or Nanami realizing who she actually was the episode before. I dunno. But Souta did realize something important at the end, so that was a bonus. But like I said, I think they were trying too much at one time. So somethings probably weren't as implied as other parts were.\\n\\n\r\nFrom what I hear from all sources, that the manga is better in ways of explaining and has better development. Hope that's true. \\n\\n\r\nArt: 5/10- Character designs are tacky and the animation isn't that great \\n\\n\r\nSound: 5/10: I'm not usually picky on OPs & EDs. I almost 9/10 love them. But in this anime, I disliked them very much. It's cute, but it's just not my style. These types of things are usually a hit or a miss for anime fans. And this one was just a miss for me >.>  \\n\\n\r\nCharacter: 5/10- When starting off with the two main protagonists; Nanami & Souta, you think \"this will be good.\" And as the story progresses you get a sense for how Souta is feeling despite the smile he fakes. Which is something most of us can understand. I actually really love Souta's character. In the beginning he's kind of a jerk, but then you find out his reasons. And then a group of girls slowly, but surely changes his heart. With his stone-cold exterior changing, you realize he's a complex character. Once you think you know him, the story just twists it up and gives you a completely different perspective. You begin to question literally EVERYTHING you have been watching every week. That's what I like about this anime. \\n\\n\r\nSome of the emotions the characters are feeling seem pretty relate-able. And other times it's just \"not even close to realistic.\"  This anime really does fall flat for character development though. They did a decent job on Souta & Nanami, for the most part. but they too do have character flaws. But for the others, it was just maybe, if they were lucky, a few minutes of their past. Some of them were a little more in depth while others failed to have that chance.\\n\\n\r\nI really do understand that when creating anime, they do have a budget. But you have to be willing to spend a little more to get A LOT more. I feel like this anime could have been something great if more time was put into it. I honestly felt like everything was too rushed and left with so many questions. \\n\\n\r\nEnjoyment: 5/10- I started out loving it but as it progressed I was a little ify about it. I honestly thought I as going to be in love with this anime because of my first impression. I was sadly let down. There are so many characters being introduced left and right, that it's hard keeping up. I feel as if they are just kind of there, not really doing much besides trying to get with Souta every ten seconds. Though their love for him is sweet & all, it's just annoying at times. \\n\\n\r\nI am not the fan of Harem, so this probably why I think it is annoying. But I honestly think that girls throwing themselves at a boy who doesn't really pay attention to them is kind of childish. Now being a sister figure is different. you love him in a family way, not a \"I want your kids someday\" way. \\n\\n\r\nI think I would have enjoyed this anime a lot more if they focused just a little more on the underlining plot rather than pointless scenes that don't end up getting remembered by the time you finish the anime. Kanojo had an interesting storyline. I liked it a lot. Souta was a VERY important part in doing the things that needed to be done. But it wasn't as enjoyable as I would have hoped. \\n\\n\r\nOverall: 5/10- It had awesome parts(I guess?), but it's just not my cup of tea. Despite everything, if you can get past the girls I wanna slap sometimes and just pay attention to the unraveling plot, you might like it? Not saying everyone will, but it could happen. \\n",
            "date": "2014-06-25T14:35:00+00:00",
            "helpful_count": 26,
            "mal_id": 148573,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776165.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeZ0id",
                "username": "AnimeZ0id"
            },
            "url": "https://myanimelist.net/reviews.php?id=148573"
        },
        {
            "content": "The concept of an Event Flag should be nothing new if you’ve watched enough media.  After triggering a flag, the plot is set in a specific path. Death flags are the most common example. If a character starts talking about their family or what they’re going to do after the battle, you know they’re doomed to die.\r\nSo what if we took this concept *literally*? And then we added a harem? And then we did whatever we wanted with the plot? That, my friends, is Kanojo ga Flag.\r\nStory:\r\nKanojo ga Flag is about a generic harem lead, Souta, who can see event flags on top ofpeople’s heads. He transfers to a new school and immediately starts building a harem. Souta’s harem might as well be the harem to end all harems. It has basically every archetype: Tsundere, Airhead, Older Sister, Little Sister, Student Council President, Trap, Childhood Friend, Princess, Idol, Robot, Baby/Grandmother, Tsundere 2, and Teacher. The harem grows so fast that it becomes pointless to distinguish between the girls. They’re all obsessed with the MC for some reason and that’s really their only defining trait.\\n\\n\r\nIt managed to work well enough. When a harem gets so big and it’s clear the girls aren’t actually going to win over the MC, you stick around for the pointless harem antics. Beach episode? Sure. Beauty contest? Let’s do it. Super serious plot? Totally—wait what? Kanojo ga Flag never needed a serious plot but it decided it was going to cram it in anyway. I don’t think the plot twist is necessarily that bad; the show definitely foreshadows it. The problem comes from the amount of time the audience has to comprehend what’s even going on. It’s introduced very quickly and you pretty much just have to roll with it and watch in confusion or look up an explanation. An additional episode might’ve helped solve the problem.\\n\\n\r\nCharacters:\\n\\n\r\nThere’s nothing interesting about any of the characters. The MC always has a bored look on his face that makes you wonder why any of the girls are so interested in him. The best I can say about the rest of the harem is that they exist. They fulfill their roles in their respective archetypes and in the greater plot, but otherwise there is nothing unique or memorable about any of them. If you’ve seen an anime before then you’ve seen this cast.\\n\\n\r\nSound:\\n\\n\r\nThe voice acting was pretty good overall. Of particular note is Nanami’s voice actress, who was only 17 when the show aired. I think she did a good job for someone so young and just getting into the industry. Akane, the airhead, easily has the most annoying voice in the show. She also finishes each of her sentences with “desu” because she’s cute and I personally find it more frustratingly annoying than anything else. There’s no real standout performances among the rest of the cast, though Kana Hanazawa playing a trap was pretty fun.\\n\\n\r\nThe OP and ED were passable. “Nothing special” is the key to Kanojo ga Flag. The same goes for the OST: it did its job well enough while I was watching the show but there’s nothing about it that particularly stuck with me.\\n\\n\r\nArt and Animation:\\n\\n\r\nThe elephant in the room is Kanojo ga Flag’s art style. The girls are drawn in a way that make them look several years younger than they actually are. Look at any promotional art for the show including the picture on MAL and you’d probably conclude that they’re (mostly) all elementary school students. Admittedly, it looks a bit better when it’s animated. By the end I didn’t mind it too much. The rest of the art is colorful and fits the mood of the show. When the show goes full seriousness, the art gets darker along with it. There were no significant distracting art errors.\\n\\n\r\nThe animation gets the job done. There are no huge quality issues or outstanding animation sequences. This is a harem anime for the most part. It doesn’t need to do anything great so I can’t really demand too much out of it.\\n\\n\r\nEnjoyment:\\n\\n\r\nKanojo ga Flag is not *good*. It is a train wreck in every sense of the phrase. But it is a beautiful, entertaining train wreck. The show is incredibly fast paced and it does a good job at keeping the audience engaged. It’s so stupid and ridiculous that you can’t help but keep watching. I had fun watching the show from beginning to end and honestly that’s the most important part to me.\\n\\n\r\nConclusion:\\n\\n\r\nKanojo ga Flag wo Oraretara will never win any awards for anything. The plot is a mess, the characters are uninteresting, the sound is decent, and the art/animation is bad to ok. BUT I had fun watching it. If you don’t take it too seriously then I think you can have some fun with it.\\n\\n\r\n5/10",
            "date": "2015-09-04T00:36:00+00:00",
            "helpful_count": 18,
            "mal_id": 197775,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2163743.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/dertswa687o",
                "username": "dertswa687o"
            },
            "url": "https://myanimelist.net/reviews.php?id=197775"
        },
        {
            "content": "Last episode was so-so, but it was a okay conclusion for this anime. After that I decided to write this little review of this anime.\r\nStory: As for story. The story started out great, we get some idea that this main protagonest can see flags of peoples ''goals/fates'', which he then can manipulate and then change the goals/fates. I could see the potential in this anime. But then it went down. All the way down to the point, that i would almost compare this anime with many other pathetic animes. \r\nI didn't like how the anime turned down to and how the pacing was. I expectedthis anime to revolve into the genres comedy, school, romance and harem. Since the genres for this anime are those genres. I thought this anime to be a light-hearted one with good romance comedy of course with some harem. But it totally forgets most of these genre, except the harem genre of course.\\n\\n\r\nAt the end of the story, it turned into something dark, serious and something that looks like from a fantasy/sci-fi. It was a complete mess and made the story really confusing and dreadful. \\n\\n\r\nMost of the characters of the Souta's harem were bland, uninteresting and 1-dimensional, Only meaningful characters of all of them, were actually Nanami and Souta himself for the story to progress. And even those 2 weren't that interesting. The rest of the girls were just a part of Souta's harem. They were only helpful at the 2 last episodes. Most of these girl were actually also forgetable, sometimes I ask myself. Who was this girl right now? Ah i see, that's her, which means for me, they don't actually play a role in this anime at all. Just a part of Souta's harem and nothing more.\\n\\n\r\nArt was poor/decent at best, nothing really special about it. What i noticed in the art, they made something, that shouldn't be a part of the background, but they did it. Which I actually found it very annoying.\\n\\n\r\nSound was decent, i guess. I found the opening song okay catchy, but it's forgetable. The opening song made some huge dissapointing expectation of this series, since it was lightwarming and was perfectly fine with it's genres. As i said above, that i thought this anime would be a lightwarming romance comedy with some harem added over to make some good and funny moments, but then it ended out to be something dark and serious, which was quite surprising in a bad way.\\n\\n\r\nAs said this anime actually had potential, the first episode showed that. It could have been a good series. But ended out to be a very dissapointing one. Overall I would give it 2/10, but right now i'm quite generous, since I did enjoyed the anime, just a little bit. It had potential to be a good series, since first episode was quite good. So i would say 3/10 from me.",
            "date": "2014-06-30T04:57:00+00:00",
            "helpful_count": 14,
            "mal_id": 149539,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3725553.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Sdragohn",
                "username": "Sdragohn"
            },
            "url": "https://myanimelist.net/reviews.php?id=149539"
        },
        {
            "content": "I haven't written many reviews, but I will do my best and probably won't write to much.  (minor spoilers)\r\nStory :5\r\nAt first seemed interesting. This boy Souta has the power to see flags, and also the power to break them. Somehow he can change fate by doing so. Then a lot of girls appear, as expected harem route. However things get a bit serious when we find out that he has some sort of curse. This serious part of the story was pushed into the plot in a not very good way. It ended up as appearing to forced and confusing, at least to me.\\n\r\nArt : 8\\n\r\nIt was good, can't really complain.\\n\r\nCharacter : 6\\n\r\nSome interesting characters, but overall the same as usual.\\n\r\nEnjoyment: 5\\n\r\nLaughed a bit but in the end just forced to watch how would it end.\\n\r\nOverall: 5\\n\r\nIt wasn't terrible but, seem much better. Didn't care to much, don't regret watching it but definitely not watching again. Feel free to try it if you want, but I believe there are better stuff to watch.",
            "date": "2014-07-02T16:25:00+00:00",
            "helpful_count": 13,
            "mal_id": 150053,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332625.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/vashthedrawer",
                "username": "vashthedrawer"
            },
            "url": "https://myanimelist.net/reviews.php?id=150053"
        },
        {
            "content": "Harems are a very debated genre of anime.  Some people like them, some people don't.  For this season of Spring 2014, the harem anime Kanojo ga Flag wo Oraretara, or \"If her flag breaks\".  \r\nStory (5.88/10):  The story of \"If her flag breaks\" revolves around the life of our main protagonist, Hatate Souta, a boy who has the mysterious power of seeing \"flags\" on top of people's heads.  (They are literally small flags.)  Haunted by his past, Souta meets a girl by the name of Nanami, a girl of whom he tells his power to, eventually meeting other girlsalong the way as they live in a dormitory called quest dormitory, as well as haunted by the idea of trying to find \"the secret of the world!\"\\n\\n\r\nFrom this synopsis, a few obvious points come out.  For one thing, the genre of harem becomes quite obvious, as well as the possibility of quite a few ecchi moments spawning from it overall.  Both of these points are quite prominent in the anime and take up a good majority of the show.  All of that is good and fine, as many harem shows have that sort of formula that quite a few number of people tolerate, but there are things, many things about this show that just make it so flawed.\\n\\n\r\nFor one thing, the plot.  As an idea for a show, Kanojo ga flag has actually a decent plot idea.  The entire lore that the show has is actually interesting enough to make a show out of.  But what made it bad, was the way it was executed.  For starters, the first ten or so episodes follow a character introduction format, where in every episode, a new character is shown and explored, then put away into supporting role obscurity, or, a side story-esque plot line, that doesn't impact the show greatly in any way.  THis is one of the show's greatest flaws.  Because of the fact that the show does this sort of plot line for a good majority of the show, the rest of the time used for the story is used in this sort of rushed format that was really, really confusing.  (Like honestly.  You start with a show about flags, it ends up becoming the Matrix somehow.)  \\n\\n\r\nWhat also was a major flaw was the lack of explanation.  From the beginning of the show, some obvious mysteries are given to the audience like, who is that girl?  What is the secret of the world?\\n\r\nThat's all fine and good, as good mysteries encourage the audience to watch the show, except when you don't explain anything period.  As the show went on, more and more questions were being shown to me, and I just had a hard time keeping up with what was happening in the story overall.  Aside from that, the anime changes mood very quickly, from one minute being happy and cheerful, to a dark and foreboding tone, all in the same episode and all without any gradual change, as it all felt very sudden and provided even more confusion.\\n\\n\r\nIn terms of pacing, the show had a heavily uneven pacing along with it.  The ending of the show felt really rushed, and the beginning 3/4 of the show felt really slow.  Overall, it wasn't a very good experience to watch, as the show didn't feel very balanced in terms of explaining stuff.\\n\\n\r\nOverall, Kanojo ga flag was a mess.  While the story idea was a decent one that could make for an interesting action experience, the actual execution of the show was terrible, as the show tried to fit too much of its plot in 13 episodes.  If it was given more time, then the show may have done better, but for what we were given, the show didn't do a good job at conveying its story as properly as it may have wanted to.  \\n\\n\r\nOverview:\\n\r\n+  Good base story idea\\n\r\n-   Uneven pacing\\n\r\n-   Rushed ending\\n\r\n-   Mostly episodic format in a story driven story\\n\\n\r\nCharacters (6.39/10):  In a general harem, a total of 3-5 girls is what you would normally see in terms of the amount of girls you would see surrounding the main character.  This anime, has 12.  \\n\\n\r\nHatate Souta, our main protagonist.  in terms of what you would normally see in harem anime, Souta is actually a rather interesting protagonist, as it becomes very clear that he is affected by the events that occurred before and during the point in time the show takes.  As time goes on, you can see his character become a little more developed than when you see him initially.  Personally, I find him to be more of a character and more of a person as he clearly shows emotion in the show.  \\n\\n\r\nNanami Bladefield, the main female protagonist of the show.  Compared to the rest of the females of the show, nanami is a more developed character, as her role next to Souta becomes more and more prominent as the story goes on.  Apart from that, Nanami has a more complex character, as you can see her personality and reactions to certain situations and people differ depending on what is happening at that moment in time.  Personally, she is a more far more interesting character than a great deal of other characters in the series.\\n\\n\r\nApart from these two, we have a massive, massive amount of females from all sorts of different cliches.  (Big chested rich girl, the little sister, the older sister, the idol, the bishonen, the childhood friend, the school president, the annoying one who repeats her last statement, I could go on and on.)  To me, none of them have a great deal of significance to the story, as really, a great deal of them were added one by one as the series went on, each of them becoming less significant and earning less screen time as the next one came into play.  For me, these characters didn't add too much significance to the story other than just eating up screen time and making the plot more confusing than it was initially.  \\n\\n\r\nOverview:\\n\r\n+  Decent main characters\\n\r\n-   Excessive supporting cast with little to no significance\\n\r\n-   Pointless character introductions towards the end of the series.\\n\\n\r\nArt and sound (7.21 and 7.01/10):  The art of this series is actually decently well done.  The characters, while looking quite moe, do look very well done and are actually quite well designed in my opinion.  The art style is quite bright in terms of color and the backgrounds are quite well done.  Everything is quite detailed and it actually looks rather nice.\\n\\n\r\nIn terms of fanservice, there's not actually very much in terms of what you would see in terms of normal fanservice, which I find to be a nice surprise, as a lot of the times, harem animes are associated with fanservice.  Sure there are some, but it wasn't enough to completely turn me away and dub this an ecchi show.\\n\\n\r\nFor music, well, it's not bad.  The actually opening of the song is rather whimsical and somewhat childish, which I found to be an interesting surprise.  I'm not really a big fan of it, but it wasn't a bad song at all.  The ending, well, it's quite generic in comparison.  There's nothing really fantastic in terms of how it was composed, but it's not terrible to say the least.\\n\\n\r\nOverview:\\n\r\n+  Nice moe style art\\n\r\n+/-  Interesting opening\\n\r\n+/-  Generic ending song\\n\\n\r\nPersonal Enjoyment (7.10/10):  Harem anime are a favorite genre of mine, so finding new harem anime is always a nice experience.  For Kanojo ga flag, well...I'm a bit impartial.  There were several aspects I liked, specifically, the way that the anime itself set itself up at the beginning.  But, as the series went on, more and more questions popped up in my head.  \\n\\n\r\nDid I enjoy it?  \\n\r\nWell, to a certain extent, yes I did.  The show had some interesting comedy moments for itself and it was quite interesting to see this show's version of comedy.  However, the fact remains that the execution of the show was quite terrible, and the fact that nothing of significance in the story was explained, the show just didn't give me enough to like about it.  While the show had some potential for it, it just didn't deliver.  \\n\\n\r\nOverall Score: (6.32/10)",
            "date": "2014-06-29T19:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 149439,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=149439"
        },
        {
            "content": "(SPOILERS INCLUDED)\r\nDescent anime. The storyline is not that hard to follow and everything gets explained so it doesn't leave us with an open ending. Characters that grow to us (hopefully right English xD). Very gloomy protagonist (which I personally love).\r\nNow there are also a few things that annoy me about this anime. First of all it gets really annoying to watch Nanami hitting and kicking Souta for every little thing she doesn't like.\r\nSecond thing is that the androgynous guy (trap) Megu acts all female and seems happy with it yet demands to be a manly man which does not make any sense. Just let theguy be a femboy and stop bullshitting about him wanting to be recognized as a manly man...\\n\\n\r\nSomething else that bothers me in the show that there are way too many underdeveloped characters. And when we think we are getting to know a character, another one suddely appears and forces us to get to know that person too.\\n\\n\r\nThe last thing that bothered me was that in the end with the fight, all of a sudden their teacher joined their battle. Why she suddenly knows all about what happened gets never explained... The other characters have a history with Souta, but yet this teacher comes out of nowhere and wants to protect Souta too suddenly...\\n\\n\r\nConclusion is that the anime is fun to watch and the characters are very sweet but the characters are underdeveloped and sometimes annoying when they don't have to be.",
            "date": "2016-08-09T09:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 226325,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4410579.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/x666x999x",
                "username": "x666x999x"
            },
            "url": "https://myanimelist.net/reviews.php?id=226325"
        },
        {
            "content": "Here we have a harem that actually tries to do something different with its genre.  The story is full of twists, which is unusual for the average bland episodic style that most harems suffer from.  Sometimes, however, the story suffers from  a bland execution.  I got the feeling that the show was trying to generate more emotion than it actually managed to, especially during the last few episodes.  The characters aren't anything special, the art style is mediocre at best, and the soundtrack could have been better, but the overall package is something I consider as new.  While itisn't too different from the generic harem formula (until the end), I hope it opens the door for more innovation to an otherwise boring genre.",
            "date": "2014-07-01T11:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 149811,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3358011.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/spreen",
                "username": "spreen"
            },
            "url": "https://myanimelist.net/reviews.php?id=149811"
        },
        {
            "content": "[Three points before I begin: 1; I'm sorry for the length, sometimes I tend to ramble. I do a TL:DR at the very bottom for a small conclusion. 2. There will be minor spoilers, I will try to review this with the least amount as possible. 3.This is just my opinion, feel free to disagree or agree. But remember, this is just one man's opinion and the scores go by MAL standards, 7/10 is a C, which means average]\r\nThis is one of the worst animes I have seen. Sure, it is competent enough on a good amount of points, it ain't no Garzey's wing orMars of Destruction. But on the other hand, this anime flops so many times I'm surprised it survived it's own death flag.\\n\\n\r\nStory: So our MC can see Flags! That is a perfectly fine premise. Sort of like in Noucome, where the protagonist can see different choices like in Visual Novels. But in Kanojo Flag, instead of this being a random curse, he was given this curse by a loli magician, who he lost in chess. He must now muster a group of girls who represent different fantasy RPG classes and in doing so take the red pill and WTF is going on? No seriously, this anime is split into two halves. Harmless harem romcom and the third matrix movie. Plus, it is introduced to us a couple episodes later with no explanation. What explanation we get, is even more confusing than before. 3/10\\n\\n\r\nCharacters: If I can give this anime any accolades, it does pull off a good 7+ girl harem. SEVEN+ GIRL HAREM. We got, the Classic Tsundere, Modern Tsundere, Oneechan, the Imouto, the Trap, the Ojou-sama, The Childhood Friend,  the Tomboy/Genki Girl, Yandere, the foreign girl. There is every harem stereotype there is in this anime...and that is the problem, they are all stereotypes. Take any trope for one of these stereotypes, for example: The Tomboy wanting to be more girlish? Check. Childhood friends meeting each other after 5+ years? Check. That is the problem with all of these girls. They are so cuttout and cardboard you don't even have to recycle. Compost them. Sure you get some molding, for example: The Foreign girl is also the tsundere ect. But we have seen that before (Hidan no Aria for example). That is the problem, we have seen ALL of this before. Quantity doesn't always mean quality. \\n\\n\r\nNow, the main character... So you know that anime OreGairu/ Teen RomCom SNAFU? How that main character tries to avoid people and responsibility because he is a nihilist and makes himself the enemy because he sees that the community around him needs one and he gets no accolades by anyone? WELL F*** THAT NOISE. This guy gets a majority of his harem by trying to not make flags, he flags them anyway. At the start he is pretty unlikable. At the end...he is ok I guess, but he does nothing. 3/10\\n\\n\r\nArt: The art is fine. If I can give Hoods Entertainment anything it is that their art is pretty good. The only thing about this anime being done by hoods, it is probably the worst art done by Hoods. At least animes like Fantasista Dolls had good action art. The best art in this anime is probably the death flags and a horse....a very very majestic horse. 6/10\\n\\n\r\nSound: The VA's do their work well, and each have their own voices, even the characters who only appear for one episode, they are all noticeable and well done. I do like the OP but the ED I could do without. 6/10\\n\\n\r\nEnjoyment: Now I do admit, the first couple episodes were enjoyable. The anime did do some new things we don't see in harem animes. (ex:The Childhood friend character is still in contact with the MC via texting), Hanakana's character has some good quirks and a pretty funny running gag punchline. But that is about it. When the anime introduces the fantasy elements, it makes no sense whatsoever. Many a'time I was almost yelling at my computer saying \"EXPLAIN ANIME....EXPLAIN\", and when it does....it doesn't help. It then goes all \"TAKE THE RED PILL\" and spirals even deeper down the Death Flag Spiral. 3/10\\n\\n\r\nOverall:\\n\\n\r\nWhile this anime at first does seem like a nice harem anime, it is brickwalled by confusing and unexplained plot elements and the most, THE MOST cardboard of cardboard harem characters with a pretty unlikable MC.",
            "date": "2014-07-06T19:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 150773,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/248217.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/P_D_S",
                "username": "P_D_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=150773"
        },
        {
            "content": "This anime has serious issues with tone.  It takes a stock harem comedy and tries to make a more serious story in the last few episodes.  Thus it deserves some points for originality (harem comedies don't usually try to explain *why* all these girls are attracted to the same guy).  But because the actual storyline is so compacted into the last few episodes and is rather convoluted anyway, it can be seriously confusing.  Watch it for the comedy, not the storyline.",
            "date": "2014-06-29T21:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 149475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665575.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sayas_chevalier",
                "username": "sayas_chevalier"
            },
            "url": "https://myanimelist.net/reviews.php?id=149475"
        },
        {
            "content": "Objectively, this anime was horrible. Every character was a trope, the plot didn't know what it wanted to do, and it was cliched to kingdom come; That being said I honestly really enjoyed this, bad Harem Rom-Coms are sort of my guilty pleasure and I can't help but like it. Every arc in the story was honestly just: encounter problem, look for solution, OooooOO plot twist, find solution; sometimes the plot twist causes the problem but that's only once or twice. And yet no matter how bad I know it is, I still love it. This last bit probably seemed kinda ramble-y but that's justbecause I finished what I had to say like 4 sentences ago but I had to make it longer",
            "date": "2017-10-17T06:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 261015,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6352348.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/chichi2000fgh",
                "username": "chichi2000fgh"
            },
            "url": "https://myanimelist.net/reviews.php?id=261015"
        },
        {
            "content": "A good series to watch after a gruesome gore anime. A lot doesn't make sense but it's alright. Not really a fan of Harems tho. \r\nVery nice and unique idea about the \"flags\" for future events such as \"death flag,\" \"friendship flag,\" and \"romance flag.\r\nStory 5/10: Like I said lots of stuff doesn't make sense, but then again that's anime for ya.\r\nArt: 7/10: it has very kawaii art, especially in the opening and ending.\r\nEnjoyment 7/10: It's very pleasant to watch, it doesn't feel like my time is wasted. Comedy was on point.\r\nSound 8/10: Very well done, the sounds are phenomenal. The ending was better thanthe opening.\\n\\n\r\nDislikes: too much harem, lack of story.\\n\\n\\n",
            "date": "2016-11-17T14:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 233915,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5583054.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Christian_A",
                "username": "Christian_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=233915"
        },
        {
            "content": "I will be honest with you all. Unless you are bored and have nothing better to watch don't watch this.\r\nNow lets begin~!\r\n---Story--- \r\nScore: 8\r\nThe story follows a boy named Souta who has the ability to see flags above someones head that allows him to see what they are like or if they might die soon. I find this story rather orginal and a good watch if it was done correctly. The story is also rushed near the end skipping 2 characters and their developement. It is quite noticeable and is quite annoying.\r\n---Art---\r\nScore: 6\r\nThe art is nice but not fantastic. It is your average art thathas nothing really special to it.\\n\\n\r\n---Sound---\\n\r\nScore: 5\\n\\n\r\nThe sound is nothing special just like the art. The opening and ending are quite nice but nothing that really will stay in your head are will make you start to hum to it randomly.\\n\\n\r\n---Characters---\\n\r\nScore: 5\\n\\n\r\nThe charcters are generic. The main protagonist is Souta a boy with a special abilty to see flags that let him know what they are like or what will happen to them soon. His design is nothing sleek or fancy just your normal tall skinny teenager with black hair. Well for the other characters they is one most likely to your liking. There is a range of different cools from the Big Sister type to the girl who is the main protagonist Childhood Friend.\\n\\n\r\n---Enjoyment---\\n\r\nScore: 7\\n\\n\r\nIf you are like me you will follow a anime to the end if you are enjoying it for its entertainment. This show is just one of the shows that had good enough comedy and story to keep me til the end to see what happens but its nothing fantastic.\\n\\n\r\nI hope this was of any help to you otaku anime watchers.",
            "date": "2014-06-29T18:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 149433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2843773.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Oixo",
                "username": "Oixo"
            },
            "url": "https://myanimelist.net/reviews.php?id=149433"
        },
        {
            "content": "Not your typical harem, but a harem nonetheless. \r\nWhat really caught my interest when deciding to watch this series was the concept of the whole \"Death Flag\", \"Love Flag\" and etc. But, as you dive into the series, it kinda deviates from that concept at times, and becomes a bit inconsistent. At some points, I was actually wondering when the concept was going to present itself again. What was a good concept was detailed and presented very choppily.\r\nThis series definitely had its ups, and its downs. I feel as if it was struggling to find its identity. Yes, as you begin the series it isdefinitely you typical harem. Especially when you realize how many beautiful girls actually surround the MC. But, unlike most harems where the underlying story/plot isn't really built upon, this series tilts back and forth between harem and the story/plot. Definitely something that I was not expecting. The fact that it also goes into the details of why the girls are drawn to the MC and all the situations causing such does separate it from traditional harem. One instant you are in this cutesy moment or you go through 20 minutes of romance and comedy. But suddenly, BANG! You're hit with some seriousness and they try to build upon the story. Though it is a refreshing idea, it doesn't quite pan out smoothly.\\n\\n\r\nThe art/animation of the series is decent. The girls are all unique, but the style itself isn't all that tremendous. Certainly not bad. But certainly not the greatest. The sound  was good, as the music really does convey to the emotions being shown in the particular moment. the music does in fact set the tone/mood of the episode itself. Again, going back to the being cutesy/comedic one moment, then being serious the next.\\n\\n\r\nThe characters are decent. They are developed fairly well. Although I will tell ya it was difficult to keep track of names. The series does give you the back story as to why they are drawn to the MC which is highly unique IMO. Also, each girl is given their own characteristics. They aren't all the same, just given different eye and hair color. They have unique personalities and are all different from one another. \\n\\n\r\nOverall, worth a watch if you are looking for something to fill some time with.",
            "date": "2014-07-03T23:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 150265,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=150265"
        },
        {
            "content": "Kanojo ga Flag so Oraretara is about Hatate Souta and his ability to see various flags. (If you play visual novels its an event that triggers the story to turn in a certain direction.)  As original as the story sounds its execution of it was awful. To begin the plot was basically slowly figuring out stuff about these flags, then it went with this crazy ending that had little to no foreshadowing. Now I like major plot twists like TWGOK manga ending, this was more like how could I have predicted this. Plot twists should be able to predicted, but at the same timeyou don't.\\n\\n\\n\r\nThe next problem with the show is the characters. Basically everyone was pretty two dimensional. Every could fall into generic character types. Like little sister, big sister,  tsundere childhood friends, and that trap that wants to be manly. The harem itself was boring since characters fell for him for almost no good reason. Its worse than the whole he was nice to me reason. They just kinda fell for him.\\n\\n\r\nArtwork was good, and I liked the colors. This show also has a more prominent art style, though it looks like the artist used anime as reference when drawing them instead of real people, which is like in school how teachers copy copies, and the handout you get is all fuzzy and kinda tough to read.\\n\\n\r\nThe opening was okay. Because there was no character development, or relationship development they couldn't sing about that. So the only thing they could sing about the concept of the show; Flags breaking. Yeah the song was upbeat and cutesy but the it didn't make me connect with it. Openings should have some relation to the shows focus. This shoe didn't really have a true focus besides flags causing the song to fail.\\n\\n\r\nOverall I did enjoy the show since I watched it all, however I only watched it cause I had nothing better to do and I'm not being tsundere. The show itself is a good way to past the time, and nothing more. Though watching it can be painful at times not because of drama, more because of how lame some of the flags are.",
            "date": "2014-07-30T07:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 154441,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3658019.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GoodLuck",
                "username": "GoodLuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=154441"
        },
        {
            "content": "As harem anime go, Kanojo ga Flag wo Oraretara had a good bit of potential.  The story tugs at your heartstrings without being a constant flow of tears, and has a nice chunk of comedy.  None of the girls were truly \"hate-able\" (in my opinion, yours may vary), and each had a different kind of love for the main character, whether it was romantic, sisterly, friendly, or even parental.  The MC is actually able to recognize all of their affections for exactly what they are (since he can see their flags) and has an understandable reason for turning away from any advances,which is explained a few episodes in.\\n\\n\r\nUnfortunately, the biggest issue with this series is how rushed it is.  With a whopping 11 girls (and 1 \"trap\") and only 13 episodes, there is very little time for character development or any big attachments to any of them.  Typically, one or two are introduced each episode, a bit of time is given for why they get attached to the MC, and then they are pushed off to side roles as the next is pushed in.  Megumu (the \"trap\") in particular gets basically no screen time by halfway through, except for throw-in gags two or three times per episode where everyone forgets, yet again, that he is a guy.\\n\\n\r\nThe finale of the show, sadly, managed to knock my rating down a point or two on its own.  While there was a decent amount of foreshadowing throughout the series, the finale itself came suddenly enough to be jarring, and rushed through explanations as to what was happening and how.  With zero build-up, this light-and-dark mix harem anime attempted to turn into action show, and sadly didn't do it very well.\\n\\n\r\nWhile I enjoyed most of the ride, at the end I felt confused and a bit cheated.  This is one of the few harem anime I can confidently say would been made better by going on longer.",
            "date": "2016-05-31T09:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 219707,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DazzAntoni",
                "username": "DazzAntoni"
            },
            "url": "https://myanimelist.net/reviews.php?id=219707"
        },
        {
            "content": "The idea and setting of this anime was really promising, and then.. everything went downhill. \r\nStory: The story is about a boy who could tell how people really felt inside or could even tell the future by looking at the 'flag' on top of their heads. The story has so much potential for development if they had just focused more on the different flags and given the characters a bit more personality and depth.\r\nI felt that that harem component was a bit overboard, it doesn't take very long for some new random girl to fall in love with the protagonist. But that's not the worstpart. It's how the whole school can just watch as Souta-kun gets all the attention like he's the star and the most important person in the world that doesn't seem very natural. Then again, 'flags' are somewhat related to gaming and in a game, you are the star regardless of who you are.\\n\r\nIn a nutshell, the way the anime progressed left me seriously confused, let's just say it seemed like they were taking a lot of different themes and mixing it up together into a really interesting concoction of a show trying too hard to  end with a good twist. \\n\\n\r\nCharacter : \\n\r\nThe girls were really cute and each had their own personalities. But instead of building upon the existing characters and allowing them to be fleshed out, a new character was added almost every episode. None of the characters were really memorable or unique to me, except for maybe the 'elder'. \\n\\n\r\nOverall:\\n\r\nIt's good that it's only a 13 episode anime. I strangely wanted to know the end of the story even though it was getting pretty confusing and even boring after a while. Souta is a pretty good guy with hardly any lewd thoughts or ulterior motives. He just wants his friends to be happy and takes care of them. Guess the only thought I have after watching this show is, \"Lucky guy\".",
            "date": "2014-07-16T06:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 152291,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3770987.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hoshi14",
                "username": "Hoshi14"
            },
            "url": "https://myanimelist.net/reviews.php?id=152291"
        },
        {
            "content": "Kanojo ga Flag wo Oraretara, \"If her Flag Breaks\", is looked upon as the most time wasting anime of spring 2014. And trust me, I do understand why. However, for some reason, this was one of the animes that I enjoyed the most. I want to explain why, so, here's a review of someone who actually liked this so called flop.\r\nThe novel is the most known work by it's creator, Takei Touka, and has received a couple of manga adaptions. However, that doesn't mean that it's well-known. I must say that I'm surprised it actually got an anime adaption, but I'm sure they had somethingin mind. And I'm happy I got to know this story.\\n\\n\r\nThe story starts of like any harem comedy, which is probably why some people can't stand it. Other than our protagonist's strange power, it doesn't have any other special treats. The thing about flags is a quite original idea, and it was really entertaining even though it was pretty silly.\\n\\n\r\nHowever, we're told pretty soon that something's off, which is probably the main thing that keeps the interest. Other than that, the comedy was actually quite enjoyable, having me laugh out loud in every episode. The harem is really big, and some characters are seen less than others, but all of them have their own characteristics which makes them special in one way or another. However, they have one thing in common; they reeeaaally love Souta. This was something that could get highly annoying at some points, seeing how everyone loses their heads when they're with him.\\n\r\nThe reason I kept watching was probably since it was really funny, one of the very few animes that makes me laugh even when I'm all alone watching it. Also, I really liked some of the characters.\\n\\n\r\nIt was really late, but suddenly, the main story broke free, releasing a huge plot twist that really messes with your head. I never thought that I'd get confused while watching Gaworare, I never did. It was probably since it was so unexpected that I enjoyed it so much, but I actually do think it was quite good. The character relations were nicely handled on this point too, I was more than satisfied at the end. Although some parts of the \"serious\" story were just as silly as the rest of the show, I did enjoy it, and it raised my score a lot.\\n\\n\r\nMy favourite character was Akane, right from the start. She's by Souta's side through the whole show, and she really deserved the ending she got. Just like most characters in this show, she's really stupid whenever it comes to Souta, but she's still very charming and really cute.\\n\r\nThe most outstanding character would still be Nanami, though, the most noted heroine with a cute personality. I got really happy when her true role was revealed. This really sorted out the character relations, and she kept her important role while still being a good character.\\n\r\nThe other characters also have their roles, some being a little more noted than others. As an example I want to bring up Ruri, who I experienced being more of a witness, watching over the whole story and only making a move now and then. Her character was quite a mysterious one, which made her even more appealing even though she was a robot. This was really interesting.\\n\r\nI do have one complaint though, and that would be the old granny looking like a baby. This is one step over the line, but her aside, everyone were really nice characters.\\n\\n\r\nHatate Souta was a good protagonist, starting of as a depressing view and developing into a hero who really wants to save everyone. He does question some of the characters' actions, but he treats everyone like his friends and we know that his life would be less cheerful if everyone wasn't in it. His actions in the final scene were really touching.\\n\\n\r\nTo be honest, I do think that \"Kanojo ga Flag wo Tateru Wake\" is one of the best ending songs of spring 2014. The melody is sweet and really nice to listen to, I never skipped it while watching the anime, and I'm actually listening to it while writing this review. Also, the illustrations that were shown within those 1:30 seconds were really beautiful. The opening was cute as well, although I didn't find it as good as appealing as the ending. \\n\r\nVoice actors were nice, they fit their characters and I have no complaints. Ohsaka Ryota, Souta's VA, was a great fit. And once again, our sweet little Hanazawa Kana made a great job as the trap.\\n\\n\r\nThe character designs were really really nice, all girls (and the trap!) were cute and had different hairstyles and features. I liked all the colours that were used in this series, they were bright and cheerful, making you happy while watching. But as soon as we reach the depressing parts, the screen gets gray and dull, making us feel just as down as the character in focus. I also want to point out that the school uniform was adorable.\\n\r\nOther than that, the art was really pleasant, fitting the theme with it's infinite cuteness. \\n\r\nThe BGs were at most times very well done, I especially liked how they portrayed the sea. Blue colours were a favourite.\\n\\n\r\nWith this said, I really did enjoy this show despite it's silliness. Even though it was really stupid at times, I could still laugh at it, which is important to me. As I was able to enjoy both the comedy and the \"serious story\", I want to give this show 7.5 in score, but since decimals are a 'no-no', I'll score it with an 8. So keep this in mind; this anime was not a complete flop, since I was able to enjoy it to this extent.\\n\\n\r\n… Or maybe that just means that it really is a flop.",
            "date": "2014-07-04T12:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 150329,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2915367.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hanasanaide",
                "username": "Hanasanaide"
            },
            "url": "https://myanimelist.net/reviews.php?id=150329"
        }
    ],
    [
        {
            "content": "The concept of flags seems interesting right? Death flags, friendship flags, even a romance flag to top it all off. The low score this anime has is something I strongly disagree with. I think people are reading the synopsis and jumping the gun when they read about the concept. This is NOT an Action/Adventure whatsoever. This is a Comedy/Harem anime!\r\nWith that in mind this anime has a concept that is unique and did a good job showing it for the genre that this anime is under. It made some really good comedy and actually has some serious parts in it.\r\nThis anime has sprung a lotof good points, but still has some bad qualities that may annoy people. The story is a concept that is new and did a great job showing and did a good job with the building of plot and story line to make a wonderful comedy. The art is something that I loved about the show and enjoyed greatly. The characters along with the background are all bright colors that fit the comedy mood of the show greatly. The characters are the best part of this anime and wouldn't be nearly as good without them. The openings and endings are super catchy and always made me want to listen more to it and just plain out enjoyed them. I'd recommend this to anyone who is looking for a slice-of-life/harem to watch, not just looking for a cool show with the concept of flags.\\n\\n\r\nWhere do I begin with this?\\n\r\nYou get a boy named Souta, and he has the ability to see flags over people's head to see their true intention. It's a concept that hasn't been touched from what i've seen and it was perfectly fine for the genre that this anime is under. Along the way he gains friends and tries to find out the truth about why he has the flags and how to get rid of them.\\n\\n\r\nThe back story for Souta is actually very interesting and made the series even better knowing it isn't just all upbeat and happy-go-lucky. The characters also have some sort of connection with him rather than all of them just being some random strangers he meets along the way (though some of them are).\\n\\n\r\nThe underlying plot that this anime has is a good lead that makes way for the plot that is actually stirring and building through out the entire anime. The ending was something I honestly didn't expect to happen and really made me think of how it did a wonderful job building up to it.\\n\\n\r\nThe art for this anime is possibly one of the best i've seen for the spring season to come this year. The art is very colorful and support the mood for the anime gives of beautifully. The art is super clean and even the background and details in the surroundings that the characters go through are all neatly drawn.\\n\\n\r\nThe characters are all drawn beautifully and have qualities that are unique to themselves. Each character didn't have a generic hairstyle that you see are common in all anime and are unique and have a wonderful color scheme to support each one. \\n\\n\r\nThe sound for this anime was very upbeat and helped support the aura that the anime gives off. The opening was upbeat and pretty catchy and made me want to listen to it every time an episode was released. The background music was wonderful and fit the mood of the situations they got themselves into perfectly which was a nice touch since the anime did have a serious side to it. \\n\\n\r\nThe voice actors were all wonderfully chosen and portrayed each character well. They all fit the emotion and really brought out the life of each character and made the anime a lot more enjoyable.\\n\\n\r\nThe characters can be a hit or miss depending on the person. I personally enjoyed them all and made the anime even better to watch. The genre of the anime is harem so there will many types of personalities clashing and making the anime seem a little less appealing.\\n\\n\r\nThe anime starts off with Souta and introducing Nanami and the pace picks up from there. A bunch of new characters are thrown in and at first it may seem bland and dull, but as the series progress you learn a bit more about everyone and make them all seem unique rather than just added to become a harem.\\n\\n\r\nYou get a big diverse group of girls. You get a childhood friend that is just reunited with him, a robot girl, a rich girl, and a boy who is VERY feminine. To top all of that you get a princess, 13th in line to be exact. All of that may seem like a horrible combination, but the interactions they all have with each other makes the anime a really good comedy and brings out the feeling the anime is trying to give off perfectly.\\n\\n\r\nIf there's things I had to complain about the characters it would be towards the ending. I'm not going to spoil anything, but it was honestly confusing until you really think about the events that happened and connect the pieces like a puzzle. While i'm at it, the ending was full of cliche moments that I literally just laughed at them the entire time, it was really predictable about what each character would say and the events that happen.\\n\\n\r\nI really enjoyed this and was really hesitant to start this up since it was getting such horrible feedback, but i'm glad I gave it a try. The characters were some of the funniest i've seen and made the series a lot more enjoyable as a whole. Not one aspect of this failed for the genre this is under, keep in mind this is NOT an action/adventure. If you're looking for something to watch with a unique concept this is definitely it!",
            "date": "2014-10-13T01:14:00+00:00",
            "helpful_count": 112,
            "mal_id": 164643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3667805.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jarrbearr",
                "username": "Jarrbearr"
            },
            "url": "https://myanimelist.net/reviews.php?id=164643"
        },
        {
            "content": "What an ending. \r\nFlag Matrix: Harem Edition. \r\nAlso known as \"If Her Flag Breaks\".\r\nI honestly feel as though they should have done something different with this show. I'm glad they tried something new, but it was way too obnoxious for me to appreciate it, at all. \r\nThey should have stayed away from being a harem in general. The plot was intriguing and had a lot of potential, so why fill it up with annoying and cliche harem devices? The harem was way too big, too. Around 12 or 13 girls. Seriously? Come on, man. \r\nIf this show was, instead of a silly and ridiculously largeharem, a serious series that actually took a darker look at Souta's condition and the story then it would have been much better. They sort of just compiled Matrix-esque story elements into the harem madness and boom, they created this show. With flags.\\n\\n\r\nThat piece of text right there was part of a post I made after watching the last episode of this series. \\n\r\nIf Her Flag Breaks is an anime that had a good amount of premise, but eventually failing and falling into a pit full of burning flags and every single type of girl that could be included in any harem anime, ever. \\n\r\nI was excited for this show when it first came out. The PV made me think \"Oh my god! A romantic comedy about a main character who actually feels DEPRESSED from his supernatural condition? This is gonna be great!\" and the actual series made me think \"I don't want to be here anymore.\" \\n\\n\r\nWith that aside, I'll split the review into separate paragraphs to explain my feelings for each aspect of this series. I'll try to be quick about it, since nobody likes reading long reviews when all they really want is an opinion on the show before starting it. Or they do want long reviews to learn about other people's feelings on the disaster we all just witnessed. Either way, here you go. \\n\\n\r\nStory: 5\\n\r\nI don't even know where to go with this. The story, for the most part, is fairly simple. At least we think it is. Hatate Souta has a sort of \"curse\" brought upon him, where he has the ability to see people's \"flags\". These flags mark a certain person's feelings and emotions or they simply predict the upcoming events of their lives. Death Flags, for example, will appear on someone's head if they're soon to, well, perish. Souta also has the ability to break these flags, giving him the ability to change fate itself. The only way he can break these flags are... uhhmm... what was it again? Oh, well, he has to know something... personal about said dying person and he has to... errr... \\n\r\nAnyway, eventually Souta starts to learn about this power of his and along the way, more and more girls pile up at his dormitory and fall in love with him for absolutely no reason at all. Just like any harem. Or, if there is a reason, it's an extremely stupid one. For some odd reason, just like in any harem, these girls that Souta has just met care about him deeply. Why is this? Well, ask the plot, because it... sort of explains it. I think. Too much was going on,  I... I couldn't really tell. \\n\r\nI won't explain the story for you, because I just can't. All I can say is, like I said before, it basically becomes the Matrix featuring a harem. Well, not exactly, but something similar to it. \\n\r\nThe plot is executed horrifically. The show spends most of it's time trying to \"develop\" the outrageously large harem it's constructed, though all in all, they end up with forced personalities that are actually kind of annoying. Well, some of them are annoying. I'll just count this as part of my Character section, so I'll tell you I gave the characters a 6 out of 10. Although they weren't developed very well and their feelings were forced, some of them I actually liked. \"Some of them\" actually meaning two out of the 13 or so girls that were involved. \\n\r\nSouta, on the other hand, isn't really an interesting character. Sure, I liked how he was actually depressed because of his power and his \"past\" was actually tragic enough to create a logical reason as to why Souta would be a big ball of gloominess, but other than that, his personality was bland. As are most main characters in a harem series. \\n\\n\r\nWell, that's it for Story and Character. Sorry for skipping around, sometimes I end up turning into a different direction when it comes to talking about certain topics. \\n\\n\r\nArt: 6 \\n\r\nI didn't care for the artwork. The style was strange, as it made every girl look like they had, what I call, \"babyfaces\". Seriously, every single one of them looked like they were 9 years old or something. Don't get me wrong, I've seen plenty of anime where young girls are depicted to look MUCH younger than they actually are, but there's something about the way their faces look that makes them appear baby-ish. Other than that there's nothing to really talk about in this section. \\n\\n\r\nSound: 10 \\n\r\nThis is literally the only thing I actually enjoyed throughout the entire show. The soundtrack was phenomenal. I loved every bit of it. I feel as though... this series does not deserve the music it had used. Give it to something better! Argh. \\n\r\nOn the other hand, I didn't care for the opening or ending. The opening is catchy, but not anything special. \\n\\n\r\nEnjoyment: 5 \\n\r\nI constantly questioned where this show was going, over and over. This and that happened, and I'm just sitting here waiting for something to finally make sense! \\n\\n\r\nI only recommend this to people who want a chance to turn their brain off and enjoy a typical, senseless harem. Ignore the plot, because it's plain garbage. \\n\\n\r\nOne more thing. The show isn't even that funny. \\n\r\nWhen I saw the synopsis, before watching the PV, I figured it may turn out to be another genius romcom like Noucome. I was wrong. Horribly. \\n\r\nThis is partially, or I should say, mainly, a romantic comedy. It's neither romantic nor comedic. It tries but it fails. \\n\\n\r\nWell, my friends, the Spring season is over. Some shows are notable, and some are not. This show is the latter. While I have to mention, though, I did love several of the series this Spring and I cannot wait for the summer simulcasts to begin. \\n\\n\r\nHave a good day. May the harem gods rain mercy down upon your soul, for after watching this show, you're certainly going to need it.",
            "date": "2014-06-30T09:44:00+00:00",
            "helpful_count": 80,
            "mal_id": 149577,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3671701.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hime-In-A-Box",
                "username": "Hime-In-A-Box"
            },
            "url": "https://myanimelist.net/reviews.php?id=149577"
        },
        {
            "content": "I've got to say, I noticed quite a few people bashing \"Kanojo ga Flasg wo Oraretara\" and I must say I truly believe it's not that bad of an anime. I actually really enjoyed this anime, and it was a great harem in my opinion, ^_^.\r\nTruthfully, I thought this show was going to be one of those happy-going anime with everybody always having a great time, smiling, enjoying life to the fullest, although I must say I was really surprised with how this anime was executed. Make sure to notice how I say \"surprised\" because I believe this is the reason people are bashing thisshow. It's actually much more dark than you'd believe and the story is actually pretty interesting. When I first saw this anime, I thought it was going to be about some kid who makes flags for a school club or something lol.. It's actually about a teenager who has an ability to see flags on other people's heads regarding various things such as a \"love flag\" where he can tell that she's falling in love with him. Or perhaps a \"trusting flag\" or something along those lines :P. The story actually gets pretty in-depth later on as the anime progresses, and as the story slowly progresses he has a great time with his harem\\n\\n\r\nNow, the art was a huge let down to lots of people. I see plenty of people complaining about the art all the time.. I personally didn't really notice anything but I am not that picky. I thought the drawings were cute and it was fine in my opinion. I enjoyed the art, I thought it wasn't that bad.\\n\\n\r\nThe sound was pretty good actually. The opening was another factor that led me to believe this was one of those plot-less happy go going anime haha. I found the OP to be a little annoying at the beginning, but for some strange reason it grew on me and I love it now LOL. (yes I'm a guy)\\n\\n\r\nThe characters were probably my favorite part, each really unique for his special harem. All the girls are different so you'll love some and hate some & there's sooooooooo many girls it's hard not to like one. For the most part they're all cute in their own way and you get to know each one better with each episode. I surprisingly really liked the MC, he's pretty sick. He goes through a lot of traumatic experiences and seems somewhat depressed, although has a cool attitude and has all the girls fall for him easily!\\n\\n\r\nI enjoyed this series a lot. I see plenty of people saying they didn't but I did! so make sure to give it a try just in case you're like me ;) \\n\\n\r\nOverall, the show is a nice mixture of genres & leaves you wanting more. Near the end of the show it gains the genre of action for the last 2 episodes, but I liked it tbh since I'm an action fan as well haha, it fits the plot holes pretty nice as well.",
            "date": "2014-06-29T20:12:00+00:00",
            "helpful_count": 27,
            "mal_id": 149447,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3880295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/crew7",
                "username": "crew7"
            },
            "url": "https://myanimelist.net/reviews.php?id=149447"
        },
        {
            "content": "*Minor spoilers, but not really* /UPDATED 7-1-14/\r\nWhere do I start. This anime had a lot of potential with an interesting unraveling plot. But it just dragged on and had annoying moments.   \r\nStory: 5/10- The main reason I started watching this anime was because of the Synopsis I read. I thought \"oh cool, this sounds different!\" And it started off pretty nicely. But I am not a fan of Harem, so this probably why I gave it a six. I love the underlining plot with Souta, the protagonist. I find his character interesting. He has a tragic past & not only that, he seespeople's \"flags.\" But it's a curse. While trying to get by in school, he's also faced with a ton of girls that I wish had a more common sense. The only one that seems to be the opposite of the other girls is Nanami. I'm sorry, but the girls he lives with are annoying and always trying to flirt with him. It takes the seriousness away from the actual storyline. The main plot is definitely a win in my book if it weren't for the unnecessary scenes they have. But hey, the girls are devoted to him in sweet ways, so that's a plus and they were willing to do anything for him\\n\\n\r\nLet me talk about the last episode & more (spoiler free) It's a complicated plot especially towards the end. Somethings don't make 100% sense to where you have a relief to be like \"OHH that makes sense.\" I feel like this anime was trying to do too many things at once. Comedy was mediocre and they really go heavy on the harem element of this. While they were trying to have funny moments, they also tried to splash a little depression your way! Not saying that's a bad thing. I love dark animes, but they did it in a way were it was kind of a turn off. If you don't pay close attention to every part, you'll be left confused. I know I'm not confident even to say I know what exactly happened. The ending was just like a \"wtf just happened\" type of feel.\\n\\n\r\nEpisode 13 didn't make a whole lot of sense to me. Whether it was the random fighting or Nanami realizing who she actually was the episode before. I dunno. But Souta did realize something important at the end, so that was a bonus. But like I said, I think they were trying too much at one time. So somethings probably weren't as implied as other parts were.\\n\\n\r\nFrom what I hear from all sources, that the manga is better in ways of explaining and has better development. Hope that's true. \\n\\n\r\nArt: 5/10- Character designs are tacky and the animation isn't that great \\n\\n\r\nSound: 5/10: I'm not usually picky on OPs & EDs. I almost 9/10 love them. But in this anime, I disliked them very much. It's cute, but it's just not my style. These types of things are usually a hit or a miss for anime fans. And this one was just a miss for me >.>  \\n\\n\r\nCharacter: 5/10- When starting off with the two main protagonists; Nanami & Souta, you think \"this will be good.\" And as the story progresses you get a sense for how Souta is feeling despite the smile he fakes. Which is something most of us can understand. I actually really love Souta's character. In the beginning he's kind of a jerk, but then you find out his reasons. And then a group of girls slowly, but surely changes his heart. With his stone-cold exterior changing, you realize he's a complex character. Once you think you know him, the story just twists it up and gives you a completely different perspective. You begin to question literally EVERYTHING you have been watching every week. That's what I like about this anime. \\n\\n\r\nSome of the emotions the characters are feeling seem pretty relate-able. And other times it's just \"not even close to realistic.\"  This anime really does fall flat for character development though. They did a decent job on Souta & Nanami, for the most part. but they too do have character flaws. But for the others, it was just maybe, if they were lucky, a few minutes of their past. Some of them were a little more in depth while others failed to have that chance.\\n\\n\r\nI really do understand that when creating anime, they do have a budget. But you have to be willing to spend a little more to get A LOT more. I feel like this anime could have been something great if more time was put into it. I honestly felt like everything was too rushed and left with so many questions. \\n\\n\r\nEnjoyment: 5/10- I started out loving it but as it progressed I was a little ify about it. I honestly thought I as going to be in love with this anime because of my first impression. I was sadly let down. There are so many characters being introduced left and right, that it's hard keeping up. I feel as if they are just kind of there, not really doing much besides trying to get with Souta every ten seconds. Though their love for him is sweet & all, it's just annoying at times. \\n\\n\r\nI am not the fan of Harem, so this probably why I think it is annoying. But I honestly think that girls throwing themselves at a boy who doesn't really pay attention to them is kind of childish. Now being a sister figure is different. you love him in a family way, not a \"I want your kids someday\" way. \\n\\n\r\nI think I would have enjoyed this anime a lot more if they focused just a little more on the underlining plot rather than pointless scenes that don't end up getting remembered by the time you finish the anime. Kanojo had an interesting storyline. I liked it a lot. Souta was a VERY important part in doing the things that needed to be done. But it wasn't as enjoyable as I would have hoped. \\n\\n\r\nOverall: 5/10- It had awesome parts(I guess?), but it's just not my cup of tea. Despite everything, if you can get past the girls I wanna slap sometimes and just pay attention to the unraveling plot, you might like it? Not saying everyone will, but it could happen. \\n",
            "date": "2014-06-25T14:35:00+00:00",
            "helpful_count": 26,
            "mal_id": 148573,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776165.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeZ0id",
                "username": "AnimeZ0id"
            },
            "url": "https://myanimelist.net/reviews.php?id=148573"
        },
        {
            "content": "The concept of an Event Flag should be nothing new if you’ve watched enough media.  After triggering a flag, the plot is set in a specific path. Death flags are the most common example. If a character starts talking about their family or what they’re going to do after the battle, you know they’re doomed to die.\r\nSo what if we took this concept *literally*? And then we added a harem? And then we did whatever we wanted with the plot? That, my friends, is Kanojo ga Flag.\r\nStory:\r\nKanojo ga Flag is about a generic harem lead, Souta, who can see event flags on top ofpeople’s heads. He transfers to a new school and immediately starts building a harem. Souta’s harem might as well be the harem to end all harems. It has basically every archetype: Tsundere, Airhead, Older Sister, Little Sister, Student Council President, Trap, Childhood Friend, Princess, Idol, Robot, Baby/Grandmother, Tsundere 2, and Teacher. The harem grows so fast that it becomes pointless to distinguish between the girls. They’re all obsessed with the MC for some reason and that’s really their only defining trait.\\n\\n\r\nIt managed to work well enough. When a harem gets so big and it’s clear the girls aren’t actually going to win over the MC, you stick around for the pointless harem antics. Beach episode? Sure. Beauty contest? Let’s do it. Super serious plot? Totally—wait what? Kanojo ga Flag never needed a serious plot but it decided it was going to cram it in anyway. I don’t think the plot twist is necessarily that bad; the show definitely foreshadows it. The problem comes from the amount of time the audience has to comprehend what’s even going on. It’s introduced very quickly and you pretty much just have to roll with it and watch in confusion or look up an explanation. An additional episode might’ve helped solve the problem.\\n\\n\r\nCharacters:\\n\\n\r\nThere’s nothing interesting about any of the characters. The MC always has a bored look on his face that makes you wonder why any of the girls are so interested in him. The best I can say about the rest of the harem is that they exist. They fulfill their roles in their respective archetypes and in the greater plot, but otherwise there is nothing unique or memorable about any of them. If you’ve seen an anime before then you’ve seen this cast.\\n\\n\r\nSound:\\n\\n\r\nThe voice acting was pretty good overall. Of particular note is Nanami’s voice actress, who was only 17 when the show aired. I think she did a good job for someone so young and just getting into the industry. Akane, the airhead, easily has the most annoying voice in the show. She also finishes each of her sentences with “desu” because she’s cute and I personally find it more frustratingly annoying than anything else. There’s no real standout performances among the rest of the cast, though Kana Hanazawa playing a trap was pretty fun.\\n\\n\r\nThe OP and ED were passable. “Nothing special” is the key to Kanojo ga Flag. The same goes for the OST: it did its job well enough while I was watching the show but there’s nothing about it that particularly stuck with me.\\n\\n\r\nArt and Animation:\\n\\n\r\nThe elephant in the room is Kanojo ga Flag’s art style. The girls are drawn in a way that make them look several years younger than they actually are. Look at any promotional art for the show including the picture on MAL and you’d probably conclude that they’re (mostly) all elementary school students. Admittedly, it looks a bit better when it’s animated. By the end I didn’t mind it too much. The rest of the art is colorful and fits the mood of the show. When the show goes full seriousness, the art gets darker along with it. There were no significant distracting art errors.\\n\\n\r\nThe animation gets the job done. There are no huge quality issues or outstanding animation sequences. This is a harem anime for the most part. It doesn’t need to do anything great so I can’t really demand too much out of it.\\n\\n\r\nEnjoyment:\\n\\n\r\nKanojo ga Flag is not *good*. It is a train wreck in every sense of the phrase. But it is a beautiful, entertaining train wreck. The show is incredibly fast paced and it does a good job at keeping the audience engaged. It’s so stupid and ridiculous that you can’t help but keep watching. I had fun watching the show from beginning to end and honestly that’s the most important part to me.\\n\\n\r\nConclusion:\\n\\n\r\nKanojo ga Flag wo Oraretara will never win any awards for anything. The plot is a mess, the characters are uninteresting, the sound is decent, and the art/animation is bad to ok. BUT I had fun watching it. If you don’t take it too seriously then I think you can have some fun with it.\\n\\n\r\n5/10",
            "date": "2015-09-04T00:36:00+00:00",
            "helpful_count": 18,
            "mal_id": 197775,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2163743.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/dertswa687o",
                "username": "dertswa687o"
            },
            "url": "https://myanimelist.net/reviews.php?id=197775"
        },
        {
            "content": "Last episode was so-so, but it was a okay conclusion for this anime. After that I decided to write this little review of this anime.\r\nStory: As for story. The story started out great, we get some idea that this main protagonest can see flags of peoples ''goals/fates'', which he then can manipulate and then change the goals/fates. I could see the potential in this anime. But then it went down. All the way down to the point, that i would almost compare this anime with many other pathetic animes. \r\nI didn't like how the anime turned down to and how the pacing was. I expectedthis anime to revolve into the genres comedy, school, romance and harem. Since the genres for this anime are those genres. I thought this anime to be a light-hearted one with good romance comedy of course with some harem. But it totally forgets most of these genre, except the harem genre of course.\\n\\n\r\nAt the end of the story, it turned into something dark, serious and something that looks like from a fantasy/sci-fi. It was a complete mess and made the story really confusing and dreadful. \\n\\n\r\nMost of the characters of the Souta's harem were bland, uninteresting and 1-dimensional, Only meaningful characters of all of them, were actually Nanami and Souta himself for the story to progress. And even those 2 weren't that interesting. The rest of the girls were just a part of Souta's harem. They were only helpful at the 2 last episodes. Most of these girl were actually also forgetable, sometimes I ask myself. Who was this girl right now? Ah i see, that's her, which means for me, they don't actually play a role in this anime at all. Just a part of Souta's harem and nothing more.\\n\\n\r\nArt was poor/decent at best, nothing really special about it. What i noticed in the art, they made something, that shouldn't be a part of the background, but they did it. Which I actually found it very annoying.\\n\\n\r\nSound was decent, i guess. I found the opening song okay catchy, but it's forgetable. The opening song made some huge dissapointing expectation of this series, since it was lightwarming and was perfectly fine with it's genres. As i said above, that i thought this anime would be a lightwarming romance comedy with some harem added over to make some good and funny moments, but then it ended out to be something dark and serious, which was quite surprising in a bad way.\\n\\n\r\nAs said this anime actually had potential, the first episode showed that. It could have been a good series. But ended out to be a very dissapointing one. Overall I would give it 2/10, but right now i'm quite generous, since I did enjoyed the anime, just a little bit. It had potential to be a good series, since first episode was quite good. So i would say 3/10 from me.",
            "date": "2014-06-30T04:57:00+00:00",
            "helpful_count": 14,
            "mal_id": 149539,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3725553.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Sdragohn",
                "username": "Sdragohn"
            },
            "url": "https://myanimelist.net/reviews.php?id=149539"
        },
        {
            "content": "I haven't written many reviews, but I will do my best and probably won't write to much.  (minor spoilers)\r\nStory :5\r\nAt first seemed interesting. This boy Souta has the power to see flags, and also the power to break them. Somehow he can change fate by doing so. Then a lot of girls appear, as expected harem route. However things get a bit serious when we find out that he has some sort of curse. This serious part of the story was pushed into the plot in a not very good way. It ended up as appearing to forced and confusing, at least to me.\\n\r\nArt : 8\\n\r\nIt was good, can't really complain.\\n\r\nCharacter : 6\\n\r\nSome interesting characters, but overall the same as usual.\\n\r\nEnjoyment: 5\\n\r\nLaughed a bit but in the end just forced to watch how would it end.\\n\r\nOverall: 5\\n\r\nIt wasn't terrible but, seem much better. Didn't care to much, don't regret watching it but definitely not watching again. Feel free to try it if you want, but I believe there are better stuff to watch.",
            "date": "2014-07-02T16:25:00+00:00",
            "helpful_count": 13,
            "mal_id": 150053,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332625.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/vashthedrawer",
                "username": "vashthedrawer"
            },
            "url": "https://myanimelist.net/reviews.php?id=150053"
        },
        {
            "content": "Harems are a very debated genre of anime.  Some people like them, some people don't.  For this season of Spring 2014, the harem anime Kanojo ga Flag wo Oraretara, or \"If her flag breaks\".  \r\nStory (5.88/10):  The story of \"If her flag breaks\" revolves around the life of our main protagonist, Hatate Souta, a boy who has the mysterious power of seeing \"flags\" on top of people's heads.  (They are literally small flags.)  Haunted by his past, Souta meets a girl by the name of Nanami, a girl of whom he tells his power to, eventually meeting other girlsalong the way as they live in a dormitory called quest dormitory, as well as haunted by the idea of trying to find \"the secret of the world!\"\\n\\n\r\nFrom this synopsis, a few obvious points come out.  For one thing, the genre of harem becomes quite obvious, as well as the possibility of quite a few ecchi moments spawning from it overall.  Both of these points are quite prominent in the anime and take up a good majority of the show.  All of that is good and fine, as many harem shows have that sort of formula that quite a few number of people tolerate, but there are things, many things about this show that just make it so flawed.\\n\\n\r\nFor one thing, the plot.  As an idea for a show, Kanojo ga flag has actually a decent plot idea.  The entire lore that the show has is actually interesting enough to make a show out of.  But what made it bad, was the way it was executed.  For starters, the first ten or so episodes follow a character introduction format, where in every episode, a new character is shown and explored, then put away into supporting role obscurity, or, a side story-esque plot line, that doesn't impact the show greatly in any way.  THis is one of the show's greatest flaws.  Because of the fact that the show does this sort of plot line for a good majority of the show, the rest of the time used for the story is used in this sort of rushed format that was really, really confusing.  (Like honestly.  You start with a show about flags, it ends up becoming the Matrix somehow.)  \\n\\n\r\nWhat also was a major flaw was the lack of explanation.  From the beginning of the show, some obvious mysteries are given to the audience like, who is that girl?  What is the secret of the world?\\n\r\nThat's all fine and good, as good mysteries encourage the audience to watch the show, except when you don't explain anything period.  As the show went on, more and more questions were being shown to me, and I just had a hard time keeping up with what was happening in the story overall.  Aside from that, the anime changes mood very quickly, from one minute being happy and cheerful, to a dark and foreboding tone, all in the same episode and all without any gradual change, as it all felt very sudden and provided even more confusion.\\n\\n\r\nIn terms of pacing, the show had a heavily uneven pacing along with it.  The ending of the show felt really rushed, and the beginning 3/4 of the show felt really slow.  Overall, it wasn't a very good experience to watch, as the show didn't feel very balanced in terms of explaining stuff.\\n\\n\r\nOverall, Kanojo ga flag was a mess.  While the story idea was a decent one that could make for an interesting action experience, the actual execution of the show was terrible, as the show tried to fit too much of its plot in 13 episodes.  If it was given more time, then the show may have done better, but for what we were given, the show didn't do a good job at conveying its story as properly as it may have wanted to.  \\n\\n\r\nOverview:\\n\r\n+  Good base story idea\\n\r\n-   Uneven pacing\\n\r\n-   Rushed ending\\n\r\n-   Mostly episodic format in a story driven story\\n\\n\r\nCharacters (6.39/10):  In a general harem, a total of 3-5 girls is what you would normally see in terms of the amount of girls you would see surrounding the main character.  This anime, has 12.  \\n\\n\r\nHatate Souta, our main protagonist.  in terms of what you would normally see in harem anime, Souta is actually a rather interesting protagonist, as it becomes very clear that he is affected by the events that occurred before and during the point in time the show takes.  As time goes on, you can see his character become a little more developed than when you see him initially.  Personally, I find him to be more of a character and more of a person as he clearly shows emotion in the show.  \\n\\n\r\nNanami Bladefield, the main female protagonist of the show.  Compared to the rest of the females of the show, nanami is a more developed character, as her role next to Souta becomes more and more prominent as the story goes on.  Apart from that, Nanami has a more complex character, as you can see her personality and reactions to certain situations and people differ depending on what is happening at that moment in time.  Personally, she is a more far more interesting character than a great deal of other characters in the series.\\n\\n\r\nApart from these two, we have a massive, massive amount of females from all sorts of different cliches.  (Big chested rich girl, the little sister, the older sister, the idol, the bishonen, the childhood friend, the school president, the annoying one who repeats her last statement, I could go on and on.)  To me, none of them have a great deal of significance to the story, as really, a great deal of them were added one by one as the series went on, each of them becoming less significant and earning less screen time as the next one came into play.  For me, these characters didn't add too much significance to the story other than just eating up screen time and making the plot more confusing than it was initially.  \\n\\n\r\nOverview:\\n\r\n+  Decent main characters\\n\r\n-   Excessive supporting cast with little to no significance\\n\r\n-   Pointless character introductions towards the end of the series.\\n\\n\r\nArt and sound (7.21 and 7.01/10):  The art of this series is actually decently well done.  The characters, while looking quite moe, do look very well done and are actually quite well designed in my opinion.  The art style is quite bright in terms of color and the backgrounds are quite well done.  Everything is quite detailed and it actually looks rather nice.\\n\\n\r\nIn terms of fanservice, there's not actually very much in terms of what you would see in terms of normal fanservice, which I find to be a nice surprise, as a lot of the times, harem animes are associated with fanservice.  Sure there are some, but it wasn't enough to completely turn me away and dub this an ecchi show.\\n\\n\r\nFor music, well, it's not bad.  The actually opening of the song is rather whimsical and somewhat childish, which I found to be an interesting surprise.  I'm not really a big fan of it, but it wasn't a bad song at all.  The ending, well, it's quite generic in comparison.  There's nothing really fantastic in terms of how it was composed, but it's not terrible to say the least.\\n\\n\r\nOverview:\\n\r\n+  Nice moe style art\\n\r\n+/-  Interesting opening\\n\r\n+/-  Generic ending song\\n\\n\r\nPersonal Enjoyment (7.10/10):  Harem anime are a favorite genre of mine, so finding new harem anime is always a nice experience.  For Kanojo ga flag, well...I'm a bit impartial.  There were several aspects I liked, specifically, the way that the anime itself set itself up at the beginning.  But, as the series went on, more and more questions popped up in my head.  \\n\\n\r\nDid I enjoy it?  \\n\r\nWell, to a certain extent, yes I did.  The show had some interesting comedy moments for itself and it was quite interesting to see this show's version of comedy.  However, the fact remains that the execution of the show was quite terrible, and the fact that nothing of significance in the story was explained, the show just didn't give me enough to like about it.  While the show had some potential for it, it just didn't deliver.  \\n\\n\r\nOverall Score: (6.32/10)",
            "date": "2014-06-29T19:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 149439,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=149439"
        },
        {
            "content": "(SPOILERS INCLUDED)\r\nDescent anime. The storyline is not that hard to follow and everything gets explained so it doesn't leave us with an open ending. Characters that grow to us (hopefully right English xD). Very gloomy protagonist (which I personally love).\r\nNow there are also a few things that annoy me about this anime. First of all it gets really annoying to watch Nanami hitting and kicking Souta for every little thing she doesn't like.\r\nSecond thing is that the androgynous guy (trap) Megu acts all female and seems happy with it yet demands to be a manly man which does not make any sense. Just let theguy be a femboy and stop bullshitting about him wanting to be recognized as a manly man...\\n\\n\r\nSomething else that bothers me in the show that there are way too many underdeveloped characters. And when we think we are getting to know a character, another one suddely appears and forces us to get to know that person too.\\n\\n\r\nThe last thing that bothered me was that in the end with the fight, all of a sudden their teacher joined their battle. Why she suddenly knows all about what happened gets never explained... The other characters have a history with Souta, but yet this teacher comes out of nowhere and wants to protect Souta too suddenly...\\n\\n\r\nConclusion is that the anime is fun to watch and the characters are very sweet but the characters are underdeveloped and sometimes annoying when they don't have to be.",
            "date": "2016-08-09T09:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 226325,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4410579.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/x666x999x",
                "username": "x666x999x"
            },
            "url": "https://myanimelist.net/reviews.php?id=226325"
        },
        {
            "content": "Here we have a harem that actually tries to do something different with its genre.  The story is full of twists, which is unusual for the average bland episodic style that most harems suffer from.  Sometimes, however, the story suffers from  a bland execution.  I got the feeling that the show was trying to generate more emotion than it actually managed to, especially during the last few episodes.  The characters aren't anything special, the art style is mediocre at best, and the soundtrack could have been better, but the overall package is something I consider as new.  While itisn't too different from the generic harem formula (until the end), I hope it opens the door for more innovation to an otherwise boring genre.",
            "date": "2014-07-01T11:13:00+00:00",
            "helpful_count": 6,
            "mal_id": 149811,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3358011.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/spreen",
                "username": "spreen"
            },
            "url": "https://myanimelist.net/reviews.php?id=149811"
        },
        {
            "content": "[Three points before I begin: 1; I'm sorry for the length, sometimes I tend to ramble. I do a TL:DR at the very bottom for a small conclusion. 2. There will be minor spoilers, I will try to review this with the least amount as possible. 3.This is just my opinion, feel free to disagree or agree. But remember, this is just one man's opinion and the scores go by MAL standards, 7/10 is a C, which means average]\r\nThis is one of the worst animes I have seen. Sure, it is competent enough on a good amount of points, it ain't no Garzey's wing orMars of Destruction. But on the other hand, this anime flops so many times I'm surprised it survived it's own death flag.\\n\\n\r\nStory: So our MC can see Flags! That is a perfectly fine premise. Sort of like in Noucome, where the protagonist can see different choices like in Visual Novels. But in Kanojo Flag, instead of this being a random curse, he was given this curse by a loli magician, who he lost in chess. He must now muster a group of girls who represent different fantasy RPG classes and in doing so take the red pill and WTF is going on? No seriously, this anime is split into two halves. Harmless harem romcom and the third matrix movie. Plus, it is introduced to us a couple episodes later with no explanation. What explanation we get, is even more confusing than before. 3/10\\n\\n\r\nCharacters: If I can give this anime any accolades, it does pull off a good 7+ girl harem. SEVEN+ GIRL HAREM. We got, the Classic Tsundere, Modern Tsundere, Oneechan, the Imouto, the Trap, the Ojou-sama, The Childhood Friend,  the Tomboy/Genki Girl, Yandere, the foreign girl. There is every harem stereotype there is in this anime...and that is the problem, they are all stereotypes. Take any trope for one of these stereotypes, for example: The Tomboy wanting to be more girlish? Check. Childhood friends meeting each other after 5+ years? Check. That is the problem with all of these girls. They are so cuttout and cardboard you don't even have to recycle. Compost them. Sure you get some molding, for example: The Foreign girl is also the tsundere ect. But we have seen that before (Hidan no Aria for example). That is the problem, we have seen ALL of this before. Quantity doesn't always mean quality. \\n\\n\r\nNow, the main character... So you know that anime OreGairu/ Teen RomCom SNAFU? How that main character tries to avoid people and responsibility because he is a nihilist and makes himself the enemy because he sees that the community around him needs one and he gets no accolades by anyone? WELL F*** THAT NOISE. This guy gets a majority of his harem by trying to not make flags, he flags them anyway. At the start he is pretty unlikable. At the end...he is ok I guess, but he does nothing. 3/10\\n\\n\r\nArt: The art is fine. If I can give Hoods Entertainment anything it is that their art is pretty good. The only thing about this anime being done by hoods, it is probably the worst art done by Hoods. At least animes like Fantasista Dolls had good action art. The best art in this anime is probably the death flags and a horse....a very very majestic horse. 6/10\\n\\n\r\nSound: The VA's do their work well, and each have their own voices, even the characters who only appear for one episode, they are all noticeable and well done. I do like the OP but the ED I could do without. 6/10\\n\\n\r\nEnjoyment: Now I do admit, the first couple episodes were enjoyable. The anime did do some new things we don't see in harem animes. (ex:The Childhood friend character is still in contact with the MC via texting), Hanakana's character has some good quirks and a pretty funny running gag punchline. But that is about it. When the anime introduces the fantasy elements, it makes no sense whatsoever. Many a'time I was almost yelling at my computer saying \"EXPLAIN ANIME....EXPLAIN\", and when it does....it doesn't help. It then goes all \"TAKE THE RED PILL\" and spirals even deeper down the Death Flag Spiral. 3/10\\n\\n\r\nOverall:\\n\\n\r\nWhile this anime at first does seem like a nice harem anime, it is brickwalled by confusing and unexplained plot elements and the most, THE MOST cardboard of cardboard harem characters with a pretty unlikable MC.",
            "date": "2014-07-06T19:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 150773,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/248217.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/P_D_S",
                "username": "P_D_S"
            },
            "url": "https://myanimelist.net/reviews.php?id=150773"
        },
        {
            "content": "This anime has serious issues with tone.  It takes a stock harem comedy and tries to make a more serious story in the last few episodes.  Thus it deserves some points for originality (harem comedies don't usually try to explain *why* all these girls are attracted to the same guy).  But because the actual storyline is so compacted into the last few episodes and is rather convoluted anyway, it can be seriously confusing.  Watch it for the comedy, not the storyline.",
            "date": "2014-06-29T21:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 149475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3665575.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/sayas_chevalier",
                "username": "sayas_chevalier"
            },
            "url": "https://myanimelist.net/reviews.php?id=149475"
        },
        {
            "content": "Objectively, this anime was horrible. Every character was a trope, the plot didn't know what it wanted to do, and it was cliched to kingdom come; That being said I honestly really enjoyed this, bad Harem Rom-Coms are sort of my guilty pleasure and I can't help but like it. Every arc in the story was honestly just: encounter problem, look for solution, OooooOO plot twist, find solution; sometimes the plot twist causes the problem but that's only once or twice. And yet no matter how bad I know it is, I still love it. This last bit probably seemed kinda ramble-y but that's justbecause I finished what I had to say like 4 sentences ago but I had to make it longer",
            "date": "2017-10-17T06:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 261015,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6352348.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/chichi2000fgh",
                "username": "chichi2000fgh"
            },
            "url": "https://myanimelist.net/reviews.php?id=261015"
        },
        {
            "content": "A good series to watch after a gruesome gore anime. A lot doesn't make sense but it's alright. Not really a fan of Harems tho. \r\nVery nice and unique idea about the \"flags\" for future events such as \"death flag,\" \"friendship flag,\" and \"romance flag.\r\nStory 5/10: Like I said lots of stuff doesn't make sense, but then again that's anime for ya.\r\nArt: 7/10: it has very kawaii art, especially in the opening and ending.\r\nEnjoyment 7/10: It's very pleasant to watch, it doesn't feel like my time is wasted. Comedy was on point.\r\nSound 8/10: Very well done, the sounds are phenomenal. The ending was better thanthe opening.\\n\\n\r\nDislikes: too much harem, lack of story.\\n\\n\\n",
            "date": "2016-11-17T14:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 233915,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5583054.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Christian_A",
                "username": "Christian_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=233915"
        },
        {
            "content": "I will be honest with you all. Unless you are bored and have nothing better to watch don't watch this.\r\nNow lets begin~!\r\n---Story--- \r\nScore: 8\r\nThe story follows a boy named Souta who has the ability to see flags above someones head that allows him to see what they are like or if they might die soon. I find this story rather orginal and a good watch if it was done correctly. The story is also rushed near the end skipping 2 characters and their developement. It is quite noticeable and is quite annoying.\r\n---Art---\r\nScore: 6\r\nThe art is nice but not fantastic. It is your average art thathas nothing really special to it.\\n\\n\r\n---Sound---\\n\r\nScore: 5\\n\\n\r\nThe sound is nothing special just like the art. The opening and ending are quite nice but nothing that really will stay in your head are will make you start to hum to it randomly.\\n\\n\r\n---Characters---\\n\r\nScore: 5\\n\\n\r\nThe charcters are generic. The main protagonist is Souta a boy with a special abilty to see flags that let him know what they are like or what will happen to them soon. His design is nothing sleek or fancy just your normal tall skinny teenager with black hair. Well for the other characters they is one most likely to your liking. There is a range of different cools from the Big Sister type to the girl who is the main protagonist Childhood Friend.\\n\\n\r\n---Enjoyment---\\n\r\nScore: 7\\n\\n\r\nIf you are like me you will follow a anime to the end if you are enjoying it for its entertainment. This show is just one of the shows that had good enough comedy and story to keep me til the end to see what happens but its nothing fantastic.\\n\\n\r\nI hope this was of any help to you otaku anime watchers.",
            "date": "2014-06-29T18:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 149433,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2843773.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Oixo",
                "username": "Oixo"
            },
            "url": "https://myanimelist.net/reviews.php?id=149433"
        },
        {
            "content": "Not your typical harem, but a harem nonetheless. \r\nWhat really caught my interest when deciding to watch this series was the concept of the whole \"Death Flag\", \"Love Flag\" and etc. But, as you dive into the series, it kinda deviates from that concept at times, and becomes a bit inconsistent. At some points, I was actually wondering when the concept was going to present itself again. What was a good concept was detailed and presented very choppily.\r\nThis series definitely had its ups, and its downs. I feel as if it was struggling to find its identity. Yes, as you begin the series it isdefinitely you typical harem. Especially when you realize how many beautiful girls actually surround the MC. But, unlike most harems where the underlying story/plot isn't really built upon, this series tilts back and forth between harem and the story/plot. Definitely something that I was not expecting. The fact that it also goes into the details of why the girls are drawn to the MC and all the situations causing such does separate it from traditional harem. One instant you are in this cutesy moment or you go through 20 minutes of romance and comedy. But suddenly, BANG! You're hit with some seriousness and they try to build upon the story. Though it is a refreshing idea, it doesn't quite pan out smoothly.\\n\\n\r\nThe art/animation of the series is decent. The girls are all unique, but the style itself isn't all that tremendous. Certainly not bad. But certainly not the greatest. The sound  was good, as the music really does convey to the emotions being shown in the particular moment. the music does in fact set the tone/mood of the episode itself. Again, going back to the being cutesy/comedic one moment, then being serious the next.\\n\\n\r\nThe characters are decent. They are developed fairly well. Although I will tell ya it was difficult to keep track of names. The series does give you the back story as to why they are drawn to the MC which is highly unique IMO. Also, each girl is given their own characteristics. They aren't all the same, just given different eye and hair color. They have unique personalities and are all different from one another. \\n\\n\r\nOverall, worth a watch if you are looking for something to fill some time with.",
            "date": "2014-07-03T23:16:00+00:00",
            "helpful_count": 4,
            "mal_id": 150265,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3093261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DatDamnPR",
                "username": "DatDamnPR"
            },
            "url": "https://myanimelist.net/reviews.php?id=150265"
        },
        {
            "content": "Kanojo ga Flag so Oraretara is about Hatate Souta and his ability to see various flags. (If you play visual novels its an event that triggers the story to turn in a certain direction.)  As original as the story sounds its execution of it was awful. To begin the plot was basically slowly figuring out stuff about these flags, then it went with this crazy ending that had little to no foreshadowing. Now I like major plot twists like TWGOK manga ending, this was more like how could I have predicted this. Plot twists should be able to predicted, but at the same timeyou don't.\\n\\n\\n\r\nThe next problem with the show is the characters. Basically everyone was pretty two dimensional. Every could fall into generic character types. Like little sister, big sister,  tsundere childhood friends, and that trap that wants to be manly. The harem itself was boring since characters fell for him for almost no good reason. Its worse than the whole he was nice to me reason. They just kinda fell for him.\\n\\n\r\nArtwork was good, and I liked the colors. This show also has a more prominent art style, though it looks like the artist used anime as reference when drawing them instead of real people, which is like in school how teachers copy copies, and the handout you get is all fuzzy and kinda tough to read.\\n\\n\r\nThe opening was okay. Because there was no character development, or relationship development they couldn't sing about that. So the only thing they could sing about the concept of the show; Flags breaking. Yeah the song was upbeat and cutesy but the it didn't make me connect with it. Openings should have some relation to the shows focus. This shoe didn't really have a true focus besides flags causing the song to fail.\\n\\n\r\nOverall I did enjoy the show since I watched it all, however I only watched it cause I had nothing better to do and I'm not being tsundere. The show itself is a good way to past the time, and nothing more. Though watching it can be painful at times not because of drama, more because of how lame some of the flags are.",
            "date": "2014-07-30T07:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 154441,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3658019.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GoodLuck",
                "username": "GoodLuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=154441"
        },
        {
            "content": "As harem anime go, Kanojo ga Flag wo Oraretara had a good bit of potential.  The story tugs at your heartstrings without being a constant flow of tears, and has a nice chunk of comedy.  None of the girls were truly \"hate-able\" (in my opinion, yours may vary), and each had a different kind of love for the main character, whether it was romantic, sisterly, friendly, or even parental.  The MC is actually able to recognize all of their affections for exactly what they are (since he can see their flags) and has an understandable reason for turning away from any advances,which is explained a few episodes in.\\n\\n\r\nUnfortunately, the biggest issue with this series is how rushed it is.  With a whopping 11 girls (and 1 \"trap\") and only 13 episodes, there is very little time for character development or any big attachments to any of them.  Typically, one or two are introduced each episode, a bit of time is given for why they get attached to the MC, and then they are pushed off to side roles as the next is pushed in.  Megumu (the \"trap\") in particular gets basically no screen time by halfway through, except for throw-in gags two or three times per episode where everyone forgets, yet again, that he is a guy.\\n\\n\r\nThe finale of the show, sadly, managed to knock my rating down a point or two on its own.  While there was a decent amount of foreshadowing throughout the series, the finale itself came suddenly enough to be jarring, and rushed through explanations as to what was happening and how.  With zero build-up, this light-and-dark mix harem anime attempted to turn into action show, and sadly didn't do it very well.\\n\\n\r\nWhile I enjoyed most of the ride, at the end I felt confused and a bit cheated.  This is one of the few harem anime I can confidently say would been made better by going on longer.",
            "date": "2016-05-31T09:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 219707,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DazzAntoni",
                "username": "DazzAntoni"
            },
            "url": "https://myanimelist.net/reviews.php?id=219707"
        },
        {
            "content": "The idea and setting of this anime was really promising, and then.. everything went downhill. \r\nStory: The story is about a boy who could tell how people really felt inside or could even tell the future by looking at the 'flag' on top of their heads. The story has so much potential for development if they had just focused more on the different flags and given the characters a bit more personality and depth.\r\nI felt that that harem component was a bit overboard, it doesn't take very long for some new random girl to fall in love with the protagonist. But that's not the worstpart. It's how the whole school can just watch as Souta-kun gets all the attention like he's the star and the most important person in the world that doesn't seem very natural. Then again, 'flags' are somewhat related to gaming and in a game, you are the star regardless of who you are.\\n\r\nIn a nutshell, the way the anime progressed left me seriously confused, let's just say it seemed like they were taking a lot of different themes and mixing it up together into a really interesting concoction of a show trying too hard to  end with a good twist. \\n\\n\r\nCharacter : \\n\r\nThe girls were really cute and each had their own personalities. But instead of building upon the existing characters and allowing them to be fleshed out, a new character was added almost every episode. None of the characters were really memorable or unique to me, except for maybe the 'elder'. \\n\\n\r\nOverall:\\n\r\nIt's good that it's only a 13 episode anime. I strangely wanted to know the end of the story even though it was getting pretty confusing and even boring after a while. Souta is a pretty good guy with hardly any lewd thoughts or ulterior motives. He just wants his friends to be happy and takes care of them. Guess the only thought I have after watching this show is, \"Lucky guy\".",
            "date": "2014-07-16T06:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 152291,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3770987.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hoshi14",
                "username": "Hoshi14"
            },
            "url": "https://myanimelist.net/reviews.php?id=152291"
        },
        {
            "content": "Kanojo ga Flag wo Oraretara, \"If her Flag Breaks\", is looked upon as the most time wasting anime of spring 2014. And trust me, I do understand why. However, for some reason, this was one of the animes that I enjoyed the most. I want to explain why, so, here's a review of someone who actually liked this so called flop.\r\nThe novel is the most known work by it's creator, Takei Touka, and has received a couple of manga adaptions. However, that doesn't mean that it's well-known. I must say that I'm surprised it actually got an anime adaption, but I'm sure they had somethingin mind. And I'm happy I got to know this story.\\n\\n\r\nThe story starts of like any harem comedy, which is probably why some people can't stand it. Other than our protagonist's strange power, it doesn't have any other special treats. The thing about flags is a quite original idea, and it was really entertaining even though it was pretty silly.\\n\\n\r\nHowever, we're told pretty soon that something's off, which is probably the main thing that keeps the interest. Other than that, the comedy was actually quite enjoyable, having me laugh out loud in every episode. The harem is really big, and some characters are seen less than others, but all of them have their own characteristics which makes them special in one way or another. However, they have one thing in common; they reeeaaally love Souta. This was something that could get highly annoying at some points, seeing how everyone loses their heads when they're with him.\\n\r\nThe reason I kept watching was probably since it was really funny, one of the very few animes that makes me laugh even when I'm all alone watching it. Also, I really liked some of the characters.\\n\\n\r\nIt was really late, but suddenly, the main story broke free, releasing a huge plot twist that really messes with your head. I never thought that I'd get confused while watching Gaworare, I never did. It was probably since it was so unexpected that I enjoyed it so much, but I actually do think it was quite good. The character relations were nicely handled on this point too, I was more than satisfied at the end. Although some parts of the \"serious\" story were just as silly as the rest of the show, I did enjoy it, and it raised my score a lot.\\n\\n\r\nMy favourite character was Akane, right from the start. She's by Souta's side through the whole show, and she really deserved the ending she got. Just like most characters in this show, she's really stupid whenever it comes to Souta, but she's still very charming and really cute.\\n\r\nThe most outstanding character would still be Nanami, though, the most noted heroine with a cute personality. I got really happy when her true role was revealed. This really sorted out the character relations, and she kept her important role while still being a good character.\\n\r\nThe other characters also have their roles, some being a little more noted than others. As an example I want to bring up Ruri, who I experienced being more of a witness, watching over the whole story and only making a move now and then. Her character was quite a mysterious one, which made her even more appealing even though she was a robot. This was really interesting.\\n\r\nI do have one complaint though, and that would be the old granny looking like a baby. This is one step over the line, but her aside, everyone were really nice characters.\\n\\n\r\nHatate Souta was a good protagonist, starting of as a depressing view and developing into a hero who really wants to save everyone. He does question some of the characters' actions, but he treats everyone like his friends and we know that his life would be less cheerful if everyone wasn't in it. His actions in the final scene were really touching.\\n\\n\r\nTo be honest, I do think that \"Kanojo ga Flag wo Tateru Wake\" is one of the best ending songs of spring 2014. The melody is sweet and really nice to listen to, I never skipped it while watching the anime, and I'm actually listening to it while writing this review. Also, the illustrations that were shown within those 1:30 seconds were really beautiful. The opening was cute as well, although I didn't find it as good as appealing as the ending. \\n\r\nVoice actors were nice, they fit their characters and I have no complaints. Ohsaka Ryota, Souta's VA, was a great fit. And once again, our sweet little Hanazawa Kana made a great job as the trap.\\n\\n\r\nThe character designs were really really nice, all girls (and the trap!) were cute and had different hairstyles and features. I liked all the colours that were used in this series, they were bright and cheerful, making you happy while watching. But as soon as we reach the depressing parts, the screen gets gray and dull, making us feel just as down as the character in focus. I also want to point out that the school uniform was adorable.\\n\r\nOther than that, the art was really pleasant, fitting the theme with it's infinite cuteness. \\n\r\nThe BGs were at most times very well done, I especially liked how they portrayed the sea. Blue colours were a favourite.\\n\\n\r\nWith this said, I really did enjoy this show despite it's silliness. Even though it was really stupid at times, I could still laugh at it, which is important to me. As I was able to enjoy both the comedy and the \"serious story\", I want to give this show 7.5 in score, but since decimals are a 'no-no', I'll score it with an 8. So keep this in mind; this anime was not a complete flop, since I was able to enjoy it to this extent.\\n\\n\r\n… Or maybe that just means that it really is a flop.",
            "date": "2014-07-04T12:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 150329,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2915367.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hanasanaide",
                "username": "Hanasanaide"
            },
            "url": "https://myanimelist.net/reviews.php?id=150329"
        }
    ],
    [
        {
            "content": "This anime is so bad its funny. Kanojo ga flag is your classic harem anime except the harem is about 3-4 times bigger than what should be considered normal with 10+ people involved. \r\nIts about a boy who can see flags above people's heads. You know like love flags, or death flags, and he even knows how to break them! He can save lives, he can make people fall in love with him, he can even make people fall out of love with him! Yeah it sounds like a good original idea but the way its told in this anime just uses over exaggerated clicheslike really young looking adults (younger than normal, seriously they look like toddlers), high pitched \"moe\" character voices, traps, etc.  Now the story... oh dear the story... it starts out as a basic harem school anime but then slowly turns into a mystery anime halfway and then the story just completely takes a 180 in the wrong direction into an action/sci-fi.  This isnt just your average plot twist, but a plot twist that completely changes the story.  Like they tried something but skipped about 10-20 steps...  The change is so drastic that you will end up laughing at how bad it is.  \\n\\n\r\nTo sum this up: I definitely would not recommend this anime, but if your still gonna watch it, watch for the change. Expect nothing from the story and just watch it take that 180 twist that makes no sense.",
            "date": "2016-01-05T22:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 207866,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5061541.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/nnnathannn",
                "username": "nnnathannn"
            },
            "url": "https://myanimelist.net/reviews.php?id=207866"
        },
        {
            "content": "I have been enjoying watching this anime and seeing how many girls the protagonist can have, but when they revealed that's just all fake shts, my depression started to beat me up and now I'm all upset cause none of them remembers any sht and that fking sucks. lol\r\nbtw, the fking ending is rushed, i need more of it but g o d damn it cut off when no one knew him.\r\np.s. why do i need a well constructed sentence just to post a d a m n review cause oh boy do i need to type hella shts that doesnt make sense.",
            "date": "2018-02-22T02:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 272159,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6979844.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KhaizerX",
                "username": "KhaizerX"
            },
            "url": "https://myanimelist.net/reviews.php?id=272159"
        },
        {
            "content": "I'm going to judge this as a typical harem, to make it fair to the show. If her Flag Breaks should not lose points just for being a harem, because it was made for people who wanted to see a harem. \r\n*Story*   9/10\r\nThe story is pretty much your generic harem in the beginning, albeit a little different due to the addition of flags. The first few episodes consisted mainly of introducing the characters, and setting up the main story. As the story progresses, it shows that it is actually a well thought out story and actually provides reasons as to why he hashis ability to see flags and why the girls in the show seem to gravitate towards him. Now, I'm not saying this story is stellar, I'm saying for a typical HAREM anime, it has a very good story.\\n\\n\r\n*Art*   7/10\\n\r\nI'm no art specialist when it comes to anime, so I can't give an accurate score on this, but I found the art just fine. I'd say it's a bit above average. But that's all.\\n\\n\r\n*Sound*  7/10\\n\r\nOnce again, I have no idea how to grade this, but I had no issue with the sound, and the opener was interesting enough for me to at least watch it a few times.\\n\\n\r\n*Character*   8/10\\n\r\nThe Characters are probably a hit or miss for most people. A few characters have generic qualities to them, but I found each character with traits that aren't used very often. Other characters are rarely seen in other animes and I found it refreshing. Most characters have some backstory to them, especially the main character and a few of the \"first\" girls. The main character's backstory is clouded in mystery till the very end and ends up connecting to the other girls quite nicely. His personality is uncommon in harem as well, for he is not \"empty-headed\" as I'm sure harem-watchers are well acquainted with.\\n\\n\r\n*Enjoyment*  9/10\\n\r\nI found this anime quite enjoying to watch. It went for a romantic comedy and pretty much delivered. Some of the comedy and romance are touch and go, but it makes up for that in other areas. I also enjoyed the story and was pretty baffled as to how they would connect the dots, but they managed.\\n\\n\r\nOverall I would give it an 8/10",
            "date": "2018-02-07T19:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 270996,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6593901.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ChronicleHunter",
                "username": "ChronicleHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=270996"
        },
        {
            "content": "This anime is one of those animes with a really good concept with cute art brought into it. \r\nStory\r\nThe way the story was executed in the first few episodes were just fine but in the later episodes, the events were too sudden, which in a whole got me personally confused\r\nArt\r\nThe art here is so... Kawai (  Cute ). That is all I can say to this anime. The symbols for each flag made sense too :D\r\nSound\r\nI honestly have no opinion. The rating is just there because I personally liked the opening\r\nCharacter\r\nI felt like the characters were too shallow and underdeveloped before entering some crazyevent, yeah sure you could say that this is how its supposed to be but the characters, if looked from a first person view didn't really have much motivation to execute the actions they did\\n\\n\r\nEnjoyment\\n\r\nI thoroughly enjoyed the concept and art which  are the 2 main reasons I gave this a 10/10",
            "date": "2016-01-25T03:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 209335,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5001199.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Olej",
                "username": "Olej"
            },
            "url": "https://myanimelist.net/reviews.php?id=209335"
        },
        {
            "content": "Well, at first I though of Kanojo ga Flag wo Oraretara as a fun show with some nice plot. Then as the story advanced the Harem genre took over in a weird style, they present you bunch of characters out of the blue without deepening enough into their stories. At the end you think the plot is kind of a mix between The Matrix and Little Busters, just in a plain and lame way. The art is enjoyable and the \"fun\" in the anime is in itself nice, but I wouldn't recommend it, if you want a great \"hidden truth behind the world\" kind ofstory, please watch Little Busters, that is a 9.5.\\n\r\nGreetings.",
            "date": "2014-06-30T11:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 149593,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rocazanova",
                "username": "rocazanova"
            },
            "url": "https://myanimelist.net/reviews.php?id=149593"
        },
        {
            "content": "Well first things first, this is some sort of a parody of the harem genre. Hence, not really be taken seriously.\r\nKanojo flag long name long name tells us about Hatate Sota who can see \"flags\". These \"things\" is quite powerful that it can change the fate of any person/ thing who has them. He cannot just see them, but also change the flag! For some reason, he meets up girls until it becomes a full blown harem! (Though this will be explained in the later part of the show.)\r\nStory: 7-8\r\nCome on, it's harem! So don't take it seriously! The show doesn't even hide it. \r\nDuringthe first episodes, it was very fast-paced. I mean, VERY FAST. Can't blame them for that since there's 9 girls in total. As for the ending, though they did explain the flag concept but it's pretty short? \\n\r\nThis could've been better if this series was 2- cour. Simlar of the koichoco anime, they built the tension perfectly, \\n\r\nelections and etc. but when the ending came… Yeah. \\n\\n\r\nCharacters: 6-7\\n\r\nThey are stereotypes of their archtypes except for the Main character who is still generic harem MC# 44310. From cute girls who seems like boomboxing  when they run to make it sound quite cute to characters who's a Imouto(not blood related), A useless student council president, an idol,  a trap,  A loli who's an elder, A robot, A wannabe onee-san who's the same year as MC who always have a laddle for some reason, a forgettable self proclaimed best friend who only appeared in the first episode, you name it. Despite having the same feelings for the Main Character, they are somewhat charming since they are not violent and just lovable.\\n\\n\r\nArt: 7\\n\r\nArt was not bad. Some people complain about the QUALITY faces, but that's not true at all. It's the character designer's fault, the animators has no idea to animate it. Look at the promo images. They look all derpy, but the anime is far from that.\\n\\n\r\nSound: 9\\n\r\nDAT JAZZY OPENING and that generic ending. Again, the opening is a parody of romance anime that you see during the 90's. Very nostalgic. The BGM was used very carefully for the different moods of the show.\\n\\n\r\nEnjoyment: 7\\n\r\nIt wasn't bad but it's not a masterpiece. If you want mindless fun with a huge pile of mood swings and girls! I'd recommend you to try this show. I mean this ain't White Album 2 or Toradora. \\n\\n\r\nFor me, this was the dark horse of the Spring season. If you wanted bad harem, check out those with cute anime-like alien deformed mascots.",
            "date": "2014-07-01T06:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 149777,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dexecutioner",
                "username": "dexecutioner"
            },
            "url": "https://myanimelist.net/reviews.php?id=149777"
        },
        {
            "content": "Staying awake after 2 PM, digging through an endless stream of \"funny anime clips\", I stumbled upon this weird video titled \"Gaworare - The Trap\"(yea I love traps shut up). So I gave this one a try and it was... good... I guess.\r\nThe concept really caught my eye. A young high school boy with PTSD with the power to see \"flags\"- which tells the person's emotions, fate, etc.\r\nFollow his journey to create the most harem-y harem ever.\r\nCharacters are pretty basic, like you've seen them EVERYWHERE ELSE. Not special in anyway. But they don't have to be special to become enjoyable. I really like them, fortheir basic personalities. Because 13 episodes is nowhere enough to give the entire cast an in-depth character development .\\n\r\nPlot is... well... meh. The first part, nothing much happened. Just comedy/adding harem members. And at the end, the anime just have to take itself seriously and make the MC fights the illuminati with a Sony VR or something. It's rushed, hard to follow and not as enjoyable as the rest of the anime.\\n\r\nOverall, definitely recommended.",
            "date": "2017-06-22T11:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 250675,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Huy_Quang_Pham",
                "username": "Huy_Quang_Pham"
            },
            "url": "https://myanimelist.net/reviews.php?id=250675"
        },
        {
            "content": "I would like to write: \"HaHa\" for about 20 lines of text and just be done with it but no... Let's look at it from different perspective. \"KOGA\" because i like to call this anime like that was... weird. But before we begin for real i'd like to say that i try to be as subjective as possible, i won't compare it to any other series with: better art, sound and storyline, no. We are here, and KOGA is the only anime existing so we'll be focusing on only KOGA and nothing that has no KOGA in it's name, ready? Let's begin. KOGA was weirdnot because of bizzare characters that are simple as a wooden plank. Come on! What could be simplier than a wooden plank? They were in fact very simple and not really interesting but THE STORY and not characters is the main flaw in this series, it tried to be deep at times, touching death, life was cool for me but everything played out wrong as expected. I tried to go into it but every time i was trying to feel for the characters they would just spoil the whole atmosphere with their awkwardness, you can't get into the story when the characters are sooo freaking stupid and awkward. I don't want to spoiler anything /if you're such a masochist to watch this -_-\\ So we will jump to the next flaw. Art was not so bad but still meh,and  although i liked the serious moments when the light went a little darker adding a small amount of depth to the whole scenery i cannot say it was not thrown to trash because of stupidity of other characters. Art was okay but it looked like bootleg parody quality crap at some times saying in short. Third thing on the list is sound and sound was... Poor. Opening sucked, ending too. Background music never touched me and i think neither any one of those who watched it. At this moment i need to watch opening one more time because i forgot what song it was... ((*whisper* It's as bad as i remembered ;/*whisper*)) boring and i won't ever, EVER listen to it again in my life. Next thing, characters... *Takes glasses of and takes a deep breath* are dumb. We got so much stereotypes! God damn it, would they finally learn that quality and not amount matters?! Really, make me 2 good looking characters with interesting development and i will be more happy with that than 20 okay looking retards. Painful! Next... Enjoyement, actually? Let's say that what i say in begin still stands. \"There is no other anime than KOGA.\" I liked it. I enjoyed those stupid, not even funny characters. No depth at all just pure stupid entertainment that leads to stupid situations. I watched it alone, coz that's how you should watch such anime. ALONE, without lights, in your basement. No life, just KOGA and that's basically all. *Laughs* I could live with anime like KOGA only, duh i would even become anime fan like right now. I liked it not for it's story, art, characters, sound or anything else. I liked it because it's anime. I like anime, you reading it probably do too. We all like anime and every new episode, every new idea, even if made only for money or other crap, i don't care! Anime is my life as for now and just like with games i want more, crappy, good, extremely interesting. Doesn't matter because every anime is great and i would recommend KOGA to everyone that is interested in the Harem-LEVEL ULTRA EXTREME! Do you like harem anime? This is like wet dream for you, go check it now you pervert! But jumping to our conclusion for this too long, not serious and absolutely not professional review. I enjoyed KOGA for it's charming, stupid characters and romance which i'am a great fan of. I watched not because i'm a masochist but i just don't believe people in most cases. I was curious what this anime can bring to my life and it brought something. That warm feeling and polite compassionate smile that crawled on my face every time something awkward happened, thus alot... whole time to be honest. I think if they would go in different direction with this anime everything would play out all right but even though it was not perfect... we should learn to love every series, for that they are and not for that they please us. It would be all :P Thank you for time you wasted here and not watching anime, baka.",
            "date": "2017-04-12T16:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 245341,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5555456.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MeFew",
                "username": "MeFew"
            },
            "url": "https://myanimelist.net/reviews.php?id=245341"
        },
        {
            "content": "Screwed all this critics. This anime has depth and has plot. This is a MUST-watch in my opinion. Everyone has the right to criticise but you would definitely lose out to not watch this anime. \r\nTL;DR: This anime is 9/10. There are so much character development and enough girls for everyone. Also, there is enough plot twist. Then, this anime also looks deep into a little dark side of humanity and the main character's backstory. Cute,comedy,harem. :)\r\nStory: 9/10\r\nKanojo ga Flag wo Oraretara has lots of character development which gives it enough potential for a second season. It also builds up each backstory for all thecharacter. Providing insight from best girl (up to your own definition) to the main character. You would be left wanting more story. \\n\\n\r\nArt: 9/10\\n\r\nThe animation for this anime is rather intricate. Beach and scenery animations are really on point. You could really see that quite a lot of budget had been spent on those sweet, picturesque scenery. Not the best, but good enough for you to want more. Drawing at the end of each episodes are really on point.\\n\\n\r\nSound: 10/10\\n\r\nWow! The opening by Aoi Yuki is really cute and catchy. There is really no flaws that can be pursued. It really provides a platform for the viewers to understand the tone and theme of the anime. Also, I didn't even skip the opening once. The ending was decent but good enough to end the anime on a good note and leave you smiling and wanting more. \\n\\n\r\nCharacter: 9/10 \\n\r\nTwelve beautiful girls get interested in his strange way of living, and they begin to live with him at the school dorm. Need I say more? All-in-one package, from best girl, tsundere, imouto, princess, onee-chan, idol,teacher, to childhood friend for all your needs.\\n\\n\r\nEnjoyment: 10/10\\n\r\nExtremely comically funny. You would seriously laugh till you stomach hurts. Fanservice,PLOT, plot. Please watch, you would not regret! \\n\\n\r\nOverall: 9/10 \\n\r\nIt has been quite a ride with this anime and I believe that this is one of those very good anime that binds story progression with a good amount of comedy lest not forgetting the harem and fanservice, would watch again.\\n",
            "date": "2016-12-02T01:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 234735,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5830789.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ExaltedSenpai",
                "username": "ExaltedSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=234735"
        },
        {
            "content": "KANOJO GA FLAG WO ORARETARA TAKES ON A LITTLE TOO MUCH\r\nWith vibrant colours, light-hearted music, a bland male MC and a large cast of female characters, Kanojo ga Flag wo Oraretara, or Gaworare, met the important criteria for a generic, if not enjoyable, comedy/harem show. It would have stayed an average comedy/harem show if it hadn't tried to take on too much at once. This great aspiration led to a series of mixed results which I'll explain by exploring key aspects of the show.\r\n-----------------------------------\r\nComedy or mystery or both?\r\n-----------------------------------\r\nOn the surface, Gaworare was a simple show of random comedic events that revolved around Souta and hisever-expanding mob of 'supporters' even though the show started out with a somewhat dark event involving a 'death flag'. However, as the show progressed, there were hints to a plot but they often seemed unrelated to the episodes and weren't an emphasis of the show until its later parts. Because the show seemed like a comedy at its heart, I found it difficult to pay attention to those little hints, and got confused as I watched later episodes. I would have better appreciated the plot if the show was presented as a mystery instead of a comedy.\\n\\n\r\n-------------------------------------\\n\r\nA premise that wasn't fully explored\\n\r\n-------------------------------------\\n\r\nSouta's ability to visualize flags was the key premise of the show and sparked my interest. Starting with the 'death flag', I was soon introduced to various other flags, like the 'friendship flag' and 'romance flag'. As the show progressed, more flags were introduced with some characters having their own flags. This eventually led to the flags having less influence on the characters. I would have preferred if the show focussed on a few flags and expanded on them.\\n\\n\r\n---------------------------------\\n\r\nLarge, average cast\\n\r\n---------------------------------\\n\r\nLike the average harem show, Gaworare had a large cast of female characters, most of whom were attracted to the MC for various reasons. Gaworare also did its best to make each member of the harem unique by providing backstories and differing character design; you could still tell which girl was which even if her outfit was switched with another girl's. Due to the length of the show, most of the characters aren't developed past their backstories, leaving only a few memorable characters. But it was often nice to see the large, colourful mob of supporters that followed the MC around.\\n\\n\r\n-------------------------------\\n\r\nAlways cheery\\n\r\n-------------------------------\\n\r\nGaworare was full of colours: from the harem with hair of various hues to the multi-coloured skirts worn by most of the female cast and the often bright backgrounds. The art of the show always seemed to evoke a cheery mood, even in the more solemn moments. Also, it was difficult to take some of the characters seriously when most of them were baby-faced, especially the girls in the MC's harem.\\n\\n\r\nThe soundtracks and OP song were mellow which captured the light-hearted nature of the series. The voice acting was excellent save for the MC who was mostly bland.\\n\\n\\n\r\nOverall, I'd say Gaworare was an average show and would have been more enjoyable if it'd hadn't tried to involve too many subjects at once.\\n\\n\r\nOverall: 6\\n\r\nStory: 5\\n\r\nArt: 7\\n\r\nSound: 9\\n\r\nCharacter: 4\\n\r\nEnjoyment: 5\\n",
            "date": "2016-11-19T02:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 233994,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647223.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/gnerkus",
                "username": "gnerkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=233994"
        },
        {
            "content": "I'll be frank, this anime deserves 24 episodes, not 13. The simple fact that it only had 13 episodes made it bland. To be honest, I'm writing this after watching the anime and after reading the manga and a few portions of the Light Novel that I tried to read (hard to read when its not translated. Its either there's really no translation yet or I just suck at finding these translations). The manga had a lot more to show, and it gave you time to like each character. Each character in the series had their own development, this is true as well in theanime, but it was so pressed with time and the amount of episodes, it couldn't't deliver the amount of enjoyment it COULD have given.\\n\\n\r\nThe story is the same as both the Light novel and the manga, its goo, but as I've said, with only 13 episodes, what can you do so much with it? 24 episodes wouild have most definitely fixed this issue. The art was good, I noticed a few stale colors at times, the girls gicing off a very colorful look while leaving the main character the same would have been good since it relates to the plot, but overall the art was good, it was enjoyable. \\n\\n\r\nAs for sound, the voice actors did a good job, the BGM was right on track. It fits each situation and can be quite amusing.\\n\\n\r\nCharacter - this is where it gets problematic. Each character DOES have good development, don't worry. But the story is too rushed, it didn't really give you an opportunity to like the characters or feel attached to them. The main character is what saved the character portion of this, because Souta can be quite easy to relate to. He has a very \"human\" feel to him\\n\\n\r\nEnjoymewnt - honestly, this would have been up to 9 had the show given me enough time to enjoy each character and situation. It rushed from one event to another. It was a good harem, but too much harem. It focused on the heroines as a whole, focusiong on the usual RomCom\\n\\n\r\nOverall: Enjoyable. Good, but disappointing, I was expecting a lot more since I've been reading both he manga and Light Novel",
            "date": "2014-09-07T20:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 159569,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/596659.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Naoe-Riki",
                "username": "Naoe-Riki"
            },
            "url": "https://myanimelist.net/reviews.php?id=159569"
        },
        {
            "content": "Okay so the english name of the anime is 'What if her flag was toppled' Yes the anime contains a lot about various flags, this anime is not practically hugely interesting, but it is an eye catching anime, although there are low ratings for the anime, my rating would be 8/10, i will explain the reason for giving an 8/10 below \r\nThe story is about a boy who has the ability to detect flag, Now you may all be thinking what are these flags? The flags are something like the current mood the person is facing for example showing love and affection would be displayedby a Love Flag on top of the persons head, Now the MC has the ability to see these flags and also he has the ability to change these flags, For example he can change a death flag to a love flag, This is merely called as changing fate. \\n\\n\r\nNow this anime has a lot of plot twists and may be confusing for a first timer, but the MC has inspired me about humans, The way each of us looks at the world and humanity may be different, but this anime shows how Humans can be really helpful even at times of misery they help each other. This was what inspired me the most, The MC also does everything despite him having a death flag on top of his head (Oops! Spoiler), Yes the MC has a death flag on his head, this is the point which makes the anime even more interesting, during the time i watched this anime i kept thinking what would be his next move, what would he do? This anime indeed did keep me in a state of suspicion all the time. Another thing would be that most people who love harem animes would definitely love to watch this anime \\n\\n\r\nAs for the Art and sound of the anime, please watch it in 720P or 1080P to really enjoy the anime. There isn't much i can comment on this part though\\n\\n\r\nThe enjoyment i got through this anime was good, and i really liked it, though there may not be good ratings for the anime my rating is this, and it would be a good anime to watch when you are like out of options.",
            "date": "2016-03-26T21:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 214296,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3283801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sumsulk",
                "username": "Sumsulk"
            },
            "url": "https://myanimelist.net/reviews.php?id=214296"
        },
        {
            "content": "First of all, let me straight out say that I really didn't like this show at all. I thought that it was just a jumble of trashy cliches, and never really did anything at all. I thought that the show started out pretty well, it had a good unique concept that could really go to some great places as a romantic comedy, but it turned into a harem, a trashy harem at that.\r\nStory: 2\r\nAs I stated earlier, the story started out well, it had a unique premise, but for some stupid reason the show could not decide if it wanted to be a romantic comedyor a dark story--which I should add made zero sense. The show couldn't help but through cliche after cliche at you with literally every type of girl  falling for the main character at the slightest hint of flirting. To make it worse the show makes it seem like it actually has a dark, thought intriguing plot, but really it's just a stupid side story that no one should have any interest in at all.\\n\\n\r\nArt: 5\\n\r\nThe art was pretty straight forward. It wasn't good or bad at all, and very occasionally it did manage to pull out a good sequence of animation, but overall, the art was just average. You can't really do anymore with a generic romantic comedy unless it has a high budget, which I am pretty sure it did not.\\n\\n\r\nSound: 6\\n\r\nThe music in this show is really the only thing worth redeeming in it. The OP is extremely catchy and at times I found myself humming it to myself while I was walking around the house. The ED is also pretty catchy, not nearly as good as the OP, but still nice. However, the actual background music is bland and uninteresting, but I wasn't really expecting too much after this show disappointed me so quickly. Really the OP and ED are the only reasons that I am giving this show a higher score than I would have.\\n\\n\r\nCharacter: 1\\n\r\nOh boy, the characters. I could probably spend paragraphs ranting about the characters in this show, but I will try to be as brief as I can. The girls in this show are literally the blandest pieces of trash that I have ever watched. Seriously, I have watched my share of trashy romantic comedies, but this show might actually take the cake. The girls fall for the guy simply out of a single smooth words, and then they love him forever. Literal. Trash. I know that the show's plot has to do with seeing flags, and that that would probably explain the reason for why they fell for him so easily, but I cannot get past this stupid explanation for girls with literally zero character. However, while the girls are bland, the main character might be the worst character in this show. He is the most angst filled character I have watched in a while, literally picking up girls one after another and then leaving them behind in his harm to pick a random child lost on the street, another girls little sister, a girl he literally just met, and on and on. I cannot go into enough depth to express my hate for this character, so I will stop while I still hold onto some manner of manners. To end this section on a positive note, the trap was 10/10.\\n\\n\r\nEnjoyment: 4\\n\r\nWhile this show was incredibly bad with it's more than fair share of plot holes and the such, as a romantic comedy it is only decently bad. At times it did make me laugh with a stupid situation. Really all I have to say at this part, was that my enjoyment of the show was just decent and that's the best I can say about it.\\n\\n\r\nOverall: 3\\n\r\nThis show is just a jumble of cliches, trashy story, terrible characters, and a good OP and ED. In fact, the OP and ED are the only reasons I am giving this show a 3, if they weren't good then I probably would have given this a 1. In the end, I really only finished this show so that I could review it to give it a bad review, but that's that. If anyone told me that they wanted to watch this show, I would tell them to only watch it unless you want to trash it with your friends. Other than that, don't watch this show if you value your time.",
            "date": "2018-01-18T20:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 268987,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6495412.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/MrChiki",
                "username": "MrChiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=268987"
        },
        {
            "content": "This is the most ridiculous anime I've ever seen. I'm not even joking. It's awful. I mean, the beggining was good, it had potential, but then they just decided to screw things up and it turned on that... thing.\r\nYou get what I'm saying during this review.\r\nStory: 1\r\nWhere those guys wanted to go while writing the script? I mean, it was ok in the start: a normal Harem with a little of fantasy in it, kind of good actually, but then in the 11th episode they just decided: \"let's make a REAAAAALLY weird and confusing story to end this!\". Like, they just decided to put alot of things that could give us that good feeling of mistery in the start and did not thought how it would end. You see, it had plenty of potential, but many things were... confusing, at least. I did not expect for it to become that weird. \\n\r\nResuming, they just throw information in our heads in the last two/three episodes and expect us to understand the whole thing in 24 min.\\n\\n\r\nArt: 6\\n\r\nNot bad, just... normal. It is not the most awful I've ever saw but it is not the best as well. Average.\\n\\n\r\nSound: 6\\n\r\nAverage as well. The ed and the op weren't that good in my opinion and the seiyuu's work wasn't bad.\\n\\n\r\nCharacter: 8\\n\r\nThis is probably the best aspect of the whole story: good characters.\\n\r\nAs I said before, it had lots of potential: the characters had a good personality and appearence, a backstory tragic enough for me to actually feel sorry for them and stuff like that, but they didn't know how to work with that.\\n\\n\r\nEnjoyment: 6\\n\r\nI did not hated watching this anime, but I've seen lots of anime much better than this one. It wasn't awful, but it wasn't good as well. Actually, a waste of time, but the kind of waste we can learn from and avoid in the future.\\n\\n\r\nOverall: 3 \\n\r\nI pay lots of attention to an anime story, and it is the thing that makes me most likely to recommend it to someone. This is a great representation of a story awfully constructed and I just got devastated with that finale. It was INCREDIBLY CONFUSING AND UNNECESSARY. IT HAD SO MANY BETTER WAYS TO END IT AND WHILE I WAS WATCHING I LITERALLY ASKED MYSELF: \"Is the anime story too confusing or am I to dumb to understand it?\" I CAN ASSURE YOU IT WAS THE FIRST OPTION.\\n\r\nI am just so shocked that this anime exists that I... I have no words to describe it. Just don't.",
            "date": "2018-10-25T17:39:00+00:00",
            "helpful_count": 0,
            "mal_id": 292589,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6180153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/potatofromanime",
                "username": "potatofromanime"
            },
            "url": "https://myanimelist.net/reviews.php?id=292589"
        },
        {
            "content": "This review is available in English and Brazilian Portuguese:\r\nHistory: it is an anime with a very interesting story, a boy who sees the flags on the people, that the future of the person, with a tragic past, ends up going to a school, and ends up being surrounded of girls with loving interest on him . Its theme is to break like people's flags without getting involved with them.\r\nCharacters: In general they are simple characters with different personalities, normal for a story that has its own name, a character that has a little knowledge in history, surrounded by some girls that have or not development,some individuals and other protagonists. I really enjoyed the development of the first two girls who appeared in the anime with the protagonist.\\n\\n\r\nArt: I found it childish, although detailed, with a normal animation.\\n\\n\r\nExploration of the Universe: An experience below the universe average, is very much like the parts that present themselves in the world of the universe\\n\\n\r\nSoundtrack: I did not really like the soundtrack, after some things I watch, I do not remember any, I thought it was childish!\\n\\n\r\nFinal: I did not expect much and I ended up surprising myself by giving a relationship with the movie matrix.\\n\\n\r\nPersonal opinion: I recommend this anime for people who like a cliché harem, with a bit of romance not very developed, with a very interesting story, and with a very weak comedy.\\n\\n\r\nPortugês:\\n\\n\r\nHistória: é um anime com uma historia bem interessante, um garoto que vê bandeiras em cima das pessoas, que diz o o futuro da pessoa, com um passado trágico, acaba indo estudar em uma escola, e acaba sendo cercado de garotas com interesse amoroso sobre ele. Seu objetivo é quebrar as bandeiras das pessoas sem se envolver com elas.\\n\\n\r\nPersonagens: em geral são personagens simples com personalidades diferentes, normal pra uma historia que tem harém, seu mc é personagem que tem um pequeno desenvolvimento na historia, cercados de algumas garotas que tem ou não desenvolvimento, alguns individualmente e outros com o protagonista. Gostei bastante do desenvolvimento das 2 primeiras garotas que apareceu no anime com o protagonista.\\n\\n\r\nArte:  eu achei bem infantil, porém detalhada, com uma animação normal.\\n\\n\r\nExploração do Universo: Um exploração abaixo da média do universo, é muito corrido as partes que focam em apresentar o mundo daquele universo, se você não prestar muita atenção acaba pegando informação nenhuma\\n\\n\r\nTrilha Sonora: Não gostei muito da trilha sonora, depois de algumas semas que assisti não lembro de nenhuma, achei bem infantil!\\n\\n\r\nFinal: eu não esperava muito e acabei me surpreendendo, dando um relação com filme matrix.\\n\\n\r\nOpinião pessoal: eu recomendo esse anime para pessoas que gostam de um harém clichê, com um pouco de romance não muito desenvolvido, com uma historia bem interessante, e com uma comédia bem fraca,",
            "date": "2018-03-25T13:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 275046,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6469772.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SrClone",
                "username": "SrClone"
            },
            "url": "https://myanimelist.net/reviews.php?id=275046"
        },
        {
            "content": "To be honest, this anime is technically not a bad harem anime. Well, Kanojo ga flag wo Oraretara is a nice anime but it lacks a lot of details and points. \r\nStory 8/10\r\nThe story sounds unique, which is great and it sounds very tragic since the male protagonist Hatate Souta is a mysterious character. I can't really spoil it. The story is at least one of those good points, and it got my attention because it wasn't boring. \r\nArt 7/10 \r\nThe animation is not bad and I give it some points since the animation is bright and the character design is not bad as well.It lost a lot of points because the animation at the last two episode did not do very well. (Trying not to spoil) The major problem is how they can actually pull off the really energetic scene when (again trying not to spoil) when a bunch of character is trying to help each other out and the main character gets a bunch of illusions which is good but at the tragic main scene, it gets messed up by a bunch of minor things happening. I mean \"yeah the animation of the flag is kind of a bit funny because the way the flag pops up and breaks is a good comedic element.(correct me if I am wrong) \\n\\n\r\nSound 7/10 \\n\\n\r\nThe sound is not bad, and the voices of each character matches them. I don't really pay attention to sound and voice because it is kind of hard for me to determine if their voice acting is good. For readers, have a perceptive mind when you read my judgement on the sound. I am not strong in determining good sound quality of characters. \\n\\n\r\nCharacter 5/10 \\n\\n\r\nThis is the part that really was bothering me. It lacks development, and character exposure. It is kind of a new term I probably use or made up but i am pretty sure other people use this term. Character exposure pretty much means how much did the character open up and how much did a person really express their true feelings or troubles. To be honest, a lot of characters lacks development and it annoys me a whole lot. First of all, I always have this major question \"How did this and that lead to this route?\" in harems because routes are important and it gives the viewer an understanding of what is happening. It lacks a lot in character development and exposure and it is hard to tell if this girl is apart of the harem. Another thing that was bothering me was the antagonists didn't get character exposure. It is so hard for me to tell if the antagonist is actually an antagonist or a good person.\\n\\n\r\nEnjoyment 8/10 \\n\\n\r\nIt is enjoyable and I liked it a lot. Even though it lacks character development. I liked the main characters since they only focus on only three characters. The second main character has really made this anime enjoyable because Nanami has tsundere points over 9000 and she is in third place in tsundere charts. 1st is Louise from Familiar of Zero and second is Taiga from Toradora. \\n\\n\r\nOverall 6/10\\n\\n\r\nI would give it a 6 because character development and character exposure is important and it makes up an anime and manga. I would give it a 6 until the OVA airs in December 2 and I will probably raise the score if they fix the character development and exposure.",
            "date": "2014-07-06T23:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 150793,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/808pokebeast",
                "username": "808pokebeast"
            },
            "url": "https://myanimelist.net/reviews.php?id=150793"
        }
    ]
]