[
    [
        {
            "content": "Nejimaki Seirei Senki: Tenkyou no Alderamin is a 13 episode anime series based off a currently publishing novel series. Odds are, you already have realized a couple things, but if not here they are now: First, this series tidies up an arc at the end, but it otherwise has an open ending. Second, odds are there won't be a second season; if lucky, there will be an OVA in the future, but it likely won't even be that. So, if these two factors are a big deal, you may want to wait on watching the series. If you don't mind, continue reading for a moredetailed review.\\n\\n\r\nStory: 9\\n\r\nThe anime is essentially composed of a few sections, which each section tidying up neatly, while still being open to the next section. This allows the anime to flow nicely, though unfortunately, also leaves the series with a somewhat open ending; though the arc is tidies up, the viewer is left knowing that much is to follow along with foreshadowing, and it just isn't covered. Granted, anime based off of light novels serve not just to gather and entertain viewers, but to serve as an advertisement of sorts for the novel series, so this is to be expected.\\n\r\nAs for the specifics, while the whole premise isn't made entirely clear, enough information is given to where the viewer won't dwell on the lack of information; also keep in mind, it's common for lots of details to miss making it from the novel series to the anime, so for minimal omission to seem apparent is pretty good on the anime's part. The setting seems to be perhaps a fantasy enlightenment period, with the main contrast being the female military uniforms, which have leggings and school skirts (since how could any anime girl not wear a pleated skirt as part of her main outfit?). Though the fantasy element is light, involving only the use of spirits (which some scenes may have you wondering whether they are fantasy or more sci-fi), the implementation of the spirits in the series adds to the fantasy feel.\\n\\n\r\nArt: 7\\n\r\nWhat can I say? It's not terrific, nor experimental, but it's clear and crisp. Nothing to wow over, but nothing to complain over either.\\n\\n\r\nSound: 7\\n\r\nThe voices suited the characters well I feel. The opening and closing also fit the series. The series does a good job overall with using music in scenes, though there were a couple times where it bordered annoying for me.\\n\\n\r\nCharacter: 9\\n\r\nWhile the main characters fall into stereotypes, they were portrayed well, to where they helped the story. A few of the characters remained rather static, while a few of the others grew over the course of the anime, which fit into the character types. The series also does a good job in reminding us that the characters are in a war.\\n\\n\r\nEnjoyment: 9\\n\r\nThis series had a mix of my favorite genre, favorites character types, and was based of a novel series so I started watching it expecting to highly enjoy it; thankfully, for me at least, it met my expectations. \\n\\n\\n\r\nOverall, I give this series a 9. I can see someone who's into \"typical\" shounen anime finding this series slow and boring, so if fast-paced action is what you're looking for, this series may not be for you. While this is a fantasy military anime, this is of a totally different strain than, say, the Gundam series. If you enjoy seeing what happens behind the action in war scenes, with action scenes involving character's planning counter-actions as much as actual action, this series is one you'll likely enjoy. If a semi-open ending is something that will bug you, you'll have to personally decide whether it's worth watching; if you enjoy this series, by the end you'll be wishing the light novels were being published by Yen Press. Hope this helped!",
            "date": "2016-09-30T22:03:00+00:00",
            "helpful_count": 144,
            "mal_id": 230747,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/62223.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mangastar",
                "username": "mangastar"
            },
            "url": "https://myanimelist.net/reviews.php?id=230747"
        },
        {
            "content": "Alderamin on the Sky isn't an overly impressive anime by all means, but it is enjoyable for what it is. It is a military, strategy themed anime which focuses on the cruel reality of war, politics, and how our MC, Ikta Solork, makes his legend by displaying his superb talents as a strategist. \r\nThe plot isn't original, but that isn't always a bad thing. Alderamin is mainly focused on the war between two neighboring empires Katjvarna and the Republic of Kioka, and the struggles of Ikta and his comrades fighting in the war. Besides the ongoing warfare between the two countries, there are also tensionwithin the empire and other battles with various clans. The usage of strategies are pretty good and the battles are meaningful. Unfortunately, early on, Alderamin suffers from a slow start, taking around three episodes to really get going and not really explaining too much during that time. However, after a couple of episodes, Alderamin quickly grew on me. The first real battle scene they showed brought a lot of promise, and it brought a much needed darker tone to the story. One thing I would've liked explained earlier though, was this little things called spirits who help fight in battle. They are there, but aren't exposed enough until late in the show. To be really honest, I feel like the show could've done just fine without these little creatures.\\n\\n\r\nThese problems could've been fixed had there been more episodes. I always feel like 13 episodes or 1 cour isn't enough for many, especially action/war based anime to really accomplish their full potential in terms of storytelling, characters, and the overall depth. Most of the times, the story will be rushed, and in Alderamin's case, since it started of very slow, the anime suffered from pacing and development issues.\\n\\n\r\nThe animation is the standout point of the series for me. Although a bit inconsistent in pacing at times, Madhouse still impressed me in the end. The efforts they put in each episode in terms of the action is refreshing to see. In an anime like this, awesome battles need to make you feel excitement and hyped, and madhouse delivers just that. The battles are brutal and bloody. The character designs are pretty good and the animation as a whole was crisp.\\n\\n\r\nThe op and ed are great, but a part of me wishes that the soundtracks were more memorable. It is good for what it is; doesn't feel out of place or anything, but it could have been better and more impactful. The voice acting is pretty good for each characters and personalities. We could've used a little bit more emotion in their voice though.\\n\\n\r\nOne of my favorite aspects of the series is definitely the MC, Ikta Solork. He isn't like all those generic, hardworking MCs like other series. In fact he is lazy and doesn't hide his  love for women. However, beneath that layer, you really get to know that he is very intelligent and caring for his comrades. He isn't afraid to take risks in battles and forming strategies. He manages to somehow be badass while having a lazy personality. Although he isn't the greatest character, he is a breath of fresh air from the overdone MC cliches. In a way he could be compared to Itami from the Gate series. Both are lazy and aren't exactly that \"hero\" type but their other personality shines in battles. \\n\r\nAlthough the other main cast is on the generic side, one other character that deserves a mention is the main heroine Yatori. Although she herself could be classified as a generic female MC of any battle anime, it is her relationship with Ikta that makes her likable. Although she is the stronger fighter, you can tell that she still looks up to Ikta's talents and believes in him during when others might doubt his strategies. She isn't annoying nor thinks she is supreme to the MC in any way, which was refreshing to see at times. \\n\r\nBesides the two MCs, the other characters, besides Chamille are a bit underdeveloped. The unfortunate thing about this is that normally, if the characters were entertaining enough, I wouldn't have minded if the development happened later on in the series, but for Alderamin, the other characters aren't just interesting enough. One thing I did like is that the main cast all had a purpose for fighting in the war, whereas in many other anime, the purpose can be buried away without explanation. Also they are actually helpful. However, they certainly could've been written a bit better.\\n\\n\r\nOverall, Alderamin on the Sky is an good show, but nothing outstanding. It starts slow but once the pace picks up, it becomes an entertaining show for what it is. The plot could have been better, the characters could have certainly be explored more, and it indeed stayed on the generic side of things at times, but the intense battle scenes and the fun personality of the MC kept me wanting for more. With the story not yet being finished, we are left with an open ending. Alderamin on the Sky is definitely a worthwhile show to pick up.",
            "date": "2016-09-30T14:23:00+00:00",
            "helpful_count": 70,
            "mal_id": 230664,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3975341.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dream95",
                "username": "Dream95"
            },
            "url": "https://myanimelist.net/reviews.php?id=230664"
        },
        {
            "content": "\"Great soldiers die from overworking\" - Ikta Solork\r\nThis anime was actually quite the surprise where it was presented at first as a typical battle harem anime, but instead brought us an anime about tactical warfare and two rather unique main characters.\r\nThe plot of Nejimaki Seirei Senki: Tenkyou no Alderamin is more focused on it's war themes as well as their religious elements that enforces the war themes and puts them in conjunction with it's interesting characters.\r\nNejimaki Seirei Senki: Tenkyou no Alderamin's chaarcter like Ikta Solork voiced by Nobuhiko Okamoto and Yatorishino Igsem voiced by Risa Taneda are some very interesting characters, Ikta is forced tobe in the army after an incident where he wanted to have a more relaxing life and commonly disobeys the the higher ups (or be smarter than them in general), he is by all accounts a genius tactician but wants to use the easiest or the most peaceful way to resolve things...sure he's a womanizer typical of the battle harem anime, but this really isn't a battle harem anime. As for Yatorishino, she is more or less the main heroine of this anime and is the \"OP class character\", but she develops as to why she has her deadpanned and loyal behavior to both the Empire and Ikta. As for the other cast members like Chamille Kitora Katjvanmaninik voiced by Inori Minase, the third princess of the Katjvarna Empire, Haroma Becker voiced by Haruka Chisuga a medic, Torway Remion voiced by Ryousuke Kanemoto a sniper and Matthew Tetojirichi voiced by Junji Majima the second lieutenant in the main cast group although some do get their small character arcs like Torway and Chamille, the plot tends to focus more on Ikta and Yatorishino as well as it's more serious war storyline than anything else. But for LA's favourite character in the anime it easily goes to the badass Yatorishino...because she's a BADASS, not to mention her relationship with Ikta is a rather unique one from \"typical battle harem fair\". Which brings up a good point, as much as Yatorishino is LA's favourite character and an utter badass, it's Ikta that steals the show with his genius level intellect and tactical cunning on the battlefield.\\n\\n\r\nReally the \"typical harem fair\" isn't a bad thing as it hardly IS a battle harem, instead it's more of a tactical warfare anime and brings up it's themes of war as a template, quite easily it tells us about how \"tradition\" although makes the foundation can't withhold without the passing of time as such Ikta is showing us that things need to change for the \"tradition\" to stay and \"evolve\", tradition being in place of the Empire's military regime and it's evolution in Ikta and his strategies and evolution in military power and really even the themes of this anime can hold the anime on it's own as it is profound in how they execute it. On a grander scale, it also shows the corruption of the \"side\" Ikta is in and how he with his different outlook and genius intellect on the battlefield can change the tide of the WHOLE Empire and raze the corruption with his beliefs of protecting those closest to him and NOT for \"winning\" the praise of the corrupt Empire he's serving under forceful pretenses. \\n\\n\r\nAs later down to line, the plot changes to two \"genius commanders\" going at it a la L and Light just under a warfare setting and really it really exposes how Ikta is on the OTHER side of the \"great battles that whittle down or outright decimate the opposition\", it also once again develops Ikta by going into detail what kind of mental gymnastics he's trying to think up trying to both protect his army and defeat the opposing warring army (by the way it's these kinds of tactical warfare LA really gets invested in). On the supporting side it also shows that Yatrisino will always have Ikta's back even in DEATH really cementing this dynamic of commander and soldier. Because of this kind of focus on Ikta and Yatorishino as well as the \"other genius-equal to Ikta\", the focus really kicks Torway, Matthew and Haroma into minor character status and are really turned into pawns for Ikta in the process. The least developed character all round actually goes to Chamille the Princess as she is essentially in the sidelines as Ikta and his army is trying to defend against this new warring army.\\n\\n\r\nThe plot twists really comes in once Ikta has an equal fighting against him from the later storyline and just seeing the \"game of chess\" these two play and how they outwit each other makes the \"warfare plot twists\" all the more intriguing. Outside from that storyline, it is expected Ikta to survive along with his group and yes for the most part he does, but when other minor characters get into the mix and Ikta WANTS to protect them, that is where the plot twist deaths comes in and some are really unpredictable at times which again hones in in Ikta's belief to protect everyone but even if he has the intellect to do so but doesn't have the power to also comes in. Because of this, Ikta really is a fleshed out character from his beliefs to his intellect to his focus on the plot itself.\\n\\n\r\nIn terms of animation, the animation done by Madhouse, well it's expected of Madhouse to put this much detail in everything and they succeeded once again, from the tactical battles, to the medieval-ish anachronistic weaponry to the polished character designs make the animation look very nice to watch and as for the battles, well some of the best battles and gorn goes to Yatorishino's battles, but the more widespread out tactical warfare has it's animation moments as well.\\n\\n\r\nIn terms of voice acting, well across the board, the voice acting was amazing, though LA's favourite voice actor HAS to go to Risa Taneda as Yatorishino, her \"himedere\" vocals were always great to hear. Not much to talk with voice acting section other than it was amazing and expected LA was gonna go for Risa Taneda.\\n\\n\r\nOhh boy the ending...guess Madhouse has ANOTHER sequel LA wants outta shows they made and Nejimaki is no exception. Yes the ending left at a really great  point in the story and focuses in Princess Chamille and Ikta about the Empire itself and because of what Chamille wants Ikta to do and \"complicated\" notion of doing such a thing has gotten LA intriguing and wanting more which was why yes, it left in a \"read the manga\" ending. Before that the previous \"arc\" between Ikta and Jean (the other genius commander) was left though anti-climactically, once again the tactics Ikta used was GREAT in making the climax of the battle of attrition Ikta and Jean went through all the more worth it no matter how anti-climactic it was.\\n\\n\r\nNejimaki Seirei Senki: Tenkyou no Alderamin by all means has it's problems and strengths as typical for any kind of media but for LA, Nejimaki Seirei Senki: Tenkyou no Alderamin shined when talking about the tactical warfare element as well as Ikta and Yatorishino's relationship as well as in the animation, it's flaws came in that the supporting cast members were nothing but that and some people might see that Ikta as the source of the problem as he is your \"win all OP protagonist under the \"genius\" character\". But with this LA can say that Nejimaki Seirei Senki: Tenkyou no Alderamin has been more of a hidden gem of Summer 2016, seeing a fictional land give realistic terms of warfare and it's implications it has before and after the battle has been done and the dynamic between Ikta, Chamille and Yatorishino shows it in the form of the Empire's corruption, ideals and hierarchy.",
            "date": "2016-09-30T14:12:00+00:00",
            "helpful_count": 55,
            "mal_id": 230662,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=230662"
        },
        {
            "content": "War is not without causalities. Or a purpose. Or strategies. I must admit, watching Nejimaki Seirei Senki: Tenkyou no Alderamin (Aldermain on the Sky) reminds me of many war movies I’ve seen although it’s also quite different than what I had anticipated. Maybe it’s the military gimmicks or the character relationships. But for what’s worth, Alderamin may surprise you in more places than one.\r\nAdapted from the light novel, I was slightly disappointed that the show is only 1-cour. After all, there is more than enough content for a 2-cour length series so when I heard the show would only feature 13 episodes, my hyped dieddown a bit. This may also feel more like a personal opinion but for most war themed series, there needs to be a coherent amount of storytelling that matches in par with its drama. Alderamin’s pacing is questionable at times but not something that gets in the way of itself from succeeding.\\n\\n\r\nThe premise of the show is somewhat complicated. First, we have to understand the setting as it takes place in a world where the Katjvarna empire has waged war against the Republic of Kioka. All sorts of reasons evoked this war ranging from politics, imperialism, royalty, etc. At the center of it, we have 17-year old Yatorishino Igesm (also known as Yatori), a prominent member of the Imperial House noble family. Along with her, there’s Ikta Solork, a womanzing man that also gets involved with military affairs. From the start, their character chemistry is undeniable and it’s known that they have a history based on their background story. Meanwhile, Yatori takes the High Grade Military Officer exam and things get complicated when she, Yatori, and others are stranded deep behind enemy lines. It gets even more complicated when Ikta recuses the young princess Chamile Kitora Katjvanmaninik, who also happens to be the third princess of Katjvarna. Talk about a miraculous coincidence. \\n\\n\r\nIn the meantime, we quickly learn that Ikta isn’t just a womanzing bum but also one with a strategic mind who is not afraid of taking risks. His heroic actions along with Yatori, Torway, Matthew, and Haroma earns them the title “Imperial Knights”. Their reactions isn’t exactly gratitude though so viewers will have to anticipate on the ‘why?’ I have to say, this series has a lot of mystery and most of it isn’t exactly so easy to decipher on paper. The political affairs and character dynamics itself are also part of that. First, we don’t know a whole lot about Yatori or Ikta. Both of them are very different in terms of personalities and background. However, it is shown that they have a good friendship from the past as they once fought for survival together. Meanwhile, Ikta proves himself as a skilled tactician as he is able to come up with brilliant strategies for his party and on the battlefield. On the other hand, Yatori is a top student at her military academy and proves it with her unmatched fighting skills in particular with a sword. She also proves herself as a very hard worker, another contrast to Ikta’s lazy personality. However, both of them do have interesting ideals and reasons to believe in what they should be fighting for. It’s also noticeable that Ikta never really makes a move on Yatori despite his playboy ways. Instead, they share a rather unique friendship. Having being raised under strict circumstances, Yatori discovers new wonders about the world thanks to Ikta during her childhood. All she did before was studying and training.\\n\\n\r\nOf course, Ikta and Yatori aren’t just the main characters. There’s also others that proves themselves worthy of their positions in the military. Torway is a known for his long range sniping skills and handsome face (amusingly, Ikta doesn’t like handsome men in general). Haroma, the healer of the group, is known for being one of the friendliest and shyest character in the series. Finally, there’s also Matthew who starts off as a newbie but steadily works his way up as a worthy fighter. While the show concentrates mostly on Ikta and Yatori’s role, it also doesn’t neglect their comrades. The fact is, war is a dark reality that everyone has to accept. It breeds controversy that leads to hatred which leads to death and sorrow. Ikta is a guy that hates war but still fights for what he believes in. Similarly, others have their own reasons to risk their lives.\\n\\n\r\nAt its core, the show does a fairly decent job at storytelling despite some pacing issues. Most episodes connect each other while some others focus more on characterization. As smooth as it can be, the show does have some fairly predictable moments especially with death of certain characters.  I also have to admit the series does a good job at portraying mixed gender roles. Female officers aren’t always a major focus in military fiction but in this anime, it definitively captures their role and importance. In the meantime, the world building of Alderamin is also a strong factor. Perhaps some of it even has a connection to Japanese history or other related parts of the real world. I can also safely say that the show does a fair job at balancing the lighthearted moments between the more serious, focused segments. \\n\\n\r\nAdapted by Madhouse, I was initially underwhelmed by the character designs. They honestly look like something made from a shoujo manga with their same faces. However, it’s pretty easy to get accustomed to them especially after seeing the characters in action. Remember, this isn’t a love series but a war story. Weapons are also adapted well with fine degree of creativity ranging from the steampunk vehicles, guns, mortars, and elemental spirits. On the other hand, character expressions bounces between impressive to underwhelming. They are fairly well done when characters engage in battle (ex. Yatori demonstrating her sword skills) but during comedic moments, they feel more flat. I can’t say more than that though as this could be more of a personal perspective. However, the background sceneries are constructed pretty well with fine details, rich resources, and really gives the feeling of what a battlefield is like at war. As such, expect violence to occur with little censorship to portray a more realistic feeling of bloodshed. \\n\\n\r\nWell it’s not the best thing in the world but don’t underestimate the music aspects of Alderamin. The cinematics matches in par with the coordinated OST while battle segments are supplemented by the instrumental notes. I am also impressed by Ikta’s voice actor for portraying a character that I initially thought would dislike but convinced me otherwise with his ability to play such a complex character. Risa Taneda’s voice as Yatori is also recognizable if you’ve Shigatsu wa Kimi no Uso (Katori), Strike the Blood (Yukina), GATE (Rory). \\n\\n\r\nWell, if you’re a fan of military fiction and war stories, this is definitely something to keep an eye on. Even if you’re not though, Alderamin takes a unique approach at storytelling with its main characters. Between the politics and character drama, there’s a deeper insight on why events occur. As a 1-cour adaptation though, I am disappointed that some episode feels rushed. In general, LN adaptations usually depend on how much story is being focused. And while Alderamin did its best at that, it still feels like the show didn’t explore its full potential. However, the show is more than just the generic LN adaptations we see with the main protagonist getting a harem. It’s more of a war story that shows no mercy.\\n",
            "date": "2016-09-30T09:31:00+00:00",
            "helpful_count": 48,
            "mal_id": 230637,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=230637"
        },
        {
            "content": "Just what is going on with Alderamin on the Sky? (Re-Upload)(Mild spoilers)\r\nToday I rant. \r\nFor way to long (~6 min.) about a character that way to many people like \r\nIf the anime industry were a living, breathing person, she would likely be diagnosed with cancer. This cancer has a name; Pandering, Faceless Protagonists. Oh yeah, you’ve seen these guys around; anti-social drama queens like Kirito and Ouma Shu; bland bleeding-hearts like Tatsumi (Akame ga Kill); overpowered pretty-boys like Ayato; and, more recently, folks like Ikta Solork, the invincible, lazy pillock. These characters, and the shows they inhabit, are like Swiss cheese; they look good atfirst, but they’re full of holes, and if you keep them around too long they’ll stink to high heaven. \\n\r\nThese “your-face-here” protagonists shamelessly pander to their audience by fulfilling their fantasies; often surrounded by drama, veritably drowning in women, and eventually showered with the praises and victory the audience believes they deserve. Except for Tatsumi. Tatsumi dies. Tatsumi doesn’t get a happy ending. No I’m not mad, why do you ask? Baka!\\n\r\nDon’t be fooled though; these characters are superficially attractive, designed to sucker in poor scrubs who don’t know better. They are, in the opinion of some, a proverbial sickness within the medium of anime. And guess what;\\n\r\nthat cancer just hit stage four.\\n\\n\r\nAlderamin on the Sky doesn’t deserve much praise, and the root if it’s many problems is none other than our resident lazy sod. Meet Ikta Solork, a character so bankrupt he makes studio Manglobe look rich. (sorry Manglobe) Ikta is a pathetic waste of hard-working animators’ precious time. Perhaps the worst protagonist I’ve seen this year, his character is full of contradictions and bad attributes that made the show an actual burden to watch. \\n\r\nHere’s where things get complicated.\\n\r\nIt is indescribably frustrating and difficult to explain WHY a character like this is objectively terrible. The two biggest reasons for this are that enjoyment of a show and its characters is largely subjective, and can’t accurately be judged by one man’s standard. Although this holds true to a degree, it has become the rallying cry of people who’ve run out of sound arguments to defend their favorite shows and characters. The phrase “That’s just your OPINION!” has become a mantra for these guys; a convenient cop-out that you’ll hear everywhere on social media. Secondly is that, historically, the kind of people who admire an MC like Ikta are mainly lazy Otakus. People who would like nothing more than to have their lazy way of life affirmed. And Ikta Solork does exactly that. \\n\r\nYou don’t need to take MY word for it; lets let the story speak for itself. \\n\\n\r\nI wasn’t Joking about all those contradictions, and since they’re far less subjective we’ll start there. \\n\\n\r\nHow about we begin by addressing the elephant in the room; the blatant disconnect between Ikta’s worldview and his skill set. \\n\r\nFrom the get-go, Ikta is portrayed as a rather carefree, lazy person. Seriously, the dude worships hammocks; in the PV, he’s in a hammock; the first time we meet him on screen, he’s in a hammock; his group is trapped behind enemy lines and what does the magnificent bastard do? He builds a hammock. And while I did get a laugh out of his apparent hammock fetish, the point couldn’t be more clear; Ikta Solork is lazy.\\n\r\nDespite this, by the end of the first few episodes, Ikta displays an inexplicable amount of tactical proficiency and knowledge of military strategy. Additionally, as if the ‘chessboard’ scene in the OP wasn’t enough, they paint him as a brilliant strategist, able to call the shots of a chess game he isn’t even watching. Brief rabbit trail, but using chess as an analogy or metaphor for someones genius is a trite and broken trope in and of itself; it’s an easy go-to when you want to make a strategist look cooler, and Alderamin seems to use it just to check a box on the ‘main character checklist’. \\n\r\nOn that note, lets get into the finer details. The gist of this contradiction is that it is highly unlikely, bordering on impossible, that anyone with Ikta’s worldview (lazy, arrogant attitude, disregard for authority, dislike of the military, general selfishness) would be able to, or would even want to, achieve a high level of knowledge and competence in military strategy. In short, I’m calling BS on his strategic genius, and here’s why; Achieving such a high level of skill in something as complicated as military strategy would require a lot of diligent study and practice; It would require years of hard work, something Ikta Solork actively avoids. Also, we learn as early as episode one that Ikta Solork doesn’t like the military, and he states on a couple occasions that he wants nothing to do with them. This flies right in the face of his abilities; WHY, when he’s that lazy, would Ikta devote so much of his time and energy to master the art of war, especially when he hates the military? It doesn’t make sense! Consider this; Ikta, for better or worse, is a real smooth talker, and apparently has the skill (or connections) to forge a new identity. Why then, if he’s that good, would he not choose an easy place, far from war and full of women, to live his lazy life, since that’s what he clearly desires? It just doesn’t add up!\\n\r\n“OBJECTION!” a fanboy squeals, dropping his pizza to hammer on his greasy keyboard, \\n\r\n“Ikta’s father was a general! His dad must have taught him all he knew! He only hates the military now because they put his father in prison!”\\n\r\n………………………………Okay, I guess this was inevitable. \\n\r\nTrite and lazy as this explanation is, it’s the best, and most logical response I’ve been able to find, but its still wrong. Here’s why; If you visit any high school, and even places like my college, you’ll find people who don’t want to be there; they take a seat in the back, clearly indifferent to whatever they could be learning. Many of them are actually decent people, but they’re lazy. They’re there because they have to be, or don’t have anything better to do. Just because you lead the horse to water doesn’t mean he’ll drink. I bring this up because Ikta is in a similar spot. In all honesty, I think it’s perfectly reasonable to assume his father’s imprisonment, and later death, sparked Ikta’s hate for the military. However, this doesn’t change the fact that Ikta Solork is, and was, a lazy, arrogant turd. It is unlikely that his father, as a general, would take his family with him on deployment (especially in that world/time period) and even more unlikely that he would have the time or patience to instruct a young Ikta in the ways of war. But even if you did try to burn some smarts into little Ikky’s brainpan, you can’t make him care; He just doesn’t have to, and I’d put money on the fact that he wouldn’t. Why? Well, they say like father, like son; his father, as mentioned before, died in prison. We learn in episode two that Ikta’s old man didn’t respect authority either, after disobeying orders one too many times, he had his command revoked and got thrown in the joint. \\n\r\nYes, Ikta Solork had a fine role model indeed.\\n\r\nBut even if Ikta did, for some reason, want to be a soldier as a kid, it strains credulity to think he could learn all that before his father’s humiliation and, we assume, his corresponding change of heart toward military affairs.\\n\r\nNone of it adds up. Nothing. Zilch. Nada. \\n\r\nOh look! The fanboy returns! Actually, this next objection came from a friend of mine who, in case you’re wondering, lives in his mum’s basement, and has probably forgotten more about hentai than you and I will ever know. \\n\r\nListen to this, \\n\r\n“Well… Maybe he (Ikta) is just naturally talented, y’know? Some people take naturally to things. maybe he’s just good at it.”\\n\r\n……………………………………………………………… Story time: As I’m writing this, the Olympics are happening in Rio, and Michael Phelps is out there doing what he does best; swimming. I don’t doubt that Phelps took quite naturally to swimming, but talent alone didn’t win him Olympic gold. \\n\r\nI don’t need to explain this to you. \\n\r\nFolks, if you think people like Ikta Solork are “going places”, or that laziness breeds success, life is gonna give you a hardy bitch-slap one day. “Maybe he doesn’t have to try, maybe he’s just that good at it.” This argument is morbidly depressing, and I have only one thing to say for it: You wish. \\n\r\nBut they do. And Ikta Solork turns right around and says “wish granted”.\\n\r\nThe contradictions don’t end there.\\n\r\nIkta is lazy, but he mastered advanced skills.\\n\r\nHe’s selfish, but he jumps into the ocean in a storm to save a girl he doesn’t know.\\n\r\nHe doesn’t think much of others, but gets sentimental when they bury a fallen enemy.\\n\r\nHe threatens the princess’ life for badmouthing his mum, but has no reservations about having sex with his squad sergeant’s mother. Seriously. If the dude's that protective of HIS mum, could he really do that to someone else without flinching? Thats a fucked up (and inconsistent) set of ethics.\\n\r\nAnd on that subject, what about a few old ‘rules’ of storytelling? ‘Cause he screws them too, right up main street and not gently. It’s hilarious; the handwriting is on the wall in bold print by the end of episode one when the narrator drops the line “He will come to be known as the invincible, lazy general”. This statement renders all emotional stakes null and void. After all, why should we worry, let alone care about a character that can’t lose when his military exploits are the focus of the show? It’s a foregone conclusion that he’ll become a general, and when he does he’ll be the same old lazy bum he’s always been. Where are the stakes? This declaration of Ikta’s impending success tells us that Ikta is never going to change or develop as a character, he’s never going to lose, and he’ll never be required to exert any visible effort to achieve his goals. I’m baffled that they thought this was a good idea, but I can still see why; you see, Ikta Solork is first, and foremost, a product, carefully designed to sell to his audience. Despite Ikta’s obvious problems, his character is tailored in a way that makes its easy to rationalize absolutely everything about him, including his unrealistic skills. Its absurd; it makes me want to laugh and vomit blood at the same time. Even now I can hear the voice of that old fish dude from Star Wars in the back of my head saying “It’s a trap”.\\n\\n\r\nIn the end, Ikta Solork is just a fictional person, and this aint the inquisition. Is he a bad character? Yes. Did I go a bit overboard? Yes, and for that I apologize. I like to keep things light, but after Alderamin I forgot how to smile. Guess I’ll be re-watching Konosuba again.\\n\\n\r\nThere. I’m done.\\n\\n\r\nContrary to popular belief, I actually care what you have to say, so if you liked this, or think I missed anything important, let me know, I’d be glad to hear it. \\n\r\nAnyway, thanks for reading.\\n\\n\r\n---The Peasant\\n",
            "date": "2016-10-01T21:12:00+00:00",
            "helpful_count": 29,
            "mal_id": 230845,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5229982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PeasantChan",
                "username": "PeasantChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=230845"
        },
        {
            "content": "Just skip to the TL;DR because i dont want to spoil the entire show.\r\nThis show suffers from the plague that are LN tropes and a weak writer. While it was really easy to watch and the premise was somewhat interesting i found the final product to be quite average.\r\nThis is a show that had a lot of potential and you could see how it could be amazing but it failed miserably, i would say it was disappointing to see what could have been a great show become this.\r\nCharacters- The main character and the red haired girl have a interesting relationship, but thats about it, notany of the other characters are worth mentioning. Yeah they exist, they have their place in the story but they are barely memorable.\\n\\n\r\nIn fact i actually think the best character in the show was a side character that showed up in a few episodes, unfortunately i cannot recall her name, ill just call her soldier girl.\\n\\n\r\nThe worst character was without a doubt clan leader girl, everything that happens around her is just one big coincidence, wouldnt really want to spoil things though.\\n\\n\r\nStory - It peaked around episode 8, its not exactly the best story ever but there are a few moments that where pretty well executed. The tactics used where pretty interesting.\\n\\n\r\nIts very difficult to stay immersed in this story even though it is a easy digestible and fun watch.\\n\\n\r\nIts hard to explain why for me this didnt work, while the story seemed pretty good. It had a lot to do with the dialogue of the show (calling things lazy when they are just efficient and repeating it over and over again. Or calling things scientific for no reason). A lot of the \"coincidences\" of the show just didnt sit right with me\\n\\n\r\nArt - Sound - its average, has its moments where its well animated has its moments where its not, the art style is quite boring and so are the character designs. Sound is also pretty average, doesnt stand out at all.\\n\\n\r\nTL;DR- While i do have quite a few complaints with the show i found it quite enjoyable and if you are checking this review to see if you should watch it or not, i say:\\n\\n\r\nyeah watch it, its entertaining.",
            "date": "2016-10-01T06:33:00+00:00",
            "helpful_count": 20,
            "mal_id": 230774,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4415403.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Oiimn",
                "username": "Oiimn"
            },
            "url": "https://myanimelist.net/reviews.php?id=230774"
        },
        {
            "content": "There are no words to describe my desire to rate this show highly. I want to like it, truly, I do. However I just can’t. No amount of rationalization can justify me giving this show positive accolades. \r\nSo the premise is that we have a war between a generic Empire and an equally generic Republic, a war that the viewer barely ever sees over the course of the series. Despite that going on, the viewer spends most of their time with a group of small, but talented, military school students faffing about. It isn’t until a major shift in the conflict thrusts this stalwart groupinto the fire and the flames. \\n\\n\r\nThis premise should make for a satisfying, popcorn-munching couple of hours. The viewer witnesses the rise of a group of military school cadets, who are just trying to survive, amidst the backdrop of two civilizations waging war on an epic scale. Sounds all well and good, yet it falls majorly short of what it could be.\\n\\n\r\nThere is very little reason to care about this conflict. It has utterly failed to give the viewer a reason to be emotionally invested in what is going on. Major questions are left unanswered: Why are these guys fighting? For what reason, other than the fact that the MC is on their side, should we root for the Empire? What makes the Republic the bad guys? Why should I care about any of this? For a show that is largely centered about a major armed conflict, there is hardly any reason to care about the nations involved. \\n\\n\r\nWe are told so little about this world. I want to learn more about the Alderan Church, those spirit creatures, and more of the people of both sides. I want to see the history of these two nations, and how they came to be enemies. There are so many shortcomings in the world building. As a result, I grown to not care about the Empire, or the people that live there. I care even less about the Republic, because I know even less about whatever that place is.\\n\\n\r\nAnother major letdown are the characters. The only real characters of note are Ikta Solork and Ms. Igsem, and the only noteworthy character relationship is between these two. Their classmates are uninspiring at best. The rival genius character that is supposed to go toe-to-toe with Ikta arrives far too late to establish any sort of history and dynamic rivalry with Ikta.\\n\\n\r\nThe plot, while it does have satisfying moments, still leaves room for improvement. Until the final arc, there is no sense of tension for most of the show. Ikta is a freakishly smart military genius, his victory is assured. There is never any doubt in the viewer’s mind that he will win. It suffers the same problem that I had with No Game No Life: the characters are simply TOO GOOD at what they do. It’s just not fun.\\n\\n\r\nBOTTOM LINE: A Potentially great military drama seriously held back by sub-par world building and lackluster characters.  NOT RECOMMENDED.\\n",
            "date": "2016-10-02T14:25:00+00:00",
            "helpful_count": 19,
            "mal_id": 230930,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4639701.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fijiwuiji",
                "username": "Fijiwuiji"
            },
            "url": "https://myanimelist.net/reviews.php?id=230930"
        },
        {
            "content": "One of my favourite kinds of story is the one the involves an unlikely hero who leads a team of underdogs against a vastly superior opponent. Alderamin on the Sky fits most of the criteria and that's what drew me to the show.\r\nThe plot of Alderamin is simple and easy to grasp; it's focussed on the war between two nations and the trials of a group of soldiers within that war. While the plot isn't unique or outstanding, it's execution in Alderamin is remarkable. The show focusses on the tensions that arise due to the warring nations and the various connectionss and conflicts involved. Agood example is a focus on the relationship between an invading army and its captives (for want of a better term).\\n\\n\r\nThe show starts out a bit slowly but introduces us to its central themes almost immediately: the MC and his colleagues are involved in a brutal battle that's resolved by the MC's brilliant application of strategic thinking. We're also introduced to the main characters and the concept of spirit partners. Unfortunately, the spirits aren't explained until later in the show.\\n\\n\r\nThe art in Alderamin is gorgeous and I'm not exaggerating. The characters, both male and female, are pretty; sometimes, they're too pretty as is the case of Princess Chamille. The backgrounds often had the right tones applied and weren't too colourful or bland. The animation, especially in the battle scenes, is quick and fluid although it's a little inconsistent in the less excitable scenes. One gripe I did have with the art was the sometimes inconsistent body proportions. For example, Haru's shoulders were sometimes broader than they usually are.\\n\\n\r\nI wish the music in Alderamin was as wonderful as the sound. While the scores weren't, they weren't memorable either and often didn't evoke the emotions their accompanying scenes required. I often use music to remember key scenes in anime but none of the scores did that for me in Alderamin; the battle music wasn't epic and the sad melodies weren't gripping enough. On the other hand, the opening theme for Alderamin was full of action montages that always whet my appetite for each episode and closely matched the show's overarching themes. The ending was a little more dramatic and didn't seem to fit the show's theme.\\n\\n\r\nThe sound effects in Alderamin were well-rendered and often depicted their associated objects accurately; I especially liked the booms from the weapons. They were sometimes exaggerated; the sound of blood in an open wound often sounded too 'squishy'. The voice acting was at par with the sound effects, albeit not as emotional enough. Music and sound in Alderamin seemed to shine more in the action scenes than the more dramatic ones.\\n\\n\r\nAlderamin is a refreshing take on the unlikely military hero 'subgenre'; Ikta Solork is a brilliant but lazy MC with interesting quirks. He's bold but not mindless and gives his decisions a lot of thought; he loves women but isn't shy and flirts freely; he's powerful, over-powered even, but is lazy. He's teamed with a cast of somewhat generic main characters; Alderamin's strength lies not in its characters but in their relationships. Yamori is a generic female lead in a battle anime but she shares an almost telepathic relationship with the MC.\\n\\n\r\nI didn't like the lack of character development and the mostly underwhelming antagonists. I would have loved to see some of the other characters push their own motives and encounter personal conflict. I felt like the show would have fleshed out a few extra characters had there been more episodes.\\n\\n\r\nOverall, Alderamin is a great tactical battle show that doesn't play down core war themes. It has great art and animation and passable music and characters. It does seem like a precursor to an even better show.\\n\\n\r\nOverall: 7\\n\r\nStory: 6\\n\r\nArt: 8\\n\r\nSound: 6\\n\r\nCharacter: 6\\n\r\nEnjoyment: 7",
            "date": "2016-11-06T02:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 233315,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647223.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gnerkus",
                "username": "gnerkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=233315"
        },
        {
            "content": "This is an incredible series with one fatal flaw not even the Lelouch clone could foresee: there is no conclusion whatsoever. Everything in Alderamin is geared towards successive seasons but those haven't materialized and it's been almost three years; I think it's safe to assume any further plot development is resigned to largely-untranslated light novels.\r\nSo, what do you get for the 13-episode time investment? \r\nA meticulous world built around unique but similar technology, believable civilizations and the space they occupy, and characters with solid motives and backgrounds who are voiced to perfection (with the exception of the Captain). Most of the technology and spirituality islargely unexplained, but in my opinion this was deliberate as preparation for subsequent seasons in order to not overburden the narrative with filler; to that end, it's actually to be commended as I find artistic restraint sadly rare.\\n\\n\r\nThere isn't much to be said for the plot without ruining it all (and anyway, every review on here spoils it and/or repeats the summary in order to sound erudite), but it was certainly enjoyable. For those who cannot stand discarded plot strings, though, you'll be enraged at how many loose ends there are--and that's beside the fact this series ends with no meaningful tie-off.\\n\\n\r\nIf you're able to overcome that this inches closer to a future without a followup season by the day, you won't be disappointed at all. If you can't, then don't bother starting it.",
            "date": "2019-03-19T22:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 303892,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=303892"
        },
        {
            "content": "War, HUH, what is it good for?\r\nStory:\r\nThis is an anime about war, but set in a fantasy world. This creates some problems for me, though. The point of war stories is the fact, that war is a terrible thing, kills people and hurts the innocent. To have this happen in a setting where technically, everything is possible, as we don't know where the boundaries of this world are, heavily weakens this point. On top of that, while we are presented with the downsides of war here, stuff like Yatoris killing rampages and Iktas tactical manoeuvring are presented as cool and awesome. There is a weirddouble message going on here, that prevents this anime from having a real identity.\\n\r\n4/10\\n\\n\r\nArt:\\n\r\nThe battle scenes look pretty good, but they aren't the focus of the anime. While the character design is solid, the animation is not very fluid at times. I'm sure that with a higher budget, they could have done a lot more.\\n\r\n6/10\\n\\n\r\nSound:\\n\r\nThe opening, while hardly fitting the setting, was pretty good. The ending was the usual \"so okay it's average\" ending. Voice acting was pretty good to be honest, especially the main characters did a very good job.\\n\r\n8/10\\n\\n\r\nCharacters:\\n\r\nI found the two main characters, Ikta and Yatori, to be very unlikeable. Ikta is a pretty arrogant know-it-all, who apparently is smarter than the rest of the military combined and who can do no wrong, even if he does. He also has no problems with doing things, that would make you a war criminal in real life, like burning down a civilian village or threatening to kill somebody during negotiations. Yatori is merely a puppet of the government and army. She even outright states that she would kill Ikta (a friend who is like a brother to her) if she was told to. Are those characters supposed to be our heroes? The rest of the cast is a lot better, but none of them gets enough screentime to mean something.\\n\r\n3/10\\n\\n\r\nEnjoyment:\\n\r\nYou probably guessed already, that I didn't really enjoy Alderamin much. This anime doesn't seem to know what it wants to be, a grim war story or a boring shounen or maybe a fantasy adventure? It surely isn't all of that combined, it rather switches between those. In the end, I did not feel entertained by it. It probably could have been better, but the fact remains, that it isn't.\\n\r\n4/10\\n\\n\r\nOverall:\\n\r\n5.0/10",
            "date": "2016-10-08T12:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 231355,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=231355"
        },
        {
            "content": "It is possible to state that this anime has serious problems in pleasing the public. The sales of the material are the clearest proof that people were not pleased, mainly in view of the script, characters and technical elements. Soon though a media note on my list is still an anime not recommended.\r\nThe plot is pretty predictable on everything in the initial situation involving the first three episodes, thus being expendable and short of the rest which is not very good either. In every work even when it escapes from predictability it appeals to a nonsense, childish, unsettling and unpleasant. Partly because of the elementsof fantasy, for example the use of \"spirits\" that do not fit the proposal, or a more serious genre that is required for it to be good, and also of the unbelievable dialogues that plays the viewer to out.\\n\\n\r\nFrom the characters since the beginning of the anime already makes a bad presentation and continues with a poor development of the same in the following episodes. These are boring, shameful conversations that make you want to give up right there in the first episode. Some fall into oblivion and others do not gain charisma or weight due as Haroma, Matthew are two featured prominently and the rest are erased.\\n\\n\r\nIkta, and Yatori are lacking in progression, they do not evolve at all with the passing of the anime, beyond the military patent. Ikta is the most complicated because he is a character who does not learn, but is given the duty to teach, and does not fulfill this role. As an example the scene of Ikta cutting his own finger in pieces, what a moral, valuable and intelligent conclusion can be drawn from it. Already the Yatori is one-dimensional, bodyguard superforte who was born and will die for it, this everything, end. If one day make a list with the worst protagonists of characters of animes they deserve place in her with certainty.\\n\\n\r\nTechnically the traits are not pleasant, with noticeable variation between the episodes, the environment is terrible, the opening is without thanks and the soundtrack is forgettable. The contrasts of colors and senarios do not match, in some moments it seems that if it is leaving Simbad the Marujo and entering the second mudila war, in others it is not in neither of which is worse. Resulting in an environment that is not believable, it is too fantastical even for a work of fantasy.\\n\\n\r\nIt's a multi-colored anime, but it's not good either. After a bad initial bow, comes a medium, but soon pauses and comes a break of climax that extends through several episodes, until a new and last conflict. The climaxes are bad for invoking solutions of amoral form conflict, without reflective call and not even do not fulfill the intention, because they do not convince in demonstrating intelligence that the narrative tries to impute to them.\\n\\n\r\nThere is lack of depth, dilemmas, philosophy, things to make people weigh, reflect, and take an interest in the work. There would be only fighting, but fluidity and special effects are not as interesting. In short it is a very shallow and forgettable work.",
            "date": "2018-01-08T04:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 267909,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6835240.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tiago_Vaz_07",
                "username": "Tiago_Vaz_07"
            },
            "url": "https://myanimelist.net/reviews.php?id=267909"
        },
        {
            "content": "This one took a while to grow on me. At first it was interesting. Then, about halfway through, I got annoyed at it because the main character was acting in a way that made no sense. Despite this I continued to watch it because it had started out so well and it had gotten its hooks into me enough that I really wanted to know what would happen. Thankfully, as I continued to watch, it all came together and I ended up really enjoying it. \r\nJust a little lesson not to condemn an anime because it takes a little dip mid season. (Although I havepushed through a lot of dips like this in the past only to be completely and utterly disappointed in an anime because it only got worse and worse...sigh). In any case I am very happy I continued to watch as the 'dip' ended up not being a dip at all: all my concerns about Solork's actions were washed away as the story developed. \\n\\n\r\nNejimaki Seirei Senki is a cut above most in the military battle genre. The characters are strong and intelligent and although the main character, a genius strategist named Solork Ikta, can be a little too perfect on occasion, (making him more saintlike than sympathetic) overall he is still human enough to root for. \\n\\n\r\nThe story is set in a separate fantasy universe with access to magic (which is not a major factor in the conflicts), swords, crossbows and basic guns. The story revolves around a group of young military cadets. The fights are quite visceral and generally more focused on soldiers, tactics and strategy than on grandstanding heroes. I would recommend it to anyone who enjoys military strategy, likes seeing close friends go through tough times together and watching the evolution of a normal(ish) guy into a 'hero' (quotation marks are provided to prevent the main character Solork getting angry with me...). Keep in mind that the story is screaming for a second season that will almost certainly never eventuate but hey, what is there is good stuff. This is no masterpiece, there are times when the dialogue is a little forced and the plot can sometimes be predictable but overall it has a solid story, good characters and is easy to watch.\\n\\n\\n\r\nSPOILERS - Why did I get annoyed at this anime? Because the main character, a guy who keeps on (and on and on) saying how much he does not want to be in the army, does not want to fight and how being lazy is the best way to live continues to bloody his hands in pointless battles for (apparently) no good reason...but stick with it, the reason reveals itself as the anime continues. It is revealed so subtly that I almost missed it...\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\nSPOILER of my \"SPOILERS\" section - If you haven't seen the anime yet please don't read this and try watching it first - Solork (the main military genius) speaks to Igsem (the firebrand dual sword wielder) in a quiet moment during the forest fire siege and says the only reason he joined the military was to try and make things a little easier on her. And that was it...no fanfare, no I love you or you are the best friend ever or let's run away together leave your swords behind so we can be super science nerds etc and so forth, just a small comment to explain a hell of a lot of effort on his part. If you blink you will miss this moment (especially if you are reading subs), but it completely made the anime for me, everything he did made sense after that small sentence. Nice.",
            "date": "2018-04-22T04:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 278695,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/youkos-o-ssu",
                "username": "youkos-o-ssu"
            },
            "url": "https://myanimelist.net/reviews.php?id=278695"
        },
        {
            "content": "In the midst of the star-studded Summer 2016 anime lineup, there's one particular show that I missed out on watching at first and that show was Alderamin On the Sky.  \r\nLet's get started with the story, shall we? The story follows the adventure of Ikta Solork, a lazy and laid-back teenager together with his friends and comrades. Using his tactical brilliance, he must defend his land. Yes, the plot may not sound original, but believe me the anime executed it brilliantly. How? It lies in the characters.\r\nIkta is not your typical male Shounen MC. In fact, he's the exact opposite of it. He's thekind of character you can't help but hate at first, but slowly you will root for him later on. One of the interesting aspects of the show was the dynamic or one could call it platonic, relationship between the two lead characters which is rare to find in anime nowadays. Even Yatori is not your typical, damsel in distress heroine. I won't spoil anything, but if you liked your female MC to be strong and badass, she won't disappoint. The supporting cast, though, were just so-so in terms of development. The 13 episode count didn't help either.\\n\\n\r\nMoving on to the animation, I would say it looked gorgeous at times, especially during the action scenes which can be bloody and violent, but overall for an anime released in 2016, it just looks average at best. I certainly didn't expect that from Madhouse, the studio that produced a large number of stunning and beautiful anime adaptation. The same goes to the soundtrack. Nothing too memorable that I can think of, even the OP and ED.\\n\\n\r\nYes, it's nothing outstanding, but it certainly was an enjoyment to watch as a whole. Just don't expect anything conclusive in the end, since the LN and manga are still ongoing which is one of the reasons why I kept the overall score at a 7.\\n\\n\r\nOverall, I can see why a lot of people decided to skip on this show, but if you have enough time to spare, give this one a try. It may surprise you-in a good way. \\n\\n\\n\\n",
            "date": "2016-12-07T11:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 235035,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5762326.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ace_39",
                "username": "Ace_39"
            },
            "url": "https://myanimelist.net/reviews.php?id=235035"
        },
        {
            "content": "Review #9: Alderamin on the Sky\r\nStory 7/10 -- The story was a bit underdeveloped, with a limited amount of progression over the 13 episode period. The hero is an officer with different \r\nworld views, who sees the war as pointless and truth be told it pretty much is. One of his first teachings to his fellow soldiers is that war should never have lives thrown blindly away. With this mindset, he quickly becomes one of the countries best tacticians, which ultimately seemed positive until he faces enemies of similar caliber, confirming suspicions that losing will be inevitable. There was a lot of potential in thisstoryline, but these Fantasy War animes always lack building of plot in one cour seasons. Also there was limited footage outside of the battles the commander faced, making the empires and setting unimportant to the overall story.\\n\\n\r\nArt 7/10 -- The art is very sharpened, which is okay, but sometimes the lighting seemed awkward. The Main character is pretty default, but the supporting cast looks more unique then average. The scenery and backgrounds are pretty good, but the color lacks pop scoring the art on par with most animes.\\n\\n\r\nSound: 7/10 -- I watched this show dubbed and subbed. The OP/ED were mid tier, but flowed well with the anime. The English Dub actors were a good and bad matchup with voices. There was some background sound used which was standard. The dialogue for supporting characters was cliche to average, while the main characters had some good conversations and lines.\\n\\n\r\nCharacter 7/10 -- This is studio Madhouse, we know how well they make characters look good in most of there series. However this was one of those series that you wished they did more. The main character played his role well, while the supporting mains were rather average. Yatorishino was a badass that was underused, while the annoying princess cliche defines Chamille's character. Matthew and Torway were actually good male characters but they lacked any development and were outshone by Ikta. Haroma was more romance bait, then a character of importance. Madhouse really underused their main characters in this anime, which was disappointing because all there backgrounds and personalities had good chemistry. Ikta's awakening would come after events that happened to a crowd approved supporting character, and the last battle did well to prove his ability and character as a tactician.\\n\\n\r\nEnjoyment 8/10 -- Even though all the technical categories were rated as good, Alderamin is still a pretty enjoyable anime. The First episode is a pretty good hook when six students cross the border into enemy lines on a stormy day. The series continues as an underdog story that perfectly contrasts with the main characters personality. A weak empire relying on a lazy, carefree commander for survival in a war of young bloodshed. The whole irony is entertaining, while the reality of the war is quite saddening as the main character was pretty much right in the beginning. There really is no reason to be fighting for the Katjvarna Empire, however he chooses to anyways after seeing the turmoil war leaves in its reckoning.  \\n\\n\r\nOverall 7/10 -- Alderamin on the Sky is a standard fantasy war anime. The storyline setting was overly underdeveloped for a single cour series. Madhouse is known for good stories and character development, however I would say this series wasn't one of their best works. The Art and sound quality is average, while the character development had much untapped potential, and it was hard to judge how many characters were main ones in this anime. There were many war cliches thrown into this, but Ikta does a great job moving the anime away from tropes, and positively builds on this wars realism where young kids are dying out of fierce loyalty for their friends and country. I enjoy shows where both genders fight and work together to achieve a greater cause, and Alderamin builds a pleasant unity in the army that can be supported when they succeed, but also be tragic when they lose. Overall it's a good mid-tier series from Madhouse, and I recommend it to any Fantasy/Military fans. This anime isn't about fan service, it's young heroes that blossom when under pressure to become real men and women.\\n\\n\r\n~Castawayz",
            "date": "2018-02-23T10:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 272252,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=272252"
        },
        {
            "content": "I've been searching a long time for anime like this.This masterpiece is combination of filthy truth about war,great soundtracks,pretty good combination of characters and drama with 8-9/10 picture.\r\nMC is combination of laziness,great tactics mastery,satire and humanity.Decisions during the story line will be really hard and game changing.\r\nAlso all supporting characters are very colorful and you will remember them for a long time\r\nHighly recommend Alderamin for guys who like dramas.Because it is war,every one can die,your favorite characters are not immortal.\r\nI really enjoy watching Alderamin,like i did when Guilty crown came up.It is very upsetting that only 13ep. is planning to be,because it would be agood 100+ep.project.Many characters stories are not explained and many things are in fog of war\\n\\n\r\nP.S Don't judge me too hard,its my first review ^.^",
            "date": "2016-11-01T17:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 233044,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5151051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PleaseStayWithMe",
                "username": "PleaseStayWithMe"
            },
            "url": "https://myanimelist.net/reviews.php?id=233044"
        },
        {
            "content": "War strategies, war tactics, and war. This anime strays away from the everyday plot of magic and sport and cooking and focuses on the aspect of war in this WWI-esque anime. \r\nStory: 7\r\nThe story, by any means, isn't the craziest. It's a small part of something bigger. It mostly demonstrates the MC's genius as a commander.\r\nArt: 8\r\nI personally like the art style in the anime compared to the manga. People were especially upset about the anime not looking like the manga. However, the characters look more human like, and although they're not the prettiest faces, it's a unique change from other animes. The MC inthe manga looks like a total dope, and Yatori looks like a generic anime character.\\n\\n\r\nBackground art and anime are standard, which is bretty gud if you ask me.\\n\\n\r\nSound: 9\\n\r\nThe opening is really good, the ending is ok (starts off with a nice mellow piano and vocal then all this techno garbage comes on 10 seconds in). Lots a gun noises and sword slices, which is appropriate for a war anime. \\n\\n\r\nCharacter: 6\\n\r\nLike I said, the anime is apart of something bigger. It's hard to create such depth in character in 13 episodes. I mean, the whole science complex the MC has going on is pretty neat.\\n\\n\r\nEnjoyment: 9\\n\r\nI really liked this anime. I'd rather watch it with this art style than read it with the manga's art style, to be honest. But, this anime didn't turn heads during the summer split so I really doubt this anime will get a second season. \\n\\n\r\nOverall: 8\\n\r\nIt's good. Something to tide you over, unless you really like WWI-esque stuff then you should read the manga. Manga's pretty solid once you digest the manga's hideous MC.",
            "date": "2016-10-30T10:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 232902,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5565392.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nigwin",
                "username": "Nigwin"
            },
            "url": "https://myanimelist.net/reviews.php?id=232902"
        },
        {
            "content": "Haiku Review:\r\nUnderrated Show\r\nCode Geass Meets Ginga Eiyuu\r\nGo Read Light Novels\r\nMAL won't allow only the Haiku, so I'll put in a useless explanation that you don't need to read.\r\nAlderamin is a military show about the military genius Ikta Solork and how he becomes known as the Invincible Lazy General. Code Geass parallel comes from the relationship of Ikta with Yatori as well as the obvious military aspects of the show, but Ikta is no Lelouch. If anything, he shares more similarities with Yang Wen Li of Ginga Eiyuu/LOTGH. \r\nWhile the anime is a great standalone adaptation, knowing that it is made by MADHouse and the waythe adaptation chooses to relay major plot events are two great clues that it will never get a second season. It is a giant advertisement for the Alderamin light novel, and great pity that it is merely an advertisement because of how well done it is. For that reason, I cannot recommend the show as a complete story, though for those willing to watch a 4 hour ad for a light novel, this is a very entertaining one.",
            "date": "2019-04-28T01:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 307301,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/weewaaweewaa",
                "username": "weewaaweewaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=307301"
        },
        {
            "content": "Alderamin was one of the animes of the season that wasn't too hyped but enjoyable to watch. Normally, I do not watch many military themed animes, but the core aspects of a genre like so definitely shows here. The characters know that war is not all fun and games and the seriousness of war is depicted throughout the episodes.\r\nThe story was reasonable - two sides are at war and the MC and his friends are caught up on it. However, I have found at times not much development happens for maybe 1 episode, followed by a great combat scene in the next episode. So yeah,the pacing did not suffice with me. I feel like Alderamin would have shown more success if we could spread out the story to 25 episodes.\\n\\n\r\nNot too much complaints with the art and sound. The art style was a bit different but nothing significant or bothersome to me.\\n\\n\r\nOverall, I enjoyed the anime. By no means is it perfect but it is definitely worth a watch. The story may be slow to pick up but I would give it a few episodes before the pacing picks up.",
            "date": "2016-10-05T07:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 231138,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3459389.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/red0fighter",
                "username": "red0fighter"
            },
            "url": "https://myanimelist.net/reviews.php?id=231138"
        },
        {
            "content": "Brilliant, intriguing, captivating & thrilling.\r\nI wrote an earlier review before, giving this show a solid 10. After the conclusion of this show, I'm proud to say it remains unchanged.\r\nBy far, this is easily one of the 'MUST WATCH' anime of 2016. Though SHORT, but they did a great job keeping me at the edge of the seat for 13 episodes. \r\nThank you Madhouse for another brilliant light novel adaptation.\r\n----------------------------------------------------\r\nThe story grew more and more interesting as time passes by. The show doesn't feel much of a rush, taking its own sweet time to develop each characters (particularly Ikta, Yatori & Chamille). Soundtrack & narration wise,I'd say it fits & blends well with the show.\\n\\n\r\nViewers will often find themselves at the edge of their sits wanting for more. Though the 13 episodes felt kinda short, it has demonstrated the potential that this show has. \\n\\n\r\nTo keep it short, you WON'T be disappointed by what the show has to offer but you'll be disappointed if you skip this show. \\n\\n\r\nShort Conclusion:\\n\r\n- MUST WATCH Military/Action Anime of 2016\\n\r\n- A MUST WATCH for Military enthusiast \\n\r\n- Romance Subplot\\n\r\n- One of the 'top' anime of Summer 2016 (which was a dull season)\\n\r\n- Great alternative to Action Mecha/Supernatural shows (this year's anime industry are saturated with Supernatural/Mecha action shows)\\n\r\n- Awesome animation & art! Fight-scenes will leave you at the edge of your sit\\n\r\n- Brilliantly lazy & interesting MC, with an awesome cast\\n\r\n- Each episode will leave you wanting for more\\n\\n\r\nWith that being said, this show goes straight into my 'personal favorite list of 2016'.\\n\\n\r\nUntil then, I pray for season 2 to happen.",
            "date": "2016-10-02T03:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 230868,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5398172.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GokuNazz",
                "username": "GokuNazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=230868"
        },
        {
            "content": "Tenkyou no Alderamin it is then.Well this anime is hands down the positive surprise of the summer season and propably the best if u exclude some anime continuations (like food wards). Fantastic pace and story telling with an extremely interesting MC.\r\nStory 8/10 : The Story wraps up around Iktra Solork a guy that joined the army against his own will in a sense, and he is left with no choise but to defend his country. THe story build up is exceptional episode by episode.In my opinion Tenkyou no ALdermin is a perfect example of how u can compress an anime into 13 episodes and stillbe satisfied by it.\\n\\n\r\nThe pace of the story its one of the biggest prons of the anime, it is exceptionally balanced and it never literally never feels rushed or slow.\\n\\n\r\nThe use of romance/action sequences /story telling and the tactical battle is very well handled. I am specifically impressed of how well they balanced the romance in this(IKtra is a big womanizer).They used as much time as they should.\\n\\n\r\nArt 7/10 : Nothing exceptional here, stylistic it was fine. Could have been much betetr though. especially in the xlothing aspect\\n\\n\r\nSound: 10/10  top tier music. Fantastic job by inaj Keji. High quality of music  during the anime and  right use of it in pivotal moments.But the quality itself is outstanding.\\n\\n\r\nCharacter 8/10 :  that would have been a 9 if some of the characters werent a bit under-developed. That being said  IKtra Solork is one of the best and most importantly interesting MCs i've seen in a while. He is a lazy muppet a womanizer and an exceptional tactisian. I love his calmness and his reactions(too many overractive MCs  the last seasons) he has a very specific way of perciving things and confronting them.Igsem is also interesting but is one of the characters i wanted to know more about her past since she is close.\\n\\n\r\nEnjoyment: 8/10 overall  8/10\\n\\n\r\nDefinitly in my opinion the pleasant surprise of this sumemr season. I enjoyed every single episode of the anime with his fantastic music very interesting MC and very solid pace.",
            "date": "2016-10-01T15:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 230820,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3389493.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Subxaero",
                "username": "Subxaero"
            },
            "url": "https://myanimelist.net/reviews.php?id=230820"
        }
    ],
    [
        {
            "content": "Nejimaki Seirei Senki: Tenkyou no Alderamin is a 13 episode anime series based off a currently publishing novel series. Odds are, you already have realized a couple things, but if not here they are now: First, this series tidies up an arc at the end, but it otherwise has an open ending. Second, odds are there won't be a second season; if lucky, there will be an OVA in the future, but it likely won't even be that. So, if these two factors are a big deal, you may want to wait on watching the series. If you don't mind, continue reading for a moredetailed review.\\n\\n\r\nStory: 9\\n\r\nThe anime is essentially composed of a few sections, which each section tidying up neatly, while still being open to the next section. This allows the anime to flow nicely, though unfortunately, also leaves the series with a somewhat open ending; though the arc is tidies up, the viewer is left knowing that much is to follow along with foreshadowing, and it just isn't covered. Granted, anime based off of light novels serve not just to gather and entertain viewers, but to serve as an advertisement of sorts for the novel series, so this is to be expected.\\n\r\nAs for the specifics, while the whole premise isn't made entirely clear, enough information is given to where the viewer won't dwell on the lack of information; also keep in mind, it's common for lots of details to miss making it from the novel series to the anime, so for minimal omission to seem apparent is pretty good on the anime's part. The setting seems to be perhaps a fantasy enlightenment period, with the main contrast being the female military uniforms, which have leggings and school skirts (since how could any anime girl not wear a pleated skirt as part of her main outfit?). Though the fantasy element is light, involving only the use of spirits (which some scenes may have you wondering whether they are fantasy or more sci-fi), the implementation of the spirits in the series adds to the fantasy feel.\\n\\n\r\nArt: 7\\n\r\nWhat can I say? It's not terrific, nor experimental, but it's clear and crisp. Nothing to wow over, but nothing to complain over either.\\n\\n\r\nSound: 7\\n\r\nThe voices suited the characters well I feel. The opening and closing also fit the series. The series does a good job overall with using music in scenes, though there were a couple times where it bordered annoying for me.\\n\\n\r\nCharacter: 9\\n\r\nWhile the main characters fall into stereotypes, they were portrayed well, to where they helped the story. A few of the characters remained rather static, while a few of the others grew over the course of the anime, which fit into the character types. The series also does a good job in reminding us that the characters are in a war.\\n\\n\r\nEnjoyment: 9\\n\r\nThis series had a mix of my favorite genre, favorites character types, and was based of a novel series so I started watching it expecting to highly enjoy it; thankfully, for me at least, it met my expectations. \\n\\n\\n\r\nOverall, I give this series a 9. I can see someone who's into \"typical\" shounen anime finding this series slow and boring, so if fast-paced action is what you're looking for, this series may not be for you. While this is a fantasy military anime, this is of a totally different strain than, say, the Gundam series. If you enjoy seeing what happens behind the action in war scenes, with action scenes involving character's planning counter-actions as much as actual action, this series is one you'll likely enjoy. If a semi-open ending is something that will bug you, you'll have to personally decide whether it's worth watching; if you enjoy this series, by the end you'll be wishing the light novels were being published by Yen Press. Hope this helped!",
            "date": "2016-09-30T22:03:00+00:00",
            "helpful_count": 144,
            "mal_id": 230747,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/62223.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mangastar",
                "username": "mangastar"
            },
            "url": "https://myanimelist.net/reviews.php?id=230747"
        },
        {
            "content": "Alderamin on the Sky isn't an overly impressive anime by all means, but it is enjoyable for what it is. It is a military, strategy themed anime which focuses on the cruel reality of war, politics, and how our MC, Ikta Solork, makes his legend by displaying his superb talents as a strategist. \r\nThe plot isn't original, but that isn't always a bad thing. Alderamin is mainly focused on the war between two neighboring empires Katjvarna and the Republic of Kioka, and the struggles of Ikta and his comrades fighting in the war. Besides the ongoing warfare between the two countries, there are also tensionwithin the empire and other battles with various clans. The usage of strategies are pretty good and the battles are meaningful. Unfortunately, early on, Alderamin suffers from a slow start, taking around three episodes to really get going and not really explaining too much during that time. However, after a couple of episodes, Alderamin quickly grew on me. The first real battle scene they showed brought a lot of promise, and it brought a much needed darker tone to the story. One thing I would've liked explained earlier though, was this little things called spirits who help fight in battle. They are there, but aren't exposed enough until late in the show. To be really honest, I feel like the show could've done just fine without these little creatures.\\n\\n\r\nThese problems could've been fixed had there been more episodes. I always feel like 13 episodes or 1 cour isn't enough for many, especially action/war based anime to really accomplish their full potential in terms of storytelling, characters, and the overall depth. Most of the times, the story will be rushed, and in Alderamin's case, since it started of very slow, the anime suffered from pacing and development issues.\\n\\n\r\nThe animation is the standout point of the series for me. Although a bit inconsistent in pacing at times, Madhouse still impressed me in the end. The efforts they put in each episode in terms of the action is refreshing to see. In an anime like this, awesome battles need to make you feel excitement and hyped, and madhouse delivers just that. The battles are brutal and bloody. The character designs are pretty good and the animation as a whole was crisp.\\n\\n\r\nThe op and ed are great, but a part of me wishes that the soundtracks were more memorable. It is good for what it is; doesn't feel out of place or anything, but it could have been better and more impactful. The voice acting is pretty good for each characters and personalities. We could've used a little bit more emotion in their voice though.\\n\\n\r\nOne of my favorite aspects of the series is definitely the MC, Ikta Solork. He isn't like all those generic, hardworking MCs like other series. In fact he is lazy and doesn't hide his  love for women. However, beneath that layer, you really get to know that he is very intelligent and caring for his comrades. He isn't afraid to take risks in battles and forming strategies. He manages to somehow be badass while having a lazy personality. Although he isn't the greatest character, he is a breath of fresh air from the overdone MC cliches. In a way he could be compared to Itami from the Gate series. Both are lazy and aren't exactly that \"hero\" type but their other personality shines in battles. \\n\r\nAlthough the other main cast is on the generic side, one other character that deserves a mention is the main heroine Yatori. Although she herself could be classified as a generic female MC of any battle anime, it is her relationship with Ikta that makes her likable. Although she is the stronger fighter, you can tell that she still looks up to Ikta's talents and believes in him during when others might doubt his strategies. She isn't annoying nor thinks she is supreme to the MC in any way, which was refreshing to see at times. \\n\r\nBesides the two MCs, the other characters, besides Chamille are a bit underdeveloped. The unfortunate thing about this is that normally, if the characters were entertaining enough, I wouldn't have minded if the development happened later on in the series, but for Alderamin, the other characters aren't just interesting enough. One thing I did like is that the main cast all had a purpose for fighting in the war, whereas in many other anime, the purpose can be buried away without explanation. Also they are actually helpful. However, they certainly could've been written a bit better.\\n\\n\r\nOverall, Alderamin on the Sky is an good show, but nothing outstanding. It starts slow but once the pace picks up, it becomes an entertaining show for what it is. The plot could have been better, the characters could have certainly be explored more, and it indeed stayed on the generic side of things at times, but the intense battle scenes and the fun personality of the MC kept me wanting for more. With the story not yet being finished, we are left with an open ending. Alderamin on the Sky is definitely a worthwhile show to pick up.",
            "date": "2016-09-30T14:23:00+00:00",
            "helpful_count": 70,
            "mal_id": 230664,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3975341.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dream95",
                "username": "Dream95"
            },
            "url": "https://myanimelist.net/reviews.php?id=230664"
        },
        {
            "content": "\"Great soldiers die from overworking\" - Ikta Solork\r\nThis anime was actually quite the surprise where it was presented at first as a typical battle harem anime, but instead brought us an anime about tactical warfare and two rather unique main characters.\r\nThe plot of Nejimaki Seirei Senki: Tenkyou no Alderamin is more focused on it's war themes as well as their religious elements that enforces the war themes and puts them in conjunction with it's interesting characters.\r\nNejimaki Seirei Senki: Tenkyou no Alderamin's chaarcter like Ikta Solork voiced by Nobuhiko Okamoto and Yatorishino Igsem voiced by Risa Taneda are some very interesting characters, Ikta is forced tobe in the army after an incident where he wanted to have a more relaxing life and commonly disobeys the the higher ups (or be smarter than them in general), he is by all accounts a genius tactician but wants to use the easiest or the most peaceful way to resolve things...sure he's a womanizer typical of the battle harem anime, but this really isn't a battle harem anime. As for Yatorishino, she is more or less the main heroine of this anime and is the \"OP class character\", but she develops as to why she has her deadpanned and loyal behavior to both the Empire and Ikta. As for the other cast members like Chamille Kitora Katjvanmaninik voiced by Inori Minase, the third princess of the Katjvarna Empire, Haroma Becker voiced by Haruka Chisuga a medic, Torway Remion voiced by Ryousuke Kanemoto a sniper and Matthew Tetojirichi voiced by Junji Majima the second lieutenant in the main cast group although some do get their small character arcs like Torway and Chamille, the plot tends to focus more on Ikta and Yatorishino as well as it's more serious war storyline than anything else. But for LA's favourite character in the anime it easily goes to the badass Yatorishino...because she's a BADASS, not to mention her relationship with Ikta is a rather unique one from \"typical battle harem fair\". Which brings up a good point, as much as Yatorishino is LA's favourite character and an utter badass, it's Ikta that steals the show with his genius level intellect and tactical cunning on the battlefield.\\n\\n\r\nReally the \"typical harem fair\" isn't a bad thing as it hardly IS a battle harem, instead it's more of a tactical warfare anime and brings up it's themes of war as a template, quite easily it tells us about how \"tradition\" although makes the foundation can't withhold without the passing of time as such Ikta is showing us that things need to change for the \"tradition\" to stay and \"evolve\", tradition being in place of the Empire's military regime and it's evolution in Ikta and his strategies and evolution in military power and really even the themes of this anime can hold the anime on it's own as it is profound in how they execute it. On a grander scale, it also shows the corruption of the \"side\" Ikta is in and how he with his different outlook and genius intellect on the battlefield can change the tide of the WHOLE Empire and raze the corruption with his beliefs of protecting those closest to him and NOT for \"winning\" the praise of the corrupt Empire he's serving under forceful pretenses. \\n\\n\r\nAs later down to line, the plot changes to two \"genius commanders\" going at it a la L and Light just under a warfare setting and really it really exposes how Ikta is on the OTHER side of the \"great battles that whittle down or outright decimate the opposition\", it also once again develops Ikta by going into detail what kind of mental gymnastics he's trying to think up trying to both protect his army and defeat the opposing warring army (by the way it's these kinds of tactical warfare LA really gets invested in). On the supporting side it also shows that Yatrisino will always have Ikta's back even in DEATH really cementing this dynamic of commander and soldier. Because of this kind of focus on Ikta and Yatorishino as well as the \"other genius-equal to Ikta\", the focus really kicks Torway, Matthew and Haroma into minor character status and are really turned into pawns for Ikta in the process. The least developed character all round actually goes to Chamille the Princess as she is essentially in the sidelines as Ikta and his army is trying to defend against this new warring army.\\n\\n\r\nThe plot twists really comes in once Ikta has an equal fighting against him from the later storyline and just seeing the \"game of chess\" these two play and how they outwit each other makes the \"warfare plot twists\" all the more intriguing. Outside from that storyline, it is expected Ikta to survive along with his group and yes for the most part he does, but when other minor characters get into the mix and Ikta WANTS to protect them, that is where the plot twist deaths comes in and some are really unpredictable at times which again hones in in Ikta's belief to protect everyone but even if he has the intellect to do so but doesn't have the power to also comes in. Because of this, Ikta really is a fleshed out character from his beliefs to his intellect to his focus on the plot itself.\\n\\n\r\nIn terms of animation, the animation done by Madhouse, well it's expected of Madhouse to put this much detail in everything and they succeeded once again, from the tactical battles, to the medieval-ish anachronistic weaponry to the polished character designs make the animation look very nice to watch and as for the battles, well some of the best battles and gorn goes to Yatorishino's battles, but the more widespread out tactical warfare has it's animation moments as well.\\n\\n\r\nIn terms of voice acting, well across the board, the voice acting was amazing, though LA's favourite voice actor HAS to go to Risa Taneda as Yatorishino, her \"himedere\" vocals were always great to hear. Not much to talk with voice acting section other than it was amazing and expected LA was gonna go for Risa Taneda.\\n\\n\r\nOhh boy the ending...guess Madhouse has ANOTHER sequel LA wants outta shows they made and Nejimaki is no exception. Yes the ending left at a really great  point in the story and focuses in Princess Chamille and Ikta about the Empire itself and because of what Chamille wants Ikta to do and \"complicated\" notion of doing such a thing has gotten LA intriguing and wanting more which was why yes, it left in a \"read the manga\" ending. Before that the previous \"arc\" between Ikta and Jean (the other genius commander) was left though anti-climactically, once again the tactics Ikta used was GREAT in making the climax of the battle of attrition Ikta and Jean went through all the more worth it no matter how anti-climactic it was.\\n\\n\r\nNejimaki Seirei Senki: Tenkyou no Alderamin by all means has it's problems and strengths as typical for any kind of media but for LA, Nejimaki Seirei Senki: Tenkyou no Alderamin shined when talking about the tactical warfare element as well as Ikta and Yatorishino's relationship as well as in the animation, it's flaws came in that the supporting cast members were nothing but that and some people might see that Ikta as the source of the problem as he is your \"win all OP protagonist under the \"genius\" character\". But with this LA can say that Nejimaki Seirei Senki: Tenkyou no Alderamin has been more of a hidden gem of Summer 2016, seeing a fictional land give realistic terms of warfare and it's implications it has before and after the battle has been done and the dynamic between Ikta, Chamille and Yatorishino shows it in the form of the Empire's corruption, ideals and hierarchy.",
            "date": "2016-09-30T14:12:00+00:00",
            "helpful_count": 55,
            "mal_id": 230662,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=230662"
        },
        {
            "content": "War is not without causalities. Or a purpose. Or strategies. I must admit, watching Nejimaki Seirei Senki: Tenkyou no Alderamin (Aldermain on the Sky) reminds me of many war movies I’ve seen although it’s also quite different than what I had anticipated. Maybe it’s the military gimmicks or the character relationships. But for what’s worth, Alderamin may surprise you in more places than one.\r\nAdapted from the light novel, I was slightly disappointed that the show is only 1-cour. After all, there is more than enough content for a 2-cour length series so when I heard the show would only feature 13 episodes, my hyped dieddown a bit. This may also feel more like a personal opinion but for most war themed series, there needs to be a coherent amount of storytelling that matches in par with its drama. Alderamin’s pacing is questionable at times but not something that gets in the way of itself from succeeding.\\n\\n\r\nThe premise of the show is somewhat complicated. First, we have to understand the setting as it takes place in a world where the Katjvarna empire has waged war against the Republic of Kioka. All sorts of reasons evoked this war ranging from politics, imperialism, royalty, etc. At the center of it, we have 17-year old Yatorishino Igesm (also known as Yatori), a prominent member of the Imperial House noble family. Along with her, there’s Ikta Solork, a womanzing man that also gets involved with military affairs. From the start, their character chemistry is undeniable and it’s known that they have a history based on their background story. Meanwhile, Yatori takes the High Grade Military Officer exam and things get complicated when she, Yatori, and others are stranded deep behind enemy lines. It gets even more complicated when Ikta recuses the young princess Chamile Kitora Katjvanmaninik, who also happens to be the third princess of Katjvarna. Talk about a miraculous coincidence. \\n\\n\r\nIn the meantime, we quickly learn that Ikta isn’t just a womanzing bum but also one with a strategic mind who is not afraid of taking risks. His heroic actions along with Yatori, Torway, Matthew, and Haroma earns them the title “Imperial Knights”. Their reactions isn’t exactly gratitude though so viewers will have to anticipate on the ‘why?’ I have to say, this series has a lot of mystery and most of it isn’t exactly so easy to decipher on paper. The political affairs and character dynamics itself are also part of that. First, we don’t know a whole lot about Yatori or Ikta. Both of them are very different in terms of personalities and background. However, it is shown that they have a good friendship from the past as they once fought for survival together. Meanwhile, Ikta proves himself as a skilled tactician as he is able to come up with brilliant strategies for his party and on the battlefield. On the other hand, Yatori is a top student at her military academy and proves it with her unmatched fighting skills in particular with a sword. She also proves herself as a very hard worker, another contrast to Ikta’s lazy personality. However, both of them do have interesting ideals and reasons to believe in what they should be fighting for. It’s also noticeable that Ikta never really makes a move on Yatori despite his playboy ways. Instead, they share a rather unique friendship. Having being raised under strict circumstances, Yatori discovers new wonders about the world thanks to Ikta during her childhood. All she did before was studying and training.\\n\\n\r\nOf course, Ikta and Yatori aren’t just the main characters. There’s also others that proves themselves worthy of their positions in the military. Torway is a known for his long range sniping skills and handsome face (amusingly, Ikta doesn’t like handsome men in general). Haroma, the healer of the group, is known for being one of the friendliest and shyest character in the series. Finally, there’s also Matthew who starts off as a newbie but steadily works his way up as a worthy fighter. While the show concentrates mostly on Ikta and Yatori’s role, it also doesn’t neglect their comrades. The fact is, war is a dark reality that everyone has to accept. It breeds controversy that leads to hatred which leads to death and sorrow. Ikta is a guy that hates war but still fights for what he believes in. Similarly, others have their own reasons to risk their lives.\\n\\n\r\nAt its core, the show does a fairly decent job at storytelling despite some pacing issues. Most episodes connect each other while some others focus more on characterization. As smooth as it can be, the show does have some fairly predictable moments especially with death of certain characters.  I also have to admit the series does a good job at portraying mixed gender roles. Female officers aren’t always a major focus in military fiction but in this anime, it definitively captures their role and importance. In the meantime, the world building of Alderamin is also a strong factor. Perhaps some of it even has a connection to Japanese history or other related parts of the real world. I can also safely say that the show does a fair job at balancing the lighthearted moments between the more serious, focused segments. \\n\\n\r\nAdapted by Madhouse, I was initially underwhelmed by the character designs. They honestly look like something made from a shoujo manga with their same faces. However, it’s pretty easy to get accustomed to them especially after seeing the characters in action. Remember, this isn’t a love series but a war story. Weapons are also adapted well with fine degree of creativity ranging from the steampunk vehicles, guns, mortars, and elemental spirits. On the other hand, character expressions bounces between impressive to underwhelming. They are fairly well done when characters engage in battle (ex. Yatori demonstrating her sword skills) but during comedic moments, they feel more flat. I can’t say more than that though as this could be more of a personal perspective. However, the background sceneries are constructed pretty well with fine details, rich resources, and really gives the feeling of what a battlefield is like at war. As such, expect violence to occur with little censorship to portray a more realistic feeling of bloodshed. \\n\\n\r\nWell it’s not the best thing in the world but don’t underestimate the music aspects of Alderamin. The cinematics matches in par with the coordinated OST while battle segments are supplemented by the instrumental notes. I am also impressed by Ikta’s voice actor for portraying a character that I initially thought would dislike but convinced me otherwise with his ability to play such a complex character. Risa Taneda’s voice as Yatori is also recognizable if you’ve Shigatsu wa Kimi no Uso (Katori), Strike the Blood (Yukina), GATE (Rory). \\n\\n\r\nWell, if you’re a fan of military fiction and war stories, this is definitely something to keep an eye on. Even if you’re not though, Alderamin takes a unique approach at storytelling with its main characters. Between the politics and character drama, there’s a deeper insight on why events occur. As a 1-cour adaptation though, I am disappointed that some episode feels rushed. In general, LN adaptations usually depend on how much story is being focused. And while Alderamin did its best at that, it still feels like the show didn’t explore its full potential. However, the show is more than just the generic LN adaptations we see with the main protagonist getting a harem. It’s more of a war story that shows no mercy.\\n",
            "date": "2016-09-30T09:31:00+00:00",
            "helpful_count": 48,
            "mal_id": 230637,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=230637"
        },
        {
            "content": "Just what is going on with Alderamin on the Sky? (Re-Upload)(Mild spoilers)\r\nToday I rant. \r\nFor way to long (~6 min.) about a character that way to many people like \r\nIf the anime industry were a living, breathing person, she would likely be diagnosed with cancer. This cancer has a name; Pandering, Faceless Protagonists. Oh yeah, you’ve seen these guys around; anti-social drama queens like Kirito and Ouma Shu; bland bleeding-hearts like Tatsumi (Akame ga Kill); overpowered pretty-boys like Ayato; and, more recently, folks like Ikta Solork, the invincible, lazy pillock. These characters, and the shows they inhabit, are like Swiss cheese; they look good atfirst, but they’re full of holes, and if you keep them around too long they’ll stink to high heaven. \\n\r\nThese “your-face-here” protagonists shamelessly pander to their audience by fulfilling their fantasies; often surrounded by drama, veritably drowning in women, and eventually showered with the praises and victory the audience believes they deserve. Except for Tatsumi. Tatsumi dies. Tatsumi doesn’t get a happy ending. No I’m not mad, why do you ask? Baka!\\n\r\nDon’t be fooled though; these characters are superficially attractive, designed to sucker in poor scrubs who don’t know better. They are, in the opinion of some, a proverbial sickness within the medium of anime. And guess what;\\n\r\nthat cancer just hit stage four.\\n\\n\r\nAlderamin on the Sky doesn’t deserve much praise, and the root if it’s many problems is none other than our resident lazy sod. Meet Ikta Solork, a character so bankrupt he makes studio Manglobe look rich. (sorry Manglobe) Ikta is a pathetic waste of hard-working animators’ precious time. Perhaps the worst protagonist I’ve seen this year, his character is full of contradictions and bad attributes that made the show an actual burden to watch. \\n\r\nHere’s where things get complicated.\\n\r\nIt is indescribably frustrating and difficult to explain WHY a character like this is objectively terrible. The two biggest reasons for this are that enjoyment of a show and its characters is largely subjective, and can’t accurately be judged by one man’s standard. Although this holds true to a degree, it has become the rallying cry of people who’ve run out of sound arguments to defend their favorite shows and characters. The phrase “That’s just your OPINION!” has become a mantra for these guys; a convenient cop-out that you’ll hear everywhere on social media. Secondly is that, historically, the kind of people who admire an MC like Ikta are mainly lazy Otakus. People who would like nothing more than to have their lazy way of life affirmed. And Ikta Solork does exactly that. \\n\r\nYou don’t need to take MY word for it; lets let the story speak for itself. \\n\\n\r\nI wasn’t Joking about all those contradictions, and since they’re far less subjective we’ll start there. \\n\\n\r\nHow about we begin by addressing the elephant in the room; the blatant disconnect between Ikta’s worldview and his skill set. \\n\r\nFrom the get-go, Ikta is portrayed as a rather carefree, lazy person. Seriously, the dude worships hammocks; in the PV, he’s in a hammock; the first time we meet him on screen, he’s in a hammock; his group is trapped behind enemy lines and what does the magnificent bastard do? He builds a hammock. And while I did get a laugh out of his apparent hammock fetish, the point couldn’t be more clear; Ikta Solork is lazy.\\n\r\nDespite this, by the end of the first few episodes, Ikta displays an inexplicable amount of tactical proficiency and knowledge of military strategy. Additionally, as if the ‘chessboard’ scene in the OP wasn’t enough, they paint him as a brilliant strategist, able to call the shots of a chess game he isn’t even watching. Brief rabbit trail, but using chess as an analogy or metaphor for someones genius is a trite and broken trope in and of itself; it’s an easy go-to when you want to make a strategist look cooler, and Alderamin seems to use it just to check a box on the ‘main character checklist’. \\n\r\nOn that note, lets get into the finer details. The gist of this contradiction is that it is highly unlikely, bordering on impossible, that anyone with Ikta’s worldview (lazy, arrogant attitude, disregard for authority, dislike of the military, general selfishness) would be able to, or would even want to, achieve a high level of knowledge and competence in military strategy. In short, I’m calling BS on his strategic genius, and here’s why; Achieving such a high level of skill in something as complicated as military strategy would require a lot of diligent study and practice; It would require years of hard work, something Ikta Solork actively avoids. Also, we learn as early as episode one that Ikta Solork doesn’t like the military, and he states on a couple occasions that he wants nothing to do with them. This flies right in the face of his abilities; WHY, when he’s that lazy, would Ikta devote so much of his time and energy to master the art of war, especially when he hates the military? It doesn’t make sense! Consider this; Ikta, for better or worse, is a real smooth talker, and apparently has the skill (or connections) to forge a new identity. Why then, if he’s that good, would he not choose an easy place, far from war and full of women, to live his lazy life, since that’s what he clearly desires? It just doesn’t add up!\\n\r\n“OBJECTION!” a fanboy squeals, dropping his pizza to hammer on his greasy keyboard, \\n\r\n“Ikta’s father was a general! His dad must have taught him all he knew! He only hates the military now because they put his father in prison!”\\n\r\n………………………………Okay, I guess this was inevitable. \\n\r\nTrite and lazy as this explanation is, it’s the best, and most logical response I’ve been able to find, but its still wrong. Here’s why; If you visit any high school, and even places like my college, you’ll find people who don’t want to be there; they take a seat in the back, clearly indifferent to whatever they could be learning. Many of them are actually decent people, but they’re lazy. They’re there because they have to be, or don’t have anything better to do. Just because you lead the horse to water doesn’t mean he’ll drink. I bring this up because Ikta is in a similar spot. In all honesty, I think it’s perfectly reasonable to assume his father’s imprisonment, and later death, sparked Ikta’s hate for the military. However, this doesn’t change the fact that Ikta Solork is, and was, a lazy, arrogant turd. It is unlikely that his father, as a general, would take his family with him on deployment (especially in that world/time period) and even more unlikely that he would have the time or patience to instruct a young Ikta in the ways of war. But even if you did try to burn some smarts into little Ikky’s brainpan, you can’t make him care; He just doesn’t have to, and I’d put money on the fact that he wouldn’t. Why? Well, they say like father, like son; his father, as mentioned before, died in prison. We learn in episode two that Ikta’s old man didn’t respect authority either, after disobeying orders one too many times, he had his command revoked and got thrown in the joint. \\n\r\nYes, Ikta Solork had a fine role model indeed.\\n\r\nBut even if Ikta did, for some reason, want to be a soldier as a kid, it strains credulity to think he could learn all that before his father’s humiliation and, we assume, his corresponding change of heart toward military affairs.\\n\r\nNone of it adds up. Nothing. Zilch. Nada. \\n\r\nOh look! The fanboy returns! Actually, this next objection came from a friend of mine who, in case you’re wondering, lives in his mum’s basement, and has probably forgotten more about hentai than you and I will ever know. \\n\r\nListen to this, \\n\r\n“Well… Maybe he (Ikta) is just naturally talented, y’know? Some people take naturally to things. maybe he’s just good at it.”\\n\r\n……………………………………………………………… Story time: As I’m writing this, the Olympics are happening in Rio, and Michael Phelps is out there doing what he does best; swimming. I don’t doubt that Phelps took quite naturally to swimming, but talent alone didn’t win him Olympic gold. \\n\r\nI don’t need to explain this to you. \\n\r\nFolks, if you think people like Ikta Solork are “going places”, or that laziness breeds success, life is gonna give you a hardy bitch-slap one day. “Maybe he doesn’t have to try, maybe he’s just that good at it.” This argument is morbidly depressing, and I have only one thing to say for it: You wish. \\n\r\nBut they do. And Ikta Solork turns right around and says “wish granted”.\\n\r\nThe contradictions don’t end there.\\n\r\nIkta is lazy, but he mastered advanced skills.\\n\r\nHe’s selfish, but he jumps into the ocean in a storm to save a girl he doesn’t know.\\n\r\nHe doesn’t think much of others, but gets sentimental when they bury a fallen enemy.\\n\r\nHe threatens the princess’ life for badmouthing his mum, but has no reservations about having sex with his squad sergeant’s mother. Seriously. If the dude's that protective of HIS mum, could he really do that to someone else without flinching? Thats a fucked up (and inconsistent) set of ethics.\\n\r\nAnd on that subject, what about a few old ‘rules’ of storytelling? ‘Cause he screws them too, right up main street and not gently. It’s hilarious; the handwriting is on the wall in bold print by the end of episode one when the narrator drops the line “He will come to be known as the invincible, lazy general”. This statement renders all emotional stakes null and void. After all, why should we worry, let alone care about a character that can’t lose when his military exploits are the focus of the show? It’s a foregone conclusion that he’ll become a general, and when he does he’ll be the same old lazy bum he’s always been. Where are the stakes? This declaration of Ikta’s impending success tells us that Ikta is never going to change or develop as a character, he’s never going to lose, and he’ll never be required to exert any visible effort to achieve his goals. I’m baffled that they thought this was a good idea, but I can still see why; you see, Ikta Solork is first, and foremost, a product, carefully designed to sell to his audience. Despite Ikta’s obvious problems, his character is tailored in a way that makes its easy to rationalize absolutely everything about him, including his unrealistic skills. Its absurd; it makes me want to laugh and vomit blood at the same time. Even now I can hear the voice of that old fish dude from Star Wars in the back of my head saying “It’s a trap”.\\n\\n\r\nIn the end, Ikta Solork is just a fictional person, and this aint the inquisition. Is he a bad character? Yes. Did I go a bit overboard? Yes, and for that I apologize. I like to keep things light, but after Alderamin I forgot how to smile. Guess I’ll be re-watching Konosuba again.\\n\\n\r\nThere. I’m done.\\n\\n\r\nContrary to popular belief, I actually care what you have to say, so if you liked this, or think I missed anything important, let me know, I’d be glad to hear it. \\n\r\nAnyway, thanks for reading.\\n\\n\r\n---The Peasant\\n",
            "date": "2016-10-01T21:12:00+00:00",
            "helpful_count": 29,
            "mal_id": 230845,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5229982.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/PeasantChan",
                "username": "PeasantChan"
            },
            "url": "https://myanimelist.net/reviews.php?id=230845"
        },
        {
            "content": "Just skip to the TL;DR because i dont want to spoil the entire show.\r\nThis show suffers from the plague that are LN tropes and a weak writer. While it was really easy to watch and the premise was somewhat interesting i found the final product to be quite average.\r\nThis is a show that had a lot of potential and you could see how it could be amazing but it failed miserably, i would say it was disappointing to see what could have been a great show become this.\r\nCharacters- The main character and the red haired girl have a interesting relationship, but thats about it, notany of the other characters are worth mentioning. Yeah they exist, they have their place in the story but they are barely memorable.\\n\\n\r\nIn fact i actually think the best character in the show was a side character that showed up in a few episodes, unfortunately i cannot recall her name, ill just call her soldier girl.\\n\\n\r\nThe worst character was without a doubt clan leader girl, everything that happens around her is just one big coincidence, wouldnt really want to spoil things though.\\n\\n\r\nStory - It peaked around episode 8, its not exactly the best story ever but there are a few moments that where pretty well executed. The tactics used where pretty interesting.\\n\\n\r\nIts very difficult to stay immersed in this story even though it is a easy digestible and fun watch.\\n\\n\r\nIts hard to explain why for me this didnt work, while the story seemed pretty good. It had a lot to do with the dialogue of the show (calling things lazy when they are just efficient and repeating it over and over again. Or calling things scientific for no reason). A lot of the \"coincidences\" of the show just didnt sit right with me\\n\\n\r\nArt - Sound - its average, has its moments where its well animated has its moments where its not, the art style is quite boring and so are the character designs. Sound is also pretty average, doesnt stand out at all.\\n\\n\r\nTL;DR- While i do have quite a few complaints with the show i found it quite enjoyable and if you are checking this review to see if you should watch it or not, i say:\\n\\n\r\nyeah watch it, its entertaining.",
            "date": "2016-10-01T06:33:00+00:00",
            "helpful_count": 20,
            "mal_id": 230774,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4415403.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Oiimn",
                "username": "Oiimn"
            },
            "url": "https://myanimelist.net/reviews.php?id=230774"
        },
        {
            "content": "There are no words to describe my desire to rate this show highly. I want to like it, truly, I do. However I just can’t. No amount of rationalization can justify me giving this show positive accolades. \r\nSo the premise is that we have a war between a generic Empire and an equally generic Republic, a war that the viewer barely ever sees over the course of the series. Despite that going on, the viewer spends most of their time with a group of small, but talented, military school students faffing about. It isn’t until a major shift in the conflict thrusts this stalwart groupinto the fire and the flames. \\n\\n\r\nThis premise should make for a satisfying, popcorn-munching couple of hours. The viewer witnesses the rise of a group of military school cadets, who are just trying to survive, amidst the backdrop of two civilizations waging war on an epic scale. Sounds all well and good, yet it falls majorly short of what it could be.\\n\\n\r\nThere is very little reason to care about this conflict. It has utterly failed to give the viewer a reason to be emotionally invested in what is going on. Major questions are left unanswered: Why are these guys fighting? For what reason, other than the fact that the MC is on their side, should we root for the Empire? What makes the Republic the bad guys? Why should I care about any of this? For a show that is largely centered about a major armed conflict, there is hardly any reason to care about the nations involved. \\n\\n\r\nWe are told so little about this world. I want to learn more about the Alderan Church, those spirit creatures, and more of the people of both sides. I want to see the history of these two nations, and how they came to be enemies. There are so many shortcomings in the world building. As a result, I grown to not care about the Empire, or the people that live there. I care even less about the Republic, because I know even less about whatever that place is.\\n\\n\r\nAnother major letdown are the characters. The only real characters of note are Ikta Solork and Ms. Igsem, and the only noteworthy character relationship is between these two. Their classmates are uninspiring at best. The rival genius character that is supposed to go toe-to-toe with Ikta arrives far too late to establish any sort of history and dynamic rivalry with Ikta.\\n\\n\r\nThe plot, while it does have satisfying moments, still leaves room for improvement. Until the final arc, there is no sense of tension for most of the show. Ikta is a freakishly smart military genius, his victory is assured. There is never any doubt in the viewer’s mind that he will win. It suffers the same problem that I had with No Game No Life: the characters are simply TOO GOOD at what they do. It’s just not fun.\\n\\n\r\nBOTTOM LINE: A Potentially great military drama seriously held back by sub-par world building and lackluster characters.  NOT RECOMMENDED.\\n",
            "date": "2016-10-02T14:25:00+00:00",
            "helpful_count": 19,
            "mal_id": 230930,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4639701.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Fijiwuiji",
                "username": "Fijiwuiji"
            },
            "url": "https://myanimelist.net/reviews.php?id=230930"
        },
        {
            "content": "One of my favourite kinds of story is the one the involves an unlikely hero who leads a team of underdogs against a vastly superior opponent. Alderamin on the Sky fits most of the criteria and that's what drew me to the show.\r\nThe plot of Alderamin is simple and easy to grasp; it's focussed on the war between two nations and the trials of a group of soldiers within that war. While the plot isn't unique or outstanding, it's execution in Alderamin is remarkable. The show focusses on the tensions that arise due to the warring nations and the various connectionss and conflicts involved. Agood example is a focus on the relationship between an invading army and its captives (for want of a better term).\\n\\n\r\nThe show starts out a bit slowly but introduces us to its central themes almost immediately: the MC and his colleagues are involved in a brutal battle that's resolved by the MC's brilliant application of strategic thinking. We're also introduced to the main characters and the concept of spirit partners. Unfortunately, the spirits aren't explained until later in the show.\\n\\n\r\nThe art in Alderamin is gorgeous and I'm not exaggerating. The characters, both male and female, are pretty; sometimes, they're too pretty as is the case of Princess Chamille. The backgrounds often had the right tones applied and weren't too colourful or bland. The animation, especially in the battle scenes, is quick and fluid although it's a little inconsistent in the less excitable scenes. One gripe I did have with the art was the sometimes inconsistent body proportions. For example, Haru's shoulders were sometimes broader than they usually are.\\n\\n\r\nI wish the music in Alderamin was as wonderful as the sound. While the scores weren't, they weren't memorable either and often didn't evoke the emotions their accompanying scenes required. I often use music to remember key scenes in anime but none of the scores did that for me in Alderamin; the battle music wasn't epic and the sad melodies weren't gripping enough. On the other hand, the opening theme for Alderamin was full of action montages that always whet my appetite for each episode and closely matched the show's overarching themes. The ending was a little more dramatic and didn't seem to fit the show's theme.\\n\\n\r\nThe sound effects in Alderamin were well-rendered and often depicted their associated objects accurately; I especially liked the booms from the weapons. They were sometimes exaggerated; the sound of blood in an open wound often sounded too 'squishy'. The voice acting was at par with the sound effects, albeit not as emotional enough. Music and sound in Alderamin seemed to shine more in the action scenes than the more dramatic ones.\\n\\n\r\nAlderamin is a refreshing take on the unlikely military hero 'subgenre'; Ikta Solork is a brilliant but lazy MC with interesting quirks. He's bold but not mindless and gives his decisions a lot of thought; he loves women but isn't shy and flirts freely; he's powerful, over-powered even, but is lazy. He's teamed with a cast of somewhat generic main characters; Alderamin's strength lies not in its characters but in their relationships. Yamori is a generic female lead in a battle anime but she shares an almost telepathic relationship with the MC.\\n\\n\r\nI didn't like the lack of character development and the mostly underwhelming antagonists. I would have loved to see some of the other characters push their own motives and encounter personal conflict. I felt like the show would have fleshed out a few extra characters had there been more episodes.\\n\\n\r\nOverall, Alderamin is a great tactical battle show that doesn't play down core war themes. It has great art and animation and passable music and characters. It does seem like a precursor to an even better show.\\n\\n\r\nOverall: 7\\n\r\nStory: 6\\n\r\nArt: 8\\n\r\nSound: 6\\n\r\nCharacter: 6\\n\r\nEnjoyment: 7",
            "date": "2016-11-06T02:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 233315,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647223.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gnerkus",
                "username": "gnerkus"
            },
            "url": "https://myanimelist.net/reviews.php?id=233315"
        },
        {
            "content": "This is an incredible series with one fatal flaw not even the Lelouch clone could foresee: there is no conclusion whatsoever. Everything in Alderamin is geared towards successive seasons but those haven't materialized and it's been almost three years; I think it's safe to assume any further plot development is resigned to largely-untranslated light novels.\r\nSo, what do you get for the 13-episode time investment? \r\nA meticulous world built around unique but similar technology, believable civilizations and the space they occupy, and characters with solid motives and backgrounds who are voiced to perfection (with the exception of the Captain). Most of the technology and spirituality islargely unexplained, but in my opinion this was deliberate as preparation for subsequent seasons in order to not overburden the narrative with filler; to that end, it's actually to be commended as I find artistic restraint sadly rare.\\n\\n\r\nThere isn't much to be said for the plot without ruining it all (and anyway, every review on here spoils it and/or repeats the summary in order to sound erudite), but it was certainly enjoyable. For those who cannot stand discarded plot strings, though, you'll be enraged at how many loose ends there are--and that's beside the fact this series ends with no meaningful tie-off.\\n\\n\r\nIf you're able to overcome that this inches closer to a future without a followup season by the day, you won't be disappointed at all. If you can't, then don't bother starting it.",
            "date": "2019-03-19T22:41:00+00:00",
            "helpful_count": 3,
            "mal_id": 303892,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7458802.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/starfarts",
                "username": "starfarts"
            },
            "url": "https://myanimelist.net/reviews.php?id=303892"
        },
        {
            "content": "War, HUH, what is it good for?\r\nStory:\r\nThis is an anime about war, but set in a fantasy world. This creates some problems for me, though. The point of war stories is the fact, that war is a terrible thing, kills people and hurts the innocent. To have this happen in a setting where technically, everything is possible, as we don't know where the boundaries of this world are, heavily weakens this point. On top of that, while we are presented with the downsides of war here, stuff like Yatoris killing rampages and Iktas tactical manoeuvring are presented as cool and awesome. There is a weirddouble message going on here, that prevents this anime from having a real identity.\\n\r\n4/10\\n\\n\r\nArt:\\n\r\nThe battle scenes look pretty good, but they aren't the focus of the anime. While the character design is solid, the animation is not very fluid at times. I'm sure that with a higher budget, they could have done a lot more.\\n\r\n6/10\\n\\n\r\nSound:\\n\r\nThe opening, while hardly fitting the setting, was pretty good. The ending was the usual \"so okay it's average\" ending. Voice acting was pretty good to be honest, especially the main characters did a very good job.\\n\r\n8/10\\n\\n\r\nCharacters:\\n\r\nI found the two main characters, Ikta and Yatori, to be very unlikeable. Ikta is a pretty arrogant know-it-all, who apparently is smarter than the rest of the military combined and who can do no wrong, even if he does. He also has no problems with doing things, that would make you a war criminal in real life, like burning down a civilian village or threatening to kill somebody during negotiations. Yatori is merely a puppet of the government and army. She even outright states that she would kill Ikta (a friend who is like a brother to her) if she was told to. Are those characters supposed to be our heroes? The rest of the cast is a lot better, but none of them gets enough screentime to mean something.\\n\r\n3/10\\n\\n\r\nEnjoyment:\\n\r\nYou probably guessed already, that I didn't really enjoy Alderamin much. This anime doesn't seem to know what it wants to be, a grim war story or a boring shounen or maybe a fantasy adventure? It surely isn't all of that combined, it rather switches between those. In the end, I did not feel entertained by it. It probably could have been better, but the fact remains, that it isn't.\\n\r\n4/10\\n\\n\r\nOverall:\\n\r\n5.0/10",
            "date": "2016-10-08T12:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 231355,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=231355"
        },
        {
            "content": "It is possible to state that this anime has serious problems in pleasing the public. The sales of the material are the clearest proof that people were not pleased, mainly in view of the script, characters and technical elements. Soon though a media note on my list is still an anime not recommended.\r\nThe plot is pretty predictable on everything in the initial situation involving the first three episodes, thus being expendable and short of the rest which is not very good either. In every work even when it escapes from predictability it appeals to a nonsense, childish, unsettling and unpleasant. Partly because of the elementsof fantasy, for example the use of \"spirits\" that do not fit the proposal, or a more serious genre that is required for it to be good, and also of the unbelievable dialogues that plays the viewer to out.\\n\\n\r\nFrom the characters since the beginning of the anime already makes a bad presentation and continues with a poor development of the same in the following episodes. These are boring, shameful conversations that make you want to give up right there in the first episode. Some fall into oblivion and others do not gain charisma or weight due as Haroma, Matthew are two featured prominently and the rest are erased.\\n\\n\r\nIkta, and Yatori are lacking in progression, they do not evolve at all with the passing of the anime, beyond the military patent. Ikta is the most complicated because he is a character who does not learn, but is given the duty to teach, and does not fulfill this role. As an example the scene of Ikta cutting his own finger in pieces, what a moral, valuable and intelligent conclusion can be drawn from it. Already the Yatori is one-dimensional, bodyguard superforte who was born and will die for it, this everything, end. If one day make a list with the worst protagonists of characters of animes they deserve place in her with certainty.\\n\\n\r\nTechnically the traits are not pleasant, with noticeable variation between the episodes, the environment is terrible, the opening is without thanks and the soundtrack is forgettable. The contrasts of colors and senarios do not match, in some moments it seems that if it is leaving Simbad the Marujo and entering the second mudila war, in others it is not in neither of which is worse. Resulting in an environment that is not believable, it is too fantastical even for a work of fantasy.\\n\\n\r\nIt's a multi-colored anime, but it's not good either. After a bad initial bow, comes a medium, but soon pauses and comes a break of climax that extends through several episodes, until a new and last conflict. The climaxes are bad for invoking solutions of amoral form conflict, without reflective call and not even do not fulfill the intention, because they do not convince in demonstrating intelligence that the narrative tries to impute to them.\\n\\n\r\nThere is lack of depth, dilemmas, philosophy, things to make people weigh, reflect, and take an interest in the work. There would be only fighting, but fluidity and special effects are not as interesting. In short it is a very shallow and forgettable work.",
            "date": "2018-01-08T04:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 267909,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6835240.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tiago_Vaz_07",
                "username": "Tiago_Vaz_07"
            },
            "url": "https://myanimelist.net/reviews.php?id=267909"
        },
        {
            "content": "This one took a while to grow on me. At first it was interesting. Then, about halfway through, I got annoyed at it because the main character was acting in a way that made no sense. Despite this I continued to watch it because it had started out so well and it had gotten its hooks into me enough that I really wanted to know what would happen. Thankfully, as I continued to watch, it all came together and I ended up really enjoying it. \r\nJust a little lesson not to condemn an anime because it takes a little dip mid season. (Although I havepushed through a lot of dips like this in the past only to be completely and utterly disappointed in an anime because it only got worse and worse...sigh). In any case I am very happy I continued to watch as the 'dip' ended up not being a dip at all: all my concerns about Solork's actions were washed away as the story developed. \\n\\n\r\nNejimaki Seirei Senki is a cut above most in the military battle genre. The characters are strong and intelligent and although the main character, a genius strategist named Solork Ikta, can be a little too perfect on occasion, (making him more saintlike than sympathetic) overall he is still human enough to root for. \\n\\n\r\nThe story is set in a separate fantasy universe with access to magic (which is not a major factor in the conflicts), swords, crossbows and basic guns. The story revolves around a group of young military cadets. The fights are quite visceral and generally more focused on soldiers, tactics and strategy than on grandstanding heroes. I would recommend it to anyone who enjoys military strategy, likes seeing close friends go through tough times together and watching the evolution of a normal(ish) guy into a 'hero' (quotation marks are provided to prevent the main character Solork getting angry with me...). Keep in mind that the story is screaming for a second season that will almost certainly never eventuate but hey, what is there is good stuff. This is no masterpiece, there are times when the dialogue is a little forced and the plot can sometimes be predictable but overall it has a solid story, good characters and is easy to watch.\\n\\n\\n\r\nSPOILERS - Why did I get annoyed at this anime? Because the main character, a guy who keeps on (and on and on) saying how much he does not want to be in the army, does not want to fight and how being lazy is the best way to live continues to bloody his hands in pointless battles for (apparently) no good reason...but stick with it, the reason reveals itself as the anime continues. It is revealed so subtly that I almost missed it...\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\r\nSPOILER of my \"SPOILERS\" section - If you haven't seen the anime yet please don't read this and try watching it first - Solork (the main military genius) speaks to Igsem (the firebrand dual sword wielder) in a quiet moment during the forest fire siege and says the only reason he joined the military was to try and make things a little easier on her. And that was it...no fanfare, no I love you or you are the best friend ever or let's run away together leave your swords behind so we can be super science nerds etc and so forth, just a small comment to explain a hell of a lot of effort on his part. If you blink you will miss this moment (especially if you are reading subs), but it completely made the anime for me, everything he did made sense after that small sentence. Nice.",
            "date": "2018-04-22T04:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 278695,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/youkos-o-ssu",
                "username": "youkos-o-ssu"
            },
            "url": "https://myanimelist.net/reviews.php?id=278695"
        },
        {
            "content": "In the midst of the star-studded Summer 2016 anime lineup, there's one particular show that I missed out on watching at first and that show was Alderamin On the Sky.  \r\nLet's get started with the story, shall we? The story follows the adventure of Ikta Solork, a lazy and laid-back teenager together with his friends and comrades. Using his tactical brilliance, he must defend his land. Yes, the plot may not sound original, but believe me the anime executed it brilliantly. How? It lies in the characters.\r\nIkta is not your typical male Shounen MC. In fact, he's the exact opposite of it. He's thekind of character you can't help but hate at first, but slowly you will root for him later on. One of the interesting aspects of the show was the dynamic or one could call it platonic, relationship between the two lead characters which is rare to find in anime nowadays. Even Yatori is not your typical, damsel in distress heroine. I won't spoil anything, but if you liked your female MC to be strong and badass, she won't disappoint. The supporting cast, though, were just so-so in terms of development. The 13 episode count didn't help either.\\n\\n\r\nMoving on to the animation, I would say it looked gorgeous at times, especially during the action scenes which can be bloody and violent, but overall for an anime released in 2016, it just looks average at best. I certainly didn't expect that from Madhouse, the studio that produced a large number of stunning and beautiful anime adaptation. The same goes to the soundtrack. Nothing too memorable that I can think of, even the OP and ED.\\n\\n\r\nYes, it's nothing outstanding, but it certainly was an enjoyment to watch as a whole. Just don't expect anything conclusive in the end, since the LN and manga are still ongoing which is one of the reasons why I kept the overall score at a 7.\\n\\n\r\nOverall, I can see why a lot of people decided to skip on this show, but if you have enough time to spare, give this one a try. It may surprise you-in a good way. \\n\\n\\n\\n",
            "date": "2016-12-07T11:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 235035,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5762326.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ace_39",
                "username": "Ace_39"
            },
            "url": "https://myanimelist.net/reviews.php?id=235035"
        },
        {
            "content": "Review #9: Alderamin on the Sky\r\nStory 7/10 -- The story was a bit underdeveloped, with a limited amount of progression over the 13 episode period. The hero is an officer with different \r\nworld views, who sees the war as pointless and truth be told it pretty much is. One of his first teachings to his fellow soldiers is that war should never have lives thrown blindly away. With this mindset, he quickly becomes one of the countries best tacticians, which ultimately seemed positive until he faces enemies of similar caliber, confirming suspicions that losing will be inevitable. There was a lot of potential in thisstoryline, but these Fantasy War animes always lack building of plot in one cour seasons. Also there was limited footage outside of the battles the commander faced, making the empires and setting unimportant to the overall story.\\n\\n\r\nArt 7/10 -- The art is very sharpened, which is okay, but sometimes the lighting seemed awkward. The Main character is pretty default, but the supporting cast looks more unique then average. The scenery and backgrounds are pretty good, but the color lacks pop scoring the art on par with most animes.\\n\\n\r\nSound: 7/10 -- I watched this show dubbed and subbed. The OP/ED were mid tier, but flowed well with the anime. The English Dub actors were a good and bad matchup with voices. There was some background sound used which was standard. The dialogue for supporting characters was cliche to average, while the main characters had some good conversations and lines.\\n\\n\r\nCharacter 7/10 -- This is studio Madhouse, we know how well they make characters look good in most of there series. However this was one of those series that you wished they did more. The main character played his role well, while the supporting mains were rather average. Yatorishino was a badass that was underused, while the annoying princess cliche defines Chamille's character. Matthew and Torway were actually good male characters but they lacked any development and were outshone by Ikta. Haroma was more romance bait, then a character of importance. Madhouse really underused their main characters in this anime, which was disappointing because all there backgrounds and personalities had good chemistry. Ikta's awakening would come after events that happened to a crowd approved supporting character, and the last battle did well to prove his ability and character as a tactician.\\n\\n\r\nEnjoyment 8/10 -- Even though all the technical categories were rated as good, Alderamin is still a pretty enjoyable anime. The First episode is a pretty good hook when six students cross the border into enemy lines on a stormy day. The series continues as an underdog story that perfectly contrasts with the main characters personality. A weak empire relying on a lazy, carefree commander for survival in a war of young bloodshed. The whole irony is entertaining, while the reality of the war is quite saddening as the main character was pretty much right in the beginning. There really is no reason to be fighting for the Katjvarna Empire, however he chooses to anyways after seeing the turmoil war leaves in its reckoning.  \\n\\n\r\nOverall 7/10 -- Alderamin on the Sky is a standard fantasy war anime. The storyline setting was overly underdeveloped for a single cour series. Madhouse is known for good stories and character development, however I would say this series wasn't one of their best works. The Art and sound quality is average, while the character development had much untapped potential, and it was hard to judge how many characters were main ones in this anime. There were many war cliches thrown into this, but Ikta does a great job moving the anime away from tropes, and positively builds on this wars realism where young kids are dying out of fierce loyalty for their friends and country. I enjoy shows where both genders fight and work together to achieve a greater cause, and Alderamin builds a pleasant unity in the army that can be supported when they succeed, but also be tragic when they lose. Overall it's a good mid-tier series from Madhouse, and I recommend it to any Fantasy/Military fans. This anime isn't about fan service, it's young heroes that blossom when under pressure to become real men and women.\\n\\n\r\n~Castawayz",
            "date": "2018-02-23T10:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 272252,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4700148.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Castawayz",
                "username": "Castawayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=272252"
        },
        {
            "content": "I've been searching a long time for anime like this.This masterpiece is combination of filthy truth about war,great soundtracks,pretty good combination of characters and drama with 8-9/10 picture.\r\nMC is combination of laziness,great tactics mastery,satire and humanity.Decisions during the story line will be really hard and game changing.\r\nAlso all supporting characters are very colorful and you will remember them for a long time\r\nHighly recommend Alderamin for guys who like dramas.Because it is war,every one can die,your favorite characters are not immortal.\r\nI really enjoy watching Alderamin,like i did when Guilty crown came up.It is very upsetting that only 13ep. is planning to be,because it would be agood 100+ep.project.Many characters stories are not explained and many things are in fog of war\\n\\n\r\nP.S Don't judge me too hard,its my first review ^.^",
            "date": "2016-11-01T17:28:00+00:00",
            "helpful_count": 5,
            "mal_id": 233044,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5151051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PleaseStayWithMe",
                "username": "PleaseStayWithMe"
            },
            "url": "https://myanimelist.net/reviews.php?id=233044"
        },
        {
            "content": "War strategies, war tactics, and war. This anime strays away from the everyday plot of magic and sport and cooking and focuses on the aspect of war in this WWI-esque anime. \r\nStory: 7\r\nThe story, by any means, isn't the craziest. It's a small part of something bigger. It mostly demonstrates the MC's genius as a commander.\r\nArt: 8\r\nI personally like the art style in the anime compared to the manga. People were especially upset about the anime not looking like the manga. However, the characters look more human like, and although they're not the prettiest faces, it's a unique change from other animes. The MC inthe manga looks like a total dope, and Yatori looks like a generic anime character.\\n\\n\r\nBackground art and anime are standard, which is bretty gud if you ask me.\\n\\n\r\nSound: 9\\n\r\nThe opening is really good, the ending is ok (starts off with a nice mellow piano and vocal then all this techno garbage comes on 10 seconds in). Lots a gun noises and sword slices, which is appropriate for a war anime. \\n\\n\r\nCharacter: 6\\n\r\nLike I said, the anime is apart of something bigger. It's hard to create such depth in character in 13 episodes. I mean, the whole science complex the MC has going on is pretty neat.\\n\\n\r\nEnjoyment: 9\\n\r\nI really liked this anime. I'd rather watch it with this art style than read it with the manga's art style, to be honest. But, this anime didn't turn heads during the summer split so I really doubt this anime will get a second season. \\n\\n\r\nOverall: 8\\n\r\nIt's good. Something to tide you over, unless you really like WWI-esque stuff then you should read the manga. Manga's pretty solid once you digest the manga's hideous MC.",
            "date": "2016-10-30T10:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 232902,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5565392.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Nigwin",
                "username": "Nigwin"
            },
            "url": "https://myanimelist.net/reviews.php?id=232902"
        },
        {
            "content": "Haiku Review:\r\nUnderrated Show\r\nCode Geass Meets Ginga Eiyuu\r\nGo Read Light Novels\r\nMAL won't allow only the Haiku, so I'll put in a useless explanation that you don't need to read.\r\nAlderamin is a military show about the military genius Ikta Solork and how he becomes known as the Invincible Lazy General. Code Geass parallel comes from the relationship of Ikta with Yatori as well as the obvious military aspects of the show, but Ikta is no Lelouch. If anything, he shares more similarities with Yang Wen Li of Ginga Eiyuu/LOTGH. \r\nWhile the anime is a great standalone adaptation, knowing that it is made by MADHouse and the waythe adaptation chooses to relay major plot events are two great clues that it will never get a second season. It is a giant advertisement for the Alderamin light novel, and great pity that it is merely an advertisement because of how well done it is. For that reason, I cannot recommend the show as a complete story, though for those willing to watch a 4 hour ad for a light novel, this is a very entertaining one.",
            "date": "2019-04-28T01:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 307301,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/weewaaweewaa",
                "username": "weewaaweewaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=307301"
        },
        {
            "content": "Alderamin was one of the animes of the season that wasn't too hyped but enjoyable to watch. Normally, I do not watch many military themed animes, but the core aspects of a genre like so definitely shows here. The characters know that war is not all fun and games and the seriousness of war is depicted throughout the episodes.\r\nThe story was reasonable - two sides are at war and the MC and his friends are caught up on it. However, I have found at times not much development happens for maybe 1 episode, followed by a great combat scene in the next episode. So yeah,the pacing did not suffice with me. I feel like Alderamin would have shown more success if we could spread out the story to 25 episodes.\\n\\n\r\nNot too much complaints with the art and sound. The art style was a bit different but nothing significant or bothersome to me.\\n\\n\r\nOverall, I enjoyed the anime. By no means is it perfect but it is definitely worth a watch. The story may be slow to pick up but I would give it a few episodes before the pacing picks up.",
            "date": "2016-10-05T07:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 231138,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3459389.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/red0fighter",
                "username": "red0fighter"
            },
            "url": "https://myanimelist.net/reviews.php?id=231138"
        },
        {
            "content": "Brilliant, intriguing, captivating & thrilling.\r\nI wrote an earlier review before, giving this show a solid 10. After the conclusion of this show, I'm proud to say it remains unchanged.\r\nBy far, this is easily one of the 'MUST WATCH' anime of 2016. Though SHORT, but they did a great job keeping me at the edge of the seat for 13 episodes. \r\nThank you Madhouse for another brilliant light novel adaptation.\r\n----------------------------------------------------\r\nThe story grew more and more interesting as time passes by. The show doesn't feel much of a rush, taking its own sweet time to develop each characters (particularly Ikta, Yatori & Chamille). Soundtrack & narration wise,I'd say it fits & blends well with the show.\\n\\n\r\nViewers will often find themselves at the edge of their sits wanting for more. Though the 13 episodes felt kinda short, it has demonstrated the potential that this show has. \\n\\n\r\nTo keep it short, you WON'T be disappointed by what the show has to offer but you'll be disappointed if you skip this show. \\n\\n\r\nShort Conclusion:\\n\r\n- MUST WATCH Military/Action Anime of 2016\\n\r\n- A MUST WATCH for Military enthusiast \\n\r\n- Romance Subplot\\n\r\n- One of the 'top' anime of Summer 2016 (which was a dull season)\\n\r\n- Great alternative to Action Mecha/Supernatural shows (this year's anime industry are saturated with Supernatural/Mecha action shows)\\n\r\n- Awesome animation & art! Fight-scenes will leave you at the edge of your sit\\n\r\n- Brilliantly lazy & interesting MC, with an awesome cast\\n\r\n- Each episode will leave you wanting for more\\n\\n\r\nWith that being said, this show goes straight into my 'personal favorite list of 2016'.\\n\\n\r\nUntil then, I pray for season 2 to happen.",
            "date": "2016-10-02T03:37:00+00:00",
            "helpful_count": 5,
            "mal_id": 230868,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5398172.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/GokuNazz",
                "username": "GokuNazz"
            },
            "url": "https://myanimelist.net/reviews.php?id=230868"
        },
        {
            "content": "Tenkyou no Alderamin it is then.Well this anime is hands down the positive surprise of the summer season and propably the best if u exclude some anime continuations (like food wards). Fantastic pace and story telling with an extremely interesting MC.\r\nStory 8/10 : The Story wraps up around Iktra Solork a guy that joined the army against his own will in a sense, and he is left with no choise but to defend his country. THe story build up is exceptional episode by episode.In my opinion Tenkyou no ALdermin is a perfect example of how u can compress an anime into 13 episodes and stillbe satisfied by it.\\n\\n\r\nThe pace of the story its one of the biggest prons of the anime, it is exceptionally balanced and it never literally never feels rushed or slow.\\n\\n\r\nThe use of romance/action sequences /story telling and the tactical battle is very well handled. I am specifically impressed of how well they balanced the romance in this(IKtra is a big womanizer).They used as much time as they should.\\n\\n\r\nArt 7/10 : Nothing exceptional here, stylistic it was fine. Could have been much betetr though. especially in the xlothing aspect\\n\\n\r\nSound: 10/10  top tier music. Fantastic job by inaj Keji. High quality of music  during the anime and  right use of it in pivotal moments.But the quality itself is outstanding.\\n\\n\r\nCharacter 8/10 :  that would have been a 9 if some of the characters werent a bit under-developed. That being said  IKtra Solork is one of the best and most importantly interesting MCs i've seen in a while. He is a lazy muppet a womanizer and an exceptional tactisian. I love his calmness and his reactions(too many overractive MCs  the last seasons) he has a very specific way of perciving things and confronting them.Igsem is also interesting but is one of the characters i wanted to know more about her past since she is close.\\n\\n\r\nEnjoyment: 8/10 overall  8/10\\n\\n\r\nDefinitly in my opinion the pleasant surprise of this sumemr season. I enjoyed every single episode of the anime with his fantastic music very interesting MC and very solid pace.",
            "date": "2016-10-01T15:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 230820,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3389493.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Subxaero",
                "username": "Subxaero"
            },
            "url": "https://myanimelist.net/reviews.php?id=230820"
        }
    ],
    [
        {
            "content": "Alderamin on the Sky is a fantasy/ war-drama focused on a group of teenagers who become Imperial Officers of their empire's military after they save their kingdom's princess and are caught in the middle of a war with an opposing kingdom where the skills of our group become tested.\r\nIn spite of having a fantasy element fueled by each human in this series having fairy companions that support them in varying capacities, this is just a small part of Alderamin's story as it is largely focused on how Ikta and his companions deal with the ramifications of being part of the military and engaging in war.All six of the characters get a good deal of fleshing out to explore their back stories and how their present circumstances affect them, each having their unique dilemmas that include Ikta's disgust of the military following his father's execution by the empire, Igsem's immense loyalty to the empire in spite of being a societal outcast due to her social status, and Torway's struggle of regarding human targets up-close in spite of his excellent sniping skills. The six each have their gradual developments that they get as events escalate from their development in the military, mainly shaped from adopting Ikta's scientific and strategic approach to dealing with each of the conflicts they have to endure.\\n\\n\r\nBesides focusing on our main group of characters, Alderamin also takes the time to exploring the world of this series and the issues surrounding it. The empires in the world of the series are mostly influenced in believe of the divine, which is in opposition to the scientific and rational beliefs that Ikta demonstrates throughout the series that usually land him into conflict with other soldiers. There are also corrupt and flawed elements within the empire's military as there are leaders who exploit their authority for their personal gain and others who assume they can get by with their personal beliefs or greater numbers, often underestimating the tactical advantages that their enemies can exploit with their weaponry and terrain. As the war escalates, Ikta's strategic approach to leadership in handling the conflict leads him to become a beneficial asset to the empire's cause in spite of his opposition to being part of the war. The anime does regrettably lack a proper ending due to its light novel source material still being ongoing as the war is still at large and hints of future events to come in the final episode involving Ikta and his companions are addressed, yet will not come to pass unless a second anime season comes along.\\n\\n\r\nVisually, Alderamin sports a solid presentation with beautiful and vast scenic shots and character designs that sport a good amount of detail and vivid color. The animation has its moments of fluid movement and engaging sequences such as whenever Igsem engages enemy threats with her twin swords, though the anime will usually cut corners with more complicated circumstances in battles that include groups of battalions battling one another.\\n\\n\r\nGripes aside, Alderamin on the Sky is an underlooked title of 2016 that did surprisingly well with exploring how its world and main group of six characters are impacted by a war they want no part of due to religious beliefs, incompetent superior officers, and government corruption influencing it. Fans of war dramas with a smidge of fantasy elements should certainly give this title a look.",
            "date": "2017-01-16T11:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 238427,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=238427"
        },
        {
            "content": "\"Work Smarter Not Harder So You Can Try to Sleep😴 Longer.\"\r\nOverall:\t\r\nWe see a world where Science is a foreign concept. And our protagonist is surrounded by Bureaucracy and Tradition instead of Logical thinking. So he uses his wealth of this knowledge to make his new life a bit less of a burden and sleep some more.\r\nStory:\t\r\nA Lazy but Brilliant Protagonist is in the wrong place at the (depending on your position) right or wrong time. And Lands himself in Officers Training School with little to No Choice in the matter. Going on to lead his companions to Victory. So Far...\r\nAudio:\t\r\nThe Audio and Dialog in thisseries is one of the reasons it stood out while it Aired. And Funimation really nailed everyones voice as in matching them to their Japanese counterpart. Especially with our Protagonist voice.\\n\r\nVideo:\t\\n\r\nFor the Video I first notice in Episode 1 was how the Ladies in this show were dressed which stood out and accentuated their figure with out going full Fan-service. And that was appealing when watching a show that needs to be taken seriously at times.",
            "date": "2016-12-14T22:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 235467,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3711559.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JesseKearney",
                "username": "JesseKearney"
            },
            "url": "https://myanimelist.net/reviews.php?id=235467"
        },
        {
            "content": "I think this show is absolutely brilliant, after coming down from the supreme high of the anime gate, I thought this show was the perfect way to avoid being stuck in a show hole. While relying somewhat on overused stereo types it still manages to break the mold with the use of a young world weary and lazy main character, who while being physically weak is a master tactician. \r\nIf you do not pay close attention this show will seem to have many plot hole, but upon closer inspection many are revealed to the viewer without being spoon fed. Things such as why are therebow and arrows and also rifles, which is explained by the elementary (they are air rifles using elemental so and not everyone has an air element) and many more that you just need to take a closer look and infer for yourself. I like this as I am tired of the shows that spend the first several episode just explaining this fantasy realm to you, just let me watch and give me the hints to close the gaps myself. \\n\r\nI truely enjoy the portrayal of how devastating war truly is instead of the traditional whitewashing you generally see. This show isn't just a peppy let's fight for honor and glory wartime clip. It gets dark and characters you start to feel attachment towards die in gruesome ways. \\n\r\nAll in all I think this show deserves several more seasons to come to full fruition, I just hope it gets the chance.",
            "date": "2016-11-18T08:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 233946,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SheaKeener",
                "username": "SheaKeener"
            },
            "url": "https://myanimelist.net/reviews.php?id=233946"
        },
        {
            "content": "Overall it's a good anime but personally I'm not the biggest fan of anime to do with war but regardless it's not the worst anime I have ever seen currently giving it a 6/10 and that's just my personal opinion I'm not going to compare it to something it's not or say that another anime dis this and that better in the end this anime doesn't seem to bad with that said may personal score on the anime may change after I watch the last 3 episodes\r\nThanks for reading my review this is my first ever review tell me what you think and feel freeto comment on my profile if you have any questions or anything you would like to say if you want to be rude then do so it doesn't bother me if you want to be nice then awesome maybe we can become friends apart from that I look forward to making more reviews on other animes I have and have not already seen",
            "date": "2018-07-24T20:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 284707,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6589063.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RandomGamer8221",
                "username": "RandomGamer8221"
            },
            "url": "https://myanimelist.net/reviews.php?id=284707"
        },
        {
            "content": "This anime piqued my interest primarily due to the time period implied by the poster - that is to say the late nineteenth century/early twentieth century. While Alderamin delivers somewhat on that theme, it has several issues that prevented me from taking it seriously.\r\nStory: The story of Alderamin is predictable and full of tired character typecasts, which is a shame considering the relatively untread ground early modern warfare is for anime in general. There are several unexpected moments that keep the viewer engaged, but it resorts to painfully obvious exposition more than necessary. There are some glaring discrepancies in the setting - they still usecrossbows alongside what are essentially bolt-action rifles, people going into battle with only swords wearing plate - it's like the creator really wanted to make a medieval or renaissance themed story but couldn't. I could accept those elements if they ever bothered to explain the reasoning behind it, but that never happens. Alderamin did not give me a reason to suspend my disbelief, which made it difficult to watch at times.\\n\\n\r\nArt: Nice animations and intelligent use of CGI made for an acceptably good-looking experience. I'm pleased to say that they didn't shy away from the blood and gore that comes with making a violent anime, they also did not use buckets of blood like an 80s horror movie, which I also appreciate.\\n\\n\r\nSound: Voice actors are OK, but the Foley Artists made it sound great. The rifles and cannons sound deadly, and do a good job of simulating the audio of a battlefield. The soundtrack comes in at important moments and compliments the intense and somber scenes.\\n\\n\r\nCharacter: As I stated, the characters are all typecasts, which is disappointing but entirely expected. The red-haired Yatorishino Igsem, in particular, acted like a discount Mikasa Ackerman, with half the personality. She's a blindly loyal, honor-bound, killing machine whose entire purpose in Alderamin is to murder people with swords and miraculously never be shot. Yatorishino represents the dichotomy in Alderamin - it tries to be a story about the ravages of war and portray the human struggle of it,  then a plot-armored, emotionless, superhero comes in and kills twenty soldiers without trying. It is a frustrating lack of depth.\\n\\n\r\nEnjoyment: These thirteen episodes had me more disappointed than intrigued, and yet I watched all of them eagerly. A questionably eclectic mix of time periods that made me wish for the creator(s) to read up on the period they were aiming for, combined with a boring cast of characters, made it a tolerable but deeply aggravating watch. I would still recommend it to people who don't mind glossing over some plot holes and inconsistencies, I do see a potential for greatness in Alderamin, but it may need several more seasons to realize it.",
            "date": "2016-10-19T02:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 232053,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4251963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tsugan",
                "username": "Tsugan"
            },
            "url": "https://myanimelist.net/reviews.php?id=232053"
        },
        {
            "content": "Summary- The story takes place in a fantasy world focusing on a war between Katjvarna empire and the Republic of Kioka. the protagonist Ikta Solork  detests war but ultimately has no choice but to become a High Grade Military Officer to defend his land. He and his friend/allies are sent to war, and his story of becoming a hero begins.\r\nAnimation- the animation for this show is very good as expected from studio madhouse. it is mostly consistent, the character designs look very good, and it has nice flow when it comes to action. it's still nothing amazing but it's good\r\n7/10\r\nSound- the music was okaynothing unique, but it did well. the voice acting was good  no complaint there.\\n\r\n6/10\\n\\n\r\nStory- the story has an interesting premise as it shows that it is supposed to be a war drama in a fantasy setting. it also has many things going for it such the the war, the tensions and relations between the clans and families in the empire. status and class in the empire, religious tones, and corruption inside the empire. however it doesn't really follow through in the plot and the execution. starting from the beginning episodes it was mostly exposition, with some military school, most if the points above are just highlighted over to build up the characters and their relationships, which could have been done in half the time. it does start to pick up later on, but only by a little. \\n\r\nthe theme of religion is also another interesting but poorly executed idea. although they present the idea of different thoughts about religion between different cultures  it fails when presented as the helper spirits that are used for war instead of just religion in the real world, I understand that it's a fantasy, but they serve nothing for the plot except for little power boost.\\n\r\n4/10\\n\r\ncharacters-  all the main characters are the one shown in the picture. they're are mostly all 2-dimensional and most of what they're presented are in the beginning episodes. you can still find them interesting, but don't expect anything great.\\n\r\n5/10\\n\\n\r\nsummary- good animation, above average soundtrack and voice acting, poorly executed story, and average characters.\\n\r\n5/10",
            "date": "2016-10-02T17:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 230950,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=230950"
        },
        {
            "content": "If you like military, action and adventure style anime with the OP/master strategist MC and the badass fighting female lead you shouldnt miss this series. Set in an alternate world with a mix of weapon technologies, it deals with the origin story of Ikta Solork, the invincible lazy general. \r\nCharacters are pretty standard with the twist being that the MC's motto is being lazy rather than the usual work extra hard with determination to win type. Regardless, there is a good ensemble cast with interesting chemistry and interaction. \r\nI think any 13 episode series can only do so much in terms of development, with thestory accomplishing the main goal of sufficiently engaging the audience into staying for more. I think all of us can enjoy an almost too perfect OP main character paired with a beautiful fighting machine female lead. I would like to see a bit more romance to make us care more about the characters but that perhaps will come later on.\\n\\n\r\nAnimation and music are good with well executed fight scenes. \\n\\n\r\nI'm glad to say that my impression of the series has not changed over the course of the season, which is more than I can say for many many anime which start of strong and then fall into confusion and disappointment.\\n\\n\r\nIt's sad that one of the best shows of the season has gotten so few views and relatively low scores - I believe this show is certainly in the 8.3 to 8.4 mark after 13 episodes. Watch this - you won't regret it. Here's to hoping we get season 2 and beyond!\\n",
            "date": "2016-10-02T17:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 230949,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4629270.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/theadrin",
                "username": "theadrin"
            },
            "url": "https://myanimelist.net/reviews.php?id=230949"
        },
        {
            "content": "First of all i haven't read the source material for Alderamin on the sky so the first time i seen the characters and setting was in the anime itself. \r\nLets get started \r\nThe story of Alderamin on the sky revolves around the character of Ikta Solok as he is thrust into the role of a soldier as the kingdom that he lives in fights a war against a neighboring kingdom. As stories go this one is pretty genetic with some differences with the advent of magic and firearms in addition to the normal swords. \r\nThe setting for this story is mostly centered on the kingdomthat they live in but the second half of the season has them heading to one of the kingdoms border provinces. \\n\\n\\n\r\nIkta Solok is the main male protagonist of the series and despite his ordinary \\n\r\nappearance is actually a really intelligent and capable strategist.\\n\\n\r\n Personality wise Ikta is lazy, slothful and often not serious about his duties preferring to chase after girls or knowledge. However Ikta does get serious when in combat situations and when unleashed the tactics that he comes up with though unorthodox by conventional military standards is often\\n\r\nsurprisingly effective as he demonstrated on countless occasions in the series. \\n\\n\r\nIkta has the rare talent of being able to put himself in the enemies shoes and from there determine what they are thinking and how they would react to events. Something that only high level strategists can do. \\n\\n\r\nWatching Ikta use his strategies is like watching a chess game as while he is a capable soldier Ikta prefers to use his brain and his intelligence to win battles rather than brawn. Interestingly he fights not to protect the empire that he is part of but rather to protect his friends. \\n\\n\r\nIkta is one of my fav characters on the series because he prefers to fight using his brain while at the same time not tolerating bullies and injustices.\\n\\n\r\nYatori serves as the main female protagonist of the series and acts as the main heroine. \\n\\n\r\nYatori comes from a famous military family that has served the empire for centuries. Yatori and Ikta have known each other since they were children and Yatori have always stuck by him to both support and assist him. While certainly not as capable as Ikta is at strategy Yatori is very adapt at the martial aspect of a soldier being a superlative swordsman and an adapt rider.\\n\\n\r\nPersonality wise Yatori is kind and caring to her friends and allies while merciless towards her enemies but she does know when to give the enemy a chance to end their battles. Yatori's dominant trait is her loyalty\\n\r\nas she is very loyal to the kingdom and will often punish Ikta should he do something foolish. \\n\\n\r\nYatori and Ikta have an interesting relationship in that both care about his other while knowing that if Ikta oversteps his bounds then Yatori however reluctant would come for him as part of her duty. \\n\\n\r\nHaroma who i call Haru is one of the main characters of the series and a fellow officer cadet that they meet at the academy that they later befriend. \\n\r\nHaru is kind and caring nature being the eldest daughter of her family. \\n\r\nDue to her beauty Haru is often hit on by Ikta who think that she is beautiful.\\n\\n\r\nUnlike Ikta and the others Haru doesn't aspire to be a combat soldier and instead wants to be a nurse and later on commands a medical team that is deployed to the frontlines. \\n\\n\r\nAs the series progresses Haru though still meek becomes braver as she has \\n\r\nto treat the increasing amount of casualties that the war produces as it wages. \\n\\n\r\nTorway is a fellow cadet and later friend that Ikta and co met as they traveled to the school in the first episode. Torway comes from a military family like Yatori but is viewed with disdain by other members of his house due to his usage of a air rifle over conventional weapons like swords. \\n\\n\r\nTorway's character changes a lot over the series becoming braver, smarter and able to think on his feet mostly in part due to the trust that Ikta puts in him for his plans. And more importantly manage to get out of the family shadow that has been weighting him down. \\n\\n\r\nTorways character i actually enjoyed being developed as he was able to get past his baggage with his family and become a capable soldier in his own right and a able marksmen as well. \\n\\n\\n\r\nMatthew is a fellow cadet and later a friend of Ikta and co as they travel to the school early on.\\n\\n\r\nLike Yatori and Torway Matthew comes from a military family.\\n\r\nReliable and skilled but not quite as intelligent as either Ikta or Torway and not as skilled in combat as Yatori Matthew nonetheless tries to do the best he can to succeed.  \\n\\n\r\nAt first Matthew was a relatively unremarkable character but he did not let his inferiority get to him and trained and continuously refined his skills. This is something that everyone can see that soon rewards him as Ikta starts giving him important parts in his plans. \\n\\n\r\nMatthew was a great character that knew that he was not as good as Ikta or Yatori but nonetheless still tried to improve himself and be useful to his friends and comrades. \\n\\n\r\nPrincess Chamille is the third princess of the imperial family that rules the kingdom that Ikta and co currently live in. Despite being only 11 at the time of the series Chamille were classmates of Solok and co at the academy mostly due to her attraction with Solok. \\n\\n\r\nDespite her young age she is rather deceptive \\n\r\nas she is willing to destroy the royal bloodline that she is part off in order to change the empire. \\n\\n\r\nDespite this she isn't inherently evil as she cares about its people and the soldiers that fight for the kingdom and wears her heart on her sleeve when helping her friends and solok in particular. \\n\\n\r\nChamille's character was an interesting one as unlike others she cares little for the nobility and the empire but cares about its people and her friends more. Her interactions with Solok was also interesting as its clear that she has feelings for him. \\n\\n\r\nNana whose full name is Nanaqu Dal is the chieftan of the Sinack which are the people that inhabit the northern province of the empire. A fierce, passionate and fiery person Nana leads her people as their chieftan \\n\r\nin a war against the empire that wages as part of the second arc in the anime. Interestingly Nana was actually an old friend of Solok that met when they were little. \\n\\n\\n\r\nIn the beginning she was a fierce warrior and a charismatic one that believed in her cause and fought with great skill against Ikta and co even managing to fight on even terms with Yatori for a time. However this soon changed as they were overwhelmed by a combo of smart tactics on Ikta's part and numbers. \\n\\n\r\nIn the second part of the show due to a desperate and game changing situation Nana was forced to support the empire's forces after she found out that Ikta her best friend from her childhood was part of them.\\n\\n\r\nHere her personality slightly changes. Though still loyal to her people she now protected Solok as fiercely as she protects her people. \\n\\n\r\nNana i thought was a great character in that she simply fought for what she though was right and that was for her people and the injustices that the empire has deal them. Circumstances however forced her to ally with her former enemies and at the same time allow her to reunite with \\n\r\nher childhood friend. Rie Takahashi as ever did a fantastic job voicing her.\\n\\n\r\nCana is a side character that Solok and co encountered when they are deployed to the northern garrison. \\n\\n\r\nCana like Solok loves science and knowledge and loves to read books. Cana and Solok bond over a book that Solok's mentor wrote which i found to be cute. \\n\r\nHowever sadly when the war with the sinack broke out Cana was among the soldiers that were sent to the frontlines and sadly she and Solok never got to met again. \\n\\n\r\nHer loss had a profound impact on solok and motivated him to end this war as soon as possible. \\n\\n\r\nCana's death to me was particularly sad as i had liked their interactions and how they treated each other. And i had hoped that they would meet up again after the war and discuss science again. \\n\\n\r\nSenba was the officer that commanded Solok and company when they were deployed to the northern garrison. \\n\r\nSenba was a capable officer and a adapt tactician but he was outclassed when he met Ikta and Yatori. Nonetheless he tries to provide advice to Ikta and co as they fight the war. \\n\\n\r\nThe art style in the series i found was pretty good and the environments that were shown were beautiful and clear. The animation was also top notch and the combat scenes were especially detailed and brutal in equal measure. \\n\r\nCharacter designs were pretty clear and detailed. \\n\\n\r\nThe music for the series was pretty good especially the opening and ending themes. The scene music was also appropriate for the scenes that it was used in. \\n\\n\\n\r\nThe show i felt dealt with the subject of war and its effect on people whether they are civilians or soldier rather well. Going into combat for the first time can be scary when one false move can be fatal. \\n\\n\r\nThe violence in this show was especially surprising as i had thought it would be toned down somewhat but im glad that was kept there. Seeing the characters react to the different aspects of the war like looting, relocation of \\n\r\ncivilians and rape was interesting as i never expected the studio to go that far. \\n\\n\r\nVoice acting for the series was pretty strong especially Risa Taneda's portrayal of Yatori and Rin Takahashi's \\n\r\nportrayal of Nana. Ikta's voice actor also deserves praise as well for his portrayal of Ikta.  Inori Minase's portrayal of Chamille was also pretty good as well. \\n\\n\r\nOverall Alderamin of the sky was a great anime that had a great story, excellent setting, interesting characters and excellent voice acting. Its portrayal of the realities of war and the violence associated with it was accurate and brought to us just how brutal, violent and inhumane war actually is and that it is anything but noble. Something that we don't see often in animes. The studio deserves no small amount of praise by showing us this. \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-10-02T12:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 230917,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=230917"
        },
        {
            "content": "As someone who watched LOTGH (Legend of the Galactic Heroes), within one or two episodes of this show, the thought which formed in my mind is that the MC (Ikta) is basically Yang Wenli. Unfair as it sounds, it's going to draw comparisons to LOTGH on my part.\r\nStory: 7\r\nMy biggest criticism is in episode 1. Episode 1 was basically a large info dump which turned me off. Without revealing too much, it's just standard military-political fare. Corrupt nation. Ungrateful nobles. Incompetent commanding officers screwing over relatively competent main characters. Worldbuilding wise - It's there. Nothing too amazing. That's all I can say about it. It'sa light novel adaptation. Do not expect too much from it.\\n\\n\\n\r\nArt: 8\\n\\n\r\nNothing to complain about. Standard Madhouse quality. Yatori is hot. Yatori's hotness turns this from a 7 to an 8. \\n\\n\r\nSound: 6\\n\\n\r\nSound is average. Nothing stands out in a good or bad way.\\n\\n\\n\r\nCharacter: 8\\n\\n\r\nAlderamin's pretty much a tale of Ikta and Yatori's friendship with other supporting characters drifting in here and there with limited roles and purposes. The relationship between both characters is the shining point of the show.\\n\\n\\n\r\nIkta & Yatori: 10\\n\\n\r\nIkta is the lazy smart guy while Yatori is the overpowered swordswoman. Ikta gives orders. Yatori executes them. Ikta prefers thinking to moving. Yatori prefers moving to thinking. As the show develops, you'll start seeing how on one hand, they ultimately complement each other like square pegs and square holes. There's the unspoken understanding between them - \"I keep you physically safe. You keep me mentally sane.\" \\n\\n\r\nOn the other hand, there's also how their viewpoints are utterly irreconcilable, and the only thing bonding them is their love for one another. (\"I care about the empire and you, in that order.\" vs \"I don't care about the empire. I care about you.\"). Knowing each other well, neither of them explicitly criticises each other's viewpoint, but they just leave it at \"That's just the way he/she is\", with foreshadowing pointing out that while life together is alright now, everything will eventually boil over to a point where they may actually need to kill one another. It's a far cry from the usual \"Two conflicting viewpoints among friends. Eventually, one is proved wrong and they both reconcile\" formula.\\n\\n\r\nIs it a romantic relationship? No. The relationship is ambiguous. On one hand, it's currently platonic for both sides. On the other hand, they're so comfortable with each other that it could easily swing to romantic at any moment. And the fandom will rejoice the moment that happens, and quietly hope that the day when they'll have to kill one another may never arrive.\\n\\n\\n\r\nSupporting characters (Not much to say about them): 7\\n\\n\r\nMatthew's the Watson to Ikta's Sherlock, asking him the questions we're asking and getting Ikta to explain his philosophies. Torway's a long range gunner, and is basically Julian Mintz only he's not as close to Ikta. The princess is there for exposition on keeping Ikta updated on national politics. Haro's just there for Ikta to flirt with because Yatori's not entertaining him.\\n\\n\r\nEnemies (Biggest gripe): 5\\n\\n\r\nFor a rival in the season finale, they give us Jean, who is very obviously Reinhard-lite. Ikta is close enough to Yang Wenli, but Jean is a far cry from Reinhard. Reinhard had his tantrums and panic moments, but Jean is just plain narrow minded and arrogant. Currently, for all his hype, he's just \"some dude to defeat\" rather than \"the eternal rival\". \\n\\n\r\nAnd if I'm gonna compare this to LOTGH, it's greatest weakness is that it just touches a little on the enemies. Just barely enough to give lipservice to the standard of applying a simple layer of \"the other point of view\", while LOTGH immerses you completely in the cultures, the perspectives and the failings of both sides. Alderamin doesn't do that.\\n\\n\r\nEnjoyment and overall: 8\\n\\n\r\nMuch as it's falls short of the masterpiece - LOTGH, it's good enough to stand on its two feet as a light novel adaptation. I pretty much enjoyed it. It's an 8 in my books.",
            "date": "2016-09-30T20:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 230734,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tlst9999",
                "username": "tlst9999"
            },
            "url": "https://myanimelist.net/reviews.php?id=230734"
        },
        {
            "content": "Alderamin on the sky is another splendid anime title by the unstoppable Madhouse Studio.Having already produced a widespread of critically  acclaimed manga adapted anime(Death Note,Parasyte,Trigun,One Punch Man,Black lagoon,Hunter X Hunter) Madhouse has yet again made another successful adaptation to add to their collection.I would even go as far as to say that it nearly beats Yuri on ice for my favourite anime of 2016.However,AOTS does not have gay characters which Yuri on ice does,which is why I lowered my score from a 9/10 to a 8/10.Overall,if you are not gay, you will undoubtedly have a pleasant experience with this anime",
            "date": "2017-03-19T04:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 242952,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FopThePanda",
                "username": "FopThePanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=242952"
        },
        {
            "content": "REVIEW WITH NO SPOILERS\r\nI was hoping for a bad anime. But what I found watching Alderamin on the Sky was a really good plot about militar life and a great protagonista, besides a really good animation.\r\nIt's not perfect, there are some bugs in the animation, and there are supporting characters that are basically useless (Haro). The end of season it's really opened... and there will not be a second season. But there are some intelectual moments about strategies that are really interesting.\r\nSo, if you are looking for a militar anime with some interesting militar strategies, some interesting characters, but really incomplete story, Alderamin on theSky it's the perfect anime!",
            "date": "2018-01-27T17:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 269835,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6406325.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JohnPerez",
                "username": "JohnPerez"
            },
            "url": "https://myanimelist.net/reviews.php?id=269835"
        },
        {
            "content": "Alderamin on the sky is an ambitious series. From the start, the series shows that it wants to go places, explore different themes about ambition, justice, the individual and the state. Yet the show fails to deliver upon this ambition.\r\nLet's start with the story. The story is a grand fantasy adventure taking place somewhere which is not earth. Every human being has a companion, a spirit, which looks like a little plushie with wings. They're slightly bizarre and are there for unknown reasons beyond making introductions in the early part of the series extra awkward as everyone presents their spirits as well as themselves (theydon't seem able to talk, yet I can swear I thought one of them did at some point, no matter). This whole thing is conveniently forgotten after the first few episodes, and I wasn't sad to see it go. It seems like mostly something tacked on as an extra cool thing to make the story stand out from every other light novel out there.\\n\\n\r\nThey do have a purpose later on in the story, but I'm not really sure if that's enough to justify having them at all. At the beginning of the series it seems as though we're headed for a classical uniform academy kind of show, thankfully though the series has bigger and better plans. Most of the show is done on the road, in different locations with the military that our main cast joins as the focal point of the story. There's also a princess thrown in for good measure but I'm not gonna spoil you on her role in the show.\\n\\n\r\nThere are several problems with the story, the biggest of which is that it's not entirely sure how to tell its story in a way that doesn't either lean too heavily on exposition-heavy dialogue or swinging the pendulum fully the other way and not giving us nearly enough information to have a clue as to whats going on. This means that sometimes you'll feel like they're really shoving information in your face while at other times the story is running faster than Usain Bolt in another direction while you weren't looking. Another big problem is the fact that the ambition of the story is to tell a big tale, I had a vague feeling that it wants to be a bit like a fantasy Legend of the Galactic Heroes (an excellent show you should watch). However the series doesn't have the chops to pull it off. Things get convoluted real fast and suspension of disbelief is stretched beyond a comfortable point at several places in the story. Most notable in the run-up to the final arc of the series.\\n\\n\r\nThere is a large cast of characters in the show, but it mostly focuses on our brilliant prodigy/genius Ikta, a man for whom being lazy is not so much a part of his personality as his very own ideology of living. The series tries to deal with several dichotomies, Lazy/hard-working and Science/Religion being the main two. Yet this often feels tacked on by the author, as does several other elements of its more philosophical moments. Perhaps the most interesting element of this is the discussion of what is worth protecting, but really I think there are plenty of other anime which gives a better discussion of this without the feeling of pushing an obvious agenda. The whole story comes across as clumsy and inept most of the time.\\n\\n\r\nThis is not to say that the series doesn't have its moments. It is not as full of clichés as one could expect from a Light Novel adaption, and the fact that the women in the story are not sexualised and made into objects felt refreshing. Some twists in the story were not as heavy-handed as others and gave a good sense of the consequences of your actions. The main heroine was absolutely badass and her character design was fantastic. She gave off a sense of lethal grace even when she wasn't brandishing a sword or kicking the protagonist. There were some odd choices in the casting for the voice acting, but overall it worked pretty decently.\\n\\n\r\nA more pressing issue in the production of the anime was in the art. While the character designs were mostly on point for the main cast, the \"important person hairstyle effect\" was very much real. Any person that was important could easily be separated from others by their hair. Frankly, this is lazy and a show as ambitious as this could put in some more effort. The action scenes were mostly done with few frames and very little action happening in front of our eyes. While I do not expect a show as packed with action as this one to have every scene be a marvel, one could expect at least some effort to make the art stand out a bit.\\n\\n\r\nFinally, while all of these problems are definitely noticeable, some more than others, this does not detract too much from my overall enjoyment of the show. It was trying to do something different, and while it ultimately failed in its ambition, the ride was still one worth taking.\\n\\n\r\nI rate this show a fair 6/10.",
            "date": "2017-11-25T14:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 263945,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5532495.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ZearoX",
                "username": "ZearoX"
            },
            "url": "https://myanimelist.net/reviews.php?id=263945"
        },
        {
            "content": "There are many questionable things I found, but at the end of the day, this anime the best of it's kind - military/strategy, albeit far from perfect.\r\nStrong Points:\r\nMain cast and important characters are all pretty reasonable people, the antagonists aren't brain dead evil for the purpose of evil types, they all have their strengths which prove useful at some point.\r\nWhile MC is kinda OP, he does it in a way that is clever and interesting to watch rather than unleash his super mega final move for the instant KO. \r\nPretty good tactics for the most part that will often be things you didn't think of,kinda similar to \"No Game No Life\"\\n\\n\r\nHas some pretty good quotes/philosophical ideas that some might like. Such as how lazyness drives progress and never ordering people to suicide.\\n\\n\\n\\n\r\nThings many people will dislike/find questionable: If you are fine with these (they are mostly very minor) you will probably like it more than the 7.95 rating suggests\\n\\n\r\nArt: those lips. What? This is 2016 why would you do something weird and experimental like that?\\n\\n\r\nSome decisions don't make too much sense once you think about it. Minor flaws that won't be noticed by most people.  maybe 1-3 times in the series? Don't wanna spoil anything but the whole finger episode and unexplained change of being able to shoot without being scared didn't make too much sense for their characters.\\n\\n\r\nGot confusing near the end of 3rd arc, though it might be because I was tired and I watched the whole thing at once.\\n\\n\r\nThe spirit's aren't explained well and honestly don't need to exist. Basically it's an accessory thing that doesn't really add anything.\\n",
            "date": "2016-11-21T06:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 234132,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5241403.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/anmeme",
                "username": "anmeme"
            },
            "url": "https://myanimelist.net/reviews.php?id=234132"
        },
        {
            "content": "Firstly, the main thing I loved about this series has to be the setting and characters which are set up nicely in the first episode, showing the intriguing magical culture in the fantasy land which juxtaposes its military theme. Furthermore, the writing of the characters seems to flow throughout the series, exposing their flaws and what exactly drives them, although the series does not delve into their backstory to a large extent for many characters. Despite there being an obvious story being told in the series, it never became apparent to me why certain characters acted the way they did, or even really the goalof the main character - this was due in many parts to the show only having one series which was left on a note where the main character would have suddenly undergone a change in goal and personality; though sadly it did not come to be. I link this anime heavily to Code Geass in some way due to the MC being a cunning strategist who always seems to have a trick up his sleeve in order to turn the battle on its head, but the cocky and lazy nature of Ikta made it so much more enjoyable to see him win: he always left me surprised. I found the voice acting for most characters rather enjoyable however some made me feel that they did not suit the vibe of the characters they were portraying (at least in the dub). Overall, the series was very fun and enjoyable to watch due to its great world building and themes, however, I found it to lack in certain in aspects like some of the main characters (who were set up well in the beginning, but gradually lost momentum and were never fully explored) and the development of the overarching plot. Personally, I'd recommend this anime if you'd like to watch something interesting and fun, though lacking in plot devices, however, do keep in mind it may never receive a second season.",
            "date": "2017-08-20T09:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 255877,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hikaragi",
                "username": "Hikaragi"
            },
            "url": "https://myanimelist.net/reviews.php?id=255877"
        },
        {
            "content": "(Tbh I ought to be sleeping by now.)\r\nTO KEEP IT SHORT:\r\nNejimaki Seirei Senki: Tenkyou no Alderamin (Alderamin for short) is a military anime with intelligent nods to the issues that come with imperialism and religion. While it does have fantasy themes, this is used to give reason to the war. Don't expect huge, spiraling battles as the heroes rain down their bossness from the skies! This is down and gritty and most of all REAL: the protagonists and their troops are outnumbered, under-supplied, 90% of their superiors are incompetent, their country isn't even worth protecting, and their enemies often have completely legitimate reasons for war.The aim here, as you'll see if you watch this, is not to win---it's to live for tomorrow.\\n\\n\r\nBut don't worry! Madhouse doesn't hold back on the blood (though they're not excessive)! For the faint-hearted, however, it might be pushing your limits.\\n\\n\r\nOVERALL (rounded up 8.5) - As an avid player of the Fire Emblem series, I easily find interest in tactical series that focus on the multiple faces of war. Alderamin isn't just battle after battle; Alderamin brings together rather legitimate politics with battles that aren't always head-on bloodbaths. There's other ways to go about war and the lazy way is one of them!\\n\\n\r\nRATING EXPLANATIONS:\\n\r\nSTORY (8) - Thirteen episodes is usually never enough for thoroughly thought-out anything; it doesn't matter the genre, it matters the idea and how well it's laid out. Such is the case for Alderamin. Madhouse made a smart decision to not squish too much into 13 episodes and the pacing prospers as a result.\\n\\n\r\nART/ANIMATION (10) - It's been awhile since I've seen such... Beautiful fights and soul-tingling tactics. It's a horrible beauty and a bittersweet feeling. Why? Because Madhouse takes steps to remind you at every turn that war is not light-hearted.\\n\\n\r\nSOUND (rounded down 7.5) - The OP you can rock out to every time it comes up. The ED calms you down, but I must be honest: it's pretty skippable. When Madhouse knows they're got the hype on their side, the OST really boosts it, but it also slips away.\\n\\n\r\nCHARACTER (rounded down 9.5) - Each one of the protagonists have their own shine, even if they do somewhat take from the usual anime archetypes. What really carries throughout the series is the depth of each unbelievably well-written relationship.\\n\\n\r\nENJOYMENT (9) - I found joy in the direction Alderamin went---with the characters and tactical choices---and excitement in anticipating what Ikta was going to do next.\\n\\n\r\nADDITIONAL RATINGS: Character Design - 8 ; Directing/Cinematography - 10 ; CGI - 9 ; Pacing within Episodes - 8 ; Pacing Overall - 9 ; Seiyuu - 10",
            "date": "2016-10-03T23:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 231060,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4461001.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SendPieSenpai",
                "username": "SendPieSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=231060"
        },
        {
            "content": "This one might be a hit or miss for some people, but for me it was one of the best of the season. The reason I enjoyed it so much was the resonance of its main theme: that overworking often gets you nowhere and working when needed and when it make sense is the best, as well as being lazy when you can and doing what's smart. The show calls it \"scientific thinking,\" and it's an idea that a lot of people don't seem to understand these days.\r\nIt applies that to many different ideas which is why the anti-war, anti-corruption, and often anti-religious messages feelso genuine, as well as the fact that many of the events call back to historical tragedies and social issues. It really portrays well how unfortunate it is to live in a society that punishes critical thinking or sends its soldiers to die in needless wars.\\n\\n\r\nThe characters and battles themselves aren't the main appeal for me, but I did quite enjoy them. I almost dropped the show after the highly incompetent first half of the first episode but after that I really feel it picked up. Other than the two or three most important characters, there's not much to speak of, though. Ikta Solork is a highly relatable main character for me and even though he can easily overcome most of the challenges in the story, the cleverness makes it feel like he earns it and it also goes far in pointing out that he lacks in other areas, like physical strength, and isn't the most charismatic leader.",
            "date": "2016-10-01T16:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 230822,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4897810.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/JasonWaataja",
                "username": "JasonWaataja"
            },
            "url": "https://myanimelist.net/reviews.php?id=230822"
        },
        {
            "content": "Underwhelming.\r\nThe story isn't particularly strong. It's been adapted for TV and it appears to have lost a lot of content during the transition. The religion of the empire is referenced several times but never explained. Why is it included if it's not going to become important? What's the deal with the nature spirits? How are they bonded to a person and where do they come from? They seem to be heavily relied upon by the soldiers, but not important enough to flesh out. The main war story line is simple enough with the only twist coming in at the very end of the show. There'stoo many hints and holes to give a higher score for the story.\\n\\n\r\nArt is done by studio Madhouse and they are very good. I'm not a stickler for animation and visuals so there's not much to say. I don't take issue with or find praise in any of it.\\n\\n\r\nSound is average. Opening is from the group that did GATE. It's a fair song not, anything to write home about. Voice acting is fine. \\n\\n\r\nThe characters are both a high and low point of the show. Ikta and Yatori have a very unique dynamic between them and have a fair amount of development. Haro and Matthew have little to no development despite being part of the main group. Torway had a one time development moment and just occupied space from then on. The princess didn't get any work either. Whiny and childish to the very end. There are a couple of moments where really good characters appear, but this is few and far between. \\n\\n\r\nThere was never really a sense of excitement or tension in the show. Despite being in a war most of the characters emerged without injury. No significant losses were taken. The main cast was protected by plot armor. The battle tactics didn't impress me. Taking advantage of terrain seems pretty basic. Killing enemies who can't fight back is nothing special. The only time Ikta was concerned about fighting was at the very end. The rest of the planning was done with an air of triviality. \"Go here and shoot them when they make a move\". Don't worry about it. I will give Ikta credit for being about to read his opponents and predict their moves. That's cool. \\n\\n\r\nOverall, Alderamin on the Sky neither flew or told how they even got on the sky. This is an average show.",
            "date": "2016-09-30T21:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 230740,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5443773.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ToonShiba",
                "username": "ToonShiba"
            },
            "url": "https://myanimelist.net/reviews.php?id=230740"
        },
        {
            "content": "I'll keep this short and simple\r\nThe art is better than most and while the artists don't focus on the blood and guts it is there. It is shown to be more realistic than most war anime.\r\nThe sound is alright with a few selected ost that are good but nothing that truly stands out. This is one of the things that stop this series from being great. Most truly great anime have at least a single soundtrack that absolutely blows your mind such as Gate of Steiner, Half of Death Notes soundtrack, and the entirety of FullMetals soundtrack.\r\nThe character and story need to be linked together.They are the best part of this anime. The characters are portrayed realistically with their own quirks, goals, and motivations. I wish they had a bit more of the fears but still would rate it well. The story progresses in arcs that are handled well with pretty good resolutions that even tie into each other instead of one offs. It keep pace with some of the themes of the story such as the price for doing good, scientific advancement, and corruption/incompetence costs.\\n\\n\r\nI enjoyed this anime a lot. You might be wondering why I gave it only a 7 then. The mood comes across heavy handed. This is a war and tactics anime and it handles itself like that. The story leaves me in a somber mood. I found myself hoping for nothing bad to happen rather than have the main characters succeed. The one thing that this story severely lacked was touching moments. They instead mostly had heart rending ones. I just wanted one or two moments where I could've gone squee over.",
            "date": "2017-01-26T20:20:00+00:00",
            "helpful_count": 2,
            "mal_id": 239198,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1346605.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Caimthehero",
                "username": "Caimthehero"
            },
            "url": "https://myanimelist.net/reviews.php?id=239198"
        },
        {
            "content": "Having just finished half a dozen or so light-themed shows, Alderamin was a great palette cleanser. This show is a military-based, strategy-focused action show featuring an early rising general, Ikuta, and a merciless melee swordsman (what is it with swords and redheaded gals these days). It takes place in an alternate world where cavalry is still in use and rifles are considered the bleeding edge of technology. The show reminded me strongly of Valkyria Chronicles in many ways- primary protagonist, early plot progression, and the technological state of the world.\r\nThough not a complete masterpiece, the show tells a contiguous story and is led by aprotagonist who for once is not an all-powerful Kira Yamato like figure. Unfortunately, the story isn't really complete; it only tells the first chapter of Ikuta's rise. Nevertheless, it is an enjoyable ride and leagues ahead of other recent shows like Qualidea Code.\\n\\n\r\nAnimation:\\n\r\nAlderamin has a rather bright, saturated color palette, giving the show a bit of a happy mood despite the brutal reality of war. Shading is actually pretty good and you get a lot of pretty colorization effects in the background. Some of the battles feature a bit too much 3D CGI for my taste but I guess this is becoming the norm these days. I'm also not a particular fan of the character styling, honestly I almost skipped out on this show because of the facial drawing style. Emotions are fair overall but occasionally characters feel a bit stiff, especially the heroine Igsem and our princess. The show also feature miniature fairy-like spirit beings that specialize in generating light, fire, etc. They kind of look like less-cute, emotionless versions of Normins found in the Zestiria world.\\n\\n\r\nThere is a large amount of action in this show though the choreography isn't anything special. Expect a great deal of blood in this show, especially whenever sword master Igsem shows up. There's a large amount of suffering and death in the show but they almost always spare you from the more grueling parts. This isn't a show about a particular character's invincibility in battle, the excitement comes instead from the protagonist's ability to tactically outsmart his opponent. Though there are a few suggestive scenes and Ikuta is a bit of a player, this isn't an ecchi-focused show.\\n\\n\r\nSound:\\n\r\nThe sound package was a bit underwhelming overall. The show opens with a rock-based OP that badly needs a more focused melody and ends with an ever-so-slightly slower ED that likewise isn't particularly memorable. The BGM is mostly orchestral, supportive but nothing special.\\n\\n\r\nThe show has a fairly good VA cast led by the commanding performance of Risa Taneda. We also have rising stars Haruka Chisuga and Inori Minase in important roles. That said, there are tons of guys in this show; expect a large amount of screen time to be taken by stereotypical military/politically-inclined male voices.\\n\\n\r\nStory:\\n\r\nFrom the very beginning of the show, we hear the princess narrate that this tale is about the early career of Ikuta, who will eventually be revered as a genius general. Despite this giveaway plot shield, the show still manages to draw the user in through rather clever tactical troop strategies - it's like mystery but you're guessing how he'll overcome the next obstacle. Despite being a war-themed show, the mood is surprisingly light for a good portion of the time- whether it is the playful, relaxed nature of our protagonist or just inappropriate atmosphere is up to the viewer. There is a bit of political maneuverings and some hints at racial divides, but compared to A/Z or Schwarzesmarken I would say it's on the light side.\\n\\n\r\nThe story can be roughly divided into four main story arcs, each with its own rising action and climax. There aren't too many cliffhangers per say but there are a multitude of nicely placed plot twists. Though we have a military genius in our protagonist, there are some pretty interesting curveballs thrown his way. The show ends on a ridiculously large cliffhanger that begs for more episodes, this feels like but chapter one of a long and interesting novel. One drawback is the huge number of unanswered setting questions, the largest of which is what the heck Alderamin and the unexpressive spirits that accompany everyone are. Thank goodness, the main plot is exciting enough that you won't have too much time to dwell on such questions.\\n\\n\r\nCharacter:\\n\r\nIf you're tired of the typical male protagonist, then Alderamin sure has a treat for you. Ikta may be a smart, cunning military officer, but he is also lazy, outspoken, and a flirt. He is as commandeering with the ladies as he is on the battlefield, though this is by no means an action based harem. He reminds me a lot of Welkin Gunther from Valkyria for obvious reasons, but is much more unpredictable in general, and thus much more interesting. Rarely in this genre do we see a leading figure so blatantly heedless of rank.\\n\\n\r\nThe other characters are more average in general. Supposedly, the first arc introduces Ikta's friends, but honestly other than our redhead heroine, the others don't really get that much serious interaction or exposition. Even the princess is still quite the mystery at the end of the show. The antagonists are likewise fairly generic and some verge on downright inept.\\n\\n\r\nThough there are some character interactions and light development, don't expect any particularly deep relations to form; just look at how small a part Daru Nanaku and Suya end up playing. Honestly, if you're going to like the characters, you'd better like Ikta.\\n\\n\r\nValue:\\n\r\nAlderamin is an above average show that does a good job of differentiating itself. Though production values are not particularly strong, Ikta and his interestingly unpredictability give the plot a strong boost. It is a bit annoying that the show leaves such a huge portion of Ikta's back-story unexplained, but there's enough of it to whet one's appetite. This is an entertaining watch, and I hope we'll see more of it.",
            "date": "2016-12-21T23:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 236086,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=236086"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nNejimaki Seirei Senki: Tenkyou no Alderamin localizes to Alderamin on the Sky. While the anime itself doesn’t take place in the sky, I’ve been up there myself a handful of times when flying to other states.\r\nI don’t hate flying, but I much prefer to be on the ground. It’s safer, has better Internet, and I don’t have to share an armrest with another. Also, fast food. I can go get some tasty McDonald’s whenever I want; can’t do that on a plane.\r\nAlderamin is like flying on a plane: It has its perks, but it couldimprove in certain areas.\\n\\n\r\nSTORY\\n\\n\r\nThe anime follows Ikta Solork, resident lazy man and best friend of Yatori Igsem. When the two – alongside Torway Remeon, Matthew Tetojirichi, and Haroma Becker – encounter rough waters that shipwreck them in enemy territory, war changes their lives. For better and for worse.\\n\\n\r\nThere’s a lot more to the show than at first seen. Not that it’s nuanced, let alone exceptional, but it does try its best to provide a multifaceted experience.\\n\\n\r\nOn a militaristic front, Alderamin does well. Ikta’s battle decisions, like hiding a fallen tree in a river to create a makeshift bridge or using the smell of oil as a double-feint, are small. Yet they drastically change the course of a single battle. Of course, the gunfights and the sword duels ultimately sway the tide, but Ikta’s strategies give the different skirmishes their edge.\\n\\n\r\nThe differing effects of war also come into play. Adapting to a new environment. Deserters. The treatment of civilians. Unrest and the government’s moves to improve public morale. Living with a potentially incorrect choice. A lot of these details happen in the latter half of the story because that’s where the war really starts to take the helm. But, even in the opening half, where thoughts on fighting a pointless battle and knowing when to retreat, war’s effects are still present.\\n\\n\r\n“Science” also plays a major role. Quoted because, in this age, such a concept does not exist. For the show’s purposes, science represents logic. That means thinking correctly, making the right choices, and doing away with the improbable. For Ikta’s purposes, science represents laziness. Not as derision towards the field but as a means to end. As Ikta sees it, “Laziness is the mother of all progress.”\\n\\n\r\nThe concept is brought up a lot throughout the season. Perhaps to a fault. But its connection to the wars at hand, such as with flying blimps and better weapons (i.e., technology), make it a relevant topic no matter the scenario.\\n\\n\r\nThe interesting part is when the anime starts to introduce its religious element. Namely, Alderamin and the Spirits. Words on contradicting beliefs (“The bigotry that twists the truth by ignoring anything that doesn’t benefit God!”) and battles fought due to holy doctrines are thematically relevant to both the war and the science motifs.\\n\\n\r\nIt gives these motifs more thoughtfulness through questioning. Is such a “holy” war sound? What does science mean in a world where tiny colored dudes are powered by geological chips? In war, who is right and who is wrong when opposing viewpoints clash? Are scientific discoveries blasphemous? Again, these questions are almost never answered directly by Alderamin, but the anime at least postulates them with this three-way combination.\\n\\n\r\nSimultaneously, the fantasy element cannot be denied. The Spirits command light and wind, water and fire. The various factions, such as the Kioka Republic and the Sinack Tribe, add cultural significance. The advent of a new “sniper” class improves current tactics. Combined with the war and the science and the religion, it stands as a nice backdrop to these other, more involved elements at play.\\n\\n\r\nThe show can also be surprisingly comedic. From Yatori holding Ikta back from pouncing on Remeon to the entire conversation on the men relieving their sexual urges while stationed (“P-pay your respects to a lonely warrior!” as everyone salutes) demonstrate its comedic chops. While Alderamin (understandably) reduces the total amount of comedy as the war takes precedence, when it is there, it works to keep everything lighthearted.\\n\\n\r\nIt even has some nice lines and metaphors. Yatori’s words on people are noteworthy: “Can’t build a house out of only straight sticks.” Ikta’s callback to the masturbation joke that also highlight’s one’s morals: “I don’t care if you’re a hero or a warrior. But I’ve got no patience for beasts.” His “Matthew, my friend…” as a sincere yet comedic opener whenever he addresses Matthew. These small bits of dialogue are placed all throughout the season, giving the audience more to contemplate and appreciate.\\n\\n\r\nAlderamin isn’t all praise, though.\\n\\n\r\nOne of its bigger problems is the pacing. Episodes will sometimes jump ahead months or days at a time to get to where they need to be, losing out on build-up or at least feeling like convenience. Despite these jumps, the final arc of the season, which technically takes up the last six episodes, drags on as more and more tangentially related conflicts occur. Taken together, the plot’s movement feels all over the place, hurting the narrative’s pull on the audience.\\n\\n\r\nThe villains are also an issue. Remeon’s older brother doesn’t reappear again after his failure, and Jean “The Unsleeping, Shining Officer” Alkiniks is nothing more than an Ikta clone minus the interesting personality. Furthermore, the dimwitted generals on the Empire’s side tread into overly evil territory.\\n\\n\r\nIt also has a surprisingly small amount of world-building. The show doesn’t explore the Kioka Republic to any large extent, the more important families, like Yatori’s and Chamille’s, are only given a couple of expository asides, and the show doesn’t visit too many different locales or at least doesn’t care too much about them. Even the Spirits – arguably the show’s most important aspect – show very little beyond their magic. For an anime featuring a war-torn world that also focuses on worldly ideas like science and religion, these missing details all act against the anime\\n\\n\r\nAlthough, the ending is perhaps the worst offender since it makes the whole season feel a bit unfair. Chamille unveils her big secret – that she wants the Empire to “lose” yet “win” with Ikta’s help – only right as the anime concludes. It does not retroactively make the prior events inconsequential because they established the characters, the themes, and Ikta’s reputation. But, because the main plotline was never even a factor this entire season, it ends Alderamin with a sense that not a whole lot was accomplished.\\n\\n\r\nANIMATION\\n\\n\r\nAlderamin is yet another anime where its visuals, while strong in the beginning, slowly degrade over time.\\n\\n\r\nWhen the anime first starts out, it puts a large amount of stock in pizzazz. A shot of Ikta and Yatori with a purple nighttime sky as their backdrop. A fire’s light dancing across Chamille and Haroma as they sit within a nearby cave. Sunlight hits Remeon’s face as he walks about the school grounds.\\n\\n\r\nAll the while, the locations themselves dazzle. Lush greenery filled with palm trees and local fauna. The capital city with its majestic, white buildings. Mountain ranges featuring scraggly passages and even rougher grounds. The anime steeps itself in these realistic yet fantastical areas, keeping in line with its premise.\\n\\n\r\nThe animation, while not impressive, keeps up, too. Yatori going berserk against a bunch of defectors or Ikta fending off wolves with her (when they were kids) provide some cool action sequences.\\n\\n\r\nHowever, the further along the anime goes, the worse off it gets. The pizzazz gets dropped for the same red tents everywhere. The backgrounds turn into gray clouds, muddy encampments, and dense forests that are not as interesting as the fantastical elements before. And the different battles rely more and more on still shots of the characters in action rather than them actually performing their moves.\\n\\n\r\nShots like a lone flower in front of a defeated castle or the usual Ikta-and-Yatori back-to-back frame do appear, but these more cinematic ones are not as prominent.\\n\\n\r\nStill, the character designs maintain its artistic strength. Before joining the army, the cast have their own style. Yatori’s open shawl and shin-high brown boots. Chamille’s regal outfit. Ikta and the other men’s casual clothes. It gives them a sense of everydayness, that they belong both to their country and to themselves.\\n\\n\r\nWhen they enter the military school, they no longer don these outfits. However, what replaces them are officer uniforms. Black coats laced with gold and red embroidery, black pants to match the top, and various accessories (belts, buttons, etc.) give the cast of Alderamin a lean, proud depiction.\\n\\n\r\nCHARACTERS\\n\\n\r\nAlderamin doesn’t have the best supporting characters around, but what it does have is Ikta.\\n\\n\r\nIkta’s personality is established right from the get-go. He’s a lazy jokester. Smart in the ways of war, flirtatious with the ladies, and hater of all naturally born pretty boys. Plus, he’s arrogant. Not that he’s not kind or at least considerate towards his friends, but he certainly carries himself with an air of superiority.\\n\\n\r\nOne of his best character moments happens right in the first episode. Chamille, fraught with emotion, demands that they escape from their in-enemy-country predicament. Ikta, however, grabs her by the face, treating her as the child she is and disrespecting her royalty status. It captures his better-than-you attitude, but, more importantly, it highlights his disregard for convention.\\n\\n\r\nFor that’s his biggest strength. Rather than worshipping the bare minimum of words in a history textbook or following the old tactics of old war generals, Ikta thinks outside the box. Setting aside their paint-bullet supplies in the rain to produce more ammunition. Eating poisonous bugs after removing their fangs. Using so-called “science” to make the most informed of decisions.\\n\\n\r\nBut he’s not just a man with a logical mindset; he’s also a man with a heart. He understands that the mistreatment of Spirits, regardless of religion, is something abhorrent. And he will literally cut off his own pinky as a sign of cultural placation towards a friend from long ago.\\n\\n\r\nThe season doesn’t explore his sensitive side involving his mother, but, clearly, it’s something that troubles him. And the majority of the season showcased how easy it all was for him while the latter sections tested his mind to the max. In other words, he isn’t the most nuanced of characters, but the anime has his progression in mind.\\n\\n\r\nIf nothing else, his relationships with the other characters help to round him out that much more.\\n\\n\r\nWith Matthew, he calls him “my friend,” and with Haroma, he makes her the object of many lascivious remarks. But for both, he comes to learn of the resolve of others. How people that may seem incapable of handling a situation are willing to prove themselves – either through mettle or through care.\\n\\n\r\nRemeon is someone who has a hard time coming to terms with killing another in times of war, dealing with a mean older brother, and trusting his abilities as a marksman. Ikta, though, believes in Remeon more so than Remeon believes in himself. Such belief grants Remeon the courage he needs to fight on the battlefield.\\n\\n\r\nChamille is the one to force him out of his comfort zone. She makes him into a soldier (the last thing he ever wanted to be), she brings up his mother (something that makes him furious), and she looks to him for answers (overwork being the death of heroes and all that).\\n\\n\r\nBut it works the other way, too. His teasing about her age and his treating her like everybody else gives her the chance to be someone besides the princess of the whole Empire – and makes her realize Ikta’s full potential.\\n\\n\r\nWithout a doubt, though, Yatori’s relationship with Ikta is the most interesting. Where one may think her to be an immediate (and the main) love interest, the connection they share is purely platonic. She keeps Ikta in line as best as she can whenever he does something unnecessary or foolish, and he does what he can to lessen her burdens as she takes part in the war.\\n\\n\r\nAs they would describe it, they are each other’s left and right hands. Episode five makes this obvious; it’s dedicated to depicting how Yatori and Ikta’s relationship came to be. Their time eating food, learning about science, and fishing in the river grew them close as friends. But it was their nighttime defense against a pack of hungry wolves that demonstrated their fortitude and how well they matched together. Ikta the brains, Yatori the brawn. The left hand and the right hand. Working in unison.\\n\\n\r\nThe best indicator of their relationship, however, is how they sit with one another when alone. From their victory over the wolves to their nightly dinner talks, they sit back-to-back – because they have each other’s backs. If that doesn’t scream friendship, then nothing does.\\n\\n\r\nYet there’s a twist. Throughout all of Alderamin, the show makes it evident how devout Yatori (and her family) is to the Empire. Willingness to cheat on the solider exams. Kneeling intently before Chamille. Reserving her family’s legendary sword style for her enemies.\\n\\n\r\nDuring their stalling of the Aldera army, Yatori and Ikta demonstrate their trust in one another again when they both commit the same act of saving the Sinack fighters. But, afterwards, when Suuya expresses her animosity about Ikta’s choice to forego his own men and questions Yatori about whether she always agrees with Ikta, Yatori responds in the negative. And Ikta understands. That is, she would choose to save the Empire over Ikta, killing him if need be.\\n\\n\r\nThis quirk in their connection forms the basis for what will most likely be the biggest dramatic event in the series since it directly coincides with Chamille’s final orders before the season’s conclusion. Meaning, nothing actually came of it during the season.\\n\\n\r\nBut their dynamic is no doubt a complex one, adding yet more intrigue to Ikta and the overall anime.\\n\\n\r\nSOUND\\n\\n\r\nAlderamin’s original soundtrack is surprisingly its best musical area. It reminds one of a fantasy RPG with woodwind tracks and an optimistic piano piece, giving the scenes the atmosphere they desire. The OST is sometimes whimsical, often filled with emotion, and always nice to hear.\\n\\n\r\nThe ending track is not as strong, but, after a few listens, it starts to emerge in a favorable light. The soft lead in and the dancing piano throughout are easily the highlights, but the tonal selection – a semi-melancholic vibe – may not be the best fit for the show. Same goes for the fast-paced beat when considering the latter half of the season’s slower story.\\n\\n\r\nNobuhiko Okamoto as Ikta comes out on top in terms of voice acting. His joking, serious style gives him many opportunities to act equal parts lazy man and commanding officer. Junji Majima as Matthew does well, too, with his ever-so-slight nerdy way of speaking. After these two, though, no other performances were notable.\\n\\n\r\nThe opening track is arguably the weakest of all. If only because its more rock-and-roll, high-energy tone does not fit with the anime’s own. Plus, the distorted “whoa” and the ending, frantic guitar give the audience less happiness and more headaches.\\n\\n\r\nENJOYMENT\\n\\n\r\nThis anime is one of many where its first half is a lot more entertaining than its second half.\\n\\n\r\nIkta was key to the entertainment. His wise cracking, his focus on logic, and his holier-than-thou attitude made him into a bit of a jerk, but it was still fun to see him outwit his opponents and generally remain unfazed by the situations he was thrust in.\\n\\n\r\nAlso, his relationships with the others were fun, too. Yatori nonchalantly commenting about Ikta acting on his carnal desires. Chamille getting mad at him for wanting her lap to have “more meat.” Teasing Matthew (with Yatori’s help) for his self-applicable sayings. Haroma’s bewilderment at Ikta’s missing pinky. His envy towards Remeon’s naturally good looks.\\n\\n\r\nEven his small aside with Kanna, the girl who read Dr. Kahn’s book and started to question the world around her, was cute, too. Their dance in the town’s plaza put a smile on my face (only to have it replaced with a frown when she lost her life due to Ikta’s reasonable, tactical decision).\\n\\n\r\nAnd a shout-out goes to Yatori’s two major brawls. When she went ham against all the soldiers when protecting Chamille and when she dueled against Nana, it was pretty cool to watch. Especially the first one.\\n\\n\r\nUnfortunately, the second half wasn’t as interesting. Chamille left the group, Ikta cranked up the seriousness, and the war became the bigger focus rather than the characters. Not to say that there weren’t some fun moments, like Nana casually noting that it would have been fine for Ikta to sleep with her or Matthew’s masturbation conversation. But the action provided was not as intriguing. Same goes for Jean the villain.\\n\\n\r\nNejimaki Seirei Senki: Tenkyou no Alderamin has moments of strength and weakness here and there, but it’s mostly a middle-of-the-road show. A story centered on cultural elements, a main lead who overshadows everybody else, and some pretty art, atmospheric music, and comedic happenings. An uneventful plane ride (and still no McDonald’s).\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, ideas on war, science, and religion, supported by a fantasy backdrop, comedic material, and some cool lines, brought down by wonky pacing, questionable villains, lack of world-building, and an odd ending\\n\\n\r\nAnimation: Fine, nice artistic direction and good actual animation that worsens over time, and nice character designs\\n\\n\r\nCharacters: Good, Ikta’s rounded character and his complex connection with Yatori add strength to the cast where many of the others do not\\n\\n\r\nSound: Fine, bad OP, okay ED, good OST, and okay VA performances\\n\\n\r\nEnjoyment: Fine, Ikta and the rest make for a fun first half, but the second half can’t keep up\\n\\n\r\nFinal Score: 5/10",
            "date": "2018-02-18T12:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 271858,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=271858"
        }
    ],
    [
        {
            "content": "\"Laziness is the mother of human progress.\"\r\n-Ikta Solork\r\nPLOT AND STORY LINE 📜\r\nI seriously expected another average military, action story about teenagers that we have seen so many times before in anime like: God Eter, Owari no Seraph, Balck Bullet, Schwarzesmarken etc. But as I said in the beginning, I was positively surprised by the story that was both intriguing and entertaining. \r\nFirst of all, it is a very simple story. The plot revolves around Ikta Solork, a lazy yet very clever womanizer that detests war above anything else. But after his country, the Katjvarna Empire, attacks the Republic of Kioka, his world is thrown into chaosas he becomes obligated to join the war as one of the officials. Soon enough, his comrades would realize Ikta's intellect and talent as a leader, never imagining that he would actually be the hero that everyone needed.    \\n\r\n Now that I think more about it, the story it self is definitely nothing special, but it was still good. The first reason for that was definitely the main character who contributed the most to the entertainment factor. It was his wit and his war tactics that made the anime so interesting to watch. \\n\r\n In addition to that, each, let's say, story arc is somehow connected to Ikta's past. So the side stories are also vital parts that drive the plot into an intriguing and in many parts really emotional story that keeps your attention until the very end. And it is then where we stumble upon a real problem. Don't misunderstand, the end of the anime was definitely its highlight and the most exciting part, but the fact that it ended with an enormous cliffhanger is the real problem here. The part of the story that we see in the anime is just the tip of the iceberg, whereas everything that's coming after that is the real thing. \\n\r\nThe anime was nothing more than an introduction to the setting and the characters in the show. I haven't read any spoilers on the story that follows the anime, but I think  that it will definitely evolve into an even greater story than before. \\n\r\nLastly, there is one more thing that I actually want to tackle in this review and it is the relationship between Ikta and his best friend and the female lead of the show, Igsem Yatorishino, or just Yatori. The whole anime might be about the war between the Katjavarna Empire and Republic of Kioka but its very core is without any doubt the friendship of Ikta and Yatori. The anime begins with the two and each event in the end ties back to them. I haven't read any spoilers on the novel so far but I am certain that the story will end in a very emotional finale that will involve their friendship. \\n\r\nOn the whole, the story might not sound like much, but it is without any doubt intriguing, exciting, entertaining and emotional until the very end. I got actually so interested in the story that I am planning on reading the novel, if I find a decent English translation that is. \\n\\n\r\nCHARACTERS 👦👩\\n\\n\r\nJust as I mention before, Ikta Solork is the main reason why I found this show so good. His character represents a very complex personality of someone that looks like a careless, happy-go-lucky person on the outside, but is actually very well aware of his surroundings and extremely clever. Ikta is a womanizer but is also someone that would sacrifice him self for the ones closest to him. Also he is one of the wittiest anime characters I've seen, amusing us trough out the whole show. When it comes to the other characters, I must say that they mostly have some superficial personalities without much involvement in the story. The only exception there would be Yatori. Her character has been given more detail in the personality and is so a vital part of the story. Still, when it comes to my overall opinion on the characters I wasn't disappointed, especially because I didn't expect much to begin with.\\n\\n\r\nANIMATION AND STYLE 💻🎨\\n\\n\r\nThe story and the characters could have been a bit better, but the animation was on point. Well, as expected from a Madhouse anime, right? I also liked the character design and the design of the very setting: the ancient country look, the way they dressed, the different regions/tribes etc. The only thing that kinda bothered me where the lips. I don't know why, but all the characters had strange lips that always stood so out. I can't say exactly what was wrong, but it was definitely strange. If you watched the anime and actually noticed that, let me know. \\n\\n\r\nCONCLUSION 📌\\n\\n\r\nThe best way to watch an anime is not to expect a masterpiece. I really thought that Nejimaki Seirei Senki would be another average military anime, but I was positively surprised with an intriguing and exciting story, interesting and amusing characters and a great animation. This anime might not be a masterpiece but it certainly deserves another season (which will probably never come). \\n\\n\r\nNow if you would excuse me, there is a light novel that I want to read (more reviews on http://worldofanimegirl.blogspot.ba/search/label/Reviews) \\n",
            "date": "2017-08-05T13:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 254760,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3873351.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/animegirlism",
                "username": "animegirlism"
            },
            "url": "https://myanimelist.net/reviews.php?id=254760"
        },
        {
            "content": "Really enjoyed this particular series mainly because of the main character Ikta Sorlork. To me is a guy that doesn't want to be part of the war, but ends up in it anyway. He is also the guy in the group that keeps everyone grounded and together. You can also see that he is ruled by his emotions even in critical times but that isn't a bad thing as he cares what happens to his comrades. I do hope that a season 2 would come out fairly soon as i am very interested in what his decision will be regarding the war going forward.\r\nThe reasonswhy i liked this is is mainly because it has a really good Story line that keeps the viever interested from start to end. The art work for me was done really well not just on the characters but on everything else going on around them. The sound is very clear and crisp and the background music was done pretty well at times. The Character development is also pretty good but i do feel that some characters can be develop a little bit more on certain aspects. I really enjoyed the series from start to end and in no means was i bored by any of the episodes as i do think the fit really well together. Overall this was a good anime as i gave it a 9/10",
            "date": "2017-01-17T22:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 238556,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Wouts33",
                "username": "Wouts33"
            },
            "url": "https://myanimelist.net/reviews.php?id=238556"
        },
        {
            "content": "Tenkyou no Alderamin is at no means a fantastic anime, playing a stereotypical characters over a mildly generic plot. Though with that said, this series isn't bad, either. \r\nThe overall plot is separated into clear-cut sections, with nice closings for each, easily segueing into the next part. These play with the series itself, filling in nice chunks of storytelling without boring the watcher with drawn-out settings. Though some parts of the story have its flaws, mostly noting the presence of \"sprites\" in the series, which at most play a plot device which if defined well could create a better connection with them in the world-building,but that was not given. \\n\\n\r\nMuch of the art didn't create mind-boggling animation, but it wasn't entirely distasteful either. I personally didn't like the weird large lips on some of the characters, such as the MC, but looked okay on Matthew. Different strokes for different folks, I guess.\\n\\n\r\nIn a military-based series, I feel that sound would play a large part in creating tension and setting of the story, whether it's just the sound effects or the soundtrack. Gunfire and mortar shots sounded fitting in every scene, but the overall soundtrack itself is forgettable. Not saying it was bad, but it neither added nor took any effects in any scene. The OP has that weird several-vocal harmonies reminiscent of Motley Crue's \"Kickstart My Heart\", which left a weird taste in my mouth. The ED on the other hand is a nice palate cleanser after the OP.\\n\\n\r\nSimilar to the above paragraph, good characterization would also create a more effective plot, with much of how the character reacts to situations playing a large role. For example,there's the MC, who's a generic copy-paste super badass, in this sense being an actual military strategist god. With that background, he reacts differently with different situations (as you would hope) and grew from mistakes and regrets throughout the series. As long as the character grows, I couldn't care how generic they started out as.\\n\\n\r\nOverall, the series could be skipped over, unless you have a major hard-on for military anime. While the art and characters being done well, the plot and sound of the series left a lot to long for.",
            "date": "2019-03-03T19:00:00+00:00",
            "helpful_count": 0,
            "mal_id": 302852,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7031132.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TacoChublets",
                "username": "TacoChublets"
            },
            "url": "https://myanimelist.net/reviews.php?id=302852"
        },
        {
            "content": "Alderamin in the Sky is NOT about Alderamin in the sky.\r\nOkay,im going to be real with you,this show did not appeal to me AT ALL, the only reason I started watching this was because of the premise,the fantasy/military setting is something I don’t really like all that much outside of FMA, that show despite having genres I don’t care for, pulled me in with its characters and story.But Alderamin is just the definition of BLAND. Im not kidding, if you look up “bland” in the dictionary, you will see the title of this show.There is nothing special about this world, there are some dumb lookingspirit creatures but outside of that there is nothing.Getting to the actual story, there was nothing special about it either.There is barely any conflict,there is one conflict, but it is so broad and predictable. And all the other supposed “tension” was not there because of all the lifeless characters and the processed story.Even the giant war that they had to fight was mainly stupid and uninteresting dialogue.There are also some themes that go to waist really fast.There is one theme about the secular vs the religious and it was sorta interesting, but it became a complete afterthought about halfway into the show.And the ending was retarded.That's not all folk\\n\\n\\n\\n\\n\r\nThe animation is just as bland.There are some fight scenes that are SUPERB ,which you can expect from madhouse, but they are few and far between.Outside of that the animation is not good, and not bad, it is painfully average.Also the character designs are kinda goofy, for a drab and brooding military show like this, the main characters have these bright palette color hair and I laughed so hard at the crowd shots with them in it.You could see all these people with regular hair and then see this outstanding green haired person and it was funny af.The backgrounds are bland and bland bland bland bland and that's it.Some of the cinematography was not that bad though.\\n\\n\\n\\n\\n\r\nOne reason i don’t like medieval fantasy sorta shows, is because of the soundtrack that sounds mainly the same in almost every show,movie,or game i experience.And its the case here,the soundtrack was so boring,there are times when tension hits and the soundtrack does not make it significant at all.Also the ending was skippable and the opening sounded silly.There was some weird distorted guitar that made my ears bleed and this weird chorus that sounded like they were making the “wa wa” sound with their hands and autotuned it lol.The singer was good though.AND THE DUB UHHHHHHHHH. I feel like funimation has some priorities with their dubs,there are the ones that they actually put effort into making, some they have fun with, and some that end up in the bargain bin. Guess which dub this one was.Honestly this has to be one of the worst dubs I have heard from funimation.Some actors did a fine job, and the rest sounded so stilted and bland, just like their character counterparts, SPEAKING OF WHICH\\n\\n\\n\\n\r\nIt's just amazing at times to see characters handled so poorly.After Classroom of the assholes\\n\r\nI thought I've seen enough,with Classroom of the Assholes I was dead wrong.Getting to the main character “IKDA SALORC”.I hated him from beginning to end for a number of reasons. He is such a smartass knowing everything about everything, he usually starts fights with his big mouth and lets his friends fight for him, also he is unbearably selfish, and teaches such a bad message by promoting laziness in a time of war, and and it's not like\"don't do anything unecessary and make things easier\" it's like\"don't  do anything ,BE LAZY\".His way of doing things is to end battles in convenient ways(which totally does not make the show any more boring)but there is nothing appealing from that.He is not as bad as the main character from Classroom of the Douchebags because he has layers,even if those layers are not that great like at all.Also all the other characters are so shallow BECAUSE ITS ALL ABOUT IKDA it's ridiculous.The red haired girl has some type of background that makes her special or have a dark past or something, but then you see the episode dedicated just to tell her backstory and it's like the only bad thing about her is that she is in debt with the SALORC family or something idk.The show does a poor job explaining this girl because despite that super dumb flashback episode, all of the other traits and story about her are just word of mouth.Where the show screws up big time is by having certain minor characters that are more likeable and have more development than the actual main character.Three of my favorite characters in the show are super minor ones, and two of them get killed off in such an offensive way.It was like the show is mocking me. The main villain of the show was way more likeable than the main character as well, the show develops her,albeit a bit hastily but i'll take what I can get.All the others are either unlikeable or just background noise.NOTHING IN BETWEEN\\n\\n\\n\r\nOne of the most annoying things about the show was its tone.It drags you through all this boring crap and tries to pull a fast one on you by having these characters become mentally affected by the war and it so cheap and manipulative.You have this one character being like “uhh war sucks,i dont like it, it soo saad,i feel sad” but literally the show does not “show” the character going through it(like my joke there?)Also it is super contrary to the characters and it happens on a whim.One time, the actual tension came, it did not have the effect, Ikda did something gruesome to himself and i did not care, I actually wanted him to do that to himself because he is so unlikeable.One of the WORST cases of this is when this one girl is like”HEY CUT OFF MA ARMS BECUZ I DID BAD THINGS’ and this other soldier is like”WHY ARE WE STILL HERE…...JUST TO SUFFER…..EVERY NIGHT….I CAN FEEL MY LEG-”and then five seconds later there is some sexual joke made and all the seriousness just goes out the window.What a freaking joke.\\n\\n\\n\r\nIm not kidding when I said this show was freaking boring and bland.The plot was so stupid and unengaging, the animation is excruciatingly average,the soundtrack was not that good, the opening was lol worthy, the dub was trash,the characters UHHHHHHHHHH, and i found myself with the most uninterested face ever.Even the main characters and the good guys of the show are more villainous than the main villain and I found it super mean to kill off the two characters that I liked in the whole show.I think i've said enough.\\n\\n\r\nOverall-4\\n\r\nIkda Salorc, what a stupid name\\n\\n\\n\\n\\n",
            "date": "2019-02-22T07:50:00+00:00",
            "helpful_count": 0,
            "mal_id": 302194,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5141741.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/VivavideoUserJP",
                "username": "VivavideoUserJP"
            },
            "url": "https://myanimelist.net/reviews.php?id=302194"
        },
        {
            "content": "If you like military characters that are super lazy but excel at being \"super smart\" than this anime is for you. I dont know what to put in this review just to be honest i dont remember anything about this story other they where at war with somebody and i didnt care i just watch it to waste time and even that was a hassle. This show lacks the \"dont tell, just show\" to many boring dialog about how war change people and whatnot. \r\nThe characters are bland, the story goes nowhere and they and got the audacity to tease a 2 season at theend. It sad to see a great studio like madhouse making this type of anime, i will not recommend this if you want to watch a war series they are better out there or just go watch the Gundam series at lest 0079 to ZZ it better writing and for an old anime it got great animation.  \\n",
            "date": "2017-07-16T06:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 252992,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4635261.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OtakuMangaGamer",
                "username": "OtakuMangaGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=252992"
        },
        {
            "content": "Military style shows are a dime a dozen. In order to stand out it needs to do something to be fresh, exciting, or just different enough to be worth the watch. Alderamin on the Sky tries to do this, and seems promising at first, but it doesn't follow through on the things it tries to do different. Instead it plays it safe as the 13 episode series comes to it's end.\r\nStory: \r\n\tOur five main characters luck their way into High ranking status by saving the princess after the boat that was taking them to the military exam began to sink (for no apparent reason, otherthan plot convenience). They find themselves involved in a war, the cause of which is discovered through the development of the plot. The story slogs along for the first few episodes. It takes a little while before the main plot comes into fruition, but once it does, it becomes one of it's stronger aspects. With that said, I'm disappointed that the series didn't dive further into the spirits or the Alderamin religion as a whole. The war is based on this fictional religion and these spirits that are largely unexplored. 6/10\\n\\n\r\nCharacters:\\n\r\n\tIkta is the only character of the main 5 that feel developed enough for me to be invested in. I appreciate the fact that despite the events that lead to him being in a high ranking position, of which he does not want, his demeanor towards his peers, the princess especially, remains largely unchanged. He treats her as a friend and person, rather than a princess. He has a brutal honesty about him that is refreshing and relatable. His decisions in battle are well thought out, and the series does a good job of explaining them well enough to keep them being unbelievable or convoluted. Yatorishino has some development as well, but not nearly enough past the \"Do what I must to protect my country\" persona she has at the beginning of the series. Torway, Matthew and Haroma get way too little screen time for me to even consider then as main characters. They are likable in the time they are on screen, but even some supporting characters are more involved than they are. Suuya is one of those supporting characters and I appreciate the way she carries herself. 7/10\\n\\n\r\nArt:\\n\r\n\tThe art so far has been adequate, but some questionable choices were made in the battles that can be noticed all within the same episode.. The battle at the end of episode 4 was a glimpse of how good this series can look. The camera focuses on the character that is doing the most damage as they weave in an out of enemies, striking them down effortlessly. A battle that takes place just beforehand is poorly executed. It consists of extremely zoomed out wide shots of a battle taking place. When the camera zooms in, it doesn't show any of the battle in the forefront, but rather characters planning their next course of action while the real action happens around them. When they do focus on the action, the scenes are very interesting, I just wish they would be done that more. 5/10\\n\\n\r\nSound: \\n\r\n\tSounds effects are interesting. During one moment, gunshots are loud and blown out. The next, it simulates how a person would hear after just having been involved in a bloody battle. The OST is filled with wartime- style horn pieces that fit very well within the action setpieces. The voice acting (DUB) is less than stellar in my opinion. While characters like Ikta and YatorIshino fit well with their respective VA's, characters like Senpa and Matthew sound wooden and underwhelming. 6/10\\n\\n\r\nOverall, I give this series a 6/10. I don't regret watching it, however I wouldn't buy it. \\n\\n",
            "date": "2017-01-08T18:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 237826,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4825918.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirDooblay",
                "username": "SirDooblay"
            },
            "url": "https://myanimelist.net/reviews.php?id=237826"
        },
        {
            "content": "As I was watching the anime, some parts became familiar.  Then I realized it was based on a LN that I dropped a while back.  I was reminded through the anime why I dropped it, and it was mostly the female characters.  First we have the female lead, Yatorishino.  She is blindly loyal to her ideas and prevents the MC from expressing his own.  Clearly, Yatorishion would choose her ideas over her \"friend,\" so I am not sure why Ikta is friends with her.  She also uses force to suppress Ikta whenever he brings up unorthodox, but good points.Next is the Princess, she forces a lazy, belligerent Ikta into becoming an a soldier (officer candidate at that), which he vehemently was against.  Then we have Suuya, who has a personal grudge against the mc, and uses it to disrupt order withing the men in his command.  However, all these problems may be due to the mc not having any backbone and separating himself from these toxic women.  Also, for someone who is lazy, young and against joining the military, Itka is a genius in combat and strategy.  \\n\\n\r\nJust like the LN, this anime could have been better if those female characters would have been removed.  Their deaths would be a perfect excuse for the mc to grow.",
            "date": "2017-07-26T04:00:00+00:00",
            "helpful_count": 0,
            "mal_id": 253829,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017169.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MondoX",
                "username": "MondoX"
            },
            "url": "https://myanimelist.net/reviews.php?id=253829"
        }
    ]
]