[
    [
        {
            "content": "Samurai Flamenco is a strange animal. Despite its conventional appearance, it is full of twists and turns. Overall, Samumenco addresses its core themes very effectively, primarily the theme of heroism. It has likeable and developed characters with distinct personality traits. It also comments on general character/plot tropes, mainly involving heroes and villains, as well as the sentai/tokusatsu genres. (And doesn’t always take itself too seriously while doing so.) \r\nIt’s hard to find a show like this where you truly don’t know what to expect. It may be for this very reason that this show received such widespread negative reception: it's a bit quirky, but itisn't initially apparent whether or not it's trying to be. Many would say that Samumenco isn't quite sure what it wants to be. But now that it’s over, I can say that I’m very glad I stuck with it and that the writers had a clear objective in mind, even though the execution of that vision wasn’t always apparent.\\n\\n\\n\r\nDetails:\\n\\n\r\nStory: 8\\n\r\nIt starts out as a slice-of-life about an eccentric wannabe superhero, and proceeds to go through two major tone/plot shifts. The plot is paced somewhat erratically, and many might find the plot twists jarring. However, both of these shifts contribute to the overall themes of the story. \\n\\n\r\nArt: 6\\n\r\nAt its best, Samumenco’s art and animation is solid. At its worst, the animation was pretty awkward. Unfortunately there were often moments where poor animation detracted from the experience as a whole. While this can be forgiven for background characters, there were some important moments that would have had more impact if not for the distraction of poor animation. I think it would have been interesting if Samumenco had a style of animation that mirrored its eccentricity, but for the most part, things are pretty conventional.\\n\\n\r\nSound: 7\\n\r\nThe OST itself wasn’t especially memorable. The BGM fit the mood well, but there were no standouts. The OPs are enjoyable and fit the tone. (Personally, I really liked them both and they got me excited for each episode.)\\n\\n\r\nCharacters: 8\\n\r\nThe characters range in development, but overall they were all believable and likeable. The eccentric main character, Masayoshi, is an upstanding young man with a strong vision of heroism. What he lacks in ability, he makes up for in spirit, which is pretty darn endearing. Another major standout was Maya Mari. The story starts out from the POV of the other male lead, Gotou, the \"average joe\" who gets fleshed out gradually, if not as thoroughly as some other main characters. Some of the characters had very distinct and often conflicting personalities, which made their interactions very entertaining to watch. (A good example being Masayoshi and Mari’s contrasting senses of justice.)\\n\\n\r\nEnjoyment: 9\\n\r\nAlthough there are a lot of fields that Samumenco could have improved in, I still enjoyed it thoroughly. There are both serious and humorous quoteable moments. I found myself crying and then laughing at some points. The humor varies from a little tongue-in-cheek to downright hammy and ridiculous.  \\n\r\nI really loved the initial concept of the show, and was a little sad to see the plot veer from the slice-of-life superheroes plot of the first segment. For a period of time I wasn’t sure what to feel, as the rapid plot and tone shifts made it seem as though the show was going through a rebellious teenage phase. However, after a certain point everything fell together (albeit somewhat messily), and I would recommend that anyone who is interested should give it a chance and stick with it.\\n",
            "date": "2014-03-28T14:35:00+00:00",
            "helpful_count": 155,
            "mal_id": 137559,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1720733.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SleepyBear",
                "username": "SleepyBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=137559"
        },
        {
            "content": "Some shows jump the shark, while others perform a Samurai Flamenco.\r\nDeconstructions are some of the most demanding and intricate kinds of stories to pull off. It requires the creator to have proper knowledge of the formula they're trying to deviate from by understanding how the tropes and trappings of said formula should be incorporated, in order for it to feel natural. With the right pedigree of writing and proper usage of the commonalities associated with the given formula needed, the creator is expected to build the illusion to the viewer that they're simply following the setup they've already experienced countless of times before. And duringthis stint of limbo, where the viewer is caught up in the illusion, the creator then proceeds to dismantle and \"deconstruct\" the formula that the viewer had grown accustomed to. While it may seem like a relatively simple process, all it takes are a few missteps for it to implode on itself. And more often than not, if the writing for the show is shoddy at best, the end result can be more of a trainwreck than anything noteworthy (School Days can attest to that).\\n\\n\r\nBut perhaps the biggest reason that causes most deconstructions to fall flat on its face can often be something as simple as neglecting the fundamental building blocks of proper storytelling, more specifically, in this case, foreshadowing. Without it, things can come across as manipulated or just \"ass-pulled\" into the narrative. Proper foreshadowing is what allow the transition from following a formula to subverting it to feel natural. And when foreshadowing is non-existent, well..., we get things like episode 7 of Samurai Flamenco.\\n\\n\r\nSamurai Flamenco is a weird anime title, to say the very least. It's a satire, homage, parody, reconstruction, and deconstruction of the super sentai/superhero genre, all wrapped up in one. And if the idea of that sounds insanely convoluted to you, well, that's because it is. While the intentions it had was genuine, the presentation and overall direction it took to see its vision through fell short of the mark. And of course, many will simply single out the tonal/genre shift of the infamous 7th episode as their point of contention, but that was just one of many blunders the title made during its 22-episode run. At the end of the day, Flamenco just bit off more than it could chew. \\n\\n\r\nBrief history lesson: the Super Sentai phenomena have been something that has grown synonymous with Japanese culture with both live-action shows (Ultraman) and animated ones (Hurricane Polymar), for over 30 years. For the most part, it illustrates the fight between good and evil forces, and during its heyday, was a primary tool used to teach kids that \"justice always prevail.\" Usually portraying a team of color-coded heroes, with the help of high-tech gadgets, they fight off evil forces that threaten the stability of mankind. Due to its kid-friendly programming, it didn't take long for it to gain success overseas, which eventually brought it stateside, most prominently with the cobbled together The Power Rangers franchise. The Super Sentai series are basically more kid-friendly versions of superhero shows (4Kids level if you will). As such, the super sentai genre has become a part of many people's childhood. And that's where a title like Samurai Flamenco comes in.\\n\\n\r\nNow with that out of the way, Flamenco can be split into two parts: the first being along the lines of a traditional coming of age story told through the setup of a superhero origin tale and the latter half being a super sentai show along the veins of Power Rangers. Following our protagonist Masayoshi Hazama, we see his journey from a petty enforcer of the law, tackling trivial matters like recycling and obeying traffic signs, to him being caught up in higher stakes that escalate as the story moves forward. Similar to movies like 2010's Kick-Ass and Super, the 1st half of the show is more of a satirical parody of what the traditional superhero story is generally comprised of. While possessing no real superpower or qualities of a superhero, to begin with, most of the charm of the 1st half is seeing an average Joe attempt to live up to the role of the TV-show superhero icon of his youth. The fact that his \"heroics\" was no different than what anyone else can do themselves went a long way in grounding the show in reality. He was simply a vigilantly running around in spandex and as such, we see the real-life repercussions of those actions. In real life, a guy running around a city with his underwear worn over his bodysuit \"defending justice\" would be viewed more like a lunatic and nuisance than an actual \"hero,\" and the show knows that. In a way, it exposes the childish ideals that those super sentai/superhero shows were trying to feed kids growing up by treating situation realistically. It's an externalized reflection of the mentality of us as we grow past such juvenile ideas and \"face the music\" of what life is truly is. And to be honest, if the show had continued to take this approach, that would have been enough to make it a solid satirical parody, but that just wasn't the case.\\n\\n\r\nNow where the controversy comes into play is the show's 2nd half. It transitions from what was, to that point, a down-to-earth parody of a superhero story, to a show that turns into a full-fledged supernatural super sentai deconstruction. This shift from a grounded account to an \"out of this world\" supernatural one was done with no foreshadowing or build-up whatsoever, and as a result, caused a whiplash of adverse reactions among viewers that didn't see it coming. The negative backlash the show received was harsh and rightfully so. It isn't the viewers' fault, but rather the show for not handling the transition better. It didn't have to give away too much, but if it had simply dropped a few foretelling signs and hints throughout the narrative, its tonal shift would have been better received. Instead, it felt more like an out-of-place plot twist that had no business being there. While this was partially explained to those that finished the show, by that time, the damage was already done. This poorly handled decision was perhaps this show's biggest blunder. \\n\\n\r\nNot only was the tonal shift not handled well but the 2nd misstep was that the show crossed the line from being a parody to becoming the subject matter it was making fun of, to begin with. It would be like if someone were promoting equality but then turned around to proclaim themselves as a racist. It's contrived and defeats the purpose of the first action performed. While it still did an excellent job paying tribute to the super sentai genre, it did so with subtext that didn't match up with what was established in the show's 1st half. Tying back to what I was saying about this show taking on more than it can chew, the attempts at a deconstruction clashed with the narrative because of the already firm satirical stance the show had taken early on. \\n\r\nBoth the 1st half and the 2nd could have worked respectfully on their own, but when combined, they didn't have proper cohesion, and as a result, felt forcefully tact onto each other. It's like going from watching Neon Genesis Evangelion to the 2nd arc turning into Pokemon. Just because both titles have proxy battles, doesn't mean they should be bundled together as a single viewing experience. That's essentially what Flamenco did in a nutshell. \\n\\n\r\nThis mismatched exhibition wasn't limited to just the narrative either.\\n\\n\r\nLike the show, the cast also ranged from down-to-earth to wacky. Some characters feel somewhat believable to what you'll find in the real world, like Hidenori Gotou, the show's person of reason and friend to our protagonist. But then, on the other side of the spectrum, the antagonists can range from street-level thugs to batshit crazy megalomaniacs akin to a Saturday morning cartoon. The further the show goes down the spiral of nonsense, the more ludicrous the characters involve becomes. Even our person of reason is shown to have a rather disturbing backstory revealed towards the latter half of the show, almost as if the writers wanted to take him down to coo-coo land with the rest of the nut jobs introduced. \\n\r\nThe lead protagonist, Masayoshi Hazama, was nothing more than a man-child, being an adult with the mindset of an adolescent. As such, most of his actions are done to counteract the rational mindset of Gotou in the show's beginning. This, of course, changes as the title progresses forward, but I'll leave that tidbit for you to discover yourself. There is also a handful of supporting characters that get caught up in the fray, but for the most part, Gotou and Hazama are the characters that take up most of the limelight and relevance in the story. \\n\\n\r\nThe art and animation for Flamenco were a cut above average but nothing overly impressive. While the choreography of some of the action scenes was stiff at times, they still were serviceable enough to get a pass. The color palette of the 1st half is somewhat subdued and tamed, which fit quite well with the realistic tone it was aiming to serve. Later on, that was swapped out for a more schizophrenic display of color and elasticity, which helped in ramping things up a notch, matching the new up-tempo tone that the show took on. \\n\\n\r\nThe sound department, for the most part, was an appropriate mix of rock, funk, latino and other superhero-esque flavoring used to add a nice punch to any given scene. It also doubled up as a means to establish atmosphere while also adding life where the animation couldn't perform on its own. The voice acting was also a cut above average with everyone involved delivering a satisfactory performance. Special mention for Juurouta Kosugi, who did a great job bringing the character of Jouji Kaname to life by providing a particular type of machismo hamminess to the way he talked. \\n\\n\r\nNow, with the general rundown out of the way, the best thing to take away from Flamenco is to understand what it was trying to do, rather than how its efforts panned out. The more you comprehend its intent, the more you could grow to appreciate it. The problems, however, stems deeper than that, and depending on how demanding of a viewer you are, might determine just how much you're able to tolerate from Flamenco to get those ideas tucked away inside it.\\n\\n\r\nWhile the show failed to deconstruct the super sentai genre accurately, it still did so in an entertaining and spectacular fiasco. It was so \"out there\" that I couldn't help but be entertained by its nonsense. It was certainly a unique experience that will stick with me, and despite not holding up as well as I was hoping it would, it was still something I was happy I watched. \\n\\n\r\nSamurai Flamenco is what happens when writers forget the importance of foreshadowing. It made a complete 180 in tone and genre without letting it gradually build up to that point, which in turn led to the notorious viewer backlash that's usually associated with those that hear of it. It was an interesting idea on paper but what we got instead was a failed attempt at a deconstruction that became the joke it was making fun of. Despite that, I suggest giving it a try, as it is an experience within itself that you can't honestly find anywhere else.",
            "date": "2015-08-10T17:23:00+00:00",
            "helpful_count": 132,
            "mal_id": 195763,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=195763"
        },
        {
            "content": "Firstly, it's important to note that Samurai Flamenco is not exactly your typical anime. There are a few genre shifts and plot twists that can seem to come out of nowhere, and for that reason a lot of people dropped this anime after the first shift or the second and gave it a low rating. Even I was apprehensive at first at the sudden genre shifts. However, I stuck the anime out until the end to give it a 'fair try' and I am very glad that I did. The final arc wrapped up the story very nicely and the last episode left me comingaway from the whole thing feeling generally satisfied.\\n\\n\r\nHowever, this review is also a review spurred about by my third watch of the show, so I've had more time to fully grasp the story and come to love it for what it is.\\n\\n\r\nFirst of all, the most important thing and what really tied this anime together for me and made it so worthwhile -\\n\\n\r\nCharacters - 10/10.\\n\r\nHonestly, this show's story did sort of fall flat in a lot of ways. However, the characters were very genuine and fleshed out, and they felt real - some of the best characters I've seen in a recent anime. Masayoshi, Goto and Moe in particular will probably remain in my heart for a long time, as they just felt so genuine and really breathed a lot of life and enjoyment into the show that might not have been there otherwise.\\n\\n\r\nStory - 7/10\\n\r\nIt's not bad, but it's definitely not the best story out there either. There are four arcs to Samurai Flamenco - and some of these arcs were better than others. Particularly I found the 1st and 4th arcs good, but this does not mean that the others were necessarily bad - they just felt out of place or oddly-paced at times. It was easy to forget what I was even 'supposed' to be watching, as the plot kept shifting so suddenly.\\n\\n\r\nArt - 7/10\\n\r\nAgain, not bad, but not the best either. It's definitely not anything extraordinarily beautiful. However, it's well-animated and the art isn't glaringly bad or anything. Just your typical standard anime fare. The art style was particularly refreshing, however, in my personal opinion, as it seemed to look a little more 'realistic' than your usual anime (the proportions weren't as completely skewed as you usually see; it was more akin to FMA: Brotherhood in anatomy.)\\n\\n\r\nSound - 9/10\\n\r\nThe OST is very good and I find myself listening to it every now and then, especially the Flamengers theme and the opening \"Just One Life.\" All in all nice though there were a few songs that stuck out as seeming a little out of place (Usankusai comes to mind, though it wasn't necessarily bad, just... out of place.)\\n\\n\r\nEnjoyment - 9/10\\n\r\nKeep in mind this is a rating upon rewatching the series and seeing it all really come together now that I understood what was happening. Depending on how well you can understand what's going on this may be lower.\\n\\n\r\nOverall - 8/10\\n\\n\r\nThe point with Samurai Flamenco is to go into it with a truly open mind. If you go in expecting a certain type of show, you are very likely to end up disappointed - as the genre shifts a few times. Overall, however, the characters really make the whole thing worthwhile, and this will probably remain one of my favorite anime for a very long time.",
            "date": "2014-08-05T22:02:00+00:00",
            "helpful_count": 89,
            "mal_id": 155461,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3714377.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tsundines",
                "username": "tsundines"
            },
            "url": "https://myanimelist.net/reviews.php?id=155461"
        },
        {
            "content": "There’s something that really grabbed me when I began watching samurai flamenco and I think it was its charming blend of humor and realism. But the charm just petered out when the show decided to do a 100% overhaul in tone and thought process. While the initial realism still can be seen fossilized in some of the satirical ideas and jokes throughout the series, they’re overall very thinly spread. I want to tell you that this is anime Kick-Ass but it’s just not. The show’s opportunity to be a brilliant satire or at least meta-commentary of superheroes is sprinkled throughout, but the end result ofaction and pointless, unfulfilling arcs soars over the simplicity that made the show good to begin with. \\n\\n\r\nThe sound and the aesthetics of the show do their job as good as they can, but should be mentioned for doing an admirable job being there. SF suffers from being one of the shows that repeats background music as mercilessly as its bland villains. Interestingly enough the battle and villain music are repeated the most, making a lot of the fights seem more repetitive and grating given the repetition of the writing too. I will say both openers were appropriate given the rising action of the first half and the continued action of the second half. The openings do the best part of showcasing the character’s goals and dreams, honestly better than the rest of the show did. And while little breaks the mold in terms of art and story, the openings honestly did the best at showcasing the ideas and character design the creators wanted to happen in early, better thought out, and less rushed drafts of the entire project.\\n\\n\r\n\tThe plot for sure rises and builds on itself, but its sequence of events is plotted like an erratic heart rate. Jesus Christ I felt like I should have called a doctor on episodes 8 and 17 because the plotting was going into cardiac arrest. The shifts in what the show wants to do with its plotting are so janky they’re feats in and of themselves. Yes samurai flamenco goes to fight the forces of evil, but Masaoshi stops growing as a person when monsters start falling out of the sky and wreaking havoc. This again shows the unsure and lofty goals of the anime. Masaoshi grows and is a hyperbolic but interesting little soul, but never grows out of that, nor does his team. Goto’s subplot of lost love is by far the most interesting, but even the way the show explores it towards the end isn’t fully realized. The way he copes with his past is interesting and yanks on your heart strings without mercy. It’s something that could have been put throughout the show rather than squeezed in during the third arc of the series. \\n\\n\r\n\tThe characters personality traits are more a rogue’s gallery of quirks that never really go anywhere or influence action or decision-making plot points in the show. I liked that in the beginning Goto immediately has a conflict of interest between his job and helping someone he saved. Mari’s conceited character became more so when she has a chance to hone it as the first of the flamenco girls and she grows in the beginning. But as soon as the show’s tone escalates from a contemporary setting to a larger-than-life superhero setting, the character development flatlines and doesn’t get better. Sure Masaoshi develops better bonds with the characters around him, but that gets him a spare tool from Jun that might work in one situation or moral support from Jouji in another. There’s not a lot of deep or complex staying power in the bonds that he develops with the other characters. The only time it happens is in the climax with Goto, and even then the resolution turns into a ridiculous naked joke. I wanted all of this to be better but it just tried to do so many things and missed all of its marks. \\n",
            "date": "2017-02-20T23:20:00+00:00",
            "helpful_count": 39,
            "mal_id": 241059,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2052781.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jzmcdaisy",
                "username": "jzmcdaisy"
            },
            "url": "https://myanimelist.net/reviews.php?id=241059"
        },
        {
            "content": "The word ‘hero’ often tends to be stereotyped. When we see or hear the word ‘hero’, we tend to think of a guy in a flashy outfit, with extravagant poses, and dynamic entrance. To add on to this faction, they also make it a mission to protect the people and save the world. Why? Simply because it’s the right thing to do. Samurai Flamenco qualifies the title of being a sensation with this trend. What started out as a promising series later turned into a nightmare, one that I had hoped was just a dream. Unfortunately, it wasn’t and the horror plagued this series inways that is unimaginably absurd.\\n\\n\r\nSamurai Flamenco is an original series produced by Manglobe. The TV network Noitamina handles this anime that follows a trend of producing unique series as done in previous years. Samurai Flamenco is unique at first sense with its pattern. The concept of a hero trying to save people despite not having superpowers should be seen as an inspiration. Now, if only that was the trend with its initial set up. The first few episodes offers promise but that doesn’t last…\\n\\n\r\nFor starters, this series is about heroes saving people. Naturally, you’ll expect to see action in the form of battles around the world. It isn’t a new trend in the anime industry since series such as Tiger & Bunny, Zetman, and the recently Gatchaman Crowds adapted similar themes. The major difference initially is that Samurai Flamenco’s characters (superheroes) possesses no supernatural powers. Despite this, they still strive to help their city and ensure the safety of its people. Initially, Samurai Flamenco is a symbol for a classic superhero theme series. The characters are there to do the job and the story moves smoothly with a slice of life like style. Furthermore, the characters can even been seen as relatable with the way they handle tasks whether it’s be helping retrieve an umbrella or stopping a bank robbery. It’s what normal people do to help others and characters such as Masayoshi Hazama does a realistic job at it. Not only that but as his hero adventure goes deeper and deeper, he finds himself in more trouble. Luckily, he also gets unlikely help in the form of his Samurai Flamenco girls made of idols. It defies the classic ‘female crying for damsels’ trope as they let out battle cries rather than fear. Everything seems like a strong promise for this series but the show decides to kill its logic..\\n\\n\r\nThe easiest way to describe this is the way Samurai Flamenco goes as a path that is literally unbelievable. By that, I don’t mean it just as surprise but also sets up a route of destruction to this show’s original premise. It obliterates realism in ways that is unimaginable, defiles logic that is overwhelming, and kills its set up in ways that not even a time machine will be able to take back; as if time was ever on the characters’ side in the first place. It doesn’t just challenge itself anymore with this execution but makes it seem like derailment is a natural word to present a new side of the story. Don’t get me wrong though. Stories with a huge shift such as time skip or travel can redeem and set itself back together again with everything back in normalcy. What Samurai Flamenco screwed up is more than just the story. It becomes the anti-establishment of what it has originally had so much to offer. It gets more and more ridiculous to a point where full on Sentai takes control and characters transform into Power Rangers formula with the whole get-up. (even with the damn robot)\\n\\n\r\nOne positive characteristic about the show might be its characters. Most of them are adults so there’s no childish gags or take place in a generic school life setting. Unfortunately, most of them lacks depth in personalities and some of them come as shallow as it can be. Hazama is the typical young man with a big dream in a big city. There’s nothing new about that since young people often aims for high. It just so happens that he aims to be a superhero until he bites off more than he can chew. On the other hand is Goto, a more cynical man that lacks a sense of justice. If we put the two together, they come off as an incomparable pair. Even with the closeness between the duo, they seem so far apart. If we talk about unity however, then there are the Samurai Flamenco girls made up of Maya, Misawa, and Morita. Naturally, with a show like this, they also takes on a secret identity and trying to save the world before bedtime. Unfortunately, none of them really defines themselves in a unique way whether it’s Maya’s cop fetish or Morita’s yuri attractions towards her co-worker. Other characters also later join the ranks of the so called “Flamengers” that becomes abominable to watch. It’s not just change but rather a synergy of characters mixed in an unrealistic execution.\\n\\n\r\nIf you were also expecting the unexpected, then action shouldn’t be one of those factors. There’s plenty of action whether you view them as a counter factor to what it initially presented. Perhaps it’s different but it is there. At the same time, Sentai vibes is reflexively presented with all the new gags. Villains comes as stereotyped as it can get with their ideologies. In particular, the big bad announces his intention to taking over the world with a grand master plan. Sound familiar? It doesn’t stop there with the cliches. Hazama goes through dramatically changes. Initially, he fails at a lot of his tasks but becomes more experienced later on. This was originally presented as a credible way for his character for development. We want to see Hazama succeed because of what he does. But as the show progresses, Hazama finds it more component to not only help others and literally annihilate the villains. He becomes hypocritical in more ways than one with his newfound powers. Again, the urge to discredit the change becomes unbearable. And the show itself takes on a more mature route with stomach-aching torture scenes and psychological despairs. Although it strives to communicate its message to the viewers, it becomes detrimental with its original premise.\\n\\n\r\nArtwork wise, Mangalobe handles its production and the style matches somewhat with its themes. Characters looks normal on most parts when they aren’t fighting the bad guys. But when they do put up that gear, then it’s where everything becomes surreal and generic. The outfits the characters dress up are flamboyant. But really, they look like a rip-off of power rangers and Kamen Rider. It’s not only has that but it also even come with robots, a gag that has been used for generations. Villains and monsters look like they are on steroids with their self-proclaimed ideologies. Some of them are mindless and no more presented than as action figures. On a more positive note, the female characters’ designs looks flashy and offers some credibility when they aren’t around town fighting. Overall, the artwork seems like a slow progressing tape running on an old machine. \\n\\n\r\nThe soundtrack almost makes sense if it followed its original slice of life style. On most parts, we get to witness action packed tones because the show itself offers action. It delivers almost in consistency if it had its vision going. Most movements of the series has that Sentai rhythm so naturally, the music would have to match along with the style. The OP and ED songs matches on most terms with some touches of surrealism. Surprisingly enough, most of the characters’ voice mannerism does stand out. In particular, Hazama’s character (as Samurai Flamenco) can be seen as silly but credible when he makes his point. Reactions coming from the characters often voices their thought out that will reach to you with their delivery.\\n\\n\r\nSamurai Flamenco isn’t a total piece of trash to be tossed away into the garbage. However, it is a perfect example of a derailment of what it originally had to offer. You’ll be caught off guard more than ways than one.. It serves as a perfection for juxtaposition and the show writes off itself as a deconstruction of realism. Characters who we originally felt attached to become annihilated by their change while villains offer little more than stereotypes. On another note, there’s also hardly anything more unique by its later executions. Prior to what I had envisioned as a super promise becomes a soiled story. It’s unbecoming. But if you must, do give this show a try for some crazy fun.\\n",
            "date": "2014-04-16T20:32:00+00:00",
            "helpful_count": 59,
            "mal_id": 140247,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=140247"
        },
        {
            "content": "Deconstruction is a word that has become as frequent as genre tags since Madoka finished airing. And with it has come miscommunication and ultimately disassociation. Deconstruction is to recreate cliches in meaningful and innovative ways, as opposed to be aware of one's own genre. The latter is usually what people mistake deconstruction for nowadays, and with Samurai Flamenco this couldn't be proven more rightly so. \r\nSamurai Flamenco is a failure on all fronts. It is not a parody but is aware of it's own genre. With it comes this misunderstanding by it's audience. Simply because a work is self-aware does not mean it is adeconstruction. To be a deconstruction Samurai Flamenco would have had to do something new. Something that would innovate the many genres it was all too often burdened with. \\n\\n\r\nBetween it's goal to create a serious and inspiring vigilante-filled universe and it's majorly flawed execution, the most mediocre result is achieved. We have neither an entertaining superhero series nor a psychological exploration of vigilantism. Was Samurai Flamenco a buddy-cop series in the light of Tiger & Bunny? Was it an action-thriller like Darker Than Black? What was it and what is it? It's an unique work, but unique only because of how poorly the tone of the series shifts throughout. There's a difference between uniqueness and quality that Samurai Flamenco can't seem to separate.\\n\\n\r\nSamurai Flamenco is illogical. It creates and sets characters for a few episodes at a time to later remove all traits from them in a jolt of narrative-based absurdity. Full of \"plot-twists\" that are not properly foreshadowed or explained and then quickly disposed of, Samurai Flamenco comes across as extremely disingenuous. The series wants you to be shocked at how many curveballs it can throw you before landing on a classical Hollywood ending every time. Yes, Samurai Flamenco, \"Hero will never give up, never hide, never be defeated\" but sometimes it just doesn't make sense for him not to. When the writing collapses on top of it's flimsy groundwork the most unremarkable deus ex machinas occur ad nauseum. The characters are used merely as avatars to deliver uninspiring tripe about justice and mankind. The level of depth found in Samurai Flamenco's exploration rivals that of children's programming. All characters succumb to this boring dialogue and really just begs the question \"what could have been?\"\\n\\n\r\nDo not watch Samurai Flamenco. Despite it's offbeat premise and charmingly realistic character designs, Samurai Flamenco is an overindulgent children's series bereft of plot-development and bereft of a good idea.",
            "date": "2014-03-31T11:48:00+00:00",
            "helpful_count": 51,
            "mal_id": 138093,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207137.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Detective",
                "username": "Detective"
            },
            "url": "https://myanimelist.net/reviews.php?id=138093"
        },
        {
            "content": "Complete Review Mark II: The Revenge: Special Edition Part 2 Final Version\r\nThere's a certain subset of anime fans who savor bad experiences. Those who pick up what sensible watchers drop just to see how bad things can get. Those who seek out “classics” like Skelter Heaven and M.D. Geist to deepen their knowledge of bad shows. Those who came back to Galilei Donna week after week to see if it could sink any lower. For these people, Samurai Flamenco is a godsend. Samumenco isn't just bad, it's transcendentally bad. It's beyond mere words like “horrible” and “awful.” It's a special, painful kind of bad, likeif someone kidnapped your family and sent you pictures of their torture every week.\\n\\n\r\nSamumenco's badness comes as a result of intensive study into why shows fail. Thousands of man hours were spent dissecting specimens like Mars of Destruction to find out why they are so bad, to extract their badness essence. Along the way, Manglobe's mad scientists discovered that there was a key element missing in even the worst of the worst, something that could propel mankind into new depths of disappointment. See, there have been shows that started off good before betraying the audience. Guilty Crown disguised itself as a shounen action series before melting into a boring mess. Valvrave seemed like a classic mecha before dropping every single cliché known to man. Shows like these all have an interesting premise as the bait, and once you're hooked, they drag you lower and lower until the final episode sets you free. They leave you bitter and jaded, thinking that you'll never fall for that trick again. Then you fire up Blazblue, and the cycle starts again. Samumenco's greatest accomplishment is that they manage to compress this cycle of excitement and despair into one show, filling you with years of disappointment in only a few months. The key ingredient that made this advancement possible? Hope.\\n\\n\r\nWith the average bad show, once it starts going downhill, that's it. It's jumped the shark, passed the point of no return, all you can do is hang on and watch things burn. But Samumenco is not the average bad show. Samumenco offers you a tiny sliver of hope, it promises that things can get better, things can be good again, you just have to believe that the bad times will pass. Then it smashes those hopes into dust and snorts them right in front of you, laughing maniacally the whole time, before giving you another grain of hope, seriously for real this time guys cross-my-heart-hope-to-die. And like a whipped dog you come crawling back time after time, praying that the pain will end, praying that you can have fun again. But you can't. You can never go back. The Kick-Ass style anime you fell in love with is dead, and you're being pummeled with its corpse. Things have gone far beyond what anyone ever thought possible, far beyond anyone's ability to control it. Samumenco deconstructs ideas, then parodies them, then becomes them, then parodies itself. Is it a realistic view of superheroes? Or a critical stab at the superhero genre? Or an homage to a simpler time? Or even a political parody? Is it all just one big joke? The answer is no, to all of those. It doesn't just jump the shark, it turns around to jump the whole aquarium.\\n\\n\r\nIt's impossible to truly describe the feelings you'll experience from Samumenco. The ending brings no solace, only pain and bitterness, mocking you for being dumb enough to watch all 22 episodes. So heed this warning, bad anime pilgrim. It's all fun and games until you Flamenco.",
            "date": "2014-04-14T14:32:00+00:00",
            "helpful_count": 36,
            "mal_id": 139931,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1283401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Solid_Cow",
                "username": "Solid_Cow"
            },
            "url": "https://myanimelist.net/reviews.php?id=139931"
        },
        {
            "content": "Samurai flamenco is a very special show, it's got a low animation budget, and no sales, but it's one of the most entertaining shows I've ever seen. If you're a fan of Sentai shows, or just like great character interaction and twists, this show is for you. However, don't go into this show expecting something profound or deep, it simply isn't there. It's a parody series through and through, so just sit back and enjoy it.\r\nThe good:\r\nThe character interaction in this show is very solid, you'll get entire scenes of characters just talking and you won't feel bored, and the dialogue flows very well.Easily one of my favorite things about it.\\n\\n\r\nWhen you do get action, there's usually great build up to it and I found myself excited quite often as I watched the main character grow.\\n\\n\r\nThe music feels very fitting and uplifting at times.\\n\\n\\n\r\nThe BAD:\\n\\n\r\nThe \"QUALITY ANIMATION\" and I use that sarcasm harshly, prepare for some frames where the characters don't even look like themselves, or some very shoddy animation here and there.\\n\\n\r\nThis show doesn't seem to have much of a budget, so I can give it some slack, but the character models being off frame just feels lazy at times.\\n\\n\r\nThe genre tone shift might be too much for sum.\\n",
            "date": "2014-03-28T11:30:00+00:00",
            "helpful_count": 36,
            "mal_id": 137503,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SoggyBread112",
                "username": "SoggyBread112"
            },
            "url": "https://myanimelist.net/reviews.php?id=137503"
        },
        {
            "content": "Hype can sure be a weird thing,especially in anime.\r\nFor many series it works completely to their advantage broadening their audience outside of Japan and overall (positive) universal acclaim :Cowboy Bebop,Death Note,Fullmetal Alchemist...\r\nThese are the series that are just objectively good ,no matter of your own taste or preferences you just cant deny them of their merits either by the ideas/twists/original story that they brought to the anime genre.\r\nSecondly there are series that receive mixed reception either because they weren't all that groundbreaking or generally good and also because maybe they didn't air at the right time in order to receive the full attention and recognitionthey properly deserved.Many series fall into this category.\\n\\n\r\nAnd lastly the series that for some reason or another get excessively praised just on the basis of the initial premise or first promising episodes and are instantly regarded as groundbreaking/original and all that jazz. Just so that when the series ends people finally notice notice how deeply flawed and filled with cliches/tropes the series has been and for better or for worse the backlash begins.Notable examples:Code Geass,Sword Art Online,Attack on Titan...\\n\\n\\n\\n\r\nSamurai Flamenco fits perfectly in the last category.What started out as a realistic and modern perspective to the idea of heroes ,from the perspective of Japanese people as depicted in their TV and other anime series, ended up as a complete train-wreck.\\n\r\nWhile i know this word is used extensively there is no other way to describe Samurai Flamenco better,you stand there watching it and just cant take your eyes off it,its a glorious and yet twisted sight that needs to seen to believe it can happen.\\n\\n\r\nTo put it into perspective imagine a combination between KickAss ,Power Rangers and Se7en (without the actual killing).All competently different in tone/genre and all waiting their turn to appear making the viewer completely confused as to what he/she is watching.\\n\r\nThat's Samurai Flamenco in a nutshell.\\n\\n\\n\r\nCharacter progression? Story? Proper pacing?  Ha-Ha! ,these are things that Samurai Flamenco considers unnecessary to even bother with so it just makes its own rules one episode just so that it can be completely discarded the other.Plot points appear and disappear on a constant basis.\\n\r\nThe only constant thing throughout the series is the main character ,well to be precise his one note motivation to be the hero,to fight against evil no matter what,even if he puts other people in danger (and he does this on multiple occasions).\\n\\n\r\nI could go on and on about how stupid the characters are ,especially Mari whose sole characteristics are that she wants to kick bad guys in the balls and that she loves police uniforms.Oh and that she kisses her band member ,who is also a female, for no apparent reason except for obvious fan service.That's it ,i honestly wish i was joking.\\n\\n\r\nOr how the villains are laughably bad in both design and (complete lack of) motivation to the point where you are wondering if: \"is all of this on purpose?\" Like is this supposed to be a parody or something ? Even though its played completely straight ,the overall tone of Samurai Flamenco is surprisingly serious ,even when it went full on Power Rangers with very few jokes spread throughout the series.Is this some sort of a parody of a parody?\\n\r\nIts hard to say if that's the case or not,because it all comes down to being extremely incoherent and very inconsistent.\\n\\n\r\nOn paper or at the very least as a small idea by the people behind this series,it might have sounded decent or even good and could have actually been good with the wright attitude, writing and such.\\n\r\nBut in practice like i said earlier its just a complete mess with ideas borrowed from all over the place pilled together into a giant pile of rubbish.It likes to constantly trow curve balls at the viewer and have the nerve to expect a genuine praiseworthy reaction.\\n\\n\r\nFor example without giving to much away ,the final episodes (or i guess arc ) of the anime actually had me laughing out loud ,for all the wrong reasons of course,like \"oh so now all of a sudden its going this way ,after all that has happened just 1 episode ago?\" Yup and it expects the viewer to take it completely seriously as well, and even to go as far as wanting to create sympathy and emotion , but all it achieves is that if fails so hard on its own pretentious ass that it in a very weird way it almost makes up for putting the effort to sit trough this loathsome series.Almost.\\n\\n\\n\\n\r\nDo i recommend it,no absolutely not.\\n\r\nUnless you really love the over the top nature and clumsy action scenes of Power Rangers or have a thing for bad series ,the same way many people like \"so bad its good \" movies like The Room,Troll 2,Birdemic, and enjoy to see how completely incompetent some people are while making their own \"project\" ,then just stay away from it.",
            "date": "2014-07-01T06:05:00+00:00",
            "helpful_count": 30,
            "mal_id": 149771,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102046.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/amateur",
                "username": "amateur"
            },
            "url": "https://myanimelist.net/reviews.php?id=149771"
        },
        {
            "content": "*CONTAINS MAJOR SPOILERS*\r\nSamurai Flamenco is a hard show to pin down and give a really fair rating.\r\nGoing in what my original interpretation was which was reinforced by the events of the first few episodes was that it was a show set out to answer the question of what it means to be a \"superhero\" in a world with no monsters, Evil villains, or aliens. and it does that following the protagonist as he dons the outfit of the original character \"Samurai Flamenco\" created by his grandfather as he sets out to enforce justice in the city which usually ends up with his getting beaten up.\\n\\n\r\nthis first part of the show has a really great feel as we watch the protagonist defend justice even from the smallest of offenders such as loiterers and umbrella thieves as we learn that even the smallest crimes can have dire consequences.\\n\\n\r\nabout a 4th of the way through however the show blatantly crosses the line and introduces real monsters, evil, villains, and aliens as it rapidly devolves into becoming the very show its been a parody of. its at this point of the show that it can become hard to watch as if you liked the beginning then this part is most likely too much and if you wanted this from the beginning then you wouldn't have been watching for this long.\\n\\n\r\nin the last few episodes the show performs another 180 and somehow returns to its roots after the \"will of the universe\" allows the protagonist to return to the \"original world\" while this plot point feels strange and continent it does accomplish the task of bringing the show back to what at least I felt was the best part. here we get some great exposition with some dark twists about the main characters specifically the best friend of the protagonist. On top of this we come to the realization that the greatest evil of all isn't a monster or an alien its an everyday human just like our hero.\\n\\n\r\nin the end this show was bi-polar at best and if it had stuck to its main premise would have been near perfection. but by crossing the line and becomming the show it is meant to parody it eventually shoots itself in the foot despite having a great ending. so the beginning and end would be rated and at least an 8 or 9 in my opinion but having to muddle through the middle drags the score for this show down unfortunately.",
            "date": "2014-06-20T08:14:00+00:00",
            "helpful_count": 28,
            "mal_id": 147689,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3486145.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ArchdukeSpook",
                "username": "ArchdukeSpook"
            },
            "url": "https://myanimelist.net/reviews.php?id=147689"
        },
        {
            "content": "Samurai Flamenco follows the eponymous hero's growth from small time folk hero to world saving, costume clad icon. The show presents itself as part love letter, part parody, and part attempted deconstruction of the Saturday morning superhero cartoon and fumbles past the finish line, but finishes none the less.\r\nThe story's strength shines most brightly when it is paying tribute to shows like the Power Rangers and Kamen Rider with wacky monsters, team dynamics, and world shattering threats. However, this is where I found the story to drag because it was too much like the monster-of-the-week shows of my childhood, lacking any real substance and Ihave since outgrown their appeal.\\n\r\nThe parody-ing of superheroes was mixed in with all elements of the story, though I thought it was most prominent in the first few episodes. I found it provided me a good chuckle, was relatively harmless, and felt natural to the tone of the story... in most scenes.\\n\r\nThe proverbial dark cloud looming over this anime is when it tries its hand at deconstruction. By the most technical definition it is not deconstruction, it goes to dark places with the theme of obsessive fandom, but in my opinion the show does not let these plot threads play to their logical end. Furthermore, the deconstruction seems to be less focused on superhero tropes, and more on fans and obsession.\\n\r\nAs a result of the whiplash tonal shift, the story feels disjointed and flows poorly. The combination of several different set pieces for Samurai Flamenco to fight doesn't help; adding a cluttered and rushed feeling to the disjointedness. I like that the story tried some new things, but I think it failed to execute all of them (5/10).\\n\\n\r\nI found both art and sound to be average and enjoyable. There was some small use of CGI which felt a little out of place, but it was not overly egregious. The fight scenes weren't bad either, the use of speed lines in certain places felt appropriate given the shows inspiration.\\n\r\nVoice acting was good as far as I'm concerned, the stand out voice actress portrayed a pop idol who can emote selfish rage at ear splitting decibels, and I though she did an admirable job of getting me to dislike her character. There are plenty of cheesy \"Stop Right There Criminal Scum\" lines delivered with the appropriate amount of love and irony which I believe was intended for this anime.\\n\r\nAll in all, there was nothing mind blowing about the audio or visual talent, but it looks and sounds competent, and in no way detracts from the overall product (7/10).\\n\\n\r\nOverall I rated Samurai Flamenco a 6 out of 10. I am a fan of superheroes both North American and Japanese and I thought there were moments in the story which really provided me with a comment or critique I had not considered. However, the over ambition and loss of focus in the story really damages its final result. If you are a fan of superheroes I suggest giving it a try, but if you are looking for either a fun, colourful action series or a more thought provoking story or if you don't like superheroes, I suggest you pass on this dance.",
            "date": "2014-10-25T21:17:00+00:00",
            "helpful_count": 17,
            "mal_id": 166189,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3972843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Smiles_McGee",
                "username": "Smiles_McGee"
            },
            "url": "https://myanimelist.net/reviews.php?id=166189"
        },
        {
            "content": "Discussion of this show really has to be spoilery because of the nature of its problems. It starts off very well, kind of like a more low-key version of Kick-Ass, only to throw everything they've built away in a sudden burst of insanity. There is a lot of talk about genre shift in the reviews but it's not always clear what that phrase means. It seems like a fairly innocent expression, and usually it is. But here what it means is that the show works hard to set up its themes of a superpowerless superhero trying to exist in the real world where such afigure doesn't necessarily have the easiest time fitting in. He spends his time yelling at people for minor law violations and hunting down stolen umbrellas and generally living an ambiguous career as a vigilante. Then after seven episodes of painstaking and intriguing character development it throws it all away by having monsters suddenly appear. The appearance of superpowered villains need not have been lethal if it had been handled carefully in a way that preserved the style of the show, but that instantly vanishes as well and instead of the realistic meditation on what use superheroes are in the modern world we have the most extreme example of superheroes battling Power Rangers-level villains and unironically hitting all the cliches it had previously been questioning. This change happens instantaneously and without any setup, and suddenly a promising show has been replaced with exactly the show they had been playfully mocking only an episode ago. While fascinating to watch, this train wreck only gets worse and worse never rising above the tired cliches until the end, when it suddenly tries to switch back. Definitely one to avoid.",
            "date": "2014-08-21T00:37:00+00:00",
            "helpful_count": 16,
            "mal_id": 157365,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1824763.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ArchStanton",
                "username": "ArchStanton"
            },
            "url": "https://myanimelist.net/reviews.php?id=157365"
        },
        {
            "content": "Samurai Flamenco is a Frankenstein's monster of an anime. It can neatly be chopped into 4 arcs (1-7, 8-14, 15-18, 19-22) and these arcs all feel incredibly different in tone, message, point and quality.\r\nStory:\r\nThe major problem with the story is that when watching the show I really hoped they would pull a: “IT WAS AN ILLUSION/DREAM/SHOW ALL ALONG” type of stupid twist, because if they didn’t the show would be utter nonsense. The show is a writing disaster, it feels like the writers threw a lot of ideas and hoped the audience would accept them or that some of the ideas would stick. In theend only what happens in the first and last arc matters to the plot. This leaves episodes 8-18 or half of the series as a pointless waste of time plot wise, I guess the cast develops somewhat, but compared to the first and last arcs it’s not a lot.\\n\r\nOn the positive sides there are some flashes of brilliance in the series, the show is clever at the beginning at how they poke fun at the super hero formula and how it shakes it. It’s mostly a more lighthearted Kick-Ass with a hero who fights with stationary (so it’s not illegal weaponry).\\n\r\nThe story gets a rating of 3. It goes in too many places too quickly and barely develops anything long enough, but the first 7 and the last 3 episodes are actually pretty good.\\n\r\nArt:\\n\r\nNot much too say, the animation is bad if you care about that, although the characters do have their tics and move somewhat interesting. Humans look OK, although nothing stands out. The monsters look silly, but charmingly silly. Backgrounds are bland as hell, Offices, back alleys, the city and dingy places are were most of the action takes place. \\n\r\nArt gets a 4 it works and is functional. Although this is bad for the type of super hero show the show is for most of the runtime.\\n\r\nSound\\n\r\nTo be honest I don’t remember any of the soundtrack of the show. The OPs were OK but the endings were too jarring, since they were cheesy J-POP maybe it was intentional but I’m not sure.\\n\r\nVoice acting wise the cast is pretty good, no real stand outs but no one letting the show down. Characters sound like they’re supposed to and all the engrish is actually pretty funny and appropriate.\\n\r\nSound gets a 5 the voice acting is great and funny, but everything else is a blank for me.\\n\r\nCharacter\\n\r\nThe characters of the show are actually above average. Our main character Hazama Masayoshi is a super hero Otaku and is so dumb he can only work as a model because of his pretty face. He believes in justice, truth and the Japanese way. He decides to become a super hero (Samurai Flamenco) because it was his dream. Following closely is Gotou, a straight man cop who has to rein in Masayoshi and soon enough they develop a close (somewhat homoerotic) friendship. Mari is a member of a band of idols who also becomes a super hero for shits and giggles. The other characters mostly works, Samurai Flamenco’s mentor, the guy who makes weapon. Masayoshi’s manager who is trying to find out if he’s Samurai Flamenco. Moe and Mizuki, who are Mari’s friends and also become super heroes. There’s also Akira, a shady guy who runs a newspaper.\\n\r\nWith this the cast would be perfect, but the writers managed to screw up, there is only 1 good antagonist who appears in the last 4 episodes. Worse yet are the Flamengers, a group of one dimensional characters (they have a gimmick they repeat each time they appear), who steal the spotlight from Gotou and Mari for various episodes and stick around until the end (albeit with a reduced role). When they first appeared, I honestly thought they were parodies of badly written characters, so I guess they weren’t since the plot took them seriously.\\n\r\nSo characters get a 5 most of them work but the Flamengers and antagonists bring the show down immensely.\\n\r\nEnjoyment\\n\r\nSamurai Flamenco is enjoyable for all the wrong reasons. At first it is genuinely enjoyable, then after episode 7 it becomes a train wreck until episode 19. The last episodes are less terrible, but not as engaging as the first ones, although it is the most tight and structured plot the series has and the conclusion is as hilarious and baffling as only this show could offer.\\n\r\nThe enjoyment factor gets a 6, sometimes for the right reasons and sometimes not, you certainly won’t be bored.\\n\r\nOverall\\n\r\nSamurai Flamenco is a well-intentioned anime and has glimpses, but it falls flat on its face when it comes to executing the actual plot. The show tried to do lots of things but in the end didn’t do a damn thing.\\n\r\nSamurai Flamenco gets overall a 4 out of 10.",
            "date": "2014-03-30T21:23:00+00:00",
            "helpful_count": 16,
            "mal_id": 137995,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3210943.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ex275xx",
                "username": "ex275xx"
            },
            "url": "https://myanimelist.net/reviews.php?id=137995"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS (this is also a similar review I used for another site)\r\nI really loved the first 7 episodes. Honestly. Masayoshi's good, honest intentions with his powerlessness and desire for justice made a very enjoyable piece to watch, and it was fairly believable how he gradually became better and honestly began making a difference in his society. I loved his reckless, wacky interaction with the serious-minded and more realistic Goto, and a lot of the other characters also had interesting intentions and characterizations that meshed well to make a very cohesive plot. \r\nIt was at the end of episode 7 that things becamevery weird too fast. Before, the heroes were believable real-life superheroes who were really just humans with some courage and maybe a little-advanced technology (BUT nothing major as it was basic technology that is honestly quite realistic and doable in our world). With the advent of King Torture, the series goes full-out supervillains, with a monster of the week and disregards most of the realism and realistic social issues built up in previous episodes. It becomes zany, unrealistic, and to be quite frank, boring. The episodes stopped engaging me as much as the antics became more extreme and unbelievable and drew less on the real life social drama that I had loved.\\n\\n\r\nThus, this series is a huge disappointment to me. I'm not sure what the directors/writers were thinking with this. The majority of reviewers I've read online agree with this sentiment: the beginning was brilliant and well executed, but the latter was crazy and went too far too fast with too little cohesion to the first 6 episodes. I looked if there were bad reviews or a reason for the sudden shift in plot, but nothing online indicates it, so I'm honestly confused. There was so much potential and greatness, and I feel now that its been ruined by a poor plot decision.\\n\\n\r\nOverall, I think this show is very much worth a watch for the initial 6 and a half episodes. It tells some nice lessons about society and life, and it brings nicely to the forefront the question of what is the right thing to do and when. Those 7 episodes alone are excellent and very enjoyable. But don't bother with anything after the 7th unless you want to know what happens at the end. The shift in tone/genre does not keep the spirit I felt in the original IMO, and that is a tragedy.\\n\\n\r\nAlso for scoring, for the first 7 episodes I'd give it a solid \"7\" score overall, but the remaining episodes, I'd give it a \"1\" or so overall, so the overall score is about a 3/4 for me.",
            "date": "2015-11-15T11:01:00+00:00",
            "helpful_count": 15,
            "mal_id": 203423,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/446015.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dragon",
                "username": "Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=203423"
        },
        {
            "content": "I thought Id seen it all when it came to anime but boy oh boy was I completely wrong.\r\nI started watching Samurai Flamenco because I thought that a cute vigilante hero story would be fun and entertaining. What I got was a whole lot of holy sh*t what the hell is happening?????\r\nThis anime is one wild ride, jumping from plot twist to plot twist at the speed of a Double Flamenco Kick. Its just one surprise after another, and frankly, it just gets more and more ridiculous as it goes on. More than once I found myself in absolute hysterics due to the sheer insanitythat I was watching. There were a few parts I had to go back and watch over because I was laughing so hard I had missed what had happened.\\n\\n\r\nSamurai Flamenco is seriously one of the best animes I've ever seen. its fun, its ridiculous, its absolutely outrageous and its amazingly gleeful. There is a wide variety of characters, and an innumerable number of story arcs to keep you entertained. \\n\\n\r\nI very strongly recommend this anime to anyone and everyone! Enjoy!",
            "date": "2014-04-08T09:40:00+00:00",
            "helpful_count": 14,
            "mal_id": 139195,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3687565.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mspbandj",
                "username": "mspbandj"
            },
            "url": "https://myanimelist.net/reviews.php?id=139195"
        },
        {
            "content": "I'm actually surprised Samurai Flamenco only received approx. rating of 7 here in MAL. But I guess that's it, one has to reach episode 7 to appreciate this anime to the most of what it has to offer.\r\nStory = 8\r\nA lot of great, superb, epic anime are boring from their starting eps: Gurren Lagann's start is boring; Kill la Kill's early episodes are boring; Shingeki no Kyojin at its beginning episodes are also boring; Psycho Pass, AnoHana,the list goes on. Samurai Flamenco is of no exception. It started with a slice-of-life-esque opening, focusing on the main lead Hasama Masayoshi, who is a model, and hasaspirations to become a super sentai or heroes that goes \"henshin!\". His ideals go tested for the first six episodes before moving to the seventh, accompanied by Gotou Hidenori, a cop whom he stumbled and got on into his superhero escapades.\\n\\n\\n\r\nArt = 6\\n\r\nArt is okay.\\n\\n\\n\r\nSound = 6\\n\r\nNot the ideal music score for a henshin hero, and not as catchy as the other tracks of other anime that went down in history. However, they're able to pace up the mood for the show.\\n\\n\\n\r\nCharacter =  7\\n\r\nDynamic and complex characters are what I always admire, those who begin as flailing and sometimes hate-able, and begin to crawl their way through what the plot offered them, and they change with it for the better. Don't get me wrong, I've watched Kamen Riders and Ultraman shows myself, so I'm familiar with the typecast characters that henshin shows produce, but Samurai Flamenco was able to put the blend of their main characters to get you riled up--unless you're the kind of anime-fan who just enjoys mainstream shows like Naruto and One Piece and expect each character to be all-mighty and winning (and being Gary-stus/Mary-sues)  and all that, then you may not be able to wind what dynamic personas our heroes have. The main characters here are what I'd say the right blend of transforming the mindset of henshin-heroes in live action, putting them in the stead of the anime realm.\\n\\n\\n\r\nEnjoyment = 8\\n\r\nYou have to go through past episode 7 here to understand why I rated this as 8.\\n\\n\\n\r\nOverall = 8\\n\r\nSamurai Flamenco doesn't come often. Anime productions are too focused on either moe-ness, shounen, shows that needs shipping, and those of the kind of ecchi-bunch of shows that only gets the score of anime-fans because they showed boobs and too much skin. Samurai Flamenco is for the plot, story, and enjoying a take from henshin-concepts brought into anime. Of course, this show is not for everyone, but for those kind of anime-fans who watches anime for the story [and a tinge of henshin-ness as well as the feel that there is a hero out there], and not for the pantsus and fillers, then this is for you.",
            "date": "2014-05-05T05:55:00+00:00",
            "helpful_count": 13,
            "mal_id": 142387,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729929.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GiancarloLS",
                "username": "GiancarloLS"
            },
            "url": "https://myanimelist.net/reviews.php?id=142387"
        },
        {
            "content": "I would not be too surprised if not a lot of viewers continued Samurai Flamenco, or even give it a chance. I really enjoyed the series, and gave me a bit of a laugh in the process.\r\nStory: 8\r\n Samurai Flamenco really took me by storm after the 1st arc ( 4 arcs= 1-6 7-14 15-18 20-22). The story does take place in 4 different times, but each arc fits right into the next. The story was not as unique, but it is like your typical sentai show. Even though I enjoyed the show overall, the 1st arc of the story could have been much shorter,but it does introduces some really big characters that will become important in the upcoming arcs. But for me the 2nd arc was possibly my favorite. The arc really gave Samurai Flamenco the sentai feel to it, eve though it was corny. If you look at the episodes in each arc I left out episode 19. The reason was because it was a filler episode, and didn't contribute to the final arc as much. Speaking of the final arc, the ending was perfect. The ending filled in some holes, and was the perfect way to end the series with more of a \" personal\" villain to it. Overall Samurai Flamenco had a good story\\n\\n\\n\r\nArt: 7\\n\\n\r\n The art style fits perfectly with the series. Some of the characters are definitely going to be memorable. It did have the flaw of the animation looking awkward a few times. The art style fits well with not only the series, but especially the action scenes. The look of each character was perfect, especially the sentai suits. It did have a flaw though, two characters did look familiar, but the clothes made the two different. Overall the art was great, and the look of the characters will be remembered very well.\\n\\n\\n\r\nSound: 8\\n\\n\r\n The OST was very memorable to me. The BGM was great, and made the action scenes look even better. I particularly didn't like the ED that much, considering that I didn't change at all during the series.\\n\\n\\n\r\nCharacter: 7\\n\\n\r\n The character development was quite good, and every character was believable. The main character Masayoshi is a model, but takes an interest in following the footsteps of his heroes. Masayoshi lacks technique, but makes that up for his spirit which helps him to continue to become a hero. The other main character Gotou is an average cop, who finds Masayoshi and befriends him. Although thinking Masayoshi is crazy, he still befriends him knowing that he will need his help on the way. Overall the characters were great, and I can relate to many of them\\n\\n\\n\r\nEnjoyment: 9 \\n\\n\r\n I really enjoyed Samurai Flamenco because it brought back memories watching Power Rangers as a child. Even though it isn't as re-watchable it makes up for its story, and comedy. If you dropped this series just watch episode 7, and I bet you will want to continue this series. I would definitely would recommend Samurai Flamenco to people who want to watch a piece of their childhood, but with a touch of comedy to it.",
            "date": "2014-05-08T13:36:00+00:00",
            "helpful_count": 11,
            "mal_id": 142707,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3758635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/G-Celtic",
                "username": "G-Celtic"
            },
            "url": "https://myanimelist.net/reviews.php?id=142707"
        },
        {
            "content": "Samurai Flamenco had a nice flow.\r\nFor several episodes it kept me hooked to it's laid back style, interesting characters and enjoyable \"semi slice of life\" genre. This show was trying to take on a realistic view of \"Superheroes\". A lot like Batman, but it wasn't about stopping the world from getting destroyed or anything. It was just stopping everyday crimes such as littering or stealing purses.\r\nSUDDENLY, something so fucked up happened. This was above M. Night Shyamalan level. It was so whack. It's like opening a Snickers bar and getting a retarded Mars bar instead.\r\nI ask why, why do you do something like this? Whatwent through this director's mind when he made episode 7? What the fuck happened in those last 5 minutes of that episode and why did it happen?\\n\\n\r\nI have never seen an anime take this huge of a turn in such a small amount of time. Honestly, this show cannot be reviewed.\\n\\n\r\n\"Fuck you\" - Samurai Flamenco Episode 7, 18:00, Omori Takahiro\\n\\n\r\nit's shit 10/10",
            "date": "2014-04-15T16:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 140071,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/deadeaddead",
                "username": "deadeaddead"
            },
            "url": "https://myanimelist.net/reviews.php?id=140071"
        },
        {
            "content": "I'm gonna go off of what the other people writing reviews have said, and agree that you have to watch the whole show to get the complete enjoyment. There are a lot of weird twists that don't make a whole lot of sense until the very end, but it really is worth it to get to the explanation. Even I had to force myself to watch some of the episodes because they made virtually no sense whatsoever, but I'm extremely glad I did.\r\nStory: 8/10\r\nIt didn't take much to draw me into the story, but honestly, the pacing was terribly shaky in the beginning. It didn'tmake a whole lot of sense to me what was going on half the time, but it was still enjoyable. I actually really enjoyed learning about each character and seeing Mari, Moe, and Mizuki's relationships --as well as Goto and Masayoshi's -- progress throughout the show. A lot of things seemed bizarre and completely random, but everything falls into place as the show goes on, so it's definitely worth it. The ending is what really made the story for me, though.\\n\\n\r\nArt: 8/10\\n\r\nI actually really liked the art style. I was hesitant at first because of it, but it actually grew on me quite a lot. There aren't really any intricate character designs, but I think that helps humble them and make them more relatable.\\n\\n\r\nSound: 7/10\\n\r\nThe voice acting in the show was spot on. It felt like everyone's voices fit them, and the soundtrack was really good as well. Sometimes it felt a little out of place, but it usually worked out pretty well. I also enjoyed the openings, and the endings were really cute.\\n\\n\r\nCharacter: 9/10\\n\r\nI loved the characters in this show. It's true, sometimes I didn't understand the reasons for the things they did, but for the most part, they were amazing. They were extremely relatable, and about 97% of the time likable. Towards the end they start to hit home more, especially the story with Goto, and the development of him and Masayoshi skyrockets. \\n\\n\r\nEnjoyment: 8/10\\n\r\nI found this anime to be undeniably peculiar and difficult to finish, yet I still loved it. It was funny, heartwarming, heartbreaking, and just a fun show in general. It was as random as it was depressing, which I guess gave it a good balance. While it's true I absolutely couldn't stand the Flamengers Arc, the rest of it is amazing.\\n\\n\r\nOverall: 9/10\\n\r\nI'm giving this a 9 because I felt the ending truly sold it. During the period of watching the show, the lowest rating I gave it was a 5, so even I'm surprised I gave it a 9. I even debated dropping it until I saw the other reviews saying watch until the end, which I'm extremely glad I did. The ending was the satisfaction I was looking for after all the bullshit in the episodes prior. All in all, it's a good watch and I recommend it highly as long as you can stick through the rough patches.",
            "date": "2015-07-30T19:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 194760,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4366989.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DoitsuItalia",
                "username": "DoitsuItalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=194760"
        },
        {
            "content": "People say this show went downhill after a little \"Gorilla\" twist that happened in the series. But I say that this is a series that has a lot of unexpected twists that slowly grow on you.\r\nI think after binge watching this Sentai....I mean Anime show, I can safely say that I thoroughly enjoyed the shit out of this show. I'll start by saying that the twists that this anime takes is a matter of taste. You can either hate it or really love it. For me I was on both ends of the argument but still loved the show. \r\nThis show has a way ofcontinuously drawing the viewer in by throwing these twists after the end of each arc. After the initial 6 episodes of the series I felt like the twist was something that this series needed. The story is all over the place and has some of wackiest things that I've ever seen but it somehow manages to keep me intrigued but not confused on where the overall plot or story is trying to get to. Now what I meant when I said that I was on both ends of whether the twists were a love or hate, sometimes the twists take at least an episode or two for you to actually understand what is happening and when the initial twist happens you might not want to watch the next episode and that's where the hate part comes in but after making through the initial twist I feel as though the story will grow on you.  \\n\\n\r\nThis leads me into talking about how well the show unfolded its story and how well this show was paced. There was never a dull moment in this show for me, ever. Almost all of the characters are likable with the exception of one character. The main character Masayoshi was one of the funniest and well developed characters alongside Gotou who had amazing chemistry with Masayoshi. The only character I felt was a little lackluster was Maya because although she played an important role in developing Masayoshi, I felt as though she was the characater that had the least character development and I was a bit disappointed with the the development that she had gotten. Other than that I enjoyed all the characters thoroughly. \\n\\n\r\nOverall the series like I said is a matter of taste after the first couple episodes and whether you choose to drop it or keep watching is up to you, but I highly recommend you continue because the twists are interesting, the characters are well developed, and fun. Combine these things with two highly catchy opening songs and a soundtrack that is both somber, and intense I feel as though this anime was one of the best shows I've seen in a while, enough so that it has now become one of my favorite anime that I will continue to go back and watch.",
            "date": "2014-04-12T22:16:00+00:00",
            "helpful_count": 9,
            "mal_id": 139713,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2482245.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rayouri",
                "username": "Rayouri"
            },
            "url": "https://myanimelist.net/reviews.php?id=139713"
        }
    ],
    [
        {
            "content": "Samurai Flamenco is a strange animal. Despite its conventional appearance, it is full of twists and turns. Overall, Samumenco addresses its core themes very effectively, primarily the theme of heroism. It has likeable and developed characters with distinct personality traits. It also comments on general character/plot tropes, mainly involving heroes and villains, as well as the sentai/tokusatsu genres. (And doesn’t always take itself too seriously while doing so.) \r\nIt’s hard to find a show like this where you truly don’t know what to expect. It may be for this very reason that this show received such widespread negative reception: it's a bit quirky, but itisn't initially apparent whether or not it's trying to be. Many would say that Samumenco isn't quite sure what it wants to be. But now that it’s over, I can say that I’m very glad I stuck with it and that the writers had a clear objective in mind, even though the execution of that vision wasn’t always apparent.\\n\\n\\n\r\nDetails:\\n\\n\r\nStory: 8\\n\r\nIt starts out as a slice-of-life about an eccentric wannabe superhero, and proceeds to go through two major tone/plot shifts. The plot is paced somewhat erratically, and many might find the plot twists jarring. However, both of these shifts contribute to the overall themes of the story. \\n\\n\r\nArt: 6\\n\r\nAt its best, Samumenco’s art and animation is solid. At its worst, the animation was pretty awkward. Unfortunately there were often moments where poor animation detracted from the experience as a whole. While this can be forgiven for background characters, there were some important moments that would have had more impact if not for the distraction of poor animation. I think it would have been interesting if Samumenco had a style of animation that mirrored its eccentricity, but for the most part, things are pretty conventional.\\n\\n\r\nSound: 7\\n\r\nThe OST itself wasn’t especially memorable. The BGM fit the mood well, but there were no standouts. The OPs are enjoyable and fit the tone. (Personally, I really liked them both and they got me excited for each episode.)\\n\\n\r\nCharacters: 8\\n\r\nThe characters range in development, but overall they were all believable and likeable. The eccentric main character, Masayoshi, is an upstanding young man with a strong vision of heroism. What he lacks in ability, he makes up for in spirit, which is pretty darn endearing. Another major standout was Maya Mari. The story starts out from the POV of the other male lead, Gotou, the \"average joe\" who gets fleshed out gradually, if not as thoroughly as some other main characters. Some of the characters had very distinct and often conflicting personalities, which made their interactions very entertaining to watch. (A good example being Masayoshi and Mari’s contrasting senses of justice.)\\n\\n\r\nEnjoyment: 9\\n\r\nAlthough there are a lot of fields that Samumenco could have improved in, I still enjoyed it thoroughly. There are both serious and humorous quoteable moments. I found myself crying and then laughing at some points. The humor varies from a little tongue-in-cheek to downright hammy and ridiculous.  \\n\r\nI really loved the initial concept of the show, and was a little sad to see the plot veer from the slice-of-life superheroes plot of the first segment. For a period of time I wasn’t sure what to feel, as the rapid plot and tone shifts made it seem as though the show was going through a rebellious teenage phase. However, after a certain point everything fell together (albeit somewhat messily), and I would recommend that anyone who is interested should give it a chance and stick with it.\\n",
            "date": "2014-03-28T14:35:00+00:00",
            "helpful_count": 155,
            "mal_id": 137559,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1720733.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SleepyBear",
                "username": "SleepyBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=137559"
        },
        {
            "content": "Some shows jump the shark, while others perform a Samurai Flamenco.\r\nDeconstructions are some of the most demanding and intricate kinds of stories to pull off. It requires the creator to have proper knowledge of the formula they're trying to deviate from by understanding how the tropes and trappings of said formula should be incorporated, in order for it to feel natural. With the right pedigree of writing and proper usage of the commonalities associated with the given formula needed, the creator is expected to build the illusion to the viewer that they're simply following the setup they've already experienced countless of times before. And duringthis stint of limbo, where the viewer is caught up in the illusion, the creator then proceeds to dismantle and \"deconstruct\" the formula that the viewer had grown accustomed to. While it may seem like a relatively simple process, all it takes are a few missteps for it to implode on itself. And more often than not, if the writing for the show is shoddy at best, the end result can be more of a trainwreck than anything noteworthy (School Days can attest to that).\\n\\n\r\nBut perhaps the biggest reason that causes most deconstructions to fall flat on its face can often be something as simple as neglecting the fundamental building blocks of proper storytelling, more specifically, in this case, foreshadowing. Without it, things can come across as manipulated or just \"ass-pulled\" into the narrative. Proper foreshadowing is what allow the transition from following a formula to subverting it to feel natural. And when foreshadowing is non-existent, well..., we get things like episode 7 of Samurai Flamenco.\\n\\n\r\nSamurai Flamenco is a weird anime title, to say the very least. It's a satire, homage, parody, reconstruction, and deconstruction of the super sentai/superhero genre, all wrapped up in one. And if the idea of that sounds insanely convoluted to you, well, that's because it is. While the intentions it had was genuine, the presentation and overall direction it took to see its vision through fell short of the mark. And of course, many will simply single out the tonal/genre shift of the infamous 7th episode as their point of contention, but that was just one of many blunders the title made during its 22-episode run. At the end of the day, Flamenco just bit off more than it could chew. \\n\\n\r\nBrief history lesson: the Super Sentai phenomena have been something that has grown synonymous with Japanese culture with both live-action shows (Ultraman) and animated ones (Hurricane Polymar), for over 30 years. For the most part, it illustrates the fight between good and evil forces, and during its heyday, was a primary tool used to teach kids that \"justice always prevail.\" Usually portraying a team of color-coded heroes, with the help of high-tech gadgets, they fight off evil forces that threaten the stability of mankind. Due to its kid-friendly programming, it didn't take long for it to gain success overseas, which eventually brought it stateside, most prominently with the cobbled together The Power Rangers franchise. The Super Sentai series are basically more kid-friendly versions of superhero shows (4Kids level if you will). As such, the super sentai genre has become a part of many people's childhood. And that's where a title like Samurai Flamenco comes in.\\n\\n\r\nNow with that out of the way, Flamenco can be split into two parts: the first being along the lines of a traditional coming of age story told through the setup of a superhero origin tale and the latter half being a super sentai show along the veins of Power Rangers. Following our protagonist Masayoshi Hazama, we see his journey from a petty enforcer of the law, tackling trivial matters like recycling and obeying traffic signs, to him being caught up in higher stakes that escalate as the story moves forward. Similar to movies like 2010's Kick-Ass and Super, the 1st half of the show is more of a satirical parody of what the traditional superhero story is generally comprised of. While possessing no real superpower or qualities of a superhero, to begin with, most of the charm of the 1st half is seeing an average Joe attempt to live up to the role of the TV-show superhero icon of his youth. The fact that his \"heroics\" was no different than what anyone else can do themselves went a long way in grounding the show in reality. He was simply a vigilantly running around in spandex and as such, we see the real-life repercussions of those actions. In real life, a guy running around a city with his underwear worn over his bodysuit \"defending justice\" would be viewed more like a lunatic and nuisance than an actual \"hero,\" and the show knows that. In a way, it exposes the childish ideals that those super sentai/superhero shows were trying to feed kids growing up by treating situation realistically. It's an externalized reflection of the mentality of us as we grow past such juvenile ideas and \"face the music\" of what life is truly is. And to be honest, if the show had continued to take this approach, that would have been enough to make it a solid satirical parody, but that just wasn't the case.\\n\\n\r\nNow where the controversy comes into play is the show's 2nd half. It transitions from what was, to that point, a down-to-earth parody of a superhero story, to a show that turns into a full-fledged supernatural super sentai deconstruction. This shift from a grounded account to an \"out of this world\" supernatural one was done with no foreshadowing or build-up whatsoever, and as a result, caused a whiplash of adverse reactions among viewers that didn't see it coming. The negative backlash the show received was harsh and rightfully so. It isn't the viewers' fault, but rather the show for not handling the transition better. It didn't have to give away too much, but if it had simply dropped a few foretelling signs and hints throughout the narrative, its tonal shift would have been better received. Instead, it felt more like an out-of-place plot twist that had no business being there. While this was partially explained to those that finished the show, by that time, the damage was already done. This poorly handled decision was perhaps this show's biggest blunder. \\n\\n\r\nNot only was the tonal shift not handled well but the 2nd misstep was that the show crossed the line from being a parody to becoming the subject matter it was making fun of, to begin with. It would be like if someone were promoting equality but then turned around to proclaim themselves as a racist. It's contrived and defeats the purpose of the first action performed. While it still did an excellent job paying tribute to the super sentai genre, it did so with subtext that didn't match up with what was established in the show's 1st half. Tying back to what I was saying about this show taking on more than it can chew, the attempts at a deconstruction clashed with the narrative because of the already firm satirical stance the show had taken early on. \\n\r\nBoth the 1st half and the 2nd could have worked respectfully on their own, but when combined, they didn't have proper cohesion, and as a result, felt forcefully tact onto each other. It's like going from watching Neon Genesis Evangelion to the 2nd arc turning into Pokemon. Just because both titles have proxy battles, doesn't mean they should be bundled together as a single viewing experience. That's essentially what Flamenco did in a nutshell. \\n\\n\r\nThis mismatched exhibition wasn't limited to just the narrative either.\\n\\n\r\nLike the show, the cast also ranged from down-to-earth to wacky. Some characters feel somewhat believable to what you'll find in the real world, like Hidenori Gotou, the show's person of reason and friend to our protagonist. But then, on the other side of the spectrum, the antagonists can range from street-level thugs to batshit crazy megalomaniacs akin to a Saturday morning cartoon. The further the show goes down the spiral of nonsense, the more ludicrous the characters involve becomes. Even our person of reason is shown to have a rather disturbing backstory revealed towards the latter half of the show, almost as if the writers wanted to take him down to coo-coo land with the rest of the nut jobs introduced. \\n\r\nThe lead protagonist, Masayoshi Hazama, was nothing more than a man-child, being an adult with the mindset of an adolescent. As such, most of his actions are done to counteract the rational mindset of Gotou in the show's beginning. This, of course, changes as the title progresses forward, but I'll leave that tidbit for you to discover yourself. There is also a handful of supporting characters that get caught up in the fray, but for the most part, Gotou and Hazama are the characters that take up most of the limelight and relevance in the story. \\n\\n\r\nThe art and animation for Flamenco were a cut above average but nothing overly impressive. While the choreography of some of the action scenes was stiff at times, they still were serviceable enough to get a pass. The color palette of the 1st half is somewhat subdued and tamed, which fit quite well with the realistic tone it was aiming to serve. Later on, that was swapped out for a more schizophrenic display of color and elasticity, which helped in ramping things up a notch, matching the new up-tempo tone that the show took on. \\n\\n\r\nThe sound department, for the most part, was an appropriate mix of rock, funk, latino and other superhero-esque flavoring used to add a nice punch to any given scene. It also doubled up as a means to establish atmosphere while also adding life where the animation couldn't perform on its own. The voice acting was also a cut above average with everyone involved delivering a satisfactory performance. Special mention for Juurouta Kosugi, who did a great job bringing the character of Jouji Kaname to life by providing a particular type of machismo hamminess to the way he talked. \\n\\n\r\nNow, with the general rundown out of the way, the best thing to take away from Flamenco is to understand what it was trying to do, rather than how its efforts panned out. The more you comprehend its intent, the more you could grow to appreciate it. The problems, however, stems deeper than that, and depending on how demanding of a viewer you are, might determine just how much you're able to tolerate from Flamenco to get those ideas tucked away inside it.\\n\\n\r\nWhile the show failed to deconstruct the super sentai genre accurately, it still did so in an entertaining and spectacular fiasco. It was so \"out there\" that I couldn't help but be entertained by its nonsense. It was certainly a unique experience that will stick with me, and despite not holding up as well as I was hoping it would, it was still something I was happy I watched. \\n\\n\r\nSamurai Flamenco is what happens when writers forget the importance of foreshadowing. It made a complete 180 in tone and genre without letting it gradually build up to that point, which in turn led to the notorious viewer backlash that's usually associated with those that hear of it. It was an interesting idea on paper but what we got instead was a failed attempt at a deconstruction that became the joke it was making fun of. Despite that, I suggest giving it a try, as it is an experience within itself that you can't honestly find anywhere else.",
            "date": "2015-08-10T17:23:00+00:00",
            "helpful_count": 132,
            "mal_id": 195763,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3955909.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ZephSilver",
                "username": "ZephSilver"
            },
            "url": "https://myanimelist.net/reviews.php?id=195763"
        },
        {
            "content": "Firstly, it's important to note that Samurai Flamenco is not exactly your typical anime. There are a few genre shifts and plot twists that can seem to come out of nowhere, and for that reason a lot of people dropped this anime after the first shift or the second and gave it a low rating. Even I was apprehensive at first at the sudden genre shifts. However, I stuck the anime out until the end to give it a 'fair try' and I am very glad that I did. The final arc wrapped up the story very nicely and the last episode left me comingaway from the whole thing feeling generally satisfied.\\n\\n\r\nHowever, this review is also a review spurred about by my third watch of the show, so I've had more time to fully grasp the story and come to love it for what it is.\\n\\n\r\nFirst of all, the most important thing and what really tied this anime together for me and made it so worthwhile -\\n\\n\r\nCharacters - 10/10.\\n\r\nHonestly, this show's story did sort of fall flat in a lot of ways. However, the characters were very genuine and fleshed out, and they felt real - some of the best characters I've seen in a recent anime. Masayoshi, Goto and Moe in particular will probably remain in my heart for a long time, as they just felt so genuine and really breathed a lot of life and enjoyment into the show that might not have been there otherwise.\\n\\n\r\nStory - 7/10\\n\r\nIt's not bad, but it's definitely not the best story out there either. There are four arcs to Samurai Flamenco - and some of these arcs were better than others. Particularly I found the 1st and 4th arcs good, but this does not mean that the others were necessarily bad - they just felt out of place or oddly-paced at times. It was easy to forget what I was even 'supposed' to be watching, as the plot kept shifting so suddenly.\\n\\n\r\nArt - 7/10\\n\r\nAgain, not bad, but not the best either. It's definitely not anything extraordinarily beautiful. However, it's well-animated and the art isn't glaringly bad or anything. Just your typical standard anime fare. The art style was particularly refreshing, however, in my personal opinion, as it seemed to look a little more 'realistic' than your usual anime (the proportions weren't as completely skewed as you usually see; it was more akin to FMA: Brotherhood in anatomy.)\\n\\n\r\nSound - 9/10\\n\r\nThe OST is very good and I find myself listening to it every now and then, especially the Flamengers theme and the opening \"Just One Life.\" All in all nice though there were a few songs that stuck out as seeming a little out of place (Usankusai comes to mind, though it wasn't necessarily bad, just... out of place.)\\n\\n\r\nEnjoyment - 9/10\\n\r\nKeep in mind this is a rating upon rewatching the series and seeing it all really come together now that I understood what was happening. Depending on how well you can understand what's going on this may be lower.\\n\\n\r\nOverall - 8/10\\n\\n\r\nThe point with Samurai Flamenco is to go into it with a truly open mind. If you go in expecting a certain type of show, you are very likely to end up disappointed - as the genre shifts a few times. Overall, however, the characters really make the whole thing worthwhile, and this will probably remain one of my favorite anime for a very long time.",
            "date": "2014-08-05T22:02:00+00:00",
            "helpful_count": 89,
            "mal_id": 155461,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3714377.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tsundines",
                "username": "tsundines"
            },
            "url": "https://myanimelist.net/reviews.php?id=155461"
        },
        {
            "content": "There’s something that really grabbed me when I began watching samurai flamenco and I think it was its charming blend of humor and realism. But the charm just petered out when the show decided to do a 100% overhaul in tone and thought process. While the initial realism still can be seen fossilized in some of the satirical ideas and jokes throughout the series, they’re overall very thinly spread. I want to tell you that this is anime Kick-Ass but it’s just not. The show’s opportunity to be a brilliant satire or at least meta-commentary of superheroes is sprinkled throughout, but the end result ofaction and pointless, unfulfilling arcs soars over the simplicity that made the show good to begin with. \\n\\n\r\nThe sound and the aesthetics of the show do their job as good as they can, but should be mentioned for doing an admirable job being there. SF suffers from being one of the shows that repeats background music as mercilessly as its bland villains. Interestingly enough the battle and villain music are repeated the most, making a lot of the fights seem more repetitive and grating given the repetition of the writing too. I will say both openers were appropriate given the rising action of the first half and the continued action of the second half. The openings do the best part of showcasing the character’s goals and dreams, honestly better than the rest of the show did. And while little breaks the mold in terms of art and story, the openings honestly did the best at showcasing the ideas and character design the creators wanted to happen in early, better thought out, and less rushed drafts of the entire project.\\n\\n\r\n\tThe plot for sure rises and builds on itself, but its sequence of events is plotted like an erratic heart rate. Jesus Christ I felt like I should have called a doctor on episodes 8 and 17 because the plotting was going into cardiac arrest. The shifts in what the show wants to do with its plotting are so janky they’re feats in and of themselves. Yes samurai flamenco goes to fight the forces of evil, but Masaoshi stops growing as a person when monsters start falling out of the sky and wreaking havoc. This again shows the unsure and lofty goals of the anime. Masaoshi grows and is a hyperbolic but interesting little soul, but never grows out of that, nor does his team. Goto’s subplot of lost love is by far the most interesting, but even the way the show explores it towards the end isn’t fully realized. The way he copes with his past is interesting and yanks on your heart strings without mercy. It’s something that could have been put throughout the show rather than squeezed in during the third arc of the series. \\n\\n\r\n\tThe characters personality traits are more a rogue’s gallery of quirks that never really go anywhere or influence action or decision-making plot points in the show. I liked that in the beginning Goto immediately has a conflict of interest between his job and helping someone he saved. Mari’s conceited character became more so when she has a chance to hone it as the first of the flamenco girls and she grows in the beginning. But as soon as the show’s tone escalates from a contemporary setting to a larger-than-life superhero setting, the character development flatlines and doesn’t get better. Sure Masaoshi develops better bonds with the characters around him, but that gets him a spare tool from Jun that might work in one situation or moral support from Jouji in another. There’s not a lot of deep or complex staying power in the bonds that he develops with the other characters. The only time it happens is in the climax with Goto, and even then the resolution turns into a ridiculous naked joke. I wanted all of this to be better but it just tried to do so many things and missed all of its marks. \\n",
            "date": "2017-02-20T23:20:00+00:00",
            "helpful_count": 39,
            "mal_id": 241059,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2052781.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/jzmcdaisy",
                "username": "jzmcdaisy"
            },
            "url": "https://myanimelist.net/reviews.php?id=241059"
        },
        {
            "content": "The word ‘hero’ often tends to be stereotyped. When we see or hear the word ‘hero’, we tend to think of a guy in a flashy outfit, with extravagant poses, and dynamic entrance. To add on to this faction, they also make it a mission to protect the people and save the world. Why? Simply because it’s the right thing to do. Samurai Flamenco qualifies the title of being a sensation with this trend. What started out as a promising series later turned into a nightmare, one that I had hoped was just a dream. Unfortunately, it wasn’t and the horror plagued this series inways that is unimaginably absurd.\\n\\n\r\nSamurai Flamenco is an original series produced by Manglobe. The TV network Noitamina handles this anime that follows a trend of producing unique series as done in previous years. Samurai Flamenco is unique at first sense with its pattern. The concept of a hero trying to save people despite not having superpowers should be seen as an inspiration. Now, if only that was the trend with its initial set up. The first few episodes offers promise but that doesn’t last…\\n\\n\r\nFor starters, this series is about heroes saving people. Naturally, you’ll expect to see action in the form of battles around the world. It isn’t a new trend in the anime industry since series such as Tiger & Bunny, Zetman, and the recently Gatchaman Crowds adapted similar themes. The major difference initially is that Samurai Flamenco’s characters (superheroes) possesses no supernatural powers. Despite this, they still strive to help their city and ensure the safety of its people. Initially, Samurai Flamenco is a symbol for a classic superhero theme series. The characters are there to do the job and the story moves smoothly with a slice of life like style. Furthermore, the characters can even been seen as relatable with the way they handle tasks whether it’s be helping retrieve an umbrella or stopping a bank robbery. It’s what normal people do to help others and characters such as Masayoshi Hazama does a realistic job at it. Not only that but as his hero adventure goes deeper and deeper, he finds himself in more trouble. Luckily, he also gets unlikely help in the form of his Samurai Flamenco girls made of idols. It defies the classic ‘female crying for damsels’ trope as they let out battle cries rather than fear. Everything seems like a strong promise for this series but the show decides to kill its logic..\\n\\n\r\nThe easiest way to describe this is the way Samurai Flamenco goes as a path that is literally unbelievable. By that, I don’t mean it just as surprise but also sets up a route of destruction to this show’s original premise. It obliterates realism in ways that is unimaginable, defiles logic that is overwhelming, and kills its set up in ways that not even a time machine will be able to take back; as if time was ever on the characters’ side in the first place. It doesn’t just challenge itself anymore with this execution but makes it seem like derailment is a natural word to present a new side of the story. Don’t get me wrong though. Stories with a huge shift such as time skip or travel can redeem and set itself back together again with everything back in normalcy. What Samurai Flamenco screwed up is more than just the story. It becomes the anti-establishment of what it has originally had so much to offer. It gets more and more ridiculous to a point where full on Sentai takes control and characters transform into Power Rangers formula with the whole get-up. (even with the damn robot)\\n\\n\r\nOne positive characteristic about the show might be its characters. Most of them are adults so there’s no childish gags or take place in a generic school life setting. Unfortunately, most of them lacks depth in personalities and some of them come as shallow as it can be. Hazama is the typical young man with a big dream in a big city. There’s nothing new about that since young people often aims for high. It just so happens that he aims to be a superhero until he bites off more than he can chew. On the other hand is Goto, a more cynical man that lacks a sense of justice. If we put the two together, they come off as an incomparable pair. Even with the closeness between the duo, they seem so far apart. If we talk about unity however, then there are the Samurai Flamenco girls made up of Maya, Misawa, and Morita. Naturally, with a show like this, they also takes on a secret identity and trying to save the world before bedtime. Unfortunately, none of them really defines themselves in a unique way whether it’s Maya’s cop fetish or Morita’s yuri attractions towards her co-worker. Other characters also later join the ranks of the so called “Flamengers” that becomes abominable to watch. It’s not just change but rather a synergy of characters mixed in an unrealistic execution.\\n\\n\r\nIf you were also expecting the unexpected, then action shouldn’t be one of those factors. There’s plenty of action whether you view them as a counter factor to what it initially presented. Perhaps it’s different but it is there. At the same time, Sentai vibes is reflexively presented with all the new gags. Villains comes as stereotyped as it can get with their ideologies. In particular, the big bad announces his intention to taking over the world with a grand master plan. Sound familiar? It doesn’t stop there with the cliches. Hazama goes through dramatically changes. Initially, he fails at a lot of his tasks but becomes more experienced later on. This was originally presented as a credible way for his character for development. We want to see Hazama succeed because of what he does. But as the show progresses, Hazama finds it more component to not only help others and literally annihilate the villains. He becomes hypocritical in more ways than one with his newfound powers. Again, the urge to discredit the change becomes unbearable. And the show itself takes on a more mature route with stomach-aching torture scenes and psychological despairs. Although it strives to communicate its message to the viewers, it becomes detrimental with its original premise.\\n\\n\r\nArtwork wise, Mangalobe handles its production and the style matches somewhat with its themes. Characters looks normal on most parts when they aren’t fighting the bad guys. But when they do put up that gear, then it’s where everything becomes surreal and generic. The outfits the characters dress up are flamboyant. But really, they look like a rip-off of power rangers and Kamen Rider. It’s not only has that but it also even come with robots, a gag that has been used for generations. Villains and monsters look like they are on steroids with their self-proclaimed ideologies. Some of them are mindless and no more presented than as action figures. On a more positive note, the female characters’ designs looks flashy and offers some credibility when they aren’t around town fighting. Overall, the artwork seems like a slow progressing tape running on an old machine. \\n\\n\r\nThe soundtrack almost makes sense if it followed its original slice of life style. On most parts, we get to witness action packed tones because the show itself offers action. It delivers almost in consistency if it had its vision going. Most movements of the series has that Sentai rhythm so naturally, the music would have to match along with the style. The OP and ED songs matches on most terms with some touches of surrealism. Surprisingly enough, most of the characters’ voice mannerism does stand out. In particular, Hazama’s character (as Samurai Flamenco) can be seen as silly but credible when he makes his point. Reactions coming from the characters often voices their thought out that will reach to you with their delivery.\\n\\n\r\nSamurai Flamenco isn’t a total piece of trash to be tossed away into the garbage. However, it is a perfect example of a derailment of what it originally had to offer. You’ll be caught off guard more than ways than one.. It serves as a perfection for juxtaposition and the show writes off itself as a deconstruction of realism. Characters who we originally felt attached to become annihilated by their change while villains offer little more than stereotypes. On another note, there’s also hardly anything more unique by its later executions. Prior to what I had envisioned as a super promise becomes a soiled story. It’s unbecoming. But if you must, do give this show a try for some crazy fun.\\n",
            "date": "2014-04-16T20:32:00+00:00",
            "helpful_count": 59,
            "mal_id": 140247,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=140247"
        },
        {
            "content": "Deconstruction is a word that has become as frequent as genre tags since Madoka finished airing. And with it has come miscommunication and ultimately disassociation. Deconstruction is to recreate cliches in meaningful and innovative ways, as opposed to be aware of one's own genre. The latter is usually what people mistake deconstruction for nowadays, and with Samurai Flamenco this couldn't be proven more rightly so. \r\nSamurai Flamenco is a failure on all fronts. It is not a parody but is aware of it's own genre. With it comes this misunderstanding by it's audience. Simply because a work is self-aware does not mean it is adeconstruction. To be a deconstruction Samurai Flamenco would have had to do something new. Something that would innovate the many genres it was all too often burdened with. \\n\\n\r\nBetween it's goal to create a serious and inspiring vigilante-filled universe and it's majorly flawed execution, the most mediocre result is achieved. We have neither an entertaining superhero series nor a psychological exploration of vigilantism. Was Samurai Flamenco a buddy-cop series in the light of Tiger & Bunny? Was it an action-thriller like Darker Than Black? What was it and what is it? It's an unique work, but unique only because of how poorly the tone of the series shifts throughout. There's a difference between uniqueness and quality that Samurai Flamenco can't seem to separate.\\n\\n\r\nSamurai Flamenco is illogical. It creates and sets characters for a few episodes at a time to later remove all traits from them in a jolt of narrative-based absurdity. Full of \"plot-twists\" that are not properly foreshadowed or explained and then quickly disposed of, Samurai Flamenco comes across as extremely disingenuous. The series wants you to be shocked at how many curveballs it can throw you before landing on a classical Hollywood ending every time. Yes, Samurai Flamenco, \"Hero will never give up, never hide, never be defeated\" but sometimes it just doesn't make sense for him not to. When the writing collapses on top of it's flimsy groundwork the most unremarkable deus ex machinas occur ad nauseum. The characters are used merely as avatars to deliver uninspiring tripe about justice and mankind. The level of depth found in Samurai Flamenco's exploration rivals that of children's programming. All characters succumb to this boring dialogue and really just begs the question \"what could have been?\"\\n\\n\r\nDo not watch Samurai Flamenco. Despite it's offbeat premise and charmingly realistic character designs, Samurai Flamenco is an overindulgent children's series bereft of plot-development and bereft of a good idea.",
            "date": "2014-03-31T11:48:00+00:00",
            "helpful_count": 51,
            "mal_id": 138093,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/207137.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Detective",
                "username": "Detective"
            },
            "url": "https://myanimelist.net/reviews.php?id=138093"
        },
        {
            "content": "Complete Review Mark II: The Revenge: Special Edition Part 2 Final Version\r\nThere's a certain subset of anime fans who savor bad experiences. Those who pick up what sensible watchers drop just to see how bad things can get. Those who seek out “classics” like Skelter Heaven and M.D. Geist to deepen their knowledge of bad shows. Those who came back to Galilei Donna week after week to see if it could sink any lower. For these people, Samurai Flamenco is a godsend. Samumenco isn't just bad, it's transcendentally bad. It's beyond mere words like “horrible” and “awful.” It's a special, painful kind of bad, likeif someone kidnapped your family and sent you pictures of their torture every week.\\n\\n\r\nSamumenco's badness comes as a result of intensive study into why shows fail. Thousands of man hours were spent dissecting specimens like Mars of Destruction to find out why they are so bad, to extract their badness essence. Along the way, Manglobe's mad scientists discovered that there was a key element missing in even the worst of the worst, something that could propel mankind into new depths of disappointment. See, there have been shows that started off good before betraying the audience. Guilty Crown disguised itself as a shounen action series before melting into a boring mess. Valvrave seemed like a classic mecha before dropping every single cliché known to man. Shows like these all have an interesting premise as the bait, and once you're hooked, they drag you lower and lower until the final episode sets you free. They leave you bitter and jaded, thinking that you'll never fall for that trick again. Then you fire up Blazblue, and the cycle starts again. Samumenco's greatest accomplishment is that they manage to compress this cycle of excitement and despair into one show, filling you with years of disappointment in only a few months. The key ingredient that made this advancement possible? Hope.\\n\\n\r\nWith the average bad show, once it starts going downhill, that's it. It's jumped the shark, passed the point of no return, all you can do is hang on and watch things burn. But Samumenco is not the average bad show. Samumenco offers you a tiny sliver of hope, it promises that things can get better, things can be good again, you just have to believe that the bad times will pass. Then it smashes those hopes into dust and snorts them right in front of you, laughing maniacally the whole time, before giving you another grain of hope, seriously for real this time guys cross-my-heart-hope-to-die. And like a whipped dog you come crawling back time after time, praying that the pain will end, praying that you can have fun again. But you can't. You can never go back. The Kick-Ass style anime you fell in love with is dead, and you're being pummeled with its corpse. Things have gone far beyond what anyone ever thought possible, far beyond anyone's ability to control it. Samumenco deconstructs ideas, then parodies them, then becomes them, then parodies itself. Is it a realistic view of superheroes? Or a critical stab at the superhero genre? Or an homage to a simpler time? Or even a political parody? Is it all just one big joke? The answer is no, to all of those. It doesn't just jump the shark, it turns around to jump the whole aquarium.\\n\\n\r\nIt's impossible to truly describe the feelings you'll experience from Samumenco. The ending brings no solace, only pain and bitterness, mocking you for being dumb enough to watch all 22 episodes. So heed this warning, bad anime pilgrim. It's all fun and games until you Flamenco.",
            "date": "2014-04-14T14:32:00+00:00",
            "helpful_count": 36,
            "mal_id": 139931,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1283401.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Solid_Cow",
                "username": "Solid_Cow"
            },
            "url": "https://myanimelist.net/reviews.php?id=139931"
        },
        {
            "content": "Samurai flamenco is a very special show, it's got a low animation budget, and no sales, but it's one of the most entertaining shows I've ever seen. If you're a fan of Sentai shows, or just like great character interaction and twists, this show is for you. However, don't go into this show expecting something profound or deep, it simply isn't there. It's a parody series through and through, so just sit back and enjoy it.\r\nThe good:\r\nThe character interaction in this show is very solid, you'll get entire scenes of characters just talking and you won't feel bored, and the dialogue flows very well.Easily one of my favorite things about it.\\n\\n\r\nWhen you do get action, there's usually great build up to it and I found myself excited quite often as I watched the main character grow.\\n\\n\r\nThe music feels very fitting and uplifting at times.\\n\\n\\n\r\nThe BAD:\\n\\n\r\nThe \"QUALITY ANIMATION\" and I use that sarcasm harshly, prepare for some frames where the characters don't even look like themselves, or some very shoddy animation here and there.\\n\\n\r\nThis show doesn't seem to have much of a budget, so I can give it some slack, but the character models being off frame just feels lazy at times.\\n\\n\r\nThe genre tone shift might be too much for sum.\\n",
            "date": "2014-03-28T11:30:00+00:00",
            "helpful_count": 36,
            "mal_id": 137503,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SoggyBread112",
                "username": "SoggyBread112"
            },
            "url": "https://myanimelist.net/reviews.php?id=137503"
        },
        {
            "content": "Hype can sure be a weird thing,especially in anime.\r\nFor many series it works completely to their advantage broadening their audience outside of Japan and overall (positive) universal acclaim :Cowboy Bebop,Death Note,Fullmetal Alchemist...\r\nThese are the series that are just objectively good ,no matter of your own taste or preferences you just cant deny them of their merits either by the ideas/twists/original story that they brought to the anime genre.\r\nSecondly there are series that receive mixed reception either because they weren't all that groundbreaking or generally good and also because maybe they didn't air at the right time in order to receive the full attention and recognitionthey properly deserved.Many series fall into this category.\\n\\n\r\nAnd lastly the series that for some reason or another get excessively praised just on the basis of the initial premise or first promising episodes and are instantly regarded as groundbreaking/original and all that jazz. Just so that when the series ends people finally notice notice how deeply flawed and filled with cliches/tropes the series has been and for better or for worse the backlash begins.Notable examples:Code Geass,Sword Art Online,Attack on Titan...\\n\\n\\n\\n\r\nSamurai Flamenco fits perfectly in the last category.What started out as a realistic and modern perspective to the idea of heroes ,from the perspective of Japanese people as depicted in their TV and other anime series, ended up as a complete train-wreck.\\n\r\nWhile i know this word is used extensively there is no other way to describe Samurai Flamenco better,you stand there watching it and just cant take your eyes off it,its a glorious and yet twisted sight that needs to seen to believe it can happen.\\n\\n\r\nTo put it into perspective imagine a combination between KickAss ,Power Rangers and Se7en (without the actual killing).All competently different in tone/genre and all waiting their turn to appear making the viewer completely confused as to what he/she is watching.\\n\r\nThat's Samurai Flamenco in a nutshell.\\n\\n\\n\r\nCharacter progression? Story? Proper pacing?  Ha-Ha! ,these are things that Samurai Flamenco considers unnecessary to even bother with so it just makes its own rules one episode just so that it can be completely discarded the other.Plot points appear and disappear on a constant basis.\\n\r\nThe only constant thing throughout the series is the main character ,well to be precise his one note motivation to be the hero,to fight against evil no matter what,even if he puts other people in danger (and he does this on multiple occasions).\\n\\n\r\nI could go on and on about how stupid the characters are ,especially Mari whose sole characteristics are that she wants to kick bad guys in the balls and that she loves police uniforms.Oh and that she kisses her band member ,who is also a female, for no apparent reason except for obvious fan service.That's it ,i honestly wish i was joking.\\n\\n\r\nOr how the villains are laughably bad in both design and (complete lack of) motivation to the point where you are wondering if: \"is all of this on purpose?\" Like is this supposed to be a parody or something ? Even though its played completely straight ,the overall tone of Samurai Flamenco is surprisingly serious ,even when it went full on Power Rangers with very few jokes spread throughout the series.Is this some sort of a parody of a parody?\\n\r\nIts hard to say if that's the case or not,because it all comes down to being extremely incoherent and very inconsistent.\\n\\n\r\nOn paper or at the very least as a small idea by the people behind this series,it might have sounded decent or even good and could have actually been good with the wright attitude, writing and such.\\n\r\nBut in practice like i said earlier its just a complete mess with ideas borrowed from all over the place pilled together into a giant pile of rubbish.It likes to constantly trow curve balls at the viewer and have the nerve to expect a genuine praiseworthy reaction.\\n\\n\r\nFor example without giving to much away ,the final episodes (or i guess arc ) of the anime actually had me laughing out loud ,for all the wrong reasons of course,like \"oh so now all of a sudden its going this way ,after all that has happened just 1 episode ago?\" Yup and it expects the viewer to take it completely seriously as well, and even to go as far as wanting to create sympathy and emotion , but all it achieves is that if fails so hard on its own pretentious ass that it in a very weird way it almost makes up for putting the effort to sit trough this loathsome series.Almost.\\n\\n\\n\\n\r\nDo i recommend it,no absolutely not.\\n\r\nUnless you really love the over the top nature and clumsy action scenes of Power Rangers or have a thing for bad series ,the same way many people like \"so bad its good \" movies like The Room,Troll 2,Birdemic, and enjoy to see how completely incompetent some people are while making their own \"project\" ,then just stay away from it.",
            "date": "2014-07-01T06:05:00+00:00",
            "helpful_count": 30,
            "mal_id": 149771,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/102046.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/amateur",
                "username": "amateur"
            },
            "url": "https://myanimelist.net/reviews.php?id=149771"
        },
        {
            "content": "*CONTAINS MAJOR SPOILERS*\r\nSamurai Flamenco is a hard show to pin down and give a really fair rating.\r\nGoing in what my original interpretation was which was reinforced by the events of the first few episodes was that it was a show set out to answer the question of what it means to be a \"superhero\" in a world with no monsters, Evil villains, or aliens. and it does that following the protagonist as he dons the outfit of the original character \"Samurai Flamenco\" created by his grandfather as he sets out to enforce justice in the city which usually ends up with his getting beaten up.\\n\\n\r\nthis first part of the show has a really great feel as we watch the protagonist defend justice even from the smallest of offenders such as loiterers and umbrella thieves as we learn that even the smallest crimes can have dire consequences.\\n\\n\r\nabout a 4th of the way through however the show blatantly crosses the line and introduces real monsters, evil, villains, and aliens as it rapidly devolves into becoming the very show its been a parody of. its at this point of the show that it can become hard to watch as if you liked the beginning then this part is most likely too much and if you wanted this from the beginning then you wouldn't have been watching for this long.\\n\\n\r\nin the last few episodes the show performs another 180 and somehow returns to its roots after the \"will of the universe\" allows the protagonist to return to the \"original world\" while this plot point feels strange and continent it does accomplish the task of bringing the show back to what at least I felt was the best part. here we get some great exposition with some dark twists about the main characters specifically the best friend of the protagonist. On top of this we come to the realization that the greatest evil of all isn't a monster or an alien its an everyday human just like our hero.\\n\\n\r\nin the end this show was bi-polar at best and if it had stuck to its main premise would have been near perfection. but by crossing the line and becomming the show it is meant to parody it eventually shoots itself in the foot despite having a great ending. so the beginning and end would be rated and at least an 8 or 9 in my opinion but having to muddle through the middle drags the score for this show down unfortunately.",
            "date": "2014-06-20T08:14:00+00:00",
            "helpful_count": 28,
            "mal_id": 147689,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3486145.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ArchdukeSpook",
                "username": "ArchdukeSpook"
            },
            "url": "https://myanimelist.net/reviews.php?id=147689"
        },
        {
            "content": "Samurai Flamenco follows the eponymous hero's growth from small time folk hero to world saving, costume clad icon. The show presents itself as part love letter, part parody, and part attempted deconstruction of the Saturday morning superhero cartoon and fumbles past the finish line, but finishes none the less.\r\nThe story's strength shines most brightly when it is paying tribute to shows like the Power Rangers and Kamen Rider with wacky monsters, team dynamics, and world shattering threats. However, this is where I found the story to drag because it was too much like the monster-of-the-week shows of my childhood, lacking any real substance and Ihave since outgrown their appeal.\\n\r\nThe parody-ing of superheroes was mixed in with all elements of the story, though I thought it was most prominent in the first few episodes. I found it provided me a good chuckle, was relatively harmless, and felt natural to the tone of the story... in most scenes.\\n\r\nThe proverbial dark cloud looming over this anime is when it tries its hand at deconstruction. By the most technical definition it is not deconstruction, it goes to dark places with the theme of obsessive fandom, but in my opinion the show does not let these plot threads play to their logical end. Furthermore, the deconstruction seems to be less focused on superhero tropes, and more on fans and obsession.\\n\r\nAs a result of the whiplash tonal shift, the story feels disjointed and flows poorly. The combination of several different set pieces for Samurai Flamenco to fight doesn't help; adding a cluttered and rushed feeling to the disjointedness. I like that the story tried some new things, but I think it failed to execute all of them (5/10).\\n\\n\r\nI found both art and sound to be average and enjoyable. There was some small use of CGI which felt a little out of place, but it was not overly egregious. The fight scenes weren't bad either, the use of speed lines in certain places felt appropriate given the shows inspiration.\\n\r\nVoice acting was good as far as I'm concerned, the stand out voice actress portrayed a pop idol who can emote selfish rage at ear splitting decibels, and I though she did an admirable job of getting me to dislike her character. There are plenty of cheesy \"Stop Right There Criminal Scum\" lines delivered with the appropriate amount of love and irony which I believe was intended for this anime.\\n\r\nAll in all, there was nothing mind blowing about the audio or visual talent, but it looks and sounds competent, and in no way detracts from the overall product (7/10).\\n\\n\r\nOverall I rated Samurai Flamenco a 6 out of 10. I am a fan of superheroes both North American and Japanese and I thought there were moments in the story which really provided me with a comment or critique I had not considered. However, the over ambition and loss of focus in the story really damages its final result. If you are a fan of superheroes I suggest giving it a try, but if you are looking for either a fun, colourful action series or a more thought provoking story or if you don't like superheroes, I suggest you pass on this dance.",
            "date": "2014-10-25T21:17:00+00:00",
            "helpful_count": 17,
            "mal_id": 166189,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3972843.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Smiles_McGee",
                "username": "Smiles_McGee"
            },
            "url": "https://myanimelist.net/reviews.php?id=166189"
        },
        {
            "content": "Discussion of this show really has to be spoilery because of the nature of its problems. It starts off very well, kind of like a more low-key version of Kick-Ass, only to throw everything they've built away in a sudden burst of insanity. There is a lot of talk about genre shift in the reviews but it's not always clear what that phrase means. It seems like a fairly innocent expression, and usually it is. But here what it means is that the show works hard to set up its themes of a superpowerless superhero trying to exist in the real world where such afigure doesn't necessarily have the easiest time fitting in. He spends his time yelling at people for minor law violations and hunting down stolen umbrellas and generally living an ambiguous career as a vigilante. Then after seven episodes of painstaking and intriguing character development it throws it all away by having monsters suddenly appear. The appearance of superpowered villains need not have been lethal if it had been handled carefully in a way that preserved the style of the show, but that instantly vanishes as well and instead of the realistic meditation on what use superheroes are in the modern world we have the most extreme example of superheroes battling Power Rangers-level villains and unironically hitting all the cliches it had previously been questioning. This change happens instantaneously and without any setup, and suddenly a promising show has been replaced with exactly the show they had been playfully mocking only an episode ago. While fascinating to watch, this train wreck only gets worse and worse never rising above the tired cliches until the end, when it suddenly tries to switch back. Definitely one to avoid.",
            "date": "2014-08-21T00:37:00+00:00",
            "helpful_count": 16,
            "mal_id": 157365,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1824763.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/ArchStanton",
                "username": "ArchStanton"
            },
            "url": "https://myanimelist.net/reviews.php?id=157365"
        },
        {
            "content": "Samurai Flamenco is a Frankenstein's monster of an anime. It can neatly be chopped into 4 arcs (1-7, 8-14, 15-18, 19-22) and these arcs all feel incredibly different in tone, message, point and quality.\r\nStory:\r\nThe major problem with the story is that when watching the show I really hoped they would pull a: “IT WAS AN ILLUSION/DREAM/SHOW ALL ALONG” type of stupid twist, because if they didn’t the show would be utter nonsense. The show is a writing disaster, it feels like the writers threw a lot of ideas and hoped the audience would accept them or that some of the ideas would stick. In theend only what happens in the first and last arc matters to the plot. This leaves episodes 8-18 or half of the series as a pointless waste of time plot wise, I guess the cast develops somewhat, but compared to the first and last arcs it’s not a lot.\\n\r\nOn the positive sides there are some flashes of brilliance in the series, the show is clever at the beginning at how they poke fun at the super hero formula and how it shakes it. It’s mostly a more lighthearted Kick-Ass with a hero who fights with stationary (so it’s not illegal weaponry).\\n\r\nThe story gets a rating of 3. It goes in too many places too quickly and barely develops anything long enough, but the first 7 and the last 3 episodes are actually pretty good.\\n\r\nArt:\\n\r\nNot much too say, the animation is bad if you care about that, although the characters do have their tics and move somewhat interesting. Humans look OK, although nothing stands out. The monsters look silly, but charmingly silly. Backgrounds are bland as hell, Offices, back alleys, the city and dingy places are were most of the action takes place. \\n\r\nArt gets a 4 it works and is functional. Although this is bad for the type of super hero show the show is for most of the runtime.\\n\r\nSound\\n\r\nTo be honest I don’t remember any of the soundtrack of the show. The OPs were OK but the endings were too jarring, since they were cheesy J-POP maybe it was intentional but I’m not sure.\\n\r\nVoice acting wise the cast is pretty good, no real stand outs but no one letting the show down. Characters sound like they’re supposed to and all the engrish is actually pretty funny and appropriate.\\n\r\nSound gets a 5 the voice acting is great and funny, but everything else is a blank for me.\\n\r\nCharacter\\n\r\nThe characters of the show are actually above average. Our main character Hazama Masayoshi is a super hero Otaku and is so dumb he can only work as a model because of his pretty face. He believes in justice, truth and the Japanese way. He decides to become a super hero (Samurai Flamenco) because it was his dream. Following closely is Gotou, a straight man cop who has to rein in Masayoshi and soon enough they develop a close (somewhat homoerotic) friendship. Mari is a member of a band of idols who also becomes a super hero for shits and giggles. The other characters mostly works, Samurai Flamenco’s mentor, the guy who makes weapon. Masayoshi’s manager who is trying to find out if he’s Samurai Flamenco. Moe and Mizuki, who are Mari’s friends and also become super heroes. There’s also Akira, a shady guy who runs a newspaper.\\n\r\nWith this the cast would be perfect, but the writers managed to screw up, there is only 1 good antagonist who appears in the last 4 episodes. Worse yet are the Flamengers, a group of one dimensional characters (they have a gimmick they repeat each time they appear), who steal the spotlight from Gotou and Mari for various episodes and stick around until the end (albeit with a reduced role). When they first appeared, I honestly thought they were parodies of badly written characters, so I guess they weren’t since the plot took them seriously.\\n\r\nSo characters get a 5 most of them work but the Flamengers and antagonists bring the show down immensely.\\n\r\nEnjoyment\\n\r\nSamurai Flamenco is enjoyable for all the wrong reasons. At first it is genuinely enjoyable, then after episode 7 it becomes a train wreck until episode 19. The last episodes are less terrible, but not as engaging as the first ones, although it is the most tight and structured plot the series has and the conclusion is as hilarious and baffling as only this show could offer.\\n\r\nThe enjoyment factor gets a 6, sometimes for the right reasons and sometimes not, you certainly won’t be bored.\\n\r\nOverall\\n\r\nSamurai Flamenco is a well-intentioned anime and has glimpses, but it falls flat on its face when it comes to executing the actual plot. The show tried to do lots of things but in the end didn’t do a damn thing.\\n\r\nSamurai Flamenco gets overall a 4 out of 10.",
            "date": "2014-03-30T21:23:00+00:00",
            "helpful_count": 16,
            "mal_id": 137995,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3210943.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ex275xx",
                "username": "ex275xx"
            },
            "url": "https://myanimelist.net/reviews.php?id=137995"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS (this is also a similar review I used for another site)\r\nI really loved the first 7 episodes. Honestly. Masayoshi's good, honest intentions with his powerlessness and desire for justice made a very enjoyable piece to watch, and it was fairly believable how he gradually became better and honestly began making a difference in his society. I loved his reckless, wacky interaction with the serious-minded and more realistic Goto, and a lot of the other characters also had interesting intentions and characterizations that meshed well to make a very cohesive plot. \r\nIt was at the end of episode 7 that things becamevery weird too fast. Before, the heroes were believable real-life superheroes who were really just humans with some courage and maybe a little-advanced technology (BUT nothing major as it was basic technology that is honestly quite realistic and doable in our world). With the advent of King Torture, the series goes full-out supervillains, with a monster of the week and disregards most of the realism and realistic social issues built up in previous episodes. It becomes zany, unrealistic, and to be quite frank, boring. The episodes stopped engaging me as much as the antics became more extreme and unbelievable and drew less on the real life social drama that I had loved.\\n\\n\r\nThus, this series is a huge disappointment to me. I'm not sure what the directors/writers were thinking with this. The majority of reviewers I've read online agree with this sentiment: the beginning was brilliant and well executed, but the latter was crazy and went too far too fast with too little cohesion to the first 6 episodes. I looked if there were bad reviews or a reason for the sudden shift in plot, but nothing online indicates it, so I'm honestly confused. There was so much potential and greatness, and I feel now that its been ruined by a poor plot decision.\\n\\n\r\nOverall, I think this show is very much worth a watch for the initial 6 and a half episodes. It tells some nice lessons about society and life, and it brings nicely to the forefront the question of what is the right thing to do and when. Those 7 episodes alone are excellent and very enjoyable. But don't bother with anything after the 7th unless you want to know what happens at the end. The shift in tone/genre does not keep the spirit I felt in the original IMO, and that is a tragedy.\\n\\n\r\nAlso for scoring, for the first 7 episodes I'd give it a solid \"7\" score overall, but the remaining episodes, I'd give it a \"1\" or so overall, so the overall score is about a 3/4 for me.",
            "date": "2015-11-15T11:01:00+00:00",
            "helpful_count": 15,
            "mal_id": 203423,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/446015.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dragon",
                "username": "Dragon"
            },
            "url": "https://myanimelist.net/reviews.php?id=203423"
        },
        {
            "content": "I thought Id seen it all when it came to anime but boy oh boy was I completely wrong.\r\nI started watching Samurai Flamenco because I thought that a cute vigilante hero story would be fun and entertaining. What I got was a whole lot of holy sh*t what the hell is happening?????\r\nThis anime is one wild ride, jumping from plot twist to plot twist at the speed of a Double Flamenco Kick. Its just one surprise after another, and frankly, it just gets more and more ridiculous as it goes on. More than once I found myself in absolute hysterics due to the sheer insanitythat I was watching. There were a few parts I had to go back and watch over because I was laughing so hard I had missed what had happened.\\n\\n\r\nSamurai Flamenco is seriously one of the best animes I've ever seen. its fun, its ridiculous, its absolutely outrageous and its amazingly gleeful. There is a wide variety of characters, and an innumerable number of story arcs to keep you entertained. \\n\\n\r\nI very strongly recommend this anime to anyone and everyone! Enjoy!",
            "date": "2014-04-08T09:40:00+00:00",
            "helpful_count": 14,
            "mal_id": 139195,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3687565.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/mspbandj",
                "username": "mspbandj"
            },
            "url": "https://myanimelist.net/reviews.php?id=139195"
        },
        {
            "content": "I'm actually surprised Samurai Flamenco only received approx. rating of 7 here in MAL. But I guess that's it, one has to reach episode 7 to appreciate this anime to the most of what it has to offer.\r\nStory = 8\r\nA lot of great, superb, epic anime are boring from their starting eps: Gurren Lagann's start is boring; Kill la Kill's early episodes are boring; Shingeki no Kyojin at its beginning episodes are also boring; Psycho Pass, AnoHana,the list goes on. Samurai Flamenco is of no exception. It started with a slice-of-life-esque opening, focusing on the main lead Hasama Masayoshi, who is a model, and hasaspirations to become a super sentai or heroes that goes \"henshin!\". His ideals go tested for the first six episodes before moving to the seventh, accompanied by Gotou Hidenori, a cop whom he stumbled and got on into his superhero escapades.\\n\\n\\n\r\nArt = 6\\n\r\nArt is okay.\\n\\n\\n\r\nSound = 6\\n\r\nNot the ideal music score for a henshin hero, and not as catchy as the other tracks of other anime that went down in history. However, they're able to pace up the mood for the show.\\n\\n\\n\r\nCharacter =  7\\n\r\nDynamic and complex characters are what I always admire, those who begin as flailing and sometimes hate-able, and begin to crawl their way through what the plot offered them, and they change with it for the better. Don't get me wrong, I've watched Kamen Riders and Ultraman shows myself, so I'm familiar with the typecast characters that henshin shows produce, but Samurai Flamenco was able to put the blend of their main characters to get you riled up--unless you're the kind of anime-fan who just enjoys mainstream shows like Naruto and One Piece and expect each character to be all-mighty and winning (and being Gary-stus/Mary-sues)  and all that, then you may not be able to wind what dynamic personas our heroes have. The main characters here are what I'd say the right blend of transforming the mindset of henshin-heroes in live action, putting them in the stead of the anime realm.\\n\\n\\n\r\nEnjoyment = 8\\n\r\nYou have to go through past episode 7 here to understand why I rated this as 8.\\n\\n\\n\r\nOverall = 8\\n\r\nSamurai Flamenco doesn't come often. Anime productions are too focused on either moe-ness, shounen, shows that needs shipping, and those of the kind of ecchi-bunch of shows that only gets the score of anime-fans because they showed boobs and too much skin. Samurai Flamenco is for the plot, story, and enjoying a take from henshin-concepts brought into anime. Of course, this show is not for everyone, but for those kind of anime-fans who watches anime for the story [and a tinge of henshin-ness as well as the feel that there is a hero out there], and not for the pantsus and fillers, then this is for you.",
            "date": "2014-05-05T05:55:00+00:00",
            "helpful_count": 13,
            "mal_id": 142387,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3729929.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GiancarloLS",
                "username": "GiancarloLS"
            },
            "url": "https://myanimelist.net/reviews.php?id=142387"
        },
        {
            "content": "I would not be too surprised if not a lot of viewers continued Samurai Flamenco, or even give it a chance. I really enjoyed the series, and gave me a bit of a laugh in the process.\r\nStory: 8\r\n Samurai Flamenco really took me by storm after the 1st arc ( 4 arcs= 1-6 7-14 15-18 20-22). The story does take place in 4 different times, but each arc fits right into the next. The story was not as unique, but it is like your typical sentai show. Even though I enjoyed the show overall, the 1st arc of the story could have been much shorter,but it does introduces some really big characters that will become important in the upcoming arcs. But for me the 2nd arc was possibly my favorite. The arc really gave Samurai Flamenco the sentai feel to it, eve though it was corny. If you look at the episodes in each arc I left out episode 19. The reason was because it was a filler episode, and didn't contribute to the final arc as much. Speaking of the final arc, the ending was perfect. The ending filled in some holes, and was the perfect way to end the series with more of a \" personal\" villain to it. Overall Samurai Flamenco had a good story\\n\\n\\n\r\nArt: 7\\n\\n\r\n The art style fits perfectly with the series. Some of the characters are definitely going to be memorable. It did have the flaw of the animation looking awkward a few times. The art style fits well with not only the series, but especially the action scenes. The look of each character was perfect, especially the sentai suits. It did have a flaw though, two characters did look familiar, but the clothes made the two different. Overall the art was great, and the look of the characters will be remembered very well.\\n\\n\\n\r\nSound: 8\\n\\n\r\n The OST was very memorable to me. The BGM was great, and made the action scenes look even better. I particularly didn't like the ED that much, considering that I didn't change at all during the series.\\n\\n\\n\r\nCharacter: 7\\n\\n\r\n The character development was quite good, and every character was believable. The main character Masayoshi is a model, but takes an interest in following the footsteps of his heroes. Masayoshi lacks technique, but makes that up for his spirit which helps him to continue to become a hero. The other main character Gotou is an average cop, who finds Masayoshi and befriends him. Although thinking Masayoshi is crazy, he still befriends him knowing that he will need his help on the way. Overall the characters were great, and I can relate to many of them\\n\\n\\n\r\nEnjoyment: 9 \\n\\n\r\n I really enjoyed Samurai Flamenco because it brought back memories watching Power Rangers as a child. Even though it isn't as re-watchable it makes up for its story, and comedy. If you dropped this series just watch episode 7, and I bet you will want to continue this series. I would definitely would recommend Samurai Flamenco to people who want to watch a piece of their childhood, but with a touch of comedy to it.",
            "date": "2014-05-08T13:36:00+00:00",
            "helpful_count": 11,
            "mal_id": 142707,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3758635.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/G-Celtic",
                "username": "G-Celtic"
            },
            "url": "https://myanimelist.net/reviews.php?id=142707"
        },
        {
            "content": "Samurai Flamenco had a nice flow.\r\nFor several episodes it kept me hooked to it's laid back style, interesting characters and enjoyable \"semi slice of life\" genre. This show was trying to take on a realistic view of \"Superheroes\". A lot like Batman, but it wasn't about stopping the world from getting destroyed or anything. It was just stopping everyday crimes such as littering or stealing purses.\r\nSUDDENLY, something so fucked up happened. This was above M. Night Shyamalan level. It was so whack. It's like opening a Snickers bar and getting a retarded Mars bar instead.\r\nI ask why, why do you do something like this? Whatwent through this director's mind when he made episode 7? What the fuck happened in those last 5 minutes of that episode and why did it happen?\\n\\n\r\nI have never seen an anime take this huge of a turn in such a small amount of time. Honestly, this show cannot be reviewed.\\n\\n\r\n\"Fuck you\" - Samurai Flamenco Episode 7, 18:00, Omori Takahiro\\n\\n\r\nit's shit 10/10",
            "date": "2014-04-15T16:58:00+00:00",
            "helpful_count": 10,
            "mal_id": 140071,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/deadeaddead",
                "username": "deadeaddead"
            },
            "url": "https://myanimelist.net/reviews.php?id=140071"
        },
        {
            "content": "I'm gonna go off of what the other people writing reviews have said, and agree that you have to watch the whole show to get the complete enjoyment. There are a lot of weird twists that don't make a whole lot of sense until the very end, but it really is worth it to get to the explanation. Even I had to force myself to watch some of the episodes because they made virtually no sense whatsoever, but I'm extremely glad I did.\r\nStory: 8/10\r\nIt didn't take much to draw me into the story, but honestly, the pacing was terribly shaky in the beginning. It didn'tmake a whole lot of sense to me what was going on half the time, but it was still enjoyable. I actually really enjoyed learning about each character and seeing Mari, Moe, and Mizuki's relationships --as well as Goto and Masayoshi's -- progress throughout the show. A lot of things seemed bizarre and completely random, but everything falls into place as the show goes on, so it's definitely worth it. The ending is what really made the story for me, though.\\n\\n\r\nArt: 8/10\\n\r\nI actually really liked the art style. I was hesitant at first because of it, but it actually grew on me quite a lot. There aren't really any intricate character designs, but I think that helps humble them and make them more relatable.\\n\\n\r\nSound: 7/10\\n\r\nThe voice acting in the show was spot on. It felt like everyone's voices fit them, and the soundtrack was really good as well. Sometimes it felt a little out of place, but it usually worked out pretty well. I also enjoyed the openings, and the endings were really cute.\\n\\n\r\nCharacter: 9/10\\n\r\nI loved the characters in this show. It's true, sometimes I didn't understand the reasons for the things they did, but for the most part, they were amazing. They were extremely relatable, and about 97% of the time likable. Towards the end they start to hit home more, especially the story with Goto, and the development of him and Masayoshi skyrockets. \\n\\n\r\nEnjoyment: 8/10\\n\r\nI found this anime to be undeniably peculiar and difficult to finish, yet I still loved it. It was funny, heartwarming, heartbreaking, and just a fun show in general. It was as random as it was depressing, which I guess gave it a good balance. While it's true I absolutely couldn't stand the Flamengers Arc, the rest of it is amazing.\\n\\n\r\nOverall: 9/10\\n\r\nI'm giving this a 9 because I felt the ending truly sold it. During the period of watching the show, the lowest rating I gave it was a 5, so even I'm surprised I gave it a 9. I even debated dropping it until I saw the other reviews saying watch until the end, which I'm extremely glad I did. The ending was the satisfaction I was looking for after all the bullshit in the episodes prior. All in all, it's a good watch and I recommend it highly as long as you can stick through the rough patches.",
            "date": "2015-07-30T19:52:00+00:00",
            "helpful_count": 9,
            "mal_id": 194760,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4366989.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DoitsuItalia",
                "username": "DoitsuItalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=194760"
        },
        {
            "content": "People say this show went downhill after a little \"Gorilla\" twist that happened in the series. But I say that this is a series that has a lot of unexpected twists that slowly grow on you.\r\nI think after binge watching this Sentai....I mean Anime show, I can safely say that I thoroughly enjoyed the shit out of this show. I'll start by saying that the twists that this anime takes is a matter of taste. You can either hate it or really love it. For me I was on both ends of the argument but still loved the show. \r\nThis show has a way ofcontinuously drawing the viewer in by throwing these twists after the end of each arc. After the initial 6 episodes of the series I felt like the twist was something that this series needed. The story is all over the place and has some of wackiest things that I've ever seen but it somehow manages to keep me intrigued but not confused on where the overall plot or story is trying to get to. Now what I meant when I said that I was on both ends of whether the twists were a love or hate, sometimes the twists take at least an episode or two for you to actually understand what is happening and when the initial twist happens you might not want to watch the next episode and that's where the hate part comes in but after making through the initial twist I feel as though the story will grow on you.  \\n\\n\r\nThis leads me into talking about how well the show unfolded its story and how well this show was paced. There was never a dull moment in this show for me, ever. Almost all of the characters are likable with the exception of one character. The main character Masayoshi was one of the funniest and well developed characters alongside Gotou who had amazing chemistry with Masayoshi. The only character I felt was a little lackluster was Maya because although she played an important role in developing Masayoshi, I felt as though she was the characater that had the least character development and I was a bit disappointed with the the development that she had gotten. Other than that I enjoyed all the characters thoroughly. \\n\\n\r\nOverall the series like I said is a matter of taste after the first couple episodes and whether you choose to drop it or keep watching is up to you, but I highly recommend you continue because the twists are interesting, the characters are well developed, and fun. Combine these things with two highly catchy opening songs and a soundtrack that is both somber, and intense I feel as though this anime was one of the best shows I've seen in a while, enough so that it has now become one of my favorite anime that I will continue to go back and watch.",
            "date": "2014-04-12T22:16:00+00:00",
            "helpful_count": 9,
            "mal_id": 139713,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2482245.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rayouri",
                "username": "Rayouri"
            },
            "url": "https://myanimelist.net/reviews.php?id=139713"
        }
    ],
    [
        {
            "content": "Disappointing, to say the least.\r\nSamurai Flamenco starts out as a interesting, and frankly, engaging deconstruction of the super-sentai genre. While it treads a thin line, the protagonist Masayoshi is fairly likable and engaging, if a little shallow. His friend Gotou is a bit flat, but clearly intended as a foil, and the relationship between them is enjoyable to a degree. Beyond those two, there are a few humorous side characters -- but very little attention is given to making the few women in the show more than caricatures.\r\nThe series takes an unfortunate turn in choosing to abandon its deconstructive approach, and instead just become asuperhero show -- and not a very good one at that. It tries to remain a little self-aware with moments of supposed clarity from a few characters: but it never really comes into its own.\\n\\n\r\nI very much wanted to like the show for the first few episodes, but frankly, there are better deconstructions, and there are far better superhero shows. Samumenco doesn't succeed as either.",
            "date": "2018-03-20T11:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 274378,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6330548.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/soph_iest",
                "username": "soph_iest"
            },
            "url": "https://myanimelist.net/reviews.php?id=274378"
        },
        {
            "content": "As much as I want (and perhaps have every right) to hate on SAMURAI FLAMENCO, I just can't. For all of its many, many problems and missteps, there is one undeniable fact: it's just FUN.\r\nI will always applaud audacity and go-for-broke gusto, and Samumenco has that in spades. The opening story arc was refreshing, deserving of its easy comparisons to Mark Millar's Kick-Ass. When the first big plot twist (and that's putting it mildly) happened, I giggled with glee and couldn't wait to see what happened next. But when the third and fourth twists came, I admittedly got frustrated and considered dropping out. Seemingly throwingaway storylines and characters I was invested in really left a bad taste in my mouth.\\n\\n\r\nAnd then the final story arc kicked in. And this, ladies and gentlemen, is what elevated Samurai Flamenco to something truly heroic. This is a comedic show that's not afraid to go dark. And when it goes dark, it goes DARK. I truly loved the chances this show took in its final episodes, more than enough so to help me overlook its numerous shortcomings: inconsistent (often mediocre) animation, retconning character personalities for all the wrong reasons, being stretched out for way too many episodes, etc. All of those are valid complaints, but I finished the series on an emotional high that I never imagined was possible, even during its strong start.\\n\\n\r\nLike our hero Hazama, I'm thankful I never gave up, never hid, never was defeated, and never accepted evil. Samurai Flamenco flipped my crazy switch, and I went full Samumenco.",
            "date": "2018-01-24T15:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 269536,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6890812.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JediNut",
                "username": "JediNut"
            },
            "url": "https://myanimelist.net/reviews.php?id=269536"
        },
        {
            "content": "WARNING: THIS IS RIDICULOUSLY LONG AND FULL OF SPOILERS THIS IS MORE OF AN INTERPRETATION OF THE ANIME THEN A REVIEW \r\nI dont usually write serious stuff but i felt for this anime i should because there is something i find very interesting about it. Now this isn't a review for people that have not yet watched the anime because i am simply making an analyses of it and there will be spoilers but you're welcome for the ride. \r\nFirst off going into this anime it seems like an anime where you have to turn your brain off and just sit back and enjoy theride. What it is is a blend of tengen toppa gurren lagain, power rangers, and kick ass and when you here those three together how could you possibly have to use your brain when watching this anime. Well thats because just as a normal stupid giant robots anime it kinda blows. \\n\\n\r\nMy problems with watching this anime without thinking are mostly to do with the pacing and ridiculous shifts in tone. When it comes to pacing this anime is bad... really bad like so bad that... maybe it could be intentional? now what I mean when i say bad is well first we have one enemy, our hero defeats him and instantly another pops up. Right away our hero is given new comrades and sent to instantly fight these bad guys, with a one scene break suddenly they realize the president set this up and it was all a trick. They beat him but suddenly it turns out the guy helping them set that up and that was a trick... thats kind of ridiculous and not in the good way TTGL would have been\\n\\n\r\nBecause of this i started to think that there is no way this could have been an accident but still that wasn't enough the other thing that i found interesting is the ludicrous shift in tone. At first this anime is pretty calm no one dies or gets hurt nothing really bad happens. Then completely out of nowhere 2 cops die. They die bloody deaths to. Their deaths are treated with respect and care like a death should be treated. Okay and so then we continue and the monsters of the same breed that killed these cops act almost comical? When i say this i mean they literally have a monster that's buying all the fruit so that no one can have it. That's a bit of a switch. Then in the next arc the happens right after the first people do die except these deaths are treated like the deaths of people in super hero shoes the faceless side characters that just fall over and die without any real impact, completely unlike the other unimportant cops that were treated with a lot more respect.\\n\\n\r\nThese two things got me thinking that well there's probably more to this anime then what one may see by just looking at it at the surface. The first thing i thought about was the escalation in this anime. Now bear with me this will take a while. We start of in a setting where everything is generally normal and realistic. Our hero wants too well... become a hero and so he makes a costume and tries to make people follow rules that people don't consider important. Seems fine right, well soon after  a girl from a popular idol group joins him because she wants to be a hero. She is a bit psychotic and she uses a mace thingy with a tazer. Wellll that's getting a bit weird in reality that wouldn't really be allowed but still its within the bounds of reality. Soon after he meats a mild scientist who gives him weapons that don't cause pain so would be legal. Hmmm that's once again strange but not impossible. Then we have a gorilla with a guillotine inside it... wait what that doesn't sound very realistic you're probably thinking. Well hold on this gorilla kills the two cops and its treated like how this situation would be treated in reality if a gorilla with a guillotine inside it suddenly pops up and kills people we would hold a memorial for their deaths and there would be a meeting of powers as to how to handle it. Soon more monsters come, and they keep coming however every time they seem less of how it would be in reality and more cartoon like. Then we meet with our bad guy. When he talks two idol girls I found him to say some things that make sense as if he was aware that they were superheroes and they had responsibilities just like super villains however in the next episode when he talks to the main character he seems more cartoon like telling him to join him. Then the world is saved and just as its saved its put into danger yet again. Then the show goes full power rangers however the team dynamic is more realistic but as it goes on it becomes more cartoonish until all the super heroes gather in a cartoon like setting to stop evil. Then the next bad guy to keep it short is even more cartoon like although it turns out he has good motives and then the next one is similar to a lot of anime bad guys where there imposing their way onto people thinking its right this last one may not be as cartoony but it is the most stereotypical one. And then we meet god.\\n\\n\r\nPhew that was a lot but as you can see if you agree with me this anime gets more and more cartoon like with every episode causing it to have weird pacing and tone shifts. Now when our main character talks with god, god says he did everything as the main character wanted it. I'll get back to this but another thing to point out is that another focus of this anime, mostly in the last arch is that of how boring this world is. Have you never though that you wanted to live like those superheroes because thats exactly what our main character thought and the way it plays it with him is the way it would probably play out in our minds. The anime goes from how it would be like in reality to how it would be like in our minds. I feel this was done on purpose in order to make us relate to the character in reality as in how it start and in our minds as in how it ends( not the last arch). Thinking about it like this made me like this anime quite a bit and honestly i think this anime is more than what it appears to be. It's like how we go into our own worlds in order to escape reality for a little while and thats what this anime does, slowly pushes away reality in order to go into it's own little world. \\n\\n\r\nHAH and you thought it was done. Well not just yet I do still want to say a bit about why my entire shpeal didn't include the final arch. Well that's because i feel more so that it was there in order to bring us back to reality for that wild roller coaster kind of like saying don't get too ahead of yourself with your fantasizing because when you put away your phone and look up reality is still there and you still have to deal with it. \\n\\n\r\nIf you read this that damn I'm impressed but if you looked at the giant block of texts and thought, naw, then heres my summary basically an anime bout a love triangle of one guy and one girl trying to fuck another guy. Thanks for reading o and here are some arbitrary numbers cause I dont believe in scoring",
            "date": "2014-11-12T16:44:00+00:00",
            "helpful_count": 7,
            "mal_id": 168365,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2203125.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/hoeze",
                "username": "hoeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=168365"
        },
        {
            "content": "This anime is one big TROLL.  In the best of ways.  I sat through 10 episodes thinking I hated the anime until a healthy dose of THC alerted me to how hard I was being trolled.  \r\nHonestly, I don't think I would have even made it through the series if I hadn't come here half way through and gotten some encouragement.  I needed a couple of spoilers to see the big picture.  \r\nNoitanima likes to produce anime that entertains people other than just the 18-35 male audience, and they've never done me wrong.  There's something for everyone, whether yougrew up watching power rangers or sailor moon.  Just keep in mind that since they're reaching for a broader audience, there may be references you don't get because they came from anime outside of your childhood demographic.  But all in all, this is a parody, and that needs to be stressed pretty hard.  Maybe you would be better served to watch some of it while intoxicated.  But if you got involved in the anime for the first 7 episodes, don't worry too much, the story line does return to sanity eventually.  \\n\\n\r\nEnjoy :D",
            "date": "2014-12-08T17:12:00+00:00",
            "helpful_count": 7,
            "mal_id": 171501,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2554731.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PalePurple",
                "username": "PalePurple"
            },
            "url": "https://myanimelist.net/reviews.php?id=171501"
        },
        {
            "content": "So..I just finished watching Samurai Flamenco after putting it off for a couple months, after watching the first 3 or so episodes, and my feelings on it are mixed.\r\nWhile I was kinda expecting it to take the route it did, no spoilers of course, I feel as if it could have done it better, for sure. Certain characters fell off and felt unnecessary, or just as sidekicks, something that's even acknowledged by one of the villains. \r\nI didn't like how everything regarding the hero side of Masayoshi's life seemed so convenient. Again, no spoilers, but there's a big aspect of his career later on thatI have a very hard time finding believable, and it didn't make much sense to me.\\n\\n\r\nBut, I was often excited to see how Masayoshi would deal with his opponents, and these methods were interesting to see. He stands for justice, and will essentially nitpick people for even the smallest offences. A neat trait, but I can see how it could get old.\\n\\n\r\nIn the end, Samurai Flamenco was a good watch, and entertaining nonetheless. Despite its shortcomings and missed opportunities, I think it was alright. It has good art, interesting action scenes, and an okay story.",
            "date": "2016-10-16T23:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 231921,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5158170.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kiricina",
                "username": "Kiricina"
            },
            "url": "https://myanimelist.net/reviews.php?id=231921"
        },
        {
            "content": "I'm tired of superheroes. All of them. Every time you turn around there seems to be a new superhero adaptation hitting the big screen or television. The novelty is gone. Asking me to get excited for a new superhero film is like asking me to get excited for a video of a cat doing something cute on YouTube or a new meme. So, when a title comes along that parodies the superhero genre, I'm interested. If you feel the way I do, watch \"One Punch Man\". \r\nThen if you still want some silly satire, watch \"Samurai Flamenco\". \r\nComing from the respectable studio \"Manglobe\", \"Samurai Flamenco\"or \"Samumenco\" gives us a whole parody parade drawing it's influence from many, many famous titles and genres. From \"Kick Ass\" to \"Power Rangers\" to \"Sailor Moon\" to more grown-up titles like Christopher Nolan's \"The Dark Knight\", you could have a game of \"guess what that's referring to\" while watching this 22-episode series. \\n\\n\r\nWhile it is a parody in most ways, it does try to stand on it's own. The story is about a guy who wants to become a superhero like those he watched growing up on TV. So, he puts on a silly costume and goes out crime fighting. This starts a long, winding road where he makes new friends, plenty of enemies, and has one of the most bizarre adventures this side of JoJo. Watching this story unfold, I thought I was gonna be rooting for the bad guys because the campy \"justice will prevail\" stuff gets annoying quick. But, by the time I was bored with that, the story shifted gears and things got a bit serious. It was quite refreshing.\\n\\n\r\nThe characters actually grew on me and while I'm not going to place them in my Top 10 or anything, I will say that I did enjoy the lovable goofballs that were as colorful as the art on display. A lot of bright colors and primaries that are typical of the superhero genre with sound effects of equal ability. The music is very ordinary, with some rock opening themes and some J-Pop to close. I was hitting fast forward through the credits a lot. The Japanese voice cast did a good job (still no English dub) performing well in both the silly scenes and the more dramatic stuff. Overall, it is a well-made show from top to bottom. \\n\\n\r\nThe finished product that is \"Samurai Flamenco\" does have it's merits, I laughed out loud many times and enjoyed myself, but I did also have to grind through a few of the early episodes and questioned the rapid shift in tones and plots that seemed to happen almost at a whim. To go from a bad guy who is actually intimidating to a group that looks like a band of rejects from \"One Piece\" is a bit of a let down. In the final analysis, it is hardly a failure, but it struggles at times (as many before have) mixing the action with the comedy and therefore ends up only as slightly above average spoof piece. 6/10 across the board. Check it out. Cheers!  \\n\\n",
            "date": "2016-10-03T09:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 231007,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5233934.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GarlandReese",
                "username": "GarlandReese"
            },
            "url": "https://myanimelist.net/reviews.php?id=231007"
        },
        {
            "content": "I dropped it at Episode 18.\r\n\"Samurai Flamenco...hmm, an original from Manglobe, what can go wrong?\"\r\nStory: 6\r\nNothing special, just some super-hero shounen anime.\r\nBUUUUUUUT WAAAAIT FOR IT.\r\nArt: 7\r\nNothing to say, it's good.\r\nSound: 9\r\nGood OST, perfect OPs by Spyair and Flow (You know what i mean)\r\nCharacter: 6\r\nIt's k. The show turn to be gay sometimes (I mean, you can ship preety much all characters, and it litterally says to you \"LGBT IS ALLOUDED HERE\", since there is even a lesbian, and i have nothing against it, but it just doesn't fit the genre). Personalities were randomic, i don't understand why they did it in this was. Also, enemiessucked. Overall decent characters, but god i hate the girls of this show.\\n\r\nEnjoyment: 5\\n\r\nWell, wtf was going on? Now it's the point. The show was decent in the first 12 episodes, than it turned out to be POWER RANGERS; WITH UNPREDICTABLE CHARACTERS THAT HAS THE PERSONALITY OF A TRUCK.\\n\r\nOverall: 7\\n\r\nWhy 7? Because i like mindfuck. And i just counted 12 episodes, the second part sucked.\\n",
            "date": "2017-02-11T07:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 240361,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5607962.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/H4Z3",
                "username": "H4Z3"
            },
            "url": "https://myanimelist.net/reviews.php?id=240361"
        },
        {
            "content": "I wanted to wait until it finished  airing before I made a review about it and now that is over I can officially say that Samurai Flamenco is weird as sh\"\"\r\nThis a story of Hazama Masayoshi a young man how grue up watching Japanese super hero shows (like Kamen Rider our the Power Rangers) and gain a strange obsession by them... He decides to become a real life super hero and fight crime for justice and for all that is good but after his first attempt fails he is discovered by  Goto a police officer who instead of arresting him decides to lethim go and builds a very strong relationship with Masayoshi and eventually becoming best friends.\\n\\n\r\nEven so Masayoshi dosent give up and continues his quest to become a super hero and continues his long journey to greatness. Its during this journey that he meets  new allies who got inspired by his deed and decide to assist him like an actor of one of Masayoshi's old shows who decides to train him , a pop star who decides to be a super hero as well ,and a scientist that decided to make weapons and gadgets for Samurai Flamenco.  \\n\\n\r\nThe thing that made me be attracted to this anime in the first place was the realism and the amazing pacing , it was amazingly well written and the characters had such great personalities that made me think if id put this Im my top 10.  How ever everything changed when ep 7 arrived...\\n\r\nNo one was waiting for this one and just  for your own sake \\n\\n\\n\\n\r\nSpoilers\\n\\n\\n\\n\\n\\n\r\nThe realism of the entire show drops in a instant when in a drug bust a drug dealer turns into a Giant Cybernetic Gorila with a Guillotine for a belly...\\n\r\nYeah true story...\\n\\n\r\nThis is 100% real and I was baffled when I saw that...\\n\r\nHow ever it is just the tip of the iceberg of wired ness of the show , Giant Robots ,mutants , cyborgs and even aliens make an appearance  and the show isn't even subtitle about it .\\n\\n\r\nEven so its still very entertaining and the story is still very well written even tho there is some indices of shark jumping and and plot points that are completely bull...\\n\\n\r\nStill its still a a good show how ever its has two major weaknesses :\\n\\n\r\n-The pace constantly changing \\n\r\n-And the ending \\n\\n\r\nThe show consistently changes its story and thus the pacing changes as well \\n\r\none minute the show is very realistic ,the its i realistic and goofy ,then its very dark , than epic ,than absurd.... its like the show has multiple personality disorder or did a lot of drugs.\\n\\n\r\nThe ending kinda bordered me not because it was too stupid of anything but because it wasent anything special... I was waiting for a great climax that enplaned everything but instead it ended in filler.\\n\\n\\n\r\nBut still Samurai Flamenco is a good show or rather Samurai Flamenco is a a very good experiment it shows perfectly how creative processes can collide with each other and  and create something half baked that honestly because of its writing it kinda holds off together.\\n\\n\r\nThis show isnt for every one but i still encourage every one who likes super heroes shows to watch it.\\n\\n\\n\r\nVIVA TORTURE !!!!!!!    \\n\\n\\n",
            "date": "2014-03-29T06:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 137697,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3217991.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/alberto167",
                "username": "alberto167"
            },
            "url": "https://myanimelist.net/reviews.php?id=137697"
        },
        {
            "content": "I loved Samurai Flamenco! If you are a fan of the superhero genre, you should definitely watch this! \r\nSamFlam starts off pretty much as a story about a kid who grew up and never lost his desire to become a super hero. Our MC starts off small, trying to stop petty crimes by petty crooks and juvenile delinquents, and things don't go as well as he hoped. It definitely tries to stay grounded in reality despite its superhero premise.\r\nThen things go absolutely crazy as time goes on, where our superhero story becomes an insane, and insanely fun, over the top superhero adventure.\r\nStory: 9 - Thestory is amazing, and just when you think you have it figured out it turns things up another notch. You cannot fathom where its going from watching the first 4-5 episodes. \\n\\n\r\nArt: : 8 - Artwork is definitely better than average, animation is well drawn.\\n\\n\r\nSound: 8 - Sound is good, and totally fits with the visuals and story.\\n\\n\r\nCharacter: 9 - Characters receive great development, especially the main cast. Side characters are all awesome, no one really feels superfluous.\\n\\n\r\nOverall: 9/10 - I enjoyed this series a lot, and would highly recommend it to all anime fans, especially if you like the superhero genre.",
            "date": "2016-06-18T14:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 221109,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4933051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ElSensei",
                "username": "ElSensei"
            },
            "url": "https://myanimelist.net/reviews.php?id=221109"
        },
        {
            "content": "Where are the lines between good, badgood, and bad? Where is the line between a deconstruction/parody and the thing the parody is commenting on? Where is the point at which the pretense of irony is dropped and the show just becomes what it is mocking? I can't really say. \r\nSamurai Flamenco seems to be a parody of bad superhero shows and also itself is a bad superhero show. It seems to make fun of forced emotion and drama and follow it up by unironically forcing emotion and drama. It seems to be a show that cares about its characters and has some form of realmessage to give, but is also completely mindless in the presentation of those messages. At the end of the day all I can say for certain is that it is compelling. Whether it's compelling to see the surprisingly good character growth, or just to see how stupid things can actually get. \\n\r\nIt's a tough show to write a review for. But just to touch on the specific categories reviews here are divided into generally:\\n\r\nThe story is absolutely batshit crazy. Twists that aren't foreshadowed left and right, genre shifts mid episode, plot holes left and right. But somehow even within this fucked up system things work. The narrative is funny, and fun to watch unfold. \\n\r\nAt times the animation during the action sequences is genuinely very good. At times the characters faces looked like fucked up memes during conversation or still shots. It's a mixed bag but it evens out to \"average\".\\n\r\nThe sound is pretty solid all the way through. Good VA work, two awesome OPs, fairly solid music during the show.\\n\r\nThe characters are where the show truly shines. Always likeable, many with a lot of nuance, and somehow generally very human despite existing within the context of such an insane narrative.\\n\r\nI didn't want to like Samurai Flamenco initially, I tried not to initially, but I did. I liked the flawed artwork. I liked the ridiculous narrative and untelegraphed twists. I liked the characters. And I'd like to go ahead and give it a solid 8/10.",
            "date": "2016-10-09T14:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 231468,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3771637.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RagingDan",
                "username": "RagingDan"
            },
            "url": "https://myanimelist.net/reviews.php?id=231468"
        },
        {
            "content": "This is literally the only anime I'm actually going out of my way to leave a negative review on. But, after forcing myself to finish the series due to completionism, it would haunt me if i didn't.\r\nThe anime started off as a slightly meta-breaker of an anime, with some One Punch Man tones despite the MC being weak as heck. Essentially what caught my interest was that it was parodying popular shounen genres and I enjoy those.\r\nI enjoyed the anime up until around the 7th or so episode, and then from that point on the anime pretty much did a backflip and dove head-straight intoa pile of crap, and turning into one of my greatest regrets in my lifetime of viewing anime.\\n\\n\r\nThe anime suddenly goes from parodying the cliches, to actually adopting them, becoming absolutely horrible cheap knock-offs and NOT with the intention to be humorous but instead assuming it's doing a good job.\\n\\n\r\ncharacter development went to absolute crap, the story development turned into something along the lines of, \"hey, remember that old anime that everyone loved? let's copy it's plot and major plot twists, and add in bits and pieces and pretend we're doing it better!!!\"\\n\\n\r\nabsolutely horrible, at the end of it you sit there in your chair or whatever wondering, \"why..?\" \\n\r\n\"why did I even watch this...?\"\\n\\n\r\nin summary: Crap.\\n\r\nstory: Pathetic.\\n\r\ncharacter: Disgrace to shounen genre.\\n\r\nEnjoyment & overall: I'm surprised I didn't jump off a building / 10\\n\\n\r\nthe art and sound was decent I guess, in other words...a decent budget flushed down the toilet.",
            "date": "2018-04-22T14:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 278737,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5812675.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Doki__doki",
                "username": "Doki__doki"
            },
            "url": "https://myanimelist.net/reviews.php?id=278737"
        },
        {
            "content": "((As many have said, what really makes or breaks the show is spoilery, so there will be (very generic but still) spoilers.))\r\nI really wish there was a way to split this into \"pre twist\" and \"post twist, because the two (for me) are VASTLY different. I found the first 6-7 episodes very promising, as in I my rating for the show was a 9/10. The show took a \"kick-ass\" approach to the ordinary person becomes a superhero story, but Hazama sticks mainly to small crime like people littering and stealing umbrellas, with the occasional more serious tone, but the show still manages to still remaina mostly light hearted show, with Hazama sporting a ridiculous outfit, and taking the time to monologue about justice. While incredibly dorky and childish, as time goes on Hazama becomes a little more dimensional. Goto doesn't go through a lot of development, usually playing the role as the straight man in contrast to Hazama's antics, but he's an enjoyable character with potential all the same. His mostly offscreen relationship with his girlfriend was very interesting and well handled especially. Despite my enjoyment of the show at this part, I will admit that while I enjoyed the idea of the flamenco girls (both their real life selves and their superhero personas), but the ideas presented remained one dimensional and never received any real attention. But other than that, one of my favorite things about the show was the subtle and realistic character development, relationships, and interactions that occurred. The materials present, while not all fully developed and formed, could have led to so many interesting story lines that would have been more than enough to fill the remaining 22 episodes, especially if they had decelerated flamenco's acceptance by the community, or even just kept the mentality of the public towards the heroes in a grey area like most super hero stories do. \\n\\n\r\nThen \"the twist\" happened (the shift takes place in under 30 seconds, without any sort of foreshadowing to precede it), and it all rapidly deteriorated in enjoyment from there. A lot of what I enjoyed with the characters and plot either disappeared immediately or quickly ebbed away, only to be replaced by narrative and character development that really didn't seem like it knew where to go, other than just being more \"intense\", \"dark\", and \"unpredictable\". I made it through the second arc still (somehow), but the first episode of the third arc (episode 11) completely obliterated any remaining interest in the show, when it took the destruction of the \"real world\" setting to a new low, while the prior arc had just made it more ambiguous and open to the possibility of more supernatural elements.\\n\\n\r\nI honestly don't know who to recommend this series to, as it changes genres and tones like the weather. The only reason character and enjoyment and story are that high are because of how much I enjoyed the first 6-7 episodes. As both a fan of anime and western superheroes, I came in (with full knowledge of the twist by the way) looking fully forward to the show in its entirety, but ended up not only quitting, but not even being able to finish the episode I was on.",
            "date": "2015-05-28T22:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 189070,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4543869.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/gaysngreys",
                "username": "gaysngreys"
            },
            "url": "https://myanimelist.net/reviews.php?id=189070"
        },
        {
            "content": "Samurai Flamenco displays an uncommonly blatant disdain for narrative conventions and so little coherence that after the last episode I was left thinking, “That was baffling, even for anime.”  I don’t consider my time wasted – in fact, I enjoyed myself for all 22 episodes – though on closer inspection it must be admitted that this show really doesn’t look out for itself.\r\nBlessed with a solid cast and a superb soundtrack that includes blood-pumping hero fight music, adorable idol pop, and a suspiciously Pink Panther-esque sleuthing song, Samurai Flamenco racks up some style points right off the bat.  The character designs have awide range of quality; some, like Joji Kaname, are memorable and perfectly appropriate for the personalities that reside therein.  Others, like the Flamengers, seem very ordinary, and I’m not sure if that’s the point or what.  By and large, however, I have no complaints from an audio-visual standpoint; the key issues with Samurai Flamenco lie in the writing.\\n\\n\r\nThe show’s first arc, equal parts insightful superhero origin and compelling underdog tale, lasts for six-and-a-half episodes, and that is about the longest stretch of time this show spends in any one dimension of reality.  At that point, Samurai Flamenco experiences an abrupt shift in tone and direction, only to undertake a hasty regression to the mean over the next few episodes while getting continuously more surreal.  Arcs that could have easily filled a season vanish within a couple of episodes, with the breadth and scope of the overall story changing in the blink of an eye.  Soon, its powers fully unleashed, the show becomes a runaway train of retcons and wild twists, cycling through characters and concepts faster than Mumen Rider.  The nature of the world we’re meant to experience seems to change with such wanton speed and elasticity that the show feels like it was written not episode-to-episode, but minute-to-minute.\\n\\n\r\nSamurai Flamenco must have developed ADHD halfway through, because suddenly it is no longer content to tell one story or let things lie as they fall.  Characters phase in and out, sometimes emerging at the other end of the series with very different personalities and no straight line from point A to point B.  At the conclusion of each mini-arc, I can practically hear a voice in the background saying, “That was fun, but how can we make that not matter anymore?”  There are satisfactory emotional payoffs, decent moral lessons, and the beginnings of some engaging tangents about heroism, society, and justice, but for the most part, the show staggers back and forth like a drunk, varying in atmosphere, genre, and plane of existence far too much to be considered a paragon of excellence in writing.\\n\\n\r\nWhat began as the story of a naïve, powerless teenager with dreams of becoming a hero winds up as a reality-spanning clusterfriend of aliens, deities, conspiracies, mech battles, power suits, and sociopathic ghosts.  I can no longer say with certainty what Samurai Flamenco is about.  Is it about the character of Masayoshi Hazama, the titular Samurai Flamenco?  Is it about the concept of being a hero or a superhero?  Is it a revelation about love or friendship or sacrifice?  Is it an examination of world peace, doing good in society, the nature of good and evil, the government?  Is it a parody of Super Sentai- and Kamen Rider-type shows?  Perhaps a tribute to them?  Is it some weird, obsessive thing about the word “flamenco”?  Whom are we supposed to be learning about and what are we learning about them?  By the show’s finale, things have gotten so far off-base that it’s hard to say there is any truly satisfying closure, either because it was already snapped up earlier in the show or because there just doesn’t seem to be anything in need of closure.  Maybe because there was supposed to be closure, and then there just wasn’t.  I can’t tell anymore.\\n\\n\r\nIs Samurai Flamenco…  “good”?  Oh, hell no.  Well, maybe.  No, no, it probably isn’t, at least from a storytelling perspective.  It probably deserves a 5, a 6 at best; I’m just feeling generous because of how much I liked it.  Nonetheless, I’ll look back on it fondly: an ugly duckling, perhaps, but still a good egg, and something I’m likely to recommend to others.  Hazama is an idiot and so are all of his friends, but they’re lovable, goofy idiots who are fun to watch and very easy to believe in and support.\\n",
            "date": "2017-10-14T21:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 260795,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5690418.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AgentofSSUSteel",
                "username": "AgentofSSUSteel"
            },
            "url": "https://myanimelist.net/reviews.php?id=260795"
        },
        {
            "content": "A cute idea that potentially thought it was a parody and then, perhaps growing bored of that (or realizing it was failing), chucked the idea out the window and doubled down on the worst of anime and manga superhero tropes and put the two most important characters through a writing woodchipper. Not to mention that it doesn't seem to ever know what genre it wants to go into. This might have worked, if the writing wasn't completely terrible.\r\nThe first several episodes seem fine for what it was trying. It's your generic anime/manga protagonist who wants to be a hero they've always read/watched taking the firstopportunity to do so. Except there's no magic powers, no secret societies, no other dimensions, no vast wealth, no mad scientists inventing tech, no supervillains, no years of martial arts training across the world, or heavily condensed hard martial arts training from a master(s), no experiments gone wrong or dangerous medical procedures or supernatural mental or physical capabilities. I have no issue watching a series about any/a mix of any of these particular tropes, but this series seemed to originally be committed to something without all of those things.\\n\\n\r\nAnd that's fine. One of the best moments in the first several episodes is when we see a civilian who wants to collect the bounty for Samurai Flamenco's identity actually change his mind when SF saves him. It's one of the last times we see what should have been the message of the show: that ordinary people going out of their way to help others, even if they put themselves at risk, can change hearts and minds of those around them and make the world a better place. And this should have been a warning about how the show doesn't care about any cliche messages it puts out before it does a 180 and focuses on something else shiny.\\n\\n\r\nBecause not even halfway through the show there is a 'mad scientist' with powerful gadgets. There is a martial arts 'master' to train with. Further along, shockingly, there are actual monsters to fight (not just humans) and a supervillain or several. And there are aliens. And giant monsters (not just regular size ones). And interdimensional gods? And a government conspiracy! Pretty much all of this is everything that's bad about the show. The one good thing and perhaps one of the show's only good ideas is the inventor, whose idea is to make stationary that can be used in fighting and self-defense, rather than just giving SF a gun or something. Admittedly I don't know Japan's legal system all that well, but I'm pretty sure the concept that 'it's stationary so it can't be confiscated' or SF wouldn't be held criminally liable for using it has no water whatsoever (pretty sure hitting someone with a ruler rather than a bat isn't going to protect you from liability as long as it causes the same damage). The idea behind the inventions is still pretty great. And that's it for the neat ideas here.\\n\\n\r\nHave you seen any amount of \"Power Rangers\" or \"Kamen Rider\" or \"Voltron\" or any other series that required a giant robot formed of five or so smaller robots run by a team? Then you have seen the last 2/3rds of this show, and any version of those other series is likely better than what's in this show. If this was striving for a parody, it's not succeeding, because all it does to 'parody' is to reproduce the same content, but with worse writing (which is saying something, just not what I imagine the creators of this show intended). By the time it's incredibly obvious that the main message is \"look at this tropey thing, it's so corny!\" is basically every joke, it's long since stopped being funny.\\n\\n\r\nAny other message of hope or camaraderie or working together to make the world a better place or being the best you that you can be, even in the small things, is lost. This is not a good new take on any of the series that formed the base idea for this one. So it is not a parody, not enjoyable on its own merits, and not a good addition to any particular superhero genre it wants to be part of.\\n\\n\r\nAnd then there's what it does to its main two characters. Goto's background is so badly written that the actual only good part of it is how it plays into the final antagonist's story arc (and I don't even like the last antagonist). The end of the conversation the last antagonist has with Goto has one line that just felt so well written and terrifying, particularly coupled with Goto's reaction, and it's the only villain moment that felt like someone on the creative team cared about making a decent story.\\n\\n\r\nBut it seems like at the last moment, someone thought that the protagonist was missing a few important personality traits, so the writers tossed them in at the last second to add more plot to the story. The show actually seemed to be going in an interesting, unusual (for an average similar anime/manga) direction with Goto and Masayoshi's relationship, but then the bad writing came in and bungled it. As is, I like to pretend the ending scene between the two characters didn't happen, not just because it destroys any character development for the two characters or plot development for the last several episodes, but also because it seems like a studio exec or five stepped in and said WOAH WOAH WOAH, this is TOO gay. A part of me likes think that if \"Yuri On Ice!!!\" had come out before this series, that ending scene would have been very different. Unfortunately we got what we got, which, considering Masayoshi's actions during the climax, isn't too bad.\\n\\n\r\nThere are a few decent gags and jokes that work. Most fall flat because they're at once trying to be corny and also trying to make fun of the corniness, and just end up being a string of corny-ception that makes you roll your eyes or forget it ever happened. Unfortunately, whole characters, at least in the last 2/3rds of the series, are used as gags, which only makes things worse. The token Pink Ranger is the worst example, with one of the weirdest and dumbest plotlines in the story. And then there's one of the gags that makes me wonder if someone wanted to write a shonen but got stuck with this: Masayoshi's boss is constantly being sexually harassed by a reporter and every time you can tell that it's being written as a joke. Even worse, the guy gets sort of turned into a hero, so if you really couldn't tell before, it all was a joke! Ah, women threatening men that don't take a hint and men constantly not taking a hint, and neither of them demonstrating any particular reason why they'd be good together... How cute and funny! -end heavy sarcasm-\\n\\n\r\nNotably, I have nothing to say about the magical girl trope. That's because nothing notable about it whatsoever. It is neither interesting enough to merit commentary, or offensive enough to merit any worthwhile critique.\\n\\n\r\nThe animation is decent for a modern, off the line anime. It's no \"Garden of Words\" or a Studio Ghibli film, but it's not whatever the worst anime you've ever seen is visually. The character models look good, with a nice art style. The music made no impression on me, and I liked none of the opening or ending songs. The overall soundtrack wasn't horrible (although the second opening definitely is), but heck if I remember anything significant in it.\\n\\n\r\nDon't watch this. If you do, be ready to fast forward because most of it isn't worth watching. Watch \"Voltron: Legendary Defender\", for some giant robot/monsters/aliens fights and good team-building stories and action scenes and animation. \"From Up On Poppy Hill\" for some cute romance, or \"Yuri On Ice!\" for some cute M/M romance. Watch \"Darker Than Black\" season 1 for a half-decent government conspiracy/superpower/cop serial. Watch \"Free!\" for relationships between men and humor and drama (among other things). Watch \"Natsume Yuujinchou\" for 'average kid with a superpower makes lots of friends along his journey'. Those are all so much more worth the time.",
            "date": "2017-09-10T15:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 257260,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/278443.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/WdaCdaShdaDid",
                "username": "WdaCdaShdaDid"
            },
            "url": "https://myanimelist.net/reviews.php?id=257260"
        },
        {
            "content": "I was tricked into watching the Power Rangers somehow. Not even mad about it. MC is a great hero the villains, while they are a bit ridiculous at times, are actually as a whole incredibly dark. Good anime would recommend.",
            "date": "2014-10-19T14:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 165307,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jivanicus",
                "username": "jivanicus"
            },
            "url": "https://myanimelist.net/reviews.php?id=165307"
        },
        {
            "content": "Samurai Flamenco is a cluster fuck of ideas that subtly asks the question of justice wanting villains even if they were fabricated. It also delves into some human psyches, experiencing the trauma.\r\nThe beginning premise was very humane experience of what heroes from TV shows would be in real life. Being ostrisized and ridiculed, while few thanked and supported the gentle hearted Hazama. It was mundane and the problems that occurred wasn't any extraordinary news.\r\nBut the story takes a sudden turn with real monsters and psychopathic villain appears out of thin air. Then tops that with a ridiculous bullshit that is Flamenger and the classic superherosentai trope of previewing monsters before their arrival.\\n\\n\r\nThis again gets topped by senator Armstrong from MGS: reveagence propaganda, in order to defeat Alien Flamenco god. However Hazama being epitome of a hero; he refuse to continue fighting fabricated enemies to fulfil his fantasy, if it meant endangering other people around him.\\n\\n\r\nThis yet again gets topped by sickening attacks made by Haiji, who is not a formulated villain like before. This was what superheroes should be concerned if their secret identity was revealed.\\n\\n\r\nAt the final arc there is the revelations of many of these mentally broken characters which are then explored making interesting mini plots for each of them. Whether it was a setup or incidental, the final arc definitely the highlight of the show with ridiculous fantasy build up crashing down to grim reality.\\n\\n\r\nThe show overall is a massive superhero plot orgy ride, you will never see same thematic more than once every 7-8 episodes, which is like watching 4 animes at once.\\n\\n\r\nThe art direction wasn't anything outstanding, but definitely average if not better. Presentation was consistent while accompanying myriad of themes and moods.\\n\\n\r\nAs a disclosure I am bias as donkey when it comes to superhero content.\\n\r\nShould you recommend Samurai Flamenco? Yes, if they like plot orgy",
            "date": "2016-01-15T13:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 208596,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Corocis",
                "username": "Corocis"
            },
            "url": "https://myanimelist.net/reviews.php?id=208596"
        },
        {
            "content": "THIS IS A REVIEW OF THE ORIGINAL STREAM/TV RELEASE and should be viewed as such. THings such as art may improve with a home release and therefore as such keep in mind that this is a review of the original stream/tv release of the show.\r\nIF you don't want to read my review here are my recommendations for this show .\r\nOverall recommendation: \r\nWATCH episodes 1 to 10 . This covers the first two arcs, which are really the best. This is when teh animation suffers the least, and covers more of a \"Kick ass\" type of plot and a parody of \"Power rangers/sentai\"\r\nTHEN watch 19 to22.\\n\r\nWhy you say skip 11 to 18.....\\n\r\nWell this is when character development , animation, and really most things drop off the radar. The plot is still there, and the show is funny with it's parody of super heroes in general.\\n\\n\r\nWith episode 19  a new plot picks up, and they more of less cover from time to time what happened in the past episodes. Like who they defeated. You really don't need much details about the previous 2 arcs because they don't affect the overall plot of the last arc hardly at all( aside from characters which make one liners at times). And anything that does seem to affect it they seem to reference it via flash back, or they mention it so many times that with some thinking you can guess what happened like since the plot is very complex.\\n\\n\r\nThe last arc really picks up that pace of the first arc IMO and really hits its stride again, and if samurai flamenco had been given a 14 or 15 episode anime season and was able to skip the arcs from episode 11 to 18 , I think this show would be much better\\n\\n\\n\\n\r\nStory: 7/10\\n\r\nthe story for flamenco is really all over the place, which is fine IMO to go above and beyond throwing galaxy's at each other. However, it lacks something within this story.\\n\\n\r\nYes the plot seems to continue on one right after the other, and it is a very enjoyable comically  because of the characters . But the story just misses the mark overall.\\n\r\nWithout spoiling much, Flamenco story is a truly unqiue one and it gets larger and larger and large with each arc. However, the end result in the last episode completely throws this pattern away, leaving a disappointing feeling at the end. Like nothing is going to happen to these characters any more other then \"Daily life\". \\n\\n\r\nAlso the plot isn't one to psychologically evaluate (aside from the last arc), so if your looking for a show with a light hearted super hero themed plot this will be up your ally.\\n\\n\r\nArt 5 or 6 / 10\\n\\n\r\nSamurai Flamencos style and art starts out great, it was fantastic and amazing at the beginning...... But starting in episode 11 it starts to have its on and off moments.\\n\\n\r\nFor example in episode 17, the fight scenes are drawn in a normal or high quality like the beginning of samurai flamenco showed. BUT other scenes that may happen inbetween the fight barely look animated and some characters faces look so almost it hurts. (this episode in particular i remember the most of for whatever reason)\\n\\n\r\nAlso , the 2nd opening animation begins as a montage of first half of the series and then is later changed to an almost still opening. Using pictures of the cast from the shown at there multiple identities (such as hazama yoshi as samurai flamenco). For some reason after abandoning the montage and given this as a replacement, the first few episodes of using the revised opening animation result is a badly animated opening. And strangely enough with every single episode something is usually added or changed to the opening, making it look more presentable and nice, but at the same time makes you wonder if the production team truly didn't have the budget or time at the moment, and could only alter it little by little.\\n\\n\r\nCompared to the first opening, which was fully animated like most shows really makes you consider the lack of budget to make samurai flamenco look as nice as it did in the beginning.\\n\\n\r\nNote, to my knoweldge, aniplex often trys to touch up the animation for the home release. So heres hoping this also applies with samurai flamenco, and that they fix all the horrible moments that look like bad animated sketches, and can remove the 8 different versions of the opening 2 animation.\\n\\n\r\nSound 7/10 : Nothing amazing here, but it wasn't bad, Usually fit and the moment, but nothing that makes me want to go listen to the soundtrack .\\n\\n\r\nCharacters: 6/10\\n\\n\r\nOverall the main probably 3 to 5 main characters get developed a good bit, but overall as the story progress' only hazama masayoshi (Samurai flamenco) gets developed at all at times. The other characters help with situations, but really after the 11th episode it seems like character development, samurai flamenco aside, is thrown at the window for the most part just to be picked back up in the final arc. \\n\\n\r\nEnjoyment 10/10: The only perfect thing about this show. I love there take on super heroes and there parodies of multiple views of heroes through out the series.  Every weeks episode was like feeling like a kid , wonder what villian would face Samurai flamenco, or what crazy plot twist(which there are too many of) would happen. and as such I highly enjoy this series, even if it may not be the best one out there with all the other areas falling hard in the 2nd half of the series.....\\n",
            "date": "2014-03-28T18:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 137609,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Toonpenguin",
                "username": "Toonpenguin"
            },
            "url": "https://myanimelist.net/reviews.php?id=137609"
        },
        {
            "content": "At first Samurai Flamenco reminds me of Tiger & Bunny and decided to watch it but it was very different from what I expected. It's nothing compared to T&B because they don't really resemble each other, just the \"Hero\" part but nevertheless, it was still a good watch (at least for me).\r\nStory: 7/10\r\nActually the first time I watched it.. I've only seen 2 episodes in a row and it was kind of interesting but I decided to put it on-hold NOT because I didn't like it, but because I wanted to wait for all episodes to be completed and probably because I'm the type ofperson who's very lazy to watch anime (I prefer reading manga). Then the last episode came out a few days ago and I wasn't still in the mood to watch it to be honest but I saw a spoiler of the last episode which made me want to watch it right away.\\n\\n\r\nThe idea of the story wasn't really that bad.. the protagonist, Hazama Masayoshi, wanted to be a superhero (but he's just a normal human being) and to achieve that, he starts to solve small/petty crimes  like lecturing people who smokes in a non-smoking area, people who jaywalk, people who doesn't throw their garbage on the right time, catching an umbrella-thief.. small crimes like that... it was kind of ridiculous at first because I really thought he's exaggerating. But then when he said that \"even if the crime is really small, if no one's gonna stop them it will never stop\", actually I thought he has a point and that made me think the story was kind of interesting. I really thought the story was only like that. Like he's just a modern wannabe-superhero in a super normal city.\\n\\n\r\nBut then the story drifted off from what I was expecting. I wouldn't say it was horrible but it did put me off at some point. Like... was that even necessary? It was ridiculous though I was still kind of amused. But I was really looking forward to that \"scene\" in the last episode so I continued watching it. I'm glad I did because it got better in later episodes.\\n\\n\r\nArt: 7/10\\n\\n\r\nI really like the character designs. Ikemen and cute characters but the quality wasn't that good. Like you'll see deform characters sometimes.\\n\\n\r\nSound: 9/10\\n\\n\r\nOne of the good things in Samumenco is the songs I guess. I really like the opening and ending songs. The BGM is nice too.\\n\\n\r\nCharacter: 8/10\\n\\n\r\nThey were enjoyable characters I guess but my most favorite is Goto Hidenori. Especially when I learned what he had been through before. It made me cry actually since I'm a crybaby.\\n\\n\r\nI'm a BL/Yaoi fan so one of the reasons why I watched it was because of Goto and Masayoshi. I really like them together. And aside from my fangirlness, the friendship that they have is something that I really like... I love their tandem!\\n\\n\r\nEnjoyment/Overall: 7/10\\n\\n\r\nMy main motivation at first to watch the entire series was because of that \"scene\" in the last episode but I'm glad that it turned out to be nice overall aside from the ridiculous arc though.\\n\\n\r\nI enjoyed it and made me laugh in some episodes. The BL and GL hints made it more interesting in my case. (Boys Love & Girls Love)\\n",
            "date": "2014-03-30T19:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 137977,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/547567.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ikasama-shoujo",
                "username": "ikasama-shoujo"
            },
            "url": "https://myanimelist.net/reviews.php?id=137977"
        },
        {
            "content": "This show was good until it took a complete 180* turn around. The beginning was amazing and had amazing potential until (spoiler alert) Samurai Flamenco becomes a real hero that fights real monsters instead of how realistic it was when he was just an average citizen fighting petty crimes. The beginning was humorous and refreshing on how they introduce a character that watched anime all his life and wants to fight the bad guys in those shows except that he lives in the real world (anime world) and there are no bad guys like that and there are no super powers. That is until theydecide to insert those tropes into the story with complete brute force and evolve the show into that kind of story during the end of one of the episodes.",
            "date": "2017-06-25T18:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 251051,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4383133.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/drlightningfast",
                "username": "drlightningfast"
            },
            "url": "https://myanimelist.net/reviews.php?id=251051"
        },
        {
            "content": "I'll keep it extremely short (Contains Spoilers).\r\nAt first, it Starts off Really Good with a Normal boy wanting to Save the world from problems such as Robbery, Bullying and related. It's extremely normal and i Loved that part about it, no Magic, no Super Powers to the Main character.\r\nIt goes on until about 7th (i think) epsiode when suddenly a villain who can Modify people to the extreme comes and changes the NORMAL Part.\r\nHe fights them now (note: The Main character is still a Normal human being).\r\nAnd After defeating that villain in about the 11th episode, here comes the Plot Twist.\r\nAfter that, it's All POWERRANGERS Stuff. I don't know how many have watched or even know about the POWER RANGERS thing but I've watched too Many and it's pretty much the Same and i Had to Drop it off at the 12th Episode.\\n\r\nIt's POWER RANGERS in Anime. Simple as that. That's what i saw. \\n\r\n.\\n\r\nPs: There's a Slight (very slim) Chance that it is something different or has a different plot other than the POWER RANGERS Plot but i highly Doubt it. I Dropped off at 12th Epsiode but  if u Have No Idea what Power Rangers are or what I'm talking about. Go For it, You'll like it. The Genre Tag Doesn't include Mecha but it is Definitely mecha after 11th Episode.",
            "date": "2019-04-07T00:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 305666,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6223805.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/salman4694",
                "username": "salman4694"
            },
            "url": "https://myanimelist.net/reviews.php?id=305666"
        }
    ],
    [
        {
            "content": "**SPOILER FREE**\r\nThis is a great show. I don't know much about hero shows, but this show essentially only requires that you've seen a couple episodes of, say, Power Rangers to understand the premise. \r\nSTORY: It starts out light hearted with a boy who wants to be a real life hero. Halfway through the series, however, the show takes a hard turn towards the serious. Honestly, it was a light hearted show about a guy that desperately wanted to be a real hero and often took a beating for it. Then we find out about his family connections to this dream, the serious emotional ties. Andthen, in the middle of en episode in which it seems like there's someone in an elaborate costume...people start dying. Have you ever been the only one laughing at a joke only to realize it was a relatively inappropriate response? That's how this will make you feel. But still, by that time you've been pulled into the characters and their story to give it up.\\n\\n\r\nCHARACTERS: I enjoyed the character development, even if I felt tricked into thinking it was a light hearted buddy comedy. People suffer from things that have happened to them. Romance isn't easy. And friendships have bumps. My only issue is that you get attached to some new characters only for them to leave for the final arc. But I suppose that's what happens in real life, as well. \\n\\n\r\nSOUND: Good music and fantastic, fitting casting. \\n\\n\r\nART: Consistent, fluffy animation that is enjoyable to watch.",
            "date": "2014-07-07T15:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 150923,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85973.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/notyourghost",
                "username": "notyourghost"
            },
            "url": "https://myanimelist.net/reviews.php?id=150923"
        },
        {
            "content": "Despite this being my first review that may or may not be helpful, I have quite a bit to say about this anime so I'll try and keep it short. \r\nI happened to stumble upon a list of new animes airing in 2013 and Samurai Flamenco was one of them. After reading the synopsis I thought it was going to be slice of life (which normally isn't my style), and thought maybe I'd try it out. The first few episodes were a bit awkward and somewhat childish but honest and down to earth. I could say that I fell in love with the first fewepisodes until it took a turn for the worse. After that point in the show, the rest of the series felt like an utter betrayal. I question why the writers decided to take the route that they did, but now I see you really couldn't make a 22 episode show about a superhero solving petty street crime. Even so, the writers took the story so far beyond it's starting point that it leaves you completely flabbergasted and confused; it is literally the mother of all plot twists. Later on in the series, about episode 16 or so, you start to see some of the old Samumenco come into light. I found one scene to be so heartfelt I actually teared up a bit. (seriously though). Then it gets insane again the following episode. The last episodes really make you want to keep watching because once again, there were some last minute twists that I found to be enjoyable. The overall plot was bad due to its poorly executed manner, but I have to admit there were a few heartwarming lessons and scenes that made me love this anime. \\n\\n\r\nI really don't want to say too much more other than I was bit disappointed with the path it took, and while the story and plot were not as enjoyable, there were some elements I loved about. The characters are my favorite thing about this show. \\n\\n\r\nHaving completed this series, I honestly recommend you watch this. You are forewarned, but the end was well worth it.",
            "date": "2014-03-28T12:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 137511,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3075095.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sas0rii",
                "username": "sas0rii"
            },
            "url": "https://myanimelist.net/reviews.php?id=137511"
        },
        {
            "content": "Well, I picked up this anime because I had to translate the subs to Persian, so it wasn't really a choice anyway. Still, I'm glad I got to do it. \r\nIt was mostly a mix, and I have to confess that it was unbearable starting episode 8 to episode 13, but past that point was less painful on the brain and the eyes. I'm giving it a 7 because in the last 5 episodes, they saved the show and somehow managed to wrap it up and excuse those infernal episodes. \r\nI guess we agree that Samurai Flamenco must be divided in three stages: 1.Before Episode8\\n\r\n 2.The craphole from ep 8 to 14 \\n\r\n3.The rest which was cool\\n\\n\r\nThe story was fine. They ideas of heroism were conveyed very well although they should have done something with that horrible shift at the end of episode 7. Would have been all easier if we just were to see masa waking up in a mental hospital or something. \\n\\n\r\nSound was good, the music was catchy. not much to develop here.\\n\\n\r\nArt was... Bad. I mean, the art itself and the style wasn't bad but many times, especially in the second half, you would see failures in the drawings or over simplistic art which kinda hinted that the show was rushed. \\n\\n\r\nCharacter development was good in the beginning until episode 7 minute 18, then it was crap for 6 episodes, and then it was fantastic.\\n\\n\r\nOverall I gave it a 7. They managed a lot without a big budget. Still, there were many fails too. I'm only giving it a 7 because of the last episodes.",
            "date": "2014-03-28T22:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 137655,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2661963.jpg",
                "scores": {
                    "animation": 4,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/n008head",
                "username": "n008head"
            },
            "url": "https://myanimelist.net/reviews.php?id=137655"
        },
        {
            "content": "I'm gonna make this quick. Samurai flamenco is meta as fuck. The show goes through three different genres throughout the entirety of the show. Starting off as a realistic if not somewhat parody based drama, then changing into a full force super hero show, and then pulling back and becoming somewhat of a psychological thriller(the final genre being the one to really make me appreciate the show). I think if I could rate the three different genre changes in the show I'd give the drama portion a 7, the super hero portion a 6, and the psychological portion an 8. If you like something thatdoesn't take itself too seriously but you still want to get something out of it than I think this would be the show for you. I got a lot more out of this show than I was expecting which I why I'm deciding to write my first review on Mal because of it.",
            "date": "2016-12-05T09:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 234933,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5494818.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BakuTakamine",
                "username": "BakuTakamine"
            },
            "url": "https://myanimelist.net/reviews.php?id=234933"
        },
        {
            "content": "This show is for people who are huge fans of Super Sentai/Power Rangers shows, and absolutely no one else. If you've never seen an episode of Kamen Rider, this show is not only not for you, but it's a little frustrated that you're even watching it at all. I had the misfortune of being that unwanted viewer.\r\nSamurai Flamenco is a pastiche show, though a poorly communicated one. This is not a spoiler. You will enjoy the series SIGNIFICANTLY less if you don't know this. I feel like the show wanted you to pick up on it the moment the genre switches for the first time,but because the writing is clunky and poorly communicated, it just feels like a plot twist. It is not a plot twist. There are no real \"plot twists\" in the traditional sense in this show at all until the real-world aspect comes back. If you think it's building up to a plot twist? It isn't! It really isn't. The answer to why all the nonsense in this anime is happening is \"hey, super sentai shows, am I RIGHT fellas\", and if you don't go in with this in mind, this show is going to rate a 4 and you will feel robbed of something. \\n\\n\r\nSo, a review:\\n\\n\r\nThe anime cycles through various different genres: The vigilante, the sentai hero, the sentai team, and, three more genres, before concluding on a regular action/drama arc that actually carries itself REALLY well, with none of the pacing issues that plagued the previous mini-arcs. Does it mean anything? I don't know! The rest of the series is so wildly disorganized and I know so little about the genre that I can't pin down any sense of quality or intention. This show is REALLY weird!\\n\\n\r\nDespite the garbled, senseless storytelling, the characters are strong, distinctive, and behave naturally enough, and I was rewarded for sticking it out for them with the last few episodes. Even as the plot fades into obscurity, the characters are still clear in my mind, and I find myself attached to them despite having zero interest in the show. The ending made me cry and I still feel happy and fond about them even now, years later.\\n\\n\r\nHm, what else...There's gay themes, but mostly as hands-off, \"if you don't want them to be gay it can just be a fun jokey-joke! No in-text reciprocating because that would mean something concrete! They're not gay they're just dudes being dudes! Lesbian whomst???\" coward's way of doing it. If someone recs you this show based on the presence of gay/bi characters, they're begging for scraps and you shouldn't trust their judgement, but it's still present and has real dramatic weight in a \"gay love saves the day\" sort of sense, so you can enjoy it for what it is. I guess. \\n\\n\r\nOverall, while I think the show wouldn't have been as interesting if it went from \"Vigilante\" straight to \"real-world action-drama\", I really wish the show had gone with 3 genres instead of trying to awkwardly speedrun through 7. It just didn't have enough episodes to do what it was going for. One of these genre arcs lasts an episode and a half. It was exhausting. 7/10 for lopsided viewing experience, saved from true mediocrity with the strength of the character writing.",
            "date": "2017-10-15T11:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 260854,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6627993.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/paperdarkfish",
                "username": "paperdarkfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=260854"
        },
        {
            "content": "Story 6/10\r\nFULL DISCLOSURE I did not watch episodes 11-18 for reasons I will elaborate on but please do not think I'm saying anything about those specific episodes - good or bad - because I don't know about their quality and I can only explain why I didn't watch them.\r\nThe story was weird in my opinion, like they couldn't quite decide on what they wanted to do. Personally I thought it started out really cute with the idea of him becoming a hero in his own way, even if he does'nt have super powers... and then a few episodes later aliens show up. It took mea little while to adjust to the aliens because I was all geared up for some Slice of Life/Action hybrid that would've been unique.  However, after the aliens show up and I got all used to aliens, then like twelve new characters are introduced and they go into space (or at the very least into a spaceship, again I paused watching here). This was my limit on ridiculous plot-switching. At that point I was kind of thinking \"just pick something and stick with it wouldja?!\"\"\\n\\n\r\nHOWEVER, episode 19 - 22 were so captivating and I highly suggest that if you are like me and can't take the space wars stuff, just skip to 18 and you miss no information that is pertinent to the remaining episodes. Trust me. The element of real crime pulled me back to the first few episodes where a regular guy is playing super hero, which is what drew me in in the first place.\\n\\n\r\nArt 6/10\\n\\n\r\nPretty standard in my opinion. Better than a lot of cheap looking anime and better than a lot of the new stuff out. If anything it just looks natural, not too stylistic, not too cheap which I'm just fine with. The animation was pretty fluid and detailed which I also appreciated but I wouldn't say that its something the anime should be known for.\\n\\n\r\nSound 5/10\\n\\n\r\nThe opening was okay and aside from that the sound was normal. Not a stunning soundtrack or memorable voice actors in my opinion but sound is pretty hard for me to grade because I'm not always readily looking for it.\\n\\n\r\nCharacter 7/10\\n\\n\r\nDefinitely well designed but also definitely had some flaws. The police officer had a lot of flaws actually. In a way he wasted his own redemption arc that the protagonist literally risked his life for and the ending kind of brushed it off like \"yep he completely ignored that important life lesson\". It's hard to grade the protagonist because of the gap of episodes I didn't watch. I thought he was cute though, very eccentric and funny. The other characters I remember being kind of one dimensional in the sense that yeah they were fine but there wasn't a lot to them.\\n\\n\r\nEnjoyment 7/10\\n\\n\r\nI'm thinking of rewatching it again just to see if my enjoyment of it changes it at. Sometimes with series like this you'll find its better the second time through when you can get a fresh look at it. At the moment, my opinion is that it was fine. I didn't want to gouge my eyes out and I wouldn't put it in a frame.\\n\\n\r\nOverall 6/10\\n\\n\r\nWhat can I say that hasn't already been said. Its a swing or a miss but I definitely think its worth trying out, even if its just one or two episodes",
            "date": "2017-10-04T22:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 259733,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6607965.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kiki-jiji",
                "username": "kiki-jiji"
            },
            "url": "https://myanimelist.net/reviews.php?id=259733"
        },
        {
            "content": "If Anime was a family, Samurai Flamenco would be that one cousin living in his parents' basement who's so wierd and awkward you can't decide if you should laugh at him or feel pity, but in the end it turns out he's a guy like us, only a bit insane.\r\n That said it's really difficult to juge SamFlam. Depending how you interpret it, it's either brain-damagingly stupid or refreshingly brilliant.\r\nThe story starts simple - a young guy wants to become a superhero in a non-super mundane world. He meets a policeman, who's a little weirded out by the idea but is eager to help theprotagonist not get arested/beaten up, and soon some more people sympathetic to the idea of superheroism show up.  But as you settle yoursef to watch Kick Ass: The Anime, everything goes full bananas (I made a pun!). Basically  it puts a fairly normal bunch of geeks in a world of often heavy-handed shonen/sentai parody with little to no continuity. The parody part is mosltly in \"so bad it's good\" teritory, while character developement and characters' reactions to the grand oddity their lives have become are treated seriously and with as much realism as possible. It creates a chaotic plot, jumping from one sentai trope to another whithout warning,  which is not bizzare enough to call it a mind-screw, but surely is pretty surreal. \\n\\n\r\nFirst I thought the plot is a pile of smelly kaka with chunks of a good slice-of-life now and then, but looking back I realised the genius of it, which I cannot describe whithout spoilers, so I'm putting my interpreation in SPOILER section at the end of this review. \\n\\n\r\nAs for other aspects, such as animation and sound, it's pretty standard - there are no grand desingns, super-fluent action scenes, or breathtaking backgrounds to marvel at, and music is so medicore you don't even pay attention to it. It seems the studio didn't put that much effort into making SamFlam, but it's good enough not to cringe. You're there only for the plot.            \\n\\n\r\nI did enjoy Samurai Flamenco very much, in a sort wtf-am-I-watching way. Slice-of-life parts made me invested and it had some moments when I felt tears coming up my eyes. \\n\\n\r\nSamFlam derailed, then blew up and now it's orbiting Saturn. It made me so hectic I couldn't sleep whole night after watching it. Surely one of a lifetime experience. I shall give it 8 Sit Downs/10. \\n\\n\r\nSPOILER TL;DR\\n\\n\r\nAfter revealing that Flamenco is a magical word making your wishes come true, everything falls into place. All that weird stuff happening was Masayoshi thinking how cool it would be if X turned out to be true and the universe did his bidding, that's obvious. BUT is goes beyond that. After the Aliens arc he's back to the mundane world and is immidietly targeted by a stalker who attacks Masayoshi's friends personally. Keep in mind Masayoshi is STILL reality wraper. But he couldn't wish to harm his friends and have a tragic backstory, right? Oh, but he does. The whole \"now it's sentai\" part of the show starts IMMIDIETLY after Masayoshi proclaming his parents' death doesn't touch him this much and cannot be his origin story. He thought instead \"I don't wanna this gritty Batman-style sh*t, I wanna fight mutants and aliens!\" and so he does. Then he ends up in space, and needs to deus-ex-mahina himself from there, so he imagines some grander power explaining what's going on and putting him back on Earth. I'm pretty sure he didn't meet the will of the universe or whatever you wish to call it, but Masayoshi himself is an irregularity strugling to wrap his head around why he's living in a real-life sentai, so he explained it to himself like he understood it - that's why the explanation is so all over the place, taking bits from Evangelion and Gurren Lagann. Masayoshi sure does like shonen (sadly he didn't see Haruhi Suzumiya). Back on Earth, the thought of tragic backstory started surfacing again, possibly because Masayoshi already used his favourite tropes and cannot think of anything else. And that's why it's so important that he rescues Goto as Masayoshi, not Samurai Flamenco The Godlike Abomination - SamFlam would be complete with a tragic backstory, but it's time to turn the powers off and go for real life. It's funny how his wish for nemesis got fullfilled - said nemesis was one of the kids who Masayoshi called troublemakers. He wished they would stop being apathetic, that they would love him, and boy, it turned out like a deal with the devil. Either that or during ep 7 Masaoshi had gone mental and that whole thing's in his head.",
            "date": "2016-03-09T10:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 212553,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118948.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snowley",
                "username": "Snowley"
            },
            "url": "https://myanimelist.net/reviews.php?id=212553"
        },
        {
            "content": "This one's a clever deconstruction that never really lands. The first few episodes are pretty enjoyable, and the scene where Guillotine Gorilla appears is truly horrifying and gruesome and had me eager for the next arc. But after that moment, which is in episode eight, things just get way less interesting. New characters with zero depth are introduced; the central conflict becomes increasingly ludicrous; and basically so much happens that it feels like nothing happens. If you like super sentai/Power Rangers stuff and enjoy seeing that deconstructed, this is a fine piece of fluff - if you don't expect too much of it. Otherwise itis a disappointment and I would not recommend.",
            "date": "2017-07-24T18:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 253700,
            "reviewer": {
                "episodes_seen": 22,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5690078.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/tennyson119",
                "username": "tennyson119"
            },
            "url": "https://myanimelist.net/reviews.php?id=253700"
        },
        {
            "content": "no joke this show was interesting to me with the mc trying to be a hero in what would seem to be a very normal world besides the mc having a goal to be a hero out of the sentai shows he grew up on i thought this was a interesting idea and thought sure for 12 episodes that could work little did i realize this was not what this show was going for. Around the end of episode 6 the show changed for the worse and went full sentai evil monsters and mechs with 16 more episodes of pure painful watching experiance  inever tell people to avoid anime but my god avoid this its not great or maybe this is totally your cup of tea.... who am i to judge but this was not for me",
            "date": "2017-01-03T13:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 237349,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Waifuhunter2",
                "username": "Waifuhunter2"
            },
            "url": "https://myanimelist.net/reviews.php?id=237349"
        }
    ]
]