[
    [
        {
            "content": "Kimi no Iru Machi is an amazing series. Amazingly mediocre.\r\nThe show is almost feels like swimming in an ocean of rage and frustration for many reasons. For a romance based series, Kimi no Iru Machi sure likes to play around with the idea but then twists it in all sorts of angles. These angles do not connect well in any way but instead ends up making a shape out of wrong proportions. As a follower of the original manga that began to ran years before the debut of this anime series, I am definitely not satisfied from what I see. It feels like I’m drowningin a sea of despair.\\n\\n\r\nKimi no Iru Machi (A Town Where You Live) is an animated series based off the manga of the same name written by Seo Kouji. The author is previously known for his other work, Suzuka that also received an anime adaptation based off of his manga. So now it’s his time to once again step it up and bring forth a romantic comedy for people to enjoy. Unfortunately, it seems like the series doesn’t step itself up but rather falls even further behind from the OVAs that debuted prior to this.\\n\\n\r\nThe series follows main male protagonist Haruto Kirishima as a high school student living on the countryside. As a healthy boy of his age, he falls under the category of the typical high school student with thoughts running through his head. These thoughts includes schoolwork, his future, and the obvious: girls. This is because Haruto has a crush on another female student. Will have the courage to ask her out? What happens if he gets rejected? Will Haruto ever become a man? These might be a few questions for thought for potential anime only viewers at first glance. However, this isn't’ exactly what you might expect.\\n\\n\r\nFor whatever reason, the anime decides to skip around and go straight into an arc that is covered later on from the manga. It’s disappointing given the fact that important factors and development in the beginning between Haruto and another main female protagonist are left mostly in unexplored territory. The series does pull out the old trick in the book as in the form of flashbacks. But honestly though, this doesn’t work well in terms of a romance developing series. For our main female protagonist, Eba Yuzuki, this is even more frustrating to watch because the lack character driven concept. It also doesn’t help by the fact that Haruto himself is not exactly one of those characters where we get to know from the beginning. \\n\\n\r\nAs for Haruto, the boy clearly has eyes set on a particular someone but not exactly whom you might expect. As mentioned before, this series skips around and omits parts from the manga that clearly accelerates its plot. As for Haruto, the guy seems to lack a personality and often acts reserved around others. He is caring on the outside but often makes rash decisions while observing from the backgrounds. It is not until he sees truly sees reality that he decides to act. Often or not though, this is met with mixed results. However, Haruto does carry responsibilities and follows him through. He is hardworking and cares about the well-being of others so some respect can be handed out to him. Out of the girls that Haruto meets throughout the series, Eba is a magnet for responsibility to be delivered. \\n\\n\r\nThe duo of Haruto and Eba is also awkward to watch as they don’t seem very compatible. Haruto seems to be a guy that often keeps thoughts to himself. On the other hand, Eba is a girl with a sociable personality that speaks out her mind and often not afraid to act on her actions. Again though, these lead to mixed results similar to Haruto’s case and leaves both happy and painful scars. \\n\\n\r\nAmong other characters in the show includes Eba’s younger sister Rin that seemingly causes mischievous trouble for the duo. It’s also silly to note that she is almost nothing like her sister. At the same time, she seems to be a pivoting factor in order to get Haruto to open his eyes to the truth that lies in front of him. Then, there’s also Nanami Yuzuki, a girl that Haruto has his eyes set on from the beginning. She is depicted as a kind and forgiving girl. At many instances, she offers advise to others but is a bit insecure to herself at times. Other girls in the show also plays their minor roles but mostly stays in the background. For Haruto though, his eyes only focuses on what he thinks is in front of him. What reality show him though is much more painful but again, he keeps it to himself. \\n\\n\r\nOne prominent feature of the story in the series also features a main supporting male character that plays a more of a tragic role. In fact, he is more of the influence factor to Eba’s decision as well as Haruto’s. The result of that influence though leads to sorrow but also some hope for Haruto; an unfortunate feeling for hope but nonetheless. But as far as that goes, the series decides to twist around with the aspect of romance again and presents it in way to almost beyond repair. Even if a series is labeled as romance with drama and comedy, it should at least follow a straight forward plot. No, instead it decides to jump all over the place and loses focus to the point where viewers might not be sure who Haruto wants to be with. Coupled with the lackluster of a sociable personality, Haruto is a man that is both hard to be empathetic with or take pity for; emphasis on either.\\n\\n\r\nOn the more drama side, the series also tries to make viewers feel sorry for its characters. However, it gets hard to take pity on them because the decisions they make. Sure, decisions often can result in consequences but I find the choices the characters make in this series to be outright abrupt with nonsense. It doesn’t help by the fact that the series rushes its primary plot so there’s little focus on background or character development. Instead, it focuses on Haruto and his daily life with other girls. The guy is responsible but he sure doesn’t take some of his relationships as well as such. This is especially true later on with another girl that some can see as a golden egg. Unfortunately, it's a just another egg wasted by Haruto.\\n\\n\r\nThe comedy factor of Kimi no Iru Machi is second rated. It often tries to mix in comedy with drama at the same time but this doesn’t work out. At other times, it tries the typical and cliched misunderstandings with factors of fan service. As a fan though, I don’t feel serviced or satisfied. The dialogues spoken by most of the characters also lacks flavor. Rin is perhaps one of the more curious girls that often treats Haruto’s life as a game so her dialogues tends to add a bit of interest. For the rest of the cast though, the words often a loop of dull expressions.\\n\\n\r\nFor a more slice of life style series though, there are some hopes. The feeling of countryside brings forth a feeling of nostalgia through most of the flashbacks played throughout the series. It gives off a sense of feeling in terms of simplicity. After all, living on the countryside is simple rather than in a big crowded city. Furthermore, there is some sense of realism in terms of relationships. Examples of this includes the consequences of a long term relationship, dealing with tragedies, and getting yourself back up afterwards from it. It can be relatable too in a sort of way especially if viewers have been in a relationship in the past or is currently in one. I just hope that you won’t make some horrible decisions as some of the characters do in this series. That’s not a pretty sight to see honestly.\\n\\n\r\nIn terms of artwork, Kimi no Iru Machi adapts a simple style with its characters looking natural but at the same time lacking any noticeable features. There’s noting particular standing out with any of the characters. Haruto looks normal and Eba is portrayed as the typical girl with a tip of naiveness. Given the fact that Seo Kouji is involved with the project, there’s also similarity in character designs between this series and his other work, Suzuka. The backgrounds does have a trace of naturalism to it though with the dancing leaves, souring winds, and seasonal weather.\\n\\n\r\nFor its soundtrack, Kimi no Iru Machi is amazingly mediocre. There’s almost nothing to praise about any of the VA’s performances. The main male protagonist Haruto (Yoshimasa Hosoya) seems to have tone of a mature character but his actions contradicts this. Most of the girls’ voices are typical with possibly Eba being the most outstanding with her somewhat elegant tone of voice. Music wise, the show does show some melancholy especially in regards to its flashback scenes. The OP song, “Sentimental Love” is presented with a calm tone along with traces of fan service and somewhat of hope for its characters. Its two contrasting ED songs brings forth a feeling of homesickness that seems to also walk down the memory lane. \\n\\n\r\nOverall, Kimi no Iru Machi proves to be a lackluster romance anime that jumped way over itself. Its ineffective writing coupled by its lack of characterization makes its frustrating to watch. If that wasn’t enough, Haruto and Eba isn’t exactly what I would call the best of couple. The message that it tries to get across never seems to reach if there was one at all. Maybe it’s something on the line of ‘the truth hurts’, ‘face the reality’, or ‘love bites’. Whatever it is though doesn’t work out right. However, it does bring forth some sense of realism with relationships that takes on a path of drama. If you decide to choose the path to watch this anime though, just be aware of what’s ahead.",
            "date": "2013-09-30T16:38:00+00:00",
            "helpful_count": 211,
            "mal_id": 114913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=114913"
        },
        {
            "content": "\"Manga is better than the anime, therefore the anime sucks!\"- Somehow, the logic of this sentence has been fairly incomprehensible for me. I haven't read a lot of manga, maybe that's the reason, but still, I believe that manga being better than an anime does not reduce the value of the anime! Kimi no Iru Machi is often overlooked, but if you believe that an anime can't sway your feelings (like me) you should try it!\r\nStory- 8\r\nHonestly, the story feels somewhat rushed and badly placed. You can sometimes feel that parts from the character's pasts are unnecessary,  however if you would stick to theend of the anime, you would see that it is not so. What is quite likeable, however, is that the cliches are scarce here. You can see very little of your classical-romance-events. It's a good combination of drama and romance though, which is often not the case. It's quite conclusive, so you shouldn't expect the bitter feeling of a cliffhanger ending.\\n\\n\r\nSound- 10\\n\r\nThere isn't really much to say here. It's quite clever how the main character's voice actor is the one singing the ending song, which is named by the anime, by the way. Beautifully incorporated melodramatic sounds just increase the somewhat saddening atmosphere. And the voice actors are definitely great picks, somehow, their voices match their personalities perfectly.\\n\\n\r\nCharacter-10\\n\r\nDefinitely the most likable thing about Kimi no Iru Machi. Worried about seeing cliche decisions made by cliche characters? Here, you won't see any of that. They make mistakes, they are uncertain, they are swayed by feeling, however they have hope, and they act when they feel like they should, the way they think they should. Feelings of love,hate,loneliness...they effect humans strongly. It's portrayed perfectly in this anime.\\n\\n\r\nEnjoyment-9\\n\r\nEnjoyment is quite a relative thing to talk about, honestly. What I can definitely tell you, however, the most interesting aspect of this anime is how it makes you feel, both while watching it and after finishing it. The deeper you go, the stronger the effect becomes. If you like that kind of thing Kimi no Iru Machi is a perfect choice for you. But if you fancy the funny,comedic atmosphere which often appears in romance-focused anime, perhaps this isn't the thing you're looking for. Definitely, one of the most memorable anime you'll ever see.\\n\\n\r\nOverall-9\\n\r\nAll things considered, perhaps this anime lacked time, as if though too many things were said in too little time. However, this does not affect it's value too much. It's very...strong. That's, I believe, a perfect word to describe it. Emotionally strong.",
            "date": "2015-07-02T04:23:00+00:00",
            "helpful_count": 63,
            "mal_id": 192021,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288489.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DomoB",
                "username": "DomoB"
            },
            "url": "https://myanimelist.net/reviews.php?id=192021"
        },
        {
            "content": "Okay this is a review for those of you have not read the manga and are walking in blindly, such as myself.\r\nKimi no Iru Machi (A Town Where You Live) is your basic romantic anime about your main character, Kirishima Haruto, and his love interest Eba Yuzuki. They have been childhood friends for a short period of time and they really bonded when Eba came back during the later years of her high school lift to attend school and various events befall them and get in the way of the love they have for each other, the most major being the distance between where thetwo live. Eba initially travels out to the countryside where Haruto lives but then has to go back to Tokyo, and this anime takes over from the OVA series where Haruto travels out to Tokyo to chase after Eba.\\n\\n\r\nStory: 7\\n\r\nI was really disappointed with how quickly they moved this anime along. They were constantly jumping around between past and present and never spent more than about 2 episodes on any particular event or moment. The rate at which the relationships moved along as well was frustrating as you never really got a great grasp of what was going on and how the characters really felt. What was good about it however was the ability for the viewer to be able to relate to the situation at hand. It was a fairly good setup, just rushed.\\n\\n\r\nCharacters: 5\\n\r\nThe way they rushed through the anime was really bad, and consequently that's how the characters have turned out. I mostly disliked all of the characters, but the one bright spark was the fact that you could relate to them in a way, regardless of the decisions they made. Kirishima Haruto is your fairly common main character, not much personality and just can't seem to let go of the main female interest. Eba Yuzuki is your typical bright, clumsy damsel in distress who needs someone around to help her all the time and to support her. Although I believe she was supposed to be a likeable character, I did not like her. To me she was just to needy and just made me frustrated with her decisions and the way she conducted herself, but I digress. Eba also has a younger sister Rin who comes into the story about halfway through. She has quite the personality as she is constatly pushing Eba and Haruto together, but I won't spoil too much about her and what goes on.\\n\\n\r\nArt and Music: 7\\n\r\nThe music for the anime was quite well chosen I believe, although nothing outstanding that would make you want to keep listening to it outside of the anime itself. The artworks are fairly good as well, but would've benefited from a little more time to get that smoother texture and brighter colours in general.\\n\\n\r\nOverall Enjoyment: 7\\n\r\nI did enjoy this anime even with all of its flaws. I do recommend giving it a watch, but at the same time be warned that it will feel really rushed and you will not have a lot of time to be able to appreciate the situations and get to know the characters really well. \\n\\n\r\nRecommendation:\\n\r\nFrom what other people tell me, they say the Manga is a lot better and ads in elements of comedy, as well as goes more in depth and is a lot more enjoyable overall",
            "date": "2013-09-29T03:14:00+00:00",
            "helpful_count": 42,
            "mal_id": 114659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Chacattack",
                "username": "Chacattack"
            },
            "url": "https://myanimelist.net/reviews.php?id=114659"
        },
        {
            "content": "Kimi no Iru Machi takes a look at the complex nature of relationships, and human desire by focusing on a childhood romance, and the complications and obstacles that the relationship has to endure. What this anime should be applauded for, is its look at how fragile our desires can  be, and the cruelty and selfishness that come as a result of it.  Of course, this also means that the characters are often unlikable and frustrating. This isn't an anime where you really like the characters, and if anything at all, it's more of a study on the ups and downs of relationships, andthe cruelty of love.\\n\\n\r\nThis is to say, this isn't the kind of material that is particularly enjoyable. But that doesn't make it bad by default. Even stories that aren't enjoyable, have legitimate merit as art. Afterall, not all romance stories are happy, and often in life relationships have hurdles and don't always end with happiness. These stories certainly should be told. Where Kimi no Iru Machi fails is in the final act and the overall pacing of the story. Because the story moves too quickly, there isn't enough depth given to the the main character's choice at the end, and it leaves the audience feeling frustrated and angry with the main characters. This again, doesn't make it bad. But the Manga tackled this subject a lot more seriously, and showed the consequences for this decision, and the new hurdles that arise when choosing your desires over others happiness. \\n\\n\r\nEssentially, the story just leaves you feeling terrible for the person that gets hurt, and frustrated and angry with the two lead characters.  They chose their desires over everything else, despite the consequences of it effecting people beyond them. Which again is fine, but the anime doesn't really give us enough weight to the decisions being made. We don't even get to spend time with the characters after the fact to understand these consequences. And the final  blow is that they essentially sweep it all under the rug, and try to pass it off as happiness trumping over everything, despite the consequences. Which again, fine, but we needed to see those consequences to understand the impact our desires can have on others, as well as why these characters are willing to suffer these consequences to fulfill their desires. \\n\\n\r\nInstead of looking at the impact of the main characters actions, the character that is impacted by this the most says that her love is so strong, she'll wait for the main character if he ever breaks up with the girl that was chosen over her. This on some level, looks at the idea that we can't always choose or control our desires, even if they will never be fulfilled or reciprocated. It's the cruelty of love. But the rushed pacing makes it feel like a cheap ploy to release the main character from his actions and set up an ending that is more digestible. However, this has the opposite effect, as it makes it feel like the subject matter isn't being taken seriously enough. \\n\\n\r\nOverall this anime has an interesting subject matter, but it doesn't take the time needed to properly study it.  This ultimately leaves us with a bunch of a unlikable characters, and a story that isn't particularly enjoyable. However, the story is brave in its subject matter, I just wish it was more brave in going further with it (even if it makes for an uncomfortable experience), because these stories are worth telling. I would have preferred the Anime to have pushed the uncomfortable aspects of love, and left us with an ending that makes us question our own desires. Instead it comes off like a story between two people that make bad decisions, and ultimately burn everyone down around them for the sake of their love.",
            "date": "2014-05-23T13:25:00+00:00",
            "helpful_count": 28,
            "mal_id": 144257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3728321.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AttackOnWaifu",
                "username": "AttackOnWaifu"
            },
            "url": "https://myanimelist.net/reviews.php?id=144257"
        },
        {
            "content": "First of all, let me start this review off with a question: Do you hate indecisive characters who have trouble choosing which person they love much like the characters of “School Days” and “Kimi ga Nozomu Eien?” If the answer is ‘yes,’ then I recommend staying away from Kimi no Iru Machi. If ‘no’ or if you’re unsure, then you can decide for yourself whether you want to watch this or not.\r\n“A Town Where You Live” is a romantic drama that differs from the norm when it comes to adapting manga into anime. Most anime start right from the beginning of the manga and proceedfrom there. I have not read the manga so I don’t know exactly where it starts relative to the rest of the story, but this anime starts from a later arc and instead uses many flashbacks to fill in the important details that happened prior to present events. This makes for some confusing switches in time periods and also results in a lack of connection to characters, especially the ones that mostly only appear in flashbacks.\\n\\n\r\nThe story of the anime begins with Kirishima Haruto, a country boy who is moving to Tokyo as he chases after the girl he loves, Eba Yuzuki. He leaves behind his friends and one of his other former crushes as he ventures alone into the big city to start his new life and his search for Eba. With him, he has brought a necklace which he hopes to give to her. Eba is a girl who is originally from Tokyo but due to family problems, bonded with Haruto on the few occasions she visited his hometown (one time was fairly short when they were young and another time she actually lived at his house for an extended period of time). Haruto starts living with his older sister, Aoi, and soon meets several other friends who go to his new high school, like his new female neighbor Mishima Asuka and the upbeat motorcycle-riding Kazama Kyousuke. Haruto begins his new everyday high school life while continuing to be an amazing cook and, most importantly, searching for Eba.\\n\\n\r\nAside from the inconsistent rhythm of the plot due to the many flashbacks which sometimes encompass entire episodes, I felt the plot also suffered from the characters' personalities. Haruto (as I mentioned at the beginning) is your typical indecisive male protagonist. Because of his indecisiveness, he ends up hurting not only the girls he is involved with, but himself and a few other people connected to the girls. Eba isn’t much better. She is also very indecisive and constantly tries to push Haruto away despite it still being blatantly obvious that she still has at least some feelings. These problems accumulate throughout the course of the show and end (in my opinion) with a rather unsatisfying and unrealistic ending.\\n\\n\r\nAs for the art, it’s unimpressive to say the least. The character designs are maybe the worst part of it as every single character’s face is just copied and pasted with a different hair style and color as well as different eye colors. Because all of their facial structures are exactly the same, every character has the same stupid looking smile (I think this is the first time I’ve genuinely disliked any anime characters’ smiles). As for the backgrounds, they are very colorful and add a lot of effect to the scenes which sometimes helps them but sometimes is overused and ends up making some scenes laughably overdramatic. By that I mean that there are only so many times when gusts of wind, lightning bugs, and sakura blossoms can show up at the perfect time before it seems to be more than a coincidence. The scenery around Tokyo and Haruto’s hometown however are much better and during the regular scenes, the scenery is much nicer and more realistic (as far as anime goes anyway).\\n\\n\r\nThe soundtrack consists of mostly instrumental pieces that sound generic in a romantic drama. None of the tracks stand out and the OP and ED are just average as well. The voice acting is impressive though as there are several different accents which (I assume since I don’t understand Japanese) the voice actors do well. It’s definitely clear even to a westerner like me that these accents are about as different as American and British ones.\\n\\n\r\nKimi no Iru Machi tries a little too hard to be a dramatic romance story. Whether it comes to the indecisive characters or the strange art style, the show just falls flat in almost every possible way and is nothing more than forgettable. I recommend skipping this or maybe trying the manga instead (I know I’m recommending something I have not read, but I would recommend starting at the beginning of the story instead of dealing with flashbacks as that seems to me like it would work a little better). Still as I said in the beginning, do not watch this if the thing you hate most in the world is indecisive characters in romance stories, because this will annoy you to no end if that is the case.",
            "date": "2013-09-29T12:31:00+00:00",
            "helpful_count": 15,
            "mal_id": 114757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=114757"
        },
        {
            "content": "Kimi No Iru Machi\r\nWhen i first time watched the first episode, i felt like i'm going to watch a real romance anime, but then everything started to go a little wrong for me. Actually the beggining is making you to continue watching as long as you'll recognize every single character.\r\nStory.\r\nThis anime has one of the most wonderful love stories ever. It shows how strong can be loving personality. And shows that love is stronger than any type of friendship. When friend challenges ill friend for his former girlfriend, that's really unbelievable. Actually if it was me, i would let him to die thinking that hehas won. The end of the storyline was wonderful, but i was hoping they would show Asuka in the end with someone handsome and made for her.\\n\\n\r\nArt.\\n\r\nCan't say anything good or bad about art, i think it was ok. Because in some animes because of bad art you star to hate that anime.\\n\\n\r\nSound.\\n\r\nEverything was beautiful, and sound is not an exepction.\\n\\n\r\nCharacters.\\n\r\nLead characters\\n\r\nI don't think they were made for each other. Even though when they were together they were making the cutest scenes of the whole anime, but they were really not made for each other. I don't know. I feel like Haruto and Asuka would be wonderful couple if Haruto loved her.\\n\r\nAbout Supporting characters. None of them had his/her own storyline here. Some animes also show stories and loves of supporting characters, but here no one actually deserved it, because i think everything was based on lead ones.\\n\\n\r\nOverall.\\n\r\nI'm really happy i've watched this anime because i've had 1000s of feelings watching this. \\n\r\n9/10",
            "date": "2014-12-20T21:08:00+00:00",
            "helpful_count": 11,
            "mal_id": 173361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4335541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AkumaNoSaigi1",
                "username": "AkumaNoSaigi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=173361"
        },
        {
            "content": "Ive watched this anime far back when it aired but today I decided to unleash my thoughts in this review here firstly the anime was a pile of trash and I am going to explain why:\r\nThe way they portrayed everything was so negative and sappy that I didnt know wether to cry or laugh, it was like watching those soap operas on TV .. It felt so rushed and half assed.. In one moment you have Haruto giving up and going home with his ass between his legs and then he has this sudden realization and starts running towards , guess who, EBA to spoutsome random shit from her house door, only to see in the window a peeking Eba with a regretfull face.. This repeated imense times troughout the anime and the Manga too.\\n\\n\r\nBut I guess its just Seo Kouji godly writing making the highlights again.. In case you dont know this men  was the one who created Suzuka wich guess what its like Kimi no iru Machi all over again, only the characters are slightly different.. Apparently Suzuka and KNIM are even from the same freaking story line.. Fucking amazing.. Its like Seo is making fun of its audience wiggling his troll dick around like a madman \\n\\n\r\nBut in this case its not entirely Seo´s fault.. The studio who adapted KNIM was GONZO .. One of the worst studios out there right next to Deen and Pierrot (Imo) .. And has I said above the anime was very rushed and you want to know why!? Because shrinking a 270 chapter Manga into a 12 episode anime (NOTE: EACH EPISODE HAS HARDLY 18 MIN) is fucking stupid.. An anime that had the potential to have atleast 26 episodes and then they could release 2 OVA with the aftermath to close it in a soothing way, but its Gonzo so we shouldn´t expect much.\\n\\n\r\nEven so its not like the Source material was good.. The story of KNIM is very infamous for its twists and forced drama.. The characters arent necessary bland and motivationless, actually quite opposite however they are so hateable for their stupid ass decisions and \"the power of bad writting\" behind that you end up like Umm what the hell? .. Midway trough Haruto forms a rivalry with a guy in the verge of dying only to accomplish his goals leaving the viewers thinking .. WOW what an asshole.. \\n\\n\r\nLike seriously the way that this anime takes itself is so laughable on the insight that anyone with a brain would bash it.. And despite all this I was definitely surprised that I managed to end the series, more so that I was actually entertained and fell in love with it in a weird way.. It was non-sensical and just teen drama at its best.. #BLAME SEO",
            "date": "2014-12-27T17:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 174643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3862171.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Moon-",
                "username": "Moon-"
            },
            "url": "https://myanimelist.net/reviews.php?id=174643"
        },
        {
            "content": "Has it ever happened to you? Sitting down to write something but you can't really seem to organize your thoughts? I have no clue whatsoever as to how to approach this one.. This anime to me is as strange as the vast universe we live in and i certainly don't mean that in a good way, as you may have gathered by my rating.\r\nAt first i thought there was something wrong with my neuron system, maybe my brain's wiring wasn't allowing me to enjoy this piece of art in a way that would.....Touch my soul or me strings or some other slang romance enthusiasts liketo use every other sentence. So i went to the hospital and had a doctor check me...The results were terrifying...I was in the terminal stages of bullshit intolerance and i've been told that this is an incurable disease but it won't affect my day to day interactions with people or animals for that matter.\\n\\n\r\nI left the hospital devastated, i had no fags, no money to buy some and i had parked my car 2 blocks away from the damn hospital. So as i was walking i tried to come in terms with this new disease of mine, tried to embrace it..So i thought to myself that all is not lost, i shall beat this fucker in the ass and be a normal kid again..I came back home, poured a drink and went to google, my old pal who knows everything about everyone, and suggested i should try a shock therapy..That sounded dangerous and to be honest i like a bit of danger. I'm not what you'd call and andrenaline junkie but i quite fancy the idea of chemicals causing my reptilian brain to go berserk.\\n\\n\r\nOf course this being a shock therapy wasn't a piece of cake..More like a piece of concrete falling from a 3 story building and hitting you on the head leaving you for absolutely dead.\\n\\n\r\nAnd this is where A Town Where You Live comes in...From the very first episode it attacks your senses like aids attacks your immune system and if you don't know what aids does to you, why don't ya ask Freddie Mercury how that went? Well you can't cause he's dead but anyway.\\n\\n\r\nAnd the first wave of attack comes in the form of animation..From the very first seconds the animation was like a night out at Vegas with a tablet full of acid. You are still able to see things but you see in waves of blurriness and with no sense of real focus...And of course hallucinations are a nice touch as well. What i want to say is that the animation is close to atrocious and weirdly colored and blurry and it gave me eyes herpes. The characters themselves are well drawn don't get me wrong but everything else is not good, at the very best it's basic. I'm not sure if it was a copy issue or anything of that sort but it seemed wayward to me.\\n\\n\r\nThe second wave comes in the form of the characters and the story hitting you in turns for maximum impact, maximum amounts of vomit and massive internal injuries. The story goes like this, once upon a time there was a boy named Haruto and lived with his parents in the countryside..One fateful day a girl named Yuzuki came to live with them..No it's not like that you idiots get your mind out of the gutter..She was the daughter of a friend of Haruto's father or something like that..Anyway Haruto is plain and simple an annoying twat. He treats her like crap and for no obvious reason other than him being an asshole. Sure one can make the case that Yuzu is a klutz and a helpless case who can't do anything on her own, from walking in a straight line to breathing without the help of a special committee. So Haru has to help her with everything..Keyword here being \"help\"...Simply put he is one of those guys who go after broken people so he can fix them in the hopes of them not leaving him.....So one thing leads to another and they ended up together? I'm still not sure on the details but that's what happens..She then leaves for Tokyo and after some time of long distance relationshiping she found someone else.\\n\\n\r\nIs anyone here surprised? Nope? Well hear this and be amazed at the idiocy that this anime has to offer...Haru being a creep and a stalker among other things decided to MOVE TO TOKYO to find her...Got that?\\n\\n\r\nFrom that point on some insanily stupid stuff happen and Haru jumps from girl to girl while always being in love with Yuzu and still being an obnoxious fuck with no moral restriction whatsoever.......Other characters you say? Well yeah silly there are other characters..His hot sister being one and Yuzu's redhead hot sister as well..Oh yeah there was another one who went by the name of Kazama and he, He was a damn likable character. He was an aquaintance of Haru's sister and they became friends..And guess what? They killed him off...But before they did that they had to make him the 3rd wheel and the one Yuzu dated while in Tokyo.\\n\\n\r\nSo animation that can kill life organisms 2 galaxies away, a story made possible by an angry teenager on drugs and characters that are as believable and relatable as Spongebob..Music and VA was....There..\\n\\n\r\nNow i know this review wasn't as long or as full of details as you'd expect but i simply cannot put every single thing that is wrong with this anime cause the servers of the internet would explode..Do you want that? But then again i'll give this anime the pro of being at least a bit realistic..I mean people are shit and they do shitty things and they use each other to get what they want and they fuck you in the proccess..That's an unwritten rule of human relations. On that front it did well, mind you that's not saying much since most times it ditches realism for downright idiocy but at least it tried and i'm a nice guy!\\n\\n\r\nI can't and won't reccomend this to anyone, even to people that i hate with a burning passion. But then again there are people out there with little to no sense so don't blame me, blame the world we live in and the society like everyone seems to do these days.\\n",
            "date": "2019-01-10T06:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 298629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339890.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Dionkeykong",
                "username": "Dionkeykong"
            },
            "url": "https://myanimelist.net/reviews.php?id=298629"
        },
        {
            "content": "This is a review for Kimi no Iru Machi, the TV series that ran in 2013. Before that, 2 episodes called Tasogare Kousaten (Twilight Intersection) were released. Two OVA came after this in 2014. If you want to watch all of them, I suggest starting with Tasogare Kousaten, then this, then the 2 OVAs. Tasogare Kousanten comes a bit before this in the story, and the 2 OVAs adapt chapters that were released later on.\r\nBefore I start, I would like to mention that this is another review of Kimi no Iru Machi from a manga reader. Actually, I wonder if anyone DIDN'T read the mangabefore the anime. It feels like a lot of people read the manga, heard about the anime and told their friends not to watch it afterwards.\\n\\n\r\nIt is by far my lowest rated anime on MAL, and there is a reason for that. This anime feels lackluster. It fails in all categories to deliver a minimum of what is expected from an anime to make in enjoyable.\\n\\n\r\nLet's start with the story, for which I gave it a 5. The only redeeming thing about the story is that it stays the same as the source material. What is wrong about it? First, we skip all of Hiroshima to skip straight to Tokyo. You heard right, we skip a third of the manga and 90% of character development and go straight to the second part of the manga. Some of the chapters from Hiroshima were shown as flashback, but not nearly enough to understand why the events in this series are unfolding. There's also the fact that this anime wanted to cover the most chapters possible, so makes for a very rushed story with essential scenes left behind. The ending also felt incomplete, as there are a lot of things that are left unresolved in the manga at this point.\\n\\n\r\nThe art is a 6. It was actually an 8 until Episode 12. The characters looks from the manga are well adapted, but the animation is weird. The opening is one of the parts where it looks the weirdest, and it's the only part you have to watch 12 times. The center part of the animation is usually nice, but anything that's a bit peripheral to it or in the background looks horribly rushed. The still frames are beautiful, and the ending does a nice job of blending in the author's drawings with some photography in the background. One of the finer points that bothered me were when the characters' mouths stopped moving for some unexplained reason during random scenes, and black and white still frames that started showing up during the last few episodes, a lot of them in episode 12.\\n\\n\r\nThe sound deserves a measly 3. The music felt really out of place in this. The OP and ED are terrible and fail to set the right mood, if any, for the anime. The voice acting for Haruto was nice, with a thick accent and an unpolished vocabulary, it gave a vibe similar to an \"redneck\" only a bit softer. The other VA had nothing special, and were lacking a lot of emotion during key scenes. It felt like watching two animated dolls talk to each other.\\n\\n\r\nAs for the characters, I won't drag on it. It gets a 4 mostly because of the shortcomings of the story. The fact that they skip straight to Tokyo does not allow for any development that would have been necessary to understand the characters' decision and motivations. Some of the characters, like Asukara, are briefly introduced then swept aside. Same goes for Akari and Kanzaki, that were more present during Hiroshima. Also, a certain key character that has a key role in the anime has not appeared, and it's a shame because it explains a lot of things between Haruto and Asuka. Introducing it would probably not have given it enough time to make it to a conclusion within 12 episodes, so I can understand its absence.\\n\\n\r\nThe last criteria is enjoyment, which got a 3. I feel like this is really brought down by the fact that I expected an anime that would be as enjoyable as its source material, which it was not. It is not the first time that I watched an anime based on a manga I already read, but it's the first time I am so disappointed with it. I usually like romantic stuff, both comedy and drama, but what I got here was useless drama and akward scenes.\\n\\n\r\nOverall it deserves a 4. It is an anime adaptation, but it's most certainly not a good one. It does have some novelty elements but it is far outhweighed by the overall lack of quality. If you read the manga, you don't need to watch this, and you'll be happier if you don't. If you haven't but like seinen, romance and drama, pick up the manga instead.",
            "date": "2015-03-17T20:57:00+00:00",
            "helpful_count": 9,
            "mal_id": 182573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3642571.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LunarFire",
                "username": "LunarFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=182573"
        },
        {
            "content": "I know a lot of people say to read the manga because it's \"better\", but it's for good reason.\r\nPeople who haven't read the manga may see us as some original source elitists, but you will never be able to experience everything the mangaka had to offer and his style of writing drama, through an the anime that plows through entire arcs within episodes.\r\nThe manga was like a roller coaster of feels that spanned through years of years of Haruto's life. However, the anime is just like a compiled highlight reel of all of that, and because of it, the effect is not as great.\r\nKimi noiru machi is a manga that a lot of other \"romance\" and \"harem series don't really like to go through. It goes through relationships and breakups until he finds the one who he really feels that completes his life. This is shown through spanning arcs in the manga and you can really feel the sense of living his life as he goes through highschool, moving, graduating, and then living on his own.\\n\\n\r\nSadly, the anime only has 12 episodes and it becomes difficult to capture that sense of time passing by.\\n\\n\r\nFinally, I'm not saying NOT to watch the anime, but it would be great if you all gave the manga a chance. I've read the manga twice and it made go through a variety of emotions and sometimes making me flip tables literally xD. I feel like it would be fun to share that same experience, so that's why I took the time to write this up!\\n\\n\r\nHappy reading everyone!\\n\\n\r\nThanks,\\n\r\n-morekawaiipls",
            "date": "2016-10-15T09:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 231830,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3345341.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/morekawaiipls",
                "username": "morekawaiipls"
            },
            "url": "https://myanimelist.net/reviews.php?id=231830"
        },
        {
            "content": "Disclaimer: I am not reviewing the manga, nor will I be basing this review on the accuracy of this story when compared to the source material, I am simply writing a review for the anime. \r\nNow obviously, the very nature of reviews are anecdotal, but I hope that you will bypass all the other reviews that rate this show low, because to be frank people are f**king idiots and incredibly biased, don't listen to them, listen to me, the smart one. Okay, now that we have that out of the way, lets begin the review. \r\nReasons You Should Watch This Show: The realism ofthe relationships and situations portrayed in this series consisting of only 12 episodes and 4 OVA's are relatable and thought provoking. If you're anything like me you try to find as much meaning in a story as possible, and in my opinion the best selling point of this anime is in the way the story is told, and the ability to sway your emotions throughout the anime, as well as make you question the actions taken by the characters and whether or not they are the wrong or right ones; the ones you would take had it been you in their situation.\\n\\n\r\nStory: The story isn't perfect, but it's far from bad. The story consists of the MC trying to figure out his heart and the lengths he's willing to go for the girl he loves. I really enjoyed the concept of the story and the amount of meaning that can be found within the plot. One issue some people had is that the story was a bit rushed compared to the manga, and to a certain extent I agree that at times it did feel rushed, but nothing too bad. 7/10\\n\\n\r\nCharacters: One of the best parts of this show is the characters, as the story goes on all of the major characters are developed. As they get older they act different towards each other and show their feelings differently. Just like most anime's though, the MC makes a lot of stupid decisions that could have easily been avoided, and although the characters are great, due to the 12 episode run time you miss out on a lot of potential character development. Imo though, I think this anime did the best job it could do on developing characters within such a short period. In addition you have 4 OVA's focused on tying up loose ends and providing extra backstory. 9/10\\n\\n\r\nSound/Music: The soundtrack written by Keiichi Oku fits the atmosphere nicely and there are plenty of great songs that stand out in their own right. The OP and ED are bomb as well. As far as voice acting goes, the Japanese actors did a phenomenal job portraying their characters. 8/10\\n\\n\r\nVisuals/Animation: The art is very unique and is very pretty at times, though I noticed that the animation can be lazy. For example, they won't animate the characters talking if it's at the end of a sentence and the camera pans back to them. If you are familiar with the Monogatari series, the animation is very similar but not as \"edgy\". 8/10\\n\\n\r\nEnjoyment: Overall I related a lot with the main character and the decisions he ended up making. I really enjoyed the way the story was told, it was predictable at times but it also had a lot of unpredictable moments that had me eager to watch the next episode to find out what would happen. If you're into romance and are looking for something to relate to, this anime is for you.   \\n\\n\r\nStory: 7/10\\n\r\nCharacters: 9/10\\n\r\nSound/Music: 8/10\\n\r\nVisuals/Animation: 8/10 \\n\r\nEnjoyment: 10/10\\n\\n\r\nFinal Rating: 8/10",
            "date": "2016-12-30T02:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 236943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4752507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nekoksyo",
                "username": "nekoksyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=236943"
        },
        {
            "content": "I am strictly reviewing the anime with no comparison to the manga (it would be so much worse) Let me start by saying the synopsis of this anime, about Nanami, was probably correct for like 2 episodes...  \r\nI thought about quitting this anime several times and then thought \"I really want to see how they plan on ending this\". I am disappointed but I don't hate it. I was confused for the first 2 episodes, got a grasp of the story and then when \"war\" was declared between ex and current boyfriend over MC love interest, it was all over for the story line.\\n\\n\r\nThe only thing it had going for it was the majestic ED and the fact that the MC was mildly swoon-worthy. So let's see here... this is what I got from Kimi no Iru Machi\\n\\n\r\nFall in love with people because they are useless and annoy you\\n\r\nAlways date OFF screen\\n\r\nBreak up because you love each other\\n\r\nDating a sick kid is not cruel\\n\r\nIf you move to a town where your ex lives, like a stalker.. you become a top notch boyfriend instantaneously.. \\n\r\nDate the perfect girl and dump her for the girl who left you\\n\\n\r\nThe story was pretty simple which makes me wonder how it could have gone sour so quickly. A country boy meets a city girl, they live together, she moves away and boy pursues in the name of love. We get a bunch of side characters who we have no development on and a series of side stories that do nothing but show how desperate Haruto is. The creepy sister had some screen time but she served no purpose. Asuka didn't get enough screen time for me to feel sorry for her. Haruto is a mild stalker and love enthusiast on several levels. The ending was horribly predictable and not the predictable that you hope happens either. It would have been more effective to write \"F** the Haterz\" across the screen at the end.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-04-29T22:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 186804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551475.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Utsusemi1",
                "username": "Utsusemi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=186804"
        },
        {
            "content": "Kimi No Iru Machi or A Town Where You Live in English is a 13-episode anime series adapted from a manga. Our main protagonist something year old Haruto Kirishima transfers to Tokyo in pursuit of childhood friend and girlfriend Eba Yuzuki. Eba unexpectedly leaves Haruto’s home town Hiroshima and after a short while broke up with Haruto for unknown reasons, Haruto eventually tracks down Eba and demands an explanation for breaking up.\r\nThat’s about as much of the story I can give away without spoiling it. A Town Where You Live was released back in the summer of 2013 and was the last series of thesummer line up that I wanted to watch. I only read the story briefly and I just assumed it would be a complicated love triangle, turns out I was right. So let’s go in to some detail.\\n\\n\r\nWhen watching the first episode I was drawn in entirely by the character designs and animation, it was very shiny and a visual treat for the eyes. I thought that regardless of the story the visuals would make up for it. I was wrong. The story is clichéd and soap oriented which made it hard to watch at times. (A soap is a weekly television drama for those who don't know)\\n\\n\r\nThen comes the god-awful characters that mess up the show entirely for me (with the exception of a few) I will start off with the biggest and main problem of the series which is Eba Yuzuki, she is undoubtedly the worst female character I have ever had the displeasure of watching for over 4 hours. Not only is she the dullest, most mind numbingly boring females leads I have ever seen, she is also one of the biggest bitches in this show! (Granted it was only her and her step-sister)\\n\\n\r\nWe also have our main protagonist Haruto, who needs a slap to help him get over his simplistic and shitty ex-girlfriend. Haruto has a common personality; he just seems like your common everyday nice guy, who is also lucky enough to get the attention of a few female characters in the show, but never acts on it. He has good cooking skills and his friends encourage him to become a chef, though he see’s cooking as more of a hobby. (Essentially, he's a boring twat)\\n\\n\r\nOther mentionable characters include Kyouske Kazama a very cheerful guy who dreams of becoming a motorbike racer. His dreams are unlikely to happen because of his illness. (Anaemia) Kazama became friends with Haruto after giving Haruto some words of inspiration and encouragement not to give up on the woman he loves. Haruto finds out later that Kazama is dating Eba and the two begin a rivalry to win over Eba, the two are still very good friends though.\\n\\n\r\nFinally we have Asuka Mishima who is Haruto’s neighbor when he moves to Tokyo to live with his sister. She and Haruto first met when a misunderstood Asuka thought he was a thief and attacked him with a baseball bat. The two eventually became friends and later began to date one another. \\n\\n\r\nI don’t know whether the creator does it intentionally to make the two main characters so unlike-able. The main character is incredibly plain and generic. The supporting cast does a much better job; they are much more easy to relate to and have at least some desirable character traits. \\n\\n\r\nProbably the greatest thing about this show was the animation. I mean Wow! When looking back at Gonzo’s previous work like Saikano or Full Metal Panic you can just see the drastic change in beauty. The one thing you cant fault about this series is the animation. \\n\\n\r\nThe sound of this anime was good I was content with the plate of music put in front of me, the opening theme is very good and I didn’t feel compelled to skip it after so many episodes. The ending theme was also likeable but I skipped it every now and then.\\n\\n\r\nThe reasons why I felt that this series was bad because of its mundane characters, overuse of a love-triangle storyline and the flawed execution. This series was not trying to attempt anything new, the pacing of the series was not to the right standard which can annoy the viewer and the only redeeming quality of this anime was the animation. This series was likeable at times with moments such as: the relationship between Haruto and Asuka plus the rivalry/friendship between Haruto and Kazama. Sadly those moments were insignificant on the train wreck that was ‘A Town Where You Live’.\\n\\n\r\nOverall I did not like this anime it has one redeemable feature (animation style) that is not worth watching for this shitty, overused and stereotypical love triangle/love dilemma that occurs within this show. I would not recommend this to anyone unless they are fans of drama/romance genres. This show deserves a score of 5/10.\\n\\n\r\nThanks for reading guys \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-02-01T08:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 131013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2322793.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Honest_Senpai",
                "username": "Honest_Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=131013"
        },
        {
            "content": "I am really into the romance genre, and I thought that this was interesting enough to peek my interest. After a certain cliffhanger happened, I decided to read the manga instead, although while waiting for episodes to come out, I also finished the anime.\r\n...Turns out that the anime pretty much botched the story, but you wouldn't know unless you've read it. If I haven't actually read the manga, I might've given this show an average rating like 6 or 7.\r\nIn the anime they begin the story in the middle of the story of the manga, and they bring back the very beginning of the mangaby scattered out in flash backs.\\n\\n\r\nThe show doesn't give the characters enough time to develop and grow, so they are mostly bland and expressionless. \\n\\n\r\nOverall, I would just stick with the manga, but if you are willing to watch a mediocre romance show with some serious tones (which there isn't that many) then you could try this.\\n\\n\\n",
            "date": "2014-06-13T21:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 146915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1264963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Daidus",
                "username": "Daidus"
            },
            "url": "https://myanimelist.net/reviews.php?id=146915"
        },
        {
            "content": "This anime was an interesting one to say the least. It had many flaws but also many pros that made it an enjoyable one to watch.\r\nStory:\r\nThe story of this anime was good, but in my opinion, it lacked clarity. Often throughout the anime, you find yourself confused or puzzled in regards to what is actually happening. Constantly, there are flashbacks that generally complicated the story and ultimately made it hard to follow. In my opinion, i did not hate the story. Instead, i quite enjoyed it despite the countless flaws that were present. \r\nArt:\r\nMany can criticize the animation by saying that the characters and settingwere poorly drawn. However, i could argue otherwise because i honestly believe that the animation in this anime was not bad. Although, there were many parts that were terribly done, i would still say that the art was not bad. If i were to give my honest opinion, i would say that the art was fair. There was nothing special as the anime contained simplistic animations and ordinary color use.\\n\\n\r\nSound:\\n\r\nThis was probably the best thing the show had going for it. Oddly enough, i quite enjoyed the music and sounds used within this anime. I felt as though the producers used music/sounds effectively draw out a particular mood within the anime. \\n\\n\r\nCharacter:\\n\r\nThe characters were good, but was not excellent. At times, it is seen that the characters lacked substance. In other words, it can be seen that the producers rushed the development of the characters resulting in dull and vague personalities. Personally, i did not mind the characters, but i do feel as though they could have been developed more. \\n\\n\r\nEnjoyment:\\n\r\nI could honestly say that i enjoyed this anime, despite all its flaws. There were easily more cons than pros in this anime, but even so, the anime was one that was quite amusing to watch.\\n\\n\r\nOverall:\\n\r\nAs a final statement, i can say that this was a good anime. To anyone who enjoys watching anime that involves romance then this is definitely one that is worth checking out. After watching this anime, i can honestly recommend it to everyone as it was one that was quite enjoyable.\\n",
            "date": "2014-08-12T22:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 156361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778465.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/phuynh1997",
                "username": "phuynh1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=156361"
        },
        {
            "content": "Kimi Ni Machi Iru is a finely paced romance about Haruto, the protagonist, searching and hoping to reunite with an old flame. The audience is strung along the main characters quest as he tries to reconnect with his long lost love, with many questions, secrets, trials and tribulations along the way. Romance stories, or at least good ones, are always roller coasters to say the least and usually are always told in the same way. However, Kimi Ni Machi Iru finds its way to reuse the old methodology and turn it into a new refreshing tale of love. Watching the main characters journey unfold isdefinitely worth watching. \\n\\n\nStory: 8.3 -\\n\nThe story isn't innovative by any means, and it usually revolves around the same concept. A good way to compare Kimi Ni Machi Iru is like comparing it to a Korean Drama show. They always tell it the same way, but it is how they use it, is the key to success. Throughout the story, there are well placed literary devices (symbolism/foreshadowing/irony etc.) and without a keen eye, one could miss out on a completely well developed scene.\\n\\n\nAnimation: 8.5 -\\n\nThe art direction definitely has a stylized theme to it, from hues or rather colors depicting the mood and setting of the situation or scene to, warm, calming and serene pastel like colors. Oftentimes, there is no attention to detail, which can be confusing and the question of why it couldn't have just been consistent arises, however overall, it does deserve an honorable mention.\\n\\n\nCharacters: 8.3 -\\n\nThe characters are probably the hardest thing to rate in Kimi Ni Machi Iru, and it's definitely going to be opinionated. Each character in the story are very like-able and most likely the audience will end up choosing their favorites (Here comes the rage!). Get ready to see the males name x females name on youtube or comment posts, although the story is most likely predetermined. The characters display their emotions quite vividly, which is also complemented with the art &amp; animation, which can be truly taxing on the soul. These characters deliver a very realistic and very human emotions, that often the viewer can definitely relate to, even if sometimes we might not agree with from a story standpoint or perspective. \\n\\n\nWow Factor: 8.5 -\\n\nKimi Ni Machi Iru does not disappoint and will keep the audience quite amused/engaged until the very end or perhaps just the opposite, to people who compare it to the manga. The story and its characters in it will take you for a heart felt, possibly tear jerking melodramatic journey that is absolutely worth a watch.\\n\\n\nFinal Grade: 8.4 / 10 - &gt; 8 (Anime List)\\n\n+ Good use of Literary Devices (Used in story telling, ex: Foreshadowing, Symbolism etc.)\\n\n+ Good use of flash backs\\n\n+ Opening Intro &amp; Song (MIMI MEME MIMI - Sentimental Love)\\n\\n\n- Sometimes too easy to read &amp; generic of whats to come\\n\n- More consistency with the Art style\\n\\n\nReview by: AzurexSky of AniRaters",
            "date": "2014-01-12T16:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 128549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439279.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/azurexsky",
                "username": "azurexsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=128549"
        },
        {
            "content": "Kimi no Iru Machi - a twisted love story.\r\nI'll just start off with saying, I haven't read the manga yet, so I'm not going to say anything about the manga. The anime however, was a whole different animal in essence and I personally felt that the animators did a poor job on this then they have with other works I've known them to do.\r\nThe Plot ~ \r\nOverall the plot depicted by the anime is ok. At first the fast pace of the anime had me entertained, but as I progressed through the story I realized just how down to earth and simple it was. Therewas a lot of going back and forth between past and present, and sometimes this was pieced together in a way that simply became incomprehensible and incoherent to the manga. \\n\\n\r\nThe story itself (as depicted by the anime) seems downright flawed and cruel, basically weak-willed boy (Haruto) has his girl (Eba) cheat on him, he wants her back but she's with a friend of his who's about to die, so he's stuck with a dilemma. So he hitches another girl (Asuka) nearby. Then he cheats on that girl. \\n\\n\r\nSo between the characters cheating, that really all they let you see in this anime and its kind of depressing as a whole. \\n\\n\r\nThe Art ~\\n\r\nThe art wasn't that bad. It seemed more like Modern Shoujo to me. There seems to be this presence of \"static\" in the motions created by the animators, but this should not diminish your viewing of the anime--just minor lighting aspects could have been tweaked to make the anime more bold and color-appealing like other animes.\\n\\n\r\nThe Sound ~\\n\r\nThe OP and ED aren't half bad for this song. I gave this a 9 out of 10. The anime as a whole could've used more string orchestra sound tracks in my honest opinion. \\n\\n\r\nCharacters~\\n\r\nThis had me pretty sad. Not only do the animators show you so little of the characters' character, but also the fast paced story doesn't give you time to breathe and analyze the characters as a whole.\\n\\n\r\nHaruto basically lacks a pair and when he gets it he's stuck with a dilemma of friendship. At first I pitied him because Eba leaves him, but towards the end I kind of understand why. I hated him when he cheats on Asuka and doesn't do anything when Asuka confronts him. To be honest when they were coming clean to each other I wish Haruto got up and stopped Asuka from leaving, beg her and tell her he was sorry and tell her not to leave.\\n\\n\r\nBut then again, thats another story.\\n\\n\r\nEba more or less PMS's half the story. First she likes Haruto like crazy, then she likes this other guy, then she wants to steal Haruto back when Haruto's going out with another girl? What's her problem?\\n\\n\r\nAsuka is perhaps my favorite, as she's the most human and understandable character throughout the entire anime. She portrays the every day girl, in essence, and when she is betrayed she is the only character I actually was able to sympathize with.\\n\\n\r\nRin is your archetypal tsundere. She likes Haruto and hates her older sister, and yet gives Haruto advice and even aids the two in getting back together. I don't really understand her--why doesn't she just grab Haruto herself?\\n\\n\r\nAs for the rest of the characters--I can't really say much. And the reason is because the animators failed to show more of each character--the only image you're able to grasp is a shallow image of one.\\n\\n\r\nOverall ~\\n\r\nTo be honest this piece could have used more work.\\n\\n\r\nIf you like twisted and denied Romance then this is the anime for you. 3.5 out of 5 stars for the undeniably twisted and cruel Romance \"Kimi no Iru Machi\".",
            "date": "2013-11-20T19:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 120937,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2094831.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jayex",
                "username": "Jayex"
            },
            "url": "https://myanimelist.net/reviews.php?id=120937"
        },
        {
            "content": "Kimi no iru machi is an interesting anime about a teenager (16-17) who falls in love at a young age to another teenager who had moved from Tokyo to the countryside but she then has to return to Tokyo. The protagonist then becomes an adult pretty much and goes to Tokyo to chase after the girl of his dreams. But of course it's not that simple, the protagonist is lead through multiple emotional hurdles and it's up for him to decide, if giving up relationships is worth continuing his venture for his love.\r\nStory: 8 \r\nThe structure of the anime is quite unique and at firstI found it sort of annoying and almost didn't understand how they were going to fit everything in as there were constant flashbacks but the further you get into the anime, the more you can understand and respect the flashbacks as they actually add a reasonable amount of character development; slowly releasing some information to add contextual value to the current point you're at. I've seen this outside of anime but not too often in anime so it's nice to see some more structural techniques in that regard. In addition, the anime is split in half meaning halfway through the anime there'll be a huge leap in time, I think was two years (could be one) and the protagonist went in a different direction to then return back to his original direction through an interesting process and the moral at the end of story was quite nice. And that leads us to the ending, personally I was quite happy due to the sour but sweet ending leaving really no cliches and actually came to a conclusion. Meaning, no cliffhangers.\\n\\n\r\nCharacters: 8\\n\r\nIn regards to the characters, I felt the protagonist Kirishima lacked good character development probably due to the squeeze upon the content in the first half of the anime but he has good qualities, which definitely brought interest at least and for some perhaps respect for what he was trying to achieve being hooking up with Eba. For example, his dedication is admirable and the troubles he went through to achieve his goals are relatable. Should I break this friendship to be with my love? Those sort of troubles/decisions. Character wise for Eba, the girl who the protagonist is trying to hook up could be seen as missing contextual value and etc but honestly I think this was done on purpose because we're slowly feed context about her at particular times and some may detest that but honestly I think it creates a bit of a hole, but a hole you wish to fill. Even at the end, we don't fully understand her and I think that's great because it shows the future isn't going to just be smooth sailing but a normal typical relationship that has its ups and downs. In addition, not fulling understanding her makes you want to know more and for the context they do give, it's more valuable. In that regard, you'll either love it or finding it irritating so you'll just have to find out yourself.\\n\\n\r\nArt & music: 6.5\\n\r\nMusic was quite nice and executed at appropriate times and additionally the art was nice but lack true colors, in other words it came off almost mildly washed out or bland, which was disappointing since the actual art is nice but it's just the colors. I'm not saying it's awful, most definitely tolerable but it could of been more colorful.\\n\\n\r\nConclusion:\\n\\n\r\nDefinitely would recommend to people a fan of romance, I'd considered it a must but definitely isn't a masterpiece. But honestly, the rushed areas at the beginning weren't nice; in fact the anime should of added more episodes because this problem occurs all the time where developers shove too much content into episodes. But the characters are memorable for their goals and it's definitely a chill anime to watch so check it out at least.",
            "date": "2017-06-14T15:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 249913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5324000.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheOddFox",
                "username": "TheOddFox"
            },
            "url": "https://myanimelist.net/reviews.php?id=249913"
        },
        {
            "content": "A love story that takes on not only the uplifting side of love, but the ugly sides as well.  Leaving out what a lot of other series only let brush across the surface, this one does not shy away.\r\nYou still end up with a romance story.  One that's filled with childhood roots, unrequited love, and returning memories.  Tied into that however, you get to see different kinds of love in it's stages.  While most stories will let unrequited love just sit as tension in the plot, you get the chance to cycle through it here.  There are still some displaysof it, but it takes the step and goes beyond that as well.  \\n\\n\r\nStory; 9/10\\n\r\nThe fact they're willing to show the sides of love that most people are not really brings some realistic feel to how it all plays out.  You get to see unrequited love, blossoming love, breakups, and what it's like to just not be with the right person.  It really challenges how you should reflect on situations that you are in.  If the story jumping around a lot early wasn't a little of a mess in terms of pace, I would have given it a 10/10.  Also, they took an easy out in the series that would have given me a better buy in.\\n\\n\r\nArt; 7/10\\n\r\nThe art is pretty standard.  Nothing really stands out, but nothing holds it back either.  For me, if the art is bad, I really struggle to complete any series.\\n\\n\r\nSound; 6/10\\n\r\nNothing really stands our here but that's in a good or bad way.  The story continues along with any real impact from the soundtrack.\\n\\n\r\nCharacters; 9/10\\n\r\nAgain, you get to see some dark sides of the characters.  Their struggles, what they are feeling, and what they are hiding from themselves.  Even though the plot hands an easy out for progression, it leaves plenty behind to work with.  The characters feel pain, and while the supporting cast lacks depth, to me it's not about the quantity.  The fact you get to experience so much more from them because they have to go through these situations, for me, gives me a lot more.\\n\\n\r\nEnjoyment; 8/10\\n\r\nBesides the jumpy early episodes and the easy out they provide for themselves, I was able to really enjoy the series.  It's a show that I picked up thinking I would just brush through and pick up throughout the week but ended up watching through to the end.  After spending time recently pushing through a lot of Anime, I was waiting for one to introduce something off pace.  To me, with the both beautiful and ugly sides of love put on display here, it kept me engaged all the way to the final episode.\\n\\n\r\nOverall; 8/10\\n\r\nThis would have been higher if the early story plot was cleaner.  It felt like it's something that could have expanded past 12 episodes but not quite enough for say 24.  If you love the romance genre but are looking for something closer to reality this may be for you.  I've been talking about it already, but being able to see all the facets of how relationships can play out is refreshing.  Especially in a genre where most of those are left, at best, to unrequited love.",
            "date": "2019-04-23T16:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 306978,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/423331.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ScottJC12",
                "username": "ScottJC12"
            },
            "url": "https://myanimelist.net/reviews.php?id=306978"
        },
        {
            "content": "Spoilers at the end. I'll make this short and straight to the point. I despise this anime. I only like two characters in it and one of them was supporting. The ending was beyond the realm of dreadful. They should just rename this to \"School Days 2.\" Yes, the ending was that bad. The MC is about as interesting and as smart as the many craps I took while watching this. Oh, also, about 3 episodes are SOLELY flashbacks. I found myself skipping over them too, because they held no relevance to the plot. While they gave an idea as to the relationship between theMC and his female dog of a crush, they also served no purpose and could easily have been cut out without confusing the watcher. It has good art, but that's all. It's a waste of time to even fully review this garbage. Save yourself a few hours and don't watch this wreck of an anime.\\n\\n\r\n(SPOILERS) [+Large Your Lie In April spoiler]\\n\\n\r\nOh, by the way. Did I mention how the MC's new best friend stole the MC's girlfriend from him unknowingly, and that the MC challenged said best friend to get her back? Yeah, also, best friend is dying and has surgery so that they can try to have an \"even\" playing field, but guess what? They pull a your lie in April and the surgery fails. You know what they do after that? Timeskip. Oh, and he suddenly forgot his original crush and dates the MUCH more likeable character, only for original crush to come back and ruin everything. Long story short, he breaks up with the perfect girl he had for Ms. \"I broke up with you for a guy after hearing he was dying but now that he's dead i love you again\" \\n\r\n(END OF SPOILERS)\\n\\n\r\nSeriously. I despise this. I'm not even going to give each category a rating, you can just look at these and assume what i would say.\\n\\n\r\nStory: 2\\n\r\nArt: 7\\n\r\nSound: 4\\n\r\nCharacter: 1 \\n\r\nEnjoyment: 2 (For Asuka.)\\n\r\nOverall: 2",
            "date": "2016-06-22T02:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 221472,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5494146.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Tetract",
                "username": "Tetract"
            },
            "url": "https://myanimelist.net/reviews.php?id=221472"
        }
    ],
    [
        {
            "content": "Kimi no Iru Machi is an amazing series. Amazingly mediocre.\r\nThe show is almost feels like swimming in an ocean of rage and frustration for many reasons. For a romance based series, Kimi no Iru Machi sure likes to play around with the idea but then twists it in all sorts of angles. These angles do not connect well in any way but instead ends up making a shape out of wrong proportions. As a follower of the original manga that began to ran years before the debut of this anime series, I am definitely not satisfied from what I see. It feels like I’m drowningin a sea of despair.\\n\\n\r\nKimi no Iru Machi (A Town Where You Live) is an animated series based off the manga of the same name written by Seo Kouji. The author is previously known for his other work, Suzuka that also received an anime adaptation based off of his manga. So now it’s his time to once again step it up and bring forth a romantic comedy for people to enjoy. Unfortunately, it seems like the series doesn’t step itself up but rather falls even further behind from the OVAs that debuted prior to this.\\n\\n\r\nThe series follows main male protagonist Haruto Kirishima as a high school student living on the countryside. As a healthy boy of his age, he falls under the category of the typical high school student with thoughts running through his head. These thoughts includes schoolwork, his future, and the obvious: girls. This is because Haruto has a crush on another female student. Will have the courage to ask her out? What happens if he gets rejected? Will Haruto ever become a man? These might be a few questions for thought for potential anime only viewers at first glance. However, this isn't’ exactly what you might expect.\\n\\n\r\nFor whatever reason, the anime decides to skip around and go straight into an arc that is covered later on from the manga. It’s disappointing given the fact that important factors and development in the beginning between Haruto and another main female protagonist are left mostly in unexplored territory. The series does pull out the old trick in the book as in the form of flashbacks. But honestly though, this doesn’t work well in terms of a romance developing series. For our main female protagonist, Eba Yuzuki, this is even more frustrating to watch because the lack character driven concept. It also doesn’t help by the fact that Haruto himself is not exactly one of those characters where we get to know from the beginning. \\n\\n\r\nAs for Haruto, the boy clearly has eyes set on a particular someone but not exactly whom you might expect. As mentioned before, this series skips around and omits parts from the manga that clearly accelerates its plot. As for Haruto, the guy seems to lack a personality and often acts reserved around others. He is caring on the outside but often makes rash decisions while observing from the backgrounds. It is not until he sees truly sees reality that he decides to act. Often or not though, this is met with mixed results. However, Haruto does carry responsibilities and follows him through. He is hardworking and cares about the well-being of others so some respect can be handed out to him. Out of the girls that Haruto meets throughout the series, Eba is a magnet for responsibility to be delivered. \\n\\n\r\nThe duo of Haruto and Eba is also awkward to watch as they don’t seem very compatible. Haruto seems to be a guy that often keeps thoughts to himself. On the other hand, Eba is a girl with a sociable personality that speaks out her mind and often not afraid to act on her actions. Again though, these lead to mixed results similar to Haruto’s case and leaves both happy and painful scars. \\n\\n\r\nAmong other characters in the show includes Eba’s younger sister Rin that seemingly causes mischievous trouble for the duo. It’s also silly to note that she is almost nothing like her sister. At the same time, she seems to be a pivoting factor in order to get Haruto to open his eyes to the truth that lies in front of him. Then, there’s also Nanami Yuzuki, a girl that Haruto has his eyes set on from the beginning. She is depicted as a kind and forgiving girl. At many instances, she offers advise to others but is a bit insecure to herself at times. Other girls in the show also plays their minor roles but mostly stays in the background. For Haruto though, his eyes only focuses on what he thinks is in front of him. What reality show him though is much more painful but again, he keeps it to himself. \\n\\n\r\nOne prominent feature of the story in the series also features a main supporting male character that plays a more of a tragic role. In fact, he is more of the influence factor to Eba’s decision as well as Haruto’s. The result of that influence though leads to sorrow but also some hope for Haruto; an unfortunate feeling for hope but nonetheless. But as far as that goes, the series decides to twist around with the aspect of romance again and presents it in way to almost beyond repair. Even if a series is labeled as romance with drama and comedy, it should at least follow a straight forward plot. No, instead it decides to jump all over the place and loses focus to the point where viewers might not be sure who Haruto wants to be with. Coupled with the lackluster of a sociable personality, Haruto is a man that is both hard to be empathetic with or take pity for; emphasis on either.\\n\\n\r\nOn the more drama side, the series also tries to make viewers feel sorry for its characters. However, it gets hard to take pity on them because the decisions they make. Sure, decisions often can result in consequences but I find the choices the characters make in this series to be outright abrupt with nonsense. It doesn’t help by the fact that the series rushes its primary plot so there’s little focus on background or character development. Instead, it focuses on Haruto and his daily life with other girls. The guy is responsible but he sure doesn’t take some of his relationships as well as such. This is especially true later on with another girl that some can see as a golden egg. Unfortunately, it's a just another egg wasted by Haruto.\\n\\n\r\nThe comedy factor of Kimi no Iru Machi is second rated. It often tries to mix in comedy with drama at the same time but this doesn’t work out. At other times, it tries the typical and cliched misunderstandings with factors of fan service. As a fan though, I don’t feel serviced or satisfied. The dialogues spoken by most of the characters also lacks flavor. Rin is perhaps one of the more curious girls that often treats Haruto’s life as a game so her dialogues tends to add a bit of interest. For the rest of the cast though, the words often a loop of dull expressions.\\n\\n\r\nFor a more slice of life style series though, there are some hopes. The feeling of countryside brings forth a feeling of nostalgia through most of the flashbacks played throughout the series. It gives off a sense of feeling in terms of simplicity. After all, living on the countryside is simple rather than in a big crowded city. Furthermore, there is some sense of realism in terms of relationships. Examples of this includes the consequences of a long term relationship, dealing with tragedies, and getting yourself back up afterwards from it. It can be relatable too in a sort of way especially if viewers have been in a relationship in the past or is currently in one. I just hope that you won’t make some horrible decisions as some of the characters do in this series. That’s not a pretty sight to see honestly.\\n\\n\r\nIn terms of artwork, Kimi no Iru Machi adapts a simple style with its characters looking natural but at the same time lacking any noticeable features. There’s noting particular standing out with any of the characters. Haruto looks normal and Eba is portrayed as the typical girl with a tip of naiveness. Given the fact that Seo Kouji is involved with the project, there’s also similarity in character designs between this series and his other work, Suzuka. The backgrounds does have a trace of naturalism to it though with the dancing leaves, souring winds, and seasonal weather.\\n\\n\r\nFor its soundtrack, Kimi no Iru Machi is amazingly mediocre. There’s almost nothing to praise about any of the VA’s performances. The main male protagonist Haruto (Yoshimasa Hosoya) seems to have tone of a mature character but his actions contradicts this. Most of the girls’ voices are typical with possibly Eba being the most outstanding with her somewhat elegant tone of voice. Music wise, the show does show some melancholy especially in regards to its flashback scenes. The OP song, “Sentimental Love” is presented with a calm tone along with traces of fan service and somewhat of hope for its characters. Its two contrasting ED songs brings forth a feeling of homesickness that seems to also walk down the memory lane. \\n\\n\r\nOverall, Kimi no Iru Machi proves to be a lackluster romance anime that jumped way over itself. Its ineffective writing coupled by its lack of characterization makes its frustrating to watch. If that wasn’t enough, Haruto and Eba isn’t exactly what I would call the best of couple. The message that it tries to get across never seems to reach if there was one at all. Maybe it’s something on the line of ‘the truth hurts’, ‘face the reality’, or ‘love bites’. Whatever it is though doesn’t work out right. However, it does bring forth some sense of realism with relationships that takes on a path of drama. If you decide to choose the path to watch this anime though, just be aware of what’s ahead.",
            "date": "2013-09-30T16:38:00+00:00",
            "helpful_count": 211,
            "mal_id": 114913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=114913"
        },
        {
            "content": "\"Manga is better than the anime, therefore the anime sucks!\"- Somehow, the logic of this sentence has been fairly incomprehensible for me. I haven't read a lot of manga, maybe that's the reason, but still, I believe that manga being better than an anime does not reduce the value of the anime! Kimi no Iru Machi is often overlooked, but if you believe that an anime can't sway your feelings (like me) you should try it!\r\nStory- 8\r\nHonestly, the story feels somewhat rushed and badly placed. You can sometimes feel that parts from the character's pasts are unnecessary,  however if you would stick to theend of the anime, you would see that it is not so. What is quite likeable, however, is that the cliches are scarce here. You can see very little of your classical-romance-events. It's a good combination of drama and romance though, which is often not the case. It's quite conclusive, so you shouldn't expect the bitter feeling of a cliffhanger ending.\\n\\n\r\nSound- 10\\n\r\nThere isn't really much to say here. It's quite clever how the main character's voice actor is the one singing the ending song, which is named by the anime, by the way. Beautifully incorporated melodramatic sounds just increase the somewhat saddening atmosphere. And the voice actors are definitely great picks, somehow, their voices match their personalities perfectly.\\n\\n\r\nCharacter-10\\n\r\nDefinitely the most likable thing about Kimi no Iru Machi. Worried about seeing cliche decisions made by cliche characters? Here, you won't see any of that. They make mistakes, they are uncertain, they are swayed by feeling, however they have hope, and they act when they feel like they should, the way they think they should. Feelings of love,hate,loneliness...they effect humans strongly. It's portrayed perfectly in this anime.\\n\\n\r\nEnjoyment-9\\n\r\nEnjoyment is quite a relative thing to talk about, honestly. What I can definitely tell you, however, the most interesting aspect of this anime is how it makes you feel, both while watching it and after finishing it. The deeper you go, the stronger the effect becomes. If you like that kind of thing Kimi no Iru Machi is a perfect choice for you. But if you fancy the funny,comedic atmosphere which often appears in romance-focused anime, perhaps this isn't the thing you're looking for. Definitely, one of the most memorable anime you'll ever see.\\n\\n\r\nOverall-9\\n\r\nAll things considered, perhaps this anime lacked time, as if though too many things were said in too little time. However, this does not affect it's value too much. It's very...strong. That's, I believe, a perfect word to describe it. Emotionally strong.",
            "date": "2015-07-02T04:23:00+00:00",
            "helpful_count": 63,
            "mal_id": 192021,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3288489.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DomoB",
                "username": "DomoB"
            },
            "url": "https://myanimelist.net/reviews.php?id=192021"
        },
        {
            "content": "Okay this is a review for those of you have not read the manga and are walking in blindly, such as myself.\r\nKimi no Iru Machi (A Town Where You Live) is your basic romantic anime about your main character, Kirishima Haruto, and his love interest Eba Yuzuki. They have been childhood friends for a short period of time and they really bonded when Eba came back during the later years of her high school lift to attend school and various events befall them and get in the way of the love they have for each other, the most major being the distance between where thetwo live. Eba initially travels out to the countryside where Haruto lives but then has to go back to Tokyo, and this anime takes over from the OVA series where Haruto travels out to Tokyo to chase after Eba.\\n\\n\r\nStory: 7\\n\r\nI was really disappointed with how quickly they moved this anime along. They were constantly jumping around between past and present and never spent more than about 2 episodes on any particular event or moment. The rate at which the relationships moved along as well was frustrating as you never really got a great grasp of what was going on and how the characters really felt. What was good about it however was the ability for the viewer to be able to relate to the situation at hand. It was a fairly good setup, just rushed.\\n\\n\r\nCharacters: 5\\n\r\nThe way they rushed through the anime was really bad, and consequently that's how the characters have turned out. I mostly disliked all of the characters, but the one bright spark was the fact that you could relate to them in a way, regardless of the decisions they made. Kirishima Haruto is your fairly common main character, not much personality and just can't seem to let go of the main female interest. Eba Yuzuki is your typical bright, clumsy damsel in distress who needs someone around to help her all the time and to support her. Although I believe she was supposed to be a likeable character, I did not like her. To me she was just to needy and just made me frustrated with her decisions and the way she conducted herself, but I digress. Eba also has a younger sister Rin who comes into the story about halfway through. She has quite the personality as she is constatly pushing Eba and Haruto together, but I won't spoil too much about her and what goes on.\\n\\n\r\nArt and Music: 7\\n\r\nThe music for the anime was quite well chosen I believe, although nothing outstanding that would make you want to keep listening to it outside of the anime itself. The artworks are fairly good as well, but would've benefited from a little more time to get that smoother texture and brighter colours in general.\\n\\n\r\nOverall Enjoyment: 7\\n\r\nI did enjoy this anime even with all of its flaws. I do recommend giving it a watch, but at the same time be warned that it will feel really rushed and you will not have a lot of time to be able to appreciate the situations and get to know the characters really well. \\n\\n\r\nRecommendation:\\n\r\nFrom what other people tell me, they say the Manga is a lot better and ads in elements of comedy, as well as goes more in depth and is a lot more enjoyable overall",
            "date": "2013-09-29T03:14:00+00:00",
            "helpful_count": 42,
            "mal_id": 114659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Chacattack",
                "username": "Chacattack"
            },
            "url": "https://myanimelist.net/reviews.php?id=114659"
        },
        {
            "content": "Kimi no Iru Machi takes a look at the complex nature of relationships, and human desire by focusing on a childhood romance, and the complications and obstacles that the relationship has to endure. What this anime should be applauded for, is its look at how fragile our desires can  be, and the cruelty and selfishness that come as a result of it.  Of course, this also means that the characters are often unlikable and frustrating. This isn't an anime where you really like the characters, and if anything at all, it's more of a study on the ups and downs of relationships, andthe cruelty of love.\\n\\n\r\nThis is to say, this isn't the kind of material that is particularly enjoyable. But that doesn't make it bad by default. Even stories that aren't enjoyable, have legitimate merit as art. Afterall, not all romance stories are happy, and often in life relationships have hurdles and don't always end with happiness. These stories certainly should be told. Where Kimi no Iru Machi fails is in the final act and the overall pacing of the story. Because the story moves too quickly, there isn't enough depth given to the the main character's choice at the end, and it leaves the audience feeling frustrated and angry with the main characters. This again, doesn't make it bad. But the Manga tackled this subject a lot more seriously, and showed the consequences for this decision, and the new hurdles that arise when choosing your desires over others happiness. \\n\\n\r\nEssentially, the story just leaves you feeling terrible for the person that gets hurt, and frustrated and angry with the two lead characters.  They chose their desires over everything else, despite the consequences of it effecting people beyond them. Which again is fine, but the anime doesn't really give us enough weight to the decisions being made. We don't even get to spend time with the characters after the fact to understand these consequences. And the final  blow is that they essentially sweep it all under the rug, and try to pass it off as happiness trumping over everything, despite the consequences. Which again, fine, but we needed to see those consequences to understand the impact our desires can have on others, as well as why these characters are willing to suffer these consequences to fulfill their desires. \\n\\n\r\nInstead of looking at the impact of the main characters actions, the character that is impacted by this the most says that her love is so strong, she'll wait for the main character if he ever breaks up with the girl that was chosen over her. This on some level, looks at the idea that we can't always choose or control our desires, even if they will never be fulfilled or reciprocated. It's the cruelty of love. But the rushed pacing makes it feel like a cheap ploy to release the main character from his actions and set up an ending that is more digestible. However, this has the opposite effect, as it makes it feel like the subject matter isn't being taken seriously enough. \\n\\n\r\nOverall this anime has an interesting subject matter, but it doesn't take the time needed to properly study it.  This ultimately leaves us with a bunch of a unlikable characters, and a story that isn't particularly enjoyable. However, the story is brave in its subject matter, I just wish it was more brave in going further with it (even if it makes for an uncomfortable experience), because these stories are worth telling. I would have preferred the Anime to have pushed the uncomfortable aspects of love, and left us with an ending that makes us question our own desires. Instead it comes off like a story between two people that make bad decisions, and ultimately burn everyone down around them for the sake of their love.",
            "date": "2014-05-23T13:25:00+00:00",
            "helpful_count": 28,
            "mal_id": 144257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3728321.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AttackOnWaifu",
                "username": "AttackOnWaifu"
            },
            "url": "https://myanimelist.net/reviews.php?id=144257"
        },
        {
            "content": "First of all, let me start this review off with a question: Do you hate indecisive characters who have trouble choosing which person they love much like the characters of “School Days” and “Kimi ga Nozomu Eien?” If the answer is ‘yes,’ then I recommend staying away from Kimi no Iru Machi. If ‘no’ or if you’re unsure, then you can decide for yourself whether you want to watch this or not.\r\n“A Town Where You Live” is a romantic drama that differs from the norm when it comes to adapting manga into anime. Most anime start right from the beginning of the manga and proceedfrom there. I have not read the manga so I don’t know exactly where it starts relative to the rest of the story, but this anime starts from a later arc and instead uses many flashbacks to fill in the important details that happened prior to present events. This makes for some confusing switches in time periods and also results in a lack of connection to characters, especially the ones that mostly only appear in flashbacks.\\n\\n\r\nThe story of the anime begins with Kirishima Haruto, a country boy who is moving to Tokyo as he chases after the girl he loves, Eba Yuzuki. He leaves behind his friends and one of his other former crushes as he ventures alone into the big city to start his new life and his search for Eba. With him, he has brought a necklace which he hopes to give to her. Eba is a girl who is originally from Tokyo but due to family problems, bonded with Haruto on the few occasions she visited his hometown (one time was fairly short when they were young and another time she actually lived at his house for an extended period of time). Haruto starts living with his older sister, Aoi, and soon meets several other friends who go to his new high school, like his new female neighbor Mishima Asuka and the upbeat motorcycle-riding Kazama Kyousuke. Haruto begins his new everyday high school life while continuing to be an amazing cook and, most importantly, searching for Eba.\\n\\n\r\nAside from the inconsistent rhythm of the plot due to the many flashbacks which sometimes encompass entire episodes, I felt the plot also suffered from the characters' personalities. Haruto (as I mentioned at the beginning) is your typical indecisive male protagonist. Because of his indecisiveness, he ends up hurting not only the girls he is involved with, but himself and a few other people connected to the girls. Eba isn’t much better. She is also very indecisive and constantly tries to push Haruto away despite it still being blatantly obvious that she still has at least some feelings. These problems accumulate throughout the course of the show and end (in my opinion) with a rather unsatisfying and unrealistic ending.\\n\\n\r\nAs for the art, it’s unimpressive to say the least. The character designs are maybe the worst part of it as every single character’s face is just copied and pasted with a different hair style and color as well as different eye colors. Because all of their facial structures are exactly the same, every character has the same stupid looking smile (I think this is the first time I’ve genuinely disliked any anime characters’ smiles). As for the backgrounds, they are very colorful and add a lot of effect to the scenes which sometimes helps them but sometimes is overused and ends up making some scenes laughably overdramatic. By that I mean that there are only so many times when gusts of wind, lightning bugs, and sakura blossoms can show up at the perfect time before it seems to be more than a coincidence. The scenery around Tokyo and Haruto’s hometown however are much better and during the regular scenes, the scenery is much nicer and more realistic (as far as anime goes anyway).\\n\\n\r\nThe soundtrack consists of mostly instrumental pieces that sound generic in a romantic drama. None of the tracks stand out and the OP and ED are just average as well. The voice acting is impressive though as there are several different accents which (I assume since I don’t understand Japanese) the voice actors do well. It’s definitely clear even to a westerner like me that these accents are about as different as American and British ones.\\n\\n\r\nKimi no Iru Machi tries a little too hard to be a dramatic romance story. Whether it comes to the indecisive characters or the strange art style, the show just falls flat in almost every possible way and is nothing more than forgettable. I recommend skipping this or maybe trying the manga instead (I know I’m recommending something I have not read, but I would recommend starting at the beginning of the story instead of dealing with flashbacks as that seems to me like it would work a little better). Still as I said in the beginning, do not watch this if the thing you hate most in the world is indecisive characters in romance stories, because this will annoy you to no end if that is the case.",
            "date": "2013-09-29T12:31:00+00:00",
            "helpful_count": 15,
            "mal_id": 114757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2261967.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Asfaria",
                "username": "Asfaria"
            },
            "url": "https://myanimelist.net/reviews.php?id=114757"
        },
        {
            "content": "Kimi No Iru Machi\r\nWhen i first time watched the first episode, i felt like i'm going to watch a real romance anime, but then everything started to go a little wrong for me. Actually the beggining is making you to continue watching as long as you'll recognize every single character.\r\nStory.\r\nThis anime has one of the most wonderful love stories ever. It shows how strong can be loving personality. And shows that love is stronger than any type of friendship. When friend challenges ill friend for his former girlfriend, that's really unbelievable. Actually if it was me, i would let him to die thinking that hehas won. The end of the storyline was wonderful, but i was hoping they would show Asuka in the end with someone handsome and made for her.\\n\\n\r\nArt.\\n\r\nCan't say anything good or bad about art, i think it was ok. Because in some animes because of bad art you star to hate that anime.\\n\\n\r\nSound.\\n\r\nEverything was beautiful, and sound is not an exepction.\\n\\n\r\nCharacters.\\n\r\nLead characters\\n\r\nI don't think they were made for each other. Even though when they were together they were making the cutest scenes of the whole anime, but they were really not made for each other. I don't know. I feel like Haruto and Asuka would be wonderful couple if Haruto loved her.\\n\r\nAbout Supporting characters. None of them had his/her own storyline here. Some animes also show stories and loves of supporting characters, but here no one actually deserved it, because i think everything was based on lead ones.\\n\\n\r\nOverall.\\n\r\nI'm really happy i've watched this anime because i've had 1000s of feelings watching this. \\n\r\n9/10",
            "date": "2014-12-20T21:08:00+00:00",
            "helpful_count": 11,
            "mal_id": 173361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4335541.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AkumaNoSaigi1",
                "username": "AkumaNoSaigi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=173361"
        },
        {
            "content": "Ive watched this anime far back when it aired but today I decided to unleash my thoughts in this review here firstly the anime was a pile of trash and I am going to explain why:\r\nThe way they portrayed everything was so negative and sappy that I didnt know wether to cry or laugh, it was like watching those soap operas on TV .. It felt so rushed and half assed.. In one moment you have Haruto giving up and going home with his ass between his legs and then he has this sudden realization and starts running towards , guess who, EBA to spoutsome random shit from her house door, only to see in the window a peeking Eba with a regretfull face.. This repeated imense times troughout the anime and the Manga too.\\n\\n\r\nBut I guess its just Seo Kouji godly writing making the highlights again.. In case you dont know this men  was the one who created Suzuka wich guess what its like Kimi no iru Machi all over again, only the characters are slightly different.. Apparently Suzuka and KNIM are even from the same freaking story line.. Fucking amazing.. Its like Seo is making fun of its audience wiggling his troll dick around like a madman \\n\\n\r\nBut in this case its not entirely Seo´s fault.. The studio who adapted KNIM was GONZO .. One of the worst studios out there right next to Deen and Pierrot (Imo) .. And has I said above the anime was very rushed and you want to know why!? Because shrinking a 270 chapter Manga into a 12 episode anime (NOTE: EACH EPISODE HAS HARDLY 18 MIN) is fucking stupid.. An anime that had the potential to have atleast 26 episodes and then they could release 2 OVA with the aftermath to close it in a soothing way, but its Gonzo so we shouldn´t expect much.\\n\\n\r\nEven so its not like the Source material was good.. The story of KNIM is very infamous for its twists and forced drama.. The characters arent necessary bland and motivationless, actually quite opposite however they are so hateable for their stupid ass decisions and \"the power of bad writting\" behind that you end up like Umm what the hell? .. Midway trough Haruto forms a rivalry with a guy in the verge of dying only to accomplish his goals leaving the viewers thinking .. WOW what an asshole.. \\n\\n\r\nLike seriously the way that this anime takes itself is so laughable on the insight that anyone with a brain would bash it.. And despite all this I was definitely surprised that I managed to end the series, more so that I was actually entertained and fell in love with it in a weird way.. It was non-sensical and just teen drama at its best.. #BLAME SEO",
            "date": "2014-12-27T17:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 174643,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3862171.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Moon-",
                "username": "Moon-"
            },
            "url": "https://myanimelist.net/reviews.php?id=174643"
        },
        {
            "content": "Has it ever happened to you? Sitting down to write something but you can't really seem to organize your thoughts? I have no clue whatsoever as to how to approach this one.. This anime to me is as strange as the vast universe we live in and i certainly don't mean that in a good way, as you may have gathered by my rating.\r\nAt first i thought there was something wrong with my neuron system, maybe my brain's wiring wasn't allowing me to enjoy this piece of art in a way that would.....Touch my soul or me strings or some other slang romance enthusiasts liketo use every other sentence. So i went to the hospital and had a doctor check me...The results were terrifying...I was in the terminal stages of bullshit intolerance and i've been told that this is an incurable disease but it won't affect my day to day interactions with people or animals for that matter.\\n\\n\r\nI left the hospital devastated, i had no fags, no money to buy some and i had parked my car 2 blocks away from the damn hospital. So as i was walking i tried to come in terms with this new disease of mine, tried to embrace it..So i thought to myself that all is not lost, i shall beat this fucker in the ass and be a normal kid again..I came back home, poured a drink and went to google, my old pal who knows everything about everyone, and suggested i should try a shock therapy..That sounded dangerous and to be honest i like a bit of danger. I'm not what you'd call and andrenaline junkie but i quite fancy the idea of chemicals causing my reptilian brain to go berserk.\\n\\n\r\nOf course this being a shock therapy wasn't a piece of cake..More like a piece of concrete falling from a 3 story building and hitting you on the head leaving you for absolutely dead.\\n\\n\r\nAnd this is where A Town Where You Live comes in...From the very first episode it attacks your senses like aids attacks your immune system and if you don't know what aids does to you, why don't ya ask Freddie Mercury how that went? Well you can't cause he's dead but anyway.\\n\\n\r\nAnd the first wave of attack comes in the form of animation..From the very first seconds the animation was like a night out at Vegas with a tablet full of acid. You are still able to see things but you see in waves of blurriness and with no sense of real focus...And of course hallucinations are a nice touch as well. What i want to say is that the animation is close to atrocious and weirdly colored and blurry and it gave me eyes herpes. The characters themselves are well drawn don't get me wrong but everything else is not good, at the very best it's basic. I'm not sure if it was a copy issue or anything of that sort but it seemed wayward to me.\\n\\n\r\nThe second wave comes in the form of the characters and the story hitting you in turns for maximum impact, maximum amounts of vomit and massive internal injuries. The story goes like this, once upon a time there was a boy named Haruto and lived with his parents in the countryside..One fateful day a girl named Yuzuki came to live with them..No it's not like that you idiots get your mind out of the gutter..She was the daughter of a friend of Haruto's father or something like that..Anyway Haruto is plain and simple an annoying twat. He treats her like crap and for no obvious reason other than him being an asshole. Sure one can make the case that Yuzu is a klutz and a helpless case who can't do anything on her own, from walking in a straight line to breathing without the help of a special committee. So Haru has to help her with everything..Keyword here being \"help\"...Simply put he is one of those guys who go after broken people so he can fix them in the hopes of them not leaving him.....So one thing leads to another and they ended up together? I'm still not sure on the details but that's what happens..She then leaves for Tokyo and after some time of long distance relationshiping she found someone else.\\n\\n\r\nIs anyone here surprised? Nope? Well hear this and be amazed at the idiocy that this anime has to offer...Haru being a creep and a stalker among other things decided to MOVE TO TOKYO to find her...Got that?\\n\\n\r\nFrom that point on some insanily stupid stuff happen and Haru jumps from girl to girl while always being in love with Yuzu and still being an obnoxious fuck with no moral restriction whatsoever.......Other characters you say? Well yeah silly there are other characters..His hot sister being one and Yuzu's redhead hot sister as well..Oh yeah there was another one who went by the name of Kazama and he, He was a damn likable character. He was an aquaintance of Haru's sister and they became friends..And guess what? They killed him off...But before they did that they had to make him the 3rd wheel and the one Yuzu dated while in Tokyo.\\n\\n\r\nSo animation that can kill life organisms 2 galaxies away, a story made possible by an angry teenager on drugs and characters that are as believable and relatable as Spongebob..Music and VA was....There..\\n\\n\r\nNow i know this review wasn't as long or as full of details as you'd expect but i simply cannot put every single thing that is wrong with this anime cause the servers of the internet would explode..Do you want that? But then again i'll give this anime the pro of being at least a bit realistic..I mean people are shit and they do shitty things and they use each other to get what they want and they fuck you in the proccess..That's an unwritten rule of human relations. On that front it did well, mind you that's not saying much since most times it ditches realism for downright idiocy but at least it tried and i'm a nice guy!\\n\\n\r\nI can't and won't reccomend this to anyone, even to people that i hate with a burning passion. But then again there are people out there with little to no sense so don't blame me, blame the world we live in and the society like everyone seems to do these days.\\n",
            "date": "2019-01-10T06:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 298629,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6339890.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Dionkeykong",
                "username": "Dionkeykong"
            },
            "url": "https://myanimelist.net/reviews.php?id=298629"
        },
        {
            "content": "This is a review for Kimi no Iru Machi, the TV series that ran in 2013. Before that, 2 episodes called Tasogare Kousaten (Twilight Intersection) were released. Two OVA came after this in 2014. If you want to watch all of them, I suggest starting with Tasogare Kousaten, then this, then the 2 OVAs. Tasogare Kousanten comes a bit before this in the story, and the 2 OVAs adapt chapters that were released later on.\r\nBefore I start, I would like to mention that this is another review of Kimi no Iru Machi from a manga reader. Actually, I wonder if anyone DIDN'T read the mangabefore the anime. It feels like a lot of people read the manga, heard about the anime and told their friends not to watch it afterwards.\\n\\n\r\nIt is by far my lowest rated anime on MAL, and there is a reason for that. This anime feels lackluster. It fails in all categories to deliver a minimum of what is expected from an anime to make in enjoyable.\\n\\n\r\nLet's start with the story, for which I gave it a 5. The only redeeming thing about the story is that it stays the same as the source material. What is wrong about it? First, we skip all of Hiroshima to skip straight to Tokyo. You heard right, we skip a third of the manga and 90% of character development and go straight to the second part of the manga. Some of the chapters from Hiroshima were shown as flashback, but not nearly enough to understand why the events in this series are unfolding. There's also the fact that this anime wanted to cover the most chapters possible, so makes for a very rushed story with essential scenes left behind. The ending also felt incomplete, as there are a lot of things that are left unresolved in the manga at this point.\\n\\n\r\nThe art is a 6. It was actually an 8 until Episode 12. The characters looks from the manga are well adapted, but the animation is weird. The opening is one of the parts where it looks the weirdest, and it's the only part you have to watch 12 times. The center part of the animation is usually nice, but anything that's a bit peripheral to it or in the background looks horribly rushed. The still frames are beautiful, and the ending does a nice job of blending in the author's drawings with some photography in the background. One of the finer points that bothered me were when the characters' mouths stopped moving for some unexplained reason during random scenes, and black and white still frames that started showing up during the last few episodes, a lot of them in episode 12.\\n\\n\r\nThe sound deserves a measly 3. The music felt really out of place in this. The OP and ED are terrible and fail to set the right mood, if any, for the anime. The voice acting for Haruto was nice, with a thick accent and an unpolished vocabulary, it gave a vibe similar to an \"redneck\" only a bit softer. The other VA had nothing special, and were lacking a lot of emotion during key scenes. It felt like watching two animated dolls talk to each other.\\n\\n\r\nAs for the characters, I won't drag on it. It gets a 4 mostly because of the shortcomings of the story. The fact that they skip straight to Tokyo does not allow for any development that would have been necessary to understand the characters' decision and motivations. Some of the characters, like Asukara, are briefly introduced then swept aside. Same goes for Akari and Kanzaki, that were more present during Hiroshima. Also, a certain key character that has a key role in the anime has not appeared, and it's a shame because it explains a lot of things between Haruto and Asuka. Introducing it would probably not have given it enough time to make it to a conclusion within 12 episodes, so I can understand its absence.\\n\\n\r\nThe last criteria is enjoyment, which got a 3. I feel like this is really brought down by the fact that I expected an anime that would be as enjoyable as its source material, which it was not. It is not the first time that I watched an anime based on a manga I already read, but it's the first time I am so disappointed with it. I usually like romantic stuff, both comedy and drama, but what I got here was useless drama and akward scenes.\\n\\n\r\nOverall it deserves a 4. It is an anime adaptation, but it's most certainly not a good one. It does have some novelty elements but it is far outhweighed by the overall lack of quality. If you read the manga, you don't need to watch this, and you'll be happier if you don't. If you haven't but like seinen, romance and drama, pick up the manga instead.",
            "date": "2015-03-17T20:57:00+00:00",
            "helpful_count": 9,
            "mal_id": 182573,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3642571.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LunarFire",
                "username": "LunarFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=182573"
        },
        {
            "content": "I know a lot of people say to read the manga because it's \"better\", but it's for good reason.\r\nPeople who haven't read the manga may see us as some original source elitists, but you will never be able to experience everything the mangaka had to offer and his style of writing drama, through an the anime that plows through entire arcs within episodes.\r\nThe manga was like a roller coaster of feels that spanned through years of years of Haruto's life. However, the anime is just like a compiled highlight reel of all of that, and because of it, the effect is not as great.\r\nKimi noiru machi is a manga that a lot of other \"romance\" and \"harem series don't really like to go through. It goes through relationships and breakups until he finds the one who he really feels that completes his life. This is shown through spanning arcs in the manga and you can really feel the sense of living his life as he goes through highschool, moving, graduating, and then living on his own.\\n\\n\r\nSadly, the anime only has 12 episodes and it becomes difficult to capture that sense of time passing by.\\n\\n\r\nFinally, I'm not saying NOT to watch the anime, but it would be great if you all gave the manga a chance. I've read the manga twice and it made go through a variety of emotions and sometimes making me flip tables literally xD. I feel like it would be fun to share that same experience, so that's why I took the time to write this up!\\n\\n\r\nHappy reading everyone!\\n\\n\r\nThanks,\\n\r\n-morekawaiipls",
            "date": "2016-10-15T09:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 231830,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3345341.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/morekawaiipls",
                "username": "morekawaiipls"
            },
            "url": "https://myanimelist.net/reviews.php?id=231830"
        },
        {
            "content": "Disclaimer: I am not reviewing the manga, nor will I be basing this review on the accuracy of this story when compared to the source material, I am simply writing a review for the anime. \r\nNow obviously, the very nature of reviews are anecdotal, but I hope that you will bypass all the other reviews that rate this show low, because to be frank people are f**king idiots and incredibly biased, don't listen to them, listen to me, the smart one. Okay, now that we have that out of the way, lets begin the review. \r\nReasons You Should Watch This Show: The realism ofthe relationships and situations portrayed in this series consisting of only 12 episodes and 4 OVA's are relatable and thought provoking. If you're anything like me you try to find as much meaning in a story as possible, and in my opinion the best selling point of this anime is in the way the story is told, and the ability to sway your emotions throughout the anime, as well as make you question the actions taken by the characters and whether or not they are the wrong or right ones; the ones you would take had it been you in their situation.\\n\\n\r\nStory: The story isn't perfect, but it's far from bad. The story consists of the MC trying to figure out his heart and the lengths he's willing to go for the girl he loves. I really enjoyed the concept of the story and the amount of meaning that can be found within the plot. One issue some people had is that the story was a bit rushed compared to the manga, and to a certain extent I agree that at times it did feel rushed, but nothing too bad. 7/10\\n\\n\r\nCharacters: One of the best parts of this show is the characters, as the story goes on all of the major characters are developed. As they get older they act different towards each other and show their feelings differently. Just like most anime's though, the MC makes a lot of stupid decisions that could have easily been avoided, and although the characters are great, due to the 12 episode run time you miss out on a lot of potential character development. Imo though, I think this anime did the best job it could do on developing characters within such a short period. In addition you have 4 OVA's focused on tying up loose ends and providing extra backstory. 9/10\\n\\n\r\nSound/Music: The soundtrack written by Keiichi Oku fits the atmosphere nicely and there are plenty of great songs that stand out in their own right. The OP and ED are bomb as well. As far as voice acting goes, the Japanese actors did a phenomenal job portraying their characters. 8/10\\n\\n\r\nVisuals/Animation: The art is very unique and is very pretty at times, though I noticed that the animation can be lazy. For example, they won't animate the characters talking if it's at the end of a sentence and the camera pans back to them. If you are familiar with the Monogatari series, the animation is very similar but not as \"edgy\". 8/10\\n\\n\r\nEnjoyment: Overall I related a lot with the main character and the decisions he ended up making. I really enjoyed the way the story was told, it was predictable at times but it also had a lot of unpredictable moments that had me eager to watch the next episode to find out what would happen. If you're into romance and are looking for something to relate to, this anime is for you.   \\n\\n\r\nStory: 7/10\\n\r\nCharacters: 9/10\\n\r\nSound/Music: 8/10\\n\r\nVisuals/Animation: 8/10 \\n\r\nEnjoyment: 10/10\\n\\n\r\nFinal Rating: 8/10",
            "date": "2016-12-30T02:09:00+00:00",
            "helpful_count": 5,
            "mal_id": 236943,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4752507.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nekoksyo",
                "username": "nekoksyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=236943"
        },
        {
            "content": "I am strictly reviewing the anime with no comparison to the manga (it would be so much worse) Let me start by saying the synopsis of this anime, about Nanami, was probably correct for like 2 episodes...  \r\nI thought about quitting this anime several times and then thought \"I really want to see how they plan on ending this\". I am disappointed but I don't hate it. I was confused for the first 2 episodes, got a grasp of the story and then when \"war\" was declared between ex and current boyfriend over MC love interest, it was all over for the story line.\\n\\n\r\nThe only thing it had going for it was the majestic ED and the fact that the MC was mildly swoon-worthy. So let's see here... this is what I got from Kimi no Iru Machi\\n\\n\r\nFall in love with people because they are useless and annoy you\\n\r\nAlways date OFF screen\\n\r\nBreak up because you love each other\\n\r\nDating a sick kid is not cruel\\n\r\nIf you move to a town where your ex lives, like a stalker.. you become a top notch boyfriend instantaneously.. \\n\r\nDate the perfect girl and dump her for the girl who left you\\n\\n\r\nThe story was pretty simple which makes me wonder how it could have gone sour so quickly. A country boy meets a city girl, they live together, she moves away and boy pursues in the name of love. We get a bunch of side characters who we have no development on and a series of side stories that do nothing but show how desperate Haruto is. The creepy sister had some screen time but she served no purpose. Asuka didn't get enough screen time for me to feel sorry for her. Haruto is a mild stalker and love enthusiast on several levels. The ending was horribly predictable and not the predictable that you hope happens either. It would have been more effective to write \"F** the Haterz\" across the screen at the end.\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2015-04-29T22:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 186804,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4551475.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Utsusemi1",
                "username": "Utsusemi1"
            },
            "url": "https://myanimelist.net/reviews.php?id=186804"
        },
        {
            "content": "Kimi No Iru Machi or A Town Where You Live in English is a 13-episode anime series adapted from a manga. Our main protagonist something year old Haruto Kirishima transfers to Tokyo in pursuit of childhood friend and girlfriend Eba Yuzuki. Eba unexpectedly leaves Haruto’s home town Hiroshima and after a short while broke up with Haruto for unknown reasons, Haruto eventually tracks down Eba and demands an explanation for breaking up.\r\nThat’s about as much of the story I can give away without spoiling it. A Town Where You Live was released back in the summer of 2013 and was the last series of thesummer line up that I wanted to watch. I only read the story briefly and I just assumed it would be a complicated love triangle, turns out I was right. So let’s go in to some detail.\\n\\n\r\nWhen watching the first episode I was drawn in entirely by the character designs and animation, it was very shiny and a visual treat for the eyes. I thought that regardless of the story the visuals would make up for it. I was wrong. The story is clichéd and soap oriented which made it hard to watch at times. (A soap is a weekly television drama for those who don't know)\\n\\n\r\nThen comes the god-awful characters that mess up the show entirely for me (with the exception of a few) I will start off with the biggest and main problem of the series which is Eba Yuzuki, she is undoubtedly the worst female character I have ever had the displeasure of watching for over 4 hours. Not only is she the dullest, most mind numbingly boring females leads I have ever seen, she is also one of the biggest bitches in this show! (Granted it was only her and her step-sister)\\n\\n\r\nWe also have our main protagonist Haruto, who needs a slap to help him get over his simplistic and shitty ex-girlfriend. Haruto has a common personality; he just seems like your common everyday nice guy, who is also lucky enough to get the attention of a few female characters in the show, but never acts on it. He has good cooking skills and his friends encourage him to become a chef, though he see’s cooking as more of a hobby. (Essentially, he's a boring twat)\\n\\n\r\nOther mentionable characters include Kyouske Kazama a very cheerful guy who dreams of becoming a motorbike racer. His dreams are unlikely to happen because of his illness. (Anaemia) Kazama became friends with Haruto after giving Haruto some words of inspiration and encouragement not to give up on the woman he loves. Haruto finds out later that Kazama is dating Eba and the two begin a rivalry to win over Eba, the two are still very good friends though.\\n\\n\r\nFinally we have Asuka Mishima who is Haruto’s neighbor when he moves to Tokyo to live with his sister. She and Haruto first met when a misunderstood Asuka thought he was a thief and attacked him with a baseball bat. The two eventually became friends and later began to date one another. \\n\\n\r\nI don’t know whether the creator does it intentionally to make the two main characters so unlike-able. The main character is incredibly plain and generic. The supporting cast does a much better job; they are much more easy to relate to and have at least some desirable character traits. \\n\\n\r\nProbably the greatest thing about this show was the animation. I mean Wow! When looking back at Gonzo’s previous work like Saikano or Full Metal Panic you can just see the drastic change in beauty. The one thing you cant fault about this series is the animation. \\n\\n\r\nThe sound of this anime was good I was content with the plate of music put in front of me, the opening theme is very good and I didn’t feel compelled to skip it after so many episodes. The ending theme was also likeable but I skipped it every now and then.\\n\\n\r\nThe reasons why I felt that this series was bad because of its mundane characters, overuse of a love-triangle storyline and the flawed execution. This series was not trying to attempt anything new, the pacing of the series was not to the right standard which can annoy the viewer and the only redeeming quality of this anime was the animation. This series was likeable at times with moments such as: the relationship between Haruto and Asuka plus the rivalry/friendship between Haruto and Kazama. Sadly those moments were insignificant on the train wreck that was ‘A Town Where You Live’.\\n\\n\r\nOverall I did not like this anime it has one redeemable feature (animation style) that is not worth watching for this shitty, overused and stereotypical love triangle/love dilemma that occurs within this show. I would not recommend this to anyone unless they are fans of drama/romance genres. This show deserves a score of 5/10.\\n\\n\r\nThanks for reading guys \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-02-01T08:53:00+00:00",
            "helpful_count": 6,
            "mal_id": 131013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2322793.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Honest_Senpai",
                "username": "Honest_Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=131013"
        },
        {
            "content": "I am really into the romance genre, and I thought that this was interesting enough to peek my interest. After a certain cliffhanger happened, I decided to read the manga instead, although while waiting for episodes to come out, I also finished the anime.\r\n...Turns out that the anime pretty much botched the story, but you wouldn't know unless you've read it. If I haven't actually read the manga, I might've given this show an average rating like 6 or 7.\r\nIn the anime they begin the story in the middle of the story of the manga, and they bring back the very beginning of the mangaby scattered out in flash backs.\\n\\n\r\nThe show doesn't give the characters enough time to develop and grow, so they are mostly bland and expressionless. \\n\\n\r\nOverall, I would just stick with the manga, but if you are willing to watch a mediocre romance show with some serious tones (which there isn't that many) then you could try this.\\n\\n\\n",
            "date": "2014-06-13T21:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 146915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1264963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Daidus",
                "username": "Daidus"
            },
            "url": "https://myanimelist.net/reviews.php?id=146915"
        },
        {
            "content": "This anime was an interesting one to say the least. It had many flaws but also many pros that made it an enjoyable one to watch.\r\nStory:\r\nThe story of this anime was good, but in my opinion, it lacked clarity. Often throughout the anime, you find yourself confused or puzzled in regards to what is actually happening. Constantly, there are flashbacks that generally complicated the story and ultimately made it hard to follow. In my opinion, i did not hate the story. Instead, i quite enjoyed it despite the countless flaws that were present. \r\nArt:\r\nMany can criticize the animation by saying that the characters and settingwere poorly drawn. However, i could argue otherwise because i honestly believe that the animation in this anime was not bad. Although, there were many parts that were terribly done, i would still say that the art was not bad. If i were to give my honest opinion, i would say that the art was fair. There was nothing special as the anime contained simplistic animations and ordinary color use.\\n\\n\r\nSound:\\n\r\nThis was probably the best thing the show had going for it. Oddly enough, i quite enjoyed the music and sounds used within this anime. I felt as though the producers used music/sounds effectively draw out a particular mood within the anime. \\n\\n\r\nCharacter:\\n\r\nThe characters were good, but was not excellent. At times, it is seen that the characters lacked substance. In other words, it can be seen that the producers rushed the development of the characters resulting in dull and vague personalities. Personally, i did not mind the characters, but i do feel as though they could have been developed more. \\n\\n\r\nEnjoyment:\\n\r\nI could honestly say that i enjoyed this anime, despite all its flaws. There were easily more cons than pros in this anime, but even so, the anime was one that was quite amusing to watch.\\n\\n\r\nOverall:\\n\r\nAs a final statement, i can say that this was a good anime. To anyone who enjoys watching anime that involves romance then this is definitely one that is worth checking out. After watching this anime, i can honestly recommend it to everyone as it was one that was quite enjoyable.\\n",
            "date": "2014-08-12T22:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 156361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3778465.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/phuynh1997",
                "username": "phuynh1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=156361"
        },
        {
            "content": "Kimi Ni Machi Iru is a finely paced romance about Haruto, the protagonist, searching and hoping to reunite with an old flame. The audience is strung along the main characters quest as he tries to reconnect with his long lost love, with many questions, secrets, trials and tribulations along the way. Romance stories, or at least good ones, are always roller coasters to say the least and usually are always told in the same way. However, Kimi Ni Machi Iru finds its way to reuse the old methodology and turn it into a new refreshing tale of love. Watching the main characters journey unfold isdefinitely worth watching. \\n\\n\nStory: 8.3 -\\n\nThe story isn't innovative by any means, and it usually revolves around the same concept. A good way to compare Kimi Ni Machi Iru is like comparing it to a Korean Drama show. They always tell it the same way, but it is how they use it, is the key to success. Throughout the story, there are well placed literary devices (symbolism/foreshadowing/irony etc.) and without a keen eye, one could miss out on a completely well developed scene.\\n\\n\nAnimation: 8.5 -\\n\nThe art direction definitely has a stylized theme to it, from hues or rather colors depicting the mood and setting of the situation or scene to, warm, calming and serene pastel like colors. Oftentimes, there is no attention to detail, which can be confusing and the question of why it couldn't have just been consistent arises, however overall, it does deserve an honorable mention.\\n\\n\nCharacters: 8.3 -\\n\nThe characters are probably the hardest thing to rate in Kimi Ni Machi Iru, and it's definitely going to be opinionated. Each character in the story are very like-able and most likely the audience will end up choosing their favorites (Here comes the rage!). Get ready to see the males name x females name on youtube or comment posts, although the story is most likely predetermined. The characters display their emotions quite vividly, which is also complemented with the art &amp; animation, which can be truly taxing on the soul. These characters deliver a very realistic and very human emotions, that often the viewer can definitely relate to, even if sometimes we might not agree with from a story standpoint or perspective. \\n\\n\nWow Factor: 8.5 -\\n\nKimi Ni Machi Iru does not disappoint and will keep the audience quite amused/engaged until the very end or perhaps just the opposite, to people who compare it to the manga. The story and its characters in it will take you for a heart felt, possibly tear jerking melodramatic journey that is absolutely worth a watch.\\n\\n\nFinal Grade: 8.4 / 10 - &gt; 8 (Anime List)\\n\n+ Good use of Literary Devices (Used in story telling, ex: Foreshadowing, Symbolism etc.)\\n\n+ Good use of flash backs\\n\n+ Opening Intro &amp; Song (MIMI MEME MIMI - Sentimental Love)\\n\\n\n- Sometimes too easy to read &amp; generic of whats to come\\n\n- More consistency with the Art style\\n\\n\nReview by: AzurexSky of AniRaters",
            "date": "2014-01-12T16:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 128549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3439279.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/azurexsky",
                "username": "azurexsky"
            },
            "url": "https://myanimelist.net/reviews.php?id=128549"
        },
        {
            "content": "Kimi no Iru Machi - a twisted love story.\r\nI'll just start off with saying, I haven't read the manga yet, so I'm not going to say anything about the manga. The anime however, was a whole different animal in essence and I personally felt that the animators did a poor job on this then they have with other works I've known them to do.\r\nThe Plot ~ \r\nOverall the plot depicted by the anime is ok. At first the fast pace of the anime had me entertained, but as I progressed through the story I realized just how down to earth and simple it was. Therewas a lot of going back and forth between past and present, and sometimes this was pieced together in a way that simply became incomprehensible and incoherent to the manga. \\n\\n\r\nThe story itself (as depicted by the anime) seems downright flawed and cruel, basically weak-willed boy (Haruto) has his girl (Eba) cheat on him, he wants her back but she's with a friend of his who's about to die, so he's stuck with a dilemma. So he hitches another girl (Asuka) nearby. Then he cheats on that girl. \\n\\n\r\nSo between the characters cheating, that really all they let you see in this anime and its kind of depressing as a whole. \\n\\n\r\nThe Art ~\\n\r\nThe art wasn't that bad. It seemed more like Modern Shoujo to me. There seems to be this presence of \"static\" in the motions created by the animators, but this should not diminish your viewing of the anime--just minor lighting aspects could have been tweaked to make the anime more bold and color-appealing like other animes.\\n\\n\r\nThe Sound ~\\n\r\nThe OP and ED aren't half bad for this song. I gave this a 9 out of 10. The anime as a whole could've used more string orchestra sound tracks in my honest opinion. \\n\\n\r\nCharacters~\\n\r\nThis had me pretty sad. Not only do the animators show you so little of the characters' character, but also the fast paced story doesn't give you time to breathe and analyze the characters as a whole.\\n\\n\r\nHaruto basically lacks a pair and when he gets it he's stuck with a dilemma of friendship. At first I pitied him because Eba leaves him, but towards the end I kind of understand why. I hated him when he cheats on Asuka and doesn't do anything when Asuka confronts him. To be honest when they were coming clean to each other I wish Haruto got up and stopped Asuka from leaving, beg her and tell her he was sorry and tell her not to leave.\\n\\n\r\nBut then again, thats another story.\\n\\n\r\nEba more or less PMS's half the story. First she likes Haruto like crazy, then she likes this other guy, then she wants to steal Haruto back when Haruto's going out with another girl? What's her problem?\\n\\n\r\nAsuka is perhaps my favorite, as she's the most human and understandable character throughout the entire anime. She portrays the every day girl, in essence, and when she is betrayed she is the only character I actually was able to sympathize with.\\n\\n\r\nRin is your archetypal tsundere. She likes Haruto and hates her older sister, and yet gives Haruto advice and even aids the two in getting back together. I don't really understand her--why doesn't she just grab Haruto herself?\\n\\n\r\nAs for the rest of the characters--I can't really say much. And the reason is because the animators failed to show more of each character--the only image you're able to grasp is a shallow image of one.\\n\\n\r\nOverall ~\\n\r\nTo be honest this piece could have used more work.\\n\\n\r\nIf you like twisted and denied Romance then this is the anime for you. 3.5 out of 5 stars for the undeniably twisted and cruel Romance \"Kimi no Iru Machi\".",
            "date": "2013-11-20T19:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 120937,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2094831.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jayex",
                "username": "Jayex"
            },
            "url": "https://myanimelist.net/reviews.php?id=120937"
        },
        {
            "content": "Kimi no iru machi is an interesting anime about a teenager (16-17) who falls in love at a young age to another teenager who had moved from Tokyo to the countryside but she then has to return to Tokyo. The protagonist then becomes an adult pretty much and goes to Tokyo to chase after the girl of his dreams. But of course it's not that simple, the protagonist is lead through multiple emotional hurdles and it's up for him to decide, if giving up relationships is worth continuing his venture for his love.\r\nStory: 8 \r\nThe structure of the anime is quite unique and at firstI found it sort of annoying and almost didn't understand how they were going to fit everything in as there were constant flashbacks but the further you get into the anime, the more you can understand and respect the flashbacks as they actually add a reasonable amount of character development; slowly releasing some information to add contextual value to the current point you're at. I've seen this outside of anime but not too often in anime so it's nice to see some more structural techniques in that regard. In addition, the anime is split in half meaning halfway through the anime there'll be a huge leap in time, I think was two years (could be one) and the protagonist went in a different direction to then return back to his original direction through an interesting process and the moral at the end of story was quite nice. And that leads us to the ending, personally I was quite happy due to the sour but sweet ending leaving really no cliches and actually came to a conclusion. Meaning, no cliffhangers.\\n\\n\r\nCharacters: 8\\n\r\nIn regards to the characters, I felt the protagonist Kirishima lacked good character development probably due to the squeeze upon the content in the first half of the anime but he has good qualities, which definitely brought interest at least and for some perhaps respect for what he was trying to achieve being hooking up with Eba. For example, his dedication is admirable and the troubles he went through to achieve his goals are relatable. Should I break this friendship to be with my love? Those sort of troubles/decisions. Character wise for Eba, the girl who the protagonist is trying to hook up could be seen as missing contextual value and etc but honestly I think this was done on purpose because we're slowly feed context about her at particular times and some may detest that but honestly I think it creates a bit of a hole, but a hole you wish to fill. Even at the end, we don't fully understand her and I think that's great because it shows the future isn't going to just be smooth sailing but a normal typical relationship that has its ups and downs. In addition, not fulling understanding her makes you want to know more and for the context they do give, it's more valuable. In that regard, you'll either love it or finding it irritating so you'll just have to find out yourself.\\n\\n\r\nArt & music: 6.5\\n\r\nMusic was quite nice and executed at appropriate times and additionally the art was nice but lack true colors, in other words it came off almost mildly washed out or bland, which was disappointing since the actual art is nice but it's just the colors. I'm not saying it's awful, most definitely tolerable but it could of been more colorful.\\n\\n\r\nConclusion:\\n\\n\r\nDefinitely would recommend to people a fan of romance, I'd considered it a must but definitely isn't a masterpiece. But honestly, the rushed areas at the beginning weren't nice; in fact the anime should of added more episodes because this problem occurs all the time where developers shove too much content into episodes. But the characters are memorable for their goals and it's definitely a chill anime to watch so check it out at least.",
            "date": "2017-06-14T15:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 249913,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5324000.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheOddFox",
                "username": "TheOddFox"
            },
            "url": "https://myanimelist.net/reviews.php?id=249913"
        },
        {
            "content": "A love story that takes on not only the uplifting side of love, but the ugly sides as well.  Leaving out what a lot of other series only let brush across the surface, this one does not shy away.\r\nYou still end up with a romance story.  One that's filled with childhood roots, unrequited love, and returning memories.  Tied into that however, you get to see different kinds of love in it's stages.  While most stories will let unrequited love just sit as tension in the plot, you get the chance to cycle through it here.  There are still some displaysof it, but it takes the step and goes beyond that as well.  \\n\\n\r\nStory; 9/10\\n\r\nThe fact they're willing to show the sides of love that most people are not really brings some realistic feel to how it all plays out.  You get to see unrequited love, blossoming love, breakups, and what it's like to just not be with the right person.  It really challenges how you should reflect on situations that you are in.  If the story jumping around a lot early wasn't a little of a mess in terms of pace, I would have given it a 10/10.  Also, they took an easy out in the series that would have given me a better buy in.\\n\\n\r\nArt; 7/10\\n\r\nThe art is pretty standard.  Nothing really stands out, but nothing holds it back either.  For me, if the art is bad, I really struggle to complete any series.\\n\\n\r\nSound; 6/10\\n\r\nNothing really stands our here but that's in a good or bad way.  The story continues along with any real impact from the soundtrack.\\n\\n\r\nCharacters; 9/10\\n\r\nAgain, you get to see some dark sides of the characters.  Their struggles, what they are feeling, and what they are hiding from themselves.  Even though the plot hands an easy out for progression, it leaves plenty behind to work with.  The characters feel pain, and while the supporting cast lacks depth, to me it's not about the quantity.  The fact you get to experience so much more from them because they have to go through these situations, for me, gives me a lot more.\\n\\n\r\nEnjoyment; 8/10\\n\r\nBesides the jumpy early episodes and the easy out they provide for themselves, I was able to really enjoy the series.  It's a show that I picked up thinking I would just brush through and pick up throughout the week but ended up watching through to the end.  After spending time recently pushing through a lot of Anime, I was waiting for one to introduce something off pace.  To me, with the both beautiful and ugly sides of love put on display here, it kept me engaged all the way to the final episode.\\n\\n\r\nOverall; 8/10\\n\r\nThis would have been higher if the early story plot was cleaner.  It felt like it's something that could have expanded past 12 episodes but not quite enough for say 24.  If you love the romance genre but are looking for something closer to reality this may be for you.  I've been talking about it already, but being able to see all the facets of how relationships can play out is refreshing.  Especially in a genre where most of those are left, at best, to unrequited love.",
            "date": "2019-04-23T16:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 306978,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/423331.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ScottJC12",
                "username": "ScottJC12"
            },
            "url": "https://myanimelist.net/reviews.php?id=306978"
        },
        {
            "content": "Spoilers at the end. I'll make this short and straight to the point. I despise this anime. I only like two characters in it and one of them was supporting. The ending was beyond the realm of dreadful. They should just rename this to \"School Days 2.\" Yes, the ending was that bad. The MC is about as interesting and as smart as the many craps I took while watching this. Oh, also, about 3 episodes are SOLELY flashbacks. I found myself skipping over them too, because they held no relevance to the plot. While they gave an idea as to the relationship between theMC and his female dog of a crush, they also served no purpose and could easily have been cut out without confusing the watcher. It has good art, but that's all. It's a waste of time to even fully review this garbage. Save yourself a few hours and don't watch this wreck of an anime.\\n\\n\r\n(SPOILERS) [+Large Your Lie In April spoiler]\\n\\n\r\nOh, by the way. Did I mention how the MC's new best friend stole the MC's girlfriend from him unknowingly, and that the MC challenged said best friend to get her back? Yeah, also, best friend is dying and has surgery so that they can try to have an \"even\" playing field, but guess what? They pull a your lie in April and the surgery fails. You know what they do after that? Timeskip. Oh, and he suddenly forgot his original crush and dates the MUCH more likeable character, only for original crush to come back and ruin everything. Long story short, he breaks up with the perfect girl he had for Ms. \"I broke up with you for a guy after hearing he was dying but now that he's dead i love you again\" \\n\r\n(END OF SPOILERS)\\n\\n\r\nSeriously. I despise this. I'm not even going to give each category a rating, you can just look at these and assume what i would say.\\n\\n\r\nStory: 2\\n\r\nArt: 7\\n\r\nSound: 4\\n\r\nCharacter: 1 \\n\r\nEnjoyment: 2 (For Asuka.)\\n\r\nOverall: 2",
            "date": "2016-06-22T02:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 221472,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5494146.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Tetract",
                "username": "Tetract"
            },
            "url": "https://myanimelist.net/reviews.php?id=221472"
        }
    ],
    [
        {
            "content": "I'm sure not many people like this anime because of obvious reasons, biggest one of all is the huge emotion rollercoaster that it is, and how it was developed. Well, I do not know if  anybody will read this, but this anime will only be good for a select few because of the realism in it (not in the way that it turned out), somebody has to suffer, and almost always, it is the person least deserving of it. I know this because I am doing this right now. In my last year at elementary school I met a girl which just shook myworld, left we gasping for air, was the only thing I was looking forward in the day, just to look at her. It was the first time, and maybe last, what I experienced to be in love. Even so, I was the most shy guy, so I did not get to talk to her much, but since I was so God dang obvious, people caught up, and so did she. Turns out we both liked each other, but nothing happened due to our mutual shyness. Here's the thing, we went to the same middle school, and when I finally got the courage to, on that summer after the 8th grade, confess, she actually said she liked me back, only to see her in a relationship with some other guy on the start of 9th grade, and that fucked me up bigtime. Thing is, things did not last long with the guy, and by mid second semester, she was single, and we started talking (Yeah, I know, why the fuck should I talk to her after that, but my feelings just wouldnt go away). I actually confessed one more time, which was the last time. She reciprocated my feelings, however, she moved to a distant country on the end of that summer (Great, I know). This is where things differ from what this anime is and my own life, but it is still a great lesson for you, and will help you aprreciate the anime. Time passed, I never felt the same about anybody again. It wasnt until my junior year of highschool in which I felt alone, and i felt like i should not be suffering like this. Because of this, I dated a girl which I liked, but wasn't exactly in love with, and that's why, after a year, it did not work out, me getting bored and probably destroying the girl's feelings. Then senior year went by and I decided to just hang with by friends and all that, and it went by.\\n\r\n                 We each went our separate ways, with only 2 of my close friends joining me at the state university which I chose. On my first year of college I met this girl, which I like alot and am currently still with her, after a year, two months and twenty days (yup, im in second year on college RN). Issue is, that girl from the 8th grade, remember her? Well she came back, and although she is not on the same state university as me, she is in the one of my hometown. CAN YOU FUCKING BELIEVE IT! Even today, although I know she toyed with me, although not on purpose, and did many more things to me, I still feel feelings toward her, even though I'm very happy on my current relationship. However, if she were to pop up in front of me one day, I seriously don't know what I would do. Yes, even though I have not seen her in years, have not talked to her, I still feel a strong affection... I guess that might be the difference between your first/true love, which I think is what this anime is about, how that feeling is never fully over, as I, after 8 years, still feel it. Life is rough, relationships are hard, somebody has to suffer, and sometimes, it is the person me want to suffer the least, but either we just go with the flow, or we step up, do what we have to do, and accept the consequences head on.\\n\r\n                Sorry, I guess its not much of a review but a vent huh... But, for some reason, I think this story will be truly useful to you guys wondering if this anime is worth watching. For me? It sure as hell was\\n\\n\r\nPS. Sorry about grammar and stuff (especially since by my age, I should be writting properly) but it's 2 am over here and I am quite tired.\\n\\n",
            "date": "2017-02-27T22:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 241577,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3518185.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tsukaimakirito",
                "username": "tsukaimakirito"
            },
            "url": "https://myanimelist.net/reviews.php?id=241577"
        },
        {
            "content": "By way of storytelling that uses flow back and forth, not just anime is immediately able to become curious because it gives a kind of mystery, he also managed to give astrong foundation to the story immediately explain the fact that started everything, which is why Haruto until compelled to pursue Yuzuki to Tokyo. But strangely, at the same time, this anime overlook one other important facts, whichis why it's time Yuzuki had to suddenly return to Tokyo. Although later it became less relevant, there are questions that have overshadowed when the story between Haruto and Yuzuki kept walking. If they are so fond ofeach other, why then they split up? But on the other hand,in spite of the problems surrounding theirpast, including about how many times the actual Yuzuki visiting Hiroshima, it still presents drama anime Haruto and Yuzuki quite nice. He was not anything special, but at least this anime is able to provide all the fans of this genre will want. Poignant moments or moments adorable, there is a true curiosity that appears when watching this anime to see if in the end will Haruto along with Yuzuki or not.",
            "date": "2017-02-24T14:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 241293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241293"
        },
        {
            "content": "Romance genres are very difficult to find, and at that, the small category you find will be 99% love triangle based animes that all are similar in turnouts. However, this anime attempts to step out of the boundaries and try a lot of different stuff, where at times two seem in love or there's a love pentagon. Not that this is a bad idea, it's just the cluster of emotions and how much the show tries to tackle at once causes it to be detrimental to my enjoyment.\r\nI have not read the manga, and I am going into this review, not with the mindset of\"the manga is better and the show fucked up\" but that the show is just not worth your time and has no polarizing or memorable moments at all.\\n\\n\r\nStarting off with\\n\\n\r\nStory: 2\\n\\n\r\nThe show starts off with a boy leaving his small city, heading for the big city chasing a girl who left. The show is asking for a rather sublime and bittersweet reaction when reacting to the twists and turns taken that are taken. Going into detail later in the character portion, you can honestly take characters (Yuzuki's sister) and turn their part of the story into just a normal backstory explained for around 5-10 seconds however it's mainly to have more time due to the creator trying to pull off too much in a show that shouldn't be that complex. Although there being intriguing parts, there is so much unnecessary fanservice, characters, plot points and in general, the whole show is irrelevant and doesn't contribute to a larger picture and is rather contradicting at times with the main message it's trying to portray. Which leads me to give it a score of 2.\\n\\n\r\nArt: 3\\n\\n\r\nNothing special. Lighting doesn't go with the characters and doesn't look clean most of the time. The writer favors more people with blue and brown hair and choosing a generic main character to lead the atrocious story. You can easily find characters from other shows that look identical to the ones in this show with low uninfluential and lazy art style with making the characters distinct and stand out.\\n\\n\r\n Sound: 1\\n\r\nThis is probably the worst sound/music in anime I've heard. OP and ED are ok, not that bad, but the TIMING in the show\\n\r\nexample, say a joke, have a lil funny bright song play\\n\r\nsad, play a sad song\\n\\n\r\nBUT THE SHOW DOESNT THINK HEY MAYBE ITS A GOOD IDEA TO THROW MUSIC IN TO FIT THE MOOD, WHICH LEAVES ALL OF THE INTEGRAL SEENS LACKLUSTER IMPORTANCE. YOU SEE A CHARACTER CRYING OR FIND OUT SOMETHING PLOT TURNING HAVE GOOD SOUND AND HAVE COMMON SENSE, DON'T JUST DO NOTHING.\\n\\n\r\nWhich leads me to my Characters: 2\\n\\n\r\nHonestly, like I said before the show is just a gigantic clusterfuck of emotions that the writer does not know how to portray properly and give characters roles. The emotions felt at times and the way the show just crams everything into one sole character is confusing at points and leads to misleading turnouts in a lot of plot points in the show. Other than the characters being annoying bland every possible thing you can hate in a character. Which leads me to my score of 2\\n\\n\r\nEnjoyment: 3\\n\\n\r\nI'm a heartthrob for lovey-dovey scenes in any romance, and that's generally what is keeping the show from being a failure at romance in general with being super frustrating at points. It's just disappointing in general and tries too hard to be different and have head-turning moments when they don't have a clue what to do after or handle moments correctly.\\n\\n\r\nTherefore, due to the horrific story, generic and saturated trash called art, truly terrible story, bland n uninteresting characters, and little to no enjoyment from this show I leave without a single feeling on my tongue with how bittersweet this show was; \\n\\n\r\nLeaving my overall score at a 2",
            "date": "2018-12-08T21:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 295475,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6434242.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 1,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/RogueTheWeeb",
                "username": "RogueTheWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=295475"
        },
        {
            "content": "I've been reading the manga since the last 2 years. I quite enjoy it then stopped. It got boring maybe because I saw no ending to it AND maybe because there's many readers that they won't put an ending to it. Wait, I'm not here to talk bout the manga, WELL, i realized the story is very good for it has finally became an anime. The anime is not as good as the manga thou. But you must give it a try coz the twist of the story is really3x great!\r\nThe story is about a hometown boy named Haruto who chased a girl to thebig city because he realized he loved her. That girl is Yuzuki Eba. Yuzuki is a city girl from Tokyo who went to Haruto's hometown to study because her father sent her there. But the truth is, Yuzuki is also looking for the promise boy she met when she were a kid, and that is Haruto. They lived in the same roof. But Haruto doesn't seem like Yuzuki(maybe coz Yuzuki is a little clingy, and flirty. LOL). When Yuzuki is about to leave the hometown, Haruto saw a picture of them when they were a kid. And that thing gave Haruto a hint that Yuzuki is being like that because he promised something to Yuzuki.\\n\\n\r\nThat's all I wanna share. The story is really great, like, you'll be surprise most often.\\n\\n\r\nP.S Haruto is HOTTER in manga BELIEVE ME. Ck it out!",
            "date": "2014-06-17T00:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 147313,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2780635.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/chlorain",
                "username": "chlorain"
            },
            "url": "https://myanimelist.net/reviews.php?id=147313"
        },
        {
            "content": "Before I start I'm gonna say that I watched this anime and then read the manga afterwards.\r\nI know many, many people would say things like \"anime should not be compared to manga\" etc etc. HOWEVER, in this case I feel like this anime was a complete disgrace to the manga and mangaka himself. \r\nBut get this: this anime adapted 144 CHAPTERS from the manga into 12 EPISODES. Anyone with a right mind would think that's bizarre.\r\nThe anime starts at chapter 80 in the manga, and \"tries\" to make a decent story from there by making chapters 1-80 into a 2 episode flash back and thengoing from chapter 80-144 in only 10 episodes. Because of this, from an anime only point of view, you never know why the MC even likes the main heroine in the first place, and the beginning of the anime starts at such an awkward place that it's hard to connect with how the MC is feeling. It would have been fine if this anime just started from chapter 1, so we could have a fresh start with the characters rather than starting the anime with a character that's supposed to have gone through a lot of insane development already. The flash backs barely help because it's a MUCH different experience to watch flash backs than seeing those events actually happen chronologically. To make matters worse, the ending to this anime was so dry and abrupt that it basically forces you to read the manga. Anime should be able to stand alone without a manga, right? Well this anime is simply mediocre without reading the manga.\\n\\n\r\nThe art is actually pretty nice. The opening looks beautiful and the characters are true to their manga forms. However, sometimes the art on certain characters look off. Other than that the art is great.\\n\\n\r\nThe characters are one of the main problems in this anime. The characters simply lack development. The set-up for this anime makes the MC look like a stalker and the main heroine look like an a** hole, but if you actually know what truly happened in chapters 1-80, you'd know why the MCs act the way they do. The anime rushes development for the side characters as well due the fact that there was 144 chapters adapted into a 12 episode anime.\\n\\n\r\nFor enjoyment, I was simply left hanging at the end. At the end of the anime, I felt like I wasted my time. The events were so weirdly scattered, and I could barely connect with the characters until, BAM, the anime was over when things started getting good. It's really sadenning for anime only watchers, cuz the manga actually goes on for another 100+ chapters after it ends at the anime, and the anime skipped tons of chapters from the beginning. It's simply a mess.\\n\\n\r\nI would ONLY recommend watching this anime if you have read the entire manga already. I only consider this anime as eye-candy, meaning that I would only watch this to see how the manga would look animated. And it's definitely not bad in the animation/art department. But storywise, this anime is just mediocre at BEST. The manga is a masterpiece that should have gotten a true anime adaptation. Sadly most animes nowadays are just \"trailers\" for the manga, and this anime is a perfect example of that.",
            "date": "2015-08-14T21:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 196192,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4772806.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JTLouie",
                "username": "JTLouie"
            },
            "url": "https://myanimelist.net/reviews.php?id=196192"
        },
        {
            "content": "If you plan on watching this anime, then allow me to give you a fair heads up: it is best to read the manga first. \r\nI found that this anime (same with the OVA's) are more orientated for the fans of the manga, it gives off a vibe of nostalgia. \r\nObviously the anime has some pros and cons, but note that I view the shows differently, and as far as a review goes, this is my first.\r\nStory: It is pretty basic. Boy meets Girl, Boy loses Girl, Boy gets Girl back, happy.\r\nHowever in this case, you can by-pass the \"Boy meets Girl\" part, and addalot of little twists and troubles in there. \\n\\n\r\nArt: There are times when the animation seems to be sloppy, as if at times the animators said \"meh..no-one will notice..\", and the faces appear to be very generic, but that's about it. The background/scenery art was pretty cool, and at times when there was a still frame, they made it look like a water colour based painting.\\n\\n\r\nSound: Voice acting was good, alot of emotion put into the acting. Also the 2nd Ed (end of episode 6?) made me cry, the music (and the music throughout) suited the anime. If it was sad, the music gave that vibe, and so-forth.\\n\\n\r\nCharacter: Well if you watched the anime as an introduction to the series, you may not be too attached to the characters. Haruto is the indecisive protagonist, Eba is \"the one who got away\" (literally!) and the MC's main love interest. However! All the characters can be relate-able.  What ever decision Haruto made, you can see where he's getting at and understand why he did as such. you feel for Eba when all is revealed why she left Haruto, and the interactions between the two (and all other characters) is heart wrenching. \\n\\n\r\nNow I for one greatly enjoyed this anime. It gave me nostalgia, made me cry, made me want to falcon punch my laptop so many times, and made me happy. If you want to watch a show that tugs on your heart strings and can make you feel empty at times, the I recommend this. HOWEVER! I highly suggest you read the manga, or up til vol 10 (therefore you know the characters and understand the anime's setting) If not, then the OVA's do a re-cap of the first 5 or 7 volumes of the manga.",
            "date": "2013-10-12T10:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 116579,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2267419.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/badassdude1995",
                "username": "badassdude1995"
            },
            "url": "https://myanimelist.net/reviews.php?id=116579"
        },
        {
            "content": "So, where to begin with, after a good dose of sleep and reflection about Kimi no Iru Machi (A town where you live), I’ve been able to flush this huge dissatisfaction of mine. So today, I’ve decided to write a review of Kimi no Iru Machi, which through my opinion, deserves criticism for its overall entity.\r\nLet’s have a review:\r\nIt’s plot is  said to be portrayed  as drama and romance, however ,this is not it! Yes it depicts slice of life; however, this one is rather characterized as tragic romance.  Here, the plot is a retrospective one whereby it moves from the presentto the past from time to time, yet it gives no time for the viewer to adapt to this gigantic melancholic scenario. Kimi no Iru Machi, is a typical love story where the main character Haruto Kirishima principally has a crush on a girl Kanzaki Nanami but at the same time spends most of his time with his childhood friend Eba Yuzuki whom he disliked at first. As the anime progresses those two friends developed in terms of relationship but broke up as Eba Yuzuki went back to the city of Tokyo. Haruto sets on a quest to find her in Tokyo but meets with new acquaintances. There is more than this. Personally, this anime deserves a 5 for its story line whereby I could not find any such happiness in the atmosphere surrounding the main characters. This anime fails to develop primarily due to its 12 episodes show.\\n\\n\r\nAesthetically speaking, the anime is directed with a high sense of realism. The characters are drawn with a touch of realism so does the background. There is nothing spectacular about this anime as its effect give a sense of uneasiness, coldness and fluster the viewer with frustration. Nevertheless, one positive point is that, the production has been able to demonstrate, though slightly, the difference of atmosphere of the countryside and the city. Kimi no Iru Machi deserves a 5.5 for its well drawn characters and atmosphere; however this rating does not go beyond that. \\n\\n\r\nFurthermore, this anime does not propel the viewer to something deep and enjoyable through its music. As for me, I skipped the Opening song as well as its ending while watching this anime progression because I was crammed with frustration.\\n\\n\r\nFinally it comes to the characters. I despise both Haruto Kirishima and Eba Yuzuki for their irresponsible attitude towards each other as well for other characters of the anime. Besides, for it only 12 episodes show, it gives no time for the viewer to create a bond with any specific character except for one, namely Asuka Mishima. As for Rin Eba, another likeable character from my opinion, deserves an A+ for the way she treats Haruto. \\n\\n\r\nWell, well,  my opinion may be bias by personal experience however I dislike this character for his irresponsible attitude towards his ex girlfriend Eba Yuzuki and Asuka Mimishima. There is nothing spectacular with this typical guy whose main concern is about mundane things. He acts impulsively and never measures the weight of his acts. What I dislike the most is that he find hopes in the end of the anime, though one may be happy for him, this character lacks maturity in decision making and acts like a spoil teenage guy.\\n\\n\r\nEba Yuzuki, is the main protagonist, also characterized as a typical girl that has nothing extra ordinary but it still through her charm and beauty makes people attracted to her. However, personally, I dislike her because of her helplessness of making the right decision. Though being a joyous character, she acts like nothing matters and complicates everything. Both Yuzuki and Haruto make this anime frustrating to watch as they dull the atmosphere which from my point of view creates sadness  but yet they reject what other characters think of them. Finally those two do not fit each other because I could not find happiness in the end and again they fail to arouse the sympathy of the viewer. For me the characters(especially Haruto and Yuzuki) merit a 5 except for Asuka Mishima and Rin Eba who gladly meet my expectation and so are given a rating of 8.\\n\\n\r\nHmmmm, by reading this, you might already note my level of enjoyment, Kimi no Iru Machi has only generated the negative sides of my thoughts. My heart ached while watching this anime and has spoiled my entire day. Maybe for that I’ll give it a 5 because it has been able to leave a scar in my memory. Nevertheless, nevertheless, in overall, I’ll give this anime a 4 out of hatred.\\n",
            "date": "2014-06-28T04:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 149073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3768133.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nive_m_1",
                "username": "Nive_m_1"
            },
            "url": "https://myanimelist.net/reviews.php?id=149073"
        },
        {
            "content": "''If you are not happy, I'll be here, dont forget that'' \r\nThis Anime really was one of the strangest Animes I recently watched. Don't missunderstand me, its not weird in a ''The-Characters-are-totally-strange-Over-The-Top-I-Dont-Understand-One-Thing Manner. \r\nIts just the hole plot of the Anime. It has a huge amounf of potential which destroys itself by one-dimensional, totally dump  & unrealistic acting main characters. Before beginning, I should mention, I only watched the anime. So this review is based on my experiences with the anime series only. \r\nSTORY\r\nThe male two main protagonists are Eba Yuzuki & Kirishima Haruto. The Story itself might sound simple if you read itthe first time. Girl moves from Tokyo to the country side to join a school where her beloved boy studys. The boy, Haruto-San, doesn't like the idea of not only going to school with a foreign girl, even living with that girl together. At first, all that stuff sounds weird, more so it's like a joke. When I read the description the first time, I really thought, ''Oh no, really? unrealistic scenario incoming!''.\\n\r\nBut its not. The move of Eba Yuzuki, the main heroine, is been described in a conceivable explanation. That was a surprise, I didn't expect. Actually, the story sounded pretty interesting after eliminating this potential of missunderstanding. \\n\r\nLong story short: The plot of the Anime has a good amount of potential but lacks extensviely in the rest, which I will explain now.\\n\\n\r\nART\\n\r\nWell, what can we expect from that Anime regarding to the art- & animation-design? First of all we should really look up when this anime was published. Kimi no Iru Machi is from 2013. So right now as I'm writing the review to Kimi no Iru Machi, we are talking about a difference of 2 years.\\n\r\n At no time, really no time, I felt that this Anime is really from the year 2013. More so, the art & animation really gave me the feeling, that the animations and the general art-design had to be older. The unfluent, robotic animations  appear like, the anime was published in 2009 or 2010. The moves of the characters, in particular when they are running or even slowly walking appear ludicrously robotic, the colour-design expecially from the nature appears woolly & unfinished. Even the hair-styles of the main- and secondary characters seem like, they are from the late 90's and beginning of the 00's. \\n\r\nIn contrast to that though, you have a beautiful art-design when it comes to Tokyo and the nereby surroundings. Especially at night, you notice a huge amount of light effects additionally with the awesome designed skyline of Tokyo. Nonetheless, at the end making bad design desicions regarding to the character- & nature art can't compensate the wonderfully animated city panorama.\\n\\n\\n\r\nSOUND\\n\r\nWhen it comes to the sound of the anime I can shortly summarize it as ''mediocore''. Allthough the anime has  drastical and important turning points the sound in general is NOT doing it's  job in supporting the plot, in particular the dramatic situations. At least, it is not horribly bad at all.\\n\\n\\n\r\nCHARACTER\\n\r\nThe Characters, the meat and potatoes when it comes to creating a decent anime. Allthough this section is one of the most important aspects for the success, Kimi No Iru Machi totally fails at this point. The main problem is the  totally nonexistent empathy for the two main protagonists Eba Yuzuki & Kirishima Haruto. Both are acting in a totally scripted & iditotic manner without any sense at all. What I mean is, both characters appear totally unlikely & implausible. At no time you have the feeling of dealing with natural human beings. Instead you deal with an extreme version of stereotypes, even unusual for animes. One unrealistic conversation follows the other. Actually at various situation during the series I felt embarrassed for the characters. Kirishima ''retard'' Haruto is acting like a 14 years old boy who discovered love a few minutes ago. Eba Yuzuki is one more character whom I didn't feel any kind of empathy for. She trys to act ''kawaii'' but appeals unrealstically dump. Since in Japan this kawaii-stuff is crucial when it comes to creating a female character, Eba Yuzuki fails in every single aspect. The authors tried to pigeon-hole Eba  into the kawaii-drawer and this came out. Unnatural character acting not comprehensible, appearing like an onvoiced secondary character, allthough she is the main heroine besides Haruto. \\n\r\nThe only credible characters in the anime were a handful of secondary characters, especially Mishima Asuka & Eba Rin, the younder sister of Yuzuki-San.\\n\\n\\n\r\nENJOYMENT\\n\r\nAll in all I still enjoyed watching the anime. Sometimes it is okay watching animes that are not outstanding and deal with problems in character creation and art-design. Sadly, the anime had the potential to be more then mediocore. But the fatal & unrealistic characters compared with the  squishy art design can't mask the lack of common theme.\\n\\n",
            "date": "2015-07-08T18:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 192754,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4565618.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Te-nori-Taiga",
                "username": "Te-nori-Taiga"
            },
            "url": "https://myanimelist.net/reviews.php?id=192754"
        },
        {
            "content": "Short and sweet review. Do you know what to expect from romance anime and are tired of people pointing out the \"genre stereotypes\" and then judging the anime around that? Just want to know if you should watch it? I've got you covered.\r\nSo this was just a standard romance anime for me. It wasn't bad. It wasn't amazing. It was just good. Solid example of the genre. Animation looked unique, but wasn't particularly amazing for me personally. \r\nStory is standard love interest with feelings realized too late, a plot twist mid story that pits friends against each other, and some more twists near the endthat lead full circle.\\n\\n\r\nHowever, the beginning of the show is a little weird. The timeline is all over the place, since they kinda throw you in halfway through right out of the gate and use flashbacks to fill in the story over the course of the first few episodes. This initially turned me off and I put off watching this for a while. I eventually came back to it and once you watch the first couple episodes everything starts coming together story-wise once you have some of the flashbacks under your belt. Additional flashbacks happen throughout the short season. I like the time skips ahead, which serve to advance the plot and create additional drama due to the short nature of the show.\\n\\n\r\nIf you've exhausted better options already, this is a good show that won't leave you feeling disappointed. Plot points are tied up and the ending is mostly happy. Just don't expect the moon and you'll enjoy it.\\n\\n\r\nHIGHLIGHTS: Short and to the point, plot twistsssss, time skips forward, Solid young romance anime entry\\n\\n\r\nDISAPPOINTMENTS: Time skips backwards, a little too short and to the point, plot twistssssss, nothing really stands out.",
            "date": "2018-09-03T23:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 288087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7337737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/joeschmo2000",
                "username": "joeschmo2000"
            },
            "url": "https://myanimelist.net/reviews.php?id=288087"
        },
        {
            "content": "I honestly love the Author of the manga it all started when i watched Suzuka when it got to the end i decided to read the manga to you know get a feel of how it really ends and it was amazing I read Fuuka the squeal it was great. Then i saw this and instead of reading the manga i decided to watch the anime i was extremely disipointed i was bored, confused and discontented from the character. Why BECAUSE THEY START THE ANIME OVER 100 CHAPTERS IN TO THE STORY! Why would you think that it was a good idea to skip themost important development to your characters that sets up the part you adapted and i dont care that it has an OVA you shouldn't have to watch the OVA to get a little more clarification to what the hell is going i have never been so insulted by an adaptation that i didn't even frigging read. I can enjoy Tokyo Ghoul root A I like Chunnibyo demo ga shita season 2 but this just pisses me of i will probally hate this less when i read the manga but that shouldn't be a necessity",
            "date": "2016-09-25T17:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 230215,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298802.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Somecallme_kj",
                "username": "Somecallme_kj"
            },
            "url": "https://myanimelist.net/reviews.php?id=230215"
        },
        {
            "content": "İnsanın moralini bozmak için 1'e 1 olan bu animeyi izlemenizi tavsiye etmiyorum.Ana karakter bildiğin abaza.İlk önce bir kızdan hoşlanıyorum diyor daha sonra uyuz olduğu kıza yazmaya başlıyor en sonunda başka bir kızla işi pişirmeye kadar götürüyor.Sonra eski kıza yeniden dönüyor falan feşmekan.Sondaki kıza mı üzülsem yoksa uyuz olduğu kızın yaşadıklarına mı bilemedim.Hikayeden gitsek diyeceğim çok fazla soru işareti var ben mesela Eba'nın hala neden Tokyo'ya geri dönüp ana karakteri bıraktığını çözemedim.Ve tabi bu karakterin ilk başta yiyiştiği bir kız daha var o ne oluyor anlamadım kankayız diyor sonra yiyişiyorlar sonra ne yani WTF? La başlayacam aaa bir türlü kabul etmedi daha uzun bir eleştiri yazdaha uzun bir eleştiri yaz sıçtırı boktan sistem yapmışlar buraya.",
            "date": "2016-09-25T05:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 230135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5701798.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MetalistPunk",
                "username": "MetalistPunk"
            },
            "url": "https://myanimelist.net/reviews.php?id=230135"
        },
        {
            "content": "Okay so the first few lines will be a quick and short assessment of the anime for those who want to watch this abomination:\r\nThe anime is decent, and the plot is good with some unexpected twists...However, by the time you end the anime you will probably hate the MC very much and his love Eba Yuzuki even more.... \r\nP.S. The ending is actually bad imo....\r\nOkay so now for a detail review: (Possible Spoiler Alert from here on)\r\n-Story Analysis: The overall plot is done well since in some of the parts you will expect the expected but something completely unexpected will happen.... for example it nevertook me long to predict that Kyousuke's gf would be Eba... that was so easy to predict, however, Kyousuke's death was something I did not expect. \\n\\n\r\nThe overall plot building is nice, but the MC makes a ton of weird decisions which dont seem natural at all. Yes love is confusing and getting over your Ex-gf is hard and can be a cumbersome feeling.... However, Haruto will piss you off and many places you would be left thinking what \"d**k\" of a person.... like how the hell does a guy like him have girls falling for him.... seriously turns annoying by the time you reach the last 3-4 episodes in this series.....\\n\\n\r\nSound: Well nothing to talk about here its okay but nothing amazing\\n\\n\r\nCharacters: Done well in my honest opinion, however, at some places it will remind you that you are watching an anime from Perhaps the 80's even though this anime has been released in 2013 lol.\\n\\n\r\nEnjoyment: None tbh... since the way Haruto ends his relationship on a whim with Asuka without even giving jack s**t ...... Like after all his screwups.... the thing that pissed me off the most is the way he breaks-up with Asuka... I swear if I was in that world I would shoot Haruto and marry Asuka.... \\(-_-)/\\n\\n\r\nOverall: An anime with great potential and a possibly a great plot which will only make you want to watch the next episode just so you can believe that everything will be alright in the next episode, until you realize you are out of episodes to watch and things instead of getting better will only get worse....\\n\\n\r\nNot a recommended anime..... however, if you have nothing to watch and are in for some drama you can surely waste time watching this....",
            "date": "2018-04-26T21:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 279100,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2385025.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KiyoShin1992",
                "username": "KiyoShin1992"
            },
            "url": "https://myanimelist.net/reviews.php?id=279100"
        },
        {
            "content": "I feel like, to me, this one was a little predictable. Maybe I’ve seen way too many romance anime in my lifetime. I don’t feel like there is anything wrong with it, but I just sort of feel moth about it. From Haruto’s perspective, I get it. New, charming, energetic girl comes into your life; you feel all of these new feelings and experience all of these new experiences, and then she suddenly walks out of you life without any warning leaving you unresolved and upset about how things turned out. I get that. But for me, Yuzuki just could not pull on my heartstringsor do anything for me. I just couldn’t get it. \\n\\n\r\nI could relate to Asuka very well and I really liked her character. I really feel like I “got” her. Haruto even said it himself, se’s the perfect girlfriend; and for every reason he listed about her, was the reason I thought the same. Now, while I think about all these things about both Yuzuki and Asuka - Haruto included, it’s not enough. There is just not really enough there in the writing, I feel like, for me to really connect with these characters. I really tried to pay attention to what was unsaid in their nonverbal interaction because I felt like maybe if I did that, I would understand more, and that wasn’t the case. So, I like the direction of where the plot was going, but I just can’t latch onto it. There isn’t enough, and so trying to put my thoughts and feelings into this review is a little hard for me because the anime use left me scatter-brained about everything. \\n\\n\r\nOverall, it’s good, but the writing and character development is lacking.",
            "date": "2017-12-02T01:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 264343,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721951.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Witcher151",
                "username": "Witcher151"
            },
            "url": "https://myanimelist.net/reviews.php?id=264343"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nAlso I should notice, this is a bit of odd/unique case. Precisely this is probably the first Anime where I read Manga first before watching Anime. Reasoning for that would be that Anime skipped first 60 chapters or so of Manga. Thus I decided to pick up the Manga before watching Anime. Manga I absolutely loved, and Anime version of this work I pretty much watched right after manga [few days inbetween). \r\nWanted to add +1 score modifier because of this, but scratch that Idea. Even ifI love romance genre, I don't want bump up score for such reason.\\n\\n\r\n✦Story\\n\r\nWell, to not write exactly same thing as I did for Manga, I shalt keep the common element short. TLDR; Beautiful and dramatic pure love/vanilla romance with the shade of moronic drama.\\n\\n\r\nWell, it would be just romance without stupidity factor that I call drama. (that what makes drama, drama)\\n\\n\r\nSo anyhow, I should probably mention the Issues I had with this Anime (might be also somewhat affect from reading beforehand). Main Issue I had with it, was the world was less richer, lot of characters didn't get the affection they deserver in its Animated glory. Also the first 60-80 Manga chapters were skipped in Anime, but presented somewhat in flashbacks form.  Basically, to rate by Anime itself as standalone, it was okay for most part. But with only 13 episodes,  it just didn't build itself up as good. Felt as many important factors were not present, emotions deliverance was a tad weak, rushed story. But in the end it was enjoyable and for most part pretty vanilla romance/pure love/successful true love and so on. Finale was acceptable I guess, though kinda was closed with a \"scar\".\\n\\n\r\n✦Art\\n\\n\r\nFirst all let me get this off the chest. It's different from Manga that's for sure, and not in enjoyable direction.\\n\\n\r\nAnyhow, the Art/animation of this Anime felt quite a low budget. Characters and shading felt oddly weird and not as beautiful I remembered it from OVA (quite different feel from Manga as well, if matters). Animation felt at times very cheap or simply not packing enough punch. With budget choices artistic scenes were for the most part actually quite a nice touch. Should add that the camera angle switches, characters constantly moving, was obnoxious at times. Don't try shaft, you didn't succeed.\\n\\n\r\nFanservice, \"meh\". (if matters, then very toned down and plain in comparison to Manga, where I absolutely loved it, but as have to mention again. They are quite a different things)\\n\\n\r\n✦Sound\\n\\n\r\nVoice acting on some characters felt somewhat bad. Also hated how actual children were voice acting in some flashback sequences. That just sounds horrible no matter where.\\n\\n\r\nOpening song was okay, but ending I absolutely loved. \"Kimi No Iru Machi\" songs, not the Kazama one.\\n\\n\r\nSoundtrack itself I have mixed feelings about. It definitely had presence, but it also had very odd style. In odd in a way I wasn't fond of.\\n\\n\r\n✦Character\\n\r\nKind yet indecisive main guy, wanted to hurt noone, kept also at some things his distance and so on. Main girl cheerful, but not honest with herself.\\n\\n\r\nLot of cute side-characters. Some tomboys as well, and some that sadly didn't get barely any screentime.\\n\\n\r\nKanzaki and Kiyomi were my favorite.\\n\\n\r\n✦Enjoyment/overall\\n\\n\r\nFirst it disappointed me, gave it 6, then I could get into usual mindset that Manga/Anime are 2 different things. Watch/read them as different pieces of work. Then I could enjoy it a bit more, halfway I could give it 7.\\n\\n\r\nYes, I did have quite some parts that disappointed me, but the core of pure love and their struggle in a moronic drama, remained. Thus I in the end, enjoyed it. But I simply couldn't enjoy it as much as I did manga. Many important factors were missing.",
            "date": "2017-09-04T04:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 256866,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=256866"
        },
        {
            "content": "Kimi No Iru Machi is a Japanese shōnen manga written by Kōji Seo. The love/drama story which has captivated many readers all over japan finally earned a animation. Originally starting with 2 OVA's. The series takes place in the Author Seo's hometown and is a character-driven romance set in the same universe as the Suzuka manga . It follows Haruto Kirishima, a self-conscious teenager, and Yuzuki Eba, an extroverted teenage girl who moves from Tokyo into the Kirishima family's home in Hiroshima Prefecture.\r\n-Story & Overall-\r\nTo be honest this adaption is not living up to standards set by the manga. The manga itself has been runningfor four years strong so as a reader I did have high expectations for Gonzo and TV TOKYO. They have a great story in there hands which in my opinion is on par with the better romance/drama anime out there. With that said it doesn't mean I downright hate the adaption. It's just hard to comprehend how a great story can be slimmed down to likes of a 12 episode run. With the format they have with running flashbacks and then reverting to present will take a toll on the readers and those who have not read the manga, If the adaption was a 24 episode series and maybe a different animation studio this could have been a masterpiece.\\n\\n\r\n-Art-\\n\\n\r\nArt may seem like a little aspect but in reality its those awe moments that art really has an important factor. In the anime the art might come as a surprise. Its unique in its own aspect. The use of rich vibrant colors really brings out the character designs and features. It also beautifully enhances the environment and gives those awe moments there impact. On the downside the animation can be choppy at times almost seeming slowed down. Excluding the animation the overall look of the scenery and character really brings out the story and was pleasure to be seen by me as a reader.\\n\\n\\n\r\n-Sound-\\n\r\nMusic wise it was on point with how the moments were and the feelings in the air. With the great music provided, the moments where music and scenery collided, the collaboration was effective and was a pleasant surprise.\\n\\n\\n\r\n-Characters-\\n\\n\r\nHaruto Kirishima-\\n\\n\r\nFor those who haven't read the manga the Main Character is with the highest tiers. The sad fact is the adaption couldn't portray him as good as he was in the manga due to the limited time constraint. He is a good Main Character who won't cause you to yell at the screen ask WTF?. Everything has reason and his are acceptable.\\n\\n\r\nYuzki Eba-\\n\\n\r\nThe heroine of the story, the damsel in distress. She a beautiful young women who has history with are MC. Its either you like her or you don't. For me my reasons are based on the manga.\\n\\n\\n\\n\\n\\n\\n\r\n-Enjoyment-\\n\\n\r\nThe enjoyment is there and its fairly good. The reason I can enjoy this story so much is that I can relate to the Main Character and the situation at hand. The story isn't something conjured up and not bound to happen. If anything it's happen to a fair amount of us. It provides a good story on a battlefield called love.\\n\\n\r\n+ Good Story Line\\n\r\n+ Good Protagonist\\n\r\n+ Awesome Girls\\n\r\n+ (NO) Excessive Fan Service\\n\\n\r\n- 12 episodes\\n\r\n- Choppy Animation\\n\r\n- Complicated for (NON) Manga Readers\\n\\n\\n\r\n-It's either you love it or you hate it. For those who think that it was the latter, I highly suggest you read manga. You won't regret it.\\n\r\n-Sorry to all you Manga Readers who are in love with the adaption, the truth hurts.",
            "date": "2015-09-29T11:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 200087,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3068181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OGOTAKU",
                "username": "OGOTAKU"
            },
            "url": "https://myanimelist.net/reviews.php?id=200087"
        },
        {
            "content": "This is easily one of the worst series(both anime and manga) I've ever partaken in.\r\nIt basically just fawns over the idea of recklessly chasing after something that you know is wrong and hurts everyone around you. It hints an idea that the moral of the story is about maturing past poor decisions and making the right choice in life... only for the story to fall into contrivances just to keep the god-chosen girl as the winner no matter the circumstances.\r\nThe manga is not just double as guilty of this as the anime, but it's 3-4 times as guilty. It's an absolute dumpster fire of plotcontrivances.\\n\\n\r\nYou'd think that this was based on a bad visual novel because of how bad the story is. But in fact there are objectively many \"bad\" visual novels with much better adaptions. I'd go so far as to say there are bad visual novels better than the manga in general simply from their basic idea and the ability to enjoy how cheesy or bad they are.\\n\\n\r\nThis series is just... a dumpster fire about the childish fantasy that \"Everything works out in the end\". Even \"Moe\" anime's can get the basic premise of how life works and people grow as individuals, but this anime refuses that concept and tries to give an instance where being a complete jackass works out through bad writing.\\n\\n\r\nDon't touch it. Just... don't. Not even the manga because it's much worse in every aspect except character development, which exponentially makes everything else worse as a result.",
            "date": "2017-08-03T12:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 254601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845968.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Jebus_Kreist",
                "username": "Jebus_Kreist"
            },
            "url": "https://myanimelist.net/reviews.php?id=254601"
        },
        {
            "content": "Kimi no Iru Machi. Where to start with this one... Well, for one, I did NOT enjoy this anime. I'm usually quick to drop series that I'm not into that much, but I wanted to try giving it more time to interest me. So, did this series interest me? Yes, in a way, it did. I wanted to know if the story goes further downhill or if it gets any better along the way. \r\nFor me personally it just got worse. I suppose that if I tried really hard, I could find some moments where the story had gotten little better for a moment hereand there or a character made a smart decision for once, but if you look at the bigger picture (like this anime overall), those little things are so insignificant, they‘re not even worth mentioning.\\n\\n\r\nThis anime tries to take a more realistic approach to relationships and love, and while I think it’s worth praising for that, I just can’t help but feel that it fails miserably.\\n\\n\r\nTo quickly go over the aspects of the anime:\\n\\n\r\nStory: It had some potential, the idea wasn’t bad, though I feel the approach and execution of it was.\\n\\n\r\nArt: Not the best I’ve seen, but not bad either. No complaints here.\\n\\n\r\nSound: The soundtrack was probably my favorite part of the show. The OP song stood out the most to me.\\n\\n\r\nCharacter: Only 1 or 2 of the characters were at least ‘ok’ to me. Plus, the story didn’t favor them at all and they ended up… Well I can’t say, because I don’t want to spoil anything if you DO decide to watch this series.\\n\\n\r\nEnjoyment: Can’t say that I completely despised watching this anime (wouldn’t have managed to finish it if I did), but I definitely can’t say that I had a good time watching this either.\\n\\n\r\nOverall: Kimi no Iru Machi tried to do something different, but unfortunately, it failed. I would not recommend watching this anime.\\n\\n",
            "date": "2017-08-03T11:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 254597,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201503.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Akan3",
                "username": "Akan3"
            },
            "url": "https://myanimelist.net/reviews.php?id=254597"
        },
        {
            "content": "NOTE: If there’s source material I am unfamiliar with it and cannot be bothered to check.When I read the synopsis, I was expecting something with a little more mystery or dynamic. What I got was my third most loathed thing in anime, inexplicable poor decision making. So I’m into the idea of a guy and a girl falling in love and she vanishes on him as swiftly as she came into his life, and him following her to Tokyo. But…\r\nLong story short my issue with this series is it doesn't explore the psychology of the characters. Why are they making these decisions that sane peoplewouldn't? Not once is a satisfactory answer given for their behavior. “Well the power of love conquers all.” Actually it's depicted here as selfish and​ mean. I could forgive that if they explained why.\\n\r\n[spoiler]\\n\r\nHaruto and Yuzuki love each other and there's an obstacle. But once the obstacle is gone they don't get together. And then, 1 - 2 years later the second they see each other again their feelings are rekindled. So, which is it Haruto? Drop everything and chase the girl you love or understand the reasons you two can't be together? The same goes for Yuzuki just in reverse. When they can be together, they're not. And they only pursue each other when they shouldn't. And they do this with no regard for any other person's feelings when they’re involved. It's just tedious to watch.\\n\r\n[/spoiler]\\n\r\nThe art, music and voice acting are par for the genre and era. Honestly I can recommend it for those who love melodrama and tales of unrequited love. But I would recommend any other romance anime I've seen over this one.",
            "date": "2017-05-18T00:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 247964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3600683.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/camay1997",
                "username": "camay1997"
            },
            "url": "https://myanimelist.net/reviews.php?id=247964"
        },
        {
            "content": "I watched some few episodes of this anime and just simply wanted to write my review about the anime. What I specifically want to talk about this anime is the love triangle in it which is way too difficult to understand. \r\nThe plot is about Haruto who confessed his feeling to Yuzuki but got rejected because she had to move to Tokyo without telling him. For Haruto, she just suddenly disappeared from his life leaving him with a lot of questions to himself. A couple of years later, Haruto had to live with his sister and therefore moved to Tokyo so his main motive wasof course hopefully getting the chance with Yuzuki once again. Throughout the anime, Haruto ended up getting feelings for Asuka and confessed them to her and they ended up happily together. A couple of years later again, Yuzuki ended up stealing him from Asuka arrogantly, leaving Asuka in despair which does not make any sense in my opinion at all when she did not want to be with him from the start.\\n\\n\r\nWhy would Yuzuki go that far, showing she is so mighty, until it is getting disgusting to watch?\\n\\n\r\nPlot 6\\n\r\nThe story got ruined by being too difficult to understand what the characters' motives.\\n\\n\r\nArt 8\\n\r\nThe art overall was pretty good as in the designs of the characters are pretty good especially the hair colours but some parts in the anime were ruining it.\\n\r\nThe design of the character is pretty good and the hair colors were pretty cool.\\n\\n\r\nSoundtrack 7\\n\r\na lot of sounds added in the pretty well done.\\n\\n\r\nCharacterisation 8\\n\\n\r\nEnjoyment 2\t\\n\r\nThe relationship and the choices the characters makes are terrible.\\n\\n\r\nOverall 6\\n\\n\\n\r\nRIP Asuka. ❤️",
            "date": "2017-04-19T09:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 245837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6098514.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 2,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Cambeezee",
                "username": "Cambeezee"
            },
            "url": "https://myanimelist.net/reviews.php?id=245837"
        },
        {
            "content": "Keep in mind that i am french and my english can be pretty bad, sorry for that.\r\nWell, i haven't read the manga at all, so my review is based on the anime without apprehension because of the original story. And i'm not a big fan of romance anime.\r\nKimi no Iru Machi was a good anime for me, first i was a little disturb by the chara design, but after two episodes, i learned to like it. For me, he's perfect for this kind of story and emotions was there with this chara design, good job. I was disappointed by some scene that was a mixbetween a painting style background and the character moving on. Some of the scenery was sort of \"semi photographic style\"(don't know how to call it), but it was not offensive.\\n\\n\r\nWell, now, the story. \\n\\n\r\nFrom the beginning to the end, the story was very enjoyable, with lots of situational turnaround. The story surprised me because i almost cried sometimes, and that was what i wanted from this show, emotions.\\n\\n\r\nBUT, because yeah, this anime is far from perfection :\\n\\n\r\nI was very very irritated by the countless flashbacks. For me, that was not useful, without many of them the story would be the same for me.\\n\\n\r\nI think that's a good anime, with a good story and very good characters,(Asukaaaaaaa), but with very odious characters too, and i think it's because this anime is just 12 episodes, this anime needed more time. \\n\\n\\n\\n\\n\r\nKimi no Iru Machi talk about our social relationship, and i think it did pretty well, but the mark would be better if there was more episodes to had more time for this.",
            "date": "2017-01-26T12:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 239168,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5258638.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kikar4u",
                "username": "kikar4u"
            },
            "url": "https://myanimelist.net/reviews.php?id=239168"
        }
    ],
    [
        {
            "content": "This anime is definitely my no.1 drama/romance. It talks about drama in anywhere I've watched this series. Although I was kinda shocked a little bit that some in the episodes they jump into the future, a future where some of the characters has grown up. Somehow somewhat the name of this anime although it's just simple as that but still, it gives an impact towards the series itself. Kimi no Iru Machi : A Town Where You Live, where the main character chasing her love in Tokyo because he loves her too much. It's weird how the main character at first didn't care or foundthe main heroine attractive. I was like, \"What happened with his old crush before?\". I honestly love this anime because I feel like I got hooked because of the drama. I feel like I have to know what happens next. I sometimes wish that I could love someone like this series would. A love that is just beautiful in a lot of ways. Unlike my reality, a crush is just a crush in which leads to a hopeless one at fact. This series is just beautiful and just heart-wrecking when it comes to romance with drama. But still, Kimi no Iru Machi, I wish this has a second season after quite awhile. I mean, I really wanna know after the original series.",
            "date": "2016-12-02T05:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 234740,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5057652.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Azren1995",
                "username": "Azren1995"
            },
            "url": "https://myanimelist.net/reviews.php?id=234740"
        },
        {
            "content": "I'll keep this review as short as I can.\r\nThe main point is: Kimi no Iru Machi is as a mediocre anime adaptation of a great manga. Unless you hate to read mangas, I would really reccomend that you choose it over the anime.\r\nThe story here is all mixed up. It starts aroun chapter 80 of the manga and goes back to the part they skipped with flashbacks. That it makes it confusing and loses a lot of the characters' developement. The way it's presented can make you even hate Yuzuki for just playing with Haruto's feelings. The manga at least tries to make you understandthat she has reasons to do it and her intentions are always good. \\n\r\nThe relationship with Kazama was also really poorly adapted, and even with his childhood friends, but I can understand the last because they don't really do much in this part of the story.\\n\\n\r\nThe art and sound are nothing special, though I liked the first ending song.",
            "date": "2016-01-14T04:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 208490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4436717.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Itsbird",
                "username": "Itsbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=208490"
        },
        {
            "content": "Okay Too Start Off This will be my first review and I apologize if my grammar is not good enough for your preference since english is not my first language. I will only be making a short review of what this anime is like , if it could have been better or if it deserves a second season and etc. I would just like to say that this review is based on my own opinion.\r\nStory:\r\nI gave a 7 to the story because the pace was too fast, the relationships , the background story for all the characters , their history and etc. But I cansay that this anime could have been better if they did not rush things so quickly , rather if they showed the characters development between each other.\\n\\n\r\nDoes it deserve a second season? Umm.. I dont think so based on what I have watched every problem was solved in its own way, but what disappointed me the most was the anime's outcome if the story was what I expected it to be then it MIGHT have a second season but it didnt' so thats that.\\n\\n\r\nArt and Sound:\\n\\n\r\nThe art and sound is ok in its own way nothing commendable.\\n\\n\r\nCharacter:\\n\\n\r\nAhh.. The Characters well just as I said the you won't have that much \"bond\" with the character because as I said the development was rushed just like the story it could have been better.\\n\\n\r\nEnjoyment: \\n\\n\r\nHonestly I did enjoy the anime despite its flaws in story and character development but still I recommend it to people who like romance and drama anime but still if they took the time to make it better this anime could have been awesome.\\n\\n\r\nfrom what I have learned people say that the manga is better in terms of its development and overall enjoyment but sadly I haven't read it as well so It might be worth a try. :)\\n\\n\\n\\n\\n",
            "date": "2014-06-14T11:08:00+00:00",
            "helpful_count": 0,
            "mal_id": 146969,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3842973.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ThePersonaFan",
                "username": "ThePersonaFan"
            },
            "url": "https://myanimelist.net/reviews.php?id=146969"
        }
    ]
]