[
    [
        {
            "content": "Of course this is series is still ongoing so I'll be giving my current impressions of the Anime.\r\nInitially I was skeptical about watching this since it seemed like just another harem Anime thrown at us. But so far I find it quiet enjoyable.\r\n. Pros\r\n+ Not your typical generic harem\r\n+ Has a mature feel to it\r\n+ Nice balance between comedy and drama\r\n+ Unique setting, harem in a rich setting\r\n+ Pleasing visuals which matches the theme and setting\r\n+ Ecchi not over the top ( well most of it is censored anyways )\r\n+ Comedy level is just right\r\n+ Potential to get serious in the latter of the series\r\n+Characters have depth to them\\n\r\n+ Big boobs\\n\\n\r\n. Cons\\n\r\n- Censored ( it can be good too, fanservice can be distracting ).\\n\r\n- Girls a bit cliched ( but the series makes them feel refreshing )\\n\r\n- Will it be able to wrap up nicely given it's only 12 episodes total?\\n\\n\r\n. In Detail :\\n\r\nSo far it doesn't seem to be your typical generic harem Anime. I haven't watched an extensive amount of harems. But I found the rich harem theme of this Anime unique. The main character is rich and so are the rest of the girls. While harems are typically comedic this one has a serious tone right off the bat. Of course that doesn't mean this Anime doesn't have comedy ( it is labeled ecchi, though it's currently censored ), it does. I feel that this Anime so far has a nice balance of comedy and seriousness. The series so far seems to have more depth than the typical harem. It takes the characters and plot in a mature way while being able to entertain us at the same time. Something that definitely stood out to be was the visuals which I found very pleasing to the eyes. It fits the theme of the Anime well which I believe greatly enhances the entire experience. While the characters may be fairly cliched ( girl with sword,tsundere, etc ), the way the series currently presents them makes the experience more refreshing. There's not so much to say bad about the Anime, it only just started and I didn't start watching with very high expectations. But so far I'm surprised by how well I enjoy it so far. It seems that it well get more serious in the latter of the series. I'll continue watching.",
            "date": "2009-08-06T17:17:00+00:00",
            "helpful_count": 164,
            "mal_id": 17550,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/187289.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kanauru",
                "username": "kanauru"
            },
            "url": "https://myanimelist.net/reviews.php?id=17550"
        },
        {
            "content": "When asked about the nature of a harem anime, most anime fans think: average guy, surrounded by 3 or more seemingly unattainable girls, in an unusual setting chuck full of breast-grabbing and panty-flashing. Does Princess Lover fall into this abysmal group? Yes, however it had the potential to achieve a lot more than what most harems fail to achieve, seeing how it's based on a rather popular visual novel.\r\nThat potential was shown in its characters however that same potential was foolishly squandered with its mediocre story. The story itself is typical, yet intriguing enough to keep most viewers interested. It’s about your average teenage boynamed Teppei, living an average life, with his average family... Then shit happens and our protagonist is later forced to live with his super rich grandpa and transfer to some absurd school for the super rich. \\n\\n\r\nAfter watching this I thought the writer must’ve taken whatever he could find from “Ye ol’ book of anime clichés” and decided that was their plot. Strangely enough, it worked surprisingly well when it came to introducing the characters to this profoundly entertaining story. The first half of the story basically sets this kind of tone for an exhilarating short series but in the end it was a wasted effort once the “real” story kicks in and boy, are you in for a ride. By ride I mean a one-way ticket to idiotsville, because only an idiot would throw away an enjoyable story for the garbage that replaced it.\\n\\n\r\nWith all that said, this anime didn’t entirely turn into a steaming pile of crap and that’s thanks to the interesting cast of main characters. Harem protagonists usually fall into 2 groups: the losers and the kind-hearted saviours. Yet Teppei initially doesn’t fall into either, because within his playful character is a young lad struggling to deal with his past and moral dilemmas. Not to forget the 4 leading heroines, who were rather well developed, some more than others and 2 of which who seemed similar in design and personality to 2 more well-known characters from other series. Whether that was intentional or not is unknown to me but they happened to be the most interesting of the 4 heroines. However apart from Teppei’s grandpa, the supporting cast turned out to be far weaker than the loosely put together story and if a couple of them were killed off, the story could have done a whole lot better.\\n\\n\r\nThe production values are somewhat difficult to delve into since a fairly unknown studio (GoHands) took on this series. The music was just about as memorable as every breath I take and the sound productions overall really isn’t any good. Yet the art style and animation has a unique vibrancy to it, giving a colourful experience that’s pleasing to the eyes. However the jarring simulated camera panning/rotation and the out of proportion bust sizes really brought it down for me.   \\n\\n\r\nOverall Princess Lover is a series that I hoped would break the chain of generic harem that seem to appear year after year, yet all it did was add unto the already tarnished reputation of the harem genre. Some of the blame falls onto the villains, who were the worst villains ever constructed but I blame the real villain… the idiot who thought of this crap. Well if you don’t mind all that I’ve said then watch at your own discretion; however I feel it’s more worthwhile to sit wait for the next Key & KyoAni collaboration.\\n",
            "date": "2009-10-28T11:29:00+00:00",
            "helpful_count": 109,
            "mal_id": 20075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=20075"
        },
        {
            "content": "Mod Edit: This review may contain spoilers.\r\n---\r\nShit, where do I start, man. Well, here's the thing: I've been watching anime for over five years, which means that I've seen several romance/harem series (everything from Maison Ikkoku to Love Hina). Most of them have the same traits, but in order to poke out a bit from each other, they'll have to be in different settings. The question is if it's different and well enough executed in a fashion that captivates the viewer. And I'll let it out straightaway: Princess Lover fails epicly at that. By looking at the title, you know that you're already fucked:\r\nUh, sothe main character, Arima is going to succeed Arima Group Corporation, and by the sounds of it, it looks like it's like the biggest company in the world. And who's gonna take over it in near future? A teenager that knows shit about business. Who in the world would give away such a big responsibility to a relative they barely knew just like that? I can go on and on about this plot convenience, but hey, I'll spare you for that.\\n\\n\r\nBecause succeeding the corporation is just a lame excuse to enter a rich girls' school (okey, there are also boys there, but we barely get to see them). And of course, who do we meet there? It's the pink-haired girl whom he saved and his fiancee. And to answer your question straightaway: Yes, they do have big breasts. And yes, the pink-haired girl hugs Arima all the time with her gonzanga breasts. She's your typical cheery girl with a cheery voice with a hand that likes to wave awfully a lot. And the fiancee? She's your typical, somewhat-shy girl who speaks little. And when she does speak, she speaks kinda without emotions. She has coincidentally fencing as a hobby, which coincidentally matches with Arima's kendo, so they have by chance some common ground, I guess. With other words, we've seen these type of personalities before. A lot. So what personality are we missing now? Tsundere? And yes, there is a tsundere girl in the series.  You'll know it straightaway when she pops up for the first time (hint: she has a slightly annoying/whiny voice, which all tsunderes have, so I guess that's alright). Did I mention that we also have a big-breasted maid? The anime industry sure knows what we like. And Arima Teppei is your average male main character.\\n\\n\r\nAnd that's not the best part yet (and by that, I mean the worst). The thing is with harem series, is that the plot can't be all fluffy and boobilicious all the time; it also needs some drama. Without telling too much: It's fucking ridiculous when you get to it. If you by any chance come to episode 7 or 8 (I don't quite remember which one), you're gonna have a fuckin' laugh. I swear, the plot progression from there might be the most retarded one in harem anime history. It's clearly not to be taken seriously. I don't know, but I sure facepalmed a lot during that particular episode. And by of what I've heard; the series is based off of an H-game, so that kind of sucky plot is expected, I guess.\\n\\n\r\nIs there anything good in Princess Lover? The art is decent and not ugly to look at. The animation is standard, but not bad. And if you're looking for ecchi-ness, you've found it. A lot of booooobies. *coughEDcough* The music is not memorable at all; it's just generic. Visually speaking, the opening was pleasing to look at. In fact, I remember the breasts more than the music itself. And btw, Arima Isshin's voice is so badass (Wakamoto Norio is badass after all).\\n\\n\r\nSo unless you enjoy torturing yourself or your friends, avoid Princess Lover at all cost. I fuckin' used 160 minutes of my life saving your eyes. At least the show wasn't as bad as Koi Koi Seven. If you wanna see only big breasts and ecchi-ness, then there's actually better shows for that, like \"He is my Master!\". If you're looking for a good romance/harem anime, then go watch \"Ichigo 100%\" (the manga is better, though), \"True Tears\", \"Lovely Complex\" or \"ef - a tale of memories\".\\n\\n\r\nYOU OWE ME YOUR LIFE.",
            "date": "2009-08-30T13:59:00+00:00",
            "helpful_count": 67,
            "mal_id": 18229,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/211112.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Longxinus",
                "username": "Longxinus"
            },
            "url": "https://myanimelist.net/reviews.php?id=18229"
        },
        {
            "content": "You have a summary of Princess Lover, so I won't bother telling you that. I won't post any spoilers, so don't worry. \r\nOverall  7\r\nPrincess Lover started off very good. It had a serious with light humor tone, with all the ecchi-ness included;  but, then went way downhill in the second half which really hurt it overall. \r\nStory  6\r\nIf I was only rating the first 6 or so episodes, this show would be a 9 because it was very enjoyable. It's very obvious who Teppi likes right from the start (Charlotte) and they have a lot of nice romantic moments. So why didI give the story a 6? In the second half of Princess Lover, this show fails.....very hard. The last episodes were pretty bad. They bring in special ops and the story tries way to hard to be funny causing it not to be very funny. The story tries to be serious, but overall just can't be taken seriously. The only plus to the story in the last arc is that Teppi weeds girls out with a kiss. That's the only good thing. \\n\\n\r\nArt  8\\n\r\nThe art was very good, epically for a harem anime. Everything was pretty fluent and looked fine, but there were some distortions in some scenes that weren't really the focus of the shot which, if you noticed them, made the art seem not as good (animators got lazy/ budget issues). It never happened on the main focus of the scene though\\n\\n\r\n** not included in the rating** I would wait for the uncensored version to watch this show, in the censored version they censor things that are already censored. \\n\\n\r\nSound 8\\n\r\nThe OP/ Ed were pretty good and the characters voices were all done well. Nothing to really say here, no complaints and nothing to really say that was especially amazing. \\n\\n\r\nCharacter 7\\n\r\nOne downfall to the characters is even thought Teppi, Charlotte, Seika, Yuu, and Sylvia are the main characters, only Teppi and Charlotte get any real screen time. The others are are there, but don't do a whole lot until the end. \\n\\n\r\nTeppi >> an okay harem lead. had some funny moments and wanted to save everyone. But he turned into one of those \"talk it out\" characters to the main \"villains\"\\n\r\nCharlotte >> A lot of people didn't like her, but I liked her. She's a typical pink haired harem character who is very clingy to Teppi. SHe isn't very smart, but she was the funniest. (sex jokes about Teppi's .......)\\n\\n\r\nEnjoyment 7\\n\r\nAs I've already stated, the series started off really good and was very promising, but then went way downhill in the second half which really hurt my enjoyment.",
            "date": "2009-09-24T14:46:00+00:00",
            "helpful_count": 55,
            "mal_id": 19078,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133289.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Meh_93",
                "username": "Meh_93"
            },
            "url": "https://myanimelist.net/reviews.php?id=19078"
        },
        {
            "content": "This could have gotten a big fat \"1/10\" if not for the art/fanservice.\r\nBasically an H-Game that should have been an H-Anime. The storyline is so poorly constructed and contained reasoning so shallow that I have thought to myself \"WTF?\" or \"That's so shallow\".\r\nThe deal with Princess Lover is that it's basically a harem anime but for the reason of making it feel different (in a disastrous way) from the rest, it goes on by inserting a serious side to the plot which can be seen halfway to the end.\r\nThis is where the story becomes irredeemable.\r\nThe first 2 or 3 episodes was quite interesting since itfeels like a royalty harem anime that feels like it has a potential to be something unique. After the introductory arc comes the annoying \"Passing the Club\" which has started the downhill trend for this title. Then there's the last arc (Save the Princess). I found myself remembering the forum posts on various anime sites saying how bad it was. \\n\\n\r\nIn a nutshell, you'll watch this for the high production values and fanservice and nothing else. Then again, the terrible story will probably deter you from enjoying that in the first place.\\n\\n\r\nPros:\\n\r\nHigh production values\\n\r\nFanservice (for guys)\\n\\n\r\nCons:\\n\r\nStory\\n\r\nStupid and shallow reasons for the arc problem\\n\\n\r\nPrincess Lover got lucky by having a 3/10.",
            "date": "2009-09-28T19:06:00+00:00",
            "helpful_count": 38,
            "mal_id": 19208,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=19208"
        },
        {
            "content": "i know it isn't good to a review on a anime that just aired but i just had to. i want to know what guy hasn't dreamed of becoming rich and being surrounded by hot babes with huge breast. \r\nSTORY 9-  Arima Teppe, main character, lost his parents, reasons not known yet, and was adopted by grandfather, whose probably a billionaire. basically over night he went from poor to rich and from single and to #$%^, watch if you want to know. he is a lucky son of a B****, granted he lost his parents, but still a SOB regardless.\r\nART 9-  as faras art in anime goes. it is pretty good. no complaints. the actions scenes were well done and the details were excellent.\\n\\n\r\nSOUND 7- I'm going to be perfectly honest with you. i don't remember it. HAHAHA *sigh* ... that's kinda bad. well thinks of it like this. it wasn't so good that i would remember it and it wasn't so bad that i would complain. the OP and the ED songs were fine as well. everything blended well with the story.\\n\\n\r\nCHARACTER 8- there isn't much i can say about the characters at the moment, but of the one character that has any character development besides the introduction is Arima Teppe. he is looking for revenge on #$%^@. \\n\\n\r\nENJOYMENT 8-  this story seem like it will be interesting as far as the plot goes. i hope the classic themes don't mean over played cliches are also coming. \\n\\n\r\nOVERALL 8- if you don't mind being jealous of this guy then i recommend it. the plot seems to be interesting enough.\\n\\n\r\nnote- please comment, i feel i need some criticism in order for me to improve.",
            "date": "2009-07-09T11:20:00+00:00",
            "helpful_count": 27,
            "mal_id": 16598,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/41291.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nate23nate23",
                "username": "nate23nate23"
            },
            "url": "https://myanimelist.net/reviews.php?id=16598"
        },
        {
            "content": "Story\r\nAt first this is interesting since the first episode, but as the episodes goes, it was ridiculous, there's a lot of plot holes and i felt that i was watching a mexican novel serie, filled with stupid plot holes that you can see even blindfolded, the thing is that the story could have been really good if this wasn't rushed, so i didn't like it because of those freaking plot holes, overall was fine.\r\n[b][u]Art & Sound[/u][/b]\r\nIt was good on both, it really matched the scenes and the ecchiness was enjoyable too, the voice acting was good too.\r\n[b][u]Character[/u][/b]\r\nThe characters weren't deeply developed, not everyone at least,is like they forgot the other two girl MC, they barealy appeared a lot and the girl of the main story was forgotten, they didn't have the time to talk and i'm talking about Sylvia, i hated that they didn't even try or at least Teppei didn't try to know her and she was a big part of the story for f**k sake, Seika appeared more than Sylvia, they only focused on Charlotte, and i still don't know nothing about Sylvia who i wanted to see more than Charlotte.\\n\\n\r\n[b][u]Enjoyment[/u][/b]\\n\r\nI really enjoyed this despite the bad things, i wanted to take the good things, like the ecchiness, the comedy and a part of the story despite the plot holes and the writers not caring about the story, the ending was like lol wtf but overall was good enjoyment.",
            "date": "2015-08-07T10:49:00+00:00",
            "helpful_count": 25,
            "mal_id": 195430,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195430"
        },
        {
            "content": "I've thought a lot about what I think is useful when starting to watch an anime - criteria that might change my thoughts as to whether or not to watch a series. I’ve customized this list to what you typically see in ecchi series. First I give the criterion, then I define the parameters of the criterion, then I state how the series matched up against the specified parameters. I also note how things like art and the soundtrack affect my overall rating of a series (along with what I thought of the two components), if anyone is interested in that.\r\n I don't claim thatthis criteria will be universal - different people have different tastes and value different things, but this review is what would make/break watching a series for me. Mild spoilers ahead.\\n\\n\r\nAnnoying Mascot Characters\\n\r\n1. It's not a matter of whether or not the mascot character is annoying, it's a matter of how annoying the mascot character is.\\n\r\n1) There is not a clearly defined mascot character in this series. Occasionally the main romantic interest acts as a mascot character, asking really simple questions so things can be elaborated more for the viewer, and offering overly-simple frustration at whatever unfortunate circumstance is unfolding. That being said, the main romantic doesn't often do that and when she does it's only mildly annoying.\\n\\n\r\nArt\\n\r\n1. I find art to be pretty subjective. If I find it to be particularly good, it might +1 my overall opinion of the series, but I typically don’t hold it against a series for being averagely animated for the time it was animated.\\n\r\n1) The art in this series was pretty average, nothing eye-popping and almost nothing distractingly bad. If I had one complaint about the art it would be that the most of the main female cast had breasts that were big just a bit beyond  the point of believability. I personally find female characters more attractive when I think that finding someone with their proportions in the real world is not impossible. \\n\\n\r\nFriend Quality (MC-Male Friends)\\n\r\n1. The male friend(s) is/are (a) pervert(s) who do not get much characterization outside of getting the MC into trouble\\n\r\n1) That’s essentially what Teppei’s group of male friends are. There are two distinctions to be made: first, Teppei is the ringleader for his group of friends; second, there is a male friend Teppei has who is constantly ignored – he’s generic, but outside of the parameter of the stereotypical male friends in ecchi series.\\n\\n\r\nGratifying\\n\r\n1. The MC is not a hopeless loser with no talents and horrible grades. If he is, when he improves, his improvements come relatively early in the series and they stay for the duration of the series.\\n\r\n2. When the MC has to fight, he fights. (This doesn't have to do with the MC fighting well, just not being a pushover.)\\n\r\n3. The MC hones his skill and visibly improves throughout the series (when there's action in the included genre)\\n\r\n4.  Romantic interests are forthcoming about their feelings (both the MC and the girl involved)\\n\r\n1) The main character certainly was not a loser, and not a clear-cut winner either. His grades weren't mentioned at any point throughout the series, so we're left to assume he's okay there. \\n\r\n2) When the MC had to fight, he fought, with little or no prompting from other characters.\\n\r\n3) The MC had good swordsmanship, but did not visibly improve it throughout the series. There was character skill progression, but it was more learning how to function in high-society (think Hayate no Gotoku without the ridiculousness and you'll have a decent perspective of what the training was like).\\n\r\n4) The MC was not too decisive during the course of the series about who his number one female was, he seemed to enjoy his female counterparts equally, there weren't any surprises about who he somewhat leans towards at the end of the series. The female counterparts are all pretty forthcoming about their feelings, there was one girl who was kind of a tsundere, but she was definitely forthcoming by the middle of the series and not particularly violent.\\n\\n\r\nMagical Falling\\n\r\n1. The MC somehow ends up in the 69 position or groping the female foil(s)' chest more often than humanly possible\\n\r\n1) This is an ecchi show, so it does happen; however, it's much less frequent than other ecchi shows. Also, the female character(s?) play(s?) it off much better than other ecchi show female character(s) do.\\n\\n\r\nMemory Problems\\n\r\n1. The MC has forgotten a promise to a childhood friend\\n\r\n2. The MC has forgotten the face of a childhood friend he made a promise to\\n\r\n3. The MC has amnesia \\n\r\n1) There were no MC memory problems in this series\\n\\n\r\nPredictable Transfers \\n\r\n1. If they're an antagonist in one episode, they're in the MC's class the next.\\n\r\n1) The only predictable transfer was the MC into the academy, and it was by no means painful to watch. \\n\\n\r\n‘Special’ Main Character\\n\r\n1. The MC is somehow distinguished during the course of the series from his peers – be it a special power or sudden change in social status\\n\r\n1) This happens – you know what it is from the summary given on MAL\\n\\n\r\nSoundtrack\\n\r\n1. This rarely has an impact on my overall rating of a series, but I do feel I should note when I think a soundtrack is particularly memorable\\n\r\n1) I thought the soundtrack was good, in that I remember thinking it was good as I watched the series; however, I don’t remember any scenes that really hit home for me because of the music – which sometimes happens to me when I watch anime.\\n\\n\r\nVoice Acting\\n\r\n1. I'm not particularly judgmental about voice acting, the only thing that really bothers me is if there's a male character with a particularly effeminate voice or vice versa\\n\r\n2. If there is English in the subbed version, there either isn't a lot or there is not a thick Japanese accent with characters who are supposed to be native/fluent English speakers\\n\r\nThe voice acting was fine in both regards. \\n\r\n1) I remember thinking (as I was watching the series) that the antagonist for this series has a great voice actor. \\n\r\n2) There was not a lot of English in this series.\\n\\n\\n\r\n1) One thing that bothered me about the show was how clear-cut the themes were, despite them dealing with complex topics which don't really have an answer to them. One of the themes is more 'money more problems'. Another one of the themes seems to be, 'poor people shouldn't blame rich people for their being poor, they should just stop being poor'. This really just left a bad taste in my mouth, if they left some characters and some plot more up to the viewer to decide what is right and what is wrong, I would have been much happier with the quality of the story.\\n",
            "date": "2014-03-21T22:26:00+00:00",
            "helpful_count": 20,
            "mal_id": 136399,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3463853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/No1shero3",
                "username": "No1shero3"
            },
            "url": "https://myanimelist.net/reviews.php?id=136399"
        },
        {
            "content": "There are a lot of harem anime around there, but this harem anime was the only one that made me emotional. Princess lover focused more on romance than ecchi, and that's probably the reason why I got more emotional. \r\nThe characters were different, especially the MC. Instead of a shy and normal protagonist living a normal life in a normal house, It had Teppei, the heir of a rich man living a dangerous life in a huge mansion. I've never seen any character like him. There's a lot of Charlottes and Sylvias out there, but only a few Teppei. Sure, he resembles other mainstream characters,but you can see that his personality was different from them.\\n\\n\r\nAs to the plot, it was perfect. There were no holes other than the open ending. What made it unique from ther harem anime is that it had a balanced plot. It didn't have a hella long introduction and fillers. It went straight to the point and perfectly balanced, with cliffhangers to keep the tension and interest of viewers.\\n\\n\r\nOne thing I liked. About this anime was the graphics. You won't even realize that there's a transition from picture to picture. The graphics were simply a classic, even though it was aired in 2009.\\n\\n\r\nThe voice acting... Pretty common, to be honest. But still, they did a great job.\\n\\n\r\nAll in all, I loved it. It was an entirely new thing for me. Emotional and romantic, that's princess lover!",
            "date": "2014-10-19T02:08:00+00:00",
            "helpful_count": 18,
            "mal_id": 165253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=165253"
        },
        {
            "content": "\"Ill deal with it somehow!\" - Teppei Arima\r\nTeppei, a young teenage boy who lived with his mother and father in a social status that could be considered poor, but he was happy. Unknown to him, his life changed dramatically after his parents died in an accident that could be related to the recent attacks on the rich families in his area. Accepting his grandfather's adoption, Teppei is forcibly thrust into a world where he went from poor to filthy rich. The romance/comedy/action that ensues following his attempts at adapting to the rich life is one worth watching.\r\nI found Princess Lover! One of the unique harem/ecchi/romanceanime that I have seen. Contrary to the many harem anime out there, Princess Lover! put on its own style despite being adapted from an adult visual novel. \\n\\n\r\nThe Story: Considering all the harem based anime I have seen thus far, Princess Lover! is set in an entirely different setting. Rather than the typical high school drama, PL focuses more on a the world that surrounds the main character which includes Japan families, royalty from other countries, and heirs to major fashion companies. (Not to mention all of whom are filthy rich). The story starts out suddenly, Teppei, completely happy with his life, is suddenly ripped from his normal atmosphere when his parents die in an accident. His grandfather, who adopts him, turns out to be the owner of a mega famous and popular company, The Arima Combine. The comedy that comes from Teppei's sudden transfer to the rich and famous was very pleasing. Even in the short 12 episodes, the plot development surprised me. Usually in harem anime, one doesn't see much plot development because of the major focus on the characters, PL does a good job of balancing both. The story setting and plot isn't a typical harem themed anime, and because of that, PL has a more mature/different/pleasing feeling. Not only does the plot explain more on the conflict between the rich and poor, it also touches on economics and the roles that CEO play in running major corporations. Not only did GoHands, and Dream Force did a good job of balancing the plot and characters to where the story actually progressed to an obvious well done climax and falling action, but they also did well in including comedy and drama. \\n\\n\r\nArt and Sound: The visuals done by the producers weren't sharp and picturesque like one would see in modern anime, but the smooth brightly colored drawings added to the music that accompanied it. I've never had to find fault at an anime's pictures or music, but for a 2009 anime, I think PL did very well. Being tagged as an ecchi anime I was pleased that the fan service wasn't over the top, but tastefully added. There are uncensored and censored versions but either way, it doesn't detract from the work as a whole. \\n\\n\r\nCharacters: Like in any generic harem anime, the main character can fall into one of two categories. The useless loser type, or the kind-hearted \"I'll save everyone type\". Unusually Teppei doesn't fall into either. With a good background from his parents backing his personality, a kind output that allows him to interact well with the people around him, the animators also made a character that I haven't seen so far. Teppei, unlike generic harem main characters, actually saves the day from time to time, either with his badass kendo skills, or his growing skills in managing a business. It seems as though to put it in other words, comparing it to usual harems, for example To Love Ru, Teppei and the characters in PL, and Rito and the characters in TLR are reversed. While Rito depends on the aliens to save him most of the time (not to mention he is dead useless physically), Teppei can be considered the opposite. (Although, I think deflecting bullets with a wooden kendo sword is a little far fetched.) The other characters in PL were also somewhat unique, but not so much that one couldn't see similarities. \\n\\n\r\nEnjoyment and Overall: I think the major aspect of PL that allowed it to be good, would be the overall feeling of how different it is compared to the norm. In my words, it thought outside the lines of the box and succeeded. If one is looking for a break from the typical harem type anime, PL provides pretty much all of that. To reiterate, with a unique setting, different main character, and actually some plot development that occurs, succeeding at balancing these unusual additions to the harem style, PL is one worth watching. PL can also be considered an indie anime, but it is also underrated; if any of you who read this play League of Legends, it's like an unpopular champion that is actually very strong.  \\n\\n\r\nThanks for reading,\\n\r\n-Nebarto\\n\\n",
            "date": "2013-07-08T11:44:00+00:00",
            "helpful_count": 10,
            "mal_id": 104427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2608033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nebarto",
                "username": "Nebarto"
            },
            "url": "https://myanimelist.net/reviews.php?id=104427"
        },
        {
            "content": "I never thought I would find myself writing another review given the fact that I don't watch anime as much as I used to, but the hilarity that is Princess Lover! warranted another one with my poor command of the English language.\r\nSo where to begin? \r\nThe plot is straightforward enough...random guy becomes the heir to a vast fortune and has to become accustomed to living as a rich man. So that's where that ends...this anime can be summed up in pretty much one word: Fanservice!\r\nTrying to understand some of the events that goes on as the \"plot\" progresses is not good for your health andI highly advise against it. Seriously...some of the events that occur are downright outrageous and make no sense whatsoever. So stick to the reason why you chose to watch this, okay?\\n\\n\r\nBeing the fanservice anime that it is, it knew where to focus its budget. The fanservice art is superb and gets the job done. There are no complaints on this department whatsoever and this may be the only point in which this anime excels at. \\n\\n\r\nThe musical score is decent, but nothing memorable so let's keep moving here.\\n\\n\r\nCharacter wise...well this will pretty much play like most visual novel adaptations out there. You'll grow to like the sub heroines and hate life as the main heroine pales in comparison to them. Seika (the twintail tsundere) is the highlight of the show for me. I can't divulge anymore details without entering spoiler territory, but she fits in to the catogery of \"proactive\" tsundere. Oh there's also the other heroines...maid-san is nice, the blond fencer is also nice, and the heroine is annoying.\\n\\n\r\nI chose to watch this anime for the sake of the comedy and knew full well what I was getting in to with the 'ecchi', 'harem', and 'romance' tags attached. If you keep those in mind and brace yourself for what's to come, then you'll have no problem getting some enjoyment out of this. And even then that doesn't say much as everything is a giant trainwreck after the Seika arc. Oh and don't even bother expecting a Sylvi route as there is none; go check the OVA if you want Sylvi goodness.\\n\\n\r\nOverall...a deploring anime whose sole redeeming factor is the fanservice and Seika. If you aren't a fan of either, then stay the hell away. If you are...well its only 12 episodes and they really handled Seika's character pretty well. \\n\\n\r\nAnd that's Princess Lover! in a nutshell.",
            "date": "2011-10-31T03:08:00+00:00",
            "helpful_count": 10,
            "mal_id": 46547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/PimpToad",
                "username": "PimpToad"
            },
            "url": "https://myanimelist.net/reviews.php?id=46547"
        },
        {
            "content": "wow... I really don't know what to say. I never would have thought that I'd watch an anime that had the words \"Princess\" and \"Lover\" in it, let alone both of them together.\r\nThe story is exactly the kind of stuff that I love. A decent, average guy that gets thrown into a world where he has no idea what's going on. \r\nThe great thing about Princess Lover is the fact that the protagonist isn't one of those clueless airhead guys. He knows that the girls around him love him, Hell they even say it to his face, and hes man enough to take it intoconsideration and go with the flow. He doesn't hurt them like other guys do.\\n\\n\r\nI would highly recommend this anime to anyone who is interested.",
            "date": "2011-04-19T18:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 36235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=36235"
        },
        {
            "content": "Princess Lover, not your made in 10 minute harem story where the girls just automatically plastered themself on the main lead.\r\nThe story is about a poor boy who found out he had a extremely rich grandfather after his parent's death.This is the very boy who ended up being the successor of his grandfather's business and the same person who is loved by two princess character female lead which are actually princesses.\r\nThis anime do not have the \" I Love All \" ending where the guy doesnt decide who he likes and just continue his life with all the female leads.\r\nHe chooses and decides the onethat he loves and goes all out for her risking his very own life.\\n\\n\r\nI definitely enjoyed this anime very much, it would be regrettable as a anime fan to miss this anime, it picks up right on episode 1.\\n\\n\r\nWith state of the art, artwork and graphics and sound, with a intense story and pleasant character devolopment with a mix of fantasy and reality.\\n\\n\r\nIt is hard not to enjoy this anime to the fullest.",
            "date": "2010-07-01T01:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 27836,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/348448.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Guessed",
                "username": "Guessed"
            },
            "url": "https://myanimelist.net/reviews.php?id=27836"
        },
        {
            "content": "When people say this isn't your typical harem anime THEY ARE LYING TO YOUR FACE. Just like every other anime a majority of the girls fall in love with the main protagonist for next to no reason and the further in the anime you get the less sense everything starts to make. Normally for a review a would talk about the story in detail but because this one is essentially only a slice of life for the first 7 eps im going to only briefly talk about them. Warning contains spoilers \r\nStory: \r\nThe story centres around Teppei Arima who becomes super rich after been namedthe heir to the Arima corporation. He then finds out that he has an arranged marriaged to Sylvia Van Hossen.\\n\r\nThe first 3 eps is simply introducing the cliche' harems girls (none will stick with you for very long). After that until ep 7 it is simply him going to school and finding out just how hard it is be super rich for no reason. Such complications include trying to get into his schools social club ( i know right riveting) and trying to get a girl to not hate him simply because of his last name.\\n\\n\r\nAfter ep 7 however is where it starts to get really stupid, a group of terrorists who hate the armia group because they're rich (yep thats the whole fucking reason, no joke) attack their headquarters to try and frame them doing something bad or something and during the attack they take control of their systems. Never ever ever ever have I heard computer terminology so poorly used in my life. It was so bad iI had to actually stop the ep and go for a walk to clear my head; I dont think the writer of this anime knew what the fuck they where writing and just put in whatever words they thought might work for the scenario. So after a bunch of bull shit that lead them to regaining control Tempai Arima decides to go rescue Charlotte Hazelrinkin (more on her later) instad of letting the professionals handle the work \\n\\n\r\nWARNING THIS IS WHERE I GET REALLY PISSES OFF\\n\\n\r\nAfter rescuring the useless Charlotte he finds and does not raise a point of asking why everyone else in the FUCKING BUILDING HAS UP AND LEFT THEM IN THE BUILDING WITH FUCKING BOMBS IN  IT and must now with the extremely useless Charlotte go defuse one of the bombs planted in the building. After getting to safety Sylvia now decides she is not going to let her fiancee' die with her doing nothing like her mothers deaths (I get more into this with the character portion of the review but this makes no sense at all) and goes back into the building she just ditched him at and try to defuse a bomb (note she has absolutely no fucking experience what so ever with bombs) instead of letting the bomb specialists do it under the ruse that \"they cant make it in time\". So you're telling me you have time to helicopter some fucking inexperienced girls into the building but not bomb specialists? . After finding the bomb Teppai runs into one of the terrorists with a gun. Remember when i said that this anime was exactly like every other harem out their? This puts the nail in the coffin. Whilst being a very huge range disadvantage teppai with Charlotte cheering him in the background proceeds to dodge every bullet he fires ( and this is a professional marksman btw) and knocked him out in one hit; even though he was wearing full body armour. He then proceeds to throw the bomb into some shaft which was then stated to be able to withstand the bomb. \\n\\n\r\nIf you havent got the message yet this story sucks fucking balls, all that happens later is the girls fighting over his attention. I give the story a 2 because not only does it use every cliche' in the book but it is terribly written, and poorly executed. \\n\\n\\n\r\nArt; \\n\\n\r\nThankfully the one good thing I can say about this anime is that it looks the part, this is the only good thing that I got out of this anime (note: dont use this as an excuse as I did to watch this piece of shit) \\n\\n\r\nCharacters \\n\\n\r\nArima Teppei: His your typical harem anime main protagonist, oblivious to peoples feelings of him? Check. Has supernatural speed and dexterity only when the situation demands it? Check . Puts his life on the line to save people despite not knowing them? check. Solves every problem around other characters in an attempt to help? Check. The list goes on and on, he is nothing more than your typical good guy anime protagonist. Very poorly done and a shit character all around. \\n\\n\r\nSylvia Van Hossen: \\n\\n\r\nLike every other main character in this piece of shit, Sylvia is nothing more than a kundere, she ticks off every cliche' in the book. However she does have some strong points and is probably the most enjoyable of all the main characters. She has a great deal of experience in fencing and doesnt just start to like him out of the blue for no reason like the rest. In this story she is his fiancee' however this anime for some reason doesnt use this has an excuse for her like him out of the blue which is weird  cause this anime is nothing but a giant cliche' fest. She has a strong bond Charlotte which is actually properly explained in the story through a series of flash backs. She is the only character besides charlotte to have an actually explained bond with any other character that is simply because the story said it must be like that. \\n\\n\\n\r\nCharlotte Hazelrink: \\n\\n\r\nTypical dereder who falls in love with Teppei and is jealous of Sylvia cause they're getting married. Aside from having large breasts their is nothing really more to say about this character, very boring. \\n\\n\\n\\n\r\nConclusion: \\n\\n\\n\r\nThis anime sucked balls, the only good character was Sylvia. The story was cliche', boring and poorly executed. Please do not watch this anime   \\n\\n\\n",
            "date": "2015-07-15T17:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 193504,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gimerly",
                "username": "Gimerly"
            },
            "url": "https://myanimelist.net/reviews.php?id=193504"
        },
        {
            "content": "Ok so story, this the most predictable beginning I have ever seen If you watch the first episode you will understand what I mean. In the first episodes I was thinking ok it seems like fun average school theme. I guarantee that if you continue to watch this ridiculous storyline of the anime you will surely feel disappointed by especially somewhere around 8 or or 9. Pretty much no effort at all( Lets be honest after the first episode you'll understand how the story plays and who wins but there are a couple of funny scenes in there). \r\nArt- For this a 7 because notof the over-sized melons(well maybe a little) but the environment and architecture was very detailed to a certain extent.\\n\\n\r\nSound - I mean it really depends on the quality of the video. \\n\\n\r\nCharacter - No surprise... abnormally large boobs on strangely skinny girls. \\n\\n\r\nEnjoyment- its like a roller coaster it goes up and  down except this time it goes up a few episodes then stays down for the rest of the eps. I actually had  wait a few days to watch it because I was pissed how they exposed the ending like that. Lastly they weren't kidding when they called it \"princess\" lover.\\n\\n\\n",
            "date": "2011-07-31T19:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 40501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/530909.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Phantomtheif",
                "username": "Phantomtheif"
            },
            "url": "https://myanimelist.net/reviews.php?id=40501"
        },
        {
            "content": "This is the best Anime I've ever seen!\r\nBecause this anime does not dependig on the length of a video, how many episode this anime have, the video is depending on the way they let you think, watch, feel.\r\nIt doesn't matter what other peoples thinks of this video, the fact is just that this anime really can bring the message to you, that's one of the most important thing of watching an anime.\r\nEither the storyline is good, so far.\r\nSo I really look forward to see the other episodes!\r\nKeep up the good work, and may this anime continues in the future with more episodes.",
            "date": "2009-08-09T23:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 17631,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218943.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/perform",
                "username": "perform"
            },
            "url": "https://myanimelist.net/reviews.php?id=17631"
        },
        {
            "content": "STORY: Princess lover has a great potential of becoming a great harem anime but the thing that spoilt it was the lack of good comedy and the 'falling action'. usually in a normal harem anime, there would be 3~7 episodes when they will tell us more about the characters and for the growth of the relationship between the charaters. i was disappointed when 8~12 because it was already like the end of the story. if this anime was made into a 24 episodes anime, it could have been a great sucess.ART: nothing great. the best thing is the rich background of the characters.\\n\\n\r\n       SOUND:  the op is not bad but there are no interesting music during in the anime or climax.\\n\\n\r\n        CHARACTERS: everyone was great but i really get boring of personalities like charlotte. she just sticks onto teppei. this way, it becomes a one-sided harem. the character and appearance of sylvie is very similar to saber( fate/stay night). \\n\\n\r\n        ENJOYMENT: I recommend this anime to harem lovers but not to action lovers because you'll get boring of the fighting scenes. the movement is slow, and the fights ends so fast.\\n\\n\r\n         OVERALL: 6/10. if I didn't count episode 8~12, i would give this a 7/10.",
            "date": "2009-11-04T22:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 20275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74890.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ariffmontel",
                "username": "ariffmontel"
            },
            "url": "https://myanimelist.net/reviews.php?id=20275"
        },
        {
            "content": "Overall score:9.84\r\nThis is the greatest drama series I've ever seen, be it manga or anime. \r\n[Notable picks:]\r\nDrama:10 l Tragedy:4 l School life:4 l Inspirational:8 l Wholeness of plot:9 l Harem:8 l Comedy:6 l Romance:6 l Action: 8\r\nStory:10\r\nQuite notably, there are three parts to this series: Intro, Making allies and crisis. I felt that it is very well-structured and fan-service does not impede the plot at all, except in the first part of ep 6, which was a bit excessive. Little unnecessary scenes.\r\nEspecially worth commending are the drama and inspirational scenes, which were aplenty. Drama especially unfolds from the ep7. That means that before ep 6the mood for the series was quite light, whereas it was heavy from 7 onwards.\\n\\n\r\nStory was original, especially when this is a harem genre series. Like Asu no Yoichi, all of the main and some of the side characters played a heavy part in the development of the plot and climatic ending. The seemingly deep plot uncovered at the intro was properly addressed by the climatic ending, which is not every series could do. \\n\\n\r\nOne setback is that by the last minutes of the last episode, the harem presented seems to be still held there, and no firm conclusion was made with who Teppei was going to be with.\\n\\n\r\nArt:9\\n\r\nThe art was amazing. Characters sometimes had near-perfect expressions. Colour was comfortable with the eyes and landscape was amazingly presented. Special effects looked almost real.\\n\\n\r\nSound:9\\n\r\nSome bgm were fantastic, some OSTs were spectacular and fitting in well with the scenes. OP and ED were great and fitting with the series, esp OP. Voice actresses and actors displayed emotions, reactions etc. well. \\n\\n\r\nCharacter:10\\n\r\nAmazing use of characters to move plot along, all had special talents. We have a combat butler, a compassionate princess, a pro-fencer, a pro-swordsman, people with high authority and wisdom etc. Character development was great, but Isshin seemed to have a mysterious feel even to the end. Characters' personalities were improving till the end, but not out of place.\\n\\n\r\nEnjoyment:9\\n\r\nI would have liked it even more if they didn't change the atmosphere so quickly from ep 6 to 7. Overall, I enjoyed the tension and plot presented throughout the whole series. You would love this series if you like drama.\\n\\n\r\nOverall:\\n\r\nThis is one of my top 3 fav anime for sure, since I rarely find any series that really has potential for deep plots but yet finish them. \\n\\n\r\nOne regret is that the harem was still unresolved right till the end, it's as if the producer was happy to let the series as a harem judging from what the main female characters say in the end.\\n\\n\r\nAlso, in the ending scenes, the eng subs for songs in the last episode was not presented very well for the one I watched.",
            "date": "2010-03-13T23:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 23962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=23962"
        },
        {
            "content": "I was actually suprised that i picked this anime to watch or that i actually enjoye watching it although i still ended up asking myself if i seriously just watched and enjoyed it. Well enough blabbering. \r\nReveiw:\r\nOkay so the story isnt something new, i mean lots of shows hit you with this theme, meaning: average guy today, super rich guy tomorrow. Cliche to say the least but it did well however the overall storyline does seem a bit weak later on as the animators introduced slight contrasting material but still it didnt completely kill it. i say a good 7.\r\nThe art was nicely done, andi liked the character styling, however near the ending the animators seemed to forget a few frames. Despite that i say an 8\\n\\n\r\nSound, well what can i say bout the sound, not much really, would have given it an 7 or 8 but the themes absoluutely killed it, they were , well ...sometimes it was hard to remember that there was actually a theme at all.\\n\\n\r\nCharacters were probably the best aspect of the show, they were developed well especially the lead male and 2 of the main females while not being overly so. A 9 in my opinion.\\n\\n\r\nEnjoyment. like i said, i was suprised i actually enjoyed this anime, however say so, it wasn't enjoyable to the degree of riveting you to your chair but rather something that you would enjoy a few episodes, get up do something else then continue it later. I would say it deserves a 7 to be fair. As for recommending it, i would if you want something light to watch to kill time but not if you want something engrossing and epic.",
            "date": "2011-11-03T10:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 46769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/540025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zack21111994",
                "username": "Zack21111994"
            },
            "url": "https://myanimelist.net/reviews.php?id=46769"
        },
        {
            "content": "At first glance this may seem like an ordinary ecchi, harem anime wtih little to no story. But I surprised by the animation, it may be a little choppy from time to time but the fact that the characters move WHILE talking (at least a little).\r\nSTORY\r\nThe story is better then some of the other harem anime i have seen but i wouldn't say its good either. Its like Seirei Tsukai no Blade Dances story in a way \r\nlike \"I lost 6 liters of blood but i can still fight for my friends\" type of story. So i didnt enjoy it THAT much. The harem isnot satisfying at all...\\n\\n\r\nART\\n\r\nThe art is literally the most average art I have ever seen...\\n\\n\r\nSOUND\\n\r\nI didnt like the soundtrack, but im sure some of you will :) \\n\\n\r\nOVERALL\\n\r\nIts a great anime about oppai and rich people, with average art and (in my opinion) bad soundtrack. To finish it off I will just say: Its the most average show i have seen, with the worst harem in my opinion.",
            "date": "2015-10-10T03:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 200880,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4748763.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ruskii",
                "username": "Ruskii"
            },
            "url": "https://myanimelist.net/reviews.php?id=200880"
        }
    ],
    [
        {
            "content": "Of course this is series is still ongoing so I'll be giving my current impressions of the Anime.\r\nInitially I was skeptical about watching this since it seemed like just another harem Anime thrown at us. But so far I find it quiet enjoyable.\r\n. Pros\r\n+ Not your typical generic harem\r\n+ Has a mature feel to it\r\n+ Nice balance between comedy and drama\r\n+ Unique setting, harem in a rich setting\r\n+ Pleasing visuals which matches the theme and setting\r\n+ Ecchi not over the top ( well most of it is censored anyways )\r\n+ Comedy level is just right\r\n+ Potential to get serious in the latter of the series\r\n+Characters have depth to them\\n\r\n+ Big boobs\\n\\n\r\n. Cons\\n\r\n- Censored ( it can be good too, fanservice can be distracting ).\\n\r\n- Girls a bit cliched ( but the series makes them feel refreshing )\\n\r\n- Will it be able to wrap up nicely given it's only 12 episodes total?\\n\\n\r\n. In Detail :\\n\r\nSo far it doesn't seem to be your typical generic harem Anime. I haven't watched an extensive amount of harems. But I found the rich harem theme of this Anime unique. The main character is rich and so are the rest of the girls. While harems are typically comedic this one has a serious tone right off the bat. Of course that doesn't mean this Anime doesn't have comedy ( it is labeled ecchi, though it's currently censored ), it does. I feel that this Anime so far has a nice balance of comedy and seriousness. The series so far seems to have more depth than the typical harem. It takes the characters and plot in a mature way while being able to entertain us at the same time. Something that definitely stood out to be was the visuals which I found very pleasing to the eyes. It fits the theme of the Anime well which I believe greatly enhances the entire experience. While the characters may be fairly cliched ( girl with sword,tsundere, etc ), the way the series currently presents them makes the experience more refreshing. There's not so much to say bad about the Anime, it only just started and I didn't start watching with very high expectations. But so far I'm surprised by how well I enjoy it so far. It seems that it well get more serious in the latter of the series. I'll continue watching.",
            "date": "2009-08-06T17:17:00+00:00",
            "helpful_count": 164,
            "mal_id": 17550,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/187289.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kanauru",
                "username": "kanauru"
            },
            "url": "https://myanimelist.net/reviews.php?id=17550"
        },
        {
            "content": "When asked about the nature of a harem anime, most anime fans think: average guy, surrounded by 3 or more seemingly unattainable girls, in an unusual setting chuck full of breast-grabbing and panty-flashing. Does Princess Lover fall into this abysmal group? Yes, however it had the potential to achieve a lot more than what most harems fail to achieve, seeing how it's based on a rather popular visual novel.\r\nThat potential was shown in its characters however that same potential was foolishly squandered with its mediocre story. The story itself is typical, yet intriguing enough to keep most viewers interested. It’s about your average teenage boynamed Teppei, living an average life, with his average family... Then shit happens and our protagonist is later forced to live with his super rich grandpa and transfer to some absurd school for the super rich. \\n\\n\r\nAfter watching this I thought the writer must’ve taken whatever he could find from “Ye ol’ book of anime clichés” and decided that was their plot. Strangely enough, it worked surprisingly well when it came to introducing the characters to this profoundly entertaining story. The first half of the story basically sets this kind of tone for an exhilarating short series but in the end it was a wasted effort once the “real” story kicks in and boy, are you in for a ride. By ride I mean a one-way ticket to idiotsville, because only an idiot would throw away an enjoyable story for the garbage that replaced it.\\n\\n\r\nWith all that said, this anime didn’t entirely turn into a steaming pile of crap and that’s thanks to the interesting cast of main characters. Harem protagonists usually fall into 2 groups: the losers and the kind-hearted saviours. Yet Teppei initially doesn’t fall into either, because within his playful character is a young lad struggling to deal with his past and moral dilemmas. Not to forget the 4 leading heroines, who were rather well developed, some more than others and 2 of which who seemed similar in design and personality to 2 more well-known characters from other series. Whether that was intentional or not is unknown to me but they happened to be the most interesting of the 4 heroines. However apart from Teppei’s grandpa, the supporting cast turned out to be far weaker than the loosely put together story and if a couple of them were killed off, the story could have done a whole lot better.\\n\\n\r\nThe production values are somewhat difficult to delve into since a fairly unknown studio (GoHands) took on this series. The music was just about as memorable as every breath I take and the sound productions overall really isn’t any good. Yet the art style and animation has a unique vibrancy to it, giving a colourful experience that’s pleasing to the eyes. However the jarring simulated camera panning/rotation and the out of proportion bust sizes really brought it down for me.   \\n\\n\r\nOverall Princess Lover is a series that I hoped would break the chain of generic harem that seem to appear year after year, yet all it did was add unto the already tarnished reputation of the harem genre. Some of the blame falls onto the villains, who were the worst villains ever constructed but I blame the real villain… the idiot who thought of this crap. Well if you don’t mind all that I’ve said then watch at your own discretion; however I feel it’s more worthwhile to sit wait for the next Key & KyoAni collaboration.\\n",
            "date": "2009-10-28T11:29:00+00:00",
            "helpful_count": 109,
            "mal_id": 20075,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=20075"
        },
        {
            "content": "Mod Edit: This review may contain spoilers.\r\n---\r\nShit, where do I start, man. Well, here's the thing: I've been watching anime for over five years, which means that I've seen several romance/harem series (everything from Maison Ikkoku to Love Hina). Most of them have the same traits, but in order to poke out a bit from each other, they'll have to be in different settings. The question is if it's different and well enough executed in a fashion that captivates the viewer. And I'll let it out straightaway: Princess Lover fails epicly at that. By looking at the title, you know that you're already fucked:\r\nUh, sothe main character, Arima is going to succeed Arima Group Corporation, and by the sounds of it, it looks like it's like the biggest company in the world. And who's gonna take over it in near future? A teenager that knows shit about business. Who in the world would give away such a big responsibility to a relative they barely knew just like that? I can go on and on about this plot convenience, but hey, I'll spare you for that.\\n\\n\r\nBecause succeeding the corporation is just a lame excuse to enter a rich girls' school (okey, there are also boys there, but we barely get to see them). And of course, who do we meet there? It's the pink-haired girl whom he saved and his fiancee. And to answer your question straightaway: Yes, they do have big breasts. And yes, the pink-haired girl hugs Arima all the time with her gonzanga breasts. She's your typical cheery girl with a cheery voice with a hand that likes to wave awfully a lot. And the fiancee? She's your typical, somewhat-shy girl who speaks little. And when she does speak, she speaks kinda without emotions. She has coincidentally fencing as a hobby, which coincidentally matches with Arima's kendo, so they have by chance some common ground, I guess. With other words, we've seen these type of personalities before. A lot. So what personality are we missing now? Tsundere? And yes, there is a tsundere girl in the series.  You'll know it straightaway when she pops up for the first time (hint: she has a slightly annoying/whiny voice, which all tsunderes have, so I guess that's alright). Did I mention that we also have a big-breasted maid? The anime industry sure knows what we like. And Arima Teppei is your average male main character.\\n\\n\r\nAnd that's not the best part yet (and by that, I mean the worst). The thing is with harem series, is that the plot can't be all fluffy and boobilicious all the time; it also needs some drama. Without telling too much: It's fucking ridiculous when you get to it. If you by any chance come to episode 7 or 8 (I don't quite remember which one), you're gonna have a fuckin' laugh. I swear, the plot progression from there might be the most retarded one in harem anime history. It's clearly not to be taken seriously. I don't know, but I sure facepalmed a lot during that particular episode. And by of what I've heard; the series is based off of an H-game, so that kind of sucky plot is expected, I guess.\\n\\n\r\nIs there anything good in Princess Lover? The art is decent and not ugly to look at. The animation is standard, but not bad. And if you're looking for ecchi-ness, you've found it. A lot of booooobies. *coughEDcough* The music is not memorable at all; it's just generic. Visually speaking, the opening was pleasing to look at. In fact, I remember the breasts more than the music itself. And btw, Arima Isshin's voice is so badass (Wakamoto Norio is badass after all).\\n\\n\r\nSo unless you enjoy torturing yourself or your friends, avoid Princess Lover at all cost. I fuckin' used 160 minutes of my life saving your eyes. At least the show wasn't as bad as Koi Koi Seven. If you wanna see only big breasts and ecchi-ness, then there's actually better shows for that, like \"He is my Master!\". If you're looking for a good romance/harem anime, then go watch \"Ichigo 100%\" (the manga is better, though), \"True Tears\", \"Lovely Complex\" or \"ef - a tale of memories\".\\n\\n\r\nYOU OWE ME YOUR LIFE.",
            "date": "2009-08-30T13:59:00+00:00",
            "helpful_count": 67,
            "mal_id": 18229,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/211112.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Longxinus",
                "username": "Longxinus"
            },
            "url": "https://myanimelist.net/reviews.php?id=18229"
        },
        {
            "content": "You have a summary of Princess Lover, so I won't bother telling you that. I won't post any spoilers, so don't worry. \r\nOverall  7\r\nPrincess Lover started off very good. It had a serious with light humor tone, with all the ecchi-ness included;  but, then went way downhill in the second half which really hurt it overall. \r\nStory  6\r\nIf I was only rating the first 6 or so episodes, this show would be a 9 because it was very enjoyable. It's very obvious who Teppi likes right from the start (Charlotte) and they have a lot of nice romantic moments. So why didI give the story a 6? In the second half of Princess Lover, this show fails.....very hard. The last episodes were pretty bad. They bring in special ops and the story tries way to hard to be funny causing it not to be very funny. The story tries to be serious, but overall just can't be taken seriously. The only plus to the story in the last arc is that Teppi weeds girls out with a kiss. That's the only good thing. \\n\\n\r\nArt  8\\n\r\nThe art was very good, epically for a harem anime. Everything was pretty fluent and looked fine, but there were some distortions in some scenes that weren't really the focus of the shot which, if you noticed them, made the art seem not as good (animators got lazy/ budget issues). It never happened on the main focus of the scene though\\n\\n\r\n** not included in the rating** I would wait for the uncensored version to watch this show, in the censored version they censor things that are already censored. \\n\\n\r\nSound 8\\n\r\nThe OP/ Ed were pretty good and the characters voices were all done well. Nothing to really say here, no complaints and nothing to really say that was especially amazing. \\n\\n\r\nCharacter 7\\n\r\nOne downfall to the characters is even thought Teppi, Charlotte, Seika, Yuu, and Sylvia are the main characters, only Teppi and Charlotte get any real screen time. The others are are there, but don't do a whole lot until the end. \\n\\n\r\nTeppi >> an okay harem lead. had some funny moments and wanted to save everyone. But he turned into one of those \"talk it out\" characters to the main \"villains\"\\n\r\nCharlotte >> A lot of people didn't like her, but I liked her. She's a typical pink haired harem character who is very clingy to Teppi. SHe isn't very smart, but she was the funniest. (sex jokes about Teppi's .......)\\n\\n\r\nEnjoyment 7\\n\r\nAs I've already stated, the series started off really good and was very promising, but then went way downhill in the second half which really hurt my enjoyment.",
            "date": "2009-09-24T14:46:00+00:00",
            "helpful_count": 55,
            "mal_id": 19078,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133289.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Meh_93",
                "username": "Meh_93"
            },
            "url": "https://myanimelist.net/reviews.php?id=19078"
        },
        {
            "content": "This could have gotten a big fat \"1/10\" if not for the art/fanservice.\r\nBasically an H-Game that should have been an H-Anime. The storyline is so poorly constructed and contained reasoning so shallow that I have thought to myself \"WTF?\" or \"That's so shallow\".\r\nThe deal with Princess Lover is that it's basically a harem anime but for the reason of making it feel different (in a disastrous way) from the rest, it goes on by inserting a serious side to the plot which can be seen halfway to the end.\r\nThis is where the story becomes irredeemable.\r\nThe first 2 or 3 episodes was quite interesting since itfeels like a royalty harem anime that feels like it has a potential to be something unique. After the introductory arc comes the annoying \"Passing the Club\" which has started the downhill trend for this title. Then there's the last arc (Save the Princess). I found myself remembering the forum posts on various anime sites saying how bad it was. \\n\\n\r\nIn a nutshell, you'll watch this for the high production values and fanservice and nothing else. Then again, the terrible story will probably deter you from enjoying that in the first place.\\n\\n\r\nPros:\\n\r\nHigh production values\\n\r\nFanservice (for guys)\\n\\n\r\nCons:\\n\r\nStory\\n\r\nStupid and shallow reasons for the arc problem\\n\\n\r\nPrincess Lover got lucky by having a 3/10.",
            "date": "2009-09-28T19:06:00+00:00",
            "helpful_count": 38,
            "mal_id": 19208,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160071.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Unregistered00",
                "username": "Unregistered00"
            },
            "url": "https://myanimelist.net/reviews.php?id=19208"
        },
        {
            "content": "i know it isn't good to a review on a anime that just aired but i just had to. i want to know what guy hasn't dreamed of becoming rich and being surrounded by hot babes with huge breast. \r\nSTORY 9-  Arima Teppe, main character, lost his parents, reasons not known yet, and was adopted by grandfather, whose probably a billionaire. basically over night he went from poor to rich and from single and to #$%^, watch if you want to know. he is a lucky son of a B****, granted he lost his parents, but still a SOB regardless.\r\nART 9-  as faras art in anime goes. it is pretty good. no complaints. the actions scenes were well done and the details were excellent.\\n\\n\r\nSOUND 7- I'm going to be perfectly honest with you. i don't remember it. HAHAHA *sigh* ... that's kinda bad. well thinks of it like this. it wasn't so good that i would remember it and it wasn't so bad that i would complain. the OP and the ED songs were fine as well. everything blended well with the story.\\n\\n\r\nCHARACTER 8- there isn't much i can say about the characters at the moment, but of the one character that has any character development besides the introduction is Arima Teppe. he is looking for revenge on #$%^@. \\n\\n\r\nENJOYMENT 8-  this story seem like it will be interesting as far as the plot goes. i hope the classic themes don't mean over played cliches are also coming. \\n\\n\r\nOVERALL 8- if you don't mind being jealous of this guy then i recommend it. the plot seems to be interesting enough.\\n\\n\r\nnote- please comment, i feel i need some criticism in order for me to improve.",
            "date": "2009-07-09T11:20:00+00:00",
            "helpful_count": 27,
            "mal_id": 16598,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/41291.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nate23nate23",
                "username": "nate23nate23"
            },
            "url": "https://myanimelist.net/reviews.php?id=16598"
        },
        {
            "content": "Story\r\nAt first this is interesting since the first episode, but as the episodes goes, it was ridiculous, there's a lot of plot holes and i felt that i was watching a mexican novel serie, filled with stupid plot holes that you can see even blindfolded, the thing is that the story could have been really good if this wasn't rushed, so i didn't like it because of those freaking plot holes, overall was fine.\r\n[b][u]Art & Sound[/u][/b]\r\nIt was good on both, it really matched the scenes and the ecchiness was enjoyable too, the voice acting was good too.\r\n[b][u]Character[/u][/b]\r\nThe characters weren't deeply developed, not everyone at least,is like they forgot the other two girl MC, they barealy appeared a lot and the girl of the main story was forgotten, they didn't have the time to talk and i'm talking about Sylvia, i hated that they didn't even try or at least Teppei didn't try to know her and she was a big part of the story for f**k sake, Seika appeared more than Sylvia, they only focused on Charlotte, and i still don't know nothing about Sylvia who i wanted to see more than Charlotte.\\n\\n\r\n[b][u]Enjoyment[/u][/b]\\n\r\nI really enjoyed this despite the bad things, i wanted to take the good things, like the ecchiness, the comedy and a part of the story despite the plot holes and the writers not caring about the story, the ending was like lol wtf but overall was good enjoyment.",
            "date": "2015-08-07T10:49:00+00:00",
            "helpful_count": 25,
            "mal_id": 195430,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195430"
        },
        {
            "content": "I've thought a lot about what I think is useful when starting to watch an anime - criteria that might change my thoughts as to whether or not to watch a series. I’ve customized this list to what you typically see in ecchi series. First I give the criterion, then I define the parameters of the criterion, then I state how the series matched up against the specified parameters. I also note how things like art and the soundtrack affect my overall rating of a series (along with what I thought of the two components), if anyone is interested in that.\r\n I don't claim thatthis criteria will be universal - different people have different tastes and value different things, but this review is what would make/break watching a series for me. Mild spoilers ahead.\\n\\n\r\nAnnoying Mascot Characters\\n\r\n1. It's not a matter of whether or not the mascot character is annoying, it's a matter of how annoying the mascot character is.\\n\r\n1) There is not a clearly defined mascot character in this series. Occasionally the main romantic interest acts as a mascot character, asking really simple questions so things can be elaborated more for the viewer, and offering overly-simple frustration at whatever unfortunate circumstance is unfolding. That being said, the main romantic doesn't often do that and when she does it's only mildly annoying.\\n\\n\r\nArt\\n\r\n1. I find art to be pretty subjective. If I find it to be particularly good, it might +1 my overall opinion of the series, but I typically don’t hold it against a series for being averagely animated for the time it was animated.\\n\r\n1) The art in this series was pretty average, nothing eye-popping and almost nothing distractingly bad. If I had one complaint about the art it would be that the most of the main female cast had breasts that were big just a bit beyond  the point of believability. I personally find female characters more attractive when I think that finding someone with their proportions in the real world is not impossible. \\n\\n\r\nFriend Quality (MC-Male Friends)\\n\r\n1. The male friend(s) is/are (a) pervert(s) who do not get much characterization outside of getting the MC into trouble\\n\r\n1) That’s essentially what Teppei’s group of male friends are. There are two distinctions to be made: first, Teppei is the ringleader for his group of friends; second, there is a male friend Teppei has who is constantly ignored – he’s generic, but outside of the parameter of the stereotypical male friends in ecchi series.\\n\\n\r\nGratifying\\n\r\n1. The MC is not a hopeless loser with no talents and horrible grades. If he is, when he improves, his improvements come relatively early in the series and they stay for the duration of the series.\\n\r\n2. When the MC has to fight, he fights. (This doesn't have to do with the MC fighting well, just not being a pushover.)\\n\r\n3. The MC hones his skill and visibly improves throughout the series (when there's action in the included genre)\\n\r\n4.  Romantic interests are forthcoming about their feelings (both the MC and the girl involved)\\n\r\n1) The main character certainly was not a loser, and not a clear-cut winner either. His grades weren't mentioned at any point throughout the series, so we're left to assume he's okay there. \\n\r\n2) When the MC had to fight, he fought, with little or no prompting from other characters.\\n\r\n3) The MC had good swordsmanship, but did not visibly improve it throughout the series. There was character skill progression, but it was more learning how to function in high-society (think Hayate no Gotoku without the ridiculousness and you'll have a decent perspective of what the training was like).\\n\r\n4) The MC was not too decisive during the course of the series about who his number one female was, he seemed to enjoy his female counterparts equally, there weren't any surprises about who he somewhat leans towards at the end of the series. The female counterparts are all pretty forthcoming about their feelings, there was one girl who was kind of a tsundere, but she was definitely forthcoming by the middle of the series and not particularly violent.\\n\\n\r\nMagical Falling\\n\r\n1. The MC somehow ends up in the 69 position or groping the female foil(s)' chest more often than humanly possible\\n\r\n1) This is an ecchi show, so it does happen; however, it's much less frequent than other ecchi shows. Also, the female character(s?) play(s?) it off much better than other ecchi show female character(s) do.\\n\\n\r\nMemory Problems\\n\r\n1. The MC has forgotten a promise to a childhood friend\\n\r\n2. The MC has forgotten the face of a childhood friend he made a promise to\\n\r\n3. The MC has amnesia \\n\r\n1) There were no MC memory problems in this series\\n\\n\r\nPredictable Transfers \\n\r\n1. If they're an antagonist in one episode, they're in the MC's class the next.\\n\r\n1) The only predictable transfer was the MC into the academy, and it was by no means painful to watch. \\n\\n\r\n‘Special’ Main Character\\n\r\n1. The MC is somehow distinguished during the course of the series from his peers – be it a special power or sudden change in social status\\n\r\n1) This happens – you know what it is from the summary given on MAL\\n\\n\r\nSoundtrack\\n\r\n1. This rarely has an impact on my overall rating of a series, but I do feel I should note when I think a soundtrack is particularly memorable\\n\r\n1) I thought the soundtrack was good, in that I remember thinking it was good as I watched the series; however, I don’t remember any scenes that really hit home for me because of the music – which sometimes happens to me when I watch anime.\\n\\n\r\nVoice Acting\\n\r\n1. I'm not particularly judgmental about voice acting, the only thing that really bothers me is if there's a male character with a particularly effeminate voice or vice versa\\n\r\n2. If there is English in the subbed version, there either isn't a lot or there is not a thick Japanese accent with characters who are supposed to be native/fluent English speakers\\n\r\nThe voice acting was fine in both regards. \\n\r\n1) I remember thinking (as I was watching the series) that the antagonist for this series has a great voice actor. \\n\r\n2) There was not a lot of English in this series.\\n\\n\\n\r\n1) One thing that bothered me about the show was how clear-cut the themes were, despite them dealing with complex topics which don't really have an answer to them. One of the themes is more 'money more problems'. Another one of the themes seems to be, 'poor people shouldn't blame rich people for their being poor, they should just stop being poor'. This really just left a bad taste in my mouth, if they left some characters and some plot more up to the viewer to decide what is right and what is wrong, I would have been much happier with the quality of the story.\\n",
            "date": "2014-03-21T22:26:00+00:00",
            "helpful_count": 20,
            "mal_id": 136399,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3463853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/No1shero3",
                "username": "No1shero3"
            },
            "url": "https://myanimelist.net/reviews.php?id=136399"
        },
        {
            "content": "There are a lot of harem anime around there, but this harem anime was the only one that made me emotional. Princess lover focused more on romance than ecchi, and that's probably the reason why I got more emotional. \r\nThe characters were different, especially the MC. Instead of a shy and normal protagonist living a normal life in a normal house, It had Teppei, the heir of a rich man living a dangerous life in a huge mansion. I've never seen any character like him. There's a lot of Charlottes and Sylvias out there, but only a few Teppei. Sure, he resembles other mainstream characters,but you can see that his personality was different from them.\\n\\n\r\nAs to the plot, it was perfect. There were no holes other than the open ending. What made it unique from ther harem anime is that it had a balanced plot. It didn't have a hella long introduction and fillers. It went straight to the point and perfectly balanced, with cliffhangers to keep the tension and interest of viewers.\\n\\n\r\nOne thing I liked. About this anime was the graphics. You won't even realize that there's a transition from picture to picture. The graphics were simply a classic, even though it was aired in 2009.\\n\\n\r\nThe voice acting... Pretty common, to be honest. But still, they did a great job.\\n\\n\r\nAll in all, I loved it. It was an entirely new thing for me. Emotional and romantic, that's princess lover!",
            "date": "2014-10-19T02:08:00+00:00",
            "helpful_count": 18,
            "mal_id": 165253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=165253"
        },
        {
            "content": "\"Ill deal with it somehow!\" - Teppei Arima\r\nTeppei, a young teenage boy who lived with his mother and father in a social status that could be considered poor, but he was happy. Unknown to him, his life changed dramatically after his parents died in an accident that could be related to the recent attacks on the rich families in his area. Accepting his grandfather's adoption, Teppei is forcibly thrust into a world where he went from poor to filthy rich. The romance/comedy/action that ensues following his attempts at adapting to the rich life is one worth watching.\r\nI found Princess Lover! One of the unique harem/ecchi/romanceanime that I have seen. Contrary to the many harem anime out there, Princess Lover! put on its own style despite being adapted from an adult visual novel. \\n\\n\r\nThe Story: Considering all the harem based anime I have seen thus far, Princess Lover! is set in an entirely different setting. Rather than the typical high school drama, PL focuses more on a the world that surrounds the main character which includes Japan families, royalty from other countries, and heirs to major fashion companies. (Not to mention all of whom are filthy rich). The story starts out suddenly, Teppei, completely happy with his life, is suddenly ripped from his normal atmosphere when his parents die in an accident. His grandfather, who adopts him, turns out to be the owner of a mega famous and popular company, The Arima Combine. The comedy that comes from Teppei's sudden transfer to the rich and famous was very pleasing. Even in the short 12 episodes, the plot development surprised me. Usually in harem anime, one doesn't see much plot development because of the major focus on the characters, PL does a good job of balancing both. The story setting and plot isn't a typical harem themed anime, and because of that, PL has a more mature/different/pleasing feeling. Not only does the plot explain more on the conflict between the rich and poor, it also touches on economics and the roles that CEO play in running major corporations. Not only did GoHands, and Dream Force did a good job of balancing the plot and characters to where the story actually progressed to an obvious well done climax and falling action, but they also did well in including comedy and drama. \\n\\n\r\nArt and Sound: The visuals done by the producers weren't sharp and picturesque like one would see in modern anime, but the smooth brightly colored drawings added to the music that accompanied it. I've never had to find fault at an anime's pictures or music, but for a 2009 anime, I think PL did very well. Being tagged as an ecchi anime I was pleased that the fan service wasn't over the top, but tastefully added. There are uncensored and censored versions but either way, it doesn't detract from the work as a whole. \\n\\n\r\nCharacters: Like in any generic harem anime, the main character can fall into one of two categories. The useless loser type, or the kind-hearted \"I'll save everyone type\". Unusually Teppei doesn't fall into either. With a good background from his parents backing his personality, a kind output that allows him to interact well with the people around him, the animators also made a character that I haven't seen so far. Teppei, unlike generic harem main characters, actually saves the day from time to time, either with his badass kendo skills, or his growing skills in managing a business. It seems as though to put it in other words, comparing it to usual harems, for example To Love Ru, Teppei and the characters in PL, and Rito and the characters in TLR are reversed. While Rito depends on the aliens to save him most of the time (not to mention he is dead useless physically), Teppei can be considered the opposite. (Although, I think deflecting bullets with a wooden kendo sword is a little far fetched.) The other characters in PL were also somewhat unique, but not so much that one couldn't see similarities. \\n\\n\r\nEnjoyment and Overall: I think the major aspect of PL that allowed it to be good, would be the overall feeling of how different it is compared to the norm. In my words, it thought outside the lines of the box and succeeded. If one is looking for a break from the typical harem type anime, PL provides pretty much all of that. To reiterate, with a unique setting, different main character, and actually some plot development that occurs, succeeding at balancing these unusual additions to the harem style, PL is one worth watching. PL can also be considered an indie anime, but it is also underrated; if any of you who read this play League of Legends, it's like an unpopular champion that is actually very strong.  \\n\\n\r\nThanks for reading,\\n\r\n-Nebarto\\n\\n",
            "date": "2013-07-08T11:44:00+00:00",
            "helpful_count": 10,
            "mal_id": 104427,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2608033.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Nebarto",
                "username": "Nebarto"
            },
            "url": "https://myanimelist.net/reviews.php?id=104427"
        },
        {
            "content": "I never thought I would find myself writing another review given the fact that I don't watch anime as much as I used to, but the hilarity that is Princess Lover! warranted another one with my poor command of the English language.\r\nSo where to begin? \r\nThe plot is straightforward enough...random guy becomes the heir to a vast fortune and has to become accustomed to living as a rich man. So that's where that ends...this anime can be summed up in pretty much one word: Fanservice!\r\nTrying to understand some of the events that goes on as the \"plot\" progresses is not good for your health andI highly advise against it. Seriously...some of the events that occur are downright outrageous and make no sense whatsoever. So stick to the reason why you chose to watch this, okay?\\n\\n\r\nBeing the fanservice anime that it is, it knew where to focus its budget. The fanservice art is superb and gets the job done. There are no complaints on this department whatsoever and this may be the only point in which this anime excels at. \\n\\n\r\nThe musical score is decent, but nothing memorable so let's keep moving here.\\n\\n\r\nCharacter wise...well this will pretty much play like most visual novel adaptations out there. You'll grow to like the sub heroines and hate life as the main heroine pales in comparison to them. Seika (the twintail tsundere) is the highlight of the show for me. I can't divulge anymore details without entering spoiler territory, but she fits in to the catogery of \"proactive\" tsundere. Oh there's also the other heroines...maid-san is nice, the blond fencer is also nice, and the heroine is annoying.\\n\\n\r\nI chose to watch this anime for the sake of the comedy and knew full well what I was getting in to with the 'ecchi', 'harem', and 'romance' tags attached. If you keep those in mind and brace yourself for what's to come, then you'll have no problem getting some enjoyment out of this. And even then that doesn't say much as everything is a giant trainwreck after the Seika arc. Oh and don't even bother expecting a Sylvi route as there is none; go check the OVA if you want Sylvi goodness.\\n\\n\r\nOverall...a deploring anime whose sole redeeming factor is the fanservice and Seika. If you aren't a fan of either, then stay the hell away. If you are...well its only 12 episodes and they really handled Seika's character pretty well. \\n\\n\r\nAnd that's Princess Lover! in a nutshell.",
            "date": "2011-10-31T03:08:00+00:00",
            "helpful_count": 10,
            "mal_id": 46547,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/PimpToad",
                "username": "PimpToad"
            },
            "url": "https://myanimelist.net/reviews.php?id=46547"
        },
        {
            "content": "wow... I really don't know what to say. I never would have thought that I'd watch an anime that had the words \"Princess\" and \"Lover\" in it, let alone both of them together.\r\nThe story is exactly the kind of stuff that I love. A decent, average guy that gets thrown into a world where he has no idea what's going on. \r\nThe great thing about Princess Lover is the fact that the protagonist isn't one of those clueless airhead guys. He knows that the girls around him love him, Hell they even say it to his face, and hes man enough to take it intoconsideration and go with the flow. He doesn't hurt them like other guys do.\\n\\n\r\nI would highly recommend this anime to anyone who is interested.",
            "date": "2011-04-19T18:54:00+00:00",
            "helpful_count": 8,
            "mal_id": 36235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=36235"
        },
        {
            "content": "Princess Lover, not your made in 10 minute harem story where the girls just automatically plastered themself on the main lead.\r\nThe story is about a poor boy who found out he had a extremely rich grandfather after his parent's death.This is the very boy who ended up being the successor of his grandfather's business and the same person who is loved by two princess character female lead which are actually princesses.\r\nThis anime do not have the \" I Love All \" ending where the guy doesnt decide who he likes and just continue his life with all the female leads.\r\nHe chooses and decides the onethat he loves and goes all out for her risking his very own life.\\n\\n\r\nI definitely enjoyed this anime very much, it would be regrettable as a anime fan to miss this anime, it picks up right on episode 1.\\n\\n\r\nWith state of the art, artwork and graphics and sound, with a intense story and pleasant character devolopment with a mix of fantasy and reality.\\n\\n\r\nIt is hard not to enjoy this anime to the fullest.",
            "date": "2010-07-01T01:22:00+00:00",
            "helpful_count": 7,
            "mal_id": 27836,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/348448.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Guessed",
                "username": "Guessed"
            },
            "url": "https://myanimelist.net/reviews.php?id=27836"
        },
        {
            "content": "When people say this isn't your typical harem anime THEY ARE LYING TO YOUR FACE. Just like every other anime a majority of the girls fall in love with the main protagonist for next to no reason and the further in the anime you get the less sense everything starts to make. Normally for a review a would talk about the story in detail but because this one is essentially only a slice of life for the first 7 eps im going to only briefly talk about them. Warning contains spoilers \r\nStory: \r\nThe story centres around Teppei Arima who becomes super rich after been namedthe heir to the Arima corporation. He then finds out that he has an arranged marriaged to Sylvia Van Hossen.\\n\r\nThe first 3 eps is simply introducing the cliche' harems girls (none will stick with you for very long). After that until ep 7 it is simply him going to school and finding out just how hard it is be super rich for no reason. Such complications include trying to get into his schools social club ( i know right riveting) and trying to get a girl to not hate him simply because of his last name.\\n\\n\r\nAfter ep 7 however is where it starts to get really stupid, a group of terrorists who hate the armia group because they're rich (yep thats the whole fucking reason, no joke) attack their headquarters to try and frame them doing something bad or something and during the attack they take control of their systems. Never ever ever ever have I heard computer terminology so poorly used in my life. It was so bad iI had to actually stop the ep and go for a walk to clear my head; I dont think the writer of this anime knew what the fuck they where writing and just put in whatever words they thought might work for the scenario. So after a bunch of bull shit that lead them to regaining control Tempai Arima decides to go rescue Charlotte Hazelrinkin (more on her later) instad of letting the professionals handle the work \\n\\n\r\nWARNING THIS IS WHERE I GET REALLY PISSES OFF\\n\\n\r\nAfter rescuring the useless Charlotte he finds and does not raise a point of asking why everyone else in the FUCKING BUILDING HAS UP AND LEFT THEM IN THE BUILDING WITH FUCKING BOMBS IN  IT and must now with the extremely useless Charlotte go defuse one of the bombs planted in the building. After getting to safety Sylvia now decides she is not going to let her fiancee' die with her doing nothing like her mothers deaths (I get more into this with the character portion of the review but this makes no sense at all) and goes back into the building she just ditched him at and try to defuse a bomb (note she has absolutely no fucking experience what so ever with bombs) instead of letting the bomb specialists do it under the ruse that \"they cant make it in time\". So you're telling me you have time to helicopter some fucking inexperienced girls into the building but not bomb specialists? . After finding the bomb Teppai runs into one of the terrorists with a gun. Remember when i said that this anime was exactly like every other harem out their? This puts the nail in the coffin. Whilst being a very huge range disadvantage teppai with Charlotte cheering him in the background proceeds to dodge every bullet he fires ( and this is a professional marksman btw) and knocked him out in one hit; even though he was wearing full body armour. He then proceeds to throw the bomb into some shaft which was then stated to be able to withstand the bomb. \\n\\n\r\nIf you havent got the message yet this story sucks fucking balls, all that happens later is the girls fighting over his attention. I give the story a 2 because not only does it use every cliche' in the book but it is terribly written, and poorly executed. \\n\\n\\n\r\nArt; \\n\\n\r\nThankfully the one good thing I can say about this anime is that it looks the part, this is the only good thing that I got out of this anime (note: dont use this as an excuse as I did to watch this piece of shit) \\n\\n\r\nCharacters \\n\\n\r\nArima Teppei: His your typical harem anime main protagonist, oblivious to peoples feelings of him? Check. Has supernatural speed and dexterity only when the situation demands it? Check . Puts his life on the line to save people despite not knowing them? check. Solves every problem around other characters in an attempt to help? Check. The list goes on and on, he is nothing more than your typical good guy anime protagonist. Very poorly done and a shit character all around. \\n\\n\r\nSylvia Van Hossen: \\n\\n\r\nLike every other main character in this piece of shit, Sylvia is nothing more than a kundere, she ticks off every cliche' in the book. However she does have some strong points and is probably the most enjoyable of all the main characters. She has a great deal of experience in fencing and doesnt just start to like him out of the blue for no reason like the rest. In this story she is his fiancee' however this anime for some reason doesnt use this has an excuse for her like him out of the blue which is weird  cause this anime is nothing but a giant cliche' fest. She has a strong bond Charlotte which is actually properly explained in the story through a series of flash backs. She is the only character besides charlotte to have an actually explained bond with any other character that is simply because the story said it must be like that. \\n\\n\\n\r\nCharlotte Hazelrink: \\n\\n\r\nTypical dereder who falls in love with Teppei and is jealous of Sylvia cause they're getting married. Aside from having large breasts their is nothing really more to say about this character, very boring. \\n\\n\\n\\n\r\nConclusion: \\n\\n\\n\r\nThis anime sucked balls, the only good character was Sylvia. The story was cliche', boring and poorly executed. Please do not watch this anime   \\n\\n\\n",
            "date": "2015-07-15T17:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 193504,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gimerly",
                "username": "Gimerly"
            },
            "url": "https://myanimelist.net/reviews.php?id=193504"
        },
        {
            "content": "Ok so story, this the most predictable beginning I have ever seen If you watch the first episode you will understand what I mean. In the first episodes I was thinking ok it seems like fun average school theme. I guarantee that if you continue to watch this ridiculous storyline of the anime you will surely feel disappointed by especially somewhere around 8 or or 9. Pretty much no effort at all( Lets be honest after the first episode you'll understand how the story plays and who wins but there are a couple of funny scenes in there). \r\nArt- For this a 7 because notof the over-sized melons(well maybe a little) but the environment and architecture was very detailed to a certain extent.\\n\\n\r\nSound - I mean it really depends on the quality of the video. \\n\\n\r\nCharacter - No surprise... abnormally large boobs on strangely skinny girls. \\n\\n\r\nEnjoyment- its like a roller coaster it goes up and  down except this time it goes up a few episodes then stays down for the rest of the eps. I actually had  wait a few days to watch it because I was pissed how they exposed the ending like that. Lastly they weren't kidding when they called it \"princess\" lover.\\n\\n\\n",
            "date": "2011-07-31T19:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 40501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/530909.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Phantomtheif",
                "username": "Phantomtheif"
            },
            "url": "https://myanimelist.net/reviews.php?id=40501"
        },
        {
            "content": "This is the best Anime I've ever seen!\r\nBecause this anime does not dependig on the length of a video, how many episode this anime have, the video is depending on the way they let you think, watch, feel.\r\nIt doesn't matter what other peoples thinks of this video, the fact is just that this anime really can bring the message to you, that's one of the most important thing of watching an anime.\r\nEither the storyline is good, so far.\r\nSo I really look forward to see the other episodes!\r\nKeep up the good work, and may this anime continues in the future with more episodes.",
            "date": "2009-08-09T23:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 17631,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/218943.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/perform",
                "username": "perform"
            },
            "url": "https://myanimelist.net/reviews.php?id=17631"
        },
        {
            "content": "STORY: Princess lover has a great potential of becoming a great harem anime but the thing that spoilt it was the lack of good comedy and the 'falling action'. usually in a normal harem anime, there would be 3~7 episodes when they will tell us more about the characters and for the growth of the relationship between the charaters. i was disappointed when 8~12 because it was already like the end of the story. if this anime was made into a 24 episodes anime, it could have been a great sucess.ART: nothing great. the best thing is the rich background of the characters.\\n\\n\r\n       SOUND:  the op is not bad but there are no interesting music during in the anime or climax.\\n\\n\r\n        CHARACTERS: everyone was great but i really get boring of personalities like charlotte. she just sticks onto teppei. this way, it becomes a one-sided harem. the character and appearance of sylvie is very similar to saber( fate/stay night). \\n\\n\r\n        ENJOYMENT: I recommend this anime to harem lovers but not to action lovers because you'll get boring of the fighting scenes. the movement is slow, and the fights ends so fast.\\n\\n\r\n         OVERALL: 6/10. if I didn't count episode 8~12, i would give this a 7/10.",
            "date": "2009-11-04T22:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 20275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/74890.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ariffmontel",
                "username": "ariffmontel"
            },
            "url": "https://myanimelist.net/reviews.php?id=20275"
        },
        {
            "content": "Overall score:9.84\r\nThis is the greatest drama series I've ever seen, be it manga or anime. \r\n[Notable picks:]\r\nDrama:10 l Tragedy:4 l School life:4 l Inspirational:8 l Wholeness of plot:9 l Harem:8 l Comedy:6 l Romance:6 l Action: 8\r\nStory:10\r\nQuite notably, there are three parts to this series: Intro, Making allies and crisis. I felt that it is very well-structured and fan-service does not impede the plot at all, except in the first part of ep 6, which was a bit excessive. Little unnecessary scenes.\r\nEspecially worth commending are the drama and inspirational scenes, which were aplenty. Drama especially unfolds from the ep7. That means that before ep 6the mood for the series was quite light, whereas it was heavy from 7 onwards.\\n\\n\r\nStory was original, especially when this is a harem genre series. Like Asu no Yoichi, all of the main and some of the side characters played a heavy part in the development of the plot and climatic ending. The seemingly deep plot uncovered at the intro was properly addressed by the climatic ending, which is not every series could do. \\n\\n\r\nOne setback is that by the last minutes of the last episode, the harem presented seems to be still held there, and no firm conclusion was made with who Teppei was going to be with.\\n\\n\r\nArt:9\\n\r\nThe art was amazing. Characters sometimes had near-perfect expressions. Colour was comfortable with the eyes and landscape was amazingly presented. Special effects looked almost real.\\n\\n\r\nSound:9\\n\r\nSome bgm were fantastic, some OSTs were spectacular and fitting in well with the scenes. OP and ED were great and fitting with the series, esp OP. Voice actresses and actors displayed emotions, reactions etc. well. \\n\\n\r\nCharacter:10\\n\r\nAmazing use of characters to move plot along, all had special talents. We have a combat butler, a compassionate princess, a pro-fencer, a pro-swordsman, people with high authority and wisdom etc. Character development was great, but Isshin seemed to have a mysterious feel even to the end. Characters' personalities were improving till the end, but not out of place.\\n\\n\r\nEnjoyment:9\\n\r\nI would have liked it even more if they didn't change the atmosphere so quickly from ep 6 to 7. Overall, I enjoyed the tension and plot presented throughout the whole series. You would love this series if you like drama.\\n\\n\r\nOverall:\\n\r\nThis is one of my top 3 fav anime for sure, since I rarely find any series that really has potential for deep plots but yet finish them. \\n\\n\r\nOne regret is that the harem was still unresolved right till the end, it's as if the producer was happy to let the series as a harem judging from what the main female characters say in the end.\\n\\n\r\nAlso, in the ending scenes, the eng subs for songs in the last episode was not presented very well for the one I watched.",
            "date": "2010-03-13T23:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 23962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292453.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dunkjoe",
                "username": "Dunkjoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=23962"
        },
        {
            "content": "I was actually suprised that i picked this anime to watch or that i actually enjoye watching it although i still ended up asking myself if i seriously just watched and enjoyed it. Well enough blabbering. \r\nReveiw:\r\nOkay so the story isnt something new, i mean lots of shows hit you with this theme, meaning: average guy today, super rich guy tomorrow. Cliche to say the least but it did well however the overall storyline does seem a bit weak later on as the animators introduced slight contrasting material but still it didnt completely kill it. i say a good 7.\r\nThe art was nicely done, andi liked the character styling, however near the ending the animators seemed to forget a few frames. Despite that i say an 8\\n\\n\r\nSound, well what can i say bout the sound, not much really, would have given it an 7 or 8 but the themes absoluutely killed it, they were , well ...sometimes it was hard to remember that there was actually a theme at all.\\n\\n\r\nCharacters were probably the best aspect of the show, they were developed well especially the lead male and 2 of the main females while not being overly so. A 9 in my opinion.\\n\\n\r\nEnjoyment. like i said, i was suprised i actually enjoyed this anime, however say so, it wasn't enjoyable to the degree of riveting you to your chair but rather something that you would enjoy a few episodes, get up do something else then continue it later. I would say it deserves a 7 to be fair. As for recommending it, i would if you want something light to watch to kill time but not if you want something engrossing and epic.",
            "date": "2011-11-03T10:14:00+00:00",
            "helpful_count": 4,
            "mal_id": 46769,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/540025.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zack21111994",
                "username": "Zack21111994"
            },
            "url": "https://myanimelist.net/reviews.php?id=46769"
        },
        {
            "content": "At first glance this may seem like an ordinary ecchi, harem anime wtih little to no story. But I surprised by the animation, it may be a little choppy from time to time but the fact that the characters move WHILE talking (at least a little).\r\nSTORY\r\nThe story is better then some of the other harem anime i have seen but i wouldn't say its good either. Its like Seirei Tsukai no Blade Dances story in a way \r\nlike \"I lost 6 liters of blood but i can still fight for my friends\" type of story. So i didnt enjoy it THAT much. The harem isnot satisfying at all...\\n\\n\r\nART\\n\r\nThe art is literally the most average art I have ever seen...\\n\\n\r\nSOUND\\n\r\nI didnt like the soundtrack, but im sure some of you will :) \\n\\n\r\nOVERALL\\n\r\nIts a great anime about oppai and rich people, with average art and (in my opinion) bad soundtrack. To finish it off I will just say: Its the most average show i have seen, with the worst harem in my opinion.",
            "date": "2015-10-10T03:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 200880,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4748763.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ruskii",
                "username": "Ruskii"
            },
            "url": "https://myanimelist.net/reviews.php?id=200880"
        }
    ],
    [
        {
            "content": "Imagine a story where the MC possess 0 vices, passes up on every opportunity to move in on his \"love interests\" and makes girls fall in love with him after taking them out shopping once. This is the kind of story Princess Lover is. It's utterly contrived , childish and nonsensical. \r\nThe story is a boring pile of drool, there's a guy named Teppei who likes swinging a sword for fun ; a group of large tits show up , he takes them shopping with his 8 digit Visa card and they want to suck his cawk. End of story. \r\nThe characters are a totaldisaster, the MC is a guy who gets a hard on while dancing with a girl. Spectacular. The girls posses 0 traits, just a plethora of green, pink, blond headed zombies who want to devour MC's crotch and credit rating. \\n\\n\r\nThe jokes are more boring than a tourism major's university experience. Pink haired girl gets kidnapped and complains about not taking a bath. Kidnappers blush and let her take a bath. HWaHaHaHAHAHAHhhAH she's so kawaii. Fuck you.\\n\\n\r\nThe art is decent when focused on gravity defying tits, the rest looks like it was drawn with a crayon by a drunk hobo.  The sound effects are littered with screechy shouts denouncing Teppei's arrival. \"Teppei-kun \" \"Teppei!\" \"Teppei dono\" \"Teppei sama\". Riveting.\\n\\n\r\n2 Points. Steaming pile of nut filled turd.",
            "date": "2016-05-20T16:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 218973,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=218973"
        },
        {
            "content": "I actually read the first chapter of this manga before i saw anything about the anime counterpart. The manga actually started off very differently with the focus on the princess alone, but that's beside the point. Overall I really enjoyed this anime, it was a nice watch. It starts off intriguing and then kinda slows down a bit into a nice good-hearted watch. However, it actually gets serious pretty abruptly, and the serious section is quite nice, and at times a bit darker than i expected (people actually got shot!). The characters are all nice, if not a bit small of a cast, the mainguy and the girls taking up pretty much most of the focus with very little light on others. The animation is fantastic, and yes, gives nice ecchi moments because of it. Actually, it wans't that bad when it came to ecchi-ness. Sure it had some fan-service from time to time but it was never so thick and saturated that it put me off, although i did download the censored version. The one complaint i have about this anime is that it is far too short and the ending doesn't really solve anything! C'mon man, pick a girl! Even so, this anime is still a nice watch and would appeal to men and woman alike. I recommend it to anyone who wishes to see a nice romance anime with a decent plot, and some ecchi. Oh but don't watch the OVA, dang hentai....",
            "date": "2011-09-25T18:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 44151,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/459192.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_Guardian_Angel_",
                "username": "_Guardian_Angel_"
            },
            "url": "https://myanimelist.net/reviews.php?id=44151"
        },
        {
            "content": "Story: The start of the series seemed like it could have been a decent show, enjoyable to watch, decent character development and fanservice. Can't forget fanservice. But, it seemed like romantic and awkward moments were just being tossed at you between Teppei and Charolette, but seeing Charollete often, i didn't really mind ;D. The real story only kicked in during the last few episodes so it seemed as if you were just being assaulted by a very predictable story line.\r\nArt: Some very good art in this anime, structures and backgrounds as well as character details were great. Once again, the fanservice of pantie flashing andbig breasts was still there, as well as many ecchi moments in the later parts of the show. All in all, good art.\\n\\n\r\nSound: Voice acting was fairly decent, opening and closing themes were a bit upbeat and fluffly, but were at least decently made. Not much to say on the sound. \\n\\n\r\nCharacters: Protagonist not the average one, actually a good guy instead of the seemingly common harem protagonists, which was a breathe of fresh air. The four main female characters weren't very developed throughout this anime's short life, but the cliche of the mind you, extremely attractive airhead lovergirl was shown too much, and the other girl characters probably should have received more screen time if the show lasted more than just 12 episodes.\\n\\n\r\nEnjoyment: I did actually enjoy this anime, contrary to some others. If you can get around being kind of jealous of all of these unobtainable girls falling in love with the main character. With all aspects of the show in mind, it was a very enjoyable show, which I find could have been very successful if the show didn't have such a short life.\\n\\n\r\nOverall: I kind of liked this show, although short was still somewhat enjoyable, certain characters could have received more screen time or more lines, and it may have been a bit better, but all in all a somewhat decent show, but like some other Harems it does have some cliches in characters.\\n",
            "date": "2013-06-24T19:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 102297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ugandans",
                "username": "Ugandans"
            },
            "url": "https://myanimelist.net/reviews.php?id=102297"
        },
        {
            "content": "Its a great shut your brain off and just watch anime. In all  honestly doesn't really deserve a 10/10 but it definitely deserves a 8/10 at least. Art is very good looking for an 09' production and even as a previously stated a shut your brain off and just watch show it flushes out each of the characters very well. Main compliments that I've heard are one or two things about ending but, I believe this was done on purpose because it depends on what you want and that is how it happened.\r\nIf I had to nitpick after just watching it, it would bethat the main love interest motives don't feel as flushed out as the rest of them.",
            "date": "2018-08-26T20:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 287479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/falactal",
                "username": "falactal"
            },
            "url": "https://myanimelist.net/reviews.php?id=287479"
        },
        {
            "content": "Visual novel that was turned into harem anime… with a rather large budget even. Interesting case for sure. But not really in a good way. It was very entertaining to watch though for all the wrong reasons mostly. It was often so stupid. Like really really stupid. Story was predictable and plotholes were so huge that they make all those boobs look small. \r\nMain plot tells story of Arima Teppei, guy who likes motorcycles and swordfighting. His parents are killed and the he becomes the vengeance, the night, the Batma…wait that’s not how it went! There is Alfred the butler though and a lot ofother things that are so much like the life of Bruce Wayne if he would be the main character of harem anime of course. \\n\\n\r\nSo parents are killed and the the rich grandfather takes Arima to live with him and he is going to be future owner of his grandfather’s large company. On the way he saves the nice pair of boo… cough… I meant the princess Charlotte Hazelrink from a group of random bad guys who hate rich people. Later he meets more girls to fill his harem and eventually bad guys return, turning this school comedy to attempt of action genre... or maybe attempt is too kind word for that mess. \\n\\n\r\nStory: 1 Pathetic\\n\r\nStory is honestly absolute crap and attempt to go into some sort of action genre was honestly laughable. It must work better in the game, but bad guys, terrorists and secret nuclear facilities in ecchi-anime right after the cliché episode with hot springs? Haha it was so absurd turn it sure made me laugh a lot though. When action starts main character has a character shield so strong that he doesn’t need to fear any guns. Bad guys also make stormtroopers in Star Wars to look like sharpshooters.\\n\r\nSure fanservice was expected, but many times it ruined even the most serious attempts to tell a serious story. Even during supposedly serious conversations there were pantyshots. Fan-service was overall good though, so if it’s the boobs and panties you want- this may be the anime for you. If you want action or story that makes sense you are in wrong place- excitement is zero and stuff happens, but most of it makes no sense or is so unbelievable stupid you can only laugh. \\n\\n\r\nArt: 5 Mediocre\\n\r\nThis anime would have looked pretty good really, if the art would be consistent, but quality goes up and down. Faces, even boobs are often drawn wrong and animation looks weird at times. Some of animation is pretty creative like uncommon angles (not always just for panties), but inconsistencies in style are too big to go unnoticed.\\n\\n\r\nSound: 6 Fair\\n\r\nNot much to say. Most characters are rather stereotypic and speak with stereotypic voices. VA:s are actually very good  in this one. Music is allright, especially OP almost sang along few times. Ending has boobs shown so I don’t remember the music :P nuff said….\\n\\n\r\nCharacter: 4 Decent\\n\r\nTeppei Arima, lucky guy for sure, has his own harem, own company and he can walk into a crossfire without getting hit, because reasons… As character he is rather generic boring protagonist, that has these superhero-like tendencies without it being cool. He also eventually shares his blatant life philosophy  ”humans are humans, there are good people and bad people”- that’s… deep. \\n\\n\r\nCharlotte Hazelrink, Princess of Hazelrink, fictitious country in the Europe (yet she pronounces her own name in the most japanese manner possible Charurotte Hazurorinku which sounds very funny). She is damsel in distress with huge…. abilities to get captured. Old fashioned heroine that constantly needs Arima’s help. She is cute though, but her uselessness is unbelievable most of the time. \\n\\n\r\nSylvia Van Hossen, Imagine the Saber from Fate Stay Night, change eyes to blue and it’s her in another anime, such a rip-off design. She is honestly boring as character, but not useless. She is OP swordsman who helps Arima, she is also his fiancée. \\n\\n\r\nSeika Houjouin, Tsundere because… that was needed I guess…. she is fashion designer and leader of the rival company to Arima’s group and leader of the social club in school Teppei is transferred.\\n\\n\r\nYuu Fujikura, That's the maid. Almost forgot there was one. \\n\\n\r\nIsshin Arima, owner of the wealthy Arima corporation and Teppei’s grandfather. Rich but wise old man, not much to say about him.\\n\r\nBecause bad guys are needed in harem animes, there is also that one evil fellow. He is just bad… and rather stupid bad guy to be honest, with a very poor backstory as well. \\n\\n\r\nThen there are all sort of side characters from hyperactive guy from the class to Seika’s girl posse and two funny terrorists.\\n\\n\r\nEnjoyment: 7 Good\\n\r\nIt’s trash, but trash is fun to watch at times. Fan-service and absurdly bad plot developments kept me entertained.\\n\\n\r\nOverall: 5 Mediocre\\n\r\nStory was too bad for a serious anime, yet too complicated for harem ecchi show. Absurd is the best word for the story I think. It goes way too far and does it so poorly you just cannot believe it. Fan service was top-notch in this one though, but art was often inconsistent. \\n",
            "date": "2018-07-17T12:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 284179,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Herr_Meister",
                "username": "Herr_Meister"
            },
            "url": "https://myanimelist.net/reviews.php?id=284179"
        },
        {
            "content": "I'll attempt to make this spoiler-free.\r\nThis is not a ground-breaking anime.  Despite some of the other reviews I've seen here.  It actually IS kind of a generic harem anime.  This isn't saying that's a bad thing (a few of my favorite anime can fall into the \"generic harem\" trope).  \r\nFor me the truly important part is the enjoyment factor.  Which there was plenty of... but then there was also the head scratching \"WTF is happening here\" factor that damaged my enjoyment of the show.  This is exemplified by the apparent confusion over what time period this show took placein.  There's Jet airliners and satellite surveillance (1980s or later).  But nations' militaries still use horse cavalry (1930s or earlier) and horse-drawn artillery.  I don't know if I should chalk this up to the writing team's assumption that Russia must be half a century inferior or what.  But such unrealistic mixing of era's kind of removed a lot of the enjoyment from the later half of the show.\\n\\n\r\nOh yeah, and whether it is the art team or the story team I don't know.  But there are some serious continuity issues.",
            "date": "2018-01-19T13:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 269046,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3648499.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Stangryn",
                "username": "Stangryn"
            },
            "url": "https://myanimelist.net/reviews.php?id=269046"
        },
        {
            "content": "Money is a fickle thing, the richer your are, it's expected you will be better off but is that always true?.\r\nPrincess Lover! as an ecchi harem anime, there was actually alot of potential this anime had and by all means it succeeded in some, in others...well lets start with the characters shall we?\r\nCharacter-wise, we have our typical harem cast archetypes with a semi-interesting main male protagonist. Shirou- Teppei Arima voiced by Takuma Terashima is our typical \"wanting to protect and care for his harem\" type with a tragic backstory added to him. The tragic backstory of his parents dying leaving him to his grandfather actuallykickstarts the anime but that isn't really his bright spot for the Teppei as a character, it's more or less what happens when a normal teenager is now brought to a place of wealth (it might sound off but LA will get to this later). Sakur- Yuu Fujikura voiced by Yuki Matsuoka becomes Teppei's personal maid and is the typical nice girl who minds Teppei, she is LA's favourite character in this anime, no not only because LA has a thing for maids, but also because her typical nice girl and the minder to Teppei is a nice combination of NOT getting her annoying and helping Teppei's cause at the same time. Ride- Charlotte Hazelrink voiced by Ryouka Yuzuki is our resident genki girl and ALWAYS happy in any situation and she is our MAIN focus of this entire anime, why does LA say this?, well she's the first girl Teppei meets, she has the most screentime even outside of her main plotline and the anime itself is gunning for Charlotte and Teppei to be together as this relationship also gets the most screentime...LA didn't like this turn of events, she wasn't an absolute detriment to the anime as her plotline leads to one of the grander themes to Princess Lover!, but LA wished some of the other harem members could get if any screentime. Rin- Seika Houjouin voiced by Emiri Katou is your resident tsundere and strict \"club president\" type character and she gets a small arc to herself that ties into her and Teppei grandfather's family issues and LA didn't mind it but like any harem member with a small arc and gets added to the harem, she fawns and tsundere's over Teppei. Finally we have Sab- Sylvia van Hossen voiced by Megumi Toyoguchi the character with the most wasted potential within this harem and quite honestly the LEAST amount of screentime in LA's eyes. Why?, well Sylvia becomes Teppei's fiancee through Teppei's grandfather Isshin Arima. This is interesting as we could see how Teppei would have felt being forced to marry Sylvia and then later on Sylvia and Teppei might fall in love naturally and break the social structure OR Sylvia and Teppei liking each other but rebelling at their forced marriage just something like that but again...due to Charlotte being the main focus, this was just wasted potential from LA. LA still preferred Yuu as favourite, but Sylvia was probably the most interesting character in the harem. Also if LA's hinting isn't obvious enough, kinda a coincidence that the harem members were carbon copied from Fate stay night right?\\n\\n\r\nFor minor characters, it's expected that most of them supporting characters for a harem anime, but LA would note that the majority of the minor cast do have some semblance of screentime whether it be Haruhiko Nezu voiced by Minoru Shiriashi the butt monkey of the cast, Ayano Kaneko and Erika Takezono voiced by Nozomi Sasaki and Kaoru Mizuhara being Seika's posse members and Alfred voiced by Yousuke Akimoto, the extremely clingy butler of Charlotte. \\n\\n\r\nPrincess Lover!'s plot progression is albeit quick even for a 12 episode anime, consisting of 3 \"arcs\" in a ways, the Introduction arc focusing on what's going on and introducing the majority of the characters along with Teppei's situation of finding his parent's killers, Seika's arc along with the Hot Springs Meta Episode (Don't ask) then Charlotte's arc that gets serious. Now how the mood is placed, LA thought this anime would get extremely moodswinging due to how it gets \"serious\" and \"comes out of nowhere\" or stupid comedically ecchi moments appear but LA by the end didn't really see this, the anime was always goofy and ecchi as hell even when it's serious, minor characters and especially Charlotte backs up it's goofiness even in the most serious at times (also see the two dorky \"terrorists\", Nezu and gratitous amounts of fanservice). Like harems that are comedic ecchifest animes doesn't ALWAYS need to be like this, look at The World God Only Knows: Goddesses arc and hell Highschool DxD did this!, a harem isn't just limited to it's premise.\\n\\n\r\nIf there was anything LA could actually be annoyed by the plot is Sylvia's screentime taken away by Charlotte instead and adds to the missed potential Sylvia as a character would of had. Although it wasn't from the first episode, but it becomes quite noticeable almost blaring out like an S.O.S signal that this won't be a balanced harem and the Hot Springs Pact disguising as if it would was a lame attempt in thinking that no one other than Charlotte would win this harem.\\n\\n\r\nSo about Teppei's situation of being brought into a world of wealth through his grandfather is actually an interesting theme to this anime, as the majority of the harem and characters are aristocrats or of royalty or wealthy businesswomans, seeing Teppei being the average guy and STILL being one by the end of it is actually quite interesting as he is unaffected by money or power and this fuels his want to protect people due to his parents dying. This dynamic actually works pretty well and even Charlotte's arc main villain is essentially a polar opposite character to Teppei only this time the villain took the wrong path and doesn't care about anyone but himself and his ambitions. Princess Lover! underlying theme tucked under the forced panty shots and harem antics does shows us that even if your rich, you can quite easily have even newer problems as well as the fact that you might self destruct yourself if your not careful with your money. Cheesy enough as it sounds, this notion is kinda manifested in Teppei of that having power and money isn't everything.\\n\\n\r\nOn speaking of fanservice.......HELLLLLLLLLLLO uncensored glory, yup the anime is completely uncensored and although the forced panty shots and jiggle physics is strong in this one, the fanservice is pretty plentiful albeit forced typical for an ecchi harem anime.\\n\\n\r\nThe animation done by GoHands has GoHands'...hands all over it. From the typical shining effect to the decent enough backgrounds that could make JJ Abrams blush. The character designs are pretty polished and exotic, this is kinda obvious to the wealthy characters, special mention probably goes to Sylvia's normal outfit. The fights that happen in this anime is sparse but ok enough, though the fencing and swordplay are decent to look at. Overall, yes LA thought the animation was typical of GoHands and decent to look at.\\n\\n\r\nThe voice acting.....well NORIO WAKAMOTO as Isshin Arima, man LA heard him in quite a while. Yuki Matsuoka, Megumi Toyoguchiand Ryouka Yuzuki were pretty good however LA's surprising voice actor would go to Emiri Katou as Seika, mainly because Emiri is typecasted as the genki of the harem members, here?...she's the strict tsundere character?...yeah LA wasn't expecting it and she does it pretty well.\\n\\n\r\nLA also thought that because of it's themes being taken full circle along with Teppei's resolution taken place during the finale, LA thought the ending was done pretty well for Teppei and this anime's themes quite well. Not so much with how the harem ending...ends with a harem ending with Teppei still not choosing even though it's goddamn obvious that he's gonna be with Charlotte.\\n\\n\r\nSo Princess Lover! kinda got LA torn over many elements to it by the end of it. LA liked it's grander themes of being rich not always being ideal and safe, Princess Lover! knowing itself and it's limitations and wanting to be different if it could and tried, the decent ending, the animation and voice acting being decent, however with Sylvia's and Yuu's lesser screentime due to Charlotte highjacking the plot and forced panty shots and fanservice and finally having that  harem ending. Princess Lover! isn't that bad, yes it has it's problems and sometimes those problems are due to LA's own bias due to best girl and all but LA just can't hate it but it's not great either.",
            "date": "2017-08-29T04:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 256462,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=256462"
        },
        {
            "content": "I had no clue what I would be going for when I stepped into this anime. It took off with a strong start with our main, Teppei losing his parents in an accedent. He soon saves a very beautiful girl from being chased by a band of thugs.\r\n+1 Harem - Princess\r\n Then being the heir to his grand father's giant company which means...\r\n+1 Harem - Maid\r\nAttending a dinner party where he meets his arranged fiance\r\n+1 Harem - Strong Blonde\r\nAnd going to school\r\n+1 Harem - Fashion designer and the smallest breast size (I think it's a B)\r\nAnyhoo!\r\nThe ecchi is great, although it does suffer from abig of the breasts being a bit too big. The uncensored DVD versions are a gift from god. The art is just beautiful, I love the way they drew the faces. Even our male main looks a bit 'pretty' a times.\\n\\n\r\nThe comedy is great and besides from Negi (annoying sidekick friend) i didn't see a need to have any more of Teppei's school friends in the mix. The plot is stable enough to carry the series till the end and I'm satisfied with the final results.\\n\\n\r\nThe soundtrack is as pretty as the art. I love the ending theme to this S.S.D! by Yokuza.\\n\\n\r\ntl;dr? : Well it's a nice ecchi/harem. Not much romance though. 12 episodes are worth checking out try to put the uncensored version at top priority.\\n",
            "date": "2010-05-19T08:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 26200,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/301688.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Plagus777",
                "username": "Plagus777"
            },
            "url": "https://myanimelist.net/reviews.php?id=26200"
        },
        {
            "content": "Well based on what has come out so far, this anime is promising. For example, the animation quality and the uniqueness to the characters situation makes for an interesting start to the show. But in all reality the show is pretty funny as well, but i believe that to be the case with most harem style animes anyway, its certainly a show to look forward to.",
            "date": "2009-07-16T10:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 16842,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/185293.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZeroQuanta",
                "username": "ZeroQuanta"
            },
            "url": "https://myanimelist.net/reviews.php?id=16842"
        },
        {
            "content": "Princess Lover from the get-go looks like your average harem, with the regular guy who gets lucky with all the girls. There's no exception here. This was a pretty bland ride throughout the entire anime, and mediocre at best.\r\nStory: 5\r\nThe story here is nothing original. You have your male protagonist, Teppei, who seems to be your average high school student. Soon after, though, you find out he's someone who's rich. Not to spoil anything, but from here on out the story doesn't even matter. It's a continuous nonstop ride of events that don't connect very well together, and the creators trying to make sense ofit all. The way the anime ends was very anticlimactic as well. \\n\\n\r\nArt: 9\\n\r\nIf there was a very good pro about this anime, it's that the art is very good looking. There were very few bad frames of animation here and there, but all can be forgiven when the characters and the background all look superb. \\n\\n\r\nSound: 8\\n\r\nThe sound was pretty good too. The music was upbeat and easy on the ears, but I found some of the seiyuus to be very annoying to listen to, especially Charlotte. For some reason, that voice was just frustrating to hear in the tone she uses. But Yuu's soft soothing voice made up for that one.\\n\\n\r\nCharacter: 4\\n\r\nThis is where I felt the anime fell apart for me. Teppei's character was absolutely flat in my opinion. When tragedy befalls his family in the beginning, he doesn't even seem to give a squat about it. You don't feel any sympathy for him as his personality just seems to be as blank as a piece of paper. Sometimes, I felt like yelling at some of the characters at how bland they were. I also saw how even though it was a harem, the story seemed to focus much more on the random events that happen chronologically then the characters themselves. We start out with five or so female leads and in the end learn that they weren't the focus of anything that happens. The characters just seemed lacking personality.\\n\\n\r\nEnjoyment: 5\\n\r\nAt best, Princess Lover! was an anime that didn't go anywhere, and after you finish, you'll most likely forget what happened. It satisfies that harem  which keeps your attention with its fan service here and there. \\n\\n\r\nOverall, I felt that the anime was a waste that could have been something better and something that should be skimmed through. Even if you had the time, I recommend you skip over this.",
            "date": "2010-05-26T22:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 26463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/282223.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Kelun",
                "username": "Kelun"
            },
            "url": "https://myanimelist.net/reviews.php?id=26463"
        },
        {
            "content": "I thought it was too predictable\r\nthe plot was just unoriginal in the harem catagory\r\nI hate harem anime where the guy picks the girl right away I like it where there is a bunch of twist in turns like maybe he likes someone at first and changes his mind later on that would have been a little bit more original like what happened in shuffle\r\nI like the anime at first but after like ep 3 I got tired of it the guy favored the pink haired girl too much to start with and the show rarely showed the other 3 girls that like the main guywith him\\n\\n\r\nIf you want a good harem watch shuffle, toradora( I really like this one it stayed away from echii),Shakugan no shana ( not really a harem but it has a love triangle), for the rest of my recomendation look at my list and look at the 9 and 10s \\n\\n",
            "date": "2011-10-20T18:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 45913,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/479494.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/gonnabe2pro",
                "username": "gonnabe2pro"
            },
            "url": "https://myanimelist.net/reviews.php?id=45913"
        },
        {
            "content": "Princess Lover is pretty well known between people that are into harem genre.  I've read many stuff about it being different from other harems, but Princess Lover is indeed just another harem.  However there was something different about Princess Lover compared to many harems/ ecchi that we have today that encouraged me to write a review.\r\nStory:\r\nTo go straight off to my point about the difference between Princess Lover and other harems is that it had a story.  Something I really want to focus on is the protagonist, Arima Teppei.  Arima Teppei and his grandfather were probably the ones that snatched allthe meaningful quotes in the entire anime.  The anime studios has become so corrupt, the\"typical\" harems today have become, \"the girls have big boobs, but the story is crap, but girls have big boobs.\".  Indeed I am nuts for 2D girls like many of us here, but I really disagree with such nonsense.  In a harem field, having unique and attractive girls should be a given.   There are just never ending list of girls that can be in a harem field and I have seen that much of it.  Harems are no longer about how attractive the girls are, but what will make it different from other harems are the protagonist.  There can just be so many fan-services in harems, but if the main character sits, so does the story.\\n\r\nNow, Princess Lover didn't have such amazing story, but the fact is, it did have one.  The author was writing with a purpose and he did have a message that he wanted to share with the audience.  The one that will fulfill this will be done by Teppei.  I think it is about time harem animes change their ways a little about having pretty dominant and stable protagonist, because he still is the main focus and the story moves on based off of him.  Not only that, but he is representing the author's ultimate message.  What are harem authors doing these days?  \\n\r\nIt did lack motions in action scenes, so I wouldn't say it was super actiony, but it did have action moments and it's thrills.  Starting from the first episode, like all the other action movies and animes, it would constantly jump to here and there with such inconstant events.  While continuing with the story, they definitely don't miss out with the fan-services and the comedies.  and ofc the jiggly boobies for all the ecchi fans.\\n\\n\r\nart:\\n\r\nThe art of Princess Lover was probably the best part of the anime.  But it is something a studio can't miss out when producing a ecchi anime.  The character designs for all the girls and even the adults suit them very well.  It took me a while to realize, I was kind of disgusted with Teppei's character design.  It wasn't all that bad tho.\\n\\n\r\nsound:\\n\r\nI really don't even remember sounds in this anime.   I rushed through it, skipped all openings and endings, and barely bothered to listen to the music.  The only music that caught my attention was in the very last episode, which really was out of place...  In the very last scene... YEA. you all know what the hell i'm talking about.  They just couldn't find a suitable music for the last epic scene.  It totally killed Teppei's awesome speech for that blonde guy, whatever his name was.\\n\\n\r\ncharacter:\\n\r\nThe girls of this anime were just like every other harem anime girls.  nothing special.  Just a maid, and 3 rich girls.  Although I don't mind the girls being typical harem girls, Teppei was best.  The speeches he gave during the most dramatic moments for the girls was very encouraging and acceptable.  Many other harem animes disappoint me when the protagonist gives crappy speech as if it was something so great...  Even if it was great, the character would drop back to zero as if his life lesson just went past, and became history.  Teppei didn't lose nor forget the things he learned throughout the story, and he even said some great stuff in the last scene.  ahh words are good stufff. :')\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed the anime.  cause i like harem, and tsundere services, with princesses and maid girls :)  and bouncing boobs.  anything more?  oh and it did have great settings and some of the episodes felt like mission impossible or something.  Some serious action stuff in this anime.  I was pretty surprised.\\n\\n\r\nYea.. I'm getting lazy with the review, and i basically said what i wanted to say.  It was one of the good harems I've watched, but the problem probably laid on how it was directed.  I don't fault the seiyuus but the anime wasn't all the professional overall.  \\n\r\nHarems don't always have to be 1 guy + 20million girls with no story.  but I'll cope with it and wait until the day, someone comes to realization of the failures in the harems being produced today.  I await the day for this someone.",
            "date": "2012-01-07T01:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 51159,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/488321.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KyaOtakuSama",
                "username": "KyaOtakuSama"
            },
            "url": "https://myanimelist.net/reviews.php?id=51159"
        },
        {
            "content": "A lot of times I've said that Harem anime is a plague on humanity. And high school anime can work but have recently been kinda shit. But nothing can describe the kind of hatred I feel towards the mixing of high school and harems. So what happens when I watched this high school harem! Belong to the genre that needs to go brutally anal rape itself to death!... It was good... I cannot even begin to comprehend how this anime could possible have been in any way, shape, or form decent! There's something fundamentally wrong with that picture. Well lets get to it. \r\nStory 6/10:Okay, the story is only slightly above average. It starts out kind of following the harem formula of coming up with an extremely half-assed reason for having the main lego brick personality protagonist end up surrounded by chicks. In this the lego bricks parents die and he goes to live with his grandpa who just so happens to be extremely rich and our lego brick had no idea. But... Wait?... The plot, starts to make sense after a while in and somewhat diverges into a far more decent political story and story of revenge!... Well to a degree. So yeah the shows plot starts out fairly standard harem but it becomes far better later in. My one problems is *warning, minor spoilers* the main villains motivations for revenge in contrast to what he actually does to get the revenge is kind of, ridiculously over the top. I mean sure some people have embarrassed me as a kid too but you don't see me planning murder, I just slashed their tires later. \\n\\n\r\nArt 5/10: I have nothing bad to say about the art, I also have nothing good to say about it. The art is extremely average and generic. The character all follow the basic anime character template that seems to be so fucking popular (people, when will you learn? Anime means it was made in Japan, it's not a specific art style, you're allowed to make the basic design to make your show look unique!), the backgrounds are nothing special what so ever, and the animation with both just regular walking and fighting is about the same as you'll see almost everywhere else unless you watch something like Akira or Jin-Roh (then again, those were the pinnacle of animation smoothness in anime in my opinion, so it's unfair to compare them)\\n\\n\r\nSound 5/10: Once again a very average part of the show. All the music is exactly what you'd expect from a harem anime and there are no memorable tracks, nor any that stand out. This is another thing anime studio's need to realize, music is supposed to fit with the scene at hand in a way that perfectly accents the scene and be easily listened to and appreciated by the audience without drawing attention away from the show. If your audience says \"wait, there was music going on in that scene? Oh yeah that really background generic stuff, right\" you're not leaving a good impression. And my rule about not reviewing voice acting in languages I don't understand still stands so no dub = no voice acting review. \\n\\n\r\nCharacter 8/10: Fantastic! I now get review the extremely bland and personality-less harem male lead #24601 (\"What? No not you Valjean, some other guy\") so allow me to rip this sexual oblivious dumb fuck a new assho- Wait a second, the male lead is actually good! Holy shit guys! The internet is about to break, everyone evacuate! ABANDON THREAD!!!!!!... \\n\\n\r\nIs it safe to come back... It looks kind... Yeah, we're good. So anyway, the lead character is actually pretty decent. He's pretty competent, doesn't over-react whenever he accidentally touches breasts, and he's not a complete dumb fuck who's completely oblivious to the fact that women have vagina's. But he's still flawed enough to not be at the hateable level of Mary Sue, he's more on the level of \"the lucky pervert!\" (honestly, episode 6 will make you shit yourself laugh)  As for the females, you have the basic trends of the Mary Sue main (and she's really Mary Sue level, god I hate this archetype), the tsundere, the... Supporting Mary Sue (okay, one was bad enough but this is ridiculous). But one of our other female leads makes up for this, Silvia, who doesn't follow a certain archetype and for a female in a harem anime is actually quite competent on her own. \\n\\n\r\nEnjoyment 7/10: Okay, I liked watch Princess Lover, I will admit to actually having enjoyed a... A... *mumble*... A HIGH SCHOOL HAREM!!!! The show, despite the average art and sound and only slightly above average story is actually quite entertaining. Every episode is generally packed with plenty of fun to watch antics or suspense (I say this is thanks to the 12 episode length that keeps the show nice and compact, keep this in mind anime industry, longer is not necessarily better. Yes, I'm looking at you 300+ episode shows)\\n\\n\r\nOverall 7/10: So yes, it's a high school harem, and it's actually fairly decent. I don't know how they managed to pull it off but Princess Lover is actually quite a good show and I'd recommend it if you're looking for something short. One thing people often complain about though is the romantically inconclusive ending however I myself didn't really mind this too much. But if you don't like shows where the romance aspect isn't resolved at the end you should be wary of this show.",
            "date": "2013-01-10T23:01:00+00:00",
            "helpful_count": 2,
            "mal_id": 83337,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1263085.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mdude009",
                "username": "mdude009"
            },
            "url": "https://myanimelist.net/reviews.php?id=83337"
        },
        {
            "content": "Story - 6\r\nI liked the idea of this show, similar shows are already done, but in a way it was somewhat refreshing. I wanted to give the story at least 7, but when they made it serious in the second half, the story failed completely. It simply didn't fit this kind of show.\r\nArt - 9\r\nI really loved the art of this show, the character designs were done just right. I've got nothing much to say here, except that this is my kind of animation style.\r\nSound - 8\r\nThe OP & ED was fairly good, I've got nothing much to say on that. The voice actors dida great job, and in my opinion the voices matched the characters well.\\n\\n\r\nCharacters - 8\\n\r\nI loved all the characters in this show, though I'm not very hard to satisfy on that part. Because this is a harem anime, I didn't see much character development throughout the show, however I didn't except that either. And I haven't watched many harem shows has done this right.\\n\\n\r\nEnjoyment - 8\\n\r\nThe show was rather entertaining and I did really enjoy it. As mentioned in the last half of the show the story was rather mediocre, but I didn't let that get to me and enjoyed the show for what it was good for.\\n\\n\r\nOverall - 7\\n\r\nI do enjoy a good harem show and Princess Lover! does most things right. When I started watching this show I though everything was set for a great harem anime. Then again the plot for the last half ruined it a little, don't misunderstand me on this one, in another show it would probably have worked great, but in this show it didn't, simply because it does not fit.\\n\\n\r\nDon't let this discourage you though, if you don't have anything else on your agenda it's a pretty good watch.",
            "date": "2013-05-05T14:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 96073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DontWantThis",
                "username": "DontWantThis"
            },
            "url": "https://myanimelist.net/reviews.php?id=96073"
        },
        {
            "content": "I'll break this review down into parts, as I'm afraid I'd be too subjective and emotional in a free-form.\r\nThere will be SPOILERS, and if you want to enjoy watching all the fresh (hahahah... fresh. Get it? Princess Lover and fresh) plot developments, you'd best skip this review.\r\nStory is 1/10. \r\nIt's just pathetic. There's no character development save for girls turning from tsun to dere, villains are fighting for reasons so vague and petty it's insulting, and MCs so wishy-washy that he can't push the story in any direction.\r\nIt starts as a \"kendo idiot kid of a soba shop owner\". Sacked, bacuse parents het batmanned.Then it turns into \"i'll find whoever did this and kill them\". Once again, sacked, because MCs too shallow to exhibit any real emotion, much less something as intense as enmity.\\n\r\n               Then it finally turns into \"whoop whoop where's all the girls come from, I have only maids in my fucking mansion, and every big boobed girl turns out to be my fiance, and royalty\". bullshit.\\n\r\n      Mind you, all these changed take place in the FIRST episode.\\n\r\n              Somewhere around 7th episode it transforms into \"mario, princess peach has been kidnapped again, go save her with your wooden sword bullet deflecting that you learned god knows where and when\", and i guess it goes into harem ending after that.\\n\\n\r\nGuess, since I just dropped this anime. I wanted to write a proper comment about it, when I watched it all, but It's just so below me I'm having gag reflexes whenever one of the characters thinks it's saying something cool/romantic/relevant.\\n\\n\r\nART  is 7/10.\\n\r\nDespite MCs eyelashes being super distracting, the art really is good. Girls are pretty, there are nipples and pantyshots, all the action scenes are executed in eye-pleasing manner, and generally those fucking eyelashes is the worst thing that has happened to art aspect of this show.\\n\\n\r\nSOUND is 6/10. 6/10 because it was so bland that I didn't notice there was any. Not good by any means, but also not bad enough to make me apprehensive of it.\\n\\n\r\nCHARACTER is... ugh. Ok, let's say 6/10. Visually only.\\n\r\nI already vented my frustration at the plot, and, in extension, at the characters personalities, in the story section.\\n\r\nVisually Characters are done well enough, They are varied, but not offensively ornamented.\\n\r\nFor example, princess is dignified and naive, and drives in a horse carriage from time to time, but she doesn't wear a tiara and cape with ermine fur finish, nor is she constantly accompanied with some annoying SPs or the like.\\n\r\nI'll let your imagination run wild about their characters.\\n\\n\r\nENJOYMENT is 3/10\\n\r\nIt's like watching a bad fashion show. Everything is eye-catching but you're dying from boredom with breaks at wanting to strangle the announcer to death for being so fucking irritating.\\n\\n\\n\r\nAll in all, I'd love to say this anime is bottom of the barrel. It's not, sadly. There's heaps of anime much worse than this, especially in Ecchi genre. Thus, although for me personally this anime is just nicely animated trash, generally speaking it's in the upper mediocre tier of ecchi anime.",
            "date": "2017-06-27T02:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 251191,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1472429.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/XanWasting",
                "username": "XanWasting"
            },
            "url": "https://myanimelist.net/reviews.php?id=251191"
        },
        {
            "content": "When I first started watching this Anime after the first 10 minutes I got a feeling of some kind of dread.  It seems as throughout the anime there is an underlying sense of darkness about it, even though it seems to be bright and happy.  With few sad moments thrown in it actually doesn't dwell on it and seems to make it more emotional.  Even after Completing it the feeling of dread of what could happen never left, it felt like it was coming and even at the climax it still lingered.  I also found two of my favorite characters whichare very minor characters in this anime.\\n\\n\r\nWith this I found this to be a well made Harem and recommend those who want to watch a simple plot based anime.  With just enough sadness, silliness, and angst to not overwhelm, and not over simplify.",
            "date": "2012-05-05T23:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 60627,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1266979.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/animelover1491",
                "username": "animelover1491"
            },
            "url": "https://myanimelist.net/reviews.php?id=60627"
        },
        {
            "content": "This is your typical harem anime. It involves a story about a young boy who happens to run into a great sum of money through an inheritance. Over all the main character is a kind and fair guy who attracts 4 girls. They never end up telling who he will end up with at least in the 12 episodes I have seen but you can really assume who he will end up picking from the first or second episode. This becomes extremely obvious in the last 4 episodes. Even though this anime was quite predictable there was a good story line and involved political andeconomic problems that come with being extremely rich. Over all I had to take a few breaks between the episodes due to the fact that I would get slightly bored but as soon as this series started to pick up in the last few episodes I couldn't turn my eyes away.",
            "date": "2012-04-22T10:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 59421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/13grica",
                "username": "13grica"
            },
            "url": "https://myanimelist.net/reviews.php?id=59421"
        },
        {
            "content": "Princess Lover! ....\r\nI finished seeing this anime yesterday.\r\nWhen I started watching this anime I did have any great expectation. I thought that this would be 'just another' harem anime with lots of ecchi.\r\nBut somewhere along the 2nd and 3rd episode the things started to turnaround.\r\nGood thing about this anime is that the characters in this anime have got some level of depth in them. \r\nI watched the uncensored version as usual 8-).\r\nAs far as the eccchi content is concerned, it is very less in this anime.\r\nThe Story:\r\n------------\r\nI don't want to tell you the whole story (I don't like spoilers).\r\nBut it shows the glimpse of therich people's life.\\n\r\nStuff's like,\\n\r\n-> It doesn't matter what you social status is, people all over sacrifice something for something else.\\n\r\n->You have to make decisions at every point in your life and these decisions are the ones that makes your life.\\n\r\nAnd ETC  are shown in a nice way in this anime.\\n\\n\r\nIf you the semi-serious kind of person (like me) this anime does make you think about all this.\\n\\n\r\nThe Art/Sound:\\n\r\n-------------------\\n\r\nThe art is really good, so is the sound.\\n\\n\\n\r\nI would say it is a Good Anime and is worth watching at-least once.\\n\r\n(This is how I perceived this anime. We all have different view point and we all see things differently. This is my point of view.) :)\\n\\n",
            "date": "2012-03-27T00:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 57099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1206169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rockstar_21",
                "username": "rockstar_21"
            },
            "url": "https://myanimelist.net/reviews.php?id=57099"
        },
        {
            "content": "Ok currently I’ve only seen 5 episodes so far and I’m writing this review based on those and to be honest I was expecting more from this anime! Ok first, the plot was not bad actually, it was pretty decent, I mean come on imagine yourself finding out your that your rich all of a sudden, having over 100 maids working for you, living in a fancy house, wearin fancy cloth and going to high class fancy school and not to mention being surrounded by beautiful attractive Big gigantic boobs women, sounds awesome right? yeah but after watching it till episodes 2-4, i found itquite boring those dialogs and i don't think i'll keep watching it till the end. It’s just my opinion after all but you might find it interesting.",
            "date": "2009-08-18T04:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 17864,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ovich",
                "username": "Ovich"
            },
            "url": "https://myanimelist.net/reviews.php?id=17864"
        },
        {
            "content": "Coming into Princess Lover!, I only expected generic SoL bullshit. While I did get some of that, the anime surprised me by making shit actually happen. \r\nSpoilers below:\r\nThe story itself is a bit overdone, with the main character's parents dying and him coming to be crazy rich because he was adopted by his grandpa all in the first episode. From there, the show takes a nice little slice of life detour for a couple episodes, which develops the relationships between most of the girls and Teppei, and between each other. Then, ABDUCTION, BOMBS, GUNS, CONTROVERSY. With our little female lead being captured, Teppei and therest of his girls rush in to save her and his grandpa. Of course, only after succeeding will she be taken again. Hartmann's rags to riches story is touching, but he ruins himself. In the end, the story concludes just as you think it would, happily. The only bad part is that no one gets picked (though it's somewhat obvious Charlotte is his #1).\\n\\n\r\nSpoilers end here.\\n\\n\r\nAs for the characters, this show sports THE HOTTEST HAREM CAST IN ANIME. Not one girl in the harem is ugly. All of them have bangin bodies, trust me. While the main girl, Charlotte Hazelrink, leaves a lot to be desired in intelligence, she does show signs of maturity at times (not only in her ass and tits). So she becomes a tolerable lead who is nice to look at. The real star of this show is his #2, Sylvia van Hossen. Now, we all love badass chicks, especially when they're as hot as Sylvi. A strong swordswoman, a fun personality, and a hot body makes her shine brighter than the rest. Unfortunately best girl takes a backseat to Charlotte in the show. That's ok, it's what the OVA is for, hue. Yuu, the maid, is also a somewhat surprising character. She is the first maid girl in anime I've seen that isn't an annoying cockblocking fucker. She also is very attractive and a sweet girl. Seika has the slimmest body of the harem, but she is still very hot. She is our tsundere of the show, but a mild one. Very tolerable. She is actually underrated. Overall, all the characters take strides away from their designated archetypes, which is why in my opinion, this is one of the best harems in anime.\\n\\n\r\nArt/Animation is excellent in this show. The girls just look great, obviously. The action scenes are fluid and nice to look at. You wouldn't think this show was made in 2009.\\n\\n\r\nSoundtrack is good, but doesn't stand out that much. It does it's job as the background stuff when you need it. The OP and ED are OK.\\n\\n\r\nIn the end, Princess Lover! is a solid watch, and I would recommend all of you see it.\\n\r\n7/10\\n\r\nBest Girl: Sylvia van Hossen",
            "date": "2014-07-09T10:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 151223,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2794375.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/zdude18",
                "username": "zdude18"
            },
            "url": "https://myanimelist.net/reviews.php?id=151223"
        }
    ],
    [
        {
            "content": "I almost dropped this anime series after the \"hot-spring\" episode . Mainly becuz i dont like the way the MC r so being O.K with other guys lookin at his gurls, heck he even invited em 2 do it..... What kind of protagonist is dat ??? still pissed me off :(.\r\nS\r\nStory: 4\r\nJuzt a typical harem anime, even tho im INLOVE with harem, & im perfectly fine with this cliches story but man.... after i found out there is a Hentai version of this.... its pretty over 4 me :(.\r\nArt: 8\r\n1 of the best artstyle i ever seen, juzt 2 bad dat the others r prettymuch trashes.\\n\\n\r\nSound: 7\\n\r\nDecent at best.\\n\\n\r\nCharacters: 3 at start, character development is pretty good but the progress of it is juzt a completely garbage... \\n\\n\r\nEnjoyment: 3, like i said after the \"Hotspring party\" episode im pretty much almost rage quit. I dont mind if the protagonist is a phuckin Hentai, as long as he value his gurls & not sharing 2 other guys like its sum toys... then im perfectly fine.\\n\\n\r\nOverall: 4 - and its should bad, not decent.",
            "date": "2015-01-25T16:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 178972,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4405621.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/DariusParadox",
                "username": "DariusParadox"
            },
            "url": "https://myanimelist.net/reviews.php?id=178972"
        },
        {
            "content": "Teppei Arima is a second-year high school student who lost both of his parents in a traffic accident on their way home from a family trip. His grandfather, Isshin Arima, happens to wield the puppet strings in Japan’s vast economy and demands that Teppei becomes his successor as the head of the Arima Group. To prepare for his debut into high society, Teppei enrolls in an elite academy for the scions of the rich and powerful.\r\nIts genres are:\r\ncomdey, ecchi, harem, romance, shonen.\r\nThere are some cliche moments their but good. I find it entertaining but not the ending. I really didn't like it though...",
            "date": "2009-10-12T00:47:00+00:00",
            "helpful_count": 0,
            "mal_id": 19598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/239389.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kibis54",
                "username": "kibis54"
            },
            "url": "https://myanimelist.net/reviews.php?id=19598"
        },
        {
            "content": "I was skeptical about watching this at first. After sucking it up and watching the few couple episodes, I realized that this anime is unique to its kind. You have the typical harem romance with that hint of comedy, but you also have plot twists outside of those relationships involving powerful corporations, governments, those who want to overthrow, and betrayals. \r\nI'm only slightly disappointed that it's only 12 episodes long.",
            "date": "2010-07-31T23:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 29180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/302356.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Anlaemar",
                "username": "Anlaemar"
            },
            "url": "https://myanimelist.net/reviews.php?id=29180"
        },
        {
            "content": "after watching  lots of  romance, harem  type anime , it's started to feel that  most of the story is same and predictable,  so I started to feel bored but PRINCESS  LOVER  is really something different and you'll get definitely new things here or I should say all the good things  ( like main male character  being the main influence  of the story, , cute female characters with different and distinct characteristics and overall not too unreal and boring story)  that a romance harem genre anime should have are here. \r\n^^I hope  you guysat least start with the first episode because I can promise that from the first moment you guys can feel that it's something different and enjoyable *****~",
            "date": "2014-04-15T02:17:00+00:00",
            "helpful_count": 0,
            "mal_id": 139997,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3668867.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ANI3792",
                "username": "ANI3792"
            },
            "url": "https://myanimelist.net/reviews.php?id=139997"
        },
        {
            "content": "This anime is mainly comedy, that's my opinion. I did expect a lot more romance in it, and I can't deny the fact that I was disappointed. However, now after seeing all the episodes, I can only admit that it is not actually needed any more romance. It is a very well-done anime with good art and a good storyline. I can not deny that I've seen better animes than this, but it was still better than I expected.\r\nIt was a little too much with all the engagements and fiancées that appeared a bit all the time, and the very reason why there was chaosin the companies was a bit blurry. I was and still am a bit confused after seeing the end, because it never came up who he would marry in the end, or if he was still engaged to Sylvie. Because all of the girls were in love with him, I couldn't guess either so that's something that's been on my mind ever since. I hope there will be an OVA or special episode after this.",
            "date": "2010-12-22T07:10:00+00:00",
            "helpful_count": 0,
            "mal_id": 32961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/418554.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dinora",
                "username": "Dinora"
            },
            "url": "https://myanimelist.net/reviews.php?id=32961"
        }
    ]
]