[
    [
        {
            "content": "I personally think that the second season is better than the first one. Many things were improved and I got addicted to the show. So:\r\nSTORY: 8/10\r\nThe simplicity remains, same for the cuteness, the comedy, the slice of life feeling and the sweet romance. What differs in this season is the events, which are more interesting and intriguing. There is a hint of amusing action now as well. Everything about the plot was really great IMO.\r\nART: 9-9.5/10\r\nNothing changed from the previous season, everything and everyone is a pure beauty still.\r\nSOUND: 8/10\r\nNothing really changed here as well, the score remains really good and a perfect fit forthe anime's nature.\\n\\n\r\nCHARACTERS: 10/10\\n\r\nThe great characters remained, and became even better. This time we got an even better characterization for some supporting characters and the main cast shone more through the energetic events they faced and due to having some backstories revealed about them. These backstories actually explained  some things about their current way of living and behaving. Due to that, I was able to love them, because each one got a unique emotional pallet and a trademark, and the result was excellent. \\n\\n\r\nENJOYMENT: 9/10\\n\r\nAll the features that made me enjoy the previous season weren't absent from this one at all. But some extra suspence and the flawless characterization added something more, something more capturing and addictive. I can now say that if there's gonna be a third season (I SO HOPE FOR THAT *-*) I won't treat this show as a way to spend my spare time, because now we have a great basis for a great evolution in a really entertaining story and it has become a must for me. Since the manga is still coming out and since there are still questions to be answered, I can only wait and hope that Studio Bones will announce a third season. \\n\\n\r\nOVERALL: 8.5-9/10\\n\r\nBeautiful, relaxing, light, simple but solid, interesting, funny, intriguing, upcatching and all the other adjectives I used in order to describe the second season but the whole Akagami no Shirayuki-hime franchise as well, make this season, and the whole anime in the end, deserve such a high score and a place in my heart.\\n",
            "date": "2016-05-02T07:35:00+00:00",
            "helpful_count": 75,
            "mal_id": 217698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5244396.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChrisAlex",
                "username": "ChrisAlex"
            },
            "url": "https://myanimelist.net/reviews.php?id=217698"
        },
        {
            "content": "*I watch both seaons*\r\nAs a girl I really enjoy this Shoujo romance anime. It's sweet,innocent, motivating ,love story between a prince(Zen) and a commoner girl(Shirayuki). Zen also has loyal friends who aid him in tough times and have fun. \r\nStory wise is nothing too extraordinary, but is relaxing, the slice of life part is good and funny. I love how the other male characters have good feelings towards Shirayuki, but as a friend or maybe not? \r\nbut I was hoping there will be some quarrel because things is just too good to be true, is a fairytale like story after all.",
            "date": "2016-08-11T10:01:00+00:00",
            "helpful_count": 53,
            "mal_id": 226488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5387486.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Momori66",
                "username": "Momori66"
            },
            "url": "https://myanimelist.net/reviews.php?id=226488"
        },
        {
            "content": "The second season of Akagami no Shirayuki-hime was considerably better than the first. The story is much more stable, although it seems to have compromised some of the characters' morality and stability for that. Although it was pleasant enough to watch, there was still something lacking. I don't think the creators of this anime did a good job combining action and romance, or at least not as well as some other anime.\r\nPersonally, I think the anime became a chore to watch and finish...\r\nOverall, the anime in itself was pretty good, but I believe the first season took away a lot of the enjoyment and potentialthis anime had.",
            "date": "2016-04-16T20:54:00+00:00",
            "helpful_count": 58,
            "mal_id": 216530,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5105506.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/honodesu",
                "username": "honodesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=216530"
        },
        {
            "content": "A new chapter in a story.... that's what a sequel is. That new chapter may improve the story, or it may make it worse. However, there's also the possibility that you may enjoy the sequel as much as the story that came before it; for me, that was the case with Snow White with the Red Hair. I had actually watched the first season (and reviewed it), and I really adored it; since I reviewed the first season, I decided that I would review the second season when it was done airing. That's proving to be a difficult task; I mean, what is there tobe said about this season that I already said about the first season?\\n\\n\r\nIn case you are not familiar with this series, Snow White with the Red Hair follows a girl named Shirayuki, who is an herbalist known for her unusual, apple-colored hair. When the prince of her country of Tanbarun, Raj, tries to make her his concubine, she cuts her red hair and escapes to the neighboring country of Clarines. On the way there, she meets Prince Zen and his two aides, Mitsuhide and Kiki, who help her when she's in a real pinch involving Prince Raj. Upon arrival to the castle in Clarines, Shirayuki aims to become a court herbalist, working diligently toward her goal. Oh, and should I mention the blossoming romance between Shirayuki and Zen?\\n\\n\r\nThe art in this anime is as beautiful as ever; Bones really does a great job in this department. The ending theme, \"Page ~Kimi to Tsuzuru Monogatari\" by eyelis, is also quite a beautiful song, and I honestly liked it more than the ending theme for the first season. As for the opening theme, \"Sono Koe ga Chizu ni Naru\" by Saori Hayami..... well, it can never be better than the opening theme for the first season, but it's still a very nice song! Unlike the first season, which I watched the English dub of, I watched the Japanese version of the second season. I must say, these seiyuus really nailed their roles, especially Saori Hayami as Shirayuki! (Maybe I'm just being a Saori Hayami fangirl when I say that, but still!)\\n\\n\r\nThe story is still kind of easygoing, but there is one arc in particular that may really leave you on the edge of your seats. As for the characters, along with the great character development for the characters already in this anime, there are even more likable characters introduced in this season, especially Raj's younger siblings; they just put a smile on my face! Speaking of Raj, I never thought I'd come to like him, but believe it or not, I did; his character developed into one that was less....selfish, to say the least. The romance between Shirayuki and Zen was as sweet as ever, too, and it never failed to bring a smile to my face in this season.\\n\\n\r\nOverall, season two of Snow White with the Red Hair is as great as season one. If you watched season one of Snow White with the Red Hair and liked it, I recommend for you to watch season two. Now that I've finished the anime, I've either got to read the manga or wait for a third season of this anime about a romance between a girl with hair the color of apples and a prince of the country she arrived in!",
            "date": "2016-03-28T13:19:00+00:00",
            "helpful_count": 24,
            "mal_id": 214571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=214571"
        },
        {
            "content": "Akagami no Shirayukihime or Snow White with the Red Hair in English is a beautiful Romance/Slice of life anime based in a Fantasy setting.\r\nThe second season in my opinion didn't have as much of an impact on me as the first season however has it's beautiful and tear jerking moments, some surpassing season 1.\r\nThe art style is perfect for the anime and the animation quality is top notch. However the story lacks a bit in my opinion as not a whole lot happens in terms of events, but you do learn a lot more about the supporting casts and Shirakyuki herself.\r\nThe anime focuses on Shirayukiand Prince Zen and their struggles due to the difference in their social statuses. There is a wide range of supporting cast whom are all likeable from the female knight Kiki who is the cool headed badass to the loyal Mitsuhide whom worries over Zen 24/7.\\n\\n\r\nMuch to my surprise one of the supporting cast from season 1 becomes an integral part of season 2 and even potentially part of the main cast, he is favourite male in the anime and totally deserves it.\\n\\n\r\nIf you enjoyed season 1 or are looking for a romance anime then this is definitely one to watch!\\n\\n\r\nThis review is simply my own personal opinion so do not take it at complete face value.",
            "date": "2016-04-03T05:21:00+00:00",
            "helpful_count": 17,
            "mal_id": 215335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4755163.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dracosine",
                "username": "Dracosine"
            },
            "url": "https://myanimelist.net/reviews.php?id=215335"
        },
        {
            "content": "I already have reviewed the first season, and the second season definitely improves in many areas. Some may say that some of the characters aren't being consistent and that may be true, but I want to think of it as changing or evolving for sake of the story. The first season felt okay, but there wasn't really much story to it as it just, more or less, about the development of the main characters. This time around, the second season actually have quite the plot and there is a little twist in it too. The progress of second season felt appropriate and actually makes youwant to continue. Right near the end, we come to learn more about some characters which is great because the first season lacks background characters for a few. Second season adds more to the characters while progress with the story for the better. I am satisfied as how the anime ends, but also felt that there can be another season to end it even better. I guess by doing so, there is good chance of risking a good anime towards downfall though, I suppose. But in any case, if this review isn't enough, I'll go a little more depth on the bottom without spoiler as much as possible.\\n\\n\r\nStory: Improved over the first season. There's a real \"bad\" person this time and there will be more action (fighting) which is often a good thing under my book. The progression of the story and plot felt appropriate enough that us viewers won't be irritated and would like to know more. Of course, what interest us is, more or less, subjective. Although, I understand this anime is meant to be shoujo and light-heart to watch, but felt it could have been more realistic like a few characters that impact us dies, like how in Game of Thrones, the writer was not afraid of killing goods guys and important characters. This is the only thing that lacks in the story the most. Because it usually never serious about anything and felt rather fluffy. \\n\\n\r\nArt: Same as the first one. If you have watched the first season, then you should know what I mean.\\n\\n\r\nSound: Same again. Good Opening & Ending.\\n\\n\r\nCharacter: A little bit better. For one thing, I'm glad there's history about Obi and little bit of Kiki. I still would like some history of Haruka, Zen's father and mother and Izana though. So, I was a bit disappointed in that. But otherwise, some new characters shed some light which is pretty cool. On the other hand, for the \"bad\" person, I wish there was a little more to it than just plain \"bad.\" \\n\\n\r\nEnjoyment: It's a fun watch just like the first season. The second season is slightly tense.\\n\\n\r\nOverall: From the start to the middle to the ending, it does what the writer intended to do. It's a show about romance and in a fantasy setting. If you like something like Juliet and Romeo, this would be a good anime to watch.",
            "date": "2017-11-08T20:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 262834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721512.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tsuyuhane",
                "username": "Tsuyuhane"
            },
            "url": "https://myanimelist.net/reviews.php?id=262834"
        },
        {
            "content": "I did not like the second season very much. \r\nIn the second season Shirayuki gets to dress pretty, have tea with her agressor (which, granted, happens to be one of the best characters in this season), get kidnapped, get kidnapped again and cry. There is a whole lot of crying. It's like she isn't even the same character anymore. \r\nOnce I noticed how little agency* this new version of Shirayuki had, I also noticed that there wasn't a single thing that had happened because of her. It's not only that she could be substituted by a pretty red lamp and the story would be thesame, it's that she wasn't important enough in her own series to even merit being the reason plot happens. Things happened because people were trying to do something else and she happened to be there. Motivations for characters were reused. It's just bad storytelling in general.\\n\r\nThe break from slice of life into badly written adventure, for instance, felt like something done just to have Zen going all fairy tale prince. There are no consequences for the main characters: nothing is gained or lost from that action. A secondary character does gets to find himself, but he's the only one impacted by half the season.\\n\\n\r\nThere are, still, a few good things: Raj's and Obi's character archs were great, as was that Mitsuhide episode (though he and Kiki get no character development). \\n\\n\\n\r\n* No biggie, it's just she's the MC. You kinds expect the main character to actually DO THINGS instead of having things done to them. And then cry. While mumbling the name of their lover. ¬¬",
            "date": "2017-07-18T07:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 253136,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/509572.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/saoki",
                "username": "saoki"
            },
            "url": "https://myanimelist.net/reviews.php?id=253136"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nReviewing it weeks after watching.. sort of couldn't get around. So will review as my memory lets me.\r\nAlso this review makes me wonder If I should ever bother adding voice acting general gist as well into reviews..Hmm, not sure if can be bothered. But if anything utterly noticeable regarding VA I hear/see. I will add in Sound section comments regarding it.\r\n✦Story\r\nSo, village girls ends up working at royal family. In sense to prove herself and others. And the anime is about her daily activities as well aboutother character stories. Adding the whole superb romance element makes this Anime absolutely sweet, cute and fun. Cannot say much without spoiling, but I can say that much that things got a bit more dramatic and dangerous this time around. It had quite some moments and in general I felt story had fine progression, development and as well intrigue. I do not remember S1, but apparently I enjoyed this one a lot. So story'wise, cannot complaint.\\n\\n\r\n✦Art & Sound\\n\r\nIt's fitting, simple and pretty. Lot of great scenery. Art is quite good, but nothing too amazing. It's fitting for its style.\\n\\n\r\nAs for sound. There were a lot of noticeable OST and quite satisfying songs. Can't say much else.\\n\\n\r\n✦Character\\n\r\nWell, a lot of characters, lot of interesting stereotypes. Some fun backstories and progression. And Shirayuki is adorable with her man. Point being, I did really enjoy the characters in this series. A lot of them intrigued me and even grew onto them. Some villains also their purpose of being hated.\\n\\n\r\n✦Enjoyment & Overall\\n\r\nLong story short. A very sweet romance Anime with satisfying herbal/rpg theme to it.",
            "date": "2018-04-15T02:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 278123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=278123"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’ve never liked apples.\r\nSure, their outer casing is both shiny and biodegradable. But it’s a literal chore to completely peel the skin off (if one does not have a utensil or does not like the taste). Plus, they hurt my teeth. The acidity has always ruined any chances of me eating anything more after consuming these “toxic” fruits.\r\nAkagami no Shirayuki-hime 2nd Season features an apple of sorts. But, thankfully, it is an apple that is far from toxic.\r\nSTORY\r\nAkagami returns for the continuation to its split-cour. To be expected, Shirayuki, Zen, and many others return aswell for more fairy-tale happenings.\\n\\n\r\nLooking at Akagami’s narrative as a whole reveals an interesting direction. Two-thirds of the season are dedicated to a single, long-lasting conflict. The last one-third is comprised of episodic, slice-of-life events one right after another.\\n\\n\r\nThe decision to split up the season in this fashion holds both positives and negatives. On the positive side, the season gets all of its tension out of the way early to make way for lighthearted fun and frivolity. Plus, by keeping the two halves separate, the major conflict remains focused as opposed to lost amongst the laughs and gaffs. On the negative side, ending the season with arguably pointless material makes the narrative come off as aimless, possibly lost. Also, the shift from heavy drama to almost no drama makes said heavy drama lose weight.\\n\\n\r\nNevertheless, the narrative’s structure holds a different purpose: it matches the tone of the anime itself. Shirayuki is “forced” to go back to Tanbarun and away from Clarines, the place she (now) calls home. So it makes sense that, as she struggles with leaving behind both her work and more importantly Zen, she encounters more troubles abroad. Practicing being a proper lady. Finding herself lost in an underground labyrinth. Getting kidnapped from her kidnappers. In other words, where the first season brought balance, this second season brings imbalance.\\n\\n\r\nIt is not until Zen, Kiki, and the others arrive, and subsequently the whole gang gets back together again, that she feels safe. That she feels at home. And so the events from then on reflect her comfortability. Obi being reacquainted with an old friend. Mitsuhide acting goofy. Zen treating Shirayuki as the love of his life. Balance.\\n\\n\r\nNot all of the events manage to maintain execution, however. The stopwatch that Zen gave to Shirayuki meant next to nothing narratively despite earning some importance. An argument for it breaking and its time stopping has some nice symbolism to it (her “time ended,” both for going home and possibly her life), but the watch does not actually serve a grander purpose.\\n\\n\r\nAlso, the whole Shirayuki’s-father idea almost comes out of nowhere and has little impact on the events after the revelation (since it comes at the end of the long conflict that goes right into the laidback events). It does continue with the anime’s theme on home and leads to Kazuki kidnapping Shirayuki (by misunderstanding her situation), but it is still a weak inclusion.\\n\\n\r\nAnd it was a bit too convenient that the one dude just happened to have family that did business with the Claw of the Sea which led to them invading their hideout.\\n\\n\r\nYet the worst problem, a problem inherent with the given structure, is the separation of Zen and Shirayuki. Technically speaking, Akagami is meant to be a tale about Shirayuki and Zen. Not Shirayuki and Raj. Not Shirayuki and Obi. Shirayuki and Zen.\\n\\n\r\nTo be fair, the forced separation does have purpose. Shirayuki does nothing romantically with the other two, solidifying her feelings. The direction helps those two men rather than Shirayuki herself (more later). And their time away from one another allows them to understand that what they miss most is each other. But when Shirayuki is away from Zen and vice versa, it disrupts what the anime is supposed to be about. I.e., Shirayuki and Zen.\\n\\n\r\nThe long conflict is not without its happy or funny asides. The slice-of-life episodes are not without their own conflicts. And Shirayuki and Zen do share a lot of moments together regardless of the separation. Meaning, overall, the narrative rests on middle ground.\\n\\n\r\nANIMATION\\n\\n\r\nAs to be expected of the second half to the split-cour, the art and animation levels remain as high in quality as they were with the first half.\\n\\n\r\nColoring in particular is vibrant once again. The landscapes are painted with greens, blues, and purples to get back to that fairytale feel. Lighting also contributes to this feeling – sunsets, nighttime moonlight, and sparkles galore fill many sections of the show.\\n\\n\r\nThe animation levels are back, too. During fights, characters jump, swing, and dodge against their opponents. Choreography also makes the fights more fun to follow. When fighting is not going on, the characters’ hair, eyes, and clothing likewise see fluid movements that keep the show from being static.\\n\\n\r\nAnd the character designs do not change too – a clear positive. Shirayuki herself gets a few extra outfits, like the one she wears to the ball and the one she wears when Prince Izana summons her to receive her reward from Tanbarun. Zen, Mitsuhide, and Kiki’s designs return as well, and, similar to Shirayuki, Kiki gets an extra one during the fake marriage interview with Zen that perfectly captures her beauty.\\n\\n\r\n(Thinking more on the coloring of their hair, these couplings hold weight. Red and white are colors that complement one another well. Much like Shirayuki and Zen do. Similar thoughts can be written about yellow and blue for Kiki and Mitsuhide respectively.)\\n\\n\r\nNew characters receive nice designs as well. Umihebi, the leader of the Claw of the Sea, looks intimidating with her yellow-green eyes, ponytail, and multiple pieces of clothing. Mukaze, the leader of the Lions of the Mountain, probably gave Shirayuki some of his hair genes (but not his sense of clothing), considering his faded, brownish-red hair. And Torou dons the femme fatale look with her long brown hair, nice figure, large earrings, long skirt, and white boots.\\n\\n\r\nAdmittedly, there are a few hiccups. The rocking of the characters in the boats during the whirlpool pursuit was not handled with care. And Shirayuki’s smile as she spins in the opening track’s visuals makes her look more goofy than cute. But the rest of the art and animation make up for these small grievances.\\n\\n\r\nCHARACTERS\\n\\n\r\nInterestingly, the anime does not place too much focus on Shirayuki’s and Zen’s characters. Instead, most of the attention goes to two other people: Raj and Obi.\\n\\n\r\nRaj was the prince from the first season who initially tried to steal Shirayuki back after she ran away from his snobby eyes. When he later visited Clarines, he was scared out of his mind given his promise to Zen to never see Shirayuki again. These characteristics, snobbishness and courage, are what the anime targets for this season as well. But rather than inflating them further, the goal is to reduce them.\\n\\n\r\nTo this end, Raj invites Shirayuki to Tanbarun. Part of it is a test for Shirayuki and Zen on Izana’s behalf – to see if Shirayuki can successfully prove her worth and hence her (in Izana’s eyes) compatibility with Zen. Part of it is to see Shirayuki’s compatibility with Raj. And the biggest part is Raj wanting to mend his relationship with Shirayuki regardless of the feelings involved.\\n\\n\r\nThus they learn more about each other during their time together. Shirayuki learns of Raj’s violin skills as well as willingness to better himself. In turn, Raj learns of Shirayuki’s trust of others and of her thoughtfulness which she uses with everybody.\\n\\n\r\nRaj’s younger siblings have kindhearted intentions with their meddling, but Shirayuki and Raj both understand that they do not love the other as lovers but rather as friends. Where their relationship was once in a rocky spot, it is now exactly where they want it to be.\\n\\n\r\nThe culmination of their time together was originally supposed to be their dance at the ball, but, when Shirayuki gets kidnapped, Raj finds himself needing to test whether or not he has left behind his snobby and fearful days of old. That is, he needs to prove whether or not Shirayuki has left a lasting impression on him.\\n\\n\r\nAnd prove he does. He opts to join the horseback chase after the Lions of the Mountains. He makes a personal appearance before his people, pleading for their aid in his time of need. He leads the charge after the Claw of the Sea, declares his friendship with Shirayuki for all to hear, and courageously carries his men through the raging whirlpools. All choices that demonstrate Raj has changed for the better.\\n\\n\r\nAfterwards, he and Shirayuki finally do have that dance (with the music Shirayuki had pointed out at an earlier point), but, to reiterate, this send-off is not the highlight. Instead, it comes with the necklace and official decree of her new title: “Friend of the Crown.” The letter Raj writes for Shirayuki is kind, reflective, and sincere, indicating without a doubt that Raj is finally the kind of prince, the kind of person, that Shirayuki always knew he could be.\\n\\n\r\nNext to Raj, Obi is the other prominent character. The first half of the split-cour initially had him as an enemy of Shirayuki and Zen. Very quickly, he finds himself working for his new master Zen, and he also finds that he has some feelings for Shirayuki himself.\\n\\n\r\nNear the start of this second half of the split-cour, Obi is still in the same spot. When Shirayuki must go to Tanbarun to prove herself, he duels Zen for the honor of accompanying her. Obi surprisingly wins – giving him the chance to also prove his worth to Shirayuki.\\n\\n\r\nObi has generally looked over Shirayuki from afar, but this opportunity allows him to look over her while afar. He behaves the same, too. He guards her, tracks her whereabouts, and escorts her when necessary.\\n\\n\r\nYet when she needed him most, he fails. The (first set of) kidnappers arrive with impeccable timing, defeating Obi and stealing Shirayuki. He did not prove his worth. Whether it was because of his feelings for her or because of his pride, it does not matter. All that matters is that a switch flicks on within Obi – and anger brims forth.\\n\\n\r\nHe finds one of the kidnappers, the glower on his face indicating easily enough his current mindset. When Zen finds him, though, he gets scolded by Zen. Not for losing Shirayuki but for making Zen worried about him, too. This small interaction sets the seed for his eventual weening.\\n\\n\r\nFor that’s a major motif of Obi’s character during this season of Akagami: weening away his deeper feelings for the red-headed girl. Zen’s trust in Obi affects Obi since it is something he is not used to. Shirayuki (after being rescued) asks him to continue helping her, simultaneously easing his mind about his failure and indicating the kind of relationship they share (i.e., a friendly one, not a romantic one). And the episode afterwards, where his friend from the past reappears, allows him to understand that he likes the friends he has in the present and does not want to lose in the future.\\n\\n\r\nThe culmination of his character comes when he gets Zen away from Mitsuhide’s overprotection. He encounters Shirayuki but leaves her to get Zen, indicating his newfound outlook on himself and the group he cares for.\\n\\n\r\nBoth Raj and Obi highlight a specific theme among the characters: understanding one’s self and where one wants to be personally.\\n\\n\r\nThe story targets something similar – the idea of one’s home – but that is more physical. This theme is more mental. Raj confronts his shortcomings. Obi learns about what he truly cares for. Shirayuki and Zen know they want nothing else but each other. Even Mitsuhide and Kiki learn about themselves – Mitsuhide and Kiki care for their prince and, more than implied, one another.\\n\\n\r\nSpeaking of Shirayuki and Zen, they feel the negative effects once again of not holding the spotlight. Shirayuki does grow in terms of proper ladyship, but she has always been confident and determined, so the change is more minor than major. Plus, the longer conflict has her (once again) getting dragged along against her will. She has to wait for everyone else to rescue her rather than her rescuing herself – a lost opportunity.\\n\\n\r\nZen gets it even worse. Obi takes his spot for the major conflict, and, once back home, his biggest change is not averting his older brother’s gaze. Weak. At the minimum, his actions and words make it more than known that he loves Shirayuki. Even if their relationship is not as official as it could be.\\n\\n\r\nThe other side characters are a toss-up. Kazuki’s defection does not have much exploration but his role as homewrecker works. Prince Izana only commands and laughs, but he forces the characters to act. And both Mitsuhide and Kiki do not have their own romance blossom, but it was appreciated that they got some attention after almost two whole seasons of nothing.\\n\\n\r\nAltogether, the cast is filled with positives and negatives that ultimately balance one another out.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track is leveled in its approach. The start is slow with the singer and instruments working at a methodical pace. The halfway point builds up the emotion, giving way to a second half that is slightly faster and slightly loftier. Not a lot; just a tad. Weirdly, the piece comes off as simultaneously grandiose yet not-quite-so, leaving it in a less-than-ideal spot. No matter how fairytale-esque it may be.\\n\\n\r\nThe ending track somewhat follows in the footsteps of the OP, but it picks up the pace a bit earlier. It still has the same leveled tone, but the ED is more of a happy piece than it is a fairytale one. The final held note from the vocalist proves her strength, but the entire track leading up to the end lacks emotion and power – details that a single strong note could not hold up.\\n\\n\r\nSandwiched between the OP and the ED is the rest of the original soundtrack. Luckily, it contains the same lovely tracks from the first half of the split-cour. Dainty tunes, magical ensembles, and romantic arrangements come together to make Shirayuki’s second tale feel like a fantastical story once more.\\n\\n\r\nAs for the voice acting, it sits somewhere around average once again. Saori Hayami as Shirayuki and Jun Fukuyama as Raj deserve the only shout-outs. Ms. Hayami’s soft way of speaking and Mr. Fukuyama’s frazzled yet determined voice help to make the characters stronger than they would be otherwise.\\n\\n\r\nENJOYMENT\\n\\n\r\nLike many anime for me, this one was somewhere in the middle.\\n\\n\r\nThose first seven or so episodes, while containing spurts of romance or other such happiness, were not the most entertaining. Relegating Shirayuki and Zen to more of a side role, and thereby reducing the amount of overall time they spent together, was not favorable. The action was not all that impressive. Umihebi and Kazuki were not interesting characters regardless of their respective affiliations. Raj and his younger siblings were thankfully around to make these duller parts more entertaining.\\n\\n\r\nI also was not a fan of the anime (still) thinking about the Obi route. Not that he did anything overt. Just the long bout of subtleness – the way he looked at her or the words he said – before he made up his mind to back off had me somewhat frustrated.\\n\\n\r\nThe last four episodes, however, were a major delight.\\n\\n\r\nI laughed extremely hard at Shirayuki’s dad yelling immediately after Zen declared his feelings of love for her. I half expected a response of that nature, but the quickness and loudness of his response made me laugh uncontrollably.\\n\\n\r\nMitsuhide’s specific episode was a lot of fun, too. Especially when he accidentally knocked Kiki over. He grabs her waist and hand as he speaks gentle words in her direction. But it was Kiki’s absolutely disgusted response (“Huh?”) and expression that had me laughing hard. Obi’s own stifled laughter was a bonus.\\n\\n\r\nMitsuhide getting visibly angry (in a comedic way) when Obi brought up Kiki getting approached by other men. Zen’s intimate moment with Shirayuki in the garden and up atop the tower. Kiki not denying Obi’s (incorrect) recount of what Mitsuhide said (about her being the most beautiful woman in the world) while he was delirious. All funny and likable moments.\\n\\n\r\nI am talking about Kiki and Mitsuhide so much because I wish the anime would have made their more-than-obvious romantic pairing more definitive. But I suppose that will have to wait for another season sometime soon.\\n\\n\r\nAkagami no Shirayuki-hime 2nd Season is not an amazing anime, but it does do a lot right. Character development for a couple of the members of the cast. A purposeful narrative structure. Nice comedy, art, and music too. Unfortunately, the forced separation of Shirayuki and Zen has a ripple effect across the entire show. They say an apple a day keeps the doctor away. Or one can just use this anime as a supplement instead. Maybe.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, a quirky narrative structure, a theme on home, and other problems (inherent or not) balance everything out in the end\\n\\n\r\nAnimation: Great, colorful artistic direction, above average actual animation, and nice character designs\\n\\n\r\nCharacters: Fine, Raj is great, Obi is good, and the rest either serve their role or needed more but never got it\\n\\n\r\nSound: Fine, okay OP, bad ED, great OST, okay VA performances\\n\\n\r\nEnjoyment: Fine, a less-than-fun first two-thirds gives way to a more-than-fun last one-third\\n\\n\r\nFinal Score: 6/10",
            "date": "2017-05-29T13:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 248817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=248817"
        },
        {
            "content": "\"Red is the colour of Fate\" \r\nIt is very rare that when I start watching a show that by the time I finish both seasons I find myself thinking, \"that ended perfectly and I honestly hope for no more seasons\". Akagami no Shirayuki-hime was one of those shows that sticks with you like a hot glue gun sticking to your skin. Except a lot less painful, as you would actually enjoy watching this show. I hope you understood my metaphor. TL;DR - this show sticks with you\r\nThe story continues from the last season (obviously) and is executed well--if not better than the first season--making itenjoyable to watch. The art is phenomenal (as is the sound) resulting in a very calming show to sit down and watch on a lazy weekend. The characters stay much the same, as is mentioned multiple times by the characters as to show that not much has changed.\\n\r\nThe only exception to this would be Raji, who gets his own character arc for a while in this season, making him one of the main characters. \\n\\n\r\nThe show easily gets a recommendation from me and is one of my favourite romance animes, making it a real shame that I originally dropped Akagami no Shirayuki-hime after episode 3 when it was first airing due to how slow it originally felt. I'm glad I picked up this title again because I would've severely missed out if I'd not continued watching it.",
            "date": "2016-08-13T19:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 226676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819739.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PlaceFantasy",
                "username": "PlaceFantasy"
            },
            "url": "https://myanimelist.net/reviews.php?id=226676"
        },
        {
            "content": "Akagami no Shirayuki Hime   review\r\nThe story  is simple and follows a slow and natural pace in developing a romance story between Shirayuki and Zen.\r\nThe anime focuses on aspects like bonds, trust and the encounter  with different people and how those encounters change us and the world around us.This is all done with the help of the characters which the show manages to use them properly to execute its plot and story.\r\nThe romance story in this anime is not rushed at all , the development is done at  a steady and natural pace . At first we are shown how thebond between two people is founded with the help of the red string called fate. It’s the meeting between our two main characters Zen and Shirayuki who are brought together by the red string (fate). After that the show focuses  on enforcing that bond , everything is done naturally  giving proper reasons why those two care and fall for each other. Finally to put a strong mark on their bond and romance everything is settled with a kiss which is the strongest proof of their love for each other.\\n\\n\r\nThe main purpose of the story is to tell  the viewer about the importance of the encounter with different people and how it  influences them  and the world around us. This is done with the help of our heroine Shirayuki , which along her long path to become a royal court  herbalist she encounters different people and obstacles. She overcomes those obstacles with her own strength , and her different encounters leave a strong mark on people. She finds pieces of puzzle of her identity through each encounter learning about her weaknesses and strong points.\\n\r\nThe anime portrays the value of bonds and trust between humans and delivers a strong message to the viewer with the help of Zen and his trusty retainers. The anime takes his time and shows the characterization of Zen’s retainers  and the strong bond that it’s formed between them. It’s a unique and mysterious and  can’t be described by  words ,  silly and simple and  defies logic , it’s something that you can’t buy with money, yes we all know and experienced it daily it’s called  TRUST.\\n\\n\r\nAnother strong point for the anime is how it uses the simple details for the execution of the plot and characterization. Those simple details are used to craft the details and personalities of the characters and to portray their emotional state and mindset across the encounters they have with each  other.\\n\\n\r\nThe characters are the firm foundation for the anime. They are well written  and all the themes and plot revolve around their encounters and influence across the story.The way the anime handles the minor characters and their development for the purpose of the progression for the story and plot is marvelous done. Each detail and aspects is not missed and used to enforce the atmosphere and emotional state  for the story and characters.Also the characters portray a strong message for the viewer and a motivating one too like pursuing your dream, hardworking, relying on friends,  overcoming the struggles that life brings us, trust, the importance of bonds and encounter.\\n\\n\r\nThe anime has one of the most beautiful ost and stunning peisage that  captivates the mind and soul of the viewer. The beautiful music and atmosphere crafted with the most subtle details draws you inside of the story  and helps you relax your mind and soul after a hard day.\\n\\n\r\nIn conclusion the anime portrays the value and importance of encounter, the mysterious and red string called fate, the bond of trust between people, the goal and purpose of a dream and how hard you need to work to achieve it all in a beautifull and yet simple romance story with stunning, captivating ost and peisage.\\n\\n\r\nOverall 8/10\\n",
            "date": "2017-05-10T05:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 247353,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=247353"
        },
        {
            "content": "Although I absolutely adored the first season of Shirayuki, I must admit for the first few episodes of season 2 I couldn't decide whether I liked it as much. At first, I felt a little bit like the show had lost some of its magic... and maybe it was because Zen and Shirayuki were apart for a while, maybe I just didn't enjoy the plot arc quite as much... I don't really know. But, it didn't really take away from my score too much, as it seemed to pick up for me again after I made it through the first 5 episodes or so, andonce again I fell in love with this sweet story <3\\n\\n\r\nFirstly, I have to comment on the art again. I just love it. I think it might be the most beautiful style of anime art that I've seen. It's so colorful and detailed without being over the top, and it really adds to the magical, fairytale feel of the show.\\n\\n\r\nAs for the story, like the first season, it's really nothing original. But to me, fairytale romance almost never gets old, unless it's just blatantly cheesy to a ludicrous extent. Starting off with this season I was not a huge fan of the whole thing with Obi and Raj suddenly showing feelings for Shirayuki. Not that I necessarily have a problem with harem or reverse harem or whatever, but for this show the idea wasn't working for me. Luckily, that whole fiasco wasn't shoved down my throat or anything, and ultimately didn't become a main plot device. Thank heaven.\\n\\n\r\nCharacter-wise, I like just about all of them. Shirayuki and Zen are both great in my opinion. Like last season, Shirayuki is kind and gentle, but also intelligent, resourceful, and strong-willed. I've always thought she was quite a human character, one with different sides to her, but nothing drastic like a sudden fit of violent anger as shown in a lot of anime. She experiences many emotions, happiness, sadness, frustration, etc... and I like that about her. Zen is also pretty awesome. He's like the ultimate prince charming, but better, because he has a personality. He tries to act smooth and confident, but even he gets flustered or upset at times. And his love and devotion for Shirayuki... simply swoon-worthy. Speaking of their relationship, I just thought I'd mention that I appreciate how the two of them actually talk about things. Any time there is an issue, they actually discuss it like normal people in a relationship are supposed to do, which is something I don't see all that often in anime. Usually, misunderstandings build up until someone explodes for no reason and then there's unnecessary conflict that could have been avoided... luckily, Shirayuki and Zen are mature enough to handle the bumps in the road with grace and dignity.\\n\\n\r\nI also liked the other characters, many of whom got some more development this season. I like both Kiki and Mitsuhide, who are both awesome and very loyal friends. Obi's an interesting character as well, and I thought it was cool to get a glimpse of his past. I'm hoping to see more of that in the future, perhaps if I read the manga. And even Prince Raj, holy snap... he was such a scum bag in the first season, and yet he somehow grew on me. Amazed.\\n\\n\r\nI think the only character I don't like is Zen's brother... partially because I don't get what his deal is. I find him a little disturbing at times, and it almost seems like he just, for no reason, finds some kind of enjoyment out of messing with Zen and Shirayuki in twisted ways. He just... creeps me out.\\n\\n\r\nIn any case, I really loved this show. The whole thing, both season 1 and 2. Even if this one took me a couple episodes to get into it, I'm still glad I watched it and I think this series will forever have a place in my heart. It will definitely be my go-to in the future for days when I'm feeling sad. Sigh... don't we all wish we had our own fairytale romance?",
            "date": "2016-04-23T22:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 217008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/snowflower234",
                "username": "snowflower234"
            },
            "url": "https://myanimelist.net/reviews.php?id=217008"
        },
        {
            "content": "This review contains spoilers.\r\nBones is one of my favorite studios, but they're a bit hit-or-miss-- they're behind the sublime Eureka Seven and Tokyo Magnitude 8.0, but they also delivered flops (or extremely niche works) like Captain Earth, Star Driver, and Eureka Seven AO. The first Snow White series they produced was pretty good, a rather straightforward \"modern fairy tale\" that lacks the depth of their greater productions.\r\nShirayuki is one of my favorite heroines in recent memory. Rather than rely on merely \"cute\" appearances, she's a character who not only does exactly what she thinks is right, but she applies her brain when she has aproblem to solve-- a bit of a girl MacGyver. Season 2 doesn't focus on her quite so much, because there are 2 antagonists from season 1 who need to be redeemed. Well, I don't know about \"need', the creators could've dropped Raji and Mihaya off the face of the planet and I doubt anyone would've cared, but clearly turning these into \"good guys\" was something of a priority-- the point being, going up against Shirayuki made them reconsider their life choices and try to be better people. Additionally, the production also wanted to develop Obi further (great idea) and give Zen more \"hero time\" (meh).\\n\\n\r\nThis decision came at a bit of a cost to the character of Shirayuki: this time the story, for realsies, put her in a \"damsel in distress\" position, and even her mad botany skills weren't enough to get away from Yet Another Bond Villain. To be fair, the principal antagonist of this arc wasn't quite as one-dimensional as the villains from, say, Akatsuki no Yona, but she was only really needed for a couple of episodes, so deep complexity wasn't in the cards.\\n\\n\r\nOne problem I had with this particular arc is that we never got to know the first captor before, (spoiler) plot twist, Shirayuki and captor are both kidnapped. Sure, we heard his backstory later, but this is a classic \"telling the story rather than showing it\"-- Bones would've been much better off _animating_ that backstory, even as a series of stills, rather than having a couple of guys tell it over lunch. As a result, the emotional investment in seeing him captured/rescued is chained to the investment in seeing Shirayuki in the exact same situation. Second, while this is a terrific redemption arc for Raji (Mihaya, not so much), this plot arc serves as little more than an excuse to have them led by Zen into a daring rescue. After having killed off her one great attribute for the sake of the situation (her brain), at the end she's reduced to a crying, rescued damsel-- contrast this to Akatsuki no Yona, where in a very similar situation, Yona is absolutely critical to the success of the mission and even delivers the killing blow herself. Why isn't Shirayuki at least chucking tear gas powder at the pirates in the climactic scenes?\\n\\n\r\nThe added story time given to Raji in this season yielded a number of good moments-- my favorite is by far the improvised navy scenes, where he not only comes up with a \"navy\" made mainly of merchant ships, but also makes up orders and proclamations in his quest to help rescue Shirayuki. While his leadership is far more luck than skill, it demonstrates the value in at least making a valiant attempt with a heart in the right place, even if one is a complete noob (and yes, I totally understand that this isn't how this works in the real world). Similarly, Obi got a few really good development scenes showing that under the light-hearted \"thief\" archetype, there's a fierce killer underneath.\\n\\n\r\nThe closing episodes are... a bit lacking. Two sitcom episodes involving Kiki and then Mitsuhide, then an episode where Shirayuki decides she wants to be with Zen. I would've expanded the finale into an OVA or movie, but that's just me.\\n\\n\r\nOverall, a good sequel to an already good non-magical fairy tale. Good redemption story for Raji, but at a cost to Shirayuki's best attribute.",
            "date": "2018-07-22T23:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 284565,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2367307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/earl_of_sandvich",
                "username": "earl_of_sandvich"
            },
            "url": "https://myanimelist.net/reviews.php?id=284565"
        },
        {
            "content": "ENG: the second season is still good and with the same technical qualities of the first season. However, the main storyline becomes more monotonous and without major challenges to be overcome by the main characters of the anime. The supporting characters continue to be charismatic, but there are no major developments that have already been seen in the first season. At least the romance and the drama around the protagonists remains very cool. Unfortunately, the anime ends with a season without great emotions (compared to the first season), besides that, the ending leaves half-open plot to continuations.\r\nPORT: a segunda temporada se mantém no geral boae com as mesmas qualidades técnicas da primeira temporada. Entretando, a história principal passa a ser mais monótona e sem grandes desafios a serem vencidos pelos personagens principais do anime. Os personagens coadjuvante continuam sendo carismáticos, mas não há grandes evoluções do que já foram vistas na primeira temporada. Pelo menos o romance e o drama ao redor dos protagonistas continua sendo bem legal. Infelizmente, o anime termina com uma temporada sem grandes emoções ( comparando com a primeira temporada), além disso, seu final deixa a trama meio aberta a continuações.",
            "date": "2018-07-06T21:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 283164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Theusnew",
                "username": "Theusnew"
            },
            "url": "https://myanimelist.net/reviews.php?id=283164"
        },
        {
            "content": "A really good sequel that expands upon the characters in the first show.\r\nAs always, I love the dynamics between Shirayuki and the men in her life. They all fall for her a little, and she ultimately changes the people she meets for the better and builds lasting friendships. \r\nI enjoyed seeing Raj and Zen grow up in this show. Of course Zen was always nice, but I really feel like in this show he demonstrates the maturity that he needs to be able to keep up with Shirayuki. \r\nThis show is funny in that almost every villain (with the exception of Madame Sea-Snake) ends upbeing influenced by Zen and Shirayuki and changing their ways. It's really quite heartwarming. Case in point: Raj. In trying to earn Shirayuki's respect, he ends up earning the respect of the others around him and learning to be a better prince and person. (His randoms snaps are still hella annoying, though)\\n\\n\r\nJust a nitpicky thing: with all the time Shirayuki spends around trained soldiers, you'd think one of them could teacher her some self-defense!\\n\\n",
            "date": "2017-08-24T18:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 256199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6397541.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nekonekonekochat",
                "username": "nekonekonekochat"
            },
            "url": "https://myanimelist.net/reviews.php?id=256199"
        },
        {
            "content": "I'm sad but I 'm hopeful that we do get a third season of this show because this is something, a lot of people need to see. \r\nStory: As for a story, it a continuation of the first season. I loved the story, but their was one  story line (that I can't say which one because of spoilers). The story is great but it  a 9 with that story line. \r\nArt: The art is basically the same nothing really special.  You have your very cute art so that why I give the art an 8. \r\nSound: We did get a new intro,and ending and honesty I loved both of them.  It an improvement from the last season, and the ending I feel was very well done. As for Dub, and Sub I watched it Dub (like the first season). You have the same set of VA who did the voices. Austin Tintale was the outstanding role, and I always say that with anything with him in it. The sound is a 9. \\n\\n\r\nCharacters: Now for the characters I gave it a 10 on season 1, but it an 8 now. I think through the one time that the story line happened, it made me hate some characters (even the ones I was supposed to hate). Although it not a bad thing I can still see negative after this season. \\n\\n\r\nEnjoyment, and Overall: Enjoyment value is a 10, I can enjoy my time with an anime like this. The overall value is a 9, I think the story is the main reason because of it, but I still love it (and I want a third season).",
            "date": "2017-02-17T13:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 240772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4828029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuna67876",
                "username": "Yuna67876"
            },
            "url": "https://myanimelist.net/reviews.php?id=240772"
        },
        {
            "content": "I just love this so much. I even loved season 2 more than season 1. (I'm really hoping for a season 3 by the way, there's enough source material so yea)\r\nStory: 9\r\nThe story is just great. It doesn't really have this one big storyline but some things from the first season came back (like the Raj stuff) etc. I just simply loved it.\r\nArt: 10\r\nI love the art way to much. \r\nCharacter: 10\r\nThe characters are what makes this anime so great to be honest. Serious characters, funny characters. This anime has them all. The development is also great. Raj who became friends with Shirayuki for example.\r\nEnjoyment:10\\n\\n\r\nOverall: 10",
            "date": "2017-03-27T16:07:00+00:00",
            "helpful_count": 0,
            "mal_id": 243731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5831912.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Robin0x",
                "username": "Robin0x"
            },
            "url": "https://myanimelist.net/reviews.php?id=243731"
        }
    ],
    [
        {
            "content": "I personally think that the second season is better than the first one. Many things were improved and I got addicted to the show. So:\r\nSTORY: 8/10\r\nThe simplicity remains, same for the cuteness, the comedy, the slice of life feeling and the sweet romance. What differs in this season is the events, which are more interesting and intriguing. There is a hint of amusing action now as well. Everything about the plot was really great IMO.\r\nART: 9-9.5/10\r\nNothing changed from the previous season, everything and everyone is a pure beauty still.\r\nSOUND: 8/10\r\nNothing really changed here as well, the score remains really good and a perfect fit forthe anime's nature.\\n\\n\r\nCHARACTERS: 10/10\\n\r\nThe great characters remained, and became even better. This time we got an even better characterization for some supporting characters and the main cast shone more through the energetic events they faced and due to having some backstories revealed about them. These backstories actually explained  some things about their current way of living and behaving. Due to that, I was able to love them, because each one got a unique emotional pallet and a trademark, and the result was excellent. \\n\\n\r\nENJOYMENT: 9/10\\n\r\nAll the features that made me enjoy the previous season weren't absent from this one at all. But some extra suspence and the flawless characterization added something more, something more capturing and addictive. I can now say that if there's gonna be a third season (I SO HOPE FOR THAT *-*) I won't treat this show as a way to spend my spare time, because now we have a great basis for a great evolution in a really entertaining story and it has become a must for me. Since the manga is still coming out and since there are still questions to be answered, I can only wait and hope that Studio Bones will announce a third season. \\n\\n\r\nOVERALL: 8.5-9/10\\n\r\nBeautiful, relaxing, light, simple but solid, interesting, funny, intriguing, upcatching and all the other adjectives I used in order to describe the second season but the whole Akagami no Shirayuki-hime franchise as well, make this season, and the whole anime in the end, deserve such a high score and a place in my heart.\\n",
            "date": "2016-05-02T07:35:00+00:00",
            "helpful_count": 75,
            "mal_id": 217698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5244396.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChrisAlex",
                "username": "ChrisAlex"
            },
            "url": "https://myanimelist.net/reviews.php?id=217698"
        },
        {
            "content": "*I watch both seaons*\r\nAs a girl I really enjoy this Shoujo romance anime. It's sweet,innocent, motivating ,love story between a prince(Zen) and a commoner girl(Shirayuki). Zen also has loyal friends who aid him in tough times and have fun. \r\nStory wise is nothing too extraordinary, but is relaxing, the slice of life part is good and funny. I love how the other male characters have good feelings towards Shirayuki, but as a friend or maybe not? \r\nbut I was hoping there will be some quarrel because things is just too good to be true, is a fairytale like story after all.",
            "date": "2016-08-11T10:01:00+00:00",
            "helpful_count": 53,
            "mal_id": 226488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5387486.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Momori66",
                "username": "Momori66"
            },
            "url": "https://myanimelist.net/reviews.php?id=226488"
        },
        {
            "content": "The second season of Akagami no Shirayuki-hime was considerably better than the first. The story is much more stable, although it seems to have compromised some of the characters' morality and stability for that. Although it was pleasant enough to watch, there was still something lacking. I don't think the creators of this anime did a good job combining action and romance, or at least not as well as some other anime.\r\nPersonally, I think the anime became a chore to watch and finish...\r\nOverall, the anime in itself was pretty good, but I believe the first season took away a lot of the enjoyment and potentialthis anime had.",
            "date": "2016-04-16T20:54:00+00:00",
            "helpful_count": 58,
            "mal_id": 216530,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5105506.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/honodesu",
                "username": "honodesu"
            },
            "url": "https://myanimelist.net/reviews.php?id=216530"
        },
        {
            "content": "A new chapter in a story.... that's what a sequel is. That new chapter may improve the story, or it may make it worse. However, there's also the possibility that you may enjoy the sequel as much as the story that came before it; for me, that was the case with Snow White with the Red Hair. I had actually watched the first season (and reviewed it), and I really adored it; since I reviewed the first season, I decided that I would review the second season when it was done airing. That's proving to be a difficult task; I mean, what is there tobe said about this season that I already said about the first season?\\n\\n\r\nIn case you are not familiar with this series, Snow White with the Red Hair follows a girl named Shirayuki, who is an herbalist known for her unusual, apple-colored hair. When the prince of her country of Tanbarun, Raj, tries to make her his concubine, she cuts her red hair and escapes to the neighboring country of Clarines. On the way there, she meets Prince Zen and his two aides, Mitsuhide and Kiki, who help her when she's in a real pinch involving Prince Raj. Upon arrival to the castle in Clarines, Shirayuki aims to become a court herbalist, working diligently toward her goal. Oh, and should I mention the blossoming romance between Shirayuki and Zen?\\n\\n\r\nThe art in this anime is as beautiful as ever; Bones really does a great job in this department. The ending theme, \"Page ~Kimi to Tsuzuru Monogatari\" by eyelis, is also quite a beautiful song, and I honestly liked it more than the ending theme for the first season. As for the opening theme, \"Sono Koe ga Chizu ni Naru\" by Saori Hayami..... well, it can never be better than the opening theme for the first season, but it's still a very nice song! Unlike the first season, which I watched the English dub of, I watched the Japanese version of the second season. I must say, these seiyuus really nailed their roles, especially Saori Hayami as Shirayuki! (Maybe I'm just being a Saori Hayami fangirl when I say that, but still!)\\n\\n\r\nThe story is still kind of easygoing, but there is one arc in particular that may really leave you on the edge of your seats. As for the characters, along with the great character development for the characters already in this anime, there are even more likable characters introduced in this season, especially Raj's younger siblings; they just put a smile on my face! Speaking of Raj, I never thought I'd come to like him, but believe it or not, I did; his character developed into one that was less....selfish, to say the least. The romance between Shirayuki and Zen was as sweet as ever, too, and it never failed to bring a smile to my face in this season.\\n\\n\r\nOverall, season two of Snow White with the Red Hair is as great as season one. If you watched season one of Snow White with the Red Hair and liked it, I recommend for you to watch season two. Now that I've finished the anime, I've either got to read the manga or wait for a third season of this anime about a romance between a girl with hair the color of apples and a prince of the country she arrived in!",
            "date": "2016-03-28T13:19:00+00:00",
            "helpful_count": 24,
            "mal_id": 214571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=214571"
        },
        {
            "content": "Akagami no Shirayukihime or Snow White with the Red Hair in English is a beautiful Romance/Slice of life anime based in a Fantasy setting.\r\nThe second season in my opinion didn't have as much of an impact on me as the first season however has it's beautiful and tear jerking moments, some surpassing season 1.\r\nThe art style is perfect for the anime and the animation quality is top notch. However the story lacks a bit in my opinion as not a whole lot happens in terms of events, but you do learn a lot more about the supporting casts and Shirakyuki herself.\r\nThe anime focuses on Shirayukiand Prince Zen and their struggles due to the difference in their social statuses. There is a wide range of supporting cast whom are all likeable from the female knight Kiki who is the cool headed badass to the loyal Mitsuhide whom worries over Zen 24/7.\\n\\n\r\nMuch to my surprise one of the supporting cast from season 1 becomes an integral part of season 2 and even potentially part of the main cast, he is favourite male in the anime and totally deserves it.\\n\\n\r\nIf you enjoyed season 1 or are looking for a romance anime then this is definitely one to watch!\\n\\n\r\nThis review is simply my own personal opinion so do not take it at complete face value.",
            "date": "2016-04-03T05:21:00+00:00",
            "helpful_count": 17,
            "mal_id": 215335,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4755163.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Dracosine",
                "username": "Dracosine"
            },
            "url": "https://myanimelist.net/reviews.php?id=215335"
        },
        {
            "content": "I already have reviewed the first season, and the second season definitely improves in many areas. Some may say that some of the characters aren't being consistent and that may be true, but I want to think of it as changing or evolving for sake of the story. The first season felt okay, but there wasn't really much story to it as it just, more or less, about the development of the main characters. This time around, the second season actually have quite the plot and there is a little twist in it too. The progress of second season felt appropriate and actually makes youwant to continue. Right near the end, we come to learn more about some characters which is great because the first season lacks background characters for a few. Second season adds more to the characters while progress with the story for the better. I am satisfied as how the anime ends, but also felt that there can be another season to end it even better. I guess by doing so, there is good chance of risking a good anime towards downfall though, I suppose. But in any case, if this review isn't enough, I'll go a little more depth on the bottom without spoiler as much as possible.\\n\\n\r\nStory: Improved over the first season. There's a real \"bad\" person this time and there will be more action (fighting) which is often a good thing under my book. The progression of the story and plot felt appropriate enough that us viewers won't be irritated and would like to know more. Of course, what interest us is, more or less, subjective. Although, I understand this anime is meant to be shoujo and light-heart to watch, but felt it could have been more realistic like a few characters that impact us dies, like how in Game of Thrones, the writer was not afraid of killing goods guys and important characters. This is the only thing that lacks in the story the most. Because it usually never serious about anything and felt rather fluffy. \\n\\n\r\nArt: Same as the first one. If you have watched the first season, then you should know what I mean.\\n\\n\r\nSound: Same again. Good Opening & Ending.\\n\\n\r\nCharacter: A little bit better. For one thing, I'm glad there's history about Obi and little bit of Kiki. I still would like some history of Haruka, Zen's father and mother and Izana though. So, I was a bit disappointed in that. But otherwise, some new characters shed some light which is pretty cool. On the other hand, for the \"bad\" person, I wish there was a little more to it than just plain \"bad.\" \\n\\n\r\nEnjoyment: It's a fun watch just like the first season. The second season is slightly tense.\\n\\n\r\nOverall: From the start to the middle to the ending, it does what the writer intended to do. It's a show about romance and in a fantasy setting. If you like something like Juliet and Romeo, this would be a good anime to watch.",
            "date": "2017-11-08T20:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 262834,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721512.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tsuyuhane",
                "username": "Tsuyuhane"
            },
            "url": "https://myanimelist.net/reviews.php?id=262834"
        },
        {
            "content": "I did not like the second season very much. \r\nIn the second season Shirayuki gets to dress pretty, have tea with her agressor (which, granted, happens to be one of the best characters in this season), get kidnapped, get kidnapped again and cry. There is a whole lot of crying. It's like she isn't even the same character anymore. \r\nOnce I noticed how little agency* this new version of Shirayuki had, I also noticed that there wasn't a single thing that had happened because of her. It's not only that she could be substituted by a pretty red lamp and the story would be thesame, it's that she wasn't important enough in her own series to even merit being the reason plot happens. Things happened because people were trying to do something else and she happened to be there. Motivations for characters were reused. It's just bad storytelling in general.\\n\r\nThe break from slice of life into badly written adventure, for instance, felt like something done just to have Zen going all fairy tale prince. There are no consequences for the main characters: nothing is gained or lost from that action. A secondary character does gets to find himself, but he's the only one impacted by half the season.\\n\\n\r\nThere are, still, a few good things: Raj's and Obi's character archs were great, as was that Mitsuhide episode (though he and Kiki get no character development). \\n\\n\\n\r\n* No biggie, it's just she's the MC. You kinds expect the main character to actually DO THINGS instead of having things done to them. And then cry. While mumbling the name of their lover. ¬¬",
            "date": "2017-07-18T07:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 253136,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/509572.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/saoki",
                "username": "saoki"
            },
            "url": "https://myanimelist.net/reviews.php?id=253136"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n------\r\nReviewing it weeks after watching.. sort of couldn't get around. So will review as my memory lets me.\r\nAlso this review makes me wonder If I should ever bother adding voice acting general gist as well into reviews..Hmm, not sure if can be bothered. But if anything utterly noticeable regarding VA I hear/see. I will add in Sound section comments regarding it.\r\n✦Story\r\nSo, village girls ends up working at royal family. In sense to prove herself and others. And the anime is about her daily activities as well aboutother character stories. Adding the whole superb romance element makes this Anime absolutely sweet, cute and fun. Cannot say much without spoiling, but I can say that much that things got a bit more dramatic and dangerous this time around. It had quite some moments and in general I felt story had fine progression, development and as well intrigue. I do not remember S1, but apparently I enjoyed this one a lot. So story'wise, cannot complaint.\\n\\n\r\n✦Art & Sound\\n\r\nIt's fitting, simple and pretty. Lot of great scenery. Art is quite good, but nothing too amazing. It's fitting for its style.\\n\\n\r\nAs for sound. There were a lot of noticeable OST and quite satisfying songs. Can't say much else.\\n\\n\r\n✦Character\\n\r\nWell, a lot of characters, lot of interesting stereotypes. Some fun backstories and progression. And Shirayuki is adorable with her man. Point being, I did really enjoy the characters in this series. A lot of them intrigued me and even grew onto them. Some villains also their purpose of being hated.\\n\\n\r\n✦Enjoyment & Overall\\n\r\nLong story short. A very sweet romance Anime with satisfying herbal/rpg theme to it.",
            "date": "2018-04-15T02:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 278123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=278123"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’ve never liked apples.\r\nSure, their outer casing is both shiny and biodegradable. But it’s a literal chore to completely peel the skin off (if one does not have a utensil or does not like the taste). Plus, they hurt my teeth. The acidity has always ruined any chances of me eating anything more after consuming these “toxic” fruits.\r\nAkagami no Shirayuki-hime 2nd Season features an apple of sorts. But, thankfully, it is an apple that is far from toxic.\r\nSTORY\r\nAkagami returns for the continuation to its split-cour. To be expected, Shirayuki, Zen, and many others return aswell for more fairy-tale happenings.\\n\\n\r\nLooking at Akagami’s narrative as a whole reveals an interesting direction. Two-thirds of the season are dedicated to a single, long-lasting conflict. The last one-third is comprised of episodic, slice-of-life events one right after another.\\n\\n\r\nThe decision to split up the season in this fashion holds both positives and negatives. On the positive side, the season gets all of its tension out of the way early to make way for lighthearted fun and frivolity. Plus, by keeping the two halves separate, the major conflict remains focused as opposed to lost amongst the laughs and gaffs. On the negative side, ending the season with arguably pointless material makes the narrative come off as aimless, possibly lost. Also, the shift from heavy drama to almost no drama makes said heavy drama lose weight.\\n\\n\r\nNevertheless, the narrative’s structure holds a different purpose: it matches the tone of the anime itself. Shirayuki is “forced” to go back to Tanbarun and away from Clarines, the place she (now) calls home. So it makes sense that, as she struggles with leaving behind both her work and more importantly Zen, she encounters more troubles abroad. Practicing being a proper lady. Finding herself lost in an underground labyrinth. Getting kidnapped from her kidnappers. In other words, where the first season brought balance, this second season brings imbalance.\\n\\n\r\nIt is not until Zen, Kiki, and the others arrive, and subsequently the whole gang gets back together again, that she feels safe. That she feels at home. And so the events from then on reflect her comfortability. Obi being reacquainted with an old friend. Mitsuhide acting goofy. Zen treating Shirayuki as the love of his life. Balance.\\n\\n\r\nNot all of the events manage to maintain execution, however. The stopwatch that Zen gave to Shirayuki meant next to nothing narratively despite earning some importance. An argument for it breaking and its time stopping has some nice symbolism to it (her “time ended,” both for going home and possibly her life), but the watch does not actually serve a grander purpose.\\n\\n\r\nAlso, the whole Shirayuki’s-father idea almost comes out of nowhere and has little impact on the events after the revelation (since it comes at the end of the long conflict that goes right into the laidback events). It does continue with the anime’s theme on home and leads to Kazuki kidnapping Shirayuki (by misunderstanding her situation), but it is still a weak inclusion.\\n\\n\r\nAnd it was a bit too convenient that the one dude just happened to have family that did business with the Claw of the Sea which led to them invading their hideout.\\n\\n\r\nYet the worst problem, a problem inherent with the given structure, is the separation of Zen and Shirayuki. Technically speaking, Akagami is meant to be a tale about Shirayuki and Zen. Not Shirayuki and Raj. Not Shirayuki and Obi. Shirayuki and Zen.\\n\\n\r\nTo be fair, the forced separation does have purpose. Shirayuki does nothing romantically with the other two, solidifying her feelings. The direction helps those two men rather than Shirayuki herself (more later). And their time away from one another allows them to understand that what they miss most is each other. But when Shirayuki is away from Zen and vice versa, it disrupts what the anime is supposed to be about. I.e., Shirayuki and Zen.\\n\\n\r\nThe long conflict is not without its happy or funny asides. The slice-of-life episodes are not without their own conflicts. And Shirayuki and Zen do share a lot of moments together regardless of the separation. Meaning, overall, the narrative rests on middle ground.\\n\\n\r\nANIMATION\\n\\n\r\nAs to be expected of the second half to the split-cour, the art and animation levels remain as high in quality as they were with the first half.\\n\\n\r\nColoring in particular is vibrant once again. The landscapes are painted with greens, blues, and purples to get back to that fairytale feel. Lighting also contributes to this feeling – sunsets, nighttime moonlight, and sparkles galore fill many sections of the show.\\n\\n\r\nThe animation levels are back, too. During fights, characters jump, swing, and dodge against their opponents. Choreography also makes the fights more fun to follow. When fighting is not going on, the characters’ hair, eyes, and clothing likewise see fluid movements that keep the show from being static.\\n\\n\r\nAnd the character designs do not change too – a clear positive. Shirayuki herself gets a few extra outfits, like the one she wears to the ball and the one she wears when Prince Izana summons her to receive her reward from Tanbarun. Zen, Mitsuhide, and Kiki’s designs return as well, and, similar to Shirayuki, Kiki gets an extra one during the fake marriage interview with Zen that perfectly captures her beauty.\\n\\n\r\n(Thinking more on the coloring of their hair, these couplings hold weight. Red and white are colors that complement one another well. Much like Shirayuki and Zen do. Similar thoughts can be written about yellow and blue for Kiki and Mitsuhide respectively.)\\n\\n\r\nNew characters receive nice designs as well. Umihebi, the leader of the Claw of the Sea, looks intimidating with her yellow-green eyes, ponytail, and multiple pieces of clothing. Mukaze, the leader of the Lions of the Mountain, probably gave Shirayuki some of his hair genes (but not his sense of clothing), considering his faded, brownish-red hair. And Torou dons the femme fatale look with her long brown hair, nice figure, large earrings, long skirt, and white boots.\\n\\n\r\nAdmittedly, there are a few hiccups. The rocking of the characters in the boats during the whirlpool pursuit was not handled with care. And Shirayuki’s smile as she spins in the opening track’s visuals makes her look more goofy than cute. But the rest of the art and animation make up for these small grievances.\\n\\n\r\nCHARACTERS\\n\\n\r\nInterestingly, the anime does not place too much focus on Shirayuki’s and Zen’s characters. Instead, most of the attention goes to two other people: Raj and Obi.\\n\\n\r\nRaj was the prince from the first season who initially tried to steal Shirayuki back after she ran away from his snobby eyes. When he later visited Clarines, he was scared out of his mind given his promise to Zen to never see Shirayuki again. These characteristics, snobbishness and courage, are what the anime targets for this season as well. But rather than inflating them further, the goal is to reduce them.\\n\\n\r\nTo this end, Raj invites Shirayuki to Tanbarun. Part of it is a test for Shirayuki and Zen on Izana’s behalf – to see if Shirayuki can successfully prove her worth and hence her (in Izana’s eyes) compatibility with Zen. Part of it is to see Shirayuki’s compatibility with Raj. And the biggest part is Raj wanting to mend his relationship with Shirayuki regardless of the feelings involved.\\n\\n\r\nThus they learn more about each other during their time together. Shirayuki learns of Raj’s violin skills as well as willingness to better himself. In turn, Raj learns of Shirayuki’s trust of others and of her thoughtfulness which she uses with everybody.\\n\\n\r\nRaj’s younger siblings have kindhearted intentions with their meddling, but Shirayuki and Raj both understand that they do not love the other as lovers but rather as friends. Where their relationship was once in a rocky spot, it is now exactly where they want it to be.\\n\\n\r\nThe culmination of their time together was originally supposed to be their dance at the ball, but, when Shirayuki gets kidnapped, Raj finds himself needing to test whether or not he has left behind his snobby and fearful days of old. That is, he needs to prove whether or not Shirayuki has left a lasting impression on him.\\n\\n\r\nAnd prove he does. He opts to join the horseback chase after the Lions of the Mountains. He makes a personal appearance before his people, pleading for their aid in his time of need. He leads the charge after the Claw of the Sea, declares his friendship with Shirayuki for all to hear, and courageously carries his men through the raging whirlpools. All choices that demonstrate Raj has changed for the better.\\n\\n\r\nAfterwards, he and Shirayuki finally do have that dance (with the music Shirayuki had pointed out at an earlier point), but, to reiterate, this send-off is not the highlight. Instead, it comes with the necklace and official decree of her new title: “Friend of the Crown.” The letter Raj writes for Shirayuki is kind, reflective, and sincere, indicating without a doubt that Raj is finally the kind of prince, the kind of person, that Shirayuki always knew he could be.\\n\\n\r\nNext to Raj, Obi is the other prominent character. The first half of the split-cour initially had him as an enemy of Shirayuki and Zen. Very quickly, he finds himself working for his new master Zen, and he also finds that he has some feelings for Shirayuki himself.\\n\\n\r\nNear the start of this second half of the split-cour, Obi is still in the same spot. When Shirayuki must go to Tanbarun to prove herself, he duels Zen for the honor of accompanying her. Obi surprisingly wins – giving him the chance to also prove his worth to Shirayuki.\\n\\n\r\nObi has generally looked over Shirayuki from afar, but this opportunity allows him to look over her while afar. He behaves the same, too. He guards her, tracks her whereabouts, and escorts her when necessary.\\n\\n\r\nYet when she needed him most, he fails. The (first set of) kidnappers arrive with impeccable timing, defeating Obi and stealing Shirayuki. He did not prove his worth. Whether it was because of his feelings for her or because of his pride, it does not matter. All that matters is that a switch flicks on within Obi – and anger brims forth.\\n\\n\r\nHe finds one of the kidnappers, the glower on his face indicating easily enough his current mindset. When Zen finds him, though, he gets scolded by Zen. Not for losing Shirayuki but for making Zen worried about him, too. This small interaction sets the seed for his eventual weening.\\n\\n\r\nFor that’s a major motif of Obi’s character during this season of Akagami: weening away his deeper feelings for the red-headed girl. Zen’s trust in Obi affects Obi since it is something he is not used to. Shirayuki (after being rescued) asks him to continue helping her, simultaneously easing his mind about his failure and indicating the kind of relationship they share (i.e., a friendly one, not a romantic one). And the episode afterwards, where his friend from the past reappears, allows him to understand that he likes the friends he has in the present and does not want to lose in the future.\\n\\n\r\nThe culmination of his character comes when he gets Zen away from Mitsuhide’s overprotection. He encounters Shirayuki but leaves her to get Zen, indicating his newfound outlook on himself and the group he cares for.\\n\\n\r\nBoth Raj and Obi highlight a specific theme among the characters: understanding one’s self and where one wants to be personally.\\n\\n\r\nThe story targets something similar – the idea of one’s home – but that is more physical. This theme is more mental. Raj confronts his shortcomings. Obi learns about what he truly cares for. Shirayuki and Zen know they want nothing else but each other. Even Mitsuhide and Kiki learn about themselves – Mitsuhide and Kiki care for their prince and, more than implied, one another.\\n\\n\r\nSpeaking of Shirayuki and Zen, they feel the negative effects once again of not holding the spotlight. Shirayuki does grow in terms of proper ladyship, but she has always been confident and determined, so the change is more minor than major. Plus, the longer conflict has her (once again) getting dragged along against her will. She has to wait for everyone else to rescue her rather than her rescuing herself – a lost opportunity.\\n\\n\r\nZen gets it even worse. Obi takes his spot for the major conflict, and, once back home, his biggest change is not averting his older brother’s gaze. Weak. At the minimum, his actions and words make it more than known that he loves Shirayuki. Even if their relationship is not as official as it could be.\\n\\n\r\nThe other side characters are a toss-up. Kazuki’s defection does not have much exploration but his role as homewrecker works. Prince Izana only commands and laughs, but he forces the characters to act. And both Mitsuhide and Kiki do not have their own romance blossom, but it was appreciated that they got some attention after almost two whole seasons of nothing.\\n\\n\r\nAltogether, the cast is filled with positives and negatives that ultimately balance one another out.\\n\\n\r\nSOUND\\n\\n\r\nThe opening track is leveled in its approach. The start is slow with the singer and instruments working at a methodical pace. The halfway point builds up the emotion, giving way to a second half that is slightly faster and slightly loftier. Not a lot; just a tad. Weirdly, the piece comes off as simultaneously grandiose yet not-quite-so, leaving it in a less-than-ideal spot. No matter how fairytale-esque it may be.\\n\\n\r\nThe ending track somewhat follows in the footsteps of the OP, but it picks up the pace a bit earlier. It still has the same leveled tone, but the ED is more of a happy piece than it is a fairytale one. The final held note from the vocalist proves her strength, but the entire track leading up to the end lacks emotion and power – details that a single strong note could not hold up.\\n\\n\r\nSandwiched between the OP and the ED is the rest of the original soundtrack. Luckily, it contains the same lovely tracks from the first half of the split-cour. Dainty tunes, magical ensembles, and romantic arrangements come together to make Shirayuki’s second tale feel like a fantastical story once more.\\n\\n\r\nAs for the voice acting, it sits somewhere around average once again. Saori Hayami as Shirayuki and Jun Fukuyama as Raj deserve the only shout-outs. Ms. Hayami’s soft way of speaking and Mr. Fukuyama’s frazzled yet determined voice help to make the characters stronger than they would be otherwise.\\n\\n\r\nENJOYMENT\\n\\n\r\nLike many anime for me, this one was somewhere in the middle.\\n\\n\r\nThose first seven or so episodes, while containing spurts of romance or other such happiness, were not the most entertaining. Relegating Shirayuki and Zen to more of a side role, and thereby reducing the amount of overall time they spent together, was not favorable. The action was not all that impressive. Umihebi and Kazuki were not interesting characters regardless of their respective affiliations. Raj and his younger siblings were thankfully around to make these duller parts more entertaining.\\n\\n\r\nI also was not a fan of the anime (still) thinking about the Obi route. Not that he did anything overt. Just the long bout of subtleness – the way he looked at her or the words he said – before he made up his mind to back off had me somewhat frustrated.\\n\\n\r\nThe last four episodes, however, were a major delight.\\n\\n\r\nI laughed extremely hard at Shirayuki’s dad yelling immediately after Zen declared his feelings of love for her. I half expected a response of that nature, but the quickness and loudness of his response made me laugh uncontrollably.\\n\\n\r\nMitsuhide’s specific episode was a lot of fun, too. Especially when he accidentally knocked Kiki over. He grabs her waist and hand as he speaks gentle words in her direction. But it was Kiki’s absolutely disgusted response (“Huh?”) and expression that had me laughing hard. Obi’s own stifled laughter was a bonus.\\n\\n\r\nMitsuhide getting visibly angry (in a comedic way) when Obi brought up Kiki getting approached by other men. Zen’s intimate moment with Shirayuki in the garden and up atop the tower. Kiki not denying Obi’s (incorrect) recount of what Mitsuhide said (about her being the most beautiful woman in the world) while he was delirious. All funny and likable moments.\\n\\n\r\nI am talking about Kiki and Mitsuhide so much because I wish the anime would have made their more-than-obvious romantic pairing more definitive. But I suppose that will have to wait for another season sometime soon.\\n\\n\r\nAkagami no Shirayuki-hime 2nd Season is not an amazing anime, but it does do a lot right. Character development for a couple of the members of the cast. A purposeful narrative structure. Nice comedy, art, and music too. Unfortunately, the forced separation of Shirayuki and Zen has a ripple effect across the entire show. They say an apple a day keeps the doctor away. Or one can just use this anime as a supplement instead. Maybe.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, a quirky narrative structure, a theme on home, and other problems (inherent or not) balance everything out in the end\\n\\n\r\nAnimation: Great, colorful artistic direction, above average actual animation, and nice character designs\\n\\n\r\nCharacters: Fine, Raj is great, Obi is good, and the rest either serve their role or needed more but never got it\\n\\n\r\nSound: Fine, okay OP, bad ED, great OST, okay VA performances\\n\\n\r\nEnjoyment: Fine, a less-than-fun first two-thirds gives way to a more-than-fun last one-third\\n\\n\r\nFinal Score: 6/10",
            "date": "2017-05-29T13:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 248817,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=248817"
        },
        {
            "content": "\"Red is the colour of Fate\" \r\nIt is very rare that when I start watching a show that by the time I finish both seasons I find myself thinking, \"that ended perfectly and I honestly hope for no more seasons\". Akagami no Shirayuki-hime was one of those shows that sticks with you like a hot glue gun sticking to your skin. Except a lot less painful, as you would actually enjoy watching this show. I hope you understood my metaphor. TL;DR - this show sticks with you\r\nThe story continues from the last season (obviously) and is executed well--if not better than the first season--making itenjoyable to watch. The art is phenomenal (as is the sound) resulting in a very calming show to sit down and watch on a lazy weekend. The characters stay much the same, as is mentioned multiple times by the characters as to show that not much has changed.\\n\r\nThe only exception to this would be Raji, who gets his own character arc for a while in this season, making him one of the main characters. \\n\\n\r\nThe show easily gets a recommendation from me and is one of my favourite romance animes, making it a real shame that I originally dropped Akagami no Shirayuki-hime after episode 3 when it was first airing due to how slow it originally felt. I'm glad I picked up this title again because I would've severely missed out if I'd not continued watching it.",
            "date": "2016-08-13T19:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 226676,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3819739.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PlaceFantasy",
                "username": "PlaceFantasy"
            },
            "url": "https://myanimelist.net/reviews.php?id=226676"
        },
        {
            "content": "Akagami no Shirayuki Hime   review\r\nThe story  is simple and follows a slow and natural pace in developing a romance story between Shirayuki and Zen.\r\nThe anime focuses on aspects like bonds, trust and the encounter  with different people and how those encounters change us and the world around us.This is all done with the help of the characters which the show manages to use them properly to execute its plot and story.\r\nThe romance story in this anime is not rushed at all , the development is done at  a steady and natural pace . At first we are shown how thebond between two people is founded with the help of the red string called fate. It’s the meeting between our two main characters Zen and Shirayuki who are brought together by the red string (fate). After that the show focuses  on enforcing that bond , everything is done naturally  giving proper reasons why those two care and fall for each other. Finally to put a strong mark on their bond and romance everything is settled with a kiss which is the strongest proof of their love for each other.\\n\\n\r\nThe main purpose of the story is to tell  the viewer about the importance of the encounter with different people and how it  influences them  and the world around us. This is done with the help of our heroine Shirayuki , which along her long path to become a royal court  herbalist she encounters different people and obstacles. She overcomes those obstacles with her own strength , and her different encounters leave a strong mark on people. She finds pieces of puzzle of her identity through each encounter learning about her weaknesses and strong points.\\n\r\nThe anime portrays the value of bonds and trust between humans and delivers a strong message to the viewer with the help of Zen and his trusty retainers. The anime takes his time and shows the characterization of Zen’s retainers  and the strong bond that it’s formed between them. It’s a unique and mysterious and  can’t be described by  words ,  silly and simple and  defies logic , it’s something that you can’t buy with money, yes we all know and experienced it daily it’s called  TRUST.\\n\\n\r\nAnother strong point for the anime is how it uses the simple details for the execution of the plot and characterization. Those simple details are used to craft the details and personalities of the characters and to portray their emotional state and mindset across the encounters they have with each  other.\\n\\n\r\nThe characters are the firm foundation for the anime. They are well written  and all the themes and plot revolve around their encounters and influence across the story.The way the anime handles the minor characters and their development for the purpose of the progression for the story and plot is marvelous done. Each detail and aspects is not missed and used to enforce the atmosphere and emotional state  for the story and characters.Also the characters portray a strong message for the viewer and a motivating one too like pursuing your dream, hardworking, relying on friends,  overcoming the struggles that life brings us, trust, the importance of bonds and encounter.\\n\\n\r\nThe anime has one of the most beautiful ost and stunning peisage that  captivates the mind and soul of the viewer. The beautiful music and atmosphere crafted with the most subtle details draws you inside of the story  and helps you relax your mind and soul after a hard day.\\n\\n\r\nIn conclusion the anime portrays the value and importance of encounter, the mysterious and red string called fate, the bond of trust between people, the goal and purpose of a dream and how hard you need to work to achieve it all in a beautifull and yet simple romance story with stunning, captivating ost and peisage.\\n\\n\r\nOverall 8/10\\n",
            "date": "2017-05-10T05:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 247353,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4494322.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kokuborou",
                "username": "kokuborou"
            },
            "url": "https://myanimelist.net/reviews.php?id=247353"
        },
        {
            "content": "Although I absolutely adored the first season of Shirayuki, I must admit for the first few episodes of season 2 I couldn't decide whether I liked it as much. At first, I felt a little bit like the show had lost some of its magic... and maybe it was because Zen and Shirayuki were apart for a while, maybe I just didn't enjoy the plot arc quite as much... I don't really know. But, it didn't really take away from my score too much, as it seemed to pick up for me again after I made it through the first 5 episodes or so, andonce again I fell in love with this sweet story <3\\n\\n\r\nFirstly, I have to comment on the art again. I just love it. I think it might be the most beautiful style of anime art that I've seen. It's so colorful and detailed without being over the top, and it really adds to the magical, fairytale feel of the show.\\n\\n\r\nAs for the story, like the first season, it's really nothing original. But to me, fairytale romance almost never gets old, unless it's just blatantly cheesy to a ludicrous extent. Starting off with this season I was not a huge fan of the whole thing with Obi and Raj suddenly showing feelings for Shirayuki. Not that I necessarily have a problem with harem or reverse harem or whatever, but for this show the idea wasn't working for me. Luckily, that whole fiasco wasn't shoved down my throat or anything, and ultimately didn't become a main plot device. Thank heaven.\\n\\n\r\nCharacter-wise, I like just about all of them. Shirayuki and Zen are both great in my opinion. Like last season, Shirayuki is kind and gentle, but also intelligent, resourceful, and strong-willed. I've always thought she was quite a human character, one with different sides to her, but nothing drastic like a sudden fit of violent anger as shown in a lot of anime. She experiences many emotions, happiness, sadness, frustration, etc... and I like that about her. Zen is also pretty awesome. He's like the ultimate prince charming, but better, because he has a personality. He tries to act smooth and confident, but even he gets flustered or upset at times. And his love and devotion for Shirayuki... simply swoon-worthy. Speaking of their relationship, I just thought I'd mention that I appreciate how the two of them actually talk about things. Any time there is an issue, they actually discuss it like normal people in a relationship are supposed to do, which is something I don't see all that often in anime. Usually, misunderstandings build up until someone explodes for no reason and then there's unnecessary conflict that could have been avoided... luckily, Shirayuki and Zen are mature enough to handle the bumps in the road with grace and dignity.\\n\\n\r\nI also liked the other characters, many of whom got some more development this season. I like both Kiki and Mitsuhide, who are both awesome and very loyal friends. Obi's an interesting character as well, and I thought it was cool to get a glimpse of his past. I'm hoping to see more of that in the future, perhaps if I read the manga. And even Prince Raj, holy snap... he was such a scum bag in the first season, and yet he somehow grew on me. Amazed.\\n\\n\r\nI think the only character I don't like is Zen's brother... partially because I don't get what his deal is. I find him a little disturbing at times, and it almost seems like he just, for no reason, finds some kind of enjoyment out of messing with Zen and Shirayuki in twisted ways. He just... creeps me out.\\n\\n\r\nIn any case, I really loved this show. The whole thing, both season 1 and 2. Even if this one took me a couple episodes to get into it, I'm still glad I watched it and I think this series will forever have a place in my heart. It will definitely be my go-to in the future for days when I'm feeling sad. Sigh... don't we all wish we had our own fairytale romance?",
            "date": "2016-04-23T22:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 217008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/snowflower234",
                "username": "snowflower234"
            },
            "url": "https://myanimelist.net/reviews.php?id=217008"
        },
        {
            "content": "This review contains spoilers.\r\nBones is one of my favorite studios, but they're a bit hit-or-miss-- they're behind the sublime Eureka Seven and Tokyo Magnitude 8.0, but they also delivered flops (or extremely niche works) like Captain Earth, Star Driver, and Eureka Seven AO. The first Snow White series they produced was pretty good, a rather straightforward \"modern fairy tale\" that lacks the depth of their greater productions.\r\nShirayuki is one of my favorite heroines in recent memory. Rather than rely on merely \"cute\" appearances, she's a character who not only does exactly what she thinks is right, but she applies her brain when she has aproblem to solve-- a bit of a girl MacGyver. Season 2 doesn't focus on her quite so much, because there are 2 antagonists from season 1 who need to be redeemed. Well, I don't know about \"need', the creators could've dropped Raji and Mihaya off the face of the planet and I doubt anyone would've cared, but clearly turning these into \"good guys\" was something of a priority-- the point being, going up against Shirayuki made them reconsider their life choices and try to be better people. Additionally, the production also wanted to develop Obi further (great idea) and give Zen more \"hero time\" (meh).\\n\\n\r\nThis decision came at a bit of a cost to the character of Shirayuki: this time the story, for realsies, put her in a \"damsel in distress\" position, and even her mad botany skills weren't enough to get away from Yet Another Bond Villain. To be fair, the principal antagonist of this arc wasn't quite as one-dimensional as the villains from, say, Akatsuki no Yona, but she was only really needed for a couple of episodes, so deep complexity wasn't in the cards.\\n\\n\r\nOne problem I had with this particular arc is that we never got to know the first captor before, (spoiler) plot twist, Shirayuki and captor are both kidnapped. Sure, we heard his backstory later, but this is a classic \"telling the story rather than showing it\"-- Bones would've been much better off _animating_ that backstory, even as a series of stills, rather than having a couple of guys tell it over lunch. As a result, the emotional investment in seeing him captured/rescued is chained to the investment in seeing Shirayuki in the exact same situation. Second, while this is a terrific redemption arc for Raji (Mihaya, not so much), this plot arc serves as little more than an excuse to have them led by Zen into a daring rescue. After having killed off her one great attribute for the sake of the situation (her brain), at the end she's reduced to a crying, rescued damsel-- contrast this to Akatsuki no Yona, where in a very similar situation, Yona is absolutely critical to the success of the mission and even delivers the killing blow herself. Why isn't Shirayuki at least chucking tear gas powder at the pirates in the climactic scenes?\\n\\n\r\nThe added story time given to Raji in this season yielded a number of good moments-- my favorite is by far the improvised navy scenes, where he not only comes up with a \"navy\" made mainly of merchant ships, but also makes up orders and proclamations in his quest to help rescue Shirayuki. While his leadership is far more luck than skill, it demonstrates the value in at least making a valiant attempt with a heart in the right place, even if one is a complete noob (and yes, I totally understand that this isn't how this works in the real world). Similarly, Obi got a few really good development scenes showing that under the light-hearted \"thief\" archetype, there's a fierce killer underneath.\\n\\n\r\nThe closing episodes are... a bit lacking. Two sitcom episodes involving Kiki and then Mitsuhide, then an episode where Shirayuki decides she wants to be with Zen. I would've expanded the finale into an OVA or movie, but that's just me.\\n\\n\r\nOverall, a good sequel to an already good non-magical fairy tale. Good redemption story for Raji, but at a cost to Shirayuki's best attribute.",
            "date": "2018-07-22T23:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 284565,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2367307.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/earl_of_sandvich",
                "username": "earl_of_sandvich"
            },
            "url": "https://myanimelist.net/reviews.php?id=284565"
        },
        {
            "content": "ENG: the second season is still good and with the same technical qualities of the first season. However, the main storyline becomes more monotonous and without major challenges to be overcome by the main characters of the anime. The supporting characters continue to be charismatic, but there are no major developments that have already been seen in the first season. At least the romance and the drama around the protagonists remains very cool. Unfortunately, the anime ends with a season without great emotions (compared to the first season), besides that, the ending leaves half-open plot to continuations.\r\nPORT: a segunda temporada se mantém no geral boae com as mesmas qualidades técnicas da primeira temporada. Entretando, a história principal passa a ser mais monótona e sem grandes desafios a serem vencidos pelos personagens principais do anime. Os personagens coadjuvante continuam sendo carismáticos, mas não há grandes evoluções do que já foram vistas na primeira temporada. Pelo menos o romance e o drama ao redor dos protagonistas continua sendo bem legal. Infelizmente, o anime termina com uma temporada sem grandes emoções ( comparando com a primeira temporada), além disso, seu final deixa a trama meio aberta a continuações.",
            "date": "2018-07-06T21:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 283164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Theusnew",
                "username": "Theusnew"
            },
            "url": "https://myanimelist.net/reviews.php?id=283164"
        },
        {
            "content": "A really good sequel that expands upon the characters in the first show.\r\nAs always, I love the dynamics between Shirayuki and the men in her life. They all fall for her a little, and she ultimately changes the people she meets for the better and builds lasting friendships. \r\nI enjoyed seeing Raj and Zen grow up in this show. Of course Zen was always nice, but I really feel like in this show he demonstrates the maturity that he needs to be able to keep up with Shirayuki. \r\nThis show is funny in that almost every villain (with the exception of Madame Sea-Snake) ends upbeing influenced by Zen and Shirayuki and changing their ways. It's really quite heartwarming. Case in point: Raj. In trying to earn Shirayuki's respect, he ends up earning the respect of the others around him and learning to be a better prince and person. (His randoms snaps are still hella annoying, though)\\n\\n\r\nJust a nitpicky thing: with all the time Shirayuki spends around trained soldiers, you'd think one of them could teacher her some self-defense!\\n\\n",
            "date": "2017-08-24T18:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 256199,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6397541.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/nekonekonekochat",
                "username": "nekonekonekochat"
            },
            "url": "https://myanimelist.net/reviews.php?id=256199"
        },
        {
            "content": "I'm sad but I 'm hopeful that we do get a third season of this show because this is something, a lot of people need to see. \r\nStory: As for a story, it a continuation of the first season. I loved the story, but their was one  story line (that I can't say which one because of spoilers). The story is great but it  a 9 with that story line. \r\nArt: The art is basically the same nothing really special.  You have your very cute art so that why I give the art an 8. \r\nSound: We did get a new intro,and ending and honesty I loved both of them.  It an improvement from the last season, and the ending I feel was very well done. As for Dub, and Sub I watched it Dub (like the first season). You have the same set of VA who did the voices. Austin Tintale was the outstanding role, and I always say that with anything with him in it. The sound is a 9. \\n\\n\r\nCharacters: Now for the characters I gave it a 10 on season 1, but it an 8 now. I think through the one time that the story line happened, it made me hate some characters (even the ones I was supposed to hate). Although it not a bad thing I can still see negative after this season. \\n\\n\r\nEnjoyment, and Overall: Enjoyment value is a 10, I can enjoy my time with an anime like this. The overall value is a 9, I think the story is the main reason because of it, but I still love it (and I want a third season).",
            "date": "2017-02-17T13:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 240772,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4828029.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuna67876",
                "username": "Yuna67876"
            },
            "url": "https://myanimelist.net/reviews.php?id=240772"
        },
        {
            "content": "I just love this so much. I even loved season 2 more than season 1. (I'm really hoping for a season 3 by the way, there's enough source material so yea)\r\nStory: 9\r\nThe story is just great. It doesn't really have this one big storyline but some things from the first season came back (like the Raj stuff) etc. I just simply loved it.\r\nArt: 10\r\nI love the art way to much. \r\nCharacter: 10\r\nThe characters are what makes this anime so great to be honest. Serious characters, funny characters. This anime has them all. The development is also great. Raj who became friends with Shirayuki for example.\r\nEnjoyment:10\\n\\n\r\nOverall: 10",
            "date": "2017-03-27T16:07:00+00:00",
            "helpful_count": 0,
            "mal_id": 243731,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5831912.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 0,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Robin0x",
                "username": "Robin0x"
            },
            "url": "https://myanimelist.net/reviews.php?id=243731"
        }
    ]
]