[
    [
        {
            "content": "So I just finished this show today, and I am going to give you guys (and girls) a rating for each aspect of the show, and then I will give an overall review at the bottom.\r\nStory: 8\r\nThe story was quite enticing, and it always left me wondering what would happen next, and it always stayed true to the main character's goal, Raishin, fighting along side his partner, Yaya. There were really no filler episodes, as each episode had some sort of meaning or foreshadowing that led into future episodes. There was also a lot of action, and the fighting scenes were very well done andportrayed Raishin's abilities very well.\\n\\n\r\nArt: 9\\n\r\nNot much to say here, I just loved the art in the show. It looked very new and refined, the colors were very good, but the only issue I would have is that the \"3D\" look of the dragon, Sigmund, got a little funky sometimes, but it wasn't a huge issue. Very good, better than expected and looked very new.\\n\\n\r\nSound: 8\\n\r\nThe sounds were amazing in this show. It had it's own effect for each puppet/character, and it gave the show and the characters a really unique feel. Sometimes there would be parts in fights where there was minimal sound with a lot going on, but it was made up for with lots of other fighting sounds in other fighting scenes, along with regular sounds in just normal scenes.\\n\\n\r\nCharacter: 8\\n\r\nMainly all of the characters were very well developed, and each character had their own unique sense to display who they really were. We got a lot of backstory on all of the main characters like Charl, Frey, Henri, partly Yaya, and a good amount of Raishin. My only complaint would be that I wish there was more backstory on Raishin, because even though his background DOES affect the plot quite a bit, I wish we got to see more about it other than this one specific scene that happens a few times over. Not a major thing though, as it still made his character very well developed. I won't go into too much detail about each character as I don't want to risk spoiling or ruining the experience for anyone. However, I CAN say that it is a someone romance/harem kind of aspect a good amount of the times that aren't during fights. It doesn't ruin the show for me, honestly, because it is made up with the main character not wanting to be a part of a harem, and also with all the fighting scenes and the main characters insane brains to get himself out of any situation.\\n\\n\r\nEnjoyment: 8\\n\r\nI really enjoyed watching every episode. There were no fillers, so you can watch each episode with reassurance that at least SOMETHING that happens will eventually be brought up in the next episode. I really loved all the characters, especially Yaya, and they just made the show that much funnier and more action packed.\\n\\n\r\nOverall: 8\\n\r\nOverall, this show was a very fun show to watch. Every episode had some meaning to the plot, it always had lots of funny moments, but it knew how to transition to action and more serious scenes quite well. The show really stood out to me, as it was quite different from other shows I've seen, and it really was a blast to watch. I loved watching each character interact with each other, some jealous, some more Tsundere, along with all the plot and development. In the end, it all came together for an amazing show that I REALLY hope will turn into a season 2. Fantastic show, I would definitely recommend watching it if you are into: A powerful main character (not OP), a romance/harem (not what the story is mainly about, but still present quite often), a whole bunch of unique characters, and comedy that happens all over the place. \\n\\n\r\n**Thank you for reading my review, and let me know if there was anything I could have done better, this is my very first review!",
            "date": "2014-05-04T06:53:00+00:00",
            "helpful_count": 218,
            "mal_id": 142303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3742865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ikuaya",
                "username": "Ikuaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=142303"
        },
        {
            "content": "I'm a benevolent and tolerant guy, but there are three things I simply can't stand...\r\nPeople who order me around\r\nPeople who oppose me, and...\r\nA complicated plot that is in need of more explanation!  \r\nStory: 5\r\nThe main character, Raishin, is on a quest to revenge his family and kill the person who wiped out his clan.  We join him as he enters a school of some sort and his adventures as he helps out fellow students in trouble. \r\nThe problem with the story is that they left out small details that either would have helped explained certain plot holes (Such as why Yaya had toturn off her invisibility) or complicated arcs such as the Loki and Frey arc.  Both Cher's arc and the Loki and Frey arc both involved types of politics and relationships that weren't fully explained and left me clueless on why Raishin was helping.  The pacing for the series was also fast, the time frame of what was a couple of days to what was a couple of minutes are never shown right, and when combined with the lack of knowledge led this story into a train wreck.  \\n\\n\r\nArt: 8\\n\r\nThe art was very good.  The scenery looked nice along with character designs.  I loved how the characters would look when they faced left or right.  The use of CG for this series allowed for smooth animation on almost everything, except for certain action scenes (This is the opposite of what Ars Nova did with CG)\\n\\n\r\nAction scenes weren't bad, but there were times in where character movement and animation did not look as well as other parts of fight scenes.  A great example would be the fight with Loki, as certain scenes had Yaya and Cheribum looking epic, but other scenes were very confusing.  If they slowed down the fight scene and didn't use as many different angles when showing the fight scene, this problem would be solved.  \\n\\n\r\nSound: 10+\\n\r\nAnicca, the OP is a great set up for the series.  The song has a very soft start and leads to a metal guitar riff.  What more could help set up the plot where puppeteers use puppets to fight each other, since most puppets are machine like.  The ED is by far the best ED to come from the fall season, Maware! Setsugetsuka.  It may be because I have a soft spot for traditional Asian themed songs, but this song is cheerful with a very catchy beat.  The ED alone awarded this series a 10 in sound.  \\n\\n\r\nBackground music was there to fit the mood, no complaints.  \\n\\n\r\nCharacter: 9\\n\r\nA place where this anime shines is in the characters.  All the characters looked amazing as well as had interesting personalities.  One of the few things I did get from the story was enough history for each character to have them be memorable.  Some of the best characters include; Yaya, the comedic yandere, Loki, the rival who hates more than three things, Frey, the girl with a small personality but a set of big brea... I'll stop.  These characters were very humorous and enjoyable to watch.  \\n\\n\r\nWhat about character development?  There is none that I noticed in the series, maybe small amounts when it comes to Frey and Loki, but nothing involving the main characters.  Is this a problem?  I will answer with another question, why change characters that were excellent to begin with?  Raishin and Yaya are blessed to be amazing characters from the very start and did not need character development.  \\n\\n\r\nEnjoyment: 6\\n\r\nAlthough the sound and characters were amazing, the story left me so clueless that I was partially bored during all the serious scenes and most of the action scenes.  \\n\\n\r\nAlso, what was Raishin's power involving Yaya?  Were they all different buffs or allowed different abilities involving Yaya?  I wish they had explained that, as it would have led to less confusing during the fight scenes.  Being ignorant of ones ability that is used a lot doesn't make for great fight scenes.\\n\\n\r\nOverall: 7\\n\r\nThis anime had my head do what the ED's chorus says, maware (Spin).  With such great sound and art, even great characters, the story was too poorly put together to enjoy all the other things this series did right.  Hopeful for a great season two.  \\n\\n",
            "date": "2014-01-04T18:02:00+00:00",
            "helpful_count": 105,
            "mal_id": 127233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zelot",
                "username": "Zelot"
            },
            "url": "https://myanimelist.net/reviews.php?id=127233"
        },
        {
            "content": "You know what makes someone the best? Wearing a crown and calling themselves a ‘king’ doesn’t make someone the best. No. What makes someone the best is to prove themselves in front of the whole world through hard work, determination, skill, intellect, guts, and earn the respect from their peers. At rank #1235, Rashin Akabane is far from the best. In fact, he’s close to the bottom pit of the fall outs. But for him, there’s nothing more he’d like than obtain the title “Wiseman”. Such a pretentious title is equivalent to those of a king and is the ultimate goal of a puppeteer.\r\nMachine-Doll waKizutsukanai (aka Unbreakable Machine Dolls) is an animated series based on the light novel of the same name written by Reiji Kaito. The series takes place in the early 20th century in an industrial-like world. Rather than producing cannons and gunpowder though, there exists an emergence of a power known as Machinart – a fusion of magic and technology applications. The series follows Rashin and his automaton Yaya as they go on a journey of both endurance and vengeance.\\n\\n\r\nKinji Yoshimoto is the director where he previously had experience with fantasy theme series such as Quee;ns Blade and Dog Days. Here, he is in charge of a fantasy theme series that molds the themes of magic and science. Upon first impressions, it’s easy to tell this show would fall under the typical fantasy/battle shounen style with the tournaments to prove one’s worth; and you’re not wrong if you think so because the show does depicts itself that way. However, a primary motivation for Rashin to become Wiseman is more than simply be the best. He is also on a quest for vengeance because of his tragic childhood.\\n\\n\r\nGrowing up as an orphan, Rashin can be best described as a brash and hotheaded young man. He joins Walpurgis Machinart Academy to not only make a name for himself but to also find the culprit behind his family’s murders. It ventures into the mystery zone on a variety of occasions as Rashin also plays the role of an anti-hero. His sidekick is the all adorable and automaton Yaya. Unlike most automaton, Yaya looks like a human in a variety of ways. This is likely because of Rashin’s past where his childhood has a strikingly resemblance to her.\\n\\n\r\nYaya portrays the role of an automaton, a weapon of war but also surprisingly shows many human emotions. This is usually evidenced by her aggressive behavior towards Rashin that borders on obsessiveness. For Yaya, Rashin is her raison d'etre for existence. Throughout the series, it’s shown that her feelings for Rashin is genuine. Whenever his life is put into danger, Yaya would rush into the front lines of danger disregarding her own safety. Of course, this doesn’t always end well because the threats that their opponents pose. And as a normal human, Rashin has to work his way up. Unlike some of the other characters in the series such as Loki, he must prove to others that even a failure can surpass a natural genius. This puts himself on a frustration scale as we witness his struggles. On many occasions, he questions himself if he is worthy of being Yaya’s puppeteer or even a student at the academy. He hopes to not repeat his mistakes and become a master worthy of his partner. And because Rashin is not the typical Gary Stu character with plot armor, he isn’t invincible nor a superman.\\n\\n\r\nDespite the duo’s seemingly good relationship, there’s a variety of problems between them. Most of this is presented in a comical form as Yaya takes the role of an overly obsessive character. While not technically a yandere, she is infused with jealousy whenever a girl even comes into contact with Rashin. Regardless of age or appearance, Yaya simply cannot stand Rashin ever becoming acquainted with another member of the opposite sex. A seemingly flaw of this series shows that Yaya lacks a real personality in this way because of her one sided admiration and love for Rashin. The latter treats her affections with disgust and reluctantly tolerates her advances on rare occasions.\\n\\n\r\nThe themes of magic and technology is a prominent aspect that is explored. The mechanics behind Machinart is explored on occasions although some parts are left in unexplored territories. Instead of telling though, the series presents them with other puppeteers in action. Among some of these including 2nd year Charlotte Belew, the clumsy Frey, the prodigy Loki, and mysterious Magnus. Throughout the series, each of them demonstrate abilities of a puppeteer at various skill levels. Most of them seems to have some sort of objective as to why they are also at the academy while others lacks a true motive. At the apex of its story, we witness an event that is motivated by a grim threat targeted to one of the puppeteers. Although the mystery is not a genre of this show, there come times when the academy becomes entrenched with suspicions that touches on cases of murder. It becomes intriguing to watch because of the standards involving red herring comes into play with false leads and suspects. It’s not as predictable as some might think as viewers will be able to indulge on the movement of the story.\\n\\n\r\nUnfortunately, the series’ story pacing feels peculiar on various occasions that looks typically rushed. There’s a lack of characterization involving its cast including Rashin. His past is only briefly glanced upon on various occasions but rarely discussed in full details. While supporting characters such as Charlotte gets more of their past unraveled, Rashin’s backgrounds are vague and is only motivated by vengeance. Thus, characterization feels a bit shallow in this series. Most of the main supporting characters only get some spotlight while others are colored with generics such as the constant apologizing or androphobia. They lack personalities such as Charlotte, Frey, and Yaya. Even more so, there are characters that are introduced on particular episodes with little depth explored on them as well. Being a one cour show, character development suffers on various degrees. There’s just little emphasis on most of them. While the series avoids the breather episode (onsen, beach, etc), there’s bits of fan service that seems out of place. Yaya plays the central role of this as she showers Rashin with affections and attempts to act like his “wife”. The result is usually a scolding on the receiving end with neither party getting satisfaction. Rashin is just one of those guys that are too focused on their goals to care about pity ideas such as love. In fact, the romance of this series is blend and hollow. Don’t expect any development in the romance territory at all. This isn’t a love story of a hero trying to save their princess.\\n\\n\r\nThe art style of this series is peculiar. It may take a bit to get used to because of its lavish brightness and mechanical like coloring. Most characters in the series are generic in particular Yaya and Charlotte. Other characters such as Shouko and Frey reveals more cleavage than should. Thankfully, most of the automatons have diversity. None of them look similar but instead gives off a unique appearance that can be noticeable. However, the action scenes sometimes seems out of space with its usage of CGI and special effects. On the other hand, backgrounds fits the setting well for its time era with its stylish architectures giving off its old English look.\\n\\n\r\nSoundtrack wise, the series is tolerable and at times stands out above others. However, some of the voice actors and actresses’ role as the characters can be a bit frustrating to endure. Yaya’s VA Hitomi Harada plays her role well but it’s a hardship to deal with her obsessive nature. Charlotte’s tsundere like voice can also be frustrating while most of the other characters’ tones hardly stands out. The OST achieves satisfaction with its pacing and matches its tones well, in particular action scenes. The OP and ED songs conveys its theme well. More noticeable is the ED song however that has garnered attention with its catchy tone of ‘Maware, Maware, Maware’.\\n\\n\r\nThis series might seem like an odd ball in the mix but it can hold itself together on occasions. However, don’t expect deep character development or a linear plot of progression. The show sets up itself with arcs but only focuses on its plot points with little emphasis on friendship, romance, or other significant themes of morality. Some stories seems a bit rushed because of its episodes pacing as well. The way to enjoy the show is to probably focus on Rashin’s motives whether it’s his quest for vengeance or goal to become Wiseman. It does portrays its premise well in technical aspects with the mechanics and setting. The tournament itself is not a pivotal factor of this show however. This is because the series also feels obligatory on occasions to pull out clichés with fan service scenes or meaningless dialogues. If it was designed as a comedy, this show would work out magnificently. But since it does have a serious plot, there’s a less reasoning for that. The way Unbreakable Machine Dolls almost is crafted will leave different impressions for everyone.",
            "date": "2013-12-23T15:12:00+00:00",
            "helpful_count": 55,
            "mal_id": 125253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=125253"
        },
        {
            "content": "Oh boy... Where to start? Unbreakable Machine Doll is quite the mixed bag. On one hand it seems to have enough ecchi to appeal to ecchi fans. On the other hand it seems to handle it's fighting scenes quite well albeit with the use of a little CGI here and there. Action fans may enjoy it as well.\r\nStory: 7\r\nOur story takes place in the early 20th century (1900's). Where science co-existing with magic has come together to develop living objects that have their own personalities. Fast forward a few years and the story follows a young puppeteer by the name of Raishin Akabane and hismachine doll, Yaya. The two must work together to achieve the title of \"Wiseman\" at their academy. A sort of king capable of almost anything. The only problem is that due to Raishin's poor grades he ends up in second last for qualifying in the \"battle royale\" out of thousands of students. And only the top 100 students can participate.\\n\\n\r\nThis is a great premise and I was excited to see how it would be executed. Alas the battles while being amazingly animated... End up being no longer than a few minutes. The thing about this season only being 12 episodes is that it has a ton of pacing problems so I can't blame them. Okay, imagine driving down a straight road with a nice fast care. Now imagine that on each side of the road there is the most incredible scenery you have ever seen. Now imagine that the car is slowly speeding up... getting faster, and faster. Before you know it, the lovely scenery has now become a blur of boobs and moe blobs. What was that? Was that just some actual plot? I can't tell. In short, this anime's first season just needed to be twice as long.\\n\\n\r\nArt: 9\\n\\n\r\nOh my Keima Katsuragi... The art is superb. The lighting is handled beautifully. You can actually see time passing as the episodes go on as dusk turns to night and night turns to dawn. The characters look uniquely 20th century-esque. This anime is pure eye candy I didn't even mind the fanservice, and I hate fanservice. But damn... The scenery is just immersing. I actually wanted to be there. The CGI wasn't all that bad, it's barely noticeable but it knocked this score down by 1 point.\\n\\n\r\nSound: 10\\n\\n\r\nThe OP and ED differ so much, but are both amazing in their own aspects. The OP gets you pumped and the ED gets you excited for the next episode... Which was kind of bad... If you followed this anime from episode 1. The OST was immersive, enhancing fight scenes pumping me up. It also handled dramatic scenes quite well, where Raishin had flashbacks about certain past events that I don't want to spoil but the OST definitely helped with me sympathizing with him. I have to say the the art coupled with the Sound is what made this show.\\n\\n\r\nCharacters: 6\\n\\n\r\nThis has to be the show's weakest point. Raishin is a pretty generic MC. His motivation for getting \"Wiseman\" is just a revenge driven plot device. Yaya is his doll that he uses to fight she is outright in love with him for some unknown reason always wanting to either marry, f*ck him, or both. This is a long running joke throughout the series and is kind of funny but gets annoying sometimes. Those are our MC's... I won't talk about any other characters because they are either unimportant or are introduced after episode 1. Just know that every girl student he meets will want his dick for reasons unclear. They are also all slightly moe... Just slightly...\\n\\n\r\nEnjoyment: 8\\n\\n\r\nI enjoyed this show immensely. The art is what kept me and the Music is what left me wanting more. The stage has been set with this first season, so I'm looking forward to season 2. The premise is quite fresh and has to be explored further. Characters were unique except for their shared moe blobness.\\n\\n\r\nOverall: 8\\n\\n\r\nThe only problems I had were the use of CGI and Yaya got annoying at some points with her jealousy over other girls wanting MC'S dick. Still, I loved everything else about this show and I think it is better than most of this season's anime. I dropped quite a few shows but not this one. I didn't really like all the moe but it was bearable to say the least.\\n",
            "date": "2013-12-23T23:01:00+00:00",
            "helpful_count": 26,
            "mal_id": 125321,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3331535.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/R3353",
                "username": "R3353"
            },
            "url": "https://myanimelist.net/reviews.php?id=125321"
        },
        {
            "content": "First of all, let me warn you that this is my first review, so I am not very adept at it. I'll do my best to give an accurate review of this show, though! I will also try not to give any spoilers.\r\nStory: 7\r\nAssuming that you have not read the light novel or the manga (in which case, you would have watched this show a long time ago), the story if fantastic but slightly confusing. The plot revolves around a futuristic world that has created magic through science. However, humans cannot utilize this magic themselves--rather, they use dolls/machines, or automatons, that can use magic fromhumans to perform tasks and battles. \\n\\n\r\nThe entirety of these 12 episodes is focused on Raishin, a boy of a highly prestigious martial arts clan. His clan is wiped out by someone, but as Raishin is on the verge of death, he is saved by Shouko, a doll-maker. Raishin is given0 Yaya, an extremely cute yet slightly yandere girl automaton, until he can fulfill his revenge.\\n\\n\r\nAs you can probably guess, this anime is filled with action and some romantic comedy (Yaya's obsessive nature is quite something, although it's not at Gasai Yuno's level from Mirai Nikki), as you see both Raishin and Yaya's growth at a magic school. Even though Raishin is ranked 2nd to last in terms of intelligence, it is quite enjoyable to see how outstanding he is in battle situations.\\n\\n\r\nNow for the confusion: the plot is extremely fast paced. Meaning, not everything is explained. This anime makes a high priority in setting cliffhangers at the end of most episodes, and as a result, many explanations are left to be too short. They are explained thoroughly in the light novel (or so I hear), but these confusions are not too important, and can easily be found online if you are set on clarifying some things. I would give this anime a 9/10 if it didn't have such confusion, but  because of this flaw this anime deserves a 7/10 for its story.\\n\\n\r\nArt: 8\\n\r\nIs there a need to explain? You can see for yourself if you watch the first 2 minutes of the episode :) Action scenes are extremely well placed, and character designs are simply amazing. The art in this anime is better than most. There were some CG moments where the art looked a bit funky, but other than that the art is awesome.\\n\\n\r\nSound: 9\\n\r\nOh my. The sounds in this anime are simply amazing. The opening is amazing, the endings (yes, there are more than one) are amazing, and the voices are amazing. The action scenes' sounds are great as well. \\n\\n\r\nCharacter: 6\\n\r\nNow this has some problems. I'm sure the anime could have a much higher rating if there was a second season, but for the first 12 episodes, there isn't much character development. Raishin is the daring person who strives to save people, as always. Yaya is obsessive and strong, although we can see a power development in her. Everyone else retains pretty much the same character save for Charl, who has minimal character development as well. However, this does not mean that the characters are not interesting. There are many, MANY points where you find that the characters are more than what they seemed--the author peels the characters one by one, revealing their true natures and powers. This isn't exactly development, of course, but rather an introduction. This is why I regret that there is no second season.\\n\\n\r\nEnjoyment: 10\\n\r\nDespite its flaws, I must claim that I enjoyed this to the fullest. Great art, amazing action, and funny romance/harem scenes made this an extremely enjoyable anime. There are a lot of things to critique, but no matter how much there are I enjoyed this 10/10.\\n\\n\r\nOverall:7\\n\r\nBecause of its bland character development and its slightly confusing plot, I would give this anime a 7. Don't get me wrong though--I highly recommend this anime to any anime lover. If you watch anime for enjoyment (as I assume most people are), this anime will not turn you down! As you can probably tell, I REALLY want a second season for a reason. I hope you at least check this out! \\n\\n\r\nP.S. Please feel free to tell me what I could improve about my reviews. Thanks!",
            "date": "2015-02-16T10:42:00+00:00",
            "helpful_count": 22,
            "mal_id": 180548,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4462028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kateraz",
                "username": "Kateraz"
            },
            "url": "https://myanimelist.net/reviews.php?id=180548"
        },
        {
            "content": "STORY: 5/10 Mediocre\r\nIn truth, I was heavily intrigued by the introduction presented by the first episode. Set in a fantasy world where magic and technology are fused together to form \"Machinart\" - Machine Magic. The core of Machinart is the development of Automatons, dolls made for battle, and our protagonist, Raishin Akabane is one of the many puppeteers out there: the ones who control the dolls, and fight alongside them.\r\nAt first, the plot focuses on Raishin trying to be the \"Wise Man\" by winning the \"Night of Walpurgis\" festival, held by the puppeteer academy he was enrolled into. Originally our hero was driven to beWise Man by the need of vengeance where he vows to kill his brother, instead as the series progresses, Raishin was thrown around into the family feuds, interfering with automaton production in the world, and entering a mess of harem with almost all the girls in the series. \\n\\n\r\nART: 7/10 Good\\n\\n\r\nUnbreakable Machine Doll features plenty of action scenes, and although some of them may be short, all of them are pretty well animated and will not leave action fans disappointed. Some of the character designs are awkward (Shoko and Frey take the cake) and some of the CGI used (particularly Sigmund) feel out of place as the rest of the artwork look so much different, as if two series from different times are put together as one. \\n\\n\r\nThat aside, the British sceneries seen in the series are definitely a delight to see. \\n\\n\r\nMy biggest complaint with the art would be the lower brightness used in the night scenes, my monitor was adjusted to its utmost brightness, yet many of the fighting scenes in the dark are a strain to watch. HD helps a bit, but if the night scenes are a bit brighter, it would’ve been much better.\\n\\n\r\nSOUND: 8/10 Very Good\\n\\n\r\nThe soundtrack is pretty decent, particularly the battle scenes, where I am very fond of the use of string intruments into the theme. The piano tracks used in slower scenes are very nice as well.\\n\\n\r\nOP is pretty average, in my opinion, it’s nothing more than a J-pop song where you can find in a lot of anime openings. ED, however, is probably the catchiest songs you can find this season, and admittedly, one of the main reasons I keep coming back every week. \\n\\n\r\nThe voice acting is fine and nothing much to say here.\\n\\n\r\nCHARACTERS: 6/10 Fair\\n\\n\r\nTo sum things up, Unbreakable Machine Doll has stereotypical characters. Raishin is your typical never-give-up, never-say-die, always-helping-others, putting-others-in-front-of-himself type of wonderful man, at least he’s not protected by some heavy plot shield as he always end up in the hospital. Yaya the “strongest automaton in the world” is so crazy about Raishin, that she would do anything for him, anything indeed. Charlotte happens to be the loner, tsundere and a rather poor decision maker. \\n\\n\r\nThe rest of the cast isn’t particularly memorable, but they tend to act in a certain (awkward) manner, probably in the writer’s attempt to make them stand out more, but that makes them rather unreal as characters. \\n\\n\r\nENJOYMENT: 7/10 Good\\n\\n\r\nThe fighting scenes are nice to see; watching Yaya getting jealous whenever Raishin is together with another female is funny; and the ED is catchy as hell. But ultimately, I feel that the weak and often confusing story and the huge amount of very dark night scenes did take away some of the enjoyment from me.\\n\\n\r\nOVERALL: 6/10 Fair\\n\\n\r\nThis series is far from over, hence the story is also left half-assed. But after watching Unbreakable Machine Doll, I feel as if we are only shown the appetizer, and the main course has yet to be served. Should Season 2 be aired sometime in the future, hopefully more things can be cleared up and we get to enjoy the whole picture. \\n",
            "date": "2013-12-24T05:23:00+00:00",
            "helpful_count": 19,
            "mal_id": 125351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431015.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lord_Odous",
                "username": "Lord_Odous"
            },
            "url": "https://myanimelist.net/reviews.php?id=125351"
        },
        {
            "content": "I can probably sum this review up in 3 words: Needs another season.\r\nStory 7.5\r\nThe story is probably not the strongest part of this show, but that's not a problem as the reason for that pertains to plot holes that could be filled with another season. The revenge aspect of the plot is a generic plot element that wasn't really brought up to an obsessive degree which is good becaUse I would've gotten annoyed by hearing about it in virtually every scene.\r\nArt 8.5\r\nThe art and design really stands out to me, as I like how they used a steampunk style setting and used that in themajority of the series. The one gripe I do have about it was the jarring transition to CG animation during certain scenes, namely the action scenes, but the CG animation itself was utilized very well, it was just the transition that was the problem for me. The character designs were very intriguing and, at least to me, felt fresh and unique at no point did a character stand out unnecessarily and felt out of place to me.\\n\\n\r\nSound 9\\n\\n\r\nWhile the opening and ending were probably my favorite ones from the entire year, the opening because of how awesome it was and the ending cause it was catchy as hell(Spin Spin Spin Spin Spin), the soundtrack stood out very well. I like OSTs that know how to set the mood and for me, UMD's did just that. Two songs in particular were really good and definitely worth a listen to outside of the show, Magica and Bravery Steps(you'll easily notice them if you look them up), and Bravery Steps is probably one of the best instrumentals I've ever listened to.\\n\\n\r\nCharacter 8\\n\\n\r\nThis is probably where the best and worst parts of the show lie. While each character is easily likable. They also have ticks that will annoy you if you don't like seeing that kind of thing in a character. Yaya is probably the character that'll cause the most division between viewers as while she's a great supporting main character, her excessive(sometimes bordering on obsessive) loyalty towards Raishin is both a good and bad trait as while she has her moments where her loyalty is tested and that's great to see, her constant attempts to, for lack of a better phrase, get in Raishin's pants, tends to get annoying.\\n\\n\r\nOverall 8.2\\n\\n\r\nUnbreakable Machine Doll is a good series, it is well worth a watch and at no point was I ever bored by what was going on. Despite some parts that felt rush, it never felt like it was a hindrance on the series itself, the writers put out what absolutely had to be seen or heard and did it exceptionally well. Like I said there are a lot of questions left unanswered and only another season will help. If there isn't another season, then this show will be badly hurt by the lack of one.",
            "date": "2014-02-19T16:58:00+00:00",
            "helpful_count": 18,
            "mal_id": 133183,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2279127.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RApollos",
                "username": "RApollos"
            },
            "url": "https://myanimelist.net/reviews.php?id=133183"
        },
        {
            "content": "So this is what cancer feels like huh?\nI'm still gawking at how bad it was.\nUnbreakable Machine-Doll, or Machine-Doll wa Kizutsukanai in it's proper Japanese title, is set in a magical steampunk England. This hasn't really been done before so that's what'd lure most people into this horrible anime, made out of stupid and chromosomes.\nThere is no story. There really isn't. The studio's attitude was disregard plot. Acquire CGI. I suffered through 2 hours and 20 minutes (about 7 episodes) through this disease they dare call Anime.\n The sound was mediocre at best. The music was decent, but the V.A's chosen where obnoxious, loud and withouta doubt the most wrong choices for the \"characters\". I set characters in quotation marks because there wasn't much character to ruin.\\n\\n\n The male protagonist, Raishin is a dumbass (surprise surprise right?) He gets offered sex every day, with the hottest pieces of ass walking on that world, and he blatantly refuses each time. The only one he seems even slightly interested in is some random old chick who is obviously using him. Not only that he turns full emo whenever he can't even save a robot dog. Also,\\n\\n\n****SPOILERS****\\n\nIn episode 5 or 6, he turned Yaya into an unbreakable shield, but instead thought \"You know what? No, I'm just gonna get my lungs slashed instead of letting the attacker's sword shatter into a billion pieces against Yaya's arm. Thus throwing the entire match because he was afraid an unbreakable machine doll would break from some weak-ass opponent.\\n\n***************\\n\\n\nThen there's Yaya. Yaya. She is the most worthless, obnoxious and irritating Anime character I've seen in a LONG time. Not since SAO's Kirito and Asuna have I had the urge to kill myself like that.\\n\\n\n Then there's this \"Magnus\" guy. The typical OP masked guy who may or may not actually be the bad guy. It's not even the fact that they made him such a Gary Stu, but they even failed at that. He has no personality, and only seems to be able to say \"Hmph\" and \"Tsk\".\\n\\n\n Then there's the older teacher woman who already seems to know everything. Gosh. Who ever would have seen that coming?\\n\\n\n Then there's Charlotte, the typical blonde tsundere tomboy. Again, nothing new here.\\n\\n\nTHEN (Yes I'm going on a rant here) there's Fray, the obligatory white hair, red eyed anime character you see everywhere, she's also the busty clumsy one, so another Mary Sue.\\n\\n\\n\nI'm not gonna bother you all with the other horrible \"characters\" \\n\\n\\n\nAll in all this anime has given me Cancer, Aids, Malaria and Typhus, so I'm just gonna go ahead and die slowly now.",
            "date": "2014-04-21T12:39:00+00:00",
            "helpful_count": 16,
            "mal_id": 140775,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452949.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Mournz0r",
                "username": "Mournz0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=140775"
        },
        {
            "content": "I am a humble and tolerant man. But there are 3 things that I simply can't forgive. People who give me orders, people who stand against me, and people who tell me that my opinions are invalid. - Loki\r\nAll right, so I have decided to review the anime \"Unbreakable Machine Doll\" which is basically a light novel adaptation by company Lerche, who directed one of my favorite anime, Danganronpa & Carnival Phantasm\r\nSTORY (8):\r\nThe story covers 3 chapters of the light novel. The first chapter involves Yaya & Raishin gets to know Charolette & Sigmund at Walpurgis Machineart Academy. The 2nd chapter involves the introduction ofnew characters like Loki and Frey. The 3rd chapter focuses on Charolette's sister, Henriette, and how their relationship as sisters develop.\\n\\n\r\nWalpurgis Machineart Academy is a school whereby they train the puppeteers to control properly their automatons. In the 1st chapter, the school organizes a tournament to the top 100 students in the academy. Whoever wins the tournament, he or she will be crowned \"Wiseman\", known as the Great Puppeteer.\\n\\n\r\nEvery chapter has one main villain. Of course this is important in most action anime.\\n\\n\r\nART (7):\\n\r\nThe art style was ok, although the colors are very bright.\\n\\n\r\nSOUND (9):\\n\r\nI honestly loved the opening and the ending. The opening is \"Annica\" that is sung by Hitomi Harada. The ending goes Maware Maware. By the way, there are some voice actors from Baka & Test who voiced the main characters like for example Hiro Shimono voiced Raishin & Hiromi Harada voiced Yaya.\\n\\n\r\nHiro Shimono voiced Akihisa from Baka & Test while Hiromi Harada voiced Himeji from Baka & Test. I was pulled into the anime thanks to these voice actors.\\n\\n\r\nCHARACTER (8):\\n\r\nSo far, in every chapter, we learn about their backstory of each of the characters like Raishin, Yaya, Charolette, Frey, Loki & Henriette.\\n\\n\r\nRaishin: He was incapable of combat but he can control his automaton, Yaya. He was ranked the 2nd lowest in the class due to the fact that he has the 2nd lowest grades in the exam. In fact, he has determination although sometimes he gets easily frustrated. He reminds me of Eren Jeager from Attack on Titans\\n\\n\r\nYaya: She is cheerful and energetic and she likes to tease Raishin. One time in the beginning of episode 1, she says \"Yaya is cute, she is the cutest in the world\", I was like so surprised that she tried to put a spell on Raishin. By the way, she is skilled in combat. Yayaboombastic\\n\\n\r\nCharolette: She is a tsundere. She is very hard on Raishin when she thought that she is doing something perverted.\\n\\n\r\nLoki: As you have seen in my first sentence, I have been inspired by Loki's statement in episode 5. Loki is smart, calm and composed.\\n\\n\r\nFrey: She is quite shy but she is kind at heart.\\n\\n\r\nHenriette: We only see her in chapter 3, she is also quite shy and gets easily timid. I would love to know more about the sister relationship development.\\n\\n\r\nI really have no problem with the characters, but I would like to know more about them.\\n\\n\r\nCONCLUSION (8):\\n\\n\r\nSo far, I enjoyed this anime despite some lack of information of some episodes. Especially, the last episode whereby the boss in the 3rd chapter disappears. There is basically an OVA which might cover the remaining chapters. I doubt that the OVA might cover the remaining 9 chapters of the light novel. But it would be wonderful to see how the story unfolds.\\n\\n\r\nI just really hope there will be a season 2 so that this season will cover all the chapters up to 12. \\n\\n\r\nI can understand that the producers did not know that there are 12 chapters of the light novel just before they created this anime. So I grade based on how worthwhile it is to watch the 1st 3 chapters that is adapted into an anime.\\n\\n\r\nOverall, I enjoyed this anime. The voice acting was good and the characters are fun. So I give this anime an 8 out of 10.\\n\\n\r\nSo in conclusion, here is my wish to MAL.\\n\\n\r\n\"Merry X'mas & Happy New Year\".",
            "date": "2013-12-23T11:47:00+00:00",
            "helpful_count": 12,
            "mal_id": 125225,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=125225"
        },
        {
            "content": "When I first watched the upcoming fall anime trailers i thought Machine-Doll wa Kizutsukanai would become my favoured fall anime but instead became my third favourite. Based on the light novel Kikou Shoujo. Here's my personel opinion :\r\nStory: Just keep watching there's more than meets the eye! Cool yet very emotional protaganist Raishin & his doll familliar Yaya whose love for her master is beyond boundaries.\r\nArt: The only bad side about this anime is crappy CG usage in some action scenes!\r\nLately anime production studios are using too much crappy CG to save a lot of budget but atleast this one doesn't have slugish movements likeArs Nova or Tokyo Raven etc...\\n\\n\r\nSound: BGM is great, Seiyuu s are ok too, no problems so far.\\n\\n\r\nCharacter: Yaya is moe & funny. The very unique art style fits the best for Yaya!\\n\\n\r\nEnjoyment: Unlike most fall animes i watch this anime with utmost high priority.\\n\\n\r\nOverall: And let's hope they will make some follow up season or something in the future.",
            "date": "2013-11-29T06:24:00+00:00",
            "helpful_count": 11,
            "mal_id": 121737,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270207.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Blo0dyRavensk",
                "username": "Blo0dyRavensk"
            },
            "url": "https://myanimelist.net/reviews.php?id=121737"
        },
        {
            "content": "To get a good idea of what this show is like, just imagine what a 6 year-old boy would write if he was trying to  make a story with \"badass\" protagonists and \"evil\" villains. \r\n- It has your generic harem MC (Main Character) who thinks girls have cooties. \r\n- It has the dark&edgy side-characters repeating the same cringe-worthy intro lines every few minutes.\r\n- It has the laughably poorly-written bad guy who is so poorly written that he literally says \"My greatest pleasure in life is making people sad\".  Yes, he actually says that.\r\nAs with most harems, the redeeming quality is that the girlsare mostly all great, but the MC is so shitty that the show was still quite bad.\\n\\n\\n\r\nStory 3/10\\n\r\nThe universe that the story takes place in is well written. It is a world where magicians control puppets and have them fight. It is fleshed out and the setting has a nice atmosphere that comes across nicely. That's the good part. The bad part is the events of the story. The MC has some insatiable need to get involved in the business of strangers. The writers couldn't explain it because it's so stupid; at one point they even had the MC say \"I have no idea why I'm doing this\". Anime with male MCs typically have a problem of having main characters make retarded, implausible, reasonless decisions. This show is no exception. What hurts this show even more is that we are supposed to think of the MC as a badass, despite the fact that he has a phobia of sex and avoids it at all costs. \\n\r\nHow the hell is anyone who pretends he doesn't have a sex drive supposed to be cool/badass? That is really why this show ends up being utter garbage. The girls(especially his partner) are all in love with him and want to have sex with him, yet he always avoids it and acts like the girls are about to kill him whenever one of them tries to bang him.\\n\\n\\n\r\nArt: 9/10\\n\r\nThe art and the art-style is fantastic. The outline lines for the characters are hardly visible. The art is probably the only reason why I was able to watch this dreadful show. While I was watching this, I kept thinking that it's a huge shame that this great art had to be wasted on adapting such a terrible story.\\n\\n\\n\r\nSound: 7/10\\n\r\nPretty good in the sound department. Great ED. And the OP was good as well, even if the lyrics were so edgy that it was cringe-worthy.\\n\\n\\n\r\nCharacter:  1/10 for the male characters\\n\r\n                   8/10 for the female characters\\n\\n\r\nThe male characters are terrible. The male characters besides the main character constantly repeat their own introduction lines over and over again because the writers apparently thought that was \"badass\", when in reality it's embarrassing, because you know that the staff thought it was so cool, when in reality it is so pathetic that it makes you cringe.\\n\r\nThe MC behaves in such an implausible way that its infuriating to watch. He has no desire to have sex with any of the women who want to bang him, even when they are naked on top of him. He gets annoyed by the concept of sex. The only thing he cares about is getting involved in other people's personal business. He doesn't have a desire for romance, or love, or sex. However, he has an insatiable desire to help random people for no reason (once again, he himself states that he has no idea why he does it. There is no reason for it. The writers just shallowly make him do these things so that there is a story).\\n\r\nThe female characters are great for the most part. They're all cute eye-candy and they all nicely represent their archetype that they were written as. They all have generic personalities (e.g. being a typical modern tsundere, or an overly attached yandere), but I'm fine with that. Anime girl archetypes tend to be great in my opinion, so I'm fine with typical anime girls. I wish there were more huge titties though.\\n\r\nFrey best girl.\\n\\n\\n\r\nEnjoyment: 3/10\\n\r\nThe main character's retarded behavior ruined the show for me. I'm getting sick of Japan writing such dense male main characters who are always scared of sex. It's ruined so many shows.\\n\\n\\n\r\nOverall: 3/10\\n\r\nIf you're desperately looking for a waifu, then you could try watching this show. Other than that, it's not worth your time. The generic main character ruins this show with his unrealistic decisions and actions and his phobia of sex.\\n\\n",
            "date": "2014-06-23T12:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 148247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1285459.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/drlupin3",
                "username": "drlupin3"
            },
            "url": "https://myanimelist.net/reviews.php?id=148247"
        },
        {
            "content": "Well, Unbreakable Machine-Doll finished airing in japan last week and I feel I should post my thoughts on it. Unbreakable Machine-Doll takes place during the early 20th century where magic and technology are used as one. This is called Machinart. The ones who practice this art are called Puppeteers. Puppeteers use this art to develop animated machines or “Dolls”. These dolls while controlled by the puppeteer, are free thinking. The dolls are powered by these circuits which were originally used for military purposes, however, over time they have spread worldwide.\r\nThe series focuses on Puppeteer Raishin Akabane and his Doll Yaya. Raishin has made it hisgoal to enter a sort of tournament and become the Wiseman. The wiseman is considered the best puppeteer and is a sort of king. Placement in the tournament is only available to the top 100 students in the school. However, his plan becomes more complicated when he receives his test grade as one of the worst students in the academy, which earns him the nickname Second Last. I give the story a 7/10\\n\\n\r\nThe art in this anime is absolutely superb! The characters looked well drawn and they looked like they belonged in that time period! I wasn’t a big fan of the CGI they put in the fight scenes, but I didn’t notice it at times. I give the artwork to this anime a 8/10\\n\\n\r\nThe voice acting in this anime was pretty good in my opinion and the music was also great! I loved the opening music. However, I’m not one to stick around for the ending theme song and the one in this anime (While catchy) didn’t encourage me at all to stay (This is my opinion. I’ve heard others have liked it a lot). Overall, I give the sound an 8/10\\n\\n\r\nThe characters here in this anime in my opinion could have been better. Everyone seemed too confusing at times. Raishin is your standard male protagonist, Yaya is obsessively in love with Raishin (As well as every other unique girl in this anime) and can cause a scene at times in public. Some of the characters do this annoying catchphrase thing where they repeat the same sentence over and over again while changing the last part (This in my opinion is very annoying at times).  I think the characters are the weakest part of this anime. I give them a 6/10.\\n\\n\r\nOverall, the anime is decently written, the voice acting and sound is great as well as the art, and the characters are very generic. I would recommend this anime to others and would watch a season 2 (If one is made). I give it an 8/10",
            "date": "2014-01-02T03:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 126807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/551719.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TMtrue",
                "username": "TMtrue"
            },
            "url": "https://myanimelist.net/reviews.php?id=126807"
        },
        {
            "content": "I didn't think the actual story of this was anything special. But honestly the characters in it are excellent. Raishen and Yaya's interactions are priceless. I'm not sure I liked Char that much, but the rest of the characters were excellent. \r\nI think I liked the ending song much better than the opener though and wish they were reversed. \r\nRaishen generally is a very sharp guy, well except for one episode where he turns into a complete idiot briefly, but soon he's right back to his calm calculating self. \r\nYaya is just awesome. I seriously want to know the backstory on this one. While theShoko flashbacks are great, in the Ovas that come with the Limited Edition hint that Yaya hated him when they first met, but now she's obsessed with him, and thinks they're married and on their honeymoon. \\n\\n\r\nYou just KNOW Shoko must have manipulated that into happening, especially considering Raishen's reactions to having a doll want him that badly. \\n\\n\r\nYes, I really get off on Yaya and her antics, she's a cutie.",
            "date": "2015-06-06T15:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 189705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Silverquick",
                "username": "Silverquick"
            },
            "url": "https://myanimelist.net/reviews.php?id=189705"
        },
        {
            "content": "First and foremost, I will make my review spoiler free as I can. It’s safe to read even if you haven’t watched the show.\r\nLet’s start me review, shall we?\r\nStory: 7\r\nDuring early 20th century, by discovering “Magic circuits”, scientists found a way to give life to countless things. These magic circuits are made from complex magic and highly developed technology. Magic circuits were put into different objects to bring them to life and even give them human-like traits. An object that has magic circuits installed in it is called an “Automaton”, with humans called “Puppeteers” controlling them and providing them the “Mana “ they need todo certain actions .\\n\r\nAkabane Raishin is a puppeteer attending Royal Academy. Together with a beautiful teenage girl Yaya, who’s actually Raishin’s puppet. Royal Academy is a school specializing in training puppeteers and crowning them as “Wiseman”. Wiseman is a title given to the strongest puppeteers. Raishin has to defeat every single puppeteer in the academy to be crowned as a Wiseman. \\n\r\nThat’s basically the gist of the plot. You’ll learn some more of it by watching it.\\n\r\n7’s a perfect score to gauge Machine-doll’s plot/story.  Not so rare these days if you ask me.\\n\\n\\n\r\nArt: 9\\n\r\nAmazing CG battle sequences alone deserves a 9. Aside from the great CGs, the details on everything are smooth. This wouldn’t surprise most of us by now.  It is 2014, nothing is impossible anymore (aside from me having a girlfriend). A point I would like to add, the manga’s art style’s a bit (itsy bitsy tiny bit) different from the Anime. Not much to mention here.\\n\\n\\n\r\nCharacters: 8\\n\r\nONE YAYA, PLEASE! NO, MAKE THAT DOUBLE—NO, THREE PLEASE! An obsessed girl character isn’t that really rare for a harem. Female leads and supporting characters in Machine-doll doesn’t differ much from other harem girls. Every girl goes gaga for Raishin. Meh, wouldn’t be a harem show if he wasn’t flocked on by girls, no? Anyhow, every girl in his harem has their own different personality.  Telling who’s who might spoil you, so I won’t utter any word about them. They’re all drawn perfectly, breast size, pantsu color—I’m not trying to sound like a pervert, ok!? Lastly, they’re all waifu material.\\n\\n\r\nMusic: 8\\n\\n\r\nGiven that the series has only 12 episodes, there’s only one OP and ED theme.\\n\r\nMaware, maware, maware, maware, maware, maware, maware, maware. Don’t mind me, I’m just singing my heart out. That’s the catchy ending theme of Machine-doll. The seiyuu(s) sung it themselves! Yaya’s singing in it, too, of course. It’s so catchy I’ve been playing it for numerous times, even now while I’m writing this!  I didn’t like the OP theme though. \\n\\n\r\nEnjoyment: 9\\n\r\nI enjoyed Machine-doll a lot more that I had expected. Part of it is it’s been a while since I’ve watched a series with these enough fan service. The occasional pantsu shots and \"other\" fan service moments were satisfying for me. After all, these are what most viewers (not counting out myself) find attractive. So if you’re a fan of harem/ecchi/seinen/action shows, you’d definitely like Machine-doll. \\n\\n\r\nOverall: 8\\n\r\nI first encountered Machine-doll, if I’m not mistaken, around 2012, ‘course it was on a manga site. I click on the advance search button, clicked genres: ecchi; seinen; harem; action (three of them are my favorite genres). And then, BAMF! Machine-doll was on the first page of the results. That time, Machine-doll was about 25+ chapters. So you can imagine how hang-up I am when I finished reading them. Then last year, Machine-doll has finally turned into an Anime! I was so happy I forgot to watch it for a year (lol.  Actually, I forgot to put it on my watch list).\\n\\n\r\nPlot-wise, Machine-doll isn't really a rarity these days. Truth be told, I find it \"most common\". But that doesn’t mean I don’t like it. A lot might overlook Machine-doll because of the common plot. I find the 12 episodes too short for a series to show its real plot—how deep it is. Or maybe, Machine-doll is a failure because it hasn’t showed any serious developing within the 12 episodes? Nevertheless, Machine-doll is still a working progress, so it has a lot of potential to get better. I just hope they won’t take too much time. Lastly, I assure you that Machine-doll isn’t a waste of time. But, sadly, if you’re a fan of “deep-complicated” plots, you better pass this up. Ultimately, don’t let an amateur so-called reviewer, such as me decide for you. \\n\\n\r\nP.S.\\n\r\nI still want my own Yaya.  =(\\n",
            "date": "2014-11-09T02:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 167959,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=167959"
        },
        {
            "content": "At first I was like this, \"This show might be good.\", but I was horribly wrong. Not only did it make my hate for harems more vehement, but it downgraded what possible could have been a better story.\r\nThe story could have held up. Not really, it still would have been a piece of shit. The machine doll premise piqued my interest, but it could've been replaced with a thousand other plot devices and still would've been terrible. I understood the vengeance thing, but that main character fucker should've died. It was like, exactly like what happened to the Uchiha Clan from Naruto. His whole familygot murdered by his asshole brother. I'm guessing his brother was to be misunderstood in the end. The female characters were just there for the main character, and every other male character was an asshole. I don't know what's up with anime and making every villain just to make the main character look better. You don't have to make all the bad guys contrarily less better than the MC. And female characters can be there other than for fan service!!! Who know? Most of them literally had no purpose, and the MC had to do something to solve there problem. What almost had me interested was how that blonde dragon girl and that Felix guy might've had something. It could've happened, but naw the MC must obtain all ass in a 10 mile radius. \\n\\n\r\nThe art hurt my nuts. I had to turn the fucking brightness all the way up just to see anything. Everything looked soft and shit. Were solid lines really that hard to make? The CG was like a very uncomfortable rimjob, and titties were everywhere. These two things don't usually go hand in hand.\\n\\n\r\nI never actually heard the opening, I always skipped it. The ending was okay. It sounded like a vocaloid song I heard once. The metal slashing sound, explosion, and almost every sound in here were very unpleasant to the ears. Some the voice actors were kinda annoying.\\n\\n\r\nSpeaking of annoying, Yaya was that. She was always jealous or horny like what the fuck? MC was a duller Sasuke Uchiha if that was possible.He never fucking died either that doesn't really happen. You die when you are killed. Dragon girl I don't even remember, so she was probably unimportant. White haired dog girl did something once I think. There was a teacher or something. Someone had a sister I think. Who looked exactly like them. That brother of dog girl who didn't like things. The MC's brother was the bad guy. There was another bad guy. That's all the characters, I think. The stupid ones don't matter.\\n\\n\\n\\n\\n\\n\\n\\n\r\nYou see those spaces? It was more entertaining pressing space bar eight times than it was watching this series.\\n\\n\\n\r\nThe machine doll broke my hopes. I can never watch another mediocre anime because of this show. Now the world is, sort of like the artwork, dull. I hate everything, and when my friends talk about anime, I vomit. My condolences to whoever had to watch this show.\\n\\n\r\nActually I'm exaggerating. If you enjoyed this show, then good for you. You are not human. I hope you find a place to live. A place that'll accept you. I used to love dolls.\\n\\n\\n",
            "date": "2014-05-27T20:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 144785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/thesuperneet",
                "username": "thesuperneet"
            },
            "url": "https://myanimelist.net/reviews.php?id=144785"
        },
        {
            "content": "Machine-Doll wa Kizutsukanai\r\nThough it tries to play itself off as anything but, Machine-Doll wa Kizutsukanai is a harem anime. I am no big writer of reviews though this anime hit me in so many ways I had to add my two cents into it. Machine-Doll has a great concept though there are so many flaws one can not overlook it. I will touch on the things I enjoyed about this anime as few as they are. The artwork for this anime is spectacular. Cute with enough detail that each scene it becomes clear that the artist put in lot of time. The score to thisanime is well done matching the background music to enhance the emotional aspect the scene was trying to captivate. Now onto the things I disliked. Most might be wondering why I say this is a harem anime, the conversation between chars always leads to sexual innuendos, panty shots and girls blushing and getting jealous over the main char. What I found most annoying about this anime was the whininess of ALL the female chars. Even in situations where seriousness should have been taken it was pushed to whiny emo “I'm worthless” crap from the female chars. The storyline, while had a great concept lacked any real information give in the anime. I was hoping as the anime continued it would go deepening into the plot, though it continued to ignore any real depth. The fight scenes were decent enough though once again lack of information led to it being nothing more than an excuse to watch big breasted women jump around. If this anime was any longer I will admit I would not have forced my way through the entire thing. Though to each their own. So if you enjoy big breasted whiny emo girls, this anime is right up your alley. \\n",
            "date": "2014-03-07T11:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 134975,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1340831.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/YomiHime",
                "username": "YomiHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=134975"
        },
        {
            "content": "Fairly intriguing plot that really gets you hooked towards the end. I found the characters fun and enjoyable.\r\nHowever ended on the usual \"please buy the light novels\" cliff hanger with no real closure and clearly no intention to produce a season 2 from the studio.  Light novels don't seem to have been officially translated and for sale in English begs the question what was the point in bothering to Dub it ?\r\nOverall \r\nWhilst the anime is mildly entertaining, the fact it seems to spend the majority of its time introducing new plot threads and never really finishes them before ending abruptly is left abad taste in my mouth. I recommend you save your time and skip this one.",
            "date": "2018-07-11T17:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 283753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6864936.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zraktor",
                "username": "zraktor"
            },
            "url": "https://myanimelist.net/reviews.php?id=283753"
        },
        {
            "content": "How people view ecchi anime, in the anime community, are vastly different. Some people can’t stand it, some people love it, and aren’t afraid to show it, others are fans but aren’t too proud of it, and there are some people who are somewhere in between. With all of these differing opinions on ecchi anime, it’s hard to determine whether an ecchi series is any good or not. How much you like a series riddled with fanservice and that, usually, doesn’t have a very compelling plot is, naturally, entirely dependent on your opinion of fanservice and how much the plot of a series contributes toyour personal enjoyment of it. Now, occasionally, like in any other genre you will have shows that will try to break the mold that has been established by so many shows that have been released before it. In the case of ecchi anime, that often is having a really good story line to go along with the inevitable breast and panty shots. That is something that Unbreakable Machine-Doll (Machine-Doll wa Kizutsukanai) has tried to accomplish. Now was it successful, or didn’t it fall flat on its face?\\n\\n\r\nStory:\\n\\n\r\nUnbreakable Machine-Doll’s story takes place in the 20th century, a time where there have been several technological advancements, especially with the use of magic. During this time period, there was a tremendous discovery. By fusing scientific and magical knowledge, humans were able to create a device that can bring inanimate objects to life, an even give them their own personalities. The militarily use for this technology came in the form of puppets. They would bring puppets to life, and train people to use these puppets for military purposes.\\n\\n\r\nThe story revolves around Raishin Akabane, a member of the Akabane clan—a clan that specializes in the use of puppets. One day, a mysterious assailant attacked his clan, and nearly all of them were killed. Raishin wants to avenge his clansmen’s deaths so he joins the Royal Academy, a prestigious school for puppeteers, in order to become the best puppeteer in the world.\\n\\n\r\nThe most interesting thing in the story is its setting. As most of you probably have noticed, most anime take place in Japan, with the second most popular setting probably being space. So to have an entire series take place in 20th century England is a nice change of pace. I was also really interested in the story’s premise. Just looking at the plot synopsis got me interested in watching this series. But, unfortunately the story never gets any better than “interesting.”\\n\\n\r\nThe first issue that I have with the story is the way that it goes about explaining everything to the viewer. It will introduce a subject, or term, to you without defining exactly what it is or what’s going on. They will have entire conversations about these things without giving you any clues or context to what they are talking about—until the conversation is already over. But, by that point, I was already annoyed. This happens several times throughout the course the series, and it gets even worse at the end, but I’ll get to that later. It’s not like they are being vague, and mysterious. They’re not giving you hints or clues, and trying to let you figure things out on your own. They’re just not telling you anything.\\n\\n\r\nThe show also tries to break away from some of the stereotypical ecchi attempts at humor, i.e. the male protagonist “tripping” and grabbing the breasts of a female character or the male protagonist having several nose bleeds because of the female characters. While there are definitely some moments that are fairly cliché in the ecchi genre, for the most part, the humor in Unbreakable Machine-Doll at least a little bit different from what you’d typically see in the genre. The problem is that it uses the same types of jokes and gags over, and over, and over again. And, honestly, they weren’t even that funny in the first place.\\n\\n\r\nAnother issue I have with the story is the way that they magically create and insert actions, conversations, and random knowledge whenever it’s convenient for Raishin. He’ll be in the middle of a battle, in which he’s getting beaten pretty badly, and all of a sudden he’ll turn the tables on his opponent and gain the upper hand. How does he do this? Apparently, he had it all planned out all along. Some random bystander will start commentating about how Raishin must’ve known about such and such all along (or “deduced” it right before hand), and had already had a plan in his mind to counter act such and such by doing such and such off screen. They don’t even show you flashbacks of when he did whatever they said he did, they just flash a picture on the screen, there will be more on that in the animation section of this review, and say that he had planned it all along.\\n\\n\r\nNow my biggest problem with the series is the way that it ended, because, it really didn’t. Remember what I said about the series picking and choosing when to explain things that they mention in their character’s dialogue? During the last two episodes they say things that were never mentioned in the series before hand, and must’ve planned on explaining things during the second season. The problem is that there is not second season, and there will probably never be one at this point. The unanswered questions are compounded because the season finale didn’t conclude the two main storylines during the course of the season: Raishin getting his revenge and becoming the best puppeteer. The only things were solved by the last episode were a few side character’s stories, and it felt like the main story was put on hold. All of this added up to a very unsatisfying conclusion, to an underwhelming story.\\n\\n\r\nAnimation:\\n\\n\r\nOverall, the animation in Unbreakable Machine-Doll is solid. The characters are all distinctive and nicely animated, and the background scenery is well done. The fight scenes in this series are also well done, even though I do have a problem with the way they chose integrate still images into them. Instead of seeing a fight scene with every frame being animated, you’ll see quick flashes of still images, which are supposed to supplement the animation for those particular actions. This happens fairly frequently, and it’s not only jarring, but it’s also disappointing. Several of the moments that were reduced to only still images would’ve looked much better if they were animated, and they would’ve made the fight scenes that much better.\\n\\n\r\nAnother thing I liked about the animation was that there wasn’t a ridiculous amount of fanservice. Was it there, and perfectly noticeable? Certainly, but it didn’t happen anywhere near as often as I expected it to. In fact, there were several episodes were there was little to no fanservice, and I thought that was refreshing.\\n\\n\r\nIt also should be noted that there seems to be some brightness issues with the lighter colors used in the series. Some of the whites, in particular, look extremely bright, and even a little blurry, on screen.\\n\\n\r\nSound:\\n\\n\r\nUnbreakable Machine-Doll’s soundtrack (OST) is fairly large, and pretty varied. There are definitely plenty of songs to fit every single moment in this series. Most of the OST is split between two song types: soft, airy, and melodic, and epic and grand. The softer songs usually rely on different string instruments and a piano to produce a lighter sound that just feels like it belongs in a fantasy show, which isn’t a bad thing considering that that is pretty much was Unbreakable Machine-Doll is. The other songs use a lot more instruments, and that big orchestral sound is perfect for the fight scenes in this series. The series only has one opening and ending, and I didn’t find either of them particularly special. While I didn’t find anything that I’d be compelled to re-listen to after this review, Unbreakable Machine-Doll’s OST was really good.\\n\\n\r\nCharacters:\\n\\n\r\nThere are two main characters in this series, Raishin and his puppet Yaya. There are also several side characters that you’ll see over the course of the series. I’ll just get this out of the way right now—there is little to no character development for any of the characters in this series. Every character in this series is pretty much the same at the end of the series, as they were at the beginning, with a few very minor exceptions. Thankfully, we do get some background information about most of them, but there are still some characters that we don’t know a whole lot about.\\n\\n\r\nBut, the characters are decently likable and enjoyable to watch. There relationships with one another do actually go through some development over the course of the series. It’s nothing substantial, but it’s definitely noticeable.\\n\\n\r\nEnjoyment:\\n\\n\r\nAs I mentioned earlier, this series never got past just interesting for me. The annoying methods of story telling, repetitive comedy, and lack of an ending didn’t really add to my overall enjoyment of this series. While I was decently entertained by Unbreakable Machine-Doll it’s not something that I’d consider watching again.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 2.5/5\\n\\n\r\nAnimation: 3.8/5\\n\\n\r\nSound: 3.7/5\\n\\n\r\nCharacters: 2.7/5\\n\\n\r\nEnjoyment: 3/5\\n\\n\r\nVerdict: 3.1/5\\n\\n\r\nWhile Unbreakable Machine-Doll isn’t bad, it’s far from being the, “Ecchi anime with a fantastic story,” that some claim it to be.",
            "date": "2015-06-10T20:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 190051,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=190051"
        },
        {
            "content": "Well, Machine-Doll wa kizutsukanai is definitely a well rounded anime. \r\nIts got bits and pieces of action, romance, ecchi, mystery, fantasy and so on. A great wide range anime with wonderful graphics that involves some 3D models during action scenes. \r\nThe downside is that it's not focused enough. If one were to watch this for purely action content then they would be disappointed. It doesn't have a specific genre to lean on.  \r\nPutting that aside, the anime starts off in the early 20th century, where the main character Raishin sets off to a new academy in order to revenge his clan's death.He aims to be \" Wiseman\" (winner of a major tournament) by defeating his enemy. Interesting plot because it's not repetitive as the protagonist slowly reveals his strength.",
            "date": "2014-02-12T22:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 132387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3297647.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shadonmiki",
                "username": "Shadonmiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=132387"
        },
        {
            "content": "This is what the average viewer should expect when coming into this anime. the setting takes place in the early 1900's in the U.K, with most of the events taking place at the Walpurgis Academy, a School designed to teach children the art of Machinart, a fusion hybrid of technology and magic that lets a mage control a magical robot by using their own mana in a manner similar to how masters in \"Fate/Stay Night\" control their servants. the students at the school then compete in a spectated combat competition to prove who has what it takes to become the \"Wiseman\" a position of powerin the military which gives the person who holds the title of Wiseman to be able to ignore the taboos of magic set by the world. the Main Character, Raishin , goes to this prestigious academy with a Magical robot in hand named Yaya, a cute girl who looks very indistinguishable from the other female characters in the show as she was made by one of the best machinart engineers in the world. She fits the yandere archtype to the tee as she loves Raishin to extreme lengths. Raishin then uses Yaya in the competition in order to try to become the Wiseman, but sadly as soon as he gets into the school he is forbidden from entering the competition because in order to participate you need to be one of the top 100 students in the whole school to be eligible and he is almost (and I place a LOT of emphasis on the word almost) the worst student in the entire school grade-wise. his entire purpose in being there is to gain the power and experience needed to take revenge for his slaughtered family by killing his brother Tenzin who happens to attend the same school as he does (where have I seen this before). that is the overarching story for the anime in a nutshell and along with several different story arcs that take place in the show. now that I have given my summery of the anime I will give my Scores based on Story, Art, Sound, Character, and Personal Enjoyment.\\n\\n\r\nStory: 6/10\\n\r\nWhile I appreciate that this anime gives a new twist on magic and combining it with machines, I have to say the story isn't that great or original, as both the whole \"taking revenge\" story and the setting being a school have both been so overdone in anime that I cant really give it high remarks. also while some of the arcs are really enjoyable to watch at times I am more or less confused at the end of the series as it leaves a lot of questions left unanswered in this world. \\n\\n\r\nArt: 9/10\\n\r\nthe animation quality in this anime is definitely above average, the fight sequences are great (except for the cgi but that's my taste so I won't knock the score off for that) and is very fluid overall. not at the quality of Fate/Zero or the likes of that but good enough.\\n\\n\r\nSound: 6/10\\n\r\noverall the soundtrack isn't something to brag about. the music fits the show during it both suspenseful and emotional moments but nothing really catchy or something I could listen on its own except for the opening song which is ok at best on its own.\\n\\n\r\nCharacters: 5/10\\n\r\nin this series there isn't a lot of character development for most anyone in the series except for the Main Character and the Female Lead Charle. most other characters can be described in just two words. their Archetypes, while overused, did not make the series or its characters unenjoyable.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI really liked this show despite its faults. The interactions between characters were always either really silly and comedic or really heartwarming. I really did like the fight scenes in this series and there is also the idea that there is always an underlying case to solve in the series which was also entertaining to see unfold.\\n\\n\r\nOverall Score 7/10\\n\r\nthis anime isn't the best but it isn't something that should be outright avoided. all I can say is if you like the Magical world Genre, you will definitely enjoy this anime the same could be said if like either mystery or action anime. but it is not an anime that will be put into high regard anytime soon",
            "date": "2014-01-03T16:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 127029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3371887.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pman1994",
                "username": "Pman1994"
            },
            "url": "https://myanimelist.net/reviews.php?id=127029"
        }
    ],
    [
        {
            "content": "So I just finished this show today, and I am going to give you guys (and girls) a rating for each aspect of the show, and then I will give an overall review at the bottom.\r\nStory: 8\r\nThe story was quite enticing, and it always left me wondering what would happen next, and it always stayed true to the main character's goal, Raishin, fighting along side his partner, Yaya. There were really no filler episodes, as each episode had some sort of meaning or foreshadowing that led into future episodes. There was also a lot of action, and the fighting scenes were very well done andportrayed Raishin's abilities very well.\\n\\n\r\nArt: 9\\n\r\nNot much to say here, I just loved the art in the show. It looked very new and refined, the colors were very good, but the only issue I would have is that the \"3D\" look of the dragon, Sigmund, got a little funky sometimes, but it wasn't a huge issue. Very good, better than expected and looked very new.\\n\\n\r\nSound: 8\\n\r\nThe sounds were amazing in this show. It had it's own effect for each puppet/character, and it gave the show and the characters a really unique feel. Sometimes there would be parts in fights where there was minimal sound with a lot going on, but it was made up for with lots of other fighting sounds in other fighting scenes, along with regular sounds in just normal scenes.\\n\\n\r\nCharacter: 8\\n\r\nMainly all of the characters were very well developed, and each character had their own unique sense to display who they really were. We got a lot of backstory on all of the main characters like Charl, Frey, Henri, partly Yaya, and a good amount of Raishin. My only complaint would be that I wish there was more backstory on Raishin, because even though his background DOES affect the plot quite a bit, I wish we got to see more about it other than this one specific scene that happens a few times over. Not a major thing though, as it still made his character very well developed. I won't go into too much detail about each character as I don't want to risk spoiling or ruining the experience for anyone. However, I CAN say that it is a someone romance/harem kind of aspect a good amount of the times that aren't during fights. It doesn't ruin the show for me, honestly, because it is made up with the main character not wanting to be a part of a harem, and also with all the fighting scenes and the main characters insane brains to get himself out of any situation.\\n\\n\r\nEnjoyment: 8\\n\r\nI really enjoyed watching every episode. There were no fillers, so you can watch each episode with reassurance that at least SOMETHING that happens will eventually be brought up in the next episode. I really loved all the characters, especially Yaya, and they just made the show that much funnier and more action packed.\\n\\n\r\nOverall: 8\\n\r\nOverall, this show was a very fun show to watch. Every episode had some meaning to the plot, it always had lots of funny moments, but it knew how to transition to action and more serious scenes quite well. The show really stood out to me, as it was quite different from other shows I've seen, and it really was a blast to watch. I loved watching each character interact with each other, some jealous, some more Tsundere, along with all the plot and development. In the end, it all came together for an amazing show that I REALLY hope will turn into a season 2. Fantastic show, I would definitely recommend watching it if you are into: A powerful main character (not OP), a romance/harem (not what the story is mainly about, but still present quite often), a whole bunch of unique characters, and comedy that happens all over the place. \\n\\n\r\n**Thank you for reading my review, and let me know if there was anything I could have done better, this is my very first review!",
            "date": "2014-05-04T06:53:00+00:00",
            "helpful_count": 218,
            "mal_id": 142303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3742865.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Ikuaya",
                "username": "Ikuaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=142303"
        },
        {
            "content": "I'm a benevolent and tolerant guy, but there are three things I simply can't stand...\r\nPeople who order me around\r\nPeople who oppose me, and...\r\nA complicated plot that is in need of more explanation!  \r\nStory: 5\r\nThe main character, Raishin, is on a quest to revenge his family and kill the person who wiped out his clan.  We join him as he enters a school of some sort and his adventures as he helps out fellow students in trouble. \r\nThe problem with the story is that they left out small details that either would have helped explained certain plot holes (Such as why Yaya had toturn off her invisibility) or complicated arcs such as the Loki and Frey arc.  Both Cher's arc and the Loki and Frey arc both involved types of politics and relationships that weren't fully explained and left me clueless on why Raishin was helping.  The pacing for the series was also fast, the time frame of what was a couple of days to what was a couple of minutes are never shown right, and when combined with the lack of knowledge led this story into a train wreck.  \\n\\n\r\nArt: 8\\n\r\nThe art was very good.  The scenery looked nice along with character designs.  I loved how the characters would look when they faced left or right.  The use of CG for this series allowed for smooth animation on almost everything, except for certain action scenes (This is the opposite of what Ars Nova did with CG)\\n\\n\r\nAction scenes weren't bad, but there were times in where character movement and animation did not look as well as other parts of fight scenes.  A great example would be the fight with Loki, as certain scenes had Yaya and Cheribum looking epic, but other scenes were very confusing.  If they slowed down the fight scene and didn't use as many different angles when showing the fight scene, this problem would be solved.  \\n\\n\r\nSound: 10+\\n\r\nAnicca, the OP is a great set up for the series.  The song has a very soft start and leads to a metal guitar riff.  What more could help set up the plot where puppeteers use puppets to fight each other, since most puppets are machine like.  The ED is by far the best ED to come from the fall season, Maware! Setsugetsuka.  It may be because I have a soft spot for traditional Asian themed songs, but this song is cheerful with a very catchy beat.  The ED alone awarded this series a 10 in sound.  \\n\\n\r\nBackground music was there to fit the mood, no complaints.  \\n\\n\r\nCharacter: 9\\n\r\nA place where this anime shines is in the characters.  All the characters looked amazing as well as had interesting personalities.  One of the few things I did get from the story was enough history for each character to have them be memorable.  Some of the best characters include; Yaya, the comedic yandere, Loki, the rival who hates more than three things, Frey, the girl with a small personality but a set of big brea... I'll stop.  These characters were very humorous and enjoyable to watch.  \\n\\n\r\nWhat about character development?  There is none that I noticed in the series, maybe small amounts when it comes to Frey and Loki, but nothing involving the main characters.  Is this a problem?  I will answer with another question, why change characters that were excellent to begin with?  Raishin and Yaya are blessed to be amazing characters from the very start and did not need character development.  \\n\\n\r\nEnjoyment: 6\\n\r\nAlthough the sound and characters were amazing, the story left me so clueless that I was partially bored during all the serious scenes and most of the action scenes.  \\n\\n\r\nAlso, what was Raishin's power involving Yaya?  Were they all different buffs or allowed different abilities involving Yaya?  I wish they had explained that, as it would have led to less confusing during the fight scenes.  Being ignorant of ones ability that is used a lot doesn't make for great fight scenes.\\n\\n\r\nOverall: 7\\n\r\nThis anime had my head do what the ED's chorus says, maware (Spin).  With such great sound and art, even great characters, the story was too poorly put together to enjoy all the other things this series did right.  Hopeful for a great season two.  \\n\\n",
            "date": "2014-01-04T18:02:00+00:00",
            "helpful_count": 105,
            "mal_id": 127233,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2686267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zelot",
                "username": "Zelot"
            },
            "url": "https://myanimelist.net/reviews.php?id=127233"
        },
        {
            "content": "You know what makes someone the best? Wearing a crown and calling themselves a ‘king’ doesn’t make someone the best. No. What makes someone the best is to prove themselves in front of the whole world through hard work, determination, skill, intellect, guts, and earn the respect from their peers. At rank #1235, Rashin Akabane is far from the best. In fact, he’s close to the bottom pit of the fall outs. But for him, there’s nothing more he’d like than obtain the title “Wiseman”. Such a pretentious title is equivalent to those of a king and is the ultimate goal of a puppeteer.\r\nMachine-Doll waKizutsukanai (aka Unbreakable Machine Dolls) is an animated series based on the light novel of the same name written by Reiji Kaito. The series takes place in the early 20th century in an industrial-like world. Rather than producing cannons and gunpowder though, there exists an emergence of a power known as Machinart – a fusion of magic and technology applications. The series follows Rashin and his automaton Yaya as they go on a journey of both endurance and vengeance.\\n\\n\r\nKinji Yoshimoto is the director where he previously had experience with fantasy theme series such as Quee;ns Blade and Dog Days. Here, he is in charge of a fantasy theme series that molds the themes of magic and science. Upon first impressions, it’s easy to tell this show would fall under the typical fantasy/battle shounen style with the tournaments to prove one’s worth; and you’re not wrong if you think so because the show does depicts itself that way. However, a primary motivation for Rashin to become Wiseman is more than simply be the best. He is also on a quest for vengeance because of his tragic childhood.\\n\\n\r\nGrowing up as an orphan, Rashin can be best described as a brash and hotheaded young man. He joins Walpurgis Machinart Academy to not only make a name for himself but to also find the culprit behind his family’s murders. It ventures into the mystery zone on a variety of occasions as Rashin also plays the role of an anti-hero. His sidekick is the all adorable and automaton Yaya. Unlike most automaton, Yaya looks like a human in a variety of ways. This is likely because of Rashin’s past where his childhood has a strikingly resemblance to her.\\n\\n\r\nYaya portrays the role of an automaton, a weapon of war but also surprisingly shows many human emotions. This is usually evidenced by her aggressive behavior towards Rashin that borders on obsessiveness. For Yaya, Rashin is her raison d'etre for existence. Throughout the series, it’s shown that her feelings for Rashin is genuine. Whenever his life is put into danger, Yaya would rush into the front lines of danger disregarding her own safety. Of course, this doesn’t always end well because the threats that their opponents pose. And as a normal human, Rashin has to work his way up. Unlike some of the other characters in the series such as Loki, he must prove to others that even a failure can surpass a natural genius. This puts himself on a frustration scale as we witness his struggles. On many occasions, he questions himself if he is worthy of being Yaya’s puppeteer or even a student at the academy. He hopes to not repeat his mistakes and become a master worthy of his partner. And because Rashin is not the typical Gary Stu character with plot armor, he isn’t invincible nor a superman.\\n\\n\r\nDespite the duo’s seemingly good relationship, there’s a variety of problems between them. Most of this is presented in a comical form as Yaya takes the role of an overly obsessive character. While not technically a yandere, she is infused with jealousy whenever a girl even comes into contact with Rashin. Regardless of age or appearance, Yaya simply cannot stand Rashin ever becoming acquainted with another member of the opposite sex. A seemingly flaw of this series shows that Yaya lacks a real personality in this way because of her one sided admiration and love for Rashin. The latter treats her affections with disgust and reluctantly tolerates her advances on rare occasions.\\n\\n\r\nThe themes of magic and technology is a prominent aspect that is explored. The mechanics behind Machinart is explored on occasions although some parts are left in unexplored territories. Instead of telling though, the series presents them with other puppeteers in action. Among some of these including 2nd year Charlotte Belew, the clumsy Frey, the prodigy Loki, and mysterious Magnus. Throughout the series, each of them demonstrate abilities of a puppeteer at various skill levels. Most of them seems to have some sort of objective as to why they are also at the academy while others lacks a true motive. At the apex of its story, we witness an event that is motivated by a grim threat targeted to one of the puppeteers. Although the mystery is not a genre of this show, there come times when the academy becomes entrenched with suspicions that touches on cases of murder. It becomes intriguing to watch because of the standards involving red herring comes into play with false leads and suspects. It’s not as predictable as some might think as viewers will be able to indulge on the movement of the story.\\n\\n\r\nUnfortunately, the series’ story pacing feels peculiar on various occasions that looks typically rushed. There’s a lack of characterization involving its cast including Rashin. His past is only briefly glanced upon on various occasions but rarely discussed in full details. While supporting characters such as Charlotte gets more of their past unraveled, Rashin’s backgrounds are vague and is only motivated by vengeance. Thus, characterization feels a bit shallow in this series. Most of the main supporting characters only get some spotlight while others are colored with generics such as the constant apologizing or androphobia. They lack personalities such as Charlotte, Frey, and Yaya. Even more so, there are characters that are introduced on particular episodes with little depth explored on them as well. Being a one cour show, character development suffers on various degrees. There’s just little emphasis on most of them. While the series avoids the breather episode (onsen, beach, etc), there’s bits of fan service that seems out of place. Yaya plays the central role of this as she showers Rashin with affections and attempts to act like his “wife”. The result is usually a scolding on the receiving end with neither party getting satisfaction. Rashin is just one of those guys that are too focused on their goals to care about pity ideas such as love. In fact, the romance of this series is blend and hollow. Don’t expect any development in the romance territory at all. This isn’t a love story of a hero trying to save their princess.\\n\\n\r\nThe art style of this series is peculiar. It may take a bit to get used to because of its lavish brightness and mechanical like coloring. Most characters in the series are generic in particular Yaya and Charlotte. Other characters such as Shouko and Frey reveals more cleavage than should. Thankfully, most of the automatons have diversity. None of them look similar but instead gives off a unique appearance that can be noticeable. However, the action scenes sometimes seems out of space with its usage of CGI and special effects. On the other hand, backgrounds fits the setting well for its time era with its stylish architectures giving off its old English look.\\n\\n\r\nSoundtrack wise, the series is tolerable and at times stands out above others. However, some of the voice actors and actresses’ role as the characters can be a bit frustrating to endure. Yaya’s VA Hitomi Harada plays her role well but it’s a hardship to deal with her obsessive nature. Charlotte’s tsundere like voice can also be frustrating while most of the other characters’ tones hardly stands out. The OST achieves satisfaction with its pacing and matches its tones well, in particular action scenes. The OP and ED songs conveys its theme well. More noticeable is the ED song however that has garnered attention with its catchy tone of ‘Maware, Maware, Maware’.\\n\\n\r\nThis series might seem like an odd ball in the mix but it can hold itself together on occasions. However, don’t expect deep character development or a linear plot of progression. The show sets up itself with arcs but only focuses on its plot points with little emphasis on friendship, romance, or other significant themes of morality. Some stories seems a bit rushed because of its episodes pacing as well. The way to enjoy the show is to probably focus on Rashin’s motives whether it’s his quest for vengeance or goal to become Wiseman. It does portrays its premise well in technical aspects with the mechanics and setting. The tournament itself is not a pivotal factor of this show however. This is because the series also feels obligatory on occasions to pull out clichés with fan service scenes or meaningless dialogues. If it was designed as a comedy, this show would work out magnificently. But since it does have a serious plot, there’s a less reasoning for that. The way Unbreakable Machine Dolls almost is crafted will leave different impressions for everyone.",
            "date": "2013-12-23T15:12:00+00:00",
            "helpful_count": 55,
            "mal_id": 125253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=125253"
        },
        {
            "content": "Oh boy... Where to start? Unbreakable Machine Doll is quite the mixed bag. On one hand it seems to have enough ecchi to appeal to ecchi fans. On the other hand it seems to handle it's fighting scenes quite well albeit with the use of a little CGI here and there. Action fans may enjoy it as well.\r\nStory: 7\r\nOur story takes place in the early 20th century (1900's). Where science co-existing with magic has come together to develop living objects that have their own personalities. Fast forward a few years and the story follows a young puppeteer by the name of Raishin Akabane and hismachine doll, Yaya. The two must work together to achieve the title of \"Wiseman\" at their academy. A sort of king capable of almost anything. The only problem is that due to Raishin's poor grades he ends up in second last for qualifying in the \"battle royale\" out of thousands of students. And only the top 100 students can participate.\\n\\n\r\nThis is a great premise and I was excited to see how it would be executed. Alas the battles while being amazingly animated... End up being no longer than a few minutes. The thing about this season only being 12 episodes is that it has a ton of pacing problems so I can't blame them. Okay, imagine driving down a straight road with a nice fast care. Now imagine that on each side of the road there is the most incredible scenery you have ever seen. Now imagine that the car is slowly speeding up... getting faster, and faster. Before you know it, the lovely scenery has now become a blur of boobs and moe blobs. What was that? Was that just some actual plot? I can't tell. In short, this anime's first season just needed to be twice as long.\\n\\n\r\nArt: 9\\n\\n\r\nOh my Keima Katsuragi... The art is superb. The lighting is handled beautifully. You can actually see time passing as the episodes go on as dusk turns to night and night turns to dawn. The characters look uniquely 20th century-esque. This anime is pure eye candy I didn't even mind the fanservice, and I hate fanservice. But damn... The scenery is just immersing. I actually wanted to be there. The CGI wasn't all that bad, it's barely noticeable but it knocked this score down by 1 point.\\n\\n\r\nSound: 10\\n\\n\r\nThe OP and ED differ so much, but are both amazing in their own aspects. The OP gets you pumped and the ED gets you excited for the next episode... Which was kind of bad... If you followed this anime from episode 1. The OST was immersive, enhancing fight scenes pumping me up. It also handled dramatic scenes quite well, where Raishin had flashbacks about certain past events that I don't want to spoil but the OST definitely helped with me sympathizing with him. I have to say the the art coupled with the Sound is what made this show.\\n\\n\r\nCharacters: 6\\n\\n\r\nThis has to be the show's weakest point. Raishin is a pretty generic MC. His motivation for getting \"Wiseman\" is just a revenge driven plot device. Yaya is his doll that he uses to fight she is outright in love with him for some unknown reason always wanting to either marry, f*ck him, or both. This is a long running joke throughout the series and is kind of funny but gets annoying sometimes. Those are our MC's... I won't talk about any other characters because they are either unimportant or are introduced after episode 1. Just know that every girl student he meets will want his dick for reasons unclear. They are also all slightly moe... Just slightly...\\n\\n\r\nEnjoyment: 8\\n\\n\r\nI enjoyed this show immensely. The art is what kept me and the Music is what left me wanting more. The stage has been set with this first season, so I'm looking forward to season 2. The premise is quite fresh and has to be explored further. Characters were unique except for their shared moe blobness.\\n\\n\r\nOverall: 8\\n\\n\r\nThe only problems I had were the use of CGI and Yaya got annoying at some points with her jealousy over other girls wanting MC'S dick. Still, I loved everything else about this show and I think it is better than most of this season's anime. I dropped quite a few shows but not this one. I didn't really like all the moe but it was bearable to say the least.\\n",
            "date": "2013-12-23T23:01:00+00:00",
            "helpful_count": 26,
            "mal_id": 125321,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3331535.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/R3353",
                "username": "R3353"
            },
            "url": "https://myanimelist.net/reviews.php?id=125321"
        },
        {
            "content": "First of all, let me warn you that this is my first review, so I am not very adept at it. I'll do my best to give an accurate review of this show, though! I will also try not to give any spoilers.\r\nStory: 7\r\nAssuming that you have not read the light novel or the manga (in which case, you would have watched this show a long time ago), the story if fantastic but slightly confusing. The plot revolves around a futuristic world that has created magic through science. However, humans cannot utilize this magic themselves--rather, they use dolls/machines, or automatons, that can use magic fromhumans to perform tasks and battles. \\n\\n\r\nThe entirety of these 12 episodes is focused on Raishin, a boy of a highly prestigious martial arts clan. His clan is wiped out by someone, but as Raishin is on the verge of death, he is saved by Shouko, a doll-maker. Raishin is given0 Yaya, an extremely cute yet slightly yandere girl automaton, until he can fulfill his revenge.\\n\\n\r\nAs you can probably guess, this anime is filled with action and some romantic comedy (Yaya's obsessive nature is quite something, although it's not at Gasai Yuno's level from Mirai Nikki), as you see both Raishin and Yaya's growth at a magic school. Even though Raishin is ranked 2nd to last in terms of intelligence, it is quite enjoyable to see how outstanding he is in battle situations.\\n\\n\r\nNow for the confusion: the plot is extremely fast paced. Meaning, not everything is explained. This anime makes a high priority in setting cliffhangers at the end of most episodes, and as a result, many explanations are left to be too short. They are explained thoroughly in the light novel (or so I hear), but these confusions are not too important, and can easily be found online if you are set on clarifying some things. I would give this anime a 9/10 if it didn't have such confusion, but  because of this flaw this anime deserves a 7/10 for its story.\\n\\n\r\nArt: 8\\n\r\nIs there a need to explain? You can see for yourself if you watch the first 2 minutes of the episode :) Action scenes are extremely well placed, and character designs are simply amazing. The art in this anime is better than most. There were some CG moments where the art looked a bit funky, but other than that the art is awesome.\\n\\n\r\nSound: 9\\n\r\nOh my. The sounds in this anime are simply amazing. The opening is amazing, the endings (yes, there are more than one) are amazing, and the voices are amazing. The action scenes' sounds are great as well. \\n\\n\r\nCharacter: 6\\n\r\nNow this has some problems. I'm sure the anime could have a much higher rating if there was a second season, but for the first 12 episodes, there isn't much character development. Raishin is the daring person who strives to save people, as always. Yaya is obsessive and strong, although we can see a power development in her. Everyone else retains pretty much the same character save for Charl, who has minimal character development as well. However, this does not mean that the characters are not interesting. There are many, MANY points where you find that the characters are more than what they seemed--the author peels the characters one by one, revealing their true natures and powers. This isn't exactly development, of course, but rather an introduction. This is why I regret that there is no second season.\\n\\n\r\nEnjoyment: 10\\n\r\nDespite its flaws, I must claim that I enjoyed this to the fullest. Great art, amazing action, and funny romance/harem scenes made this an extremely enjoyable anime. There are a lot of things to critique, but no matter how much there are I enjoyed this 10/10.\\n\\n\r\nOverall:7\\n\r\nBecause of its bland character development and its slightly confusing plot, I would give this anime a 7. Don't get me wrong though--I highly recommend this anime to any anime lover. If you watch anime for enjoyment (as I assume most people are), this anime will not turn you down! As you can probably tell, I REALLY want a second season for a reason. I hope you at least check this out! \\n\\n\r\nP.S. Please feel free to tell me what I could improve about my reviews. Thanks!",
            "date": "2015-02-16T10:42:00+00:00",
            "helpful_count": 22,
            "mal_id": 180548,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4462028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kateraz",
                "username": "Kateraz"
            },
            "url": "https://myanimelist.net/reviews.php?id=180548"
        },
        {
            "content": "STORY: 5/10 Mediocre\r\nIn truth, I was heavily intrigued by the introduction presented by the first episode. Set in a fantasy world where magic and technology are fused together to form \"Machinart\" - Machine Magic. The core of Machinart is the development of Automatons, dolls made for battle, and our protagonist, Raishin Akabane is one of the many puppeteers out there: the ones who control the dolls, and fight alongside them.\r\nAt first, the plot focuses on Raishin trying to be the \"Wise Man\" by winning the \"Night of Walpurgis\" festival, held by the puppeteer academy he was enrolled into. Originally our hero was driven to beWise Man by the need of vengeance where he vows to kill his brother, instead as the series progresses, Raishin was thrown around into the family feuds, interfering with automaton production in the world, and entering a mess of harem with almost all the girls in the series. \\n\\n\r\nART: 7/10 Good\\n\\n\r\nUnbreakable Machine Doll features plenty of action scenes, and although some of them may be short, all of them are pretty well animated and will not leave action fans disappointed. Some of the character designs are awkward (Shoko and Frey take the cake) and some of the CGI used (particularly Sigmund) feel out of place as the rest of the artwork look so much different, as if two series from different times are put together as one. \\n\\n\r\nThat aside, the British sceneries seen in the series are definitely a delight to see. \\n\\n\r\nMy biggest complaint with the art would be the lower brightness used in the night scenes, my monitor was adjusted to its utmost brightness, yet many of the fighting scenes in the dark are a strain to watch. HD helps a bit, but if the night scenes are a bit brighter, it would’ve been much better.\\n\\n\r\nSOUND: 8/10 Very Good\\n\\n\r\nThe soundtrack is pretty decent, particularly the battle scenes, where I am very fond of the use of string intruments into the theme. The piano tracks used in slower scenes are very nice as well.\\n\\n\r\nOP is pretty average, in my opinion, it’s nothing more than a J-pop song where you can find in a lot of anime openings. ED, however, is probably the catchiest songs you can find this season, and admittedly, one of the main reasons I keep coming back every week. \\n\\n\r\nThe voice acting is fine and nothing much to say here.\\n\\n\r\nCHARACTERS: 6/10 Fair\\n\\n\r\nTo sum things up, Unbreakable Machine Doll has stereotypical characters. Raishin is your typical never-give-up, never-say-die, always-helping-others, putting-others-in-front-of-himself type of wonderful man, at least he’s not protected by some heavy plot shield as he always end up in the hospital. Yaya the “strongest automaton in the world” is so crazy about Raishin, that she would do anything for him, anything indeed. Charlotte happens to be the loner, tsundere and a rather poor decision maker. \\n\\n\r\nThe rest of the cast isn’t particularly memorable, but they tend to act in a certain (awkward) manner, probably in the writer’s attempt to make them stand out more, but that makes them rather unreal as characters. \\n\\n\r\nENJOYMENT: 7/10 Good\\n\\n\r\nThe fighting scenes are nice to see; watching Yaya getting jealous whenever Raishin is together with another female is funny; and the ED is catchy as hell. But ultimately, I feel that the weak and often confusing story and the huge amount of very dark night scenes did take away some of the enjoyment from me.\\n\\n\r\nOVERALL: 6/10 Fair\\n\\n\r\nThis series is far from over, hence the story is also left half-assed. But after watching Unbreakable Machine Doll, I feel as if we are only shown the appetizer, and the main course has yet to be served. Should Season 2 be aired sometime in the future, hopefully more things can be cleared up and we get to enjoy the whole picture. \\n",
            "date": "2013-12-24T05:23:00+00:00",
            "helpful_count": 19,
            "mal_id": 125351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2431015.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lord_Odous",
                "username": "Lord_Odous"
            },
            "url": "https://myanimelist.net/reviews.php?id=125351"
        },
        {
            "content": "I can probably sum this review up in 3 words: Needs another season.\r\nStory 7.5\r\nThe story is probably not the strongest part of this show, but that's not a problem as the reason for that pertains to plot holes that could be filled with another season. The revenge aspect of the plot is a generic plot element that wasn't really brought up to an obsessive degree which is good becaUse I would've gotten annoyed by hearing about it in virtually every scene.\r\nArt 8.5\r\nThe art and design really stands out to me, as I like how they used a steampunk style setting and used that in themajority of the series. The one gripe I do have about it was the jarring transition to CG animation during certain scenes, namely the action scenes, but the CG animation itself was utilized very well, it was just the transition that was the problem for me. The character designs were very intriguing and, at least to me, felt fresh and unique at no point did a character stand out unnecessarily and felt out of place to me.\\n\\n\r\nSound 9\\n\\n\r\nWhile the opening and ending were probably my favorite ones from the entire year, the opening because of how awesome it was and the ending cause it was catchy as hell(Spin Spin Spin Spin Spin), the soundtrack stood out very well. I like OSTs that know how to set the mood and for me, UMD's did just that. Two songs in particular were really good and definitely worth a listen to outside of the show, Magica and Bravery Steps(you'll easily notice them if you look them up), and Bravery Steps is probably one of the best instrumentals I've ever listened to.\\n\\n\r\nCharacter 8\\n\\n\r\nThis is probably where the best and worst parts of the show lie. While each character is easily likable. They also have ticks that will annoy you if you don't like seeing that kind of thing in a character. Yaya is probably the character that'll cause the most division between viewers as while she's a great supporting main character, her excessive(sometimes bordering on obsessive) loyalty towards Raishin is both a good and bad trait as while she has her moments where her loyalty is tested and that's great to see, her constant attempts to, for lack of a better phrase, get in Raishin's pants, tends to get annoying.\\n\\n\r\nOverall 8.2\\n\\n\r\nUnbreakable Machine Doll is a good series, it is well worth a watch and at no point was I ever bored by what was going on. Despite some parts that felt rush, it never felt like it was a hindrance on the series itself, the writers put out what absolutely had to be seen or heard and did it exceptionally well. Like I said there are a lot of questions left unanswered and only another season will help. If there isn't another season, then this show will be badly hurt by the lack of one.",
            "date": "2014-02-19T16:58:00+00:00",
            "helpful_count": 18,
            "mal_id": 133183,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2279127.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RApollos",
                "username": "RApollos"
            },
            "url": "https://myanimelist.net/reviews.php?id=133183"
        },
        {
            "content": "So this is what cancer feels like huh?\nI'm still gawking at how bad it was.\nUnbreakable Machine-Doll, or Machine-Doll wa Kizutsukanai in it's proper Japanese title, is set in a magical steampunk England. This hasn't really been done before so that's what'd lure most people into this horrible anime, made out of stupid and chromosomes.\nThere is no story. There really isn't. The studio's attitude was disregard plot. Acquire CGI. I suffered through 2 hours and 20 minutes (about 7 episodes) through this disease they dare call Anime.\n The sound was mediocre at best. The music was decent, but the V.A's chosen where obnoxious, loud and withouta doubt the most wrong choices for the \"characters\". I set characters in quotation marks because there wasn't much character to ruin.\\n\\n\n The male protagonist, Raishin is a dumbass (surprise surprise right?) He gets offered sex every day, with the hottest pieces of ass walking on that world, and he blatantly refuses each time. The only one he seems even slightly interested in is some random old chick who is obviously using him. Not only that he turns full emo whenever he can't even save a robot dog. Also,\\n\\n\n****SPOILERS****\\n\nIn episode 5 or 6, he turned Yaya into an unbreakable shield, but instead thought \"You know what? No, I'm just gonna get my lungs slashed instead of letting the attacker's sword shatter into a billion pieces against Yaya's arm. Thus throwing the entire match because he was afraid an unbreakable machine doll would break from some weak-ass opponent.\\n\n***************\\n\\n\nThen there's Yaya. Yaya. She is the most worthless, obnoxious and irritating Anime character I've seen in a LONG time. Not since SAO's Kirito and Asuna have I had the urge to kill myself like that.\\n\\n\n Then there's this \"Magnus\" guy. The typical OP masked guy who may or may not actually be the bad guy. It's not even the fact that they made him such a Gary Stu, but they even failed at that. He has no personality, and only seems to be able to say \"Hmph\" and \"Tsk\".\\n\\n\n Then there's the older teacher woman who already seems to know everything. Gosh. Who ever would have seen that coming?\\n\\n\n Then there's Charlotte, the typical blonde tsundere tomboy. Again, nothing new here.\\n\\n\nTHEN (Yes I'm going on a rant here) there's Fray, the obligatory white hair, red eyed anime character you see everywhere, she's also the busty clumsy one, so another Mary Sue.\\n\\n\\n\nI'm not gonna bother you all with the other horrible \"characters\" \\n\\n\\n\nAll in all this anime has given me Cancer, Aids, Malaria and Typhus, so I'm just gonna go ahead and die slowly now.",
            "date": "2014-04-21T12:39:00+00:00",
            "helpful_count": 16,
            "mal_id": 140775,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452949.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Mournz0r",
                "username": "Mournz0r"
            },
            "url": "https://myanimelist.net/reviews.php?id=140775"
        },
        {
            "content": "I am a humble and tolerant man. But there are 3 things that I simply can't forgive. People who give me orders, people who stand against me, and people who tell me that my opinions are invalid. - Loki\r\nAll right, so I have decided to review the anime \"Unbreakable Machine Doll\" which is basically a light novel adaptation by company Lerche, who directed one of my favorite anime, Danganronpa & Carnival Phantasm\r\nSTORY (8):\r\nThe story covers 3 chapters of the light novel. The first chapter involves Yaya & Raishin gets to know Charolette & Sigmund at Walpurgis Machineart Academy. The 2nd chapter involves the introduction ofnew characters like Loki and Frey. The 3rd chapter focuses on Charolette's sister, Henriette, and how their relationship as sisters develop.\\n\\n\r\nWalpurgis Machineart Academy is a school whereby they train the puppeteers to control properly their automatons. In the 1st chapter, the school organizes a tournament to the top 100 students in the academy. Whoever wins the tournament, he or she will be crowned \"Wiseman\", known as the Great Puppeteer.\\n\\n\r\nEvery chapter has one main villain. Of course this is important in most action anime.\\n\\n\r\nART (7):\\n\r\nThe art style was ok, although the colors are very bright.\\n\\n\r\nSOUND (9):\\n\r\nI honestly loved the opening and the ending. The opening is \"Annica\" that is sung by Hitomi Harada. The ending goes Maware Maware. By the way, there are some voice actors from Baka & Test who voiced the main characters like for example Hiro Shimono voiced Raishin & Hiromi Harada voiced Yaya.\\n\\n\r\nHiro Shimono voiced Akihisa from Baka & Test while Hiromi Harada voiced Himeji from Baka & Test. I was pulled into the anime thanks to these voice actors.\\n\\n\r\nCHARACTER (8):\\n\r\nSo far, in every chapter, we learn about their backstory of each of the characters like Raishin, Yaya, Charolette, Frey, Loki & Henriette.\\n\\n\r\nRaishin: He was incapable of combat but he can control his automaton, Yaya. He was ranked the 2nd lowest in the class due to the fact that he has the 2nd lowest grades in the exam. In fact, he has determination although sometimes he gets easily frustrated. He reminds me of Eren Jeager from Attack on Titans\\n\\n\r\nYaya: She is cheerful and energetic and she likes to tease Raishin. One time in the beginning of episode 1, she says \"Yaya is cute, she is the cutest in the world\", I was like so surprised that she tried to put a spell on Raishin. By the way, she is skilled in combat. Yayaboombastic\\n\\n\r\nCharolette: She is a tsundere. She is very hard on Raishin when she thought that she is doing something perverted.\\n\\n\r\nLoki: As you have seen in my first sentence, I have been inspired by Loki's statement in episode 5. Loki is smart, calm and composed.\\n\\n\r\nFrey: She is quite shy but she is kind at heart.\\n\\n\r\nHenriette: We only see her in chapter 3, she is also quite shy and gets easily timid. I would love to know more about the sister relationship development.\\n\\n\r\nI really have no problem with the characters, but I would like to know more about them.\\n\\n\r\nCONCLUSION (8):\\n\\n\r\nSo far, I enjoyed this anime despite some lack of information of some episodes. Especially, the last episode whereby the boss in the 3rd chapter disappears. There is basically an OVA which might cover the remaining chapters. I doubt that the OVA might cover the remaining 9 chapters of the light novel. But it would be wonderful to see how the story unfolds.\\n\\n\r\nI just really hope there will be a season 2 so that this season will cover all the chapters up to 12. \\n\\n\r\nI can understand that the producers did not know that there are 12 chapters of the light novel just before they created this anime. So I grade based on how worthwhile it is to watch the 1st 3 chapters that is adapted into an anime.\\n\\n\r\nOverall, I enjoyed this anime. The voice acting was good and the characters are fun. So I give this anime an 8 out of 10.\\n\\n\r\nSo in conclusion, here is my wish to MAL.\\n\\n\r\n\"Merry X'mas & Happy New Year\".",
            "date": "2013-12-23T11:47:00+00:00",
            "helpful_count": 12,
            "mal_id": 125225,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2594865.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mercury1980",
                "username": "mercury1980"
            },
            "url": "https://myanimelist.net/reviews.php?id=125225"
        },
        {
            "content": "When I first watched the upcoming fall anime trailers i thought Machine-Doll wa Kizutsukanai would become my favoured fall anime but instead became my third favourite. Based on the light novel Kikou Shoujo. Here's my personel opinion :\r\nStory: Just keep watching there's more than meets the eye! Cool yet very emotional protaganist Raishin & his doll familliar Yaya whose love for her master is beyond boundaries.\r\nArt: The only bad side about this anime is crappy CG usage in some action scenes!\r\nLately anime production studios are using too much crappy CG to save a lot of budget but atleast this one doesn't have slugish movements likeArs Nova or Tokyo Raven etc...\\n\\n\r\nSound: BGM is great, Seiyuu s are ok too, no problems so far.\\n\\n\r\nCharacter: Yaya is moe & funny. The very unique art style fits the best for Yaya!\\n\\n\r\nEnjoyment: Unlike most fall animes i watch this anime with utmost high priority.\\n\\n\r\nOverall: And let's hope they will make some follow up season or something in the future.",
            "date": "2013-11-29T06:24:00+00:00",
            "helpful_count": 11,
            "mal_id": 121737,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/270207.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Blo0dyRavensk",
                "username": "Blo0dyRavensk"
            },
            "url": "https://myanimelist.net/reviews.php?id=121737"
        },
        {
            "content": "To get a good idea of what this show is like, just imagine what a 6 year-old boy would write if he was trying to  make a story with \"badass\" protagonists and \"evil\" villains. \r\n- It has your generic harem MC (Main Character) who thinks girls have cooties. \r\n- It has the dark&edgy side-characters repeating the same cringe-worthy intro lines every few minutes.\r\n- It has the laughably poorly-written bad guy who is so poorly written that he literally says \"My greatest pleasure in life is making people sad\".  Yes, he actually says that.\r\nAs with most harems, the redeeming quality is that the girlsare mostly all great, but the MC is so shitty that the show was still quite bad.\\n\\n\\n\r\nStory 3/10\\n\r\nThe universe that the story takes place in is well written. It is a world where magicians control puppets and have them fight. It is fleshed out and the setting has a nice atmosphere that comes across nicely. That's the good part. The bad part is the events of the story. The MC has some insatiable need to get involved in the business of strangers. The writers couldn't explain it because it's so stupid; at one point they even had the MC say \"I have no idea why I'm doing this\". Anime with male MCs typically have a problem of having main characters make retarded, implausible, reasonless decisions. This show is no exception. What hurts this show even more is that we are supposed to think of the MC as a badass, despite the fact that he has a phobia of sex and avoids it at all costs. \\n\r\nHow the hell is anyone who pretends he doesn't have a sex drive supposed to be cool/badass? That is really why this show ends up being utter garbage. The girls(especially his partner) are all in love with him and want to have sex with him, yet he always avoids it and acts like the girls are about to kill him whenever one of them tries to bang him.\\n\\n\\n\r\nArt: 9/10\\n\r\nThe art and the art-style is fantastic. The outline lines for the characters are hardly visible. The art is probably the only reason why I was able to watch this dreadful show. While I was watching this, I kept thinking that it's a huge shame that this great art had to be wasted on adapting such a terrible story.\\n\\n\\n\r\nSound: 7/10\\n\r\nPretty good in the sound department. Great ED. And the OP was good as well, even if the lyrics were so edgy that it was cringe-worthy.\\n\\n\\n\r\nCharacter:  1/10 for the male characters\\n\r\n                   8/10 for the female characters\\n\\n\r\nThe male characters are terrible. The male characters besides the main character constantly repeat their own introduction lines over and over again because the writers apparently thought that was \"badass\", when in reality it's embarrassing, because you know that the staff thought it was so cool, when in reality it is so pathetic that it makes you cringe.\\n\r\nThe MC behaves in such an implausible way that its infuriating to watch. He has no desire to have sex with any of the women who want to bang him, even when they are naked on top of him. He gets annoyed by the concept of sex. The only thing he cares about is getting involved in other people's personal business. He doesn't have a desire for romance, or love, or sex. However, he has an insatiable desire to help random people for no reason (once again, he himself states that he has no idea why he does it. There is no reason for it. The writers just shallowly make him do these things so that there is a story).\\n\r\nThe female characters are great for the most part. They're all cute eye-candy and they all nicely represent their archetype that they were written as. They all have generic personalities (e.g. being a typical modern tsundere, or an overly attached yandere), but I'm fine with that. Anime girl archetypes tend to be great in my opinion, so I'm fine with typical anime girls. I wish there were more huge titties though.\\n\r\nFrey best girl.\\n\\n\\n\r\nEnjoyment: 3/10\\n\r\nThe main character's retarded behavior ruined the show for me. I'm getting sick of Japan writing such dense male main characters who are always scared of sex. It's ruined so many shows.\\n\\n\\n\r\nOverall: 3/10\\n\r\nIf you're desperately looking for a waifu, then you could try watching this show. Other than that, it's not worth your time. The generic main character ruins this show with his unrealistic decisions and actions and his phobia of sex.\\n\\n",
            "date": "2014-06-23T12:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 148247,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1285459.jpg",
                "scores": {
                    "animation": 9,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/drlupin3",
                "username": "drlupin3"
            },
            "url": "https://myanimelist.net/reviews.php?id=148247"
        },
        {
            "content": "Well, Unbreakable Machine-Doll finished airing in japan last week and I feel I should post my thoughts on it. Unbreakable Machine-Doll takes place during the early 20th century where magic and technology are used as one. This is called Machinart. The ones who practice this art are called Puppeteers. Puppeteers use this art to develop animated machines or “Dolls”. These dolls while controlled by the puppeteer, are free thinking. The dolls are powered by these circuits which were originally used for military purposes, however, over time they have spread worldwide.\r\nThe series focuses on Puppeteer Raishin Akabane and his Doll Yaya. Raishin has made it hisgoal to enter a sort of tournament and become the Wiseman. The wiseman is considered the best puppeteer and is a sort of king. Placement in the tournament is only available to the top 100 students in the school. However, his plan becomes more complicated when he receives his test grade as one of the worst students in the academy, which earns him the nickname Second Last. I give the story a 7/10\\n\\n\r\nThe art in this anime is absolutely superb! The characters looked well drawn and they looked like they belonged in that time period! I wasn’t a big fan of the CGI they put in the fight scenes, but I didn’t notice it at times. I give the artwork to this anime a 8/10\\n\\n\r\nThe voice acting in this anime was pretty good in my opinion and the music was also great! I loved the opening music. However, I’m not one to stick around for the ending theme song and the one in this anime (While catchy) didn’t encourage me at all to stay (This is my opinion. I’ve heard others have liked it a lot). Overall, I give the sound an 8/10\\n\\n\r\nThe characters here in this anime in my opinion could have been better. Everyone seemed too confusing at times. Raishin is your standard male protagonist, Yaya is obsessively in love with Raishin (As well as every other unique girl in this anime) and can cause a scene at times in public. Some of the characters do this annoying catchphrase thing where they repeat the same sentence over and over again while changing the last part (This in my opinion is very annoying at times).  I think the characters are the weakest part of this anime. I give them a 6/10.\\n\\n\r\nOverall, the anime is decently written, the voice acting and sound is great as well as the art, and the characters are very generic. I would recommend this anime to others and would watch a season 2 (If one is made). I give it an 8/10",
            "date": "2014-01-02T03:55:00+00:00",
            "helpful_count": 9,
            "mal_id": 126807,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/551719.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TMtrue",
                "username": "TMtrue"
            },
            "url": "https://myanimelist.net/reviews.php?id=126807"
        },
        {
            "content": "I didn't think the actual story of this was anything special. But honestly the characters in it are excellent. Raishen and Yaya's interactions are priceless. I'm not sure I liked Char that much, but the rest of the characters were excellent. \r\nI think I liked the ending song much better than the opener though and wish they were reversed. \r\nRaishen generally is a very sharp guy, well except for one episode where he turns into a complete idiot briefly, but soon he's right back to his calm calculating self. \r\nYaya is just awesome. I seriously want to know the backstory on this one. While theShoko flashbacks are great, in the Ovas that come with the Limited Edition hint that Yaya hated him when they first met, but now she's obsessed with him, and thinks they're married and on their honeymoon. \\n\\n\r\nYou just KNOW Shoko must have manipulated that into happening, especially considering Raishen's reactions to having a doll want him that badly. \\n\\n\r\nYes, I really get off on Yaya and her antics, she's a cutie.",
            "date": "2015-06-06T15:33:00+00:00",
            "helpful_count": 9,
            "mal_id": 189705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Silverquick",
                "username": "Silverquick"
            },
            "url": "https://myanimelist.net/reviews.php?id=189705"
        },
        {
            "content": "First and foremost, I will make my review spoiler free as I can. It’s safe to read even if you haven’t watched the show.\r\nLet’s start me review, shall we?\r\nStory: 7\r\nDuring early 20th century, by discovering “Magic circuits”, scientists found a way to give life to countless things. These magic circuits are made from complex magic and highly developed technology. Magic circuits were put into different objects to bring them to life and even give them human-like traits. An object that has magic circuits installed in it is called an “Automaton”, with humans called “Puppeteers” controlling them and providing them the “Mana “ they need todo certain actions .\\n\r\nAkabane Raishin is a puppeteer attending Royal Academy. Together with a beautiful teenage girl Yaya, who’s actually Raishin’s puppet. Royal Academy is a school specializing in training puppeteers and crowning them as “Wiseman”. Wiseman is a title given to the strongest puppeteers. Raishin has to defeat every single puppeteer in the academy to be crowned as a Wiseman. \\n\r\nThat’s basically the gist of the plot. You’ll learn some more of it by watching it.\\n\r\n7’s a perfect score to gauge Machine-doll’s plot/story.  Not so rare these days if you ask me.\\n\\n\\n\r\nArt: 9\\n\r\nAmazing CG battle sequences alone deserves a 9. Aside from the great CGs, the details on everything are smooth. This wouldn’t surprise most of us by now.  It is 2014, nothing is impossible anymore (aside from me having a girlfriend). A point I would like to add, the manga’s art style’s a bit (itsy bitsy tiny bit) different from the Anime. Not much to mention here.\\n\\n\\n\r\nCharacters: 8\\n\r\nONE YAYA, PLEASE! NO, MAKE THAT DOUBLE—NO, THREE PLEASE! An obsessed girl character isn’t that really rare for a harem. Female leads and supporting characters in Machine-doll doesn’t differ much from other harem girls. Every girl goes gaga for Raishin. Meh, wouldn’t be a harem show if he wasn’t flocked on by girls, no? Anyhow, every girl in his harem has their own different personality.  Telling who’s who might spoil you, so I won’t utter any word about them. They’re all drawn perfectly, breast size, pantsu color—I’m not trying to sound like a pervert, ok!? Lastly, they’re all waifu material.\\n\\n\r\nMusic: 8\\n\\n\r\nGiven that the series has only 12 episodes, there’s only one OP and ED theme.\\n\r\nMaware, maware, maware, maware, maware, maware, maware, maware. Don’t mind me, I’m just singing my heart out. That’s the catchy ending theme of Machine-doll. The seiyuu(s) sung it themselves! Yaya’s singing in it, too, of course. It’s so catchy I’ve been playing it for numerous times, even now while I’m writing this!  I didn’t like the OP theme though. \\n\\n\r\nEnjoyment: 9\\n\r\nI enjoyed Machine-doll a lot more that I had expected. Part of it is it’s been a while since I’ve watched a series with these enough fan service. The occasional pantsu shots and \"other\" fan service moments were satisfying for me. After all, these are what most viewers (not counting out myself) find attractive. So if you’re a fan of harem/ecchi/seinen/action shows, you’d definitely like Machine-doll. \\n\\n\r\nOverall: 8\\n\r\nI first encountered Machine-doll, if I’m not mistaken, around 2012, ‘course it was on a manga site. I click on the advance search button, clicked genres: ecchi; seinen; harem; action (three of them are my favorite genres). And then, BAMF! Machine-doll was on the first page of the results. That time, Machine-doll was about 25+ chapters. So you can imagine how hang-up I am when I finished reading them. Then last year, Machine-doll has finally turned into an Anime! I was so happy I forgot to watch it for a year (lol.  Actually, I forgot to put it on my watch list).\\n\\n\r\nPlot-wise, Machine-doll isn't really a rarity these days. Truth be told, I find it \"most common\". But that doesn’t mean I don’t like it. A lot might overlook Machine-doll because of the common plot. I find the 12 episodes too short for a series to show its real plot—how deep it is. Or maybe, Machine-doll is a failure because it hasn’t showed any serious developing within the 12 episodes? Nevertheless, Machine-doll is still a working progress, so it has a lot of potential to get better. I just hope they won’t take too much time. Lastly, I assure you that Machine-doll isn’t a waste of time. But, sadly, if you’re a fan of “deep-complicated” plots, you better pass this up. Ultimately, don’t let an amateur so-called reviewer, such as me decide for you. \\n\\n\r\nP.S.\\n\r\nI still want my own Yaya.  =(\\n",
            "date": "2014-11-09T02:43:00+00:00",
            "helpful_count": 9,
            "mal_id": 167959,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1477983.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pluslethatminun",
                "username": "pluslethatminun"
            },
            "url": "https://myanimelist.net/reviews.php?id=167959"
        },
        {
            "content": "At first I was like this, \"This show might be good.\", but I was horribly wrong. Not only did it make my hate for harems more vehement, but it downgraded what possible could have been a better story.\r\nThe story could have held up. Not really, it still would have been a piece of shit. The machine doll premise piqued my interest, but it could've been replaced with a thousand other plot devices and still would've been terrible. I understood the vengeance thing, but that main character fucker should've died. It was like, exactly like what happened to the Uchiha Clan from Naruto. His whole familygot murdered by his asshole brother. I'm guessing his brother was to be misunderstood in the end. The female characters were just there for the main character, and every other male character was an asshole. I don't know what's up with anime and making every villain just to make the main character look better. You don't have to make all the bad guys contrarily less better than the MC. And female characters can be there other than for fan service!!! Who know? Most of them literally had no purpose, and the MC had to do something to solve there problem. What almost had me interested was how that blonde dragon girl and that Felix guy might've had something. It could've happened, but naw the MC must obtain all ass in a 10 mile radius. \\n\\n\r\nThe art hurt my nuts. I had to turn the fucking brightness all the way up just to see anything. Everything looked soft and shit. Were solid lines really that hard to make? The CG was like a very uncomfortable rimjob, and titties were everywhere. These two things don't usually go hand in hand.\\n\\n\r\nI never actually heard the opening, I always skipped it. The ending was okay. It sounded like a vocaloid song I heard once. The metal slashing sound, explosion, and almost every sound in here were very unpleasant to the ears. Some the voice actors were kinda annoying.\\n\\n\r\nSpeaking of annoying, Yaya was that. She was always jealous or horny like what the fuck? MC was a duller Sasuke Uchiha if that was possible.He never fucking died either that doesn't really happen. You die when you are killed. Dragon girl I don't even remember, so she was probably unimportant. White haired dog girl did something once I think. There was a teacher or something. Someone had a sister I think. Who looked exactly like them. That brother of dog girl who didn't like things. The MC's brother was the bad guy. There was another bad guy. That's all the characters, I think. The stupid ones don't matter.\\n\\n\\n\\n\\n\\n\\n\\n\r\nYou see those spaces? It was more entertaining pressing space bar eight times than it was watching this series.\\n\\n\\n\r\nThe machine doll broke my hopes. I can never watch another mediocre anime because of this show. Now the world is, sort of like the artwork, dull. I hate everything, and when my friends talk about anime, I vomit. My condolences to whoever had to watch this show.\\n\\n\r\nActually I'm exaggerating. If you enjoyed this show, then good for you. You are not human. I hope you find a place to live. A place that'll accept you. I used to love dolls.\\n\\n\\n",
            "date": "2014-05-27T20:01:00+00:00",
            "helpful_count": 8,
            "mal_id": 144785,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/thesuperneet",
                "username": "thesuperneet"
            },
            "url": "https://myanimelist.net/reviews.php?id=144785"
        },
        {
            "content": "Machine-Doll wa Kizutsukanai\r\nThough it tries to play itself off as anything but, Machine-Doll wa Kizutsukanai is a harem anime. I am no big writer of reviews though this anime hit me in so many ways I had to add my two cents into it. Machine-Doll has a great concept though there are so many flaws one can not overlook it. I will touch on the things I enjoyed about this anime as few as they are. The artwork for this anime is spectacular. Cute with enough detail that each scene it becomes clear that the artist put in lot of time. The score to thisanime is well done matching the background music to enhance the emotional aspect the scene was trying to captivate. Now onto the things I disliked. Most might be wondering why I say this is a harem anime, the conversation between chars always leads to sexual innuendos, panty shots and girls blushing and getting jealous over the main char. What I found most annoying about this anime was the whininess of ALL the female chars. Even in situations where seriousness should have been taken it was pushed to whiny emo “I'm worthless” crap from the female chars. The storyline, while had a great concept lacked any real information give in the anime. I was hoping as the anime continued it would go deepening into the plot, though it continued to ignore any real depth. The fight scenes were decent enough though once again lack of information led to it being nothing more than an excuse to watch big breasted women jump around. If this anime was any longer I will admit I would not have forced my way through the entire thing. Though to each their own. So if you enjoy big breasted whiny emo girls, this anime is right up your alley. \\n",
            "date": "2014-03-07T11:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 134975,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1340831.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/YomiHime",
                "username": "YomiHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=134975"
        },
        {
            "content": "Fairly intriguing plot that really gets you hooked towards the end. I found the characters fun and enjoyable.\r\nHowever ended on the usual \"please buy the light novels\" cliff hanger with no real closure and clearly no intention to produce a season 2 from the studio.  Light novels don't seem to have been officially translated and for sale in English begs the question what was the point in bothering to Dub it ?\r\nOverall \r\nWhilst the anime is mildly entertaining, the fact it seems to spend the majority of its time introducing new plot threads and never really finishes them before ending abruptly is left abad taste in my mouth. I recommend you save your time and skip this one.",
            "date": "2018-07-11T17:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 283753,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6864936.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zraktor",
                "username": "zraktor"
            },
            "url": "https://myanimelist.net/reviews.php?id=283753"
        },
        {
            "content": "How people view ecchi anime, in the anime community, are vastly different. Some people can’t stand it, some people love it, and aren’t afraid to show it, others are fans but aren’t too proud of it, and there are some people who are somewhere in between. With all of these differing opinions on ecchi anime, it’s hard to determine whether an ecchi series is any good or not. How much you like a series riddled with fanservice and that, usually, doesn’t have a very compelling plot is, naturally, entirely dependent on your opinion of fanservice and how much the plot of a series contributes toyour personal enjoyment of it. Now, occasionally, like in any other genre you will have shows that will try to break the mold that has been established by so many shows that have been released before it. In the case of ecchi anime, that often is having a really good story line to go along with the inevitable breast and panty shots. That is something that Unbreakable Machine-Doll (Machine-Doll wa Kizutsukanai) has tried to accomplish. Now was it successful, or didn’t it fall flat on its face?\\n\\n\r\nStory:\\n\\n\r\nUnbreakable Machine-Doll’s story takes place in the 20th century, a time where there have been several technological advancements, especially with the use of magic. During this time period, there was a tremendous discovery. By fusing scientific and magical knowledge, humans were able to create a device that can bring inanimate objects to life, an even give them their own personalities. The militarily use for this technology came in the form of puppets. They would bring puppets to life, and train people to use these puppets for military purposes.\\n\\n\r\nThe story revolves around Raishin Akabane, a member of the Akabane clan—a clan that specializes in the use of puppets. One day, a mysterious assailant attacked his clan, and nearly all of them were killed. Raishin wants to avenge his clansmen’s deaths so he joins the Royal Academy, a prestigious school for puppeteers, in order to become the best puppeteer in the world.\\n\\n\r\nThe most interesting thing in the story is its setting. As most of you probably have noticed, most anime take place in Japan, with the second most popular setting probably being space. So to have an entire series take place in 20th century England is a nice change of pace. I was also really interested in the story’s premise. Just looking at the plot synopsis got me interested in watching this series. But, unfortunately the story never gets any better than “interesting.”\\n\\n\r\nThe first issue that I have with the story is the way that it goes about explaining everything to the viewer. It will introduce a subject, or term, to you without defining exactly what it is or what’s going on. They will have entire conversations about these things without giving you any clues or context to what they are talking about—until the conversation is already over. But, by that point, I was already annoyed. This happens several times throughout the course the series, and it gets even worse at the end, but I’ll get to that later. It’s not like they are being vague, and mysterious. They’re not giving you hints or clues, and trying to let you figure things out on your own. They’re just not telling you anything.\\n\\n\r\nThe show also tries to break away from some of the stereotypical ecchi attempts at humor, i.e. the male protagonist “tripping” and grabbing the breasts of a female character or the male protagonist having several nose bleeds because of the female characters. While there are definitely some moments that are fairly cliché in the ecchi genre, for the most part, the humor in Unbreakable Machine-Doll at least a little bit different from what you’d typically see in the genre. The problem is that it uses the same types of jokes and gags over, and over, and over again. And, honestly, they weren’t even that funny in the first place.\\n\\n\r\nAnother issue I have with the story is the way that they magically create and insert actions, conversations, and random knowledge whenever it’s convenient for Raishin. He’ll be in the middle of a battle, in which he’s getting beaten pretty badly, and all of a sudden he’ll turn the tables on his opponent and gain the upper hand. How does he do this? Apparently, he had it all planned out all along. Some random bystander will start commentating about how Raishin must’ve known about such and such all along (or “deduced” it right before hand), and had already had a plan in his mind to counter act such and such by doing such and such off screen. They don’t even show you flashbacks of when he did whatever they said he did, they just flash a picture on the screen, there will be more on that in the animation section of this review, and say that he had planned it all along.\\n\\n\r\nNow my biggest problem with the series is the way that it ended, because, it really didn’t. Remember what I said about the series picking and choosing when to explain things that they mention in their character’s dialogue? During the last two episodes they say things that were never mentioned in the series before hand, and must’ve planned on explaining things during the second season. The problem is that there is not second season, and there will probably never be one at this point. The unanswered questions are compounded because the season finale didn’t conclude the two main storylines during the course of the season: Raishin getting his revenge and becoming the best puppeteer. The only things were solved by the last episode were a few side character’s stories, and it felt like the main story was put on hold. All of this added up to a very unsatisfying conclusion, to an underwhelming story.\\n\\n\r\nAnimation:\\n\\n\r\nOverall, the animation in Unbreakable Machine-Doll is solid. The characters are all distinctive and nicely animated, and the background scenery is well done. The fight scenes in this series are also well done, even though I do have a problem with the way they chose integrate still images into them. Instead of seeing a fight scene with every frame being animated, you’ll see quick flashes of still images, which are supposed to supplement the animation for those particular actions. This happens fairly frequently, and it’s not only jarring, but it’s also disappointing. Several of the moments that were reduced to only still images would’ve looked much better if they were animated, and they would’ve made the fight scenes that much better.\\n\\n\r\nAnother thing I liked about the animation was that there wasn’t a ridiculous amount of fanservice. Was it there, and perfectly noticeable? Certainly, but it didn’t happen anywhere near as often as I expected it to. In fact, there were several episodes were there was little to no fanservice, and I thought that was refreshing.\\n\\n\r\nIt also should be noted that there seems to be some brightness issues with the lighter colors used in the series. Some of the whites, in particular, look extremely bright, and even a little blurry, on screen.\\n\\n\r\nSound:\\n\\n\r\nUnbreakable Machine-Doll’s soundtrack (OST) is fairly large, and pretty varied. There are definitely plenty of songs to fit every single moment in this series. Most of the OST is split between two song types: soft, airy, and melodic, and epic and grand. The softer songs usually rely on different string instruments and a piano to produce a lighter sound that just feels like it belongs in a fantasy show, which isn’t a bad thing considering that that is pretty much was Unbreakable Machine-Doll is. The other songs use a lot more instruments, and that big orchestral sound is perfect for the fight scenes in this series. The series only has one opening and ending, and I didn’t find either of them particularly special. While I didn’t find anything that I’d be compelled to re-listen to after this review, Unbreakable Machine-Doll’s OST was really good.\\n\\n\r\nCharacters:\\n\\n\r\nThere are two main characters in this series, Raishin and his puppet Yaya. There are also several side characters that you’ll see over the course of the series. I’ll just get this out of the way right now—there is little to no character development for any of the characters in this series. Every character in this series is pretty much the same at the end of the series, as they were at the beginning, with a few very minor exceptions. Thankfully, we do get some background information about most of them, but there are still some characters that we don’t know a whole lot about.\\n\\n\r\nBut, the characters are decently likable and enjoyable to watch. There relationships with one another do actually go through some development over the course of the series. It’s nothing substantial, but it’s definitely noticeable.\\n\\n\r\nEnjoyment:\\n\\n\r\nAs I mentioned earlier, this series never got past just interesting for me. The annoying methods of story telling, repetitive comedy, and lack of an ending didn’t really add to my overall enjoyment of this series. While I was decently entertained by Unbreakable Machine-Doll it’s not something that I’d consider watching again.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 2.5/5\\n\\n\r\nAnimation: 3.8/5\\n\\n\r\nSound: 3.7/5\\n\\n\r\nCharacters: 2.7/5\\n\\n\r\nEnjoyment: 3/5\\n\\n\r\nVerdict: 3.1/5\\n\\n\r\nWhile Unbreakable Machine-Doll isn’t bad, it’s far from being the, “Ecchi anime with a fantastic story,” that some claim it to be.",
            "date": "2015-06-10T20:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 190051,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=190051"
        },
        {
            "content": "Well, Machine-Doll wa kizutsukanai is definitely a well rounded anime. \r\nIts got bits and pieces of action, romance, ecchi, mystery, fantasy and so on. A great wide range anime with wonderful graphics that involves some 3D models during action scenes. \r\nThe downside is that it's not focused enough. If one were to watch this for purely action content then they would be disappointed. It doesn't have a specific genre to lean on.  \r\nPutting that aside, the anime starts off in the early 20th century, where the main character Raishin sets off to a new academy in order to revenge his clan's death.He aims to be \" Wiseman\" (winner of a major tournament) by defeating his enemy. Interesting plot because it's not repetitive as the protagonist slowly reveals his strength.",
            "date": "2014-02-12T22:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 132387,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3297647.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shadonmiki",
                "username": "Shadonmiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=132387"
        },
        {
            "content": "This is what the average viewer should expect when coming into this anime. the setting takes place in the early 1900's in the U.K, with most of the events taking place at the Walpurgis Academy, a School designed to teach children the art of Machinart, a fusion hybrid of technology and magic that lets a mage control a magical robot by using their own mana in a manner similar to how masters in \"Fate/Stay Night\" control their servants. the students at the school then compete in a spectated combat competition to prove who has what it takes to become the \"Wiseman\" a position of powerin the military which gives the person who holds the title of Wiseman to be able to ignore the taboos of magic set by the world. the Main Character, Raishin , goes to this prestigious academy with a Magical robot in hand named Yaya, a cute girl who looks very indistinguishable from the other female characters in the show as she was made by one of the best machinart engineers in the world. She fits the yandere archtype to the tee as she loves Raishin to extreme lengths. Raishin then uses Yaya in the competition in order to try to become the Wiseman, but sadly as soon as he gets into the school he is forbidden from entering the competition because in order to participate you need to be one of the top 100 students in the whole school to be eligible and he is almost (and I place a LOT of emphasis on the word almost) the worst student in the entire school grade-wise. his entire purpose in being there is to gain the power and experience needed to take revenge for his slaughtered family by killing his brother Tenzin who happens to attend the same school as he does (where have I seen this before). that is the overarching story for the anime in a nutshell and along with several different story arcs that take place in the show. now that I have given my summery of the anime I will give my Scores based on Story, Art, Sound, Character, and Personal Enjoyment.\\n\\n\r\nStory: 6/10\\n\r\nWhile I appreciate that this anime gives a new twist on magic and combining it with machines, I have to say the story isn't that great or original, as both the whole \"taking revenge\" story and the setting being a school have both been so overdone in anime that I cant really give it high remarks. also while some of the arcs are really enjoyable to watch at times I am more or less confused at the end of the series as it leaves a lot of questions left unanswered in this world. \\n\\n\r\nArt: 9/10\\n\r\nthe animation quality in this anime is definitely above average, the fight sequences are great (except for the cgi but that's my taste so I won't knock the score off for that) and is very fluid overall. not at the quality of Fate/Zero or the likes of that but good enough.\\n\\n\r\nSound: 6/10\\n\r\noverall the soundtrack isn't something to brag about. the music fits the show during it both suspenseful and emotional moments but nothing really catchy or something I could listen on its own except for the opening song which is ok at best on its own.\\n\\n\r\nCharacters: 5/10\\n\r\nin this series there isn't a lot of character development for most anyone in the series except for the Main Character and the Female Lead Charle. most other characters can be described in just two words. their Archetypes, while overused, did not make the series or its characters unenjoyable.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI really liked this show despite its faults. The interactions between characters were always either really silly and comedic or really heartwarming. I really did like the fight scenes in this series and there is also the idea that there is always an underlying case to solve in the series which was also entertaining to see unfold.\\n\\n\r\nOverall Score 7/10\\n\r\nthis anime isn't the best but it isn't something that should be outright avoided. all I can say is if you like the Magical world Genre, you will definitely enjoy this anime the same could be said if like either mystery or action anime. but it is not an anime that will be put into high regard anytime soon",
            "date": "2014-01-03T16:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 127029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3371887.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pman1994",
                "username": "Pman1994"
            },
            "url": "https://myanimelist.net/reviews.php?id=127029"
        }
    ],
    [
        {
            "content": "first of all, forgive me my english, take in consideration that im a french canadian, but i got the feeling to write a review for this fantastic show,that i think deserve a better rating that only 1 review with 8 as score.\r\nStory-i think the story was original, i was quite satisfied with the concept, people controlling automates to fight against each other, why not, and the yaya touch with raishin was great to see and cute in same time\r\nArt- The art was really great, a bit different from usual, but really liked this, whatever the art is lot about self opinion, everyone have different tasteso\\n\\n\r\nSound- sound was fine, specialy liked the sound during fight scene\\n\\n\r\ncharacters- Each characters had his own personality, but Yaya made really a good show for me, i liked Raishin as well and all support caracthers too\\n\\n\r\nenjoyment- if i give a note on this, i could easily give 10/10? why? because each time i had finish my episode, i was really looking forward for the next one, there was always a good thriller at the end of each episode to make you want to see absolutely the next, i have watched all the shows of this fall 2013, and i can easily say that machine doll was in my top 5, may be even in my top 3 where i was impatient to see the sequel\\n\\n\r\nOverall- if you like some fight scene, a little bit of thriller, a funny relationship with the Mc(Raishin) and the main heroine(Yaya) and yeah some ecchi scene(but really not to much, honestly) more about girls questioning their own body(boobs...) i could say there is a little harem at the end, but its really not focused on this aspect, and finally a world where puppets have pretty their own personaly and relationship with their Master, you NEED to see this fabulous show",
            "date": "2013-12-25T02:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 125487,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3257639.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/firstblood",
                "username": "firstblood"
            },
            "url": "https://myanimelist.net/reviews.php?id=125487"
        },
        {
            "content": "Story 6/10\r\nThe story is about a teenager called Akabane Raishin who wants to avenge his family.He enters a school and has his adventures helping his classmates out.\r\nThe plot has many holes and we dont really know why is he helping some girl and the political situations are really poorly explained.They started with the explanation and then stoped it moving on to the next  thing . Also the whole revenge thing was kinda forgoteen.\r\nArt 7/10\r\nThe character desing looked great,but the fights didnt meet my expecations.Sometimes it looked like robots were fighting like the scene Sigmund flies up or in some parts of the battle.\r\nSound 8/10\r\nWellnothing much to say here.I liked both the opening and the ending.The background music was OK too!\\n\\n\r\nCharacter 9/10\\n\r\nThis anime really shows itself in the character.All of them had interesting personalitys.We have our main guy Reishin whose like all typical shounen anime protagonist,Yaya whose sort off a yandere+comedy i dont know how to describe it better,Charlotte had a quite interesting background...\\n\\n\r\nEnjoyment 7/10\\n\\n\r\nI enjoyed this show very much.I would definitly reccomend it to anyone.\\n\\n\r\nOverall 7,4/10\\n\\n\r\nThis is not a serious show.If you are looking something to watch you should definitly watch this\\n\\n\r\nSorry for the grammar mistackes.",
            "date": "2014-04-09T08:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 139349,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RealityEater",
                "username": "RealityEater"
            },
            "url": "https://myanimelist.net/reviews.php?id=139349"
        },
        {
            "content": "Finished this a while ago and came upon the comments session today. There seem to be a reviews that slam this anime pretty badly.\r\nStory 7/10\r\nNot very original, typical harem-ish plot. Not much to elaborate on.\r\nArt 8/10\r\nThe art is pretty well done. Nothing to criticise here. Really like the steampunk/Victorian idea here which is a pretty good reference material for a character design course work I am doing. Raishin was more handsome in the light novel, but its fine.\r\nCharacter 7/10\r\nTypical harem shows characters with male lead and his girls. YaYa is cute as hell though. \r\nSound 11/10\r\nOne of the best soundtracks I've heard from 100+ animesI ve watched. The music really captured the mood and bring out the tension and enhanced by fight scenes. Espicially bravery steps, really got me hooked onto the fight scenes. The amazing soundtracks is also one of the main reason why I enjoyed it so much. The OP was meh but the ED was really cute.\\n\\n\r\nOverall/Enjoyment 9/10\\n\r\nReally liked this anime as I am a sucker for this kind of genre and this anime didn't disappoint me. Really loved the soundtracks!",
            "date": "2014-06-21T07:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 147843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yqdapro",
                "username": "yqdapro"
            },
            "url": "https://myanimelist.net/reviews.php?id=147843"
        },
        {
            "content": "Machine-Doll wa Kizutsukanai had a stunning beginning and an amazing world-building idea at the beginning—it was simply brimming with potential! However, as it progressed, the story fell flat and so did the characters. Although it was obvious there was a bigger background plot, there wasn't enough emphasis on it in each episode and hence the anime felt fragmented, as if you're just watching random events that ultimately led to nothing.\r\nOne of the major reasons leading to my dropping this anime was the lack of depth regarding most of the characters (though Raishin and Yaya, by default, were slightly more colorful). Half the time I hadbeen pondering why Charlotte was even part of the story (my conclusion: sexual tension and appeal to male audiences). The attempts at giving characters like Char backstories had been weak as most came off overly dramatic and instead made said characters even less realistic.\\n\\n\r\nOverall, it was a mediocre anime that basically got too uninteresting for me. Despite the attractive visuals and world-building, Machine-Doll had too passive a storyline. Those with more patience might want to stick through the whole season but if you're like me and usually give animes half a season—or less—to capture your attention, you might want to skip out on this one.",
            "date": "2014-11-01T11:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 167027,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4187635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/adeliscray",
                "username": "adeliscray"
            },
            "url": "https://myanimelist.net/reviews.php?id=167027"
        },
        {
            "content": "There's not a lot I can say about this anime, so I'll make it short and to the point.  Very uninteresting story about vengeance with a typical school setting, but intriguing world and concept.  The episodes don't really develop plot and are their for lore, character introductions, and back story.  The art is pretty good for action scenes are actually somewhat exciting but there isn't really anything too eye captivating, so don't expect stuff to wow you.  The sound is good, and fits the anime well.  With characters, there's a lot of typical archetypal characteristics, such as how the maincharacter wants to help everyone and is constantly accused of being a perv.  There's also the moe and tsundere characters, as well as the timid girl with big breasts that says rarely anything.  There are some subtle unique character points, but aside from that their pretty typical, yet entertaining and funny. There are a lot of generic things in this anime, but if you like action watch it as something on your free time, don't make it a priority.  I specifically enjoyed the anime for the interesting world, and for certain character relations, as well as for the occasional unique character moments, but it's nothing special.",
            "date": "2014-01-07T19:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 127743,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3371319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/charlytanne",
                "username": "charlytanne"
            },
            "url": "https://myanimelist.net/reviews.php?id=127743"
        },
        {
            "content": "Kazuhira's Basic as Fuq Anime Reviews: Unbreakable Machine Doll \r\nDROPPED @ Episode 10\r\nStory: 4\r\n Its unoriginal and uninspired and predictable. A typical harem battle school with a dash of revenge plot, bundled in with the idea of Pokemon. Picks up near episode 7 but by this point I just wanted it to be over.\r\nArt: 5\r\n I like the overall aesthetic of the show, the shading and lighting effects are nice, and there is a good use of panning camera on occasion. However, bad CG and boring character designs are big hits. More of a personal gripe, but there are \"side mouths\" for days! It triesto use jumpcuts to make action seem faster, just leads to bad fight choreography. A mess that would make you sick. \\n\\n\r\nSound: 4\\n\r\nLack of memorable music, decent overall sound design for action sequences. Awful OP but at least the ED was alright.\\n\\n\r\nCharacter: 2\\n\r\n Lack of depth outside of \"Light Novel Guy\" and the thirsty loli. Really not much to be enjoyed here.\\n\\n\r\nEnjoyment: 3\\n\r\n Truly a struggle to get through\\n\\n\r\nFinal Score: 3.4 (Rounded down to a 3)\\n\r\nI can not stress enough how big of a waste of time this show was. I tried to get through to the end for the sake of finishing it, but in the end, I would rather have the time I spent watching it refunded to me. \\n",
            "date": "2016-06-13T05:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 220656,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4143197.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Kazuhira1369",
                "username": "Kazuhira1369"
            },
            "url": "https://myanimelist.net/reviews.php?id=220656"
        },
        {
            "content": "Art: 8/10\r\nI loved the fights, which were animated in great detail, and the 20th century Britain setting, which influences the school area and character designs. Charlotte is probably one of the better designs, especially her clothing (that hat) and personality. Now if only she was voiced by Rie Kugimiya. \r\nStory: 4/10\r\nThe problem is that this anime had too much stuff and can't cover it all in 12 episodes. \r\nThe plot is fragmented and inconclusive at best. There was supposed to be an overarching plot about a competition among 100 people whose last one standing (remind anyone of Sekirei?) would be rewarded greatly. Instead the EveningParty isn't even a main plot point as it soon gets ignored in favor of a storytelling style like Strike the Blood's—short arcs, a few episodes long, about separate mini-villains. Slight spoilers: the ending isn't much of an ending. \\n\\n\r\nCharacter: 6/10\\n\r\nYaya was really cute, probably the most jealous character I've ever seen. Her attachment to Raishin is legendary. Charlotte's also pretty good and her interactions with Raishin are amusing.\\n\\n\r\nHowever, similar problem with story was that the anime failed to thoroughly explore character backgrounds. Aside from Yaya, Charlotte, Henri, and Frey, none of the other characters get enough attention. There are also a few flashbacks of Raishin's tragic past when his entire family was murdered, and he supposedly came to this school to take revenge. Maybe defeating Magnus is a long term goal that won't happen for a while, but you'd figure that the people around Magnus would be more alarmed that this guy committed mass murder rather than idly chatting with him (the female sensei) or using him as a bodyguard (the headmaster). Aside from Raishin, it'd help to know more about what Shouko has to do with him, who Magnus is, and why they interact the way they do. The members of the harem—well Charlotte and Henri got a lot of focus in the last arc, although their past is still a little muddy. Frey and Loki could use more development too. The worst offenders are the two other dolls that go with Shouko. I don't even remember their names because they only showed up a bit in one episode, yet they feature heavily in the ending theme animation with Yaya as the spinning dolls. I was led to believe that they were important characters but it seems they don't have much to do with the central story after all. \\n\\n\r\nEnjoyment: 9/10\\n\r\nDialogue and jokes are great. Loki's \"I am a humble and tolerant man...\" speech gets me every time. Yaya is always there to spice things up. Everyone misunderstanding Raishin, Yaya, and each other and abusing Raishin for being a pervert got a little repetitive after the 50th time but harem protagonists always get shit from everyone. The fights were pretty badass but having Raishin/Yaya get beaten up before someone else saves them or they figure out how to beat their opponent is kind of repetitive and predictable. The automata system in the anime is interesting, but I feel the fights and anime overall would more enjoyable if the audience understood its mechanics better.\\n\\n\r\nSound: 10/10\\n\r\nAs far as music goes, the opening theme was good and ending theme is #1 catchiest of the season. I think the original version is the best though, maybe I got used to it from playing it on Osu all the time, but it feels weird when a different voice begins singing it. \\n\\n\r\nVoice acting was excellent too, especially Yaya's. Same voice actress as Himeji in Baka and Test.\\n\\n\r\nOverall: 8/10\\n\r\nAs a harem series, Unbreakable Machine-Doll excels in character interactions and designs. I really like the feel of its unique setting in 20th century Britain when most other animes are in modern-day Japan. Action scenes are also great, but the mechanics aren't explained well, nor are the characters' backgrounds. Plot is often nonexistent, which is quite a shame, given the setting's potential. Still, it was a fun series to watch and Yaya deserves a second season.",
            "date": "2014-03-22T22:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 136523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/xxdeathx",
                "username": "xxdeathx"
            },
            "url": "https://myanimelist.net/reviews.php?id=136523"
        },
        {
            "content": "Unbreakable Machine Doll-- I first caught wind of this series via a promo that was uploaded to Youtube advertising the DVD Sales. I immediately was hooked. I watched all 12 Episodes, and then I turned around and bought all the English Dub of all 12 Episodes of iTunes.\r\nMy biggest problem is the story, and that's mostly because they structured it in such a way that they're hoping to get more seasons. Apparently, they've adapted the first three novels, setting four episodes per novel. While each 4 Episode arc works alone, it's the awkward transitioning between the arcs where the story falls flat. For instance, Lokiand Frey, the characters who are the main focus for Episodes 5 through 8 show up exactly 0 times in the 1st 4 episodes, when even a cameo would have worked.\\n\\n\r\nIt was very pleasing aesthetically, and the music, especially the victory theme is very good. The series takes the time to develop the motivations of the major teenage characters, and gives them personalities that make sense. \\n\\n\r\nIf this anime somehow gets any more animated continuations, (Movie or another season), it could really gain some traction and become quite the hit.  Not since either of the Fullmetal Alchemist animes have I seen such a fictional science/magic developed so thoroughly and with such internal consistency.",
            "date": "2016-02-18T17:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 211197,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208224.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnotherStatsGuy",
                "username": "AnotherStatsGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=211197"
        },
        {
            "content": "Summary: This anime is pretty good for what it is... a teaser for the light novel. This is yet another anime that tells the beginnings of a fun and interesting story but stops with no less than 5 huge plot points left unanswered. That said, if you're looking for a new light novel to read or are looking for something light with some excellent animation, cute characters and don't mind only getting part of the story you may find this enjoyable.\r\nStory: 8/10\r\nThe story is solid. There are a lot of characters which are slowly introduced and intertwine in an interesting way. The concept of automatonsis a bit overdone but is handled well (they range from animals, to dragons to Yaya who is almost human like). The anime does a great job of drawing you in and getting you interested in each of the characters and their back stories and how they interact, with the looming \"Evening Dance\" where they will all need to fight each other. The last few episodes really expanded on the story and left you with tons of unanswered questions. The story was good enough to make me want to read the LN, which rarely happens.\\n\\n\r\nArt: 9/10\\n\r\nThe art was fantastic. I loved the character models, the use of light and dark colors, and the overall effects. One thing I found absolutely gorgeous was the opening sequence where the train is going down the tracks in 3d and the characters are running along the train and dodging incoming bridges; it is impressive and well done and sets the tone for the rest of the series.\\n\\n\r\nSound: 7/10\\n\r\nThe intro theme was cool. The overall sound was OK, nothing too outstanding but it does it's job.\\n\\n\r\nCharacter: 7/10\\n\r\nThere is solid character development and an interesting and diverse cast of characters. The main characters are all fleshed out (minus MC and Yaya), their back stories explored and their motives fairly clear. There is also teaser back stories about characters that would likely play a major role in the second season of the anime were there to have been one. Each of them had a fair amount of depth considering there was only a single season and I was interested in learning more about each of them.\\n\\n\r\nEnjoyment: 7/10\\n\r\nI enjoyed this anime quite a bit. It had interesting characters and gorgeous art. The story had me interested in knowing what came next. The fight scenes were fairly detailed and action packed. IF you're not too worried about the second season and take it for what it is you can have a good experience.\\n\\n\r\nOverall: 7/10\\n\r\nI wanted to give this a higher score but I just couldn't given how it ended. It left too many things unanswered and left me feeling disappointed. If you can get over that, there is a solid story, excellent art and fight scenes and solid character development. At the end, you'll likely be left wanting more but in a good way.",
            "date": "2016-02-01T13:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 209915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4743575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Joby05",
                "username": "Joby05"
            },
            "url": "https://myanimelist.net/reviews.php?id=209915"
        },
        {
            "content": "Full Metal Alchemist V.2 the fucking MC is useless as hell. I love it. \r\nStory: What the hell am I suppose to comprehend in this anime. Literally half of it consists of cringy ass, brain-dead dialogues that make you stop watching. So many unanswered questions as the story progresses. Has random flashbacks that don't make sense. Oh my lord. If anything I watch it for the dogs.\r\nArt: Good. kawaii\r\nSound: Uhhh. didn't notice the OST so it's prob mehh.\r\nCharacter: uselesss\r\nEnjoyment: hah you can probably guess.\r\nWhy was this anime in top 10 \"badass characters\" in youtube? Someone explain.",
            "date": "2018-08-16T03:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 286598,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5636661.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Yuuki_Kiyopon",
                "username": "Yuuki_Kiyopon"
            },
            "url": "https://myanimelist.net/reviews.php?id=286598"
        },
        {
            "content": "Story (4/10) - In a world where the title of \"Wiseman\" is the ultimate symbol of superiority and power in using Machineart, a combination of magical and technological properties, brings us to the tale of a puppeteer and his faithful automaton in hopes of claiming vengeance. Aside from the main character's motivations and the magic system, not much else is told. The action-sequences weren't bad, one of the good points of this show. Somehow it has the Ecchi tag, most likely for the sole sake of Yaya's personality. After the first episode, it was hard to come back and finish, and overall felt rushed.\r\nArt (5/10)- The art style was bright and colorful, but that was about it.\\n\\n\r\nSound (6/10) - The opening song matched the atmosphere and setting well. The ending theme had a more traditional Japanese-style to it, which was a little strange since the story is based in England. But nice, nevertheless.\\n\\n\r\nCharacter (5/10) - Main character who seeks vengeance for tragic past. Check. Love-struck companion who wishes to be their wife? Check. Throw in a Tsundere-friend with the supporting cast, and what do you get? One word: Average.\\n\\n\r\nEnjoyment (6/10) - The magic system was easy to understand, but the spells were another story. Each character got enough screen-time to resolve their pasts and create character-development. Even though the ending left some questions, it was what one would expect from a series just trying to pull you in to read the source material. \\n\\n\r\nOverall (5.2/10) - This anime wasn’t necessarily bad, it just wasn’t that good either. If I could summarize it, it would be: Main character wants revenge, goes to get it, but by the end doesn’t and tries to leave a cliffhanger for fans to find out what happens next. As I said before, it was really hard for me to come back after the first episode.",
            "date": "2018-07-11T15:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 283738,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=283738"
        },
        {
            "content": "A IMP Review of: Unbreakable Machine-Doll (Dubbed edition)\r\n(IMP stands for “In My Prospective”, meaning if someone attempts to correct the way I see the show I have no intention of reading any “corrections”)\r\nStory: When i first saw the concept for this show i was generally excited to watch it and see what happened, the animations looks interesting, the characters weren't hugely special but ok, the setting was in England which when i watched it i hadn't seen done in anime often and everything was lining up for a good watch, BUT of course something wentwrong, a few things actually including but not limited to tropes, and the story. 5/10. The story is about a guy who if he finds a guy who did bad things to him or his loved ones, \"sigh\" wants revenge... I hate shows to make revenge the main motivation, Black butler did a good enough job to not be terrible (in season one) but revenge is so cliché, tropey, and just an annoying concept for a character to focus on, Back to these in characters later. When it comes to the English setting i really don't feel it would matter if this was England or japan, ultimately the only thing really English about all this was some of the characters having British voices, besides that i really didn't get immersed in the English part of the show. The tournament part was kinda boring but ok i suppose. I think one of my favorite scenes was a date scene with the MC and a contender in the tournament, which says a lot considering the show mostly focus on either a semi mystery type thing or battles.\\n\\n\r\nCharacters: 3/10. The most noteworthy characters are Yaya and Charlotte in terms of importance or just being noticed. I think the show wanted me to care about Shouko but honestly in a 12 episode show with her being a side plot development character i just didn't see the point. Yaya is extremely thirsty for out MC's dick as some characters in anime are which makes her stand out a lot, she also does most of the fighting for the MC like a Pokémon but she has no unique powers so it's hard to say if she’s really useful or not. Charlotte's voice is so heavily English that it's hard to not tell she’s on screen and some of her interactions are cute but she only adds a small bit of light to the show. The MCs revenge thing builds him up to be some great generic MC but then he's a screw up who only wins when the plot says it's ok. He relies so much on anyone else especially Yaya that it's almost sad to watch anytime he fights.\\n\\n\r\nArt: 8/10. For a show that wasn't great the art has a really unique style to it. It would fit well with an English type show if they focused more on the English part of it (its looks similar to princess principles type style but though i haven't seen the show it looks like it did a better job at it) i think it shined best in how its shading/shadows were done but I’m no expert in art so i could be just me. \\n\\n\r\nSound: I'd say 7/10 because there were scenes that had music that matched the atmosphere and the setting well. The beginning song good but the ending was more Japanese stylized which for a anime based in England makes little to no sense and offsets it from its setting even further. \\n\\n\r\nEnjoyment: I'd say 7/10. It had some good part in the show and when they treated the MC like he was not overpowered but someone to be taken seriously instead of some revenge craving moron he did a good job. The tournament fights were interesting and when they kept to the setting it was refreshing to see something other than japan. \\n\\n\r\nOverall: It wasn't the worst show, but it definitely is not a classic in my eyes. It gets a 5/10 for what it gave me when it gave it to me right. The characters and the lack of focus on the English setting dug its grave in my opinion. If the MC acted like he was a professional with the revenge thing and he wasn't all powerful then he would have made for a great MC but they had to throw the revenge in and screw it up. \\n\\n\r\nLet me tell others 2 things, 1: I will not tell you or encourage you to give the same rating, this is just my personal opinion on this show and 2: honestly I’m doing this review and other reviews as a hobby and for my own “anime records” so to speak, so if you see this and don’t like it just ignore it honestly because its more for me then to help others in the long run.\\n",
            "date": "2018-04-11T23:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 277820,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049125.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SniperKnighter",
                "username": "SniperKnighter"
            },
            "url": "https://myanimelist.net/reviews.php?id=277820"
        },
        {
            "content": "Just a quick review, in short I thought this show was simply fine.  \r\nIt's another revenge/harem anime with no shame in showing topless women and occasionally throwing in breasts as it's theme. Though fan service does turn me away from many shows because it's an excuse to derail a story and often used as a device to draw male viewers, here I could still find enjoyment in the show regardless.\r\nI don't like harem anime but this one doesn't throw the entire harem at the main character all the time so it didn't always detract from the mood, however Yaya's constant clinginess gets really irritatingand tends to throw the show off the rails more than it should.  \\n\r\nThe humor is good and the consistency of Raishin's character works for the entire show but nothing we haven't seen before: a brash but selfless hero that, while lacking in certain skills makes up for it in his sheer determination and faith in his high potential machine-doll Yaya.\\n\r\nThough this show ends at the end of a chapter and leaves on a cliffhanger so you have to read the manga to finish the story, still a fun little show that has it's moments, though repetition of breast gags, Loki quips, and Yaya moments gets old fast.",
            "date": "2016-08-04T12:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 225920,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/214105.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DueTomorrow",
                "username": "DueTomorrow"
            },
            "url": "https://myanimelist.net/reviews.php?id=225920"
        },
        {
            "content": "Plot\r\nI did like the plot and found it to be interesting. I binge watched this show in under 24hours because I wanted to know what would happen at the end. While there were some episodes that were a bit slow, overall it kept my attention. \r\nCharacters\r\nYaya really annoyed me. I understand that she had an obsession with her master (almost like a little sister obsession), but I wish it wasn't shoved in our faces multiple times each episode. There is nothing wrong with the cliche idea, but it just got to be too much. Also, her voice was really annoying. \r\nThe rest of the characterswere fine- I wish there had been more scenes where I got to know them, but in a 12 episode anime, there's but so much character development you can do, and I recognize that. \\n\\n\r\nDrawing Style\\n\\n\r\nI hated it. To be honest, I almost didn't watch the anime because I didn't like the drawing style, but obviously I ended up giving it a chance, and ended up liking the anime (even though I still don't like the drawing style). \\n\\n\r\nThe ending was really open and I do hope that they make a sequel, because I want to know what happens next!\\n\\n\r\nOverall, if you like harems with little true romance + cyborg-type machines, then I would recommend this to you.",
            "date": "2016-07-17T07:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 224245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/norih",
                "username": "norih"
            },
            "url": "https://myanimelist.net/reviews.php?id=224245"
        },
        {
            "content": "The interactions arent so cringe for this series, but i guess id tell the MC \"JUST fuck it\" like any other anime that has a chick around and the main character just refuses it from its own stupidity .Here he just refuses it and i am ok with that.Id say it kind of turns into a harem and that kind of seems a bit repetitive(as most animes out there) .You know the MC wont die since he has this grand battle ahead and he will most likely win the 1v1 with the dude with the mask , so i kind of jerked off at mostof the fights since he either A:wins or B:loses in order to become stronger , and guess what?He won all of them.\\n\r\nAnd to sum up most of the fights \"He loses ; he does something like a ace in the sleeve;wins ; explanation to it ;f*ck you\".\\n\r\nThe most interesting thing was ..the dragon , definitely the dragon with that English,something  accent.\\n\r\nWorst thing : Yaya because show/take off your pants/underwear and show me your penis;I didnt like her \"yaya this and that\" at first , but its like getting cancer and getting used to it.",
            "date": "2016-01-21T16:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 209078,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/WeabooJhones",
                "username": "WeabooJhones"
            },
            "url": "https://myanimelist.net/reviews.php?id=209078"
        },
        {
            "content": "Unbreakable Machine-Doll\r\nFor starters, steampunk environments are underdone in the mainstream anime, and when they are done, they are usually not given appropriate screen time. This is the case here, with a few early establishing shots of the city, we see the world the anime takes place in; but that is the end of it before we are withdrawn into the school setting. Everything else about the environment isn’t that interesting, so nothing else to say on the landscapes. This could’ve been a touchdown worthy feature of the anime, which sadly was not taken advantage of; leaving us with monotone forest and school interiors. \r\nThe animationwas nothing to write home about, but it wasn’t bothersome either. It made use of CG though. While I’m personally not a fan of CG, I can see where it is useful. In comparison to anime like Knights of Sidonia, where CG is used throughout the entire show to make animation consistent and to make action scenes easier to produce; it ultimately allows the animation to flow together. Here, it transitions between using CG and not, which is really distracting to the eye. It may not bother some people, others may find it infuriating. The CG only gets bad during the faster scenes, and at other times you can’t tell that it’s CG, so your opinion may vary. I’ll include the music here, as it suited the anime well enough, but it was below average on it’s own.\\n\\n\r\nThe main characters of Raishin and his automaton Yaya, aka his Doll, enter a new school (wow, how original) in order to avenge Raishin’s family.  The main character started out with some promise, as with most harem/ecchi anime protagonist being either perverts or too thick-headed to understand that girls are interested. Here, however, as the main girl is a doll, she is naturally treated as such; usually with her advances being brushed aside. I personally prefer a protagonist who has no interest in the girls opposed to two previously mentioned character types; at least in these settings I find. \\n\\n\r\nBut a problem occurs early on with Raishin, in which he states that he respects Yaya’s individual personality; and the individuality of other dolls. In respect to his stance on the treatment of dolls, he has no room to develop; and with the master and slave/doll relationship being a key feature of this anime, this gives us little reason to care. A stronger point could’ve been made by making him a massive asshole to dolls, and then having to learn. Now, it should be said that his respect for the dolls is also made through straight up dialogue, but again leaves the viewer with nothing to interpret. \\n\\n\r\nA last point on this master/slave doll dynamic, is how the supporting characters have explain why Raishin is a good guy. In the first two episodes, after meeting the second girl (Charlotte) who has a dragon doll; the dragon doll has to state to the audience that Raishin asked how asked the dragon doll ‘how he was doing?’ It would’ve been better to have just have Raishin treat the dolls better, and leave it to the audience to pick it up. \\n\\n\r\nIt’s not all bad for little, old Raishin though. As he can actually do stuff, again being said rather than shown at first, he isn’t a good doll user and has to compensate by participating in the battles alongside Yaya. It adds a camaraderie element that just seemed refreshing\\n\\n\r\n\tAs for Yaya, the doll. She is a more likable character when next to Raishin. Purely due to a more exaggerated personality, but the constant desire to rip of Raishin’s, even when he walks in bleeding, loses its charm. She, and some other dolls, are “banned”, but are still used? It’s just kind of said, but nothing really happens because of it. Yaya is apparently the best doll in the world, it takes a while to learn what’s so special. She repairs herself through being close to Raishin, explaining why she is really attached. But in the end, she nothing new or good, but adequate. The pair have some interesting dynamics that go insufficiently explored and developed. \\n\\n\r\nThere is no point going into detail about the supporting characters, as they are mainly used to state exposition, advance the plot or provide some motivation that is forgotten fairly quickly. Except for the character Frey, she got a chuckle out of me. A main concern was the inconsistency of the characters intentions, one moment they help each other but immediately after re-establish that they’ll have to fight each other. Never mind the moments where they break from task to discuss their boobs. When some extras are added in and then die, their death scene correlates with how much exposition they spouted. The ones who explained how a move worked, get knocked out quicker than the characters who only got 4 minutes of screen time. \\n\\n\r\n\tThe fights are pretty ‘meh’, usually after something happens the characters take turns explaining how and why what they did worked. This followed statements of how invincible the move is, just proceeding its failure. The lore surrounding the magic is phoned in, mainly due to having such a short time to allow for sufficient explanation; a lot can be taken at face value and it feels as though some anime forget this. \\n\\n\r\n\tThe plot is at the very least, different. The characters all want to get into an event called ‘the evening party’, fight club for the students, Raishin also wants to be a thing called a ‘Wiseman’. All of it is tied into some worldly political power struggle that never takes fruit. Also as mentioned before, this is a revenge story, you’d forget if the characters didn’t stop to talk about it. The school has a ranking system that seems to have no relevance, except for explaining character backstory. But then it takes a sudden left turn, and I found myself saying, “Where did this plot come from?” in a good way; it gave me something to think about at least. But this turn happens halfway through the series and I can imagine many a viewer concluding this show as nothing special before then. Even if the you stay till these extra details are introduced, they may fail to interest you. The series would’ve greatly benefited from being 24 episodes, rather than 12, but it seems as though they condensed something much greater into this series.\\n\\n\r\nIn Summary \\n\\n\r\n\tIf you know the type of anime you’re getting yourself into, and you like it, then go for it. A little off the rails plot, and somewhat refreshing character dynamics (I use the statement loosely) made this one slightly more enjoyable than the rest out there. In terms of harem/ecchiness, it’s pretty light. The show almost wants to give you a lot, but suffers from not being able to deliver it well enough.\\n",
            "date": "2015-11-04T04:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 202641,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4123617.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/darkfishman27",
                "username": "darkfishman27"
            },
            "url": "https://myanimelist.net/reviews.php?id=202641"
        },
        {
            "content": "Hear ye, hear ye; Lion Tamers! We begin again...\r\nThis is a difficult review to compose. Not because \"Machine-Doll wa Kizutsukanai\" is a bad show, but because it is a GREAT SHOW! It is VERY fast moving, plot points in every episode, the cliff-hangers leave you breathless. Even the music is excellent.\r\nLet's go to work,\r\nWhen I think of the number of Anime, constructed as well as this, I can count them on the fingers of one hand.\r\nThe story line begins simply enough; a teenager Raishan, of mysterious background enters a prestigious school to improve his skills in an art form only present in this alternate realityof the latter 20th century (which is the puppeteering of a machine-doll). While there, he runs into a myriad of characters, every one of which has a unique personality, with their own skill-set, and identifying traits (I know, some would say \"... I seen this stuff before ..\" and you'd be right). But try to create a new personality for yourself. This complaint was probably presented in Chaucer's time as well. Too bad, every person is born into his world, and that dictates at least part of his personality; try to escape it and become a misfit, if you dare.\\n\\n\r\nIn any case, this story has twists that Macheavelli would have been proud of. Even some of the 'good guys' get into serious trouble, only to find their way, led out of the darkness by Raishan. \\n\\n\r\nAnd then there is the character that started the entire story. While some would say, it was Raishan's brother Tenzen; I submit that Raishan was left to die, and should not have had a part to play in this drama. The true beginning of this story, is a character named Shouko Karyuusai. She even gave Raishan a choice of whether to have a part to play, or not; from the very beginning. She is quite prescient about the future, and wanted to pit the two brothers against each other. Only the audience becomes aware that Touko doesn't give a tinker's damn which one survives the exchange, as long as she is left with an intact, but dead brother to use in one of her own experiments. WOW!\\n\\n\r\nEven the ban-doll Touko delegates to Raishan, is part of her plan. And while the entire audience is dazzled by the ban-doll's hentai behavior, Toukos' intention to use Yaya to drain Raishan's energy unto death is hidden in all the charm and comedy. We even feel sorry for Touko; who 's conscience nags at her about Raishan at times, even though ultimately she will write him off as raw materials for one of her latest experiments in the creation of a new ban-doll! Exactly what Tenden did to the entire remaining parents and siblings of his own family', using them for spare parts to make his own set of ban-dolls!\\n\\n\r\nWe are left with the watching of the events unfold between Raishan and Touko, as if mesmerized by an unfolding train wreck as it expands a little more each episode, meanwhile we are diverted by a house fire in a neighboring town.\\n\\n\r\nThe house fire is the growing dread of what ends up just beginning by the 9th episode, dealing with a heretofore unknown character with her own superior ban-doll, Cedric Granville. This last thread is the part of the story that gets the most criticism by many viewers, who don't know what is going on. That event is an unfinished thread in the story, that while is very amusing to Cedric, is unrequited. The end is never in sight, which leaves the lack of satisfaction for many.\\n\\n\r\nWhile there are many other events going on in this masterpiece, the previous discussion recounts the most important issues in the story line. The story is NOT complicated. It stands as unfinished. No other criticism is necessary.\\n\\n\r\nPutting the previous comment aside, it is clear that this Anime stands very high in my book. The story is Great! The artwork matches any Anime ever made. The music, dialog, and soundtrack is quite impressive. Character development is great although short because of the unfinished thread. Machine-Doll wa Kizutsukanai is extremely enjoyable, quite funny at times, and at others very poignant and subtle. Emotions extracted range from outright laughter, to tragedy, to suspense; to that other thing, done so poorly in the rare Anime that attempts it; horror.\\n\\n\r\nIt is my hope that Machine-Doll wa Kizutsukanai gets another season, the next fully realized installment can only lead to further suspense, and a good time should be had by all.\\n\\n\r\nI give this Anime an overall score of 8.",
            "date": "2014-05-21T00:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 143987,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KD7BWB",
                "username": "KD7BWB"
            },
            "url": "https://myanimelist.net/reviews.php?id=143987"
        },
        {
            "content": "Machine-Doll yeah? Yeah, so i may be crazy but i just loved it! Its nice story but something is missing in the story. I don't know really but the thing is that i would like to see another one season of the machine-doll. \r\nSome people may disagree with me but i don't care so much. Its me who writes that review. The doll is very powerful and i love it. Not much to say more. I hope just that someone realeses another version of it or season!\r\nBy now im not done with watching im at last episode when i write it. I really recommend youto watch it!",
            "date": "2016-03-15T12:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 212999,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5258653.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Naokito",
                "username": "Naokito"
            },
            "url": "https://myanimelist.net/reviews.php?id=212999"
        },
        {
            "content": "This title I'm reviewing and \"Strike The Blood\" were, in its heart, the same thing: action/adventure anime where the male lead gets his ass handed to him constantly despite being powerful. I dropped Strike The Blood because it's basically either a rip-off or an spin-off of Certain Magical Index.\r\nUnbreakable Machine-Doll atleast gave us the \"cheesecake;\" as oppose to trying to protect them from perverse eyes. And even then...\r\nRaishin (who's supposedly a soldier) ends up either being sent to a hospital bed, raped by Yaya, or being called a pervert. And this is all despite the fact that he lost most of his family to aguy who's now \"Magnus\" of the academy he goes to.\\n\\n\r\nAll in all, it just proves once again to NEVER trust a synopsis no matter how many buzzwords they give out.",
            "date": "2014-01-03T12:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 127005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=127005"
        },
        {
            "content": "Personally I had started watching with high hopes for this series. however, as a lover of ecchi and uncensored animes, I am now ambivalent towards the show. This is not what I was looking for, but it does have its merits. \r\nStory: 6\r\nThe story is broken into three 4-episode arcs, which does affect the overall feel of the story. However the thing that brings it down pertaining to these arcs is that they are very similar. All the arcs follow the same generic storyline, and after watching to the third arc, it gets tedious and repetitive. So plot-wise its okay, i don't particularly hate it,but its just too generic of a story line to like. However if I look at it with fresh eyes its not a bad story. The elemental parts are there, there is an overarching plot, and it will give you everything you want in a story. so good but not great. Personally was disappointed because of the repetitiveness and the lack of ecchi (and by that i mean visually, script-wise it has quite a bit). Also the enemies are framed as OP and unbeatable, yet for some gadam reason the MC and his automaton always find some way of powering up and beating it at the end. which gives in to the idea of it being repetitive. \\n\\n\r\nArt:9 \\n\r\nWhereas the story was boring and repetitive, the art and animation was quite well done. The character designs are visually appealing. I personally liked the art, and the costumes since they mesh really well with the whole paradox of an ancient-advanced-techno era setting. Also, this is the first anime i have encountered that looks like it used CGI to make some of the scenes, and although it flows well, it seems too...fake. However I don't dislike it.  A couple of things are holding it back from me giving it a 10 though. (1) the brightness of the animation is too high. And its not just a problem with my display, its a problem within the anime. All the colors are washed out, and sharp, almost to a point where it hurts to watch. (2) The art is reminiscent of Rakudai kishi no cavalry, with its floatly, and plasticine colors. Everything just seems to have a sheen over it. \\n\\n\r\nSound: 10\\n\r\nOriginally I was feeling a \"9\" score here, but after thinking it through a bit more, i decided that this anime's sound warrants a \"10\". Now this is my opinion but I happen to like Yaya's voice, so much so that I actually looked up the voice actor, which is surprising for someone who doesn't pay attention to sound. I liked Yaya's voice, and none of the characters had \"out-of-place\" voices. Opening song was not that special, but the closing song was a real gem for my taste. Its fast, up beat, and it feature's Yayas voice. I don't know how they made a song moe but they did. \\n\\n\r\nCharacters:7\\n\r\nSimilar to the story, the characters are really predictable and after seeing a bunch of them its gotten really boring to watch. However if this is like the first or second anime you're going to watch then you might like it so i'll try to be objective. The MC follows the overused Zero-to-Harem archetype, yet it fails at even following that. He also suffers from MBBS (Massive blue ball syndrome) cus he wont pick a girl from the harem, or pick any of them. Even though the anime tries to convince us that the MC is absolutely crap, we as the watchers already know that he isn't. and that is because he is paired with the Best girl. The best girl is basically the opposite of the MC in terms of power, as she's the \"best automaton in the world\". She is basically the perfect girl (Yaya that is), and has an extremely ecchi thought process. all the other characters in the Harem are just your generic tsunderes and blonde girls, with no real substance except as fanservice. Another thing that bothered me was that they all had some sort of saying that quickly became overused. catechisms like \"she's the best automaton...\", \"...we are not without our flaws, but i guess mine is...\", and \"there are three things in the world I will not tolerate...\" quickly become boring as characters continue to repeat them over and over again. \\n\\n\r\nEnjoyment:9\\n\r\nI don't really care for plot so i did enjoy this anime quite a bit. It has nice art, a good song, a decent storyline and well drawn (or should i say proportioned) characters. Its not an absolute turn off, and it has enough cliffhangers to get you interested in the next episode even though you're sure of whats going to happen next. However, I cant give it a 10 because I am perverted. yep. With the exception of 1 scene, this anime has NO TITS not even censored ones. Like how am I supposed to enjoy an \"ecchi\" tagged anime if there are no tits?!?! or ass?!?! If there wasn't an ecchi tag then sure i could consider it but the possibilities for tits were endless but crushed by plot. Not that that is neccessarily a bad thing, but its a definite detriment for me.\\n\\n\r\nOverall:\\n\r\nA solid anime with great art, generic characters, and a forgettable plot. However this ranks lower for me than other ecchis because its just not great at ecchi. And at the end of the day thats what irked me the most about it. its a good anime don't get me wrong. but the lack of visual ecchi is appalling for an ecchi tagged anime. It has no good comedic value. so if you like that then go for it. if i had to quantify it then 1 for plot+1 for characters+ 2 for art + 2 for sound + 2 for enjoyment equals 8 overall. you can kinda tell i don't really like it since the best part was the sound and enjoyment, which is not exactly objective.Anyways\\n\\n\r\nPeace",
            "date": "2017-05-13T19:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 247620,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6108946.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_ecchiman_",
                "username": "_ecchiman_"
            },
            "url": "https://myanimelist.net/reviews.php?id=247620"
        }
    ],
    [
        {
            "content": "The place and time here refers to early 20th Century, when the technology and magic immersed in an Automaton's body, become its core to help it becomes a living being w/ personality. The expansion of Automaton with the intention to be a military weapon then spread all over the world. Here our main hero appears, Raishin Akabane, a puppeteer of his Automaton (Banned Doll) Yaya is joining Royal Academy, the academy full of puppeteer. His desire is to participate in Night Party, which he believes by that way he can find her elder brother who slaughtered other members of family.\r\n    I foundthe story's intriguing and somehow the Automaton concept and the match was allure me deeper, I wished to disclose how the story end. This show, even if so short (well for me after watched this show, 12 eps was not enough) developing its story and characters well. Gradually the viewers introduced to new characters and other matches, many issues in the academy itself, but all of it still attached to the goal of Raishin. The improvements happened to be so smooth yet tense and mostly get rid by matches, that's how I like it. We will be served with lots of battles full of meaning and also the deep bond of friendships.\\n\\n\r\n    Altho' almost the entire matches here won't do any terrible gore, you'll find blood, scratches, explodes everywhere all in a proper place. The enjoyment of art in every single matches are completed by the Automaton special moves. The character designs makes me interpret it as sweet, mostly uses the thin outer line and lighter colours. Along with new matches and problems, the characters are developed itself nicely, more intense one by one. The shift of their personalities too, are absorbing.\\n\\n\r\n    I think the OP theme song here is a blast, sung by Hitomi Harada \"Anicca\" has a solid rhythm, kind of pounding heart tempo while the unique and catchy ED song \"Maware! Setsugetsuka (回レ！雪月花)\" sung by Hitomi Harada, Ai Kayano, and Yui Ogura. Somehow just by listening to the ED song it can lift up my sullen mood yet it's not my favorite song which I'm willing to hear continuously. My favorite is still Anicca ᒄ₍⁽ˆ⁰ˆ⁾₎ᒃ \\n\\n\\n\r\nOverall, I give 8.5 for the series and it's pretty recommended folks~\\n\r\nPros:\\n\r\nNice animation, its pleases my eyes and brings enjoyment\\n\r\nNice theme songs\\n\r\nThe enthralling characters\\n\r\nCons:\\n\r\nThere's no 2nd season yet (whoopsie)\\n\\n\r\n*) Puppeteer: The one who controls Automaton\\n\r\n*) Banned Doll: An Automaton which made by organic parts and mechanical-magic. An Automaton is supposed to be made only through mechanical-magic.\\n\r\n*) Night Party: The match among puppeteers. The winner will get the title of \"Wiseman\". In this match, surely allure all of the top puppeteers to fight, and Raishin assumes he will find his elder brother here.",
            "date": "2016-07-23T21:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 224796,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224796"
        },
        {
            "content": "When i found this anime the art style was not for me but still i gave it a chance because great story can cover up the art style was what i always thought.\r\nSadly this show is just a mountain of anime cliches, overused settings, overused lines and you can easily predict what's going to happen, also the story pacing wasn't good too.\r\nIn the end i just couldn't care less about the characters and the story.\r\nKill la Kill, Log Horizon, The devil's a part timer, Silver Spoon and Gargantia was also released that year and just look at the quality of those anime, you cant evencompare.",
            "date": "2016-11-04T04:58:00+00:00",
            "helpful_count": 0,
            "mal_id": 233198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5048132.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DrahcirRad",
                "username": "DrahcirRad"
            },
            "url": "https://myanimelist.net/reviews.php?id=233198"
        },
        {
            "content": "Unwatchable Machine Doll\r\nI’ve never been more pissed off at Funimation than I was when I watched this show.\r\nWHY WHY WHY did Funimation waste resources on this garbage?\r\nThere are no redeeming qualities about it. The story goes nowhere and is ENTIRELY UNFINISHED. The characters are all either completely bland or actively unlikable. Finally, the animation is practically nonexistent, which is a rather gigantic problem for an animated show.\r\nMost of the libraries in my area have this piece of junk, which means it must have been on fire sale to sucker them into wasting funds on it, either that or they were donated, which is still tooexpensive.\\n\\n\r\nWhat’s so bad about it? Everything. Let’s start at the top.\\n\\n\r\nStory!\\n\r\nA bad guy is set up against the hero and the show stops before they get anywhere near a climactic showdown. If you believe you would enjoy riding a really flat, uneventful rollercoaster 1/5 of its length, then need to walk back to the start in order to go do something more interesting/fun, this still probably isn’t the show for you.\\n\\n\r\nIn three hundred minutes, they couldn’t string together anything resembling an interesting story. Pathetic.\\n\\n\r\nHere are some questions that don’t have answers.\\n\r\n1 What is a Machine Doll?\\n\r\n2 Who is the unbreakable one and why? (We have to assume it’s one of the leads, but it’s never explained.)\\n\r\n3 Why is it that every introduced character uses what’s termed a “banned doll” yet no one gets in trouble for this? I always thought “banned” meant prohibited.\\n\r\n4 Why on earth was this show localized?\\n\\n\r\nThe Big O is desperately unfinished yet a single episode of that was more interesting than this entire show.\\n\\n\r\nSometimes, when an anime turns out to be a train wreck, people will defend it by claiming “it’s an advertisement for the original work.” Well, in this case, the show is based on a series of light novels which as far as I know was not officially translated into English. So, if the thinking was that this show is so amazing that it would inspire legions of fans to study Japanese simply so they can read the light novels and learn what happens to these extremely boring characters, then someone is insane.\\n\\n\r\nArt!\\n\r\nThe art was okay. They didn’t try too hard but didn’t fail that often.\\n\\n\r\nAnimation!\\n\r\nThink of every single shortcut you can. They used them all as much as possible, and sometimes even more than that.\\n\\n\r\nCut the mouths off so you don’t have to animate talking. Check.\\n\r\nZoom far out so you don’t have to animate talking. Check.\\n\r\nFace characters backwards so you don’t have to animate talking. Check.\\n\r\nRelying on bad CGI to handle fight scenes so you don’t have to animate. Check.\\n\\n\r\nSound\\n\r\nForgettable, except that one of the leads is very irritating.\\n\\n\r\nCharacter\\n\r\nOne of the leads has a joke she uses. It’s not funny, however, either the author or studio believed that if you take an unfunny joke and repeat it many, many times, it will become funny.\\n\\n\r\nThey are wrong.\\n\\n\r\nTowards the end of the show, characters start to form relationships. This is about nine or ten episodes too late. Other than the irritating main character, everyone else is pretty flat.\\n\\n\r\nEnjoyment\\n\\n\r\nThe only way anyone could possibly get enjoyment out of this show is if they were actively looking for ways that it was badly and cheaply done.\\n\\n\r\nSome of you may be thinking that I look for bad shows or things to complain about. That’s not true. I don’t have so much free time that I can afford to throw hours and hours of it away. I just feel compelled to warn people off from the bad ones and can sit around and wait a bit to review say, Mushishi. I deliberately go into shows knowing as little about them as possible. My super-secret method for picking shows is to randomly grab something and if it’s anime, I watch it. If anything, since I am devoting what little free time I have to a show, then I am automatically trying to look for every single positive point so that I don’t feel I wasted my time. The fact that UMD fails in all aspects is not my fault.\\n\\n\r\nI suffered through all twelve episodes of this awful waste of plastic and looked at one OVA episode but enough is enough. Your time is more valuable than this. DO NOT DO IT.\\n\\n\r\nOverall\\n\r\nEven D-Frag has more redeeming qualities.",
            "date": "2017-07-17T10:46:00+00:00",
            "helpful_count": 0,
            "mal_id": 253070,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/FredDuck",
                "username": "FredDuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=253070"
        }
    ]
]