[
    [
        {
            "content": "Like Hollywood, it seems Japan is suffering from a lack of creativity recently.  Here we have been brought Akikan!, a story about empty juice cans that turn into girls.  Uh what?  It certainly is a bizarre concept and I guess it scores some points for being one of a kind in that sense.\r\nThe story revolves around your typical anime loser Kakeru.  Of course he’s a virgin.  Being a pervert is a given.  He’s never had a girlfriend, despite having the cutest girl at school practically throwing herself at him on a daily basis.  Are you retarded?  Blind?How could you not know!?  Anyway back on track, so he buys a can of melon flavored soda, drinks from it and surprise he’s lip locked on a busty girl in his apartment.  I know this will sound surprising for anime but they both become extremely embarrassed by this!  No way!  She’s also a magic powered tsundere!  Wow! I’ve never seen that before either!  You’re never going to believe what happens next either... she’s going to live with him!  Even though he’s only 16 he lives by himself.  Does this really happen in Japan!?\\n\\n\r\nWhile watching this series, if you have seen any other echii romance comedies then you’ve seen the basic plot and characters of Akikan.  It’s so similar to a dozen other shows that I almost knew what was going to happen before it actually did.  The plot is extremely thin and mostly uninteresting.  Akikan suffers from the way it seems to meander around and not settling down on what it wants to be.  Is it an action series?  Romance?  Comedy?  It tries to be too many things and ends up being nothing.  The biggest problem I had was with the introduction of this mysterious government agency that knows about the can girls and wants them to join this group called Akikan Elect and battle each other until only one is left.  By the end of the series it feels like such an unimportant part of the overall story that in hindsight they shouldn’t have ever bothered to mention it in the first place.  There are some other bizarre elements that really made no sense as well, such as the inclusion of the witch character Kochikaze.  She is very typical of the schizophrenic nature of this show.  The ending is typical of what one should come to expect from these kinds of shows.  That means nothing is resolved in terms of the character relationships with each other.\\n\\n\r\nAll that being said, it’s not completely devoid of humor or enjoyment.  Just about anyone will probably enjoy Kakeru's antics and dramatic perversions and overacting.  For a while anyway as they eventually get old and overused.  I also give the story some credit for not having every female character in the cast be in love with Kakeru.\\n\\n\r\nThe characters are a mixed bag.  Kakeru is the most animated of them all and entertaining most of the time.  Though because of his voice actor the entire time I was reminded, its Lelouch.  His personality is almost exactly like Lelouch's silly school persona.  He is completely over the top, overly dramatic, and has absolutely no tact once so ever.  The various can girls, Melon and Yell are mildly amusing and entertaining.  The relationship between Melon and Kakeru reminded me a lot of the one between Keita and Youko in Inukami!  Najimi as the childhood friend of Kakeru who is blind to her love is not anymore interesting.  The characters who steal the show are really the pair of government workers, Otoya and Kizaki.  I found the interaction between them to be pretty funny.  Most of the other characters are forgettable.\\n\\n\r\nThe animation and art are solid but unspectacular.  I enjoyed the character models and all the action scenes were well fairly exciting.  The voice cast was stellar,  it featured some of the top talent in the industry and a few of my favorites.  Unfortunately because of the unoriginality of the story too many of their performances sounded like characters from other anime.  Because of this it’s unlikely anyone is going to remember any of them for their roles.  The songs from the OP/EN were also not very inspired either.\\n\\n\r\nOverall, Akikan was a show that was mildly entertaining but completely lacking any new ideas or originality.  There are definitely better shows out there to watch than this one.  But its not a complete disaster.  If you don’t mind that it doesn’t bring anything new to the table and is as filling as an empty can of soda, then you might find some enjoyment out of it.\\n",
            "date": "2009-06-24T04:27:00+00:00",
            "helpful_count": 239,
            "mal_id": 16060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=16060"
        },
        {
            "content": "If you like the idea of a show that is entertaining, self-satirical, has 'colorful' characters and manages to save a little room for serious stuff, this could be the show for you.\r\nIf you are really into deep, complex characters with intricate winding plot twists and you looove super serious business 24/7, this is probably not the series for you.\r\nThe MAL ratings this show gets don't do it justice. Don't get me wrong, it's no masterpiece, but it's not a ~6.5 either. I can't say what people think of it, but my guess is that a lot of people take it too seriously. Most of theshow really isn't meant to be taken seriously, in fact, I would argue that it's an outright satire of the \"Hey look I found the perfect girl for me in a garbage can around the corner and I didn't even have to do anything for it\" genre. If you didn't take it that way, you probably ~would~ think it was terrible. A lot of the time, it's just making fun of itself and similar series. If that's going to hurt your feelings, or go over your head, don't bother watching.\\n\\n\r\nAs a review is \"not supposed to be a story summary\", I'm going to avoid doing that, and say that simply, the plot is ~not~ what drives this show. The plot is fairly basic, nothing very unique for the most part, though, I will give it credit on the point that it throws in a couple of unexpected serious twists to make things more interesting. In this review I'm going to focus mostly on what I think makes this show - the characters.\\n\\n\r\nWhat I like about this series is that the male lead is not the typical passive male lead character that you would usually see in this sort of series. (Randomly living with a beautiful girl out of nowhere-type) He's outwardly perverted, often sarcastic, and a 10/10 troll...but at the same time is actually a decent human being, and, yes, can even be serious once in a while. Oh, and he's voiced by Lelouch's VA, which is something you can definitely hear when he goes off on his \"speeches\". (This is more obvious earlier in the series)\\n\\n\r\nMelon is a pretty typical female lead, a tsundere, gets very indignant about almost everything, and is totally thrown off by Kakeru's antics. As well, being a 'can', she is somewhat naive, and thus even easier for Kakeru to troll almost constantly.\\n\\n\r\nNajimi is a great addition to the cast, (posisbly my favourite) and it's interesting that they managed to make a female character somewhat perverted with it being more amusing than creepy. (The facial expressions she gets are priceless.)\\n\\n\r\nYell is amusing in her \"serious business\" approach to almost everything, while at the same time, like Melon, she is very naive about certain things.\\n\\n\r\nThese characters get the most screen time while there are a number of other characters I won't be covering who range between mediocre and awesome.\\n\\n\r\nThe animation is usually meh, ok, with a couple of episodes being an exception to this rule. (6 and 11, I believe?) The music is pretty average: I wasn't a fan of either OP, though it's kind of neat that the ED is always different. (Miku fans may be pleased to hear that the planned OVA's ED will be 'sung' by Miku)\\n\\n\r\nThere are a few lines in this series (Like Kakeru tricking Melon about what \"Masturbation and Titty Fucking\" mean) that really made me kind of go: \"Wait...wait...were the fansubbers screwing with us, or did they really say that?\" (He really did say that) So, keep in mind this isn't something you want to show your 10 year-old kid or niece/nephew. BEAR IN MIND that these 'shocker' lines are not constant, so much as exceptional \"wait, what??\" moments.\\n\\n\r\nFor fansubs: I recommend Coalguys for episodes 1-7, and, well... CommieSubs seemed alright for 8-12. (Chihiro does all of them and is so-so, but they aren't my top recommendation.)",
            "date": "2009-02-12T10:53:00+00:00",
            "helpful_count": 133,
            "mal_id": 12361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51582.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ddrcrono",
                "username": "ddrcrono"
            },
            "url": "https://myanimelist.net/reviews.php?id=12361"
        },
        {
            "content": "Time to state the obvious what surprisingly hasn't been done yet. Akikan! is probably the worst anime of Winter 2009 season. Maybe even the worst series aired during last year. So after this short, engaging summary let's see why it sucks so bad.\r\nStory: Being the strongest point of this series doesn't mean it's good. Just mediocre. Again boy meets gir- pardon, can which turns into girl, they continuously argue with each other but also somehow get along. Later more cans appear and... you've seen synopsis. This story had potential, another romantic comedy but with some possibly interesting additions. Sadly it turns into plain and boringbundle of really overused cliches.\\n\\n\r\nAnimation: Here goes. Most of the time it's just lousy but still rather acceptable. But if there is any thing outstanding about this series it might be animation failures. You might have heard about episode 2. Thinking about it still sends chills down my spine, watching it makes you want to rip out your eyes.\\n\\n\r\nSound: OP/ED are nothing special, lame and annoying but you can always skip them so no harm. Music isn't even worth mentioning. \\n\\n\r\nCharacters: Did I mention mediocrity? Average but weird (this time perverted megalomaniac) high school student - checked, girl with superpowers - checked, childhood friend with crush on the main character - checked... and so on. But wait, there is something more, faggot from government who looks like mentally unstable scientist and lesbian witch classmate... thing. Bunch of lovely characters isn't it? Add poor voices (especially loli with speech defect) and voila - you're wondering all the time when they are finally going to die.\\n\\n\r\nEnjoyment: Is there still anyone who think this anime is enjoyable? Still?! Well, I was trying to warn you but go ahead, waste your time and mood.\\n\\n\r\nOverall: After this rant you probably think I'm biased against this series and exaggerate. But you're wrong. I was trying to keep watching and give it a chance but this anime failed horribly. Surely there are people who enjoy and even like it, that's ok. But let me warn other thousands of nothing expecting potential victims.",
            "date": "2009-02-09T09:58:00+00:00",
            "helpful_count": 94,
            "mal_id": 12276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83320.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Antanaru",
                "username": "Antanaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=12276"
        },
        {
            "content": "Can love between a man and a can bloom? Such profound questions like that will be asked to you as you watch Akikan, perhaps the single worst and most idiotic concept for a TV series ever, and the very moment that question becomes relevant within the series is the moment any drama or tension cannot possibly be taken seriously. Ironic then, that those parts actually end up becoming the most tolerable among these twelve, awful episodes.\r\nMost of it is comedy of the lowest grade that is impossible to unironically enjoy with the occasional can racism that comes with some fighting between different types of cans,each with a different special power and attacks whose names show how little effort was put into wrapping this thing up toghether (just for reference, one of these cans is melon juice, is conveniently named Melon, and her attacks are surprisingly named \"MELON, MELON, MELON!\" or other variations of the word melon).\\n\\n\r\nProduction values, animation and overall graphic designs of the series are awful and undeserving of something released in 2009 and would probably be mediocre at best if released six or seven years earlier, while the soundtrack offers nothing of value except maybe a shitty but somehow catchy second opening (that conveniently recycles the patchwork of the first opening) and an ending song that isn't necessarily shitty but is sung by shitty vocalists and changes every episode.\\n\\n\r\nThe award for the most aggravating presence in the series though goes to our protagonist Daichi, easily worse than any main character you can name, whose lines are more or less all facedesk-worthy throughout the series and never come close to being remotely funny or quirky even among these types of perverted male character stereotypes. The supporting cast isn't much better as they all more or less sport an unfunny/cringeworthy quirk that defines them during comedy parts like our protagonist and react in the dumbest ways during drama parts (even for this type of series).\\n\\n\r\nIt's fairly safe to say Akikan is one of the worst anime TV series in existence and should only be watched as a joke or as a challenge, and even then it manages to disappoint by presenting awfully stupid situations that more often than not cannot be enjoyed ironically due to the sheer amount of cringe in the dialogue. Nothing of value is to be found in what could possibly be the lowest point of studio Brains Base and one of the lowest points of animation in general.",
            "date": "2015-05-29T04:06:00+00:00",
            "helpful_count": 38,
            "mal_id": 189082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1331431.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Valkqt",
                "username": "Valkqt"
            },
            "url": "https://myanimelist.net/reviews.php?id=189082"
        },
        {
            "content": "Randomness, Romance, Comedy and Pervertedness all rolled into one. Honestly, there's not a single boring episode so far.\r\nThe first episode alone was hilarious. My first impression was \"WTF ROFL.\" and it still is. It isn't the bad kind of random like some animes, but the good kind that you'll laugh over and wish for more.\r\nSo the main character is a total perv..but that works just fine since he brings most of the comedy into the story. He makes sexual jokes practically all the time and has multiple girls around him.\r\nThere are themes of yuri, but that just adds to how funny and awesome it is.Sometimes it'll seem like something 'romantic' is going to happen between the main character and his childhood friend, but as soon as it gets far enough, it'll break off. Though it isn't like some series where it breaks off really quickly. The scene will be satisfying enough before that happens.\\n\\n\r\nThough the art style is..not as good as some, I suppose the story and plot make up for it big time. Just goes to show that the art isn't the only thing that makes a good anime.\\n\\n\r\nThe element of a juice can turning into a chick is quite random as well. Not to mention if they go 'flat' they will end up 'dying' so to speak. So it isn't as if these girls are imortal. Like humans, they can die just as easily if a certain criteria isn't met, aka refilling their cans with the same juice.\\n\\n\r\nAll in all it's a pretty good anime. So if you need a good laugh, I recommend this one.",
            "date": "2009-01-20T09:03:00+00:00",
            "helpful_count": 29,
            "mal_id": 11712,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60406.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KayChan4U",
                "username": "KayChan4U"
            },
            "url": "https://myanimelist.net/reviews.php?id=11712"
        },
        {
            "content": "(A Man’s Love for a Can)\r\nOn a particularly hot afternoon in mid-July, Riku Ranjo was walking along the streets of Tokyo, when suddenly he was overcome with thirst. He searched for a vending machine and found one across the street. He crossed the street, inserted the coins into the machine, and out dispensed a steel can.\r\nHe opened the can and drank it, until it was empty. Then, he noticed there was an aluminum can image displayed adjacent to the steel ones. Suddenly, he had an inspiration…\r\nWhich cans are the strongest, steel or aluminum ones?\r\nHe realized that modern physics and chemistry (i.e. stress and strain test,melting point, mass and weight scale, and ultimate tensile strength) would ruin the story. So, he decided that the cans will turn into magical girls (i.e. akikans) and they will battle each other, until the strongest type remains standing. It was a brilliant idea, and so he turned it into a light novel.\\n\\n\r\nThe light novel was received well and, soon, it was about to be an anime.\\n\\n\r\n[The Creator Meets with the Producer and Director]:\\n\\n\r\n[The director and producer are reading some passages from Ranjo’s light novel. Once finished, they put the book down and look at Riku Ranjo.]\\n\\n\r\nDirector [scratching his head]: I read your light novel and I have to ask. Won’t the viewer think it’s stupid to not use modern science to determine which metal is strongest?\\n\\n\r\nRanjo: I thought about that and realized I needed to turn the cans into girls to prevent modern science from playing a part.\\n\\n\r\nDirector: But, objectively speaking steel is stronger and heavier than aluminum.\\n\\n\r\nProducer [interrupting]: What you may say is true, but the viewer doesn’t know that. That’s why the cans transform into girls, so they can battle it out and decide which metals are strongest.\\n\\n\r\n[Ranjo nods in silences.]\\n\\n\r\nDirector: But…whatever. Okay, what about the cans transforming into girls. I know they transform because you open them and then ‘drink it’, but why girls, and not animals or guys? Is there some type of ‘magical element’ within those cans? If so, what is it?\\n\\n\r\nRanjo [shuttering]: Well…I…it’s complicated.\\n\\n\r\n[The director facepalms and shakes his head.]\\n\\n\r\nProducer [coughing]: Just ignore the director, he just can’t comprehend the ‘deepness’ of this plot and its lore. About the anime, what do you want to add?\\n\\n\r\nRanjo: Okay. I want to add many girls, preferably more than four, and have lots of action scenes. The attacks of the akikans come from their can’s favor, so for example: 'Budoko shouts grape favor attacks' and 'Melon shouts melon favor attacks.’ Simple and easy.\\n\\n\r\n[The producer shakes his head.]\\n\\n\r\nRanjo: Next, the main character will be a ‘kind’, perverted, joke-cracking idiot with next to no brain, his childhood friend will be a kind, gentle and plain girl that gets drunk off of carbonated drinks, and as for the akikans…well, some them are hot-tempered, some are cool and composed, some are completely idiots, and some are unusual. Now, as for the art and sound direction…I’ll leave that to you. Thank you, for inviting me and see you later.\\n\\n\r\n[Ranjo stands up and shakes the hands of both the producer and director and leaves. The door closes shut.]\\n\\n\r\nDirector [still face palming]: Is he gone?\\n\\n\r\nProducer: Yes\\n\\n\r\nDirector [shaking his head]: When I read the synopsis, I thought, “Okay, this is original and weird. Cans transforming into girls. That’s interesting.\" But, when I read the novel. The story contained a bunch of lame jokes, lots of unnecessary fanservice, and boring school-related crap. All of this crap is going to be in this produced anime! It’s unavoidable!\\n\\n\r\nProducer: You don’t have to be that harsh. Well, I somewhat agree that it’s weird. Now, as for the art and sound direction, let’s just hire the cheapest people and let them get to work. I can, already, imagine the viewer's reaction when they hear the generic opening and ending, a typical J-Pop song, perfect. And, the animation design for each character and background scene will be minimum and ugly as hell, especially the main character's spiky hair. \\n\\n\r\nDirector: Yes, let’s just do that and get this anime series over with! But, I’m being harsh not because of the lame jokes or the fanservice. But, because the novel and, unfortunately this anime that we are producing will never answer the most important question!\\n\\n\r\nProducer [confused]: What important question?\\n\\n\r\nDirector [smashing his hands on the table]: We never find out which cans are the strongest? I mean, are steel cans the strongest or is it aluminum cans? We just don’t know! \\n\\n\r\nProducer: Well…I…I don’t know what to say. I guess, we can leave it up to the audiences. But, I’m pretty sure, the audience will not remember this question. Hopefully.\\n\\n\r\nDirector [sighing]: Yes…hopefully.\\n\\n\r\nThe End",
            "date": "2015-07-13T20:38:00+00:00",
            "helpful_count": 27,
            "mal_id": 193340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=193340"
        },
        {
            "content": "Before I say anything else I need to state that this is a very bad anime. If you consider the quality of storyboard, screenplay, scenario and even the choice of Fukuyama Jun as the voice actor for the main character (for his sake) this is indeed a very bad anime.\r\nBut.\r\nI always try to be as objective as I can when reviewing animes and qualitywise this anime is basically gutter trash, but if you consider the entertainment you can gain if you keep the fact that it's a horrendous anime in mind, this is actually pretty \"good\". I am not sure if the producers of thisanime meant for it to happen or if it was coincidental, but it feels like this anime, unlike so many similar animes, doesn't take itself too seriously. Well apart from the female lead, but it's easy to disregard her. Infact it's easy to disregard every single character in this anime since they're all so bad. But as I said before they are bad in a funny way. There were so many facepalm moments in this anime when it came to the shortcomings of characters and character interaction that it became very entertaining. Everything was silly, the story was silly, infact the whole concept of this anime is silly.\\n\\n\r\nSpeaking of the story, what was the story? What story? The first grasp of a plot or story comes in episode 2 I think it was. When the pedophilic homosexual counsilor of the ministry of economy told the male lead character, for some strange reason, that there existed some sort of a discrepancy between steel cans and aluminum cans and that it was, yet again for some strange reason, important to once and for all come to a decision regarding this really, really, really important issue of which sort of can to use for purchasable beverages; steel or aluminum.\\n\\n\r\nNeedless to say, this story is a masterpiece when it comes to originality.  One can only ask oneself; what mastermind came up with this? There is however something worse than the story and that is the script and consequently the screenplay. Every single line that was said by one of the characters in this anime was stereotypical, clichéd and/or unfitting to the scene. Needless to say, there were some true geniuses at work when the script was written, I can tell you that. Yet I have to go back to the very important fact that seen to entertainment value it really was \"good\", even the screenplay. I laughed alot during my time spent watching Akikan, of course I laughed for the wrong reasons, or one can hope the right reasons if my hint, regarding the producers intentionally making this anime as bad as it was, is right.\\n\\n\r\nSo, if you want to see an anime filled with stereotypical characters, scenes and dialog spiced up by the fact that half the cast really are cans filled with juice or soda then you should definitely watch this. I promise you will have a good time if you're; a) watching it knowing or seeing that the quality of the anime is of a level you could surpass yourself at home with pen and paper easily or b) you're a harem fanboy.",
            "date": "2009-06-21T14:41:00+00:00",
            "helpful_count": 22,
            "mal_id": 15961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=15961"
        },
        {
            "content": "Overview:\r\nPeople complain about Hollywood being uncreative and making far too many reboots and ripoffs, but Japan is often no better in this regard. If an anime is highly successful, you can almost guarantee there will be a new ripoff series created to suck up some of that money. If the ripoff is successful, a ripoff of the ripoff will be made and so on until the quality degenerates SO far and becomes so low that not even the stupidest of otaku will buy it. In the early 2000s there was a highly successful anime called Rozen Maiden about a hikikomori (extreme social phobia) who ownsa magical doll that comes to life. The doll must then battle other living dolls until only 1 is left. A ripoff was then created called Kampfer about special fighters who each owned a special magical doll and each had to fight each other to the death because the poorly written plot demands it. Then came an anime that is so bad it makes Kampfer look like GOD in comparison! That anime is the dreaded Akikan!\\n\\n\r\nAkikan probably holds the record for the stupidest plot of any anime I have ever seen. A lonely loser drinks a can of juice, only for the empty can to suddenly become a hot babe for no reason. It is explained that scientists want to figure out which metal is best to use in cans, so they somehow magically created special cans that transform into sentient beings and must fight each other to the death in order to find out which metal is most effective. I dated a chemical engineer in college and I minored in chemistry, so I am quite familiar with laboratory tests used to determine the effectiveness of different alloys and compounds. Some of these tests include: melting point, density, the Rockwell Scale of indentation hardness, etc. You want to know what wouldn't be an effective test? Turning the fucking metals into sentient beings and making them fight pokemon style!!! Our empty can girl is named Melon because she was a can of watermelon soda. She has the ability to fight using melons. I'm dead fucking serious! The sublime idiocy of this show simply can't be overstated. The MC is one of the least likeable harem leads in anime history! Every character in this show is the most shallow, 1 dimensional archetype imaginable. It is as if this was made to spoof the magical girl genre, but this isn't actually a parody or a spoof. Akikan attempts to have the worst plot possibly ever written by man and tries to basically play it straight with forced comedy and echii thrown in.\\n\\n\r\nThe art in Akikan is actually fairly decent because this steaming pile of SHIT actually had a budget. Want to know how I know it had a budget? The MC is voiced by the same Japanese voice actor as Lelouche in Code Geass! How the hell desperate for money was that guy in order to voice act for Akikan. Lending your voice to Akikan is one very small step above sucking dicks in a backalley for crack money.\\n\\n\r\nWhenever you hear someone say the latest echii anime or magical girl anime is the worst ever, sit that person down and make them watch Akikan! You thought Absolute Duo was bad? HAHAHA NO!!! Absolute Duo is Nobel Prize in literature worthy compared to the sheer filth that is Akikan! Dante is going to have to create a new circle of Hell for the production staff of this series and whoever the hell greenlit this project!",
            "date": "2015-03-25T12:12:00+00:00",
            "helpful_count": 17,
            "mal_id": 183340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=183340"
        },
        {
            "content": "Viewers, do you fantasize about being a horny virgin can collector drinking a melon soda which somehow turns into a girl so really, you are kissing a hot girl?\r\nIf you do, this is your anime.\r\nIf you don't, you're a freaking weirdo.\r\nThis is a typical Magical Girlfriend show except your main male character are boning melon soda cans. Like all Magical Girlfriend shows, it is cliched and conventional. However, the characters and the hammy voice actors make it up.\r\nCharacters:\r\nEnter Daichi Kakeru (voiced by the same seiyuu of Lelouch), the epitome of all horny, narcissistic virgins out there in the world (we all know you are outthere). His perversion and narcissism are the highlights of the show. If you enjoy sexual humor and the MAN IS NOT A VIRGIN of TTGL's Kamina, you will adore Daichi. Lelouch's acting makes it even better because he looks very natural. This character looks so real guys may be reminded of the friend they had at college. You know, that friend. \\n\\n\r\nHis steel can girl partner is Melon, a tsundere. Her trademark is being angry and tsundere. Her character becomes more dynamic at the later episodes. Many viewers may sympathize her for being a lonely empty can. However, her character archetype as a tsundere is a cliche itself. Her weapons are not that awesome since she, uh, throws melons. She is one of lower tiered characters of the show.\\n\\n\r\nToyasaki Aki of K-On! fame (untan untan~) plays Tenkuuji Najimi. What made her a wonderful seiyuu in K-On! is used somewhat effectively in the show. Najimi is a ditz who has some slight perversion. Aki's voice fits her well, although many diehard K-On! fans may find it weird to see her in that role. I personally love her character because she's very attracted to a horny pervert for few reasons. Also, Aki's hammy acting.\\n\\n\r\nYell, sadly not voiced by EMPEROR WAKAMOTO, is a tsundere who has a fetish for moving things. She may remind users that Japan loves Rei, not Asuka, because of her silver hair and Halloween costume. Despite such cliches, she does have a badass weapon compared to Melon. Since all sport drinks are active, she sports (how punny) an Isotonic Sword which makes her look like a praying mantis. She is a bit more memorable than Melon when it comes to action scenes.\\n\\n\r\nBudoko, your essential Lolita in magical girlfriend shows, is voiced by Yuuki Aoi. Anime viewers may remember the seiyuu from the deconstructive Magical Girl show, Madoka Magica (or meduka meguca). Like all Lolitas, she does cute stuff and has purple hair. Like most Lolitas, she is useless to the story and provide only eyecandy (Furude Rika, how dare you be that one EXCEPTION). Still, the character is fun and active.\\n\\n\r\nAll the other minor characters are unnoticeable (especially one of them) except for one man, Hidehiko Otoya. Along with Daichi, he is the most awesome character in the show created ever. A government official, he stalks Daichi and other male characters. His lovely voice and expressions will only remind viewers of Ouran High School Host Club taken a step further into the dark abyss of hell. You can't really deny how awesome he is when he licks his lips in the OP.\\n\\n\r\nStory:\\n\\n\r\nThe show has a barely functioning tournament arc (I don't even call that). It relies more on romance tropes, playing with Daichi's harem relationship. The show is predictable and cliched (two deus ex machinas come into mind), but Daichi's presence is just funny as hell. There is one filler episode (Episode 10, cough cough) which is boring, but the others are silly enough to be enjoyable.\\n\\n\r\nArt/Sound:\\n\\n\r\nPassable. It is not horrible, but not Makoto Shinkai amazing. There are some off-model picturing at times. Recalling the music is as tough as playing Touhou 12 on Lunatic. The music is cliched and unmemorable at the very least.\\n\\n\r\nConclusion:\\n\\n\r\nIf you have the ability to suspend your disbelief that empty cans become girls and don't think critically, it is enjoyable. It knows it's a silly show with an absurd premise. If you can leave your Neon Genesis Evangelion Freudian psychological character analysis thinking behind, this will be a silly romp for you and everyone else.\\n\\n\r\n8/10",
            "date": "2011-07-11T03:31:00+00:00",
            "helpful_count": 17,
            "mal_id": 38974,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/497699.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yukariki",
                "username": "Yukariki"
            },
            "url": "https://myanimelist.net/reviews.php?id=38974"
        },
        {
            "content": "[Story: 4.0] Peppered with nothing but plenty of really cheap innuendo, I know that I'm not supposed to be expecting some fabulous scripting from this sort of show, contending for just some silly, cheap laughs. Yet even with this in mind, Akikan manage to be underwhelming.\r\nAkikan wants to achieve too much but lacked the effort to do any of them. It tried to pack in romance, drama, lewd dialogues, action and plenty more lewd dialogue, but was lazy in executing them. The comedy aspect is lackluster - you've seen them in practically any other ecchi series you can get your hands on and they're probablyfunnier too. Drink cans who transform in girls? Sounds interesting (albeit absurd) until one considers that beneath the gimmick, there's absolutely nothing outstanding about the whole magical/ super-powered girlfriend concept. Attempts to even provide examples of such titles would flood the page. Clichés in itself are NOT bad; it's because they are popular ideas that they become clichés. However, there’s a difference between getting inspirations from popular ideas and blatantly being uncreative. \\n\\n\r\nLastly, the series should have ended at episode 10. The last two episodes were redundant and just add to how haphazard the series is handled. For one thing, it was too late to introduce new characters. For another, it's not like it contributed anything to the plot anyway.\\n\\n\r\n[Characters: 5.5] Kakeru, the protagonist is mildly amusing in his grandeur and crazy talks, but him alone is insufficient to hold the show together when the rest of the cast is insignificant. It also helps that he's voiced by Jun Fukuyama, who did a fantastic job. However, it is also a waste to actually have Jun Fukuyama in it - and he's actually one of the few redeeming points of the series. I admit, the nonsense babbled by Kakeru garnered a few cheap laughs here and there. In the end, however, those were cheap laughs and nothing more.\\n\r\nSimilarly, it's also somewhat a waste to have Mamiko Noto in it as well. \\n\\n\r\nInitially, the gag about how Jigoro often got disregarded and treated as invisible is chuckle worthy. Sadly (and ironically), that really is all he is, unimportant enough to be considered as being 'not there'. Furthermore, the main girl turns out to be a tsundere so there's the obligatory gag that involves her physically assaulting the protagonist. Other characters need not be explained further; generic characters through and through. Also, Budoko's voice is annoying. Really, after the first episode, the series just got lazy. \\n\\n\r\n[Art: 5.5] Perhaps it is not entirely the studio's fault that the story is weak and the jokes are terrible. Perhaps it is the source materials themselves that are bad - I wouldn't know; I've read neither the novel nor manga. However, when it comes to production values, the studio has no excuse and this is the bit that came to be a surprise: Akikan is made by Brains Base. Although it is unreasonable to expect a studio to constantly create high quality productions and unrealistic to hope that all the works are to one's liking, Akikan is really a far cry from Brains Base’s portfolio, including but not limited to Natsume Yuujinchou, Baccano! and Kurenai. Akikan has the worst quality of the lot. To compare on a broader scale, Akikan isn't any better. For a series made in 2009, the art quality is inadequate.\\n\\n\r\n[Music: 6.0] Music was average, typical cutesy songs. BGM was kind of lacking as well. Well then again, this being mainly a comedy, expecting Yuki Kajiura level of pieces would be superfluous.\\n\\n\r\n[Summary] Akikan is, to put it simply, devoid of creativity. Plenty of titles in its genre have done the things it did and better. Really, there are just so many other titles to watch other than this.",
            "date": "2012-03-05T18:09:00+00:00",
            "helpful_count": 15,
            "mal_id": 55403,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165681.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nilvius",
                "username": "Nilvius"
            },
            "url": "https://myanimelist.net/reviews.php?id=55403"
        },
        {
            "content": "Akikan! is a sort of Master and Servant genre type of anime. But unlike other Master and Servant animes the male protagonist here is a pervert who knows when to show it. This story tells us about a boy named Kakeru who drank Melon soda that turned into a girl named Melon, they are called Akikans. But she isn't the only akikan in this story.\r\nStory\r\nThe story for me was very good. The story just doesn't revolve around a pervert doing perverted things *coughHeismyMastercough*. The story was full of comedic moments that still connected to what the story was going to be. It was full ofdrama as well.\\n\\n\r\nArt\\n\r\nThe art was great, I loved the sad parts of the story the facial expressions during those moments are very well detailed and it fits perfectly to the genre the story holds.\\n\\n\r\nSound\\n\r\nThe Sound was outstanding, the opening themes were really great *tips hat to little non*. They did a great decision letting Little Non sing \"Juicy Extacy\" for their opening. The Explosions were very great as well.\\n\\n\r\nCharacter\\n\r\nNow the character for me here didn't go so well for me, Because the story was way too damn short for more character development. I only wished the story was Longer.\\n\\n\r\nEnjoyment & Overall\\n\r\nI really loved the story but not so much. Its a great story that definitely needs to be watched by fans out there.",
            "date": "2009-05-03T20:16:00+00:00",
            "helpful_count": 13,
            "mal_id": 14766,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174067.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/eX",
                "username": "eX"
            },
            "url": "https://myanimelist.net/reviews.php?id=14766"
        },
        {
            "content": "For some reason, I had to write a review for this anime. \r\nAkikan! is has to be the worst anime (by comparison) I've watched so far. I'm not saying it's bad; not at all. It does have its good points, but only a few. I'm actually quite disappointed in it. \r\nStory= 7\r\nThe story is about juice/soda cans transforming into girls once you take a sip out of them, and have magic powers based on what their drink is. When I was first introduced to the story, I thought \"What the hell?\" Well, I'll give it a good score for originality. It's weird, but original. So,in a sense, it's a good thing.\\n\\n\r\nArt/Animation= 5\\n\r\nThe art scores the lowest for me. I was a little weirded out by how the characters were drawn. One of the factors of making a good anime is good character art. And Akikan! failed at making any appeals whatsoever. The main protagonist Daichi, Kakeru looks a lot better in the manga than in the animated version. Animation could use some work too, but it isn't that bad. \\n\\n\r\nSound= 6\\n\r\nThere's nothing special to point out about the sound. I mean, the voice acting is pretty okay, and the opening and closing songs were alright. So I can only give it a 6. \\n\\n\r\nCharacter= 7\\n\r\nTsundere, Perverted lead, Childhood friend. Most of the characters are pretty much cliche. But what I found unique about this anime is how open it is to homosexual characteristics. Especially that Otoya guy, who is a molester. I also  like how Amaji is barely noticeable every time. But I am quite sick of perverted leads. \\n\\n\r\nOverall Enjoyment= 6\\n\r\nAkikan! could have been better than how it is now. If only the art can be improved, I think it'll get a better score. But it'll never get a rating of 8 or above. Story is unique but really weird. Some characters are really annoying (Especially the main lead) I did enjoy some parts of it. But will I watch it again? Never.",
            "date": "2013-04-14T21:19:00+00:00",
            "helpful_count": 10,
            "mal_id": 93819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2189923.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaiserLos24",
                "username": "KaiserLos24"
            },
            "url": "https://myanimelist.net/reviews.php?id=93819"
        },
        {
            "content": "This show......, I really am liking this show, it is like a classic guy = master girl = fighter or something like that where they have a relationship too.  This show is absolutely pointless and the battle is stupid but that just makes it all so funny.  It is not serious, but it is a great show.  I cant wait for the next episode and the comedy is unique and always funny.  THe action seems like it might get good and I cant wait to see what kind of boyfriend this guy will be and to who?",
            "date": "2009-01-20T15:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 11727,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36538.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/thunderbolt3",
                "username": "thunderbolt3"
            },
            "url": "https://myanimelist.net/reviews.php?id=11727"
        },
        {
            "content": "Akikan, being a Romance-Comedy anime lives up to its expectations, firstly this anime is often extremely amusing, got me liturally ROFL alot of times :), Character choices and developments is acceptable yet disapointing, The art is leaning towards decent side. \r\nThe story of Akikan is wearid yet interesting, with anime, the more 'out of this world' the more interesting, Overall i'd give it a 8/10 for being a enjoyable anime when i was bored, This anime possesses protential that of Sekirei and FTS but it fails in its detail in character development, i'd say i enjoyed it alot more even though now taht i reflectto it it seemed more like a average anime to kill time",
            "date": "2009-08-19T18:35:00+00:00",
            "helpful_count": 10,
            "mal_id": 17909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72819.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Keyira",
                "username": "Keyira"
            },
            "url": "https://myanimelist.net/reviews.php?id=17909"
        },
        {
            "content": "If there was an institution that kept a list of animes with the biggest number of sexual jokes, Akikan would top the list every single year. This anime is a one big sexual joke. Some reviewers talk about a bit of seriousness and drama? No. Akikan is like an anime version of stand-up comedy involving several performers. \r\nThe story follows a teenage guy, named Kakeru Daichi. He's a lonely, girlfriendless pervert who has only one thing going on in his mind at any given time - sex. Apart from his lewd ways, Kakeru collects soda cans. It just so happens that one day after hisusual trip to the local vending machine, Kakeru frees a beautiful girl from a SODA CAN by drinking it. Anyone thinking about a genie in a lamp? Because I sure as hell was. It's just so cheesy, so blatantly cheap... anyone can come up with a story like that. So a big disappointment there, the story majorly sucks. \\n\\n\r\nThen however, a miracle happens. This anime was not actually meant to be serious, the first few scenes which involve touching narration imply that we're dealing with a serious, kimi ga nozomu eien type of anime. Literally a few seconds later, you can see that the intro was decieving. This anime is all about comedy and most of it is directed at adult audiences. \\n\\n\r\nAs the story progresses we learn many more things, for example that the girl Kakeru freed is called an \"Akikan\" (hence the title) and that there are many more out there. Another thing is that they develop a master-servant relationship with their liberators or \"owners\" as they're called in the anime. No real suprise there however. We could all see that coming since the whole girl in a can theme was probably based on... yes I've said it before - the genie in a lamp. Only difference though is that Akikans don't actually grant wishes.\\n\\n\r\nThe comedy is good however and the range of characters this anime has is to say the least, impressive. We have the perverted Kakeru, we have a witch, a bisexual goverment official and his strict subordinate, their duo reminded me of Shunsui Kyoraku and Nanao Ise from Bleach. We have a girl who desperately wants to get laid with Kakeru, I won't mention why because that would spoil the story. We then have a few more Akikans and a few more shady characters, throw them all together and mix and you have a recipe for a funny anime.\\n\\n\r\nHowever one thing that should be noted is that the overwhelming majority of jokes are sexual with penis jokes being to most common. If I recall correctly Kakeru even mentiones that the \"penis is the future of Japan and that with it he shall be victorious\" or something like that. So I'm giving you a heads up, discretion is advised.\\n\\n\r\nSex is mentioned so many times in this anime that at times it makes you think that this series was made in an attempt to encourage the Japanese youth to procreate more, in light of the fact that Japan's aging population is dropping at an alarming rate. At least that's the impression I got when I watched it. \\n\\n\r\nArt and sound are good, no complaints in that department. Some of the music used in this anime is actually very catchy which pleasantly suprised me. The sounds are authentic and voice acting is alright too. This is definitively where a lot of the points are going to go.\\n\\n\r\nOverall, a good anime, providing you like watching comedies filled with sexual innuendo. I'll say it like this, watch this anime for laughs and you'll enjoy it. \\n\\n\\n\\n",
            "date": "2012-02-22T11:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 54483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=54483"
        },
        {
            "content": "“CO2 Cans, talking and alive”\r\nThe Story… \r\nFirst of all there isn’t much story occurring in this anime, it’s all about the comedy and ecchi moments that makes it bearable to watch. As for the story, it leads to an intro that ‘cans’ can turn into a human being particularly into a girlish one and by touching its lid by the lips it will activate its transformation. It also has a little love issues and minor arc that gives us curiosity but what they did is they focus on just giving laughs and seductive scenes. \r\nIt has a capable to be an interesting story but whatthey did is quite sadden me.\\n\\n\r\nArt & Animation…\\n\\n\r\nThe animation is fine and quite attractive. The backgrounds are somewhat suited in some scenes as it doesn’t stand out on giving entertainment. The characters are in its typical approach, and how they’re drawn is common.\t\\n\\n\r\nSound…\\n\\n\r\nIt has a quite catchy OP & ED. It gives an average sounds and music to hear. \\n\\n\r\nNothing to impress on and to be happy on it…\\n\\n\r\nCharacter…\\n\\n\r\nFor the characters on this show, they're quite interesting to watch as they give laughs and gags to keep the show alive but it isn’t enough for this anime to keep it up. Kakeru the one who always appear to the show is quite silly for us to be entertainment while his partner Melon is the one who makes his day miserable and merry as it gives laughter. Other than that there is nothing to be focused on to this show because the others are rather an addition to fill the series. \\n\\n\r\nEnjoyment…\\n\\n\r\nYou’ll enjoy this on what you’ve seen and perceive on its scenes. The characters keeps me entertained while the art & animation isn’t attractive enough. About the story and the sound it has a weak approach to be attractive. In short it is kind of an average show.\\n\\n\r\nOverall…\\n\\n\r\nIt’s an odd anime and it lacks on development and ideas to be added on. It is an average show that keeps the viewer to be entertained. No more, no less.",
            "date": "2010-02-13T02:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 23200,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=23200"
        },
        {
            "content": "Think your typical male protagonist tossed into a situation which leads him to becoming popular with a select few ladies.\r\nThink magical girl transformations.\r\nThink... cans transforming into girls?\r\nNow take a step back and recheck everything that's happened so far and you have the premise of Akikan! which leaves a rather awkward feeling at first which just makes you burst out laughing after Jun manages to portray a rather unique character in Kakeru, the protagonist for this series.\r\nWhat could be more hilarious than a very humorous sudden-girlfriend-appearance set-up than Kakeru being stark naked as Melon shows up and continues on as if nothing has happened?\r\nWhat this animelacks in actual storyline it makes up for with rather enjoyable humour, albeit awkward at times.\\n\\n\r\nI mean, come on, the story itself is supposed to be the display of a 'war' between girlished steel cans and aluminium cans.\\n\r\nCan't really say there's much room for potential there.\\n\\n\r\nMoving on, the cast themselves all had their highlights throughout the show.\\n\r\nNajimi with her overly perverted mindset, Yurika's mysterious allure and Hidehiko's bizarre character to name a few.\\n\\n\r\nOverall the series provided quite a few laughter inducing moments and came off as worth the time, but only just.\\n\\n\r\nMy rating for the series remains at:\\n\r\n6/10.",
            "date": "2012-03-08T17:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 55589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/437896.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ampzz",
                "username": "ampzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=55589"
        },
        {
            "content": "Well, this is the first anime I actually watched all the way through (Sad, I know). But because usually the anime's I watch/manga's I read are shonen and very action based, rather than just light hearted and funny, this was a nice change.\r\nI loved the characters in this anime. Kakeru was your typical anime pervert, yes, but he also had a caring side. He started to actually care about Melon and what she wanted and that she was lonely. Melon was also a great character. She has a wide range of emotions. Sometimes she gets really angry. Other times, she's sad and lonely. And shedoes have a happy side as well. I actually enjoyed most of the characters in this story. The banter between Otoya and Kiziki was just hilarious :P I would've loved to see a bit more of Yurika and Gigolo though, and maybe a little more of Budoko's Owner. Even though Budoko annoyed the heck out of me, I think we still could've learned a bit more about her owner.\\n\\n\r\nNow, I haven't read the light novel the anime is based off of, but apparently there is another Akikan they didn't mention that's in the novel. I really would've liked to see her in the anime, rather than the Rainbow Splash Mixer Akikan. \\n\\n\r\nMy few complaints about this anime is that I was hoping for some kind of resolution by the end, or maybe for it to go a bit longer and have some kind of resolution. But I guess that's the Shonen, 200+ episode fan in me talking. \\n\\n\r\nAnyway, this show was a great way for me to kill some time during the summer and I got some entertainment out of it as well :)",
            "date": "2009-10-30T22:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 20127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/253006.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tsukasloth",
                "username": "tsukasloth"
            },
            "url": "https://myanimelist.net/reviews.php?id=20127"
        },
        {
            "content": "Let's start with the fact that \"yes this anime has a very interesting plot concept. No they do not embellish on it.\" The story does revolve around this supernatural phenomena, but then it puts out nothing. The humor in here is either very perverted or moderately funny (unless you love ecchi, then its both). The fight scenes in here were as well tasteless with little to no finesse. It just didn't have it's own flare.\r\nAND NOW FOR MY MOST STRESSED DETAIL IN ANIME HISTORY! ~THE ENDING!~ (Dramatic drum roll)... It was terrible! Really, it was like a terrible season finale to some crap Power Rangersspin off except with an even worse soundtrack. Plus I think they tried to send me off with a life lesson!\\n\\n\r\nAnyways, I give this anime 6/10, I'd only watch this again if all anime in the world dissapear or if I had to choose between this and Hatenko Yugi.",
            "date": "2009-03-29T21:17:00+00:00",
            "helpful_count": 6,
            "mal_id": 13596,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13596"
        },
        {
            "content": "So... I hate fanservice and ecchi...\r\nBut this was kinda weird.\r\nI mean, aside from the fact that Jun Fukuyama is staring, and aside from the fact that the perverted old guy is Okiayu Ryoutarou (who played Shigure in Fruits Basket)... it's not half bad.\r\nActually, the concept of a girl in a can is hilarious... and I really like the idea of someone who doesn't want to just be used and thrown away.  It's a very human conception... packed in a can!\r\nNow, I will admit, it gave me some \"Saber Marionette J\" vibes (what with brightly colored girls and a perverted guy in love with themain male character)... but who knows.  I liked SMJ alright, so this is worth a watch to me.\\n\\n\r\nIt has terrific seiyuu (which is always my first reason to watch something) and a far more interesting plot-line than alien girls or random chicks falling in love with the same guy.  I mean... they come from a can!  And they need carbon dioxide!  It's so random and yet... perfect for this type of comedy.\\n\\n\r\nIf the first episode doesn't leave you thinking, &quot;This is one of the most random animes I've ever seen...&quot; then it may not be for you... but I sure said that about five times before the ending credits rolled.\\n\\n\r\nAs a plus... it's got a great OP and ED song...\\n\\n\r\nSo yeah, I recommend this... even to people who don't go for the genre.  I know I don't.",
            "date": "2009-01-18T14:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 11666,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48396.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Ashuri",
                "username": "Ashuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=11666"
        }
    ],
    [
        {
            "content": "Like Hollywood, it seems Japan is suffering from a lack of creativity recently.  Here we have been brought Akikan!, a story about empty juice cans that turn into girls.  Uh what?  It certainly is a bizarre concept and I guess it scores some points for being one of a kind in that sense.\r\nThe story revolves around your typical anime loser Kakeru.  Of course he’s a virgin.  Being a pervert is a given.  He’s never had a girlfriend, despite having the cutest girl at school practically throwing herself at him on a daily basis.  Are you retarded?  Blind?How could you not know!?  Anyway back on track, so he buys a can of melon flavored soda, drinks from it and surprise he’s lip locked on a busty girl in his apartment.  I know this will sound surprising for anime but they both become extremely embarrassed by this!  No way!  She’s also a magic powered tsundere!  Wow! I’ve never seen that before either!  You’re never going to believe what happens next either... she’s going to live with him!  Even though he’s only 16 he lives by himself.  Does this really happen in Japan!?\\n\\n\r\nWhile watching this series, if you have seen any other echii romance comedies then you’ve seen the basic plot and characters of Akikan.  It’s so similar to a dozen other shows that I almost knew what was going to happen before it actually did.  The plot is extremely thin and mostly uninteresting.  Akikan suffers from the way it seems to meander around and not settling down on what it wants to be.  Is it an action series?  Romance?  Comedy?  It tries to be too many things and ends up being nothing.  The biggest problem I had was with the introduction of this mysterious government agency that knows about the can girls and wants them to join this group called Akikan Elect and battle each other until only one is left.  By the end of the series it feels like such an unimportant part of the overall story that in hindsight they shouldn’t have ever bothered to mention it in the first place.  There are some other bizarre elements that really made no sense as well, such as the inclusion of the witch character Kochikaze.  She is very typical of the schizophrenic nature of this show.  The ending is typical of what one should come to expect from these kinds of shows.  That means nothing is resolved in terms of the character relationships with each other.\\n\\n\r\nAll that being said, it’s not completely devoid of humor or enjoyment.  Just about anyone will probably enjoy Kakeru's antics and dramatic perversions and overacting.  For a while anyway as they eventually get old and overused.  I also give the story some credit for not having every female character in the cast be in love with Kakeru.\\n\\n\r\nThe characters are a mixed bag.  Kakeru is the most animated of them all and entertaining most of the time.  Though because of his voice actor the entire time I was reminded, its Lelouch.  His personality is almost exactly like Lelouch's silly school persona.  He is completely over the top, overly dramatic, and has absolutely no tact once so ever.  The various can girls, Melon and Yell are mildly amusing and entertaining.  The relationship between Melon and Kakeru reminded me a lot of the one between Keita and Youko in Inukami!  Najimi as the childhood friend of Kakeru who is blind to her love is not anymore interesting.  The characters who steal the show are really the pair of government workers, Otoya and Kizaki.  I found the interaction between them to be pretty funny.  Most of the other characters are forgettable.\\n\\n\r\nThe animation and art are solid but unspectacular.  I enjoyed the character models and all the action scenes were well fairly exciting.  The voice cast was stellar,  it featured some of the top talent in the industry and a few of my favorites.  Unfortunately because of the unoriginality of the story too many of their performances sounded like characters from other anime.  Because of this it’s unlikely anyone is going to remember any of them for their roles.  The songs from the OP/EN were also not very inspired either.\\n\\n\r\nOverall, Akikan was a show that was mildly entertaining but completely lacking any new ideas or originality.  There are definitely better shows out there to watch than this one.  But its not a complete disaster.  If you don’t mind that it doesn’t bring anything new to the table and is as filling as an empty can of soda, then you might find some enjoyment out of it.\\n",
            "date": "2009-06-24T04:27:00+00:00",
            "helpful_count": 239,
            "mal_id": 16060,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/93378.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Skadi",
                "username": "Skadi"
            },
            "url": "https://myanimelist.net/reviews.php?id=16060"
        },
        {
            "content": "If you like the idea of a show that is entertaining, self-satirical, has 'colorful' characters and manages to save a little room for serious stuff, this could be the show for you.\r\nIf you are really into deep, complex characters with intricate winding plot twists and you looove super serious business 24/7, this is probably not the series for you.\r\nThe MAL ratings this show gets don't do it justice. Don't get me wrong, it's no masterpiece, but it's not a ~6.5 either. I can't say what people think of it, but my guess is that a lot of people take it too seriously. Most of theshow really isn't meant to be taken seriously, in fact, I would argue that it's an outright satire of the \"Hey look I found the perfect girl for me in a garbage can around the corner and I didn't even have to do anything for it\" genre. If you didn't take it that way, you probably ~would~ think it was terrible. A lot of the time, it's just making fun of itself and similar series. If that's going to hurt your feelings, or go over your head, don't bother watching.\\n\\n\r\nAs a review is \"not supposed to be a story summary\", I'm going to avoid doing that, and say that simply, the plot is ~not~ what drives this show. The plot is fairly basic, nothing very unique for the most part, though, I will give it credit on the point that it throws in a couple of unexpected serious twists to make things more interesting. In this review I'm going to focus mostly on what I think makes this show - the characters.\\n\\n\r\nWhat I like about this series is that the male lead is not the typical passive male lead character that you would usually see in this sort of series. (Randomly living with a beautiful girl out of nowhere-type) He's outwardly perverted, often sarcastic, and a 10/10 troll...but at the same time is actually a decent human being, and, yes, can even be serious once in a while. Oh, and he's voiced by Lelouch's VA, which is something you can definitely hear when he goes off on his \"speeches\". (This is more obvious earlier in the series)\\n\\n\r\nMelon is a pretty typical female lead, a tsundere, gets very indignant about almost everything, and is totally thrown off by Kakeru's antics. As well, being a 'can', she is somewhat naive, and thus even easier for Kakeru to troll almost constantly.\\n\\n\r\nNajimi is a great addition to the cast, (posisbly my favourite) and it's interesting that they managed to make a female character somewhat perverted with it being more amusing than creepy. (The facial expressions she gets are priceless.)\\n\\n\r\nYell is amusing in her \"serious business\" approach to almost everything, while at the same time, like Melon, she is very naive about certain things.\\n\\n\r\nThese characters get the most screen time while there are a number of other characters I won't be covering who range between mediocre and awesome.\\n\\n\r\nThe animation is usually meh, ok, with a couple of episodes being an exception to this rule. (6 and 11, I believe?) The music is pretty average: I wasn't a fan of either OP, though it's kind of neat that the ED is always different. (Miku fans may be pleased to hear that the planned OVA's ED will be 'sung' by Miku)\\n\\n\r\nThere are a few lines in this series (Like Kakeru tricking Melon about what \"Masturbation and Titty Fucking\" mean) that really made me kind of go: \"Wait...wait...were the fansubbers screwing with us, or did they really say that?\" (He really did say that) So, keep in mind this isn't something you want to show your 10 year-old kid or niece/nephew. BEAR IN MIND that these 'shocker' lines are not constant, so much as exceptional \"wait, what??\" moments.\\n\\n\r\nFor fansubs: I recommend Coalguys for episodes 1-7, and, well... CommieSubs seemed alright for 8-12. (Chihiro does all of them and is so-so, but they aren't my top recommendation.)",
            "date": "2009-02-12T10:53:00+00:00",
            "helpful_count": 133,
            "mal_id": 12361,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/51582.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ddrcrono",
                "username": "ddrcrono"
            },
            "url": "https://myanimelist.net/reviews.php?id=12361"
        },
        {
            "content": "Time to state the obvious what surprisingly hasn't been done yet. Akikan! is probably the worst anime of Winter 2009 season. Maybe even the worst series aired during last year. So after this short, engaging summary let's see why it sucks so bad.\r\nStory: Being the strongest point of this series doesn't mean it's good. Just mediocre. Again boy meets gir- pardon, can which turns into girl, they continuously argue with each other but also somehow get along. Later more cans appear and... you've seen synopsis. This story had potential, another romantic comedy but with some possibly interesting additions. Sadly it turns into plain and boringbundle of really overused cliches.\\n\\n\r\nAnimation: Here goes. Most of the time it's just lousy but still rather acceptable. But if there is any thing outstanding about this series it might be animation failures. You might have heard about episode 2. Thinking about it still sends chills down my spine, watching it makes you want to rip out your eyes.\\n\\n\r\nSound: OP/ED are nothing special, lame and annoying but you can always skip them so no harm. Music isn't even worth mentioning. \\n\\n\r\nCharacters: Did I mention mediocrity? Average but weird (this time perverted megalomaniac) high school student - checked, girl with superpowers - checked, childhood friend with crush on the main character - checked... and so on. But wait, there is something more, faggot from government who looks like mentally unstable scientist and lesbian witch classmate... thing. Bunch of lovely characters isn't it? Add poor voices (especially loli with speech defect) and voila - you're wondering all the time when they are finally going to die.\\n\\n\r\nEnjoyment: Is there still anyone who think this anime is enjoyable? Still?! Well, I was trying to warn you but go ahead, waste your time and mood.\\n\\n\r\nOverall: After this rant you probably think I'm biased against this series and exaggerate. But you're wrong. I was trying to keep watching and give it a chance but this anime failed horribly. Surely there are people who enjoy and even like it, that's ok. But let me warn other thousands of nothing expecting potential victims.",
            "date": "2009-02-09T09:58:00+00:00",
            "helpful_count": 94,
            "mal_id": 12276,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83320.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Antanaru",
                "username": "Antanaru"
            },
            "url": "https://myanimelist.net/reviews.php?id=12276"
        },
        {
            "content": "Can love between a man and a can bloom? Such profound questions like that will be asked to you as you watch Akikan, perhaps the single worst and most idiotic concept for a TV series ever, and the very moment that question becomes relevant within the series is the moment any drama or tension cannot possibly be taken seriously. Ironic then, that those parts actually end up becoming the most tolerable among these twelve, awful episodes.\r\nMost of it is comedy of the lowest grade that is impossible to unironically enjoy with the occasional can racism that comes with some fighting between different types of cans,each with a different special power and attacks whose names show how little effort was put into wrapping this thing up toghether (just for reference, one of these cans is melon juice, is conveniently named Melon, and her attacks are surprisingly named \"MELON, MELON, MELON!\" or other variations of the word melon).\\n\\n\r\nProduction values, animation and overall graphic designs of the series are awful and undeserving of something released in 2009 and would probably be mediocre at best if released six or seven years earlier, while the soundtrack offers nothing of value except maybe a shitty but somehow catchy second opening (that conveniently recycles the patchwork of the first opening) and an ending song that isn't necessarily shitty but is sung by shitty vocalists and changes every episode.\\n\\n\r\nThe award for the most aggravating presence in the series though goes to our protagonist Daichi, easily worse than any main character you can name, whose lines are more or less all facedesk-worthy throughout the series and never come close to being remotely funny or quirky even among these types of perverted male character stereotypes. The supporting cast isn't much better as they all more or less sport an unfunny/cringeworthy quirk that defines them during comedy parts like our protagonist and react in the dumbest ways during drama parts (even for this type of series).\\n\\n\r\nIt's fairly safe to say Akikan is one of the worst anime TV series in existence and should only be watched as a joke or as a challenge, and even then it manages to disappoint by presenting awfully stupid situations that more often than not cannot be enjoyed ironically due to the sheer amount of cringe in the dialogue. Nothing of value is to be found in what could possibly be the lowest point of studio Brains Base and one of the lowest points of animation in general.",
            "date": "2015-05-29T04:06:00+00:00",
            "helpful_count": 38,
            "mal_id": 189082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1331431.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Valkqt",
                "username": "Valkqt"
            },
            "url": "https://myanimelist.net/reviews.php?id=189082"
        },
        {
            "content": "Randomness, Romance, Comedy and Pervertedness all rolled into one. Honestly, there's not a single boring episode so far.\r\nThe first episode alone was hilarious. My first impression was \"WTF ROFL.\" and it still is. It isn't the bad kind of random like some animes, but the good kind that you'll laugh over and wish for more.\r\nSo the main character is a total perv..but that works just fine since he brings most of the comedy into the story. He makes sexual jokes practically all the time and has multiple girls around him.\r\nThere are themes of yuri, but that just adds to how funny and awesome it is.Sometimes it'll seem like something 'romantic' is going to happen between the main character and his childhood friend, but as soon as it gets far enough, it'll break off. Though it isn't like some series where it breaks off really quickly. The scene will be satisfying enough before that happens.\\n\\n\r\nThough the art style is..not as good as some, I suppose the story and plot make up for it big time. Just goes to show that the art isn't the only thing that makes a good anime.\\n\\n\r\nThe element of a juice can turning into a chick is quite random as well. Not to mention if they go 'flat' they will end up 'dying' so to speak. So it isn't as if these girls are imortal. Like humans, they can die just as easily if a certain criteria isn't met, aka refilling their cans with the same juice.\\n\\n\r\nAll in all it's a pretty good anime. So if you need a good laugh, I recommend this one.",
            "date": "2009-01-20T09:03:00+00:00",
            "helpful_count": 29,
            "mal_id": 11712,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60406.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KayChan4U",
                "username": "KayChan4U"
            },
            "url": "https://myanimelist.net/reviews.php?id=11712"
        },
        {
            "content": "(A Man’s Love for a Can)\r\nOn a particularly hot afternoon in mid-July, Riku Ranjo was walking along the streets of Tokyo, when suddenly he was overcome with thirst. He searched for a vending machine and found one across the street. He crossed the street, inserted the coins into the machine, and out dispensed a steel can.\r\nHe opened the can and drank it, until it was empty. Then, he noticed there was an aluminum can image displayed adjacent to the steel ones. Suddenly, he had an inspiration…\r\nWhich cans are the strongest, steel or aluminum ones?\r\nHe realized that modern physics and chemistry (i.e. stress and strain test,melting point, mass and weight scale, and ultimate tensile strength) would ruin the story. So, he decided that the cans will turn into magical girls (i.e. akikans) and they will battle each other, until the strongest type remains standing. It was a brilliant idea, and so he turned it into a light novel.\\n\\n\r\nThe light novel was received well and, soon, it was about to be an anime.\\n\\n\r\n[The Creator Meets with the Producer and Director]:\\n\\n\r\n[The director and producer are reading some passages from Ranjo’s light novel. Once finished, they put the book down and look at Riku Ranjo.]\\n\\n\r\nDirector [scratching his head]: I read your light novel and I have to ask. Won’t the viewer think it’s stupid to not use modern science to determine which metal is strongest?\\n\\n\r\nRanjo: I thought about that and realized I needed to turn the cans into girls to prevent modern science from playing a part.\\n\\n\r\nDirector: But, objectively speaking steel is stronger and heavier than aluminum.\\n\\n\r\nProducer [interrupting]: What you may say is true, but the viewer doesn’t know that. That’s why the cans transform into girls, so they can battle it out and decide which metals are strongest.\\n\\n\r\n[Ranjo nods in silences.]\\n\\n\r\nDirector: But…whatever. Okay, what about the cans transforming into girls. I know they transform because you open them and then ‘drink it’, but why girls, and not animals or guys? Is there some type of ‘magical element’ within those cans? If so, what is it?\\n\\n\r\nRanjo [shuttering]: Well…I…it’s complicated.\\n\\n\r\n[The director facepalms and shakes his head.]\\n\\n\r\nProducer [coughing]: Just ignore the director, he just can’t comprehend the ‘deepness’ of this plot and its lore. About the anime, what do you want to add?\\n\\n\r\nRanjo: Okay. I want to add many girls, preferably more than four, and have lots of action scenes. The attacks of the akikans come from their can’s favor, so for example: 'Budoko shouts grape favor attacks' and 'Melon shouts melon favor attacks.’ Simple and easy.\\n\\n\r\n[The producer shakes his head.]\\n\\n\r\nRanjo: Next, the main character will be a ‘kind’, perverted, joke-cracking idiot with next to no brain, his childhood friend will be a kind, gentle and plain girl that gets drunk off of carbonated drinks, and as for the akikans…well, some them are hot-tempered, some are cool and composed, some are completely idiots, and some are unusual. Now, as for the art and sound direction…I’ll leave that to you. Thank you, for inviting me and see you later.\\n\\n\r\n[Ranjo stands up and shakes the hands of both the producer and director and leaves. The door closes shut.]\\n\\n\r\nDirector [still face palming]: Is he gone?\\n\\n\r\nProducer: Yes\\n\\n\r\nDirector [shaking his head]: When I read the synopsis, I thought, “Okay, this is original and weird. Cans transforming into girls. That’s interesting.\" But, when I read the novel. The story contained a bunch of lame jokes, lots of unnecessary fanservice, and boring school-related crap. All of this crap is going to be in this produced anime! It’s unavoidable!\\n\\n\r\nProducer: You don’t have to be that harsh. Well, I somewhat agree that it’s weird. Now, as for the art and sound direction, let’s just hire the cheapest people and let them get to work. I can, already, imagine the viewer's reaction when they hear the generic opening and ending, a typical J-Pop song, perfect. And, the animation design for each character and background scene will be minimum and ugly as hell, especially the main character's spiky hair. \\n\\n\r\nDirector: Yes, let’s just do that and get this anime series over with! But, I’m being harsh not because of the lame jokes or the fanservice. But, because the novel and, unfortunately this anime that we are producing will never answer the most important question!\\n\\n\r\nProducer [confused]: What important question?\\n\\n\r\nDirector [smashing his hands on the table]: We never find out which cans are the strongest? I mean, are steel cans the strongest or is it aluminum cans? We just don’t know! \\n\\n\r\nProducer: Well…I…I don’t know what to say. I guess, we can leave it up to the audiences. But, I’m pretty sure, the audience will not remember this question. Hopefully.\\n\\n\r\nDirector [sighing]: Yes…hopefully.\\n\\n\r\nThe End",
            "date": "2015-07-13T20:38:00+00:00",
            "helpful_count": 27,
            "mal_id": 193340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4408661.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blood_Diver_A",
                "username": "Blood_Diver_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=193340"
        },
        {
            "content": "Before I say anything else I need to state that this is a very bad anime. If you consider the quality of storyboard, screenplay, scenario and even the choice of Fukuyama Jun as the voice actor for the main character (for his sake) this is indeed a very bad anime.\r\nBut.\r\nI always try to be as objective as I can when reviewing animes and qualitywise this anime is basically gutter trash, but if you consider the entertainment you can gain if you keep the fact that it's a horrendous anime in mind, this is actually pretty \"good\". I am not sure if the producers of thisanime meant for it to happen or if it was coincidental, but it feels like this anime, unlike so many similar animes, doesn't take itself too seriously. Well apart from the female lead, but it's easy to disregard her. Infact it's easy to disregard every single character in this anime since they're all so bad. But as I said before they are bad in a funny way. There were so many facepalm moments in this anime when it came to the shortcomings of characters and character interaction that it became very entertaining. Everything was silly, the story was silly, infact the whole concept of this anime is silly.\\n\\n\r\nSpeaking of the story, what was the story? What story? The first grasp of a plot or story comes in episode 2 I think it was. When the pedophilic homosexual counsilor of the ministry of economy told the male lead character, for some strange reason, that there existed some sort of a discrepancy between steel cans and aluminum cans and that it was, yet again for some strange reason, important to once and for all come to a decision regarding this really, really, really important issue of which sort of can to use for purchasable beverages; steel or aluminum.\\n\\n\r\nNeedless to say, this story is a masterpiece when it comes to originality.  One can only ask oneself; what mastermind came up with this? There is however something worse than the story and that is the script and consequently the screenplay. Every single line that was said by one of the characters in this anime was stereotypical, clichéd and/or unfitting to the scene. Needless to say, there were some true geniuses at work when the script was written, I can tell you that. Yet I have to go back to the very important fact that seen to entertainment value it really was \"good\", even the screenplay. I laughed alot during my time spent watching Akikan, of course I laughed for the wrong reasons, or one can hope the right reasons if my hint, regarding the producers intentionally making this anime as bad as it was, is right.\\n\\n\r\nSo, if you want to see an anime filled with stereotypical characters, scenes and dialog spiced up by the fact that half the cast really are cans filled with juice or soda then you should definitely watch this. I promise you will have a good time if you're; a) watching it knowing or seeing that the quality of the anime is of a level you could surpass yourself at home with pen and paper easily or b) you're a harem fanboy.",
            "date": "2009-06-21T14:41:00+00:00",
            "helpful_count": 22,
            "mal_id": 15961,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=15961"
        },
        {
            "content": "Overview:\r\nPeople complain about Hollywood being uncreative and making far too many reboots and ripoffs, but Japan is often no better in this regard. If an anime is highly successful, you can almost guarantee there will be a new ripoff series created to suck up some of that money. If the ripoff is successful, a ripoff of the ripoff will be made and so on until the quality degenerates SO far and becomes so low that not even the stupidest of otaku will buy it. In the early 2000s there was a highly successful anime called Rozen Maiden about a hikikomori (extreme social phobia) who ownsa magical doll that comes to life. The doll must then battle other living dolls until only 1 is left. A ripoff was then created called Kampfer about special fighters who each owned a special magical doll and each had to fight each other to the death because the poorly written plot demands it. Then came an anime that is so bad it makes Kampfer look like GOD in comparison! That anime is the dreaded Akikan!\\n\\n\r\nAkikan probably holds the record for the stupidest plot of any anime I have ever seen. A lonely loser drinks a can of juice, only for the empty can to suddenly become a hot babe for no reason. It is explained that scientists want to figure out which metal is best to use in cans, so they somehow magically created special cans that transform into sentient beings and must fight each other to the death in order to find out which metal is most effective. I dated a chemical engineer in college and I minored in chemistry, so I am quite familiar with laboratory tests used to determine the effectiveness of different alloys and compounds. Some of these tests include: melting point, density, the Rockwell Scale of indentation hardness, etc. You want to know what wouldn't be an effective test? Turning the fucking metals into sentient beings and making them fight pokemon style!!! Our empty can girl is named Melon because she was a can of watermelon soda. She has the ability to fight using melons. I'm dead fucking serious! The sublime idiocy of this show simply can't be overstated. The MC is one of the least likeable harem leads in anime history! Every character in this show is the most shallow, 1 dimensional archetype imaginable. It is as if this was made to spoof the magical girl genre, but this isn't actually a parody or a spoof. Akikan attempts to have the worst plot possibly ever written by man and tries to basically play it straight with forced comedy and echii thrown in.\\n\\n\r\nThe art in Akikan is actually fairly decent because this steaming pile of SHIT actually had a budget. Want to know how I know it had a budget? The MC is voiced by the same Japanese voice actor as Lelouche in Code Geass! How the hell desperate for money was that guy in order to voice act for Akikan. Lending your voice to Akikan is one very small step above sucking dicks in a backalley for crack money.\\n\\n\r\nWhenever you hear someone say the latest echii anime or magical girl anime is the worst ever, sit that person down and make them watch Akikan! You thought Absolute Duo was bad? HAHAHA NO!!! Absolute Duo is Nobel Prize in literature worthy compared to the sheer filth that is Akikan! Dante is going to have to create a new circle of Hell for the production staff of this series and whoever the hell greenlit this project!",
            "date": "2015-03-25T12:12:00+00:00",
            "helpful_count": 17,
            "mal_id": 183340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3971701.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/literaturenerd",
                "username": "literaturenerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=183340"
        },
        {
            "content": "Viewers, do you fantasize about being a horny virgin can collector drinking a melon soda which somehow turns into a girl so really, you are kissing a hot girl?\r\nIf you do, this is your anime.\r\nIf you don't, you're a freaking weirdo.\r\nThis is a typical Magical Girlfriend show except your main male character are boning melon soda cans. Like all Magical Girlfriend shows, it is cliched and conventional. However, the characters and the hammy voice actors make it up.\r\nCharacters:\r\nEnter Daichi Kakeru (voiced by the same seiyuu of Lelouch), the epitome of all horny, narcissistic virgins out there in the world (we all know you are outthere). His perversion and narcissism are the highlights of the show. If you enjoy sexual humor and the MAN IS NOT A VIRGIN of TTGL's Kamina, you will adore Daichi. Lelouch's acting makes it even better because he looks very natural. This character looks so real guys may be reminded of the friend they had at college. You know, that friend. \\n\\n\r\nHis steel can girl partner is Melon, a tsundere. Her trademark is being angry and tsundere. Her character becomes more dynamic at the later episodes. Many viewers may sympathize her for being a lonely empty can. However, her character archetype as a tsundere is a cliche itself. Her weapons are not that awesome since she, uh, throws melons. She is one of lower tiered characters of the show.\\n\\n\r\nToyasaki Aki of K-On! fame (untan untan~) plays Tenkuuji Najimi. What made her a wonderful seiyuu in K-On! is used somewhat effectively in the show. Najimi is a ditz who has some slight perversion. Aki's voice fits her well, although many diehard K-On! fans may find it weird to see her in that role. I personally love her character because she's very attracted to a horny pervert for few reasons. Also, Aki's hammy acting.\\n\\n\r\nYell, sadly not voiced by EMPEROR WAKAMOTO, is a tsundere who has a fetish for moving things. She may remind users that Japan loves Rei, not Asuka, because of her silver hair and Halloween costume. Despite such cliches, she does have a badass weapon compared to Melon. Since all sport drinks are active, she sports (how punny) an Isotonic Sword which makes her look like a praying mantis. She is a bit more memorable than Melon when it comes to action scenes.\\n\\n\r\nBudoko, your essential Lolita in magical girlfriend shows, is voiced by Yuuki Aoi. Anime viewers may remember the seiyuu from the deconstructive Magical Girl show, Madoka Magica (or meduka meguca). Like all Lolitas, she does cute stuff and has purple hair. Like most Lolitas, she is useless to the story and provide only eyecandy (Furude Rika, how dare you be that one EXCEPTION). Still, the character is fun and active.\\n\\n\r\nAll the other minor characters are unnoticeable (especially one of them) except for one man, Hidehiko Otoya. Along with Daichi, he is the most awesome character in the show created ever. A government official, he stalks Daichi and other male characters. His lovely voice and expressions will only remind viewers of Ouran High School Host Club taken a step further into the dark abyss of hell. You can't really deny how awesome he is when he licks his lips in the OP.\\n\\n\r\nStory:\\n\\n\r\nThe show has a barely functioning tournament arc (I don't even call that). It relies more on romance tropes, playing with Daichi's harem relationship. The show is predictable and cliched (two deus ex machinas come into mind), but Daichi's presence is just funny as hell. There is one filler episode (Episode 10, cough cough) which is boring, but the others are silly enough to be enjoyable.\\n\\n\r\nArt/Sound:\\n\\n\r\nPassable. It is not horrible, but not Makoto Shinkai amazing. There are some off-model picturing at times. Recalling the music is as tough as playing Touhou 12 on Lunatic. The music is cliched and unmemorable at the very least.\\n\\n\r\nConclusion:\\n\\n\r\nIf you have the ability to suspend your disbelief that empty cans become girls and don't think critically, it is enjoyable. It knows it's a silly show with an absurd premise. If you can leave your Neon Genesis Evangelion Freudian psychological character analysis thinking behind, this will be a silly romp for you and everyone else.\\n\\n\r\n8/10",
            "date": "2011-07-11T03:31:00+00:00",
            "helpful_count": 17,
            "mal_id": 38974,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/497699.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yukariki",
                "username": "Yukariki"
            },
            "url": "https://myanimelist.net/reviews.php?id=38974"
        },
        {
            "content": "[Story: 4.0] Peppered with nothing but plenty of really cheap innuendo, I know that I'm not supposed to be expecting some fabulous scripting from this sort of show, contending for just some silly, cheap laughs. Yet even with this in mind, Akikan manage to be underwhelming.\r\nAkikan wants to achieve too much but lacked the effort to do any of them. It tried to pack in romance, drama, lewd dialogues, action and plenty more lewd dialogue, but was lazy in executing them. The comedy aspect is lackluster - you've seen them in practically any other ecchi series you can get your hands on and they're probablyfunnier too. Drink cans who transform in girls? Sounds interesting (albeit absurd) until one considers that beneath the gimmick, there's absolutely nothing outstanding about the whole magical/ super-powered girlfriend concept. Attempts to even provide examples of such titles would flood the page. Clichés in itself are NOT bad; it's because they are popular ideas that they become clichés. However, there’s a difference between getting inspirations from popular ideas and blatantly being uncreative. \\n\\n\r\nLastly, the series should have ended at episode 10. The last two episodes were redundant and just add to how haphazard the series is handled. For one thing, it was too late to introduce new characters. For another, it's not like it contributed anything to the plot anyway.\\n\\n\r\n[Characters: 5.5] Kakeru, the protagonist is mildly amusing in his grandeur and crazy talks, but him alone is insufficient to hold the show together when the rest of the cast is insignificant. It also helps that he's voiced by Jun Fukuyama, who did a fantastic job. However, it is also a waste to actually have Jun Fukuyama in it - and he's actually one of the few redeeming points of the series. I admit, the nonsense babbled by Kakeru garnered a few cheap laughs here and there. In the end, however, those were cheap laughs and nothing more.\\n\r\nSimilarly, it's also somewhat a waste to have Mamiko Noto in it as well. \\n\\n\r\nInitially, the gag about how Jigoro often got disregarded and treated as invisible is chuckle worthy. Sadly (and ironically), that really is all he is, unimportant enough to be considered as being 'not there'. Furthermore, the main girl turns out to be a tsundere so there's the obligatory gag that involves her physically assaulting the protagonist. Other characters need not be explained further; generic characters through and through. Also, Budoko's voice is annoying. Really, after the first episode, the series just got lazy. \\n\\n\r\n[Art: 5.5] Perhaps it is not entirely the studio's fault that the story is weak and the jokes are terrible. Perhaps it is the source materials themselves that are bad - I wouldn't know; I've read neither the novel nor manga. However, when it comes to production values, the studio has no excuse and this is the bit that came to be a surprise: Akikan is made by Brains Base. Although it is unreasonable to expect a studio to constantly create high quality productions and unrealistic to hope that all the works are to one's liking, Akikan is really a far cry from Brains Base’s portfolio, including but not limited to Natsume Yuujinchou, Baccano! and Kurenai. Akikan has the worst quality of the lot. To compare on a broader scale, Akikan isn't any better. For a series made in 2009, the art quality is inadequate.\\n\\n\r\n[Music: 6.0] Music was average, typical cutesy songs. BGM was kind of lacking as well. Well then again, this being mainly a comedy, expecting Yuki Kajiura level of pieces would be superfluous.\\n\\n\r\n[Summary] Akikan is, to put it simply, devoid of creativity. Plenty of titles in its genre have done the things it did and better. Really, there are just so many other titles to watch other than this.",
            "date": "2012-03-05T18:09:00+00:00",
            "helpful_count": 15,
            "mal_id": 55403,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165681.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nilvius",
                "username": "Nilvius"
            },
            "url": "https://myanimelist.net/reviews.php?id=55403"
        },
        {
            "content": "Akikan! is a sort of Master and Servant genre type of anime. But unlike other Master and Servant animes the male protagonist here is a pervert who knows when to show it. This story tells us about a boy named Kakeru who drank Melon soda that turned into a girl named Melon, they are called Akikans. But she isn't the only akikan in this story.\r\nStory\r\nThe story for me was very good. The story just doesn't revolve around a pervert doing perverted things *coughHeismyMastercough*. The story was full of comedic moments that still connected to what the story was going to be. It was full ofdrama as well.\\n\\n\r\nArt\\n\r\nThe art was great, I loved the sad parts of the story the facial expressions during those moments are very well detailed and it fits perfectly to the genre the story holds.\\n\\n\r\nSound\\n\r\nThe Sound was outstanding, the opening themes were really great *tips hat to little non*. They did a great decision letting Little Non sing \"Juicy Extacy\" for their opening. The Explosions were very great as well.\\n\\n\r\nCharacter\\n\r\nNow the character for me here didn't go so well for me, Because the story was way too damn short for more character development. I only wished the story was Longer.\\n\\n\r\nEnjoyment & Overall\\n\r\nI really loved the story but not so much. Its a great story that definitely needs to be watched by fans out there.",
            "date": "2009-05-03T20:16:00+00:00",
            "helpful_count": 13,
            "mal_id": 14766,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/174067.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/eX",
                "username": "eX"
            },
            "url": "https://myanimelist.net/reviews.php?id=14766"
        },
        {
            "content": "For some reason, I had to write a review for this anime. \r\nAkikan! is has to be the worst anime (by comparison) I've watched so far. I'm not saying it's bad; not at all. It does have its good points, but only a few. I'm actually quite disappointed in it. \r\nStory= 7\r\nThe story is about juice/soda cans transforming into girls once you take a sip out of them, and have magic powers based on what their drink is. When I was first introduced to the story, I thought \"What the hell?\" Well, I'll give it a good score for originality. It's weird, but original. So,in a sense, it's a good thing.\\n\\n\r\nArt/Animation= 5\\n\r\nThe art scores the lowest for me. I was a little weirded out by how the characters were drawn. One of the factors of making a good anime is good character art. And Akikan! failed at making any appeals whatsoever. The main protagonist Daichi, Kakeru looks a lot better in the manga than in the animated version. Animation could use some work too, but it isn't that bad. \\n\\n\r\nSound= 6\\n\r\nThere's nothing special to point out about the sound. I mean, the voice acting is pretty okay, and the opening and closing songs were alright. So I can only give it a 6. \\n\\n\r\nCharacter= 7\\n\r\nTsundere, Perverted lead, Childhood friend. Most of the characters are pretty much cliche. But what I found unique about this anime is how open it is to homosexual characteristics. Especially that Otoya guy, who is a molester. I also  like how Amaji is barely noticeable every time. But I am quite sick of perverted leads. \\n\\n\r\nOverall Enjoyment= 6\\n\r\nAkikan! could have been better than how it is now. If only the art can be improved, I think it'll get a better score. But it'll never get a rating of 8 or above. Story is unique but really weird. Some characters are really annoying (Especially the main lead) I did enjoy some parts of it. But will I watch it again? Never.",
            "date": "2013-04-14T21:19:00+00:00",
            "helpful_count": 10,
            "mal_id": 93819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2189923.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KaiserLos24",
                "username": "KaiserLos24"
            },
            "url": "https://myanimelist.net/reviews.php?id=93819"
        },
        {
            "content": "This show......, I really am liking this show, it is like a classic guy = master girl = fighter or something like that where they have a relationship too.  This show is absolutely pointless and the battle is stupid but that just makes it all so funny.  It is not serious, but it is a great show.  I cant wait for the next episode and the comedy is unique and always funny.  THe action seems like it might get good and I cant wait to see what kind of boyfriend this guy will be and to who?",
            "date": "2009-01-20T15:36:00+00:00",
            "helpful_count": 10,
            "mal_id": 11727,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36538.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/thunderbolt3",
                "username": "thunderbolt3"
            },
            "url": "https://myanimelist.net/reviews.php?id=11727"
        },
        {
            "content": "Akikan, being a Romance-Comedy anime lives up to its expectations, firstly this anime is often extremely amusing, got me liturally ROFL alot of times :), Character choices and developments is acceptable yet disapointing, The art is leaning towards decent side. \r\nThe story of Akikan is wearid yet interesting, with anime, the more 'out of this world' the more interesting, Overall i'd give it a 8/10 for being a enjoyable anime when i was bored, This anime possesses protential that of Sekirei and FTS but it fails in its detail in character development, i'd say i enjoyed it alot more even though now taht i reflectto it it seemed more like a average anime to kill time",
            "date": "2009-08-19T18:35:00+00:00",
            "helpful_count": 10,
            "mal_id": 17909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72819.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Keyira",
                "username": "Keyira"
            },
            "url": "https://myanimelist.net/reviews.php?id=17909"
        },
        {
            "content": "If there was an institution that kept a list of animes with the biggest number of sexual jokes, Akikan would top the list every single year. This anime is a one big sexual joke. Some reviewers talk about a bit of seriousness and drama? No. Akikan is like an anime version of stand-up comedy involving several performers. \r\nThe story follows a teenage guy, named Kakeru Daichi. He's a lonely, girlfriendless pervert who has only one thing going on in his mind at any given time - sex. Apart from his lewd ways, Kakeru collects soda cans. It just so happens that one day after hisusual trip to the local vending machine, Kakeru frees a beautiful girl from a SODA CAN by drinking it. Anyone thinking about a genie in a lamp? Because I sure as hell was. It's just so cheesy, so blatantly cheap... anyone can come up with a story like that. So a big disappointment there, the story majorly sucks. \\n\\n\r\nThen however, a miracle happens. This anime was not actually meant to be serious, the first few scenes which involve touching narration imply that we're dealing with a serious, kimi ga nozomu eien type of anime. Literally a few seconds later, you can see that the intro was decieving. This anime is all about comedy and most of it is directed at adult audiences. \\n\\n\r\nAs the story progresses we learn many more things, for example that the girl Kakeru freed is called an \"Akikan\" (hence the title) and that there are many more out there. Another thing is that they develop a master-servant relationship with their liberators or \"owners\" as they're called in the anime. No real suprise there however. We could all see that coming since the whole girl in a can theme was probably based on... yes I've said it before - the genie in a lamp. Only difference though is that Akikans don't actually grant wishes.\\n\\n\r\nThe comedy is good however and the range of characters this anime has is to say the least, impressive. We have the perverted Kakeru, we have a witch, a bisexual goverment official and his strict subordinate, their duo reminded me of Shunsui Kyoraku and Nanao Ise from Bleach. We have a girl who desperately wants to get laid with Kakeru, I won't mention why because that would spoil the story. We then have a few more Akikans and a few more shady characters, throw them all together and mix and you have a recipe for a funny anime.\\n\\n\r\nHowever one thing that should be noted is that the overwhelming majority of jokes are sexual with penis jokes being to most common. If I recall correctly Kakeru even mentiones that the \"penis is the future of Japan and that with it he shall be victorious\" or something like that. So I'm giving you a heads up, discretion is advised.\\n\\n\r\nSex is mentioned so many times in this anime that at times it makes you think that this series was made in an attempt to encourage the Japanese youth to procreate more, in light of the fact that Japan's aging population is dropping at an alarming rate. At least that's the impression I got when I watched it. \\n\\n\r\nArt and sound are good, no complaints in that department. Some of the music used in this anime is actually very catchy which pleasantly suprised me. The sounds are authentic and voice acting is alright too. This is definitively where a lot of the points are going to go.\\n\\n\r\nOverall, a good anime, providing you like watching comedies filled with sexual innuendo. I'll say it like this, watch this anime for laughs and you'll enjoy it. \\n\\n\\n\\n",
            "date": "2012-02-22T11:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 54483,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=54483"
        },
        {
            "content": "“CO2 Cans, talking and alive”\r\nThe Story… \r\nFirst of all there isn’t much story occurring in this anime, it’s all about the comedy and ecchi moments that makes it bearable to watch. As for the story, it leads to an intro that ‘cans’ can turn into a human being particularly into a girlish one and by touching its lid by the lips it will activate its transformation. It also has a little love issues and minor arc that gives us curiosity but what they did is they focus on just giving laughs and seductive scenes. \r\nIt has a capable to be an interesting story but whatthey did is quite sadden me.\\n\\n\r\nArt & Animation…\\n\\n\r\nThe animation is fine and quite attractive. The backgrounds are somewhat suited in some scenes as it doesn’t stand out on giving entertainment. The characters are in its typical approach, and how they’re drawn is common.\t\\n\\n\r\nSound…\\n\\n\r\nIt has a quite catchy OP & ED. It gives an average sounds and music to hear. \\n\\n\r\nNothing to impress on and to be happy on it…\\n\\n\r\nCharacter…\\n\\n\r\nFor the characters on this show, they're quite interesting to watch as they give laughs and gags to keep the show alive but it isn’t enough for this anime to keep it up. Kakeru the one who always appear to the show is quite silly for us to be entertainment while his partner Melon is the one who makes his day miserable and merry as it gives laughter. Other than that there is nothing to be focused on to this show because the others are rather an addition to fill the series. \\n\\n\r\nEnjoyment…\\n\\n\r\nYou’ll enjoy this on what you’ve seen and perceive on its scenes. The characters keeps me entertained while the art & animation isn’t attractive enough. About the story and the sound it has a weak approach to be attractive. In short it is kind of an average show.\\n\\n\r\nOverall…\\n\\n\r\nIt’s an odd anime and it lacks on development and ideas to be added on. It is an average show that keeps the viewer to be entertained. No more, no less.",
            "date": "2010-02-13T02:13:00+00:00",
            "helpful_count": 8,
            "mal_id": 23200,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/168419.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dredgy",
                "username": "Dredgy"
            },
            "url": "https://myanimelist.net/reviews.php?id=23200"
        },
        {
            "content": "Think your typical male protagonist tossed into a situation which leads him to becoming popular with a select few ladies.\r\nThink magical girl transformations.\r\nThink... cans transforming into girls?\r\nNow take a step back and recheck everything that's happened so far and you have the premise of Akikan! which leaves a rather awkward feeling at first which just makes you burst out laughing after Jun manages to portray a rather unique character in Kakeru, the protagonist for this series.\r\nWhat could be more hilarious than a very humorous sudden-girlfriend-appearance set-up than Kakeru being stark naked as Melon shows up and continues on as if nothing has happened?\r\nWhat this animelacks in actual storyline it makes up for with rather enjoyable humour, albeit awkward at times.\\n\\n\r\nI mean, come on, the story itself is supposed to be the display of a 'war' between girlished steel cans and aluminium cans.\\n\r\nCan't really say there's much room for potential there.\\n\\n\r\nMoving on, the cast themselves all had their highlights throughout the show.\\n\r\nNajimi with her overly perverted mindset, Yurika's mysterious allure and Hidehiko's bizarre character to name a few.\\n\\n\r\nOverall the series provided quite a few laughter inducing moments and came off as worth the time, but only just.\\n\\n\r\nMy rating for the series remains at:\\n\r\n6/10.",
            "date": "2012-03-08T17:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 55589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/437896.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ampzz",
                "username": "ampzz"
            },
            "url": "https://myanimelist.net/reviews.php?id=55589"
        },
        {
            "content": "Well, this is the first anime I actually watched all the way through (Sad, I know). But because usually the anime's I watch/manga's I read are shonen and very action based, rather than just light hearted and funny, this was a nice change.\r\nI loved the characters in this anime. Kakeru was your typical anime pervert, yes, but he also had a caring side. He started to actually care about Melon and what she wanted and that she was lonely. Melon was also a great character. She has a wide range of emotions. Sometimes she gets really angry. Other times, she's sad and lonely. And shedoes have a happy side as well. I actually enjoyed most of the characters in this story. The banter between Otoya and Kiziki was just hilarious :P I would've loved to see a bit more of Yurika and Gigolo though, and maybe a little more of Budoko's Owner. Even though Budoko annoyed the heck out of me, I think we still could've learned a bit more about her owner.\\n\\n\r\nNow, I haven't read the light novel the anime is based off of, but apparently there is another Akikan they didn't mention that's in the novel. I really would've liked to see her in the anime, rather than the Rainbow Splash Mixer Akikan. \\n\\n\r\nMy few complaints about this anime is that I was hoping for some kind of resolution by the end, or maybe for it to go a bit longer and have some kind of resolution. But I guess that's the Shonen, 200+ episode fan in me talking. \\n\\n\r\nAnyway, this show was a great way for me to kill some time during the summer and I got some entertainment out of it as well :)",
            "date": "2009-10-30T22:58:00+00:00",
            "helpful_count": 6,
            "mal_id": 20127,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/253006.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tsukasloth",
                "username": "tsukasloth"
            },
            "url": "https://myanimelist.net/reviews.php?id=20127"
        },
        {
            "content": "Let's start with the fact that \"yes this anime has a very interesting plot concept. No they do not embellish on it.\" The story does revolve around this supernatural phenomena, but then it puts out nothing. The humor in here is either very perverted or moderately funny (unless you love ecchi, then its both). The fight scenes in here were as well tasteless with little to no finesse. It just didn't have it's own flare.\r\nAND NOW FOR MY MOST STRESSED DETAIL IN ANIME HISTORY! ~THE ENDING!~ (Dramatic drum roll)... It was terrible! Really, it was like a terrible season finale to some crap Power Rangersspin off except with an even worse soundtrack. Plus I think they tried to send me off with a life lesson!\\n\\n\r\nAnyways, I give this anime 6/10, I'd only watch this again if all anime in the world dissapear or if I had to choose between this and Hatenko Yugi.",
            "date": "2009-03-29T21:17:00+00:00",
            "helpful_count": 6,
            "mal_id": 13596,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13596"
        },
        {
            "content": "So... I hate fanservice and ecchi...\r\nBut this was kinda weird.\r\nI mean, aside from the fact that Jun Fukuyama is staring, and aside from the fact that the perverted old guy is Okiayu Ryoutarou (who played Shigure in Fruits Basket)... it's not half bad.\r\nActually, the concept of a girl in a can is hilarious... and I really like the idea of someone who doesn't want to just be used and thrown away.  It's a very human conception... packed in a can!\r\nNow, I will admit, it gave me some \"Saber Marionette J\" vibes (what with brightly colored girls and a perverted guy in love with themain male character)... but who knows.  I liked SMJ alright, so this is worth a watch to me.\\n\\n\r\nIt has terrific seiyuu (which is always my first reason to watch something) and a far more interesting plot-line than alien girls or random chicks falling in love with the same guy.  I mean... they come from a can!  And they need carbon dioxide!  It's so random and yet... perfect for this type of comedy.\\n\\n\r\nIf the first episode doesn't leave you thinking, &quot;This is one of the most random animes I've ever seen...&quot; then it may not be for you... but I sure said that about five times before the ending credits rolled.\\n\\n\r\nAs a plus... it's got a great OP and ED song...\\n\\n\r\nSo yeah, I recommend this... even to people who don't go for the genre.  I know I don't.",
            "date": "2009-01-18T14:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 11666,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48396.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Ashuri",
                "username": "Ashuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=11666"
        }
    ],
    [
        {
            "content": "I see the most of reviewers here hate's the anime [That's weird if I can say -]\r\nFor me...I saw lot's of romance/comedy/action anime's ...but for an anime to have all categories in one...It IS kindda cool... Personally I love this anime...I like the plot [why do you ask? ...because I finally see a unique plot that is not ripped from other anime's... -] , The soundtracks are outstanding...I really enjoyed the OP/ED ...is is one of the few anime's that I watched every OP/ED of each episode...\r\nThe art id definetley \"kaway\" I love anime's that have's lot's off colours and happy personallities...\r\nThe characters...Hmmm...I want tosay that I really like Melon chan's personallity...I loved her cheerful smile and how she allways punished Kakeru =) You just have to",
            "date": "2010-06-27T17:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 27673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313513.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Shiro-",
                "username": "Shiro-"
            },
            "url": "https://myanimelist.net/reviews.php?id=27673"
        },
        {
            "content": "The biggest kicker for this show so far is it's Plot. Somehow a drink can comes to life the moment the main character takes a simple sip. They havent explained how or even why this place. But, put basic logic aside. This show can be enjoyable for some people. If your one that enjoys perverted and akward moments with tons of comedic misunderstandings you will probably fall in love with this show very quickly.\r\nAkikan! Differs from alot of other Eechi shows in that the main character is not a pure hearted momma's-boy who is troubled when a beautiful girl suddenly appears in his room. Inthis the main character is rather perverted in nature almost at an extreme level. Akikan! however does fallow a few commenly overused cleches such as the highly attractive childhood friend who the main character is completely oblivious too has a crush on him, stuff like that.\\n\r\nOverall Akikan! is a good way to past the time but is otherwise not rememborable. Its another mindless Eechi comedy you can slide into your collection and wont be ashamed you watch it.",
            "date": "2009-01-13T08:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 11424,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/61047.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFarmer25",
                "username": "AnimeFarmer25"
            },
            "url": "https://myanimelist.net/reviews.php?id=11424"
        },
        {
            "content": "Uggh Akikan, why did I even finish you? Ok, before you dive into this review you should know that I am not a fan of the ecchi genre so of course I do not like this anime.\r\nStory 3/10: I confess that I did find the premise of this anime quite interesting, soda cans that can turn into people is a rather unique and unusual idea. So I decided to watch it. I realized immediately that I would not like the show but why did I watch it? The reason is actually kind of stupid. I convinced myself to watch it through to the end becauseI really wanted to know which can was better, aluminum or titanium because that was the whole point of creating these can-people in the first place. But you know, it seemed like the creators forgot their own storyline, this show doesn't even go into that. By the end of the show you still don't know and it made me want to flip a table. Instead it replaces story with ecchi.\\n\\n\r\nArt 5/10: The art also bothered me, especially the character's hair. I don't know why, it just looks odd.\\n\\n\r\nSound 4/10: The songs for the opening and ending are kind of annoying, so I just kind of skipped those after a while.\\n\\n\r\nCharacter 1/10: Eww, just eww. Kakeru, the main protagonist, creeps me out and I was shocked by his behavior in the first episode towards Melon. I always cheered when he got punched in the face. Kakeru did creep me out, but not as much as Hidehiko did. Hidehiko Otoya is the creepiest character I have ever seen in my life so far. He is a homosexual which is fine, that is not what bothers me, what bothers me is that anytime he sees a guy he tries to sexually harass him. He also does not have the ability to keep his incredibly creepy tongue in his mouth. Everytime he showed up I just shuddered and even though I hated Kakeru I felt extremely sorry for him when he was creeped on by this perv. All the other characters are just weird.\\n\\n\r\nEnjoyment 1/10: I did not enjoy this, it was NOT FUNNY and it definitely was NOT A ROMANCE anime. Calling this a romance is just offensive to women everywhere.\\n\\n\r\nOverall 2/10: As a woman I find this incredibly offensive.\\n",
            "date": "2014-08-05T11:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 155377,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1253781.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/shouj0panda",
                "username": "shouj0panda"
            },
            "url": "https://myanimelist.net/reviews.php?id=155377"
        },
        {
            "content": "This is by far one of the funniest \"Random\" animes I've seen to date.\r\nSure it's got a typical cheesy love story intertwined with it, however, that's not where the \"juice\" is, if you'll excuse the pun, in this anime.\r\nWhat truly makes this anime worth watching is the rediculous over-the-top character behavior and random 3 + Blue = Chair reasoning. I found myself saying \"WTF\" on a regular basis while watching this.\r\nTo summarize, if you're a fan of logic, meaning, or serious storylines, this isn't for you. If you've got the attention span of a goldfish, and/or find erratic and unpredictable behavior of characters in animesfunny, give it a shot.",
            "date": "2010-03-29T10:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 24439,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Xenofrox",
                "username": "Xenofrox"
            },
            "url": "https://myanimelist.net/reviews.php?id=24439"
        },
        {
            "content": "before thinking about:\r\n\"ah, another anti-akikan user...\"\r\nplease read the review. i do not write reviews for nothing, but to give out what i think is necessary ideas to others. please forgive my grammer.\r\ni will do my best of writing this review.. but please remember that i am someone who prefer no ecchiness(hopefully... i don't upset most of people here), but romance, action, and comedy.\r\ndeep sighs.\r\ni will say this first: akikan. is. rated. PG-13.\r\nthat means, kids who are only 13 years or older should watch this show.\r\nlet's see. what the kids whose age is 13 years old, sees in the first episode is:\r\na naked guy with agirl with great shape, and the guy attacks the girl using 'oh, this must be a dream' excuse. later on, a gay government official comes in to the house, offering his 'forbidden love'.\\n\r\nEven from very first episode, the 'anime' akikan gives out messages of 'it's alright to kiss another girl whom you don't really know.' and 'be weird:and you'll get lucky with other girls.' all the kids get from this is: go naked to other girls, offer yuri/yaoi, become a jerk just like the main character, or even buy lots of cans and test if they can turn in to girls. lator on, if these kids are not stopped... they will soon go to the next episodes and see lesbian-transforming can and many other inappropriate messages. \\n\r\n... personally... i was utterly shocked... for the director of this anime had released many other shows that i enjoyed in the past... maybe i had expected too much, but... all i could think of after seeing first 10 minutes of this anime... was: anime regarding companies have finally ran out of creativity. they found no other anime that was as interesting as this horrible anime. and... when i finally saw the ratings: i went berserk. this should have not been pg-13, but around R. \\n\\n\r\nsorry if i got too long on my personal oppinion. now to rating the anime.\\n\r\nthe story... there was no need to talk. the story line was just a cover-up the strange backbone of the anime, just like in hentai's story is just a cover up for its ecchiness.\\n\r\nanime takes in adventage in art. drawing style of anime can become liking to anyone, and akikan's drawing was based on this drawing style. but, not regarding its storyline, i did not like akikan's art at all. it did not match its storyline very well.\\n\r\nbest anime comes with best drawing, sound and storyline. sound of this anime indeed fits as a children's show, but this fact got me more worked up.. since children will take liking this show, and become influenced by it.\\n\r\ncharacter... no need to talk. bottle becoming a girl, and many other girls. just like maids and tsundere girls in anime, characters were VERY unoriginal(except that boy. i was VERY amazed at the author making him such a jerk. others didn't do it that much, making the main character who many kids look up to as a boy who doesn't have any sense of manners.) \\n\r\nenjoyment.. i dropped the anime, which i rarely do. i only watched until 5 episodes, and don't plan to go further ahead. i am amazed at myself going as far as episode 5 to take out some good points regarding my liking to the director,  but i had given up.\\n\\n\r\nSUMMERY OF THIS REVIEW.\\n\r\nto make long story short: the show akikan does not fit as a show for children who are 13 year olds. i'm sure children under age will see this, and greatly influenced by it. story, character, and enjoyment was horrifyingly outrageous, for it lacked originality and innocence. i can picture my self many otaku and children going out on the streets to see any cans sold as melon-flavored(just like many basses were sold after k-on was released). i, at the least, want this show to be rated as around R.\\n\\n\r\nremember... this show contains gay, lesbians, children whose sex  are opposite living under the same roof without any guardians, and relationship problems. does that.. really sound like pg-13?",
            "date": "2009-08-25T22:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 18099,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/72175.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/kjb629",
                "username": "kjb629"
            },
            "url": "https://myanimelist.net/reviews.php?id=18099"
        },
        {
            "content": "okay folks let be honest \r\nwhen it first shows its a masterpiece of the best jokes that i ever seen \r\nthe story is good and the character are good to be ture \r\nbut in epi 6 it shows that it was end to its oringal story so the rest would be just as i freard filler fanserving episode until 12 \r\nso i say like this \r\nthis anime is quite good better than the manga version at least \r\nbut see only 1-6 if you want to see the ture storyline, the rest is up to you",
            "date": "2009-03-30T03:24:00+00:00",
            "helpful_count": 3,
            "mal_id": 13605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/161041.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/enerjak",
                "username": "enerjak"
            },
            "url": "https://myanimelist.net/reviews.php?id=13605"
        },
        {
            "content": "I actually really enjoyed this show. The music was good, excellent animation and voicing, a good story and such, but the second I reached that 11th episode it just all went downhill.  In a single episode they manage to FINALLY introduce the main enemy, and then they proceed to kill off two of the main characters, if you can say they kill them off.  then in the last episode he simply WISHES for her to be freed, and she was.  Its like they fired off all of the writers and hired some fanfiction writers off of some forum board somewhere.  Itwas literally that painful to watch those last two episodes.  No pacing, no real wrap up, almost feels like a spin off of some kind, and just generally ruins the series.  Now ignoring those horrible episodes, the show was still really good and easily earns 9/10 for me, but if you're going to watch it, do yourself a favor and skip the last two episodes. They just aren't worth it.",
            "date": "2012-02-02T17:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 53077,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1125233.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Sackon",
                "username": "Sackon"
            },
            "url": "https://myanimelist.net/reviews.php?id=53077"
        },
        {
            "content": "For those of you who get this vibe to watch a more relaxed anime, this is perfect for you!\r\nThis anime is probably one of my favorites. Although many say that Akikan is the weirdest anime ever (it is), I think it is very, very enjoyable.\r\nWhy? Let's just say that this anime is SUPER relaxed. You don't get much suspense, you don't get much climax. And you know, sometimes, I long for that stuff--an anime series where I don't have to wait episodes upon episodes to see the grand climax (sometimes. Not usually). \r\nThis anime is the perfect laughable, happy, make-you-smile kind of anime that leavesyou feeling refreshed and content. No, there isn't much fanservice, no, there isn't much romance compared to the other romance animes. But this is the best anime for a tiring, depressing, or bad week.",
            "date": "2014-03-09T19:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 135253,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3623119.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/icesica",
                "username": "icesica"
            },
            "url": "https://myanimelist.net/reviews.php?id=135253"
        },
        {
            "content": "\"What.The.Fuck.\" ,actually none animes between those I've already seen deserve this expression more then this one.Those three little words will pop in your mind again and again and again during each episode of Akikan.I won't teach you anything ,everyone know that japanese are kind of crazy ,everyone on Internet know that.And if you had some doubt about that fact...Well Akikan is the proof you needed !\r\nNah really...Cans?...Like...Seriously? Cans transforming into girls? Cans-girls fighting each other in a war for selecting which between aluminium and steel is the best?...As the Dalai-Lama said : \"Oh my dayum.\".\r\nYou know ,I've already watched some really crazy animes and inmost of them you need to switch your brain to \"OFF\" or you'll lose some sanity points like in some Cthulhu rpg.Excell Saga for example...Don't watch it with your brain activated or it's gonna melt and turn into marshmallow.Akikan is one of them ,and it's a good thing that I've already lost all my sanity points because this one can inflict a -50 points immediately !\\n\\n\r\nLet's examine it a little :\\n\\n\r\nStory (7) : Yea ,I give it a 7 even as I say that the story is a big mind fuck.Why? Because it's original ! I have to admit that ,it's stupid ,it's totally \"what the fuck\" ,but it's original in it's own way.After all ,nobody already had the idea to create Cans-girls.Nobody already had the idea to turn them into fruity magical-girls.Nobody already had the stupid idea to make them fight each other in a kind of battle royal.So that's what I said ,it's original...in it's own way.So yea the story was certainly made when the author was drunk like hell and had more alcohol inside him than a bottle of whisky ,but some masterpieces where made under the effect of absinthe so don't judge the power of alcohol too hardly !...What the fuck am I saying?...Anyway ! 7 because it's totally crazy but original ! It's a good story ,perfect when you want to disconnect your brain ,have a few laugh and watch some cute girls.\\n\\n\r\nArt (6) : The artwork aren't excellent but they aren't ugly.But I'll be honest I've seen better ,really better.And I've seen worst too.This one is in the middle.The characters are kind of normally made ,the girls have some charm ,the colors are not too flashy nor dull.\\n\\n\r\nSound (5) : Like for the art part ,the sound part is neutral as hell.Not bad ,not good ,nothing exceptional ,nothing awful.\\n\\n\r\nCharacters (6) : This time I'll surprise you but nah ,the casting is not classic ! Actually I was surprised by how different some characters were from what I expected from.Like Melon for example.Telling the truth ,I've started watching Akikan imagining it like a clone of Chobbits/DearS/Ah my Goddess ,where a guy normal as hell (and stupid as hell too) get a cute girl out of nowhere and the girl is immediately or so in love for him.And here it's totally...Not that.The guy is stupid ,but he's really perverted (and maybe a little crazy ,this guy spend his time seducing a distributor...) ,and Melon is a little shy ,violent ,kind of tsundere and at the beginning she totally hate him.So yea ,a 6 for the surprise and because the casting is different from usual.\\n\r\n I give a special mention for the character of Amaji Gorou (aka Gigolo) because he's one of the most funny useless character I've seen in an anime.The idea to make him literally invisible in some episodes because everyone don't give a fuck about him ,this is genius :D\\n\\n\r\nConclusion : You know what? I think that if you really want to enjoy Akikan you need to choose between two options : Disconnecting your brain and watch it zombilishly (Like \"Duuuuuuuh....Haha baka...Duuuuuh....Oppai...Duuuuh\") ,or watch it drunk like the author was when he imagined it ! And now you'll really appreciate it at full potential I'm sure of that !...Nor you can watch it sober ,but it's less funny...But remember just one thing : Think twice before crushing you cans... :3",
            "date": "2015-03-03T00:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 181595,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486047.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dai_Kina",
                "username": "Dai_Kina"
            },
            "url": "https://myanimelist.net/reviews.php?id=181595"
        },
        {
            "content": "Akikan, bizarre, funny, weird... I have so many mixed emotions about this anime.\r\nOkay, so one can, out of every juice flavour, is a magical girl, who transforms to and from a juice can when drank? Strange is an understatement... But it definitely gets points for originality.\r\nNevertheless, I had so much fun following this anime, never failed to make me laugh! \r\nI seriously respect how much Kakeru DIDN'T CHANGE AT ALL the whole anime, even by episode 12, coming at Melon with his cheeky, perverted, sarcastic remarks. Classic.\r\nA light anime, full of fun, definitely some fan service if that's what you're into, that makes absolutely nosense at all.\\n\\n\r\nCheck it out :)",
            "date": "2015-04-19T00:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 185931,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bly_",
                "username": "bly_"
            },
            "url": "https://myanimelist.net/reviews.php?id=185931"
        },
        {
            "content": "overall score : 4\r\nStory:\r\nKakeru daichi is a boy who collects rare juice cans, when he bought a brand new one to add to his collection hell be in for quite a surprise. As he tries to drink his new can it turns into a girl. Melon one of the akikan who is destined to fight other akikans\r\nHonestly this anime was such a disappointment for me. The premise seems pretty original, cans turn into girls, however they just turned it into a cliché girl fighting series. It was incredibly badly executed completely ignoring most of its premise.\r\nArt:\r\nThe art style is pretty mediocre its not bad butit could be way better. Some of the hairstyles look really unnatural and the designs don’t feel very original. The colours are quite bland and the action scenes don’t have enough motion.\\n\\n\r\nSound:\\n\\n\r\nThe opening of the series  Miracle Plan ga Dekichatta! by Charmmy Queenmatches the show well enough but doesn’t particulary stand out, it is however one of the series more redeeming features. Its an upbeat and happy song\\n\\n\r\nI actually didn’t really like the ending song, it felt like it was a bit all over the place, and I personally didn’t really connect to it. It did however match the show well especially with its title Juicy Extacy by Little non\\n\\n\\n\\n\r\nCharacter:\\n\\n\r\nHonestly the characters to me were very bland , and not very memorable. They didn’t get anywhere enough development and almost all the characters fell into their typical types.\\n\\n\r\nMelon the main heroine I actually found to be quite annoying especially in the beginning later on in the show her personality improved somewhat but not to a redeeming degree.\\n\\n\r\nEnjoyment :\\n\\n\r\nI didn’t really enjoy akikan that much, It took me a long time to finish the show and I actually felt relieved when it was finished\\n\\n\r\nOverall:\\n\\n\r\nAkikan is a bundle of wasted originality and typical personalities. The characters are bland and forgettable and have next to no development. I wouldn’t recommend this show personally\\n\\n",
            "date": "2015-12-06T18:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 204941,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3265117.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/serumie",
                "username": "serumie"
            },
            "url": "https://myanimelist.net/reviews.php?id=204941"
        },
        {
            "content": "I haven't watched a ton of animes in my life. I only started a few years ago, but this is one of the worst ones that I have seen. To me it didn't seem to make much sense and seemed pretty random most of the time. I guess the premise was original with drink cans turning into girls, but what is the point in having a steel can \"fight\" an aluminum can, especially since it seemed like most of the \"owners\" didn't even want their cans to be fighting. It was one of those animes I only finished, just to finish it.\r\nThe art wasn't bad,it looked pretty good overall. The music was OK, but it wasn't good enough to listen to more than once, then skipped on the rest of the episodes.\\n\\n\r\nThe characters weren't anything special. The main character was a typical high school boy, and a complete moron. His neighbor was constantly throwing herself at him, but its not like he noticed. Probably the best one was Mello, the main character of the cans. At least it was kind of interesting that a drink can would like baseball.\\n\\n\r\nI won't spoil what happens, but even the ending was not good and did not make any sense. Overall, a very disappointing anime, and probably not worth the time to watch it.",
            "date": "2013-03-05T00:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 88721,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2242121.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ironsakura",
                "username": "ironsakura"
            },
            "url": "https://myanimelist.net/reviews.php?id=88721"
        },
        {
            "content": "Well...We all know what the Harem genre is about. So I can tell you, even though this Anime has a unique story, it's basic concept is no different to the others.\r\nStory: Well...this part is interesting to say the least. Akikan is about a boy buying a can, drinking from it and suddenly finding himself kissing a girl. He finds out, that the girl is the can herself and needs to drink more of the juice that normally is in her.\r\nThe show scores some points for it's unique concept, but it doesn't really know where to go from here. It has many attempts to become acomedy but has some really serious points too. In total the story might have become something that would be quite ok, but the writing wasn't really the best.\\n\r\n5/10\\n\\n\r\nCharacters: The characters are for the most part quite cliché. We have the perverted main character, the shy but kind one, the annoying little girl and so on. But they are going to develope in the course of the series. It might not be much, but it still is more than other Harem Animes did.\\n\r\n6/10\\n\\n\r\nVisuals: The Visuals of Akikan are quite ok. This is of course no ufotable like work, but it's still watchable and I didn't have any big problems. There are moments when the animation quality goes down and moments when it does get better. In total a\\n\r\n5/10\\n\\n\r\nSound: To be honest...I have no idea of the soundtrack. I didn't recognize it, which is no plus. It always fir the scene it was used in, but it never stood out or was incredibly good. The same goes for Opening and ending. It is ok, but nothing memorable\\n\r\n5/10\\n\\n\r\nEnjoyment: This really depends on which kind of humor you like. I laughed a few times, but that isn't enough for an Anime that is mainly focused on comedy. Of course that is because it just isn't my taste and if you laughed more than me, than score this part higher. The drama scenes of the Anime were suprisingly good though. It isn't anything that makes you cry, but you'll at least feel depressed.\\n\r\n4/10\\n\\n\r\nIn total the Anime is really mediocre. It doesn't stand out in any point. Neither in a negative way nor in a positive one.\\n\\n\r\n5/10",
            "date": "2013-06-06T10:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 100019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2200817.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/korison",
                "username": "korison"
            },
            "url": "https://myanimelist.net/reviews.php?id=100019"
        },
        {
            "content": "Lets start with the thing that this is a clear example of someone who ran out of ideas because lets admit it drink cans turning into girls might be even more absurd \r\nthan pigs flying to the nearest mcdonalds to get slaughtered. The art was not satisfying at all i could see many imperfections and faults like unevenness of the eyes terrible perspective and lets not talk about animation at all. BUT putting that all aside the kind of humor appealed to me in a weird way i cant even explain in words the characters in my opinion were lovable and funny at times. Youcan call me and idiot or unexperienced in anime but in as far as enjoyment goes i give this anime a 9/10 , but i know many people will be raging over this review of the high score i gave to it so taking ALL the things together i could just get a 6/10 on this anime. The story is horrible art is not the best not even talking about the animation, but the characters and humor are appealing to certain audiences.",
            "date": "2013-01-04T03:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 82590,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1964000.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Duplicate",
                "username": "Duplicate"
            },
            "url": "https://myanimelist.net/reviews.php?id=82590"
        },
        {
            "content": "From my Perspective it's an unusual anime which i do understand that, it was made for the purpose of introducing some product. well even that it's still succeed to amuse me. i'll tell you from the start that i won't recommend this anime to anybody. but i can't say no if you really want to check it out.\r\nplease don't expect too much from the story of this anime ,because there really is nothing you can feel or get from the story it's just a normal and plain battle wannabe story which they almost reach that stage from some reason. though they did make it nottoo boring at least you won't get bored to death by watching it :)\\n\\n\r\nfor the art i think they do an acceptable mainstream art, which you must not complain for it because they do this anime for the purpose of product advertising, maybe.\\n\\n\r\nunexpectedly, combined with not a very special story and character they do really put the sound effect which i think they do a very good work which also become a factor that make it bearable to watch and not very dull. for OP and ED i won't comment about it . it's you to decide.\\n\\n\r\nthe character it self at least they explain the character well enough though i just still think that there are a lot of thing that they skip to explain the character very well which i think it's fair. and for me i think the character from this anime just not for me. they are just not special.\\n\\n\r\nOverall i do enjoy this anime and that's why i won't recommend it because i don't want you to hate it.\\n\\n\r\nyou might think that my review just not explain anything since i use a lot of contradicted word. well you may know if you watch it though :p",
            "date": "2017-09-24T04:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 258479,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4577106.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rendhart",
                "username": "Rendhart"
            },
            "url": "https://myanimelist.net/reviews.php?id=258479"
        },
        {
            "content": "I literally just finished this anime, so the overall gist is still fresh in my mind. I've never read the manga, so completely ignore anything you know about the manga. \r\nHere's the general idea of the story: Cans turn into magical girls. There's a war between steel and aluminum, most likely created by the government guy in charge of it. We're never told if magic is involved, but I'll say that it's implied. I mean, how else can cans turn into human girls? \r\nI'll try really hard not to add any spoilers. But here's my take on this. It's a satire with your obligatory ecchimoments and on-the-nose characters. If you think the plot lacks, it's because you're not supposed to get drawn into it with super feels. It's a funny story to pass the time. Instead of Aladdin with his genie off saving the world, a 16 year old sexually frustrated boy discovers his melon-juice can turned into a living, breathing girl. In his room. What do you expect from a story like this? ;) \\n\\n\r\nWhat's more, is that he's the only male involved in this battle between can metal. You have your mature femme-on-femme love triangle and lolita-like girlfriends. They totally act like sisters, but that last episode (ova) at the hot springs - lolz moment. You also have a cross -dresser and a guy who pervs on young boys. It's all in lolz, but there's some implied stuff. Like I said, it's *that* kind of anime.\\n\\n\r\nI do agree with some other reviewers in that this isn't for kids, guys. But in America, PG-13 is never really meant for 13 year olds. It's basically 16+, or 14+ since we all know teens at that age are pretty daring and hide-it-from-mom style. Both Japan and America are actually lenient on frontal nudity, and with this anime they do get borderline in the OVA. In fact, there's implied octo-pr0n in that hot springs episode. Heck, that entire episode was shameless fanservice. :P  Just keep things in mind when watching this one. I don't judge who watches what, so whatevs floats yer boat, aiight? \\n\\n\r\nOverall this was much more enjoyable than watching the reboot of Sailormoon. At least we knew it was a satire, and anything that felt ridiculous was meant to be silly. But I'll be durned if I didn't want to slap Kakeru at his most oblivious moments, or feel sorry for Gigolo -- I mean Jigoro. After seeing Ouran Host Club, I had a better appreciation for this.",
            "date": "2016-01-03T00:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 207625,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5097382.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LadySama",
                "username": "LadySama"
            },
            "url": "https://myanimelist.net/reviews.php?id=207625"
        },
        {
            "content": "In this fantasy comedy, Daichi Kakeru is the high school student hero. He's sixteen, a virgin, collects limited edition juice and soda cans as a hobby and has a dream of being able to find the woman of his dreams to live with and have sex with on a constant basis.\r\nI Hope You Don't watch This Anime Heheheh ^^V",
            "date": "2010-06-16T02:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 27213,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/--Sunclaudius",
                "username": "--Sunclaudius"
            },
            "url": "https://myanimelist.net/reviews.php?id=27213"
        },
        {
            "content": "It's a sweet anime, it doesn't have a difficult plot. It's just empty can's wich turn into girls.. There's sweet romance & humor, but this doesnt get real serious. It reminds me of Chobits a little, without  a real serious part in it. If you like sweet, fun anime's, you should definately watch this.",
            "date": "2009-09-01T07:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 18300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/227786.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Gravitation",
                "username": "Gravitation"
            },
            "url": "https://myanimelist.net/reviews.php?id=18300"
        },
        {
            "content": "I don't need to say much here. Soda turning into girls and an oblivious young man. Soda girls moves in with him. \r\nWatching this series makes me feel like god. I know exactly what happens before it happens. \r\nNuff' Said.",
            "date": "2012-12-31T15:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 82144,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971140.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PurpleDobby",
                "username": "PurpleDobby"
            },
            "url": "https://myanimelist.net/reviews.php?id=82144"
        },
        {
            "content": "A guy drinks a soda and it suddenly turns into a hot girl! Add in the fact that the guy is a perverted high schooler and throw in a bunch of other akikans and you've got a comedic harem.\r\nSadly, despite my strong initial interest in the great potential that the series could have become, the series takes a very apathetic plot sequence and doesn't do justice to either the characters or the overall theme. There are plenty of large plot holes and things that should have been explained that the production studio decided to just leave as is.\r\nThe nature of the show is a combinationof comedy, romance, ecchi, and action, with an emphasis on the comedic/ecchi aspect. The storyline can be understood by a 5 year old and the linear progression is quite appalling.\\n\\n\r\nThere are much better harems/mysteriously-appearing girlfriend series out there. Unless there is absolutely nothing else to watch, I'd avoid this one.\\n\\n\r\nAnimation:\\n\r\nThe animation is fairly average for a series in its time. It is apparent that some scenes received much more attention than others. While the overall series is colored nicely, the battle sequences were fairly basic and didn't contribute much to the overall feel of the series. There is also an abundance of fan service shots.\\n\\n\r\nCharacters are drawn fairly well overall but it ended up looking a bit childish (minus the overflow of ecchi shots).\\n\\n\r\nSound:\\n\r\nThe OPs/EDs were fair but nothing that great. I liked the first OP more than the second OP but they weren't great. The ED changes a bit every episode but it's sort of electro-rap? BGMs weren't very memorable but at least the VAs were good.\\n\\n\r\nMusic: 2/5, VAs: 4/5\\n\\n\r\nStory:\\n\r\nAkikan had a lot of potential early on. The theme of a can turning into a girl is quite unique but the concept was explored in as great of detail as I had hoped.\\n\\n\r\nThere is this tournament between steel and aluminum cans (no plastic/glass bottles apparently) to determine which will be the can of choice in the nation. Apparently the cans have special powers and are very physically strong and, obviously, there is tension between steel and aluminum akikans.\\n\\n\r\nThe majority of the show focuses on the slice of life daily routine of Daichi Kakeru as he teaches Melon about the world and school life, and the occasion not-so-ordinary fights with other akikan.\\n\\n\r\nThe plot is very simple and there aren't really any serious complications till the final few episodes in which a somewhat tense but otherwise pathetic climax is reached. The overall climax and resolution are pretty pitiful as it didn't really have to do at all with the series before the final few episodes.\\n\\n\r\nThey could have done so much better but it felt as if they just made this a secondary show as Gonzo did with Kaze no Stigma... quite disappointing.\\n\\n\r\nCharacter:\\n\r\nDaichi Kakeru, Melon, and the other main characters had fairly unique and interesting personalities, but much about the characters' pasts and relations were barely explored.\\n\\n\r\nThe largest issue is that the characters just suddenly have strong bonds between the akikan and the \"owners\". Likewise, steel and aluminum akikans suddenly work together near the end. The development of the characters sometimes didn't match up with the plot sequences and thus the overall series just felt disorganized.\\n\\n\r\nValue:\\n\r\nThis is a light, ecchi harem. Don't expect any deep philosophizing or a well-developed plot line. Though some parts of the show were fairly humorous, the lack-luster story and childish character development really made this show fall short of its initial potential.",
            "date": "2015-11-01T14:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 202430,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202430"
        }
    ],
    [
        {
            "content": "Come here for the fantasies, not for a revolutionizing experience. Akikan is an anime where each soda can is a guardian to the one who drinks it. This anime is very generic but it does serve its own purpose of fulfilling anyone's twisted fantasies(including mine!). It's hard to go wrong with having someone be protective by your side as long as you live. The music for the first OP is pretty good(the second one isn't as good) and the plot by itself is excellent, though it can be better executed. I wish they would make another season of this and I will one day goto Japan just to drink their melon soda!!!",
            "date": "2017-10-16T02:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 260918,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4664087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SimplyKaori",
                "username": "SimplyKaori"
            },
            "url": "https://myanimelist.net/reviews.php?id=260918"
        }
    ]
]