[
    [
        {
            "content": "REC only spans ten episodes (counting the DVD special) and those episodes aren't even full-length, yet it manages to be more heartwarming and entertaining than many longer series. It isn't groundbreaking at all, but if you don't hate predictable romance anime, it is a perfect way to cheer you up when you're feeling a little down.\r\nOnda Aka is a rookie voice actress who one day encounters the salary man Matsumaru Fumihiko, who's been stood up by his date, in front of the cinema. Long story short, Aka makes Matsumaru watch the movie together with her and the flames of love are ignited. Later the samenight, Aka's apartment catches fire and she is taken in by Matsumaru. Romantic events ensue, but when waking up the next day, neither of them regards themselves as a real couple. Incidentally, they end up working together with the marketing of Matsumaru's latest invention: a leaf-shaped crisp. Aka is - of course - voicing the product's mascot, Neko-ki - a tree with a cat's head. \\n\\n\r\nThe focal point of the story is, not surprisingly, the development of the two main characters' relationship and how it is affected by Aka's rise in popularity; is it right for her to prioritize her career even though it leads to her not being able to spend time with Matsumaru? Though the story is far from original, I still really cared about Aka and Matsumaru. Because REC is, unlike most other anime belonging in this genre, not full of unnecessary melodrama or supernatural elements - it is realistic, and that makes it so much more engaging. \\n\\n\r\nAnimation studio SHAFT, of Sayonara Zetsubou Sensei and ef - a tale of memories fame, is responsible for the animation. REC's visuals don't impress at all, but they suffice; Aka is heart-wrenchingly cute and Matsumaru is... well... ordinary. Backgrounds and the like are good as well. \\n\\n\r\nThe seiyuu (voice actors) did a great job with all the characters, including the minor ones, enhancing the warm atmosphere of the anime greatly. Music was always fitting though far from memorable. The opening wasn't my cup of tea, but, then again, I couldn't care less. \\n\\n\r\nTo summarize, REC isn't the most innovative romance anime around, but it's realistic approach to the genre makes it refreshing and the chemistry between the characters (who are the series' greatest strength) is wonderful and Aka and Matsumaru's feelings toward each other feel genuine. I would not have complained had it been longer, but it's shortness may also be a strength; it never got even close to boring, even though I watched it all in one sitting. \\n\\n\r\nA highly recommended anime to all romance fans.",
            "date": "2008-09-27T14:41:00+00:00",
            "helpful_count": 142,
            "mal_id": 8213,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24106.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tenchio",
                "username": "Tenchio"
            },
            "url": "https://myanimelist.net/reviews.php?id=8213"
        },
        {
            "content": "REC,\r\nStory:\r\n     REC, incorporates real life problems with a warm feel. This story is basically life, while trying to understand your feelings with a cute spin here and there, but serious when it needs to be. \r\nArt:\r\n     Art is good, borderline amazing.\r\nSound:\r\n     Soundtrack is good, character voices were cute, well portraying of the characters.\r\nCharacter:\r\n     Character development is great, you end up liking the characters and somewhat can relate to their problems as time goes on. \r\nWhy did I like this anime?\r\n     It was pretty damn cute,life problems mixed in with a 'I love you, but wait do I really?' type of feel. It relates to life problems and is somewhat humorous and serious when needed. Very good anime, feeling of satisfaction I must say.",
            "date": "2007-08-12T02:21:00+00:00",
            "helpful_count": 64,
            "mal_id": 686,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dnt",
                "username": "dnt"
            },
            "url": "https://myanimelist.net/reviews.php?id=686"
        },
        {
            "content": "Well, I watched REC, and I think that it was quite a good storyline, for a short series! 9 episodes, spanning 12 minutes each. It&rsquo;s a shame there wasn&rsquo;t more.\r\nBut hey, onto 1st my review!\r\nI&rsquo;ll split this into 5 secions, rating each section, then give an overall x/10 rating!\r\nStory 8/10\r\nI enjoyed the story, some good twists in it, and it was good &rsquo;slice of life&rsquo;, in my opinion. I wish that there was more anime for this series. It was a good start to the series, and the ending was quite good also, a little more wouldn&rsquo;t have gone a miss though!\r\nAnimation 9/10\r\nI like theanimation, there were some really good bits, some weren&rsquo;t that great, but it did the job! I think that most of it borderlines on amazing, but after recently seeing the AIR movie, I&rsquo;m not sure anything&rsquo;s going to beat that!\\n\\n\r\nSound 7/10\\n\\n\r\nThe voices fit the characters, I think. I think that they were good at the roles, and nothing was out of place&hellip; Well, nothing except the &lsquo;REC&rsquo; bits, that randomly appear throughout the episodes&hellip; There are some strange noises &gt;,&lt;&hellip; Never mind though.\\n\\n\r\nCharacter 8/10\\n\\n\r\nI enjoyed the development of the characters in this series, however short lived it was. You got minimal detail about the history of the characters, learned what they wanted, or what their dreams were, and then followed Aka as she fulfilled hers. Mind you, Matsumaru had his fair share of achievements!\\n\\n\r\nEnjoyment 9/10\\n\\n\r\nOverall, I really enjoyed this anime, even when it was so short. I mean, short series&rsquo; are okay, but sometimes I think the longer, the better. This one proves that theory wrong!\\n\\n\r\nMy overall rating&hellip;\\n\\n\r\nDrumroll, please!\\n\\n\r\n8/10\\n\\n\r\n*Off topic*\\n\\n\r\nHaha, I was reading about this anime on other sites, and I found out that, liek a lot of other anime, there is a manga for it, so I&rsquo;ll be off to buy that one when I get paid! xD\\n\r\nBut then, considering the Manga is, if I am correct, still being written, maybe they will go ahead and make more anime from it?\\n\\n\r\nThat is all!",
            "date": "2008-01-22T08:07:00+00:00",
            "helpful_count": 38,
            "mal_id": 2096,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26112.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kyte",
                "username": "Kyte"
            },
            "url": "https://myanimelist.net/reviews.php?id=2096"
        },
        {
            "content": "There is nothing quite like sitting down to a nice down-to-earth anime. Sometimes those are are hard to find, yet here we are with Rec. It is the story about a guy and girl living under the same roof. Seems kind of cliche, until it actually gives a legit reason: her house burned down (sorry I saw the title and the burning house and immediately thought of mix tapes, I'm so ashamed). I know the length of the episodes seems intimidating, but it was not bad at all. I applaud the series for actually giving us something to enjoy while putting it in half thetime frame of most other series. Now, lets dig into this...\\n\\n\r\nStory-7\\n\r\n Short, yet effective, those are the best words to summarize this. We have our guy, Matsumaru, waiting outside a movie theater. Why, you may ask? He got dumped. By a woman whom most viewers will probably dislike. He then meets a 20 year old girl named Ako, and will precede to find solace in getting plastered with her. They will then walk home and everything will be over. Or so they thought. Sucks when your house burns down. So that's how we come to them living together. He works for a candy company and comes up with ideas for them to use. She is a novice voice actress. Throughout this series they have to deal with success while also balancing the feelings they start to have for each other. That's it. It's a nice, simple story to unwind to after a stressful day. It is not a bad story riddled by plot holes, nor is it an absolute masterpiece. It is just a refreshing look into the real world of business.\\n\\n\r\nArt- 7\\n\r\nThe art is average. It is along the same lines as the story, refreshing, yet not stunning. It uses mildly dull colors so it's not going to vomit rainbows in your face. The leading girl looks quite cute, and this series emphasized that. The guy was pretty standard for an anime protagonist. Overall I gave the art a decent score because I thought the art was fitting to what the series was aiming for.\\n\\n\r\nSound- 6\\n\r\nThe weakest aspect. Not much to say here. There was no op or ed. You have background music and sound effects when the title roles on screen. Although those could be humorous at times. Really there was nothing bad about any of it as far as I could tell. It did what it had to do and didn't leap over mountains to give us auditory pleasure.\\n\\n\r\nCharacter- 9\\n\r\nThis I thought was great. For such a short series they really managed to capture the people we really care about. The male protagonist is just a man trying to rise up in the business world. The leading heroine is just a female voice actress trying to accomplish her dream. Throughout this series we get to see them both succeed and fail, and what it does to them afterward. We have all had times where we failed at something and took it out on others, that's where our male protagonist has trouble. We have all had moments where we had to do things we didn't want to do for our benefit, and that's where our heroine had trouble. It was pleasing to see such relatable problems on anime characters, and the series did a great job at portraying them. The rest of the characters are there to act as foils for the relationship of the two. We have Ako's manager who is strict, yet understanding. We have  Matsumaru's co-worker who tries to cheer him up and let us know he is not a complete loner at work. And we have the woman who stood him up, who acts as an inciter of jealousy in Ako. In the end, she helps us realize the depth to which Ako cares for Matsumaru. Only problem I have is that Ako is all touchy-feely with Matsumaru in the beginning but then flat out denies they're together for most of the series. We know better, right?\\n\\n\r\nEnjoyment-9\\n\r\nA fantastic little series I thought. I happen to love romance anime and this is one that would be a disappointment to miss. I enjoyed the down to earth setting, story, and characters. They were a good break from witches, warlocks, super power lolies, and everything else anime sometimes throws at us.\\n\\n\r\nOverall-8\\n\r\nA cute little series. If you are into romance with the occasional hint of comedy and drama, this is one anime you will most certainly not regret.",
            "date": "2015-04-07T17:04:00+00:00",
            "helpful_count": 30,
            "mal_id": 185092,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4172341.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OmegaPhoenix",
                "username": "OmegaPhoenix"
            },
            "url": "https://myanimelist.net/reviews.php?id=185092"
        },
        {
            "content": "What is a better day to post a review for Rec than Hollywood actress Audrey Hepburn’s 85th birthday? Audrey Hepburn was a huge inspiration for the show’s aspiring voice actress Aka, and the show embraced her movie titles and movie quotes in each episode.\r\nI warn you that you may not like this show if you’re expecting a steamy hot romance. It's more about the development of a romance. Some people who watched Rec, including me, rated it with a very low score, because it’s incredibly boring at first viewing. However, Rec is different from most other romance anime and not as cliché. It reflects onreality by displaying the disappointment and challenges of balancing a professional life with a private life. Rec revolves around an aspiring voice actress (Aka) and a marketer (Matsu) dealing with the struggles and pressure of work. One problem I had was that their relationship happened quite fast with Aka moving into Matsu’s place the same day they met, because her place burned down without any given reason. On a positive note, Rec goes behind the scenes of the media industry and excitingly shows the transition of a popular seiyuu, including the advertisement and work inside the studio.\\n\\n\r\nThere are a few problems I had with the characters. If it were not for the revelation of Aka’s age (20 years) and scenes of her drinking beer, this show would seriously appear as a lolicon. She literally looks and sounds like a little girl, while Matsu looks like an old man despite being 26. Matsu can honestly get pretty annoying. He is a loner who is desperate for a girlfriend and relieved when Aka walks into his life. This causes him to act perverted at times, and it may be entertaining and funny for someone who enjoys anime where a guy constantly experiences rejection. I honestly didn’t like it. Apart from that, Aka and Matsu are strong as a pair. They show support and feelings for each other as they work together in their career. The supporting characters contribute to the pair’s relationship by revealing life’s disappointments and giving advice that has an impact on them. They also participate in each of their careers and show how the media industry works in Japan.\\n\\n\r\nThe artwork looks old as if it’s from the 1990s instead of the 2000s. It resembles something out of a childrens’ book. The colors are bland. The backgrounds are plainly drawn, and the only activity are from the main characters. The rest of the society is still. The character design was average. The females were the only attractive characters in the show, and the males could not nearly compare. The settings, including recording studios, are drawn realistically as it suits the atmosphere of voice actors and advertisers.\\n\\n\r\nThe OP, sung by Kanako Sanai (voice of Aka), is pretty good, but it could be unattractive to others. The truth is the lyrics of the OP describes the show perfectly: “Don’t give up/Embrace all of your worries.” Not only does it describe their relationship, but it says not to let life get you down at the worst of times.  The seiyuu expressed appropriate emotions for situations, including jealousy and excitement. The background music and sound effects fit the atmosphere well.\\n\\n\r\nRec is an anime that you’ll have to rewatch with a different mindset if you did not enjoy it the first time. Honestly, the few people that scored Rec below a 7 were bored out of their minds just like I was. I planned to drop it during my first viewing, but it didn’t make sense for me to drop an anime that only has nine 12-minute episodes. I couldn’t stand the anime, and the OP was completely annoying at first. After rewatching it, I actually enjoy it more than other romance anime, and the OP is one of my favorites. As I mentioned earlier, this is the most realistic romance anime out there as it features the complications of relationships because of busy careers, which is the primary reason why my score changed from a 6 to a 9.",
            "date": "2014-05-04T20:39:00+00:00",
            "helpful_count": 28,
            "mal_id": 142365,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=142365"
        },
        {
            "content": "Cute. Wish there were more. The character's were beautifully written, as was the plot. The relationship between the two main characers were perfect, as they explored the growth their personal and work lives. \r\nThe female Onda, Aka played the cute, happy, but vulnerable role quite well. At times you really wanted to strangle Matsumaru, Fumihiko ; who appears to be more crass than other sensitive male leading roles.\r\nPerhaps it is truthfulness like this which mirrors real life; that adds to the beauty of this series. Now I\"ll have to look to see if there are any Manga out for this.\r\n(PS there is and it isongoing. The anime touches volume one and they are currently into Volume 5)\\n\\n\r\nEnjoy.",
            "date": "2007-09-07T23:33:00+00:00",
            "helpful_count": 25,
            "mal_id": 815,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12510.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/purplegold",
                "username": "purplegold"
            },
            "url": "https://myanimelist.net/reviews.php?id=815"
        },
        {
            "content": "Rec is a romantic comedy about an aspiring voice actress. The manga was written by Hanamizawa Q-Tarou in 2002 and is still ongoing. In 2006 it got a nine episode anime adaptation. I've never read the manga, but how does a long running series translate into nine twelve minute episodes? Let's take a look at Rec and find out.\r\nThe plot is very simple. A guy, Matsumaru, gets stood up for a movie date. As he's about to throw the tickets away he's approached by a girl, Aka, who tells him not to waste them. They go to the movies and then drinking together. After theypart ways her apartment burns down and she doesn't have any family or friends whatsoever so she ends up moving in with Matsumaru, how very convenient. Actually, convenient is the wrong word, contrived would be more accurate. The series is about her and Matsumaru living together and trying to keep their connection a secret for no adequately explained reason. It's every bit as stupid as it sounds. Does the comedy work? No, there are no funny moments in Rec, not one. Just the contrived romance.\\n\\n\r\nThe characters don't help matters. Aka and Matsumaru have no chemistry which makes the romance aspect just seem even more forced. They're also complete morons, as are all of the minor characters. Which makes them just annoying to watch.\\n\\n\r\nThe art is the best part of the series. It's pretty well done with some good details. There are some moments where the sound is out of sync with the characters' mouths but that isn't a major issue. \\n\\n\r\nThe voice acting isn't bad. It's not anything spectacular or with any stand out performances but it's decent. The actors probably could've done better if they'd had decent dialogue. The music isn't bad but it's not good either. It's pretty forgettable. \\n\\n\r\nThe yuri factor is a 1/10. There is no yuri in this. \\n\\n\r\nMy final rating for Rec is a 2/10. It's a terrible anime. The decent art and average voice acting can't make up for the terrible story, failed humour or moronic characters.",
            "date": "2012-06-06T08:29:00+00:00",
            "helpful_count": 17,
            "mal_id": 62789,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=62789"
        },
        {
            "content": "Story:\r\nThe story of this anime is really unique... love between a seiyu and a business man (how messy can that be? LOL)\r\nEhem... well the series did a really GOOD JOB on making series,  from what ive seen the series made me fall in love again! (most of my friends seconded on this one)\r\nArt:\r\nOne of the series that really has amazing art... the theme look different when its sunrise (the shiny white theme were amazing)... and good artworks were viewed at ending (which really makes me watch more LOL)\r\nSound:\r\nOpening was great... i was like \"WOW that was really cute\" every time the aka says Uwwww...in the opening theme song XD BGM music was also good cause they seem to fit in the series also...\\n\\n\r\nEnjoyment:\\n\r\nI was shaking while watching this one (oh... pure enjoyment)... it is really a heart warming series for everyone! Uber cuteness + Stupid love = OWNAGE!\\n\\n\r\nOverall:\\n\r\ni told myself after watching this anime &quot;that was great i want more&quot; then after some time i find myself reading REC manga... so this series is really a TOP PRIORITY for everyone\\n\r\n~Watch and be amaze~",
            "date": "2007-11-11T06:33:00+00:00",
            "helpful_count": 14,
            "mal_id": 1273,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20913.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jansuke",
                "username": "jansuke"
            },
            "url": "https://myanimelist.net/reviews.php?id=1273"
        },
        {
            "content": "To be honest, I wasn't expecting much from this anime. The reason why I decided to watch it is just because it's from Shaft, thus I thought the artwork would be great with the unique Shaft style. My thoughts was wrong. (If you're not familiar with the word Shaft, it's an anime studio responsible for the unique artwork, gag, and cinematography of Bakemonogatari, Madoka Shoujo Madoka Magica, Nisekoi and much more)\r\nThe story is about an office guy, a salary man(Japanese white collar businessman) to be precise, who is living with a girl who dreamt on becoming a voice actress. Although living together and already did'something', the both of them doesn't consider themselves having a 'that' sort of relationship . They also kept their living-together a secret from the others because they thought that it would affect their career.\\n\\n\r\nThe pacing is a bit fast, well, maybe too rushed due to the fact that it's only 12 minutes per episode. There's nothing unique and complex about the story. It's quite predictable too. There are so many complications for both of the characters throughout the story. When the girl has a problem with her career, the guy takes care of it, and vice versa. What makes it 'not good' is that some of it seems to be trivial but considered a big deal, and.... the other, which seems to be a really big deal, is taken lightly. Despite of that, the ending is really satisfying.\\n\\n\r\nOkay, so now let's talk about the artwork. Coming from Shaft........ It's horrible. It really looks like something coming out of the 90s. Compared to the other Shaft creation and anime(s) from 2006, it's really poor made. Seriously, it's not the quality of the video I have that makes it look bad, it's the anime itself.\\n\\n\r\nCharacters. We have the main guy, Matsumaru Fumihiko, and the main girl, Onda Aka. Matsumaru is an average guy working as an average white-collar in a not-so average company. But hey, he's got himself a pretty average face. He likes to tease Onda and even 'tried' to seduce her sometimes, and get's rejected 'almost' every time. On the other hand Onda is an energetic girl who likes to imitate a certain voice actress. She really care about Matsumaru, but she doesn't consider themselves as partners for some reasons. \\n\\n\r\nGoing through a lot of obstacle, their feelings seems to grow after each one. The development is really fast at the start, then it goes constant average throughout the rest. Though it's good overall. The side characters aren't that bad either.\\n\\n\r\nSo, if you ask did I actually enjoyed this 12-minutes/ep anime? I pretty much did, despite the not-enjoyable artwork it has. But then again, the story, characters, developments are -imo- pretty decent. For a rom-com though, I don't really laugh that much. I actually didn't laugh at all. Jokes are too.... you know... how to say it... predictable i think. (i couldn't find an adjective for it.)\\n\\n\r\nOverall, 'Rec' or レック is decent rom-com anime that didn't surpass the average status. It has some good points, but also some major flaws. I don't really recommend this anime, but if you like rom-coms and would like to watch anything of the sort, just try giving it a shot. It isn't a full episode anime and only has 9 episodes anyway.\\n\\n\r\n-Btw, after watching the first episode, I literally said \"Well, that escalated quickly.\" \\n\\n\\n\\n",
            "date": "2014-04-04T04:27:00+00:00",
            "helpful_count": 12,
            "mal_id": 138585,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3457557.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BadabumBadabicch",
                "username": "BadabumBadabicch"
            },
            "url": "https://myanimelist.net/reviews.php?id=138585"
        },
        {
            "content": "Rec is an anime I did not have high hopes for, I figured since it was so short, it would be super rushed and not have a lot of backstory, although it was somewhat rushed at the beginning, I feel the progression worked very well. There are 10 episodes in total that are about 12 mins each, I enjoyed the length of this anime because it was short and to the point, and quite heartwarming. Definitely a must watch for you Romance lovers out there.\r\nThis story begins with Matsumaru waiting for his date at the movie theater, however, his date is a no-show, just whenhe is about to give up on his date and throw away the tickets, Aka comes in to save the day! So they go to watch the movie together. Later on, a huge fire occurs, and her place is burned down, this is where Matsumaru comes in to save the day, he offers for her to stay at his place, and this my friends, is where the story begins.\\n\\n\r\nStory 8/10\\n\r\nEven though the anime was fairly short with only 10 episodes that were 12 minutes each, it was a nice progression of the romance between the two. They were able to depict the working situation of both Aka and Matsumaru, and how they played a role in them becoming closer. The romance slowly starts to grow as they are living and working together, and of course, comes conflicts that they must overcome together. I also liked the fact I had not seen many anime with this type of story. The character following their dreams of becoming a voice actor, while also finding that special someone.\\n\\n\r\nArt 6/10\\n\r\nThe art was not anything special, but that is to be expected from a short anime from 2006. They did do a pretty good job on the main character designs, but the background details at times did have some lacking attributes, but as I said, it is a short anime.\\n\\n\r\nSound 7/10\\n\r\nThe sounds were not really all that important in this anime, so they were alright, nothing great, nothing bad. The voice acting was done pretty well, Aka's voice actor matched perfect.\\n\\n\r\nCharacter 7/10\\n\r\nThey did not go into the past of either of the two, such as family or schools or anything, but they did a good job of portraying their feelings about situations, and also their goals in life. The supporting characters did not get much at all, but being that the anime is so short, that's understandable.\\n\\n\r\nEnjoyment 9/10\\n\r\nI really enjoyed this anime. The shortness was something I actually enjoyed, it allowed me to see how they progressed romantically without wasting time on pointless side-story as in some anime. It was a really nice romance between the two, and to see it all come together was a real treat.\\n\\n\r\nOverall 8/10\\n\r\nThe reason for this 8 is the pure enjoyment I had seeing the romance in this anime. The story was great, I liked how they showed what the both of them went through in their work lives, and how that played a part in their romance, and vise versa. I would recommend this to anyone who is a fan of romance, and who doesn't mind it being short and sweet.",
            "date": "2014-03-17T08:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 135943,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3535449.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scragleton",
                "username": "Scragleton"
            },
            "url": "https://myanimelist.net/reviews.php?id=135943"
        },
        {
            "content": "Rec is a short series that captivates the heart despite its nine 12-minute episodes. It does this by being centered on the conflict between our two protagonists. This conflict being whether or not they can continue living together since their professions are closely tied and foul rumors may spread among employees. I won't into too much depth about their conflict since it is what kept me interested in the series and what I highly recommend you pay close attention to should you watch this.\r\nStory: 9\r\nThe story can best be described as a rom-com without the com but that isn't to say that the story isn'tfunny. What I hope to convey through this metaphor is that the series focuses on the two central characters and their interactions. \\n\\n\r\nIf you are unsure about watching this show, watch the first 2 episodes first (Duration wise, it's like watching the first episode of a regular anime).\\n\r\nThe first two episodes present the complications of their relationship and why their living situation could become a dilemma. These first two episodes are what made me forget about the rating on MAL and conditioned me to really pay attention to what was happening in the show.\\n\\n\r\nEpisodes three-eight solidly build on their relationship and how that could bring negative reception from their employers. They do a great job of building up tension and investment for the characters.\\n\\n\r\nThe last episode is a sweet ending, nothing more to be said.\\n\\n\r\nArt: 7\\n\r\nI have much less to say about this topic. It's a 2006 anime, you shouldn't expect high quality artistic talent on a project like this. Compared to other shows I've seen from this time period, it's definitely middlingly average. Most of the characters' faces or designs aren't really memorable except for Onda. \\n\\n\r\nSound: 9\\n\r\nThe voice acting is nice, nothing sounds off-mood or breaks the tone of the show. Onda especially shows change with her voice as she progresses through her career and it was very heartwarming to watch. The opening is cute but the lyrics sung, oh man, those give you a vague idea of what's to come and they powerful. I won't analyze the entire opening as that would require a video and a lot of editing, but I will tell you that reading the lyrics every time you start the episode will get you the full experience of sadness and happiness that made me cry.\\n\\n\r\nCharacter: 10\\n\r\nWhile not too many are present in this anime, the main ones are very well developed and carry much emotional investment by the end of the series. Onda is a young eccentric girl who is a rising voice actor. The conflict between her rise to fame and her relationship with Matsumaru make for a tear-jerking viewijng experience. Matsumaru is an older man who has largely given up on finding a better life and tries to make the best of the situation. The conflict between his relationship with Onka and what he believes she wants also make for an emotional adventure that is sure to invoke feelings inside of you as well. \\n\\n\r\nEnjoyment: 10\\n\r\nOnda is adorable and and worthy of one of your 10 favorite character spots. That aside, what I really enjoyed about this show was the ending. As they are adults in the workforce, they act like adults in the workforce and there is no hiding or confusion of feelings. They speak what they believe and they answer truthfully. Nothing more can be said without spoiling the show.\\n\\n\r\nOverall: 9\\n\r\nRec is a great show for any lover of the romance genre, the emotional payoff heartwarming and it explores obstacles that are non-existent in High School anime. If you feel the need to spend time on anime, I advise you to watch this. It's short, sweet, and will make your heart cry.",
            "date": "2018-12-08T15:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 295461,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721069.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KnicePerson",
                "username": "KnicePerson"
            },
            "url": "https://myanimelist.net/reviews.php?id=295461"
        },
        {
            "content": "wow............. this anime in my opinion is amazing but on to the review.\r\n  So the story is (if you read its summary) about a loser guy is lucky enough to get a cute voice actress to stay at his place because her house was burnt down which they don't give us a reason of why the fuck it was but anyways they just fast paced episode 1 to get on with the good stuff which guys I recommend watching cause its very dramatic in a sense that you would feel tears coming up when you see how the ups and down these two charactershave in their everyday lives with huge fights between a none but almost a couple and hurtful scenes which makes you wanna slap a character at times.\\n\\n\r\n  The art is brilliant overall its one that is enough to be popular but despite that its a very old style of drawing the mature girls eyes kinda big but big enough to give her the effect of putting on that extra sorrow when she sad. The colors of this anime is very simple if I must add they aren't really that contrast to look like the ones made in 2008 and above that are very clean and smooth and the colors shine brightly but this anime puts enough to give you the special eye shower of color.\\n\\n\r\n  characters are all well developed other than the fact the episodes were to short to even get deeper into each of the characters back round story but that's not the main focus that they were trying to portray. they were trying to tell people how life was like between to people with to jobs that seemed kinda distant. but overall the characters were well done and easy to understand and get how they played their role with each of the their kind of personalities in the story.\\n\\n\r\n  I really enjoyed this anime and because of the heart tugging and tear jerking feeling I had throughout the anime (that I don't feel that often in some romantic or sad stories which are horribly done) I would give this both a 10 for my enjoyment and overall. It was fun watching how both comedy and serous love and drama were balanced out and it gave a sense of reality for the characters to endure throughout living together. (spoiler alert) I mean of course your ganna have troubles with your jobs that you take it out on your girlfriend right.\\n\\n\r\n  thanks for reading and let me know if you have any questions on my page see ya ^_^",
            "date": "2013-11-27T13:53:00+00:00",
            "helpful_count": 9,
            "mal_id": 121601,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3353733.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ataraxia-9",
                "username": "Ataraxia-9"
            },
            "url": "https://myanimelist.net/reviews.php?id=121601"
        },
        {
            "content": "Audrey Hepburn would turn around in her grave if she knew what work her name was attached to.\r\nStory:\r\nOn the surface, Rec leads us to believe that we bear witness to the blooming of a young love and a boy and a girl overcoming the many obstacles in their way to be together. In reality, what we get to see is the formation of an abusive relationship that is presented as the ideal romance. I’m at loss for words how disgusting this is. Apparently, the author is either an utterly broken victim of this in real life, or (more likely) a terrible human being that youshould stay as far away from as possible. In their sick, twisted mind, it is heartwarming to guilt-trip somebody into a relationship and take advantage of a helpless individual. This is wrong on so many levels, that I would like to erase it from my memory, or better yet, from existence. Do you think I’m joking? Take a closer look, it’s not hard to see. Aka has no reason to like Matsumaru, but she feels indebted to him, that’s why she swallows all the abuse. That’s a topic for the character sector, all I can say about the story is, there is no romance, just one guy wanting pussy and a girl in dire straits. The fact that Rec pretends to be a romance is ludicrous.\\n\r\n1/10\\n\\n\r\nArt:\\n\r\nThis anime looks okay, but there is absolutely nothing special about it. Character design is okay, backgrounds are okay, animation is okay, it’s just a huge pile of okay. That’s acceptable for a \"romantic comedy\", which is supposed to score with other qualities. Yeah, that’s not much of a statement, but there really aren’t any strong or weak points to go into deeper detail about.\\n\r\n6/10\\n\\n\r\nSound:\\n\r\nThe music (including opening and ending song) are okay. Yeah, I know, but they just don’t give me anything to work with. The voice acting is a bit disappointing. I don’t doubt that Kanako Sakai is capable of a good performance, but if you voice a voice actress, aren’t you supposed to show off your abilities? Judging from her very small number of roles listed on MAL, I may not be the only one who thinks she’s rather meh in an ocean of great. The rest of the bunch does a decent job, but they don’t have any big challenges to master.\\n\r\n5/10\\n\\n\r\nCharacters:\\n\r\nThere is not a single likeable person in this cast. Matsumaru, the male lead is a despicable piece of shit, who keeps trying to take advantage of Aka all the time. Even worse, he somehow manages to twist the truth around to make her feel guilty about something that HE did. First he date-rapes her (I admit, this is debatable, but looking at how these two behave later on, I’d say the evidence is obvious), then he repeatedly tries to guilt her into sex by giving her shelter after her house burned down. When that fails, he terrorizes her with their work project, making her afraid of somebody finding out and being labeled as nepotist whore. After still not getting more pussy, he makes her feel responsible for his own failures at work and when he has her down to the point where she even apologizes for it, he literally tells her to fuck off. And to top it all off, after he managed to completely break her, he doesn’t ask her to be his girlfriend, no, he DEMANDS her to be his girlfriend. And don’t even get me started on when he tried to get himself another chick, that was a completely different kind of low that I don’t even want to speak about.\\n\r\nSo, does nobody help this poor girl out? How about her agent? Nope, her manager tells her to dub porn or her career is over. None of the side characters is of any help in any way, nor do they add much to the show as a whole.\\n\r\n1/10\\n\\n\r\nEnjoyment:\\n\r\nI hate this anime, it makes me sick just thinking about it. Everybody involved with this should feel ashamed. If they were trying to tell a different story, it could’ve maybe worked, but they want to sell me Rec as a romantic comedy, which it just isn’t. I’d rather accept Schindler’s List as one than this crap. Twilight is a better love story than this. But what shocks me the most is how many people apparently fell for it. My brain can’t comprehend the thinking process that goes into accepting these blatant lies. This isn't a personal attack if you happen to like this show, I just don't understand how or why. Anyway, any more words would be a waste of time, all you need to know is: Don’t watch it!\\n\r\n1/10\\n\\n\r\nOverall:\\n\r\n2.8/10",
            "date": "2017-08-23T10:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 256098,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=256098"
        },
        {
            "content": "In spite of this series being fairly short, with length and episode duration, it manages to tell a better story than a lot of full length series. With Rec you really are not expecting anything amazing when you first notice it, but your voice of the series changes astonishingly fast. Really the series itself manages to grab you and keep you from the first episode right to the final scene. \r\nI want to talk about the Art and Animation first off. It's incredible, strictly speaking from a low budget series. The animation is fluid, it flows together very well. The art work is simple, almostlazy in some parts. But with that said the art work itself was unique and part of what grabs you into the series. Beauty in the simplicity. Overall I'd rank the art at around an 8.2/10. Now to focus on what actually grabs and keeps an audience, The Story.\\n\\n\r\nWith this series the story starts off quite innocent, you feel sorry for Matsumaru. You are introduced to cute main girl, Aka Onda(with an exceptional voice acting role by Kanako Sakai to mention). Then after the two enjoy a fated first meeting we are brought to the problem that brings this couple together. Now without spoiling anything, I can say it is not Deus-Ex like, but does seem kind of unluckily convenient for the story progression. With this Aka is invited to stay with Matsumaru, in which they begin a lovers relationship where they are not lovers. Now as the series progresses we have bonding moments and we having moments where the couple(who aren't actually a couple... yet?) are almost driven apart. But with turmoil comes the true feelings. And pray it is not too late. I an say the last 3 episodes have incredible pace for only being 33~ minutes of show time. The story had to be probably the best aspect for the series, personally I'd put it around 8.8/10.\\n\\n\r\nTo close I just want to mention how the characters were handled and overall enjoyment of the series. Introduction of each character was done pretty good, based on the role said character would play. But with a short story kind of series, there was no character background. Did we need it? No. But for a development stand point, minimal. Except in the case of Matsumaru and Aka. You had them develop a very cute romance, you had the two learn about each other and you had them grow to love each other. All in all Rec was a great series, just something to put on if you want to unwind and relax with a cute little series. I personally think Shaft did a good job bringing this story out.",
            "date": "2016-08-25T19:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 227614,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4895859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Namiku",
                "username": "Namiku"
            },
            "url": "https://myanimelist.net/reviews.php?id=227614"
        },
        {
            "content": "I first stumbled on this anime when I was looking through a list of anime that had already been completely aired, and therefore found REC, I looked at the brief summary which said \"A romantic comedy about a boy and a girl, one who is a marketer and the other a voice actor, due to a tragic iccident the girl had to stay with the boy at his apartment, as each day passed they began to develop a relationship.\" \r\nThis brief summary caught my attention, and therefore I decided to spare it some of my time, since they were only 12 minutes long, excluding theintro it was 10 minutes long.\\n\\n\r\nWhat suprised me was how well structured it was, because it was only 10 minutes per episode and only 9 episodes all together. so in 90 minutes, there was a decent introduction to the characters, and then a good 8 episodes filled with development of all the characters and their feelings, it shows how each one gains confidence and how they begin to find themselves reliant on each other, how the guy grows to need her to be by his side, to live with him.\\n\\n\r\nThough there is all these feelings, it is expressed through a series of well placed comedy acts. \\n\\n\r\nTo me it was a 1 and a half hour well spent.\\n\\n\r\nBecause the emotions in the voice acting, was there, and it made me feel good hearing it.\\n\\n\r\nSo yes I would recommend this to any one no matter what you prefer to watch.",
            "date": "2009-08-12T13:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 17701,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shintai88",
                "username": "shintai88"
            },
            "url": "https://myanimelist.net/reviews.php?id=17701"
        },
        {
            "content": "Talk about one hell of a breath of fresh air! Rec is a surprisingly good romance anime between TWO ACTUAL ADULTS!\r\nRec is a really short, but sweet adaptation of a manga by the same name. At a measly 9 half-length episodes, Rec was able to firmly stand next to the likes of Toradora by being so different then whatns typical of anime romance.\r\nNow when it comes to those differences, they are actually rather simple. Instead of teenagers in highschool whose entire lives seem to somehow revolve around their romantic relationship, we have two adults leading adult lives working two adult jobs. Did I mention theywere adults??\\n\\n\r\nThe story of Rec is about the two characters, Aka Onda and Fumiko Matsumaru realizing their feelings for eachother as their two careers become intertwined. However the romance never suffocates you, nor does it suffocate the characters, as their lives don't center around it. They met through such a sweet twist of fate, but they come together somewhat because of their jobs, not just because they met one night.\\n\\n\r\nWhen it comes to characters, obviously the ones that matter most Aka and Fumiko, and hey get as much screentime as possible. There are supporting characters, but their purpsoe is to make the world feel larger than just two people, and show that our two leads have social lives outside of eachother as well.\\n\\n\r\nAka Onda is easily the best thing about this show. She is proof that an anime girl doesn't need to be in highschool to be unbelievably cute. Rec may have 9 episodes, but it's qute dense. Not only is there the romance stuff, but also a story about an aspiring seiyuu tryin to make it big. Aka's dream is to be a successful voice actress, and for 9 episodes, she gets fleshed out pretty well.\\n\\n\r\nFumiko, the dude, is a slightly down-on-his-luck salaryman just trying to get by and get an approved proposal. His story is also a compelling one, but understandably less than Aka's. Maybe for japanese salarymen, but not for me. Relatability isn't really the point though. Fumiko was still an interesting guy.\\n\\n\r\nLike I mentioned, Shaft made this series. And boy does it show. Rec is a pretty old Shaft series (2004), so I couldn't find it in HD. But 480p is still good enough. Rec has pretty interesting color design and has a very cozy and warm feel to it. Obviously no sakuga to be found here, but Rec keeps things simple, and that's a good thing in this show.\\n\\n\r\nOverall, Rec was a very refreshing series. It's not incredibly unique or anything, however the cute and cozy presentation, the notably mature characters, and the short runtime make this a VERY worthwhile romance anime. If you want more, I recommend reading the manga, it's pretty good, but not as dense as the anime.\\n\\n\\n\r\nI give Rec an easy and well deserved 9 out of 10. \\n\r\nSnuggle up and watch it on a cold night like I did, it really fits the mood.",
            "date": "2017-07-30T01:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 254208,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5336817.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FalseShepherd13",
                "username": "FalseShepherd13"
            },
            "url": "https://myanimelist.net/reviews.php?id=254208"
        },
        {
            "content": "Rec is one of the shortest romance anime I have ever watched. This anime is more suited for adults as the relationship that develops is between two people in their mid-twenties.\r\nStory: 7/10\r\nRec is about a guy named Fumihiko Matsumaru, a 26 year old man that works in the sales branch of a snack company. One day, he is stood up by the woman who he fell for. As he is about to throw away his tickets to the movie, he meets Aka Onda who is a voice actor in training. She tells him not to waste the tickets and ends up watching the movie withhim. Later that night, Aka's house burns down, traumatizing her. Matsumaru, offers to let Aka sleep over at his condo. This anime is about the daily problems of this pessimistic salesman and rambunctious voice actor. A slice of life, drama, rom com that is most likely to please those of an older audience.\\n\\n\r\nArt: 6/10\\n\r\nThis is an anime with a slightly older art style that isn't too good or too bad. Nothing too special, either.\\n\\n\r\nSound: 6/10\\n\r\nThe music really isn't nothing special. I honestly didn't notice it at all. The voice acting is pretty good, though. The roles for these characters seemed very difficult to voice, and I commend the voice actors for that.\\n\\n\r\nCharacter: 7/10\\n\r\nThe characters are a bit dynamic but there isn't much character development as there is only 9 episodes.\\n\\n\r\nEnjoyment: 7/10\\n\r\nThis is a very light-hearted rom com targeted towards adults. It covers more mature content so I wouldn't recommend this for younger audiences.\\n",
            "date": "2016-09-06T18:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 228470,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5252917.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hana5963",
                "username": "hana5963"
            },
            "url": "https://myanimelist.net/reviews.php?id=228470"
        },
        {
            "content": "Ima keep this review concise and nice just like this anime,\r\nthis anime accomplishes what most romance animes fail to do by the end of their series. At least most of them, and what I mean is that most romance animes don't give you the feeling of romance or a relationship, the hardships that come with a relationship, the feeling of being reunited after that setback, or the confusion that goes on in your head during that time.\r\nThese are all important aspects that can be used in romance animes. But in most romance animes, they instead have either fan service, the protagonist being thick headed, orthe girl/guy not progressing their intent of letting the other person know they like them. Basically, the plot never gets developed, and if it does, it happens very slowly and by the end of the anime you might get a confession or a kiss IF you're lucky.\\n\\n\r\nWhich is what I love about this show, they actually manage to delve into the hardships of relationships and bring out enough character and plot development in only 9 freakin episodes!!! (Each episode only comprising of 10 minutes). It shows a lot of realistic scenarios that can be seen in actual relationships, and manages to pick up the pace which is refreshing compared to other anime romance shows. Not to mention the fact that neither character sticks to a character troupe, but like as if they're actually people, like thinking \"oh, what should i do?? ><\" I just realized that sounds like a tsundere but I promise you in this scenario it's different.\\n\\n\r\nNow admittedly, it's tiny amount of episodes is also sort of its own downfall (when you think about it it's only really 4 and a half episodes), as it doesn't give you as much build up as other shows. But it's a paradox, because for that same reason, that's what makes the show great, as it shows us you don't need 24 full length freakin episodes to bring out the subtle details of romance. It manages to make a fast paced show without making it feel too rushed, just perfect in my opinion honestly. \\n\\n\r\nOther downfalls is that sometimes the voice acting felt a little flat, and the sound was over used a little bit (as in not having a diverse pool of music to choose from), but this could be just due to budget. Despite that, they were still able to make due, but whether it was due to budget or simple laziness, it still gets marked down from a 9 to an 8. Honestly, it's such a short show, if you like romances there's no reason not to get into this.\\n\\n\r\nSo with all in mind: being able to show the nuances of a relationship in such a short amount of time, giving you a satisfying and fulfilled ending, actual people instead of character troupes, this anime in my opinion easily gives you an 8.",
            "date": "2016-03-28T05:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 214512,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3161881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietPsycho",
                "username": "SovietPsycho"
            },
            "url": "https://myanimelist.net/reviews.php?id=214512"
        },
        {
            "content": "I'm a sucker for big age-gap animes so I came across Rec, a magnificent anime I never would've known it was. I researched about its plot and all, and considered it to be something I would really enjoy. After I saw the characters, I felt my hopes go down a bit, since it's a typical kind of anime style: with moe and all that crap. Although I only focused my attention on the girl and her moeness, and my negativity took over, this didn't hinder me from watching it. And I'm glad to have done that. Rec was such a great anime. \r\nIt wasn't thatbig of a deal, but that's what makes it great. It's such a laid-back, and something that you would watch with your best friend or your significant other. \\n\\n\r\nIt kind of lacked something, which was the soundtrack. For me, the soundtrack always played a big role in animes. Though I liked the mini opening, it just wasn't enought to satisfy me.\\n\\n\r\nWhen I watched this anime, I felt that breezy feeling of nostalgia. Like trees are swaying, birds were chirping, and laughter from all the people can be audible: that's the feeling I got from Rec. Totally would RECommend. (Ayy??)",
            "date": "2015-06-01T04:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 189329,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4649031.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/araphernalia",
                "username": "araphernalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=189329"
        },
        {
            "content": "This series, while certainly cute an romantic, gets a lower score because at times it shows a totally disturbing view in the what might just be a cultural difference in relationships. The series is only 9 episodes (10 including the special) at 12 minutes each, and the relationship between Matsutaka and Aka seems somewhat  schizophrenic.\r\nSometimes he is very kind and understanding towards Aka, and sometimes he is disturbingly sexually aggressive. Maybe in Japan that is to be expected since he is much older than her and they live together, but the lesson seems to be that Aka is wrong for not wanting to havesex with  him. Maybe I'm being picky, and there are certainly people who like anime where the male is very assertive and dominant, but to me the way Aka is treated is somewhat abusive. He blows up at her for no reason, and even though he's very nasty to her she forgives him (even though he doesn't technically apologize). Some might say this is love, but as a person currently in a loving relationship knows it's more naiveté than anything else. This aspect of the anime is too distracting for me to enjoy it properly.\\n\\n\r\nIf you like romantic anime, this is an OK choice. It's pretty quick and has some very cute moments.",
            "date": "2010-07-12T09:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 28303,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165574.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nintendoll",
                "username": "Nintendoll"
            },
            "url": "https://myanimelist.net/reviews.php?id=28303"
        }
    ],
    [
        {
            "content": "REC only spans ten episodes (counting the DVD special) and those episodes aren't even full-length, yet it manages to be more heartwarming and entertaining than many longer series. It isn't groundbreaking at all, but if you don't hate predictable romance anime, it is a perfect way to cheer you up when you're feeling a little down.\r\nOnda Aka is a rookie voice actress who one day encounters the salary man Matsumaru Fumihiko, who's been stood up by his date, in front of the cinema. Long story short, Aka makes Matsumaru watch the movie together with her and the flames of love are ignited. Later the samenight, Aka's apartment catches fire and she is taken in by Matsumaru. Romantic events ensue, but when waking up the next day, neither of them regards themselves as a real couple. Incidentally, they end up working together with the marketing of Matsumaru's latest invention: a leaf-shaped crisp. Aka is - of course - voicing the product's mascot, Neko-ki - a tree with a cat's head. \\n\\n\r\nThe focal point of the story is, not surprisingly, the development of the two main characters' relationship and how it is affected by Aka's rise in popularity; is it right for her to prioritize her career even though it leads to her not being able to spend time with Matsumaru? Though the story is far from original, I still really cared about Aka and Matsumaru. Because REC is, unlike most other anime belonging in this genre, not full of unnecessary melodrama or supernatural elements - it is realistic, and that makes it so much more engaging. \\n\\n\r\nAnimation studio SHAFT, of Sayonara Zetsubou Sensei and ef - a tale of memories fame, is responsible for the animation. REC's visuals don't impress at all, but they suffice; Aka is heart-wrenchingly cute and Matsumaru is... well... ordinary. Backgrounds and the like are good as well. \\n\\n\r\nThe seiyuu (voice actors) did a great job with all the characters, including the minor ones, enhancing the warm atmosphere of the anime greatly. Music was always fitting though far from memorable. The opening wasn't my cup of tea, but, then again, I couldn't care less. \\n\\n\r\nTo summarize, REC isn't the most innovative romance anime around, but it's realistic approach to the genre makes it refreshing and the chemistry between the characters (who are the series' greatest strength) is wonderful and Aka and Matsumaru's feelings toward each other feel genuine. I would not have complained had it been longer, but it's shortness may also be a strength; it never got even close to boring, even though I watched it all in one sitting. \\n\\n\r\nA highly recommended anime to all romance fans.",
            "date": "2008-09-27T14:41:00+00:00",
            "helpful_count": 142,
            "mal_id": 8213,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24106.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tenchio",
                "username": "Tenchio"
            },
            "url": "https://myanimelist.net/reviews.php?id=8213"
        },
        {
            "content": "REC,\r\nStory:\r\n     REC, incorporates real life problems with a warm feel. This story is basically life, while trying to understand your feelings with a cute spin here and there, but serious when it needs to be. \r\nArt:\r\n     Art is good, borderline amazing.\r\nSound:\r\n     Soundtrack is good, character voices were cute, well portraying of the characters.\r\nCharacter:\r\n     Character development is great, you end up liking the characters and somewhat can relate to their problems as time goes on. \r\nWhy did I like this anime?\r\n     It was pretty damn cute,life problems mixed in with a 'I love you, but wait do I really?' type of feel. It relates to life problems and is somewhat humorous and serious when needed. Very good anime, feeling of satisfaction I must say.",
            "date": "2007-08-12T02:21:00+00:00",
            "helpful_count": 64,
            "mal_id": 686,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dnt",
                "username": "dnt"
            },
            "url": "https://myanimelist.net/reviews.php?id=686"
        },
        {
            "content": "Well, I watched REC, and I think that it was quite a good storyline, for a short series! 9 episodes, spanning 12 minutes each. It&rsquo;s a shame there wasn&rsquo;t more.\r\nBut hey, onto 1st my review!\r\nI&rsquo;ll split this into 5 secions, rating each section, then give an overall x/10 rating!\r\nStory 8/10\r\nI enjoyed the story, some good twists in it, and it was good &rsquo;slice of life&rsquo;, in my opinion. I wish that there was more anime for this series. It was a good start to the series, and the ending was quite good also, a little more wouldn&rsquo;t have gone a miss though!\r\nAnimation 9/10\r\nI like theanimation, there were some really good bits, some weren&rsquo;t that great, but it did the job! I think that most of it borderlines on amazing, but after recently seeing the AIR movie, I&rsquo;m not sure anything&rsquo;s going to beat that!\\n\\n\r\nSound 7/10\\n\\n\r\nThe voices fit the characters, I think. I think that they were good at the roles, and nothing was out of place&hellip; Well, nothing except the &lsquo;REC&rsquo; bits, that randomly appear throughout the episodes&hellip; There are some strange noises &gt;,&lt;&hellip; Never mind though.\\n\\n\r\nCharacter 8/10\\n\\n\r\nI enjoyed the development of the characters in this series, however short lived it was. You got minimal detail about the history of the characters, learned what they wanted, or what their dreams were, and then followed Aka as she fulfilled hers. Mind you, Matsumaru had his fair share of achievements!\\n\\n\r\nEnjoyment 9/10\\n\\n\r\nOverall, I really enjoyed this anime, even when it was so short. I mean, short series&rsquo; are okay, but sometimes I think the longer, the better. This one proves that theory wrong!\\n\\n\r\nMy overall rating&hellip;\\n\\n\r\nDrumroll, please!\\n\\n\r\n8/10\\n\\n\r\n*Off topic*\\n\\n\r\nHaha, I was reading about this anime on other sites, and I found out that, liek a lot of other anime, there is a manga for it, so I&rsquo;ll be off to buy that one when I get paid! xD\\n\r\nBut then, considering the Manga is, if I am correct, still being written, maybe they will go ahead and make more anime from it?\\n\\n\r\nThat is all!",
            "date": "2008-01-22T08:07:00+00:00",
            "helpful_count": 38,
            "mal_id": 2096,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/26112.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kyte",
                "username": "Kyte"
            },
            "url": "https://myanimelist.net/reviews.php?id=2096"
        },
        {
            "content": "There is nothing quite like sitting down to a nice down-to-earth anime. Sometimes those are are hard to find, yet here we are with Rec. It is the story about a guy and girl living under the same roof. Seems kind of cliche, until it actually gives a legit reason: her house burned down (sorry I saw the title and the burning house and immediately thought of mix tapes, I'm so ashamed). I know the length of the episodes seems intimidating, but it was not bad at all. I applaud the series for actually giving us something to enjoy while putting it in half thetime frame of most other series. Now, lets dig into this...\\n\\n\r\nStory-7\\n\r\n Short, yet effective, those are the best words to summarize this. We have our guy, Matsumaru, waiting outside a movie theater. Why, you may ask? He got dumped. By a woman whom most viewers will probably dislike. He then meets a 20 year old girl named Ako, and will precede to find solace in getting plastered with her. They will then walk home and everything will be over. Or so they thought. Sucks when your house burns down. So that's how we come to them living together. He works for a candy company and comes up with ideas for them to use. She is a novice voice actress. Throughout this series they have to deal with success while also balancing the feelings they start to have for each other. That's it. It's a nice, simple story to unwind to after a stressful day. It is not a bad story riddled by plot holes, nor is it an absolute masterpiece. It is just a refreshing look into the real world of business.\\n\\n\r\nArt- 7\\n\r\nThe art is average. It is along the same lines as the story, refreshing, yet not stunning. It uses mildly dull colors so it's not going to vomit rainbows in your face. The leading girl looks quite cute, and this series emphasized that. The guy was pretty standard for an anime protagonist. Overall I gave the art a decent score because I thought the art was fitting to what the series was aiming for.\\n\\n\r\nSound- 6\\n\r\nThe weakest aspect. Not much to say here. There was no op or ed. You have background music and sound effects when the title roles on screen. Although those could be humorous at times. Really there was nothing bad about any of it as far as I could tell. It did what it had to do and didn't leap over mountains to give us auditory pleasure.\\n\\n\r\nCharacter- 9\\n\r\nThis I thought was great. For such a short series they really managed to capture the people we really care about. The male protagonist is just a man trying to rise up in the business world. The leading heroine is just a female voice actress trying to accomplish her dream. Throughout this series we get to see them both succeed and fail, and what it does to them afterward. We have all had times where we failed at something and took it out on others, that's where our male protagonist has trouble. We have all had moments where we had to do things we didn't want to do for our benefit, and that's where our heroine had trouble. It was pleasing to see such relatable problems on anime characters, and the series did a great job at portraying them. The rest of the characters are there to act as foils for the relationship of the two. We have Ako's manager who is strict, yet understanding. We have  Matsumaru's co-worker who tries to cheer him up and let us know he is not a complete loner at work. And we have the woman who stood him up, who acts as an inciter of jealousy in Ako. In the end, she helps us realize the depth to which Ako cares for Matsumaru. Only problem I have is that Ako is all touchy-feely with Matsumaru in the beginning but then flat out denies they're together for most of the series. We know better, right?\\n\\n\r\nEnjoyment-9\\n\r\nA fantastic little series I thought. I happen to love romance anime and this is one that would be a disappointment to miss. I enjoyed the down to earth setting, story, and characters. They were a good break from witches, warlocks, super power lolies, and everything else anime sometimes throws at us.\\n\\n\r\nOverall-8\\n\r\nA cute little series. If you are into romance with the occasional hint of comedy and drama, this is one anime you will most certainly not regret.",
            "date": "2015-04-07T17:04:00+00:00",
            "helpful_count": 30,
            "mal_id": 185092,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4172341.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/OmegaPhoenix",
                "username": "OmegaPhoenix"
            },
            "url": "https://myanimelist.net/reviews.php?id=185092"
        },
        {
            "content": "What is a better day to post a review for Rec than Hollywood actress Audrey Hepburn’s 85th birthday? Audrey Hepburn was a huge inspiration for the show’s aspiring voice actress Aka, and the show embraced her movie titles and movie quotes in each episode.\r\nI warn you that you may not like this show if you’re expecting a steamy hot romance. It's more about the development of a romance. Some people who watched Rec, including me, rated it with a very low score, because it’s incredibly boring at first viewing. However, Rec is different from most other romance anime and not as cliché. It reflects onreality by displaying the disappointment and challenges of balancing a professional life with a private life. Rec revolves around an aspiring voice actress (Aka) and a marketer (Matsu) dealing with the struggles and pressure of work. One problem I had was that their relationship happened quite fast with Aka moving into Matsu’s place the same day they met, because her place burned down without any given reason. On a positive note, Rec goes behind the scenes of the media industry and excitingly shows the transition of a popular seiyuu, including the advertisement and work inside the studio.\\n\\n\r\nThere are a few problems I had with the characters. If it were not for the revelation of Aka’s age (20 years) and scenes of her drinking beer, this show would seriously appear as a lolicon. She literally looks and sounds like a little girl, while Matsu looks like an old man despite being 26. Matsu can honestly get pretty annoying. He is a loner who is desperate for a girlfriend and relieved when Aka walks into his life. This causes him to act perverted at times, and it may be entertaining and funny for someone who enjoys anime where a guy constantly experiences rejection. I honestly didn’t like it. Apart from that, Aka and Matsu are strong as a pair. They show support and feelings for each other as they work together in their career. The supporting characters contribute to the pair’s relationship by revealing life’s disappointments and giving advice that has an impact on them. They also participate in each of their careers and show how the media industry works in Japan.\\n\\n\r\nThe artwork looks old as if it’s from the 1990s instead of the 2000s. It resembles something out of a childrens’ book. The colors are bland. The backgrounds are plainly drawn, and the only activity are from the main characters. The rest of the society is still. The character design was average. The females were the only attractive characters in the show, and the males could not nearly compare. The settings, including recording studios, are drawn realistically as it suits the atmosphere of voice actors and advertisers.\\n\\n\r\nThe OP, sung by Kanako Sanai (voice of Aka), is pretty good, but it could be unattractive to others. The truth is the lyrics of the OP describes the show perfectly: “Don’t give up/Embrace all of your worries.” Not only does it describe their relationship, but it says not to let life get you down at the worst of times.  The seiyuu expressed appropriate emotions for situations, including jealousy and excitement. The background music and sound effects fit the atmosphere well.\\n\\n\r\nRec is an anime that you’ll have to rewatch with a different mindset if you did not enjoy it the first time. Honestly, the few people that scored Rec below a 7 were bored out of their minds just like I was. I planned to drop it during my first viewing, but it didn’t make sense for me to drop an anime that only has nine 12-minute episodes. I couldn’t stand the anime, and the OP was completely annoying at first. After rewatching it, I actually enjoy it more than other romance anime, and the OP is one of my favorites. As I mentioned earlier, this is the most realistic romance anime out there as it features the complications of relationships because of busy careers, which is the primary reason why my score changed from a 6 to a 9.",
            "date": "2014-05-04T20:39:00+00:00",
            "helpful_count": 28,
            "mal_id": 142365,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2826241.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Demi_V",
                "username": "Demi_V"
            },
            "url": "https://myanimelist.net/reviews.php?id=142365"
        },
        {
            "content": "Cute. Wish there were more. The character's were beautifully written, as was the plot. The relationship between the two main characers were perfect, as they explored the growth their personal and work lives. \r\nThe female Onda, Aka played the cute, happy, but vulnerable role quite well. At times you really wanted to strangle Matsumaru, Fumihiko ; who appears to be more crass than other sensitive male leading roles.\r\nPerhaps it is truthfulness like this which mirrors real life; that adds to the beauty of this series. Now I\"ll have to look to see if there are any Manga out for this.\r\n(PS there is and it isongoing. The anime touches volume one and they are currently into Volume 5)\\n\\n\r\nEnjoy.",
            "date": "2007-09-07T23:33:00+00:00",
            "helpful_count": 25,
            "mal_id": 815,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12510.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/purplegold",
                "username": "purplegold"
            },
            "url": "https://myanimelist.net/reviews.php?id=815"
        },
        {
            "content": "Rec is a romantic comedy about an aspiring voice actress. The manga was written by Hanamizawa Q-Tarou in 2002 and is still ongoing. In 2006 it got a nine episode anime adaptation. I've never read the manga, but how does a long running series translate into nine twelve minute episodes? Let's take a look at Rec and find out.\r\nThe plot is very simple. A guy, Matsumaru, gets stood up for a movie date. As he's about to throw the tickets away he's approached by a girl, Aka, who tells him not to waste them. They go to the movies and then drinking together. After theypart ways her apartment burns down and she doesn't have any family or friends whatsoever so she ends up moving in with Matsumaru, how very convenient. Actually, convenient is the wrong word, contrived would be more accurate. The series is about her and Matsumaru living together and trying to keep their connection a secret for no adequately explained reason. It's every bit as stupid as it sounds. Does the comedy work? No, there are no funny moments in Rec, not one. Just the contrived romance.\\n\\n\r\nThe characters don't help matters. Aka and Matsumaru have no chemistry which makes the romance aspect just seem even more forced. They're also complete morons, as are all of the minor characters. Which makes them just annoying to watch.\\n\\n\r\nThe art is the best part of the series. It's pretty well done with some good details. There are some moments where the sound is out of sync with the characters' mouths but that isn't a major issue. \\n\\n\r\nThe voice acting isn't bad. It's not anything spectacular or with any stand out performances but it's decent. The actors probably could've done better if they'd had decent dialogue. The music isn't bad but it's not good either. It's pretty forgettable. \\n\\n\r\nThe yuri factor is a 1/10. There is no yuri in this. \\n\\n\r\nMy final rating for Rec is a 2/10. It's a terrible anime. The decent art and average voice acting can't make up for the terrible story, failed humour or moronic characters.",
            "date": "2012-06-06T08:29:00+00:00",
            "helpful_count": 17,
            "mal_id": 62789,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=62789"
        },
        {
            "content": "Story:\r\nThe story of this anime is really unique... love between a seiyu and a business man (how messy can that be? LOL)\r\nEhem... well the series did a really GOOD JOB on making series,  from what ive seen the series made me fall in love again! (most of my friends seconded on this one)\r\nArt:\r\nOne of the series that really has amazing art... the theme look different when its sunrise (the shiny white theme were amazing)... and good artworks were viewed at ending (which really makes me watch more LOL)\r\nSound:\r\nOpening was great... i was like \"WOW that was really cute\" every time the aka says Uwwww...in the opening theme song XD BGM music was also good cause they seem to fit in the series also...\\n\\n\r\nEnjoyment:\\n\r\nI was shaking while watching this one (oh... pure enjoyment)... it is really a heart warming series for everyone! Uber cuteness + Stupid love = OWNAGE!\\n\\n\r\nOverall:\\n\r\ni told myself after watching this anime &quot;that was great i want more&quot; then after some time i find myself reading REC manga... so this series is really a TOP PRIORITY for everyone\\n\r\n~Watch and be amaze~",
            "date": "2007-11-11T06:33:00+00:00",
            "helpful_count": 14,
            "mal_id": 1273,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20913.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jansuke",
                "username": "jansuke"
            },
            "url": "https://myanimelist.net/reviews.php?id=1273"
        },
        {
            "content": "To be honest, I wasn't expecting much from this anime. The reason why I decided to watch it is just because it's from Shaft, thus I thought the artwork would be great with the unique Shaft style. My thoughts was wrong. (If you're not familiar with the word Shaft, it's an anime studio responsible for the unique artwork, gag, and cinematography of Bakemonogatari, Madoka Shoujo Madoka Magica, Nisekoi and much more)\r\nThe story is about an office guy, a salary man(Japanese white collar businessman) to be precise, who is living with a girl who dreamt on becoming a voice actress. Although living together and already did'something', the both of them doesn't consider themselves having a 'that' sort of relationship . They also kept their living-together a secret from the others because they thought that it would affect their career.\\n\\n\r\nThe pacing is a bit fast, well, maybe too rushed due to the fact that it's only 12 minutes per episode. There's nothing unique and complex about the story. It's quite predictable too. There are so many complications for both of the characters throughout the story. When the girl has a problem with her career, the guy takes care of it, and vice versa. What makes it 'not good' is that some of it seems to be trivial but considered a big deal, and.... the other, which seems to be a really big deal, is taken lightly. Despite of that, the ending is really satisfying.\\n\\n\r\nOkay, so now let's talk about the artwork. Coming from Shaft........ It's horrible. It really looks like something coming out of the 90s. Compared to the other Shaft creation and anime(s) from 2006, it's really poor made. Seriously, it's not the quality of the video I have that makes it look bad, it's the anime itself.\\n\\n\r\nCharacters. We have the main guy, Matsumaru Fumihiko, and the main girl, Onda Aka. Matsumaru is an average guy working as an average white-collar in a not-so average company. But hey, he's got himself a pretty average face. He likes to tease Onda and even 'tried' to seduce her sometimes, and get's rejected 'almost' every time. On the other hand Onda is an energetic girl who likes to imitate a certain voice actress. She really care about Matsumaru, but she doesn't consider themselves as partners for some reasons. \\n\\n\r\nGoing through a lot of obstacle, their feelings seems to grow after each one. The development is really fast at the start, then it goes constant average throughout the rest. Though it's good overall. The side characters aren't that bad either.\\n\\n\r\nSo, if you ask did I actually enjoyed this 12-minutes/ep anime? I pretty much did, despite the not-enjoyable artwork it has. But then again, the story, characters, developments are -imo- pretty decent. For a rom-com though, I don't really laugh that much. I actually didn't laugh at all. Jokes are too.... you know... how to say it... predictable i think. (i couldn't find an adjective for it.)\\n\\n\r\nOverall, 'Rec' or レック is decent rom-com anime that didn't surpass the average status. It has some good points, but also some major flaws. I don't really recommend this anime, but if you like rom-coms and would like to watch anything of the sort, just try giving it a shot. It isn't a full episode anime and only has 9 episodes anyway.\\n\\n\r\n-Btw, after watching the first episode, I literally said \"Well, that escalated quickly.\" \\n\\n\\n\\n",
            "date": "2014-04-04T04:27:00+00:00",
            "helpful_count": 12,
            "mal_id": 138585,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3457557.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BadabumBadabicch",
                "username": "BadabumBadabicch"
            },
            "url": "https://myanimelist.net/reviews.php?id=138585"
        },
        {
            "content": "Rec is an anime I did not have high hopes for, I figured since it was so short, it would be super rushed and not have a lot of backstory, although it was somewhat rushed at the beginning, I feel the progression worked very well. There are 10 episodes in total that are about 12 mins each, I enjoyed the length of this anime because it was short and to the point, and quite heartwarming. Definitely a must watch for you Romance lovers out there.\r\nThis story begins with Matsumaru waiting for his date at the movie theater, however, his date is a no-show, just whenhe is about to give up on his date and throw away the tickets, Aka comes in to save the day! So they go to watch the movie together. Later on, a huge fire occurs, and her place is burned down, this is where Matsumaru comes in to save the day, he offers for her to stay at his place, and this my friends, is where the story begins.\\n\\n\r\nStory 8/10\\n\r\nEven though the anime was fairly short with only 10 episodes that were 12 minutes each, it was a nice progression of the romance between the two. They were able to depict the working situation of both Aka and Matsumaru, and how they played a role in them becoming closer. The romance slowly starts to grow as they are living and working together, and of course, comes conflicts that they must overcome together. I also liked the fact I had not seen many anime with this type of story. The character following their dreams of becoming a voice actor, while also finding that special someone.\\n\\n\r\nArt 6/10\\n\r\nThe art was not anything special, but that is to be expected from a short anime from 2006. They did do a pretty good job on the main character designs, but the background details at times did have some lacking attributes, but as I said, it is a short anime.\\n\\n\r\nSound 7/10\\n\r\nThe sounds were not really all that important in this anime, so they were alright, nothing great, nothing bad. The voice acting was done pretty well, Aka's voice actor matched perfect.\\n\\n\r\nCharacter 7/10\\n\r\nThey did not go into the past of either of the two, such as family or schools or anything, but they did a good job of portraying their feelings about situations, and also their goals in life. The supporting characters did not get much at all, but being that the anime is so short, that's understandable.\\n\\n\r\nEnjoyment 9/10\\n\r\nI really enjoyed this anime. The shortness was something I actually enjoyed, it allowed me to see how they progressed romantically without wasting time on pointless side-story as in some anime. It was a really nice romance between the two, and to see it all come together was a real treat.\\n\\n\r\nOverall 8/10\\n\r\nThe reason for this 8 is the pure enjoyment I had seeing the romance in this anime. The story was great, I liked how they showed what the both of them went through in their work lives, and how that played a part in their romance, and vise versa. I would recommend this to anyone who is a fan of romance, and who doesn't mind it being short and sweet.",
            "date": "2014-03-17T08:36:00+00:00",
            "helpful_count": 12,
            "mal_id": 135943,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3535449.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Scragleton",
                "username": "Scragleton"
            },
            "url": "https://myanimelist.net/reviews.php?id=135943"
        },
        {
            "content": "Rec is a short series that captivates the heart despite its nine 12-minute episodes. It does this by being centered on the conflict between our two protagonists. This conflict being whether or not they can continue living together since their professions are closely tied and foul rumors may spread among employees. I won't into too much depth about their conflict since it is what kept me interested in the series and what I highly recommend you pay close attention to should you watch this.\r\nStory: 9\r\nThe story can best be described as a rom-com without the com but that isn't to say that the story isn'tfunny. What I hope to convey through this metaphor is that the series focuses on the two central characters and their interactions. \\n\\n\r\nIf you are unsure about watching this show, watch the first 2 episodes first (Duration wise, it's like watching the first episode of a regular anime).\\n\r\nThe first two episodes present the complications of their relationship and why their living situation could become a dilemma. These first two episodes are what made me forget about the rating on MAL and conditioned me to really pay attention to what was happening in the show.\\n\\n\r\nEpisodes three-eight solidly build on their relationship and how that could bring negative reception from their employers. They do a great job of building up tension and investment for the characters.\\n\\n\r\nThe last episode is a sweet ending, nothing more to be said.\\n\\n\r\nArt: 7\\n\r\nI have much less to say about this topic. It's a 2006 anime, you shouldn't expect high quality artistic talent on a project like this. Compared to other shows I've seen from this time period, it's definitely middlingly average. Most of the characters' faces or designs aren't really memorable except for Onda. \\n\\n\r\nSound: 9\\n\r\nThe voice acting is nice, nothing sounds off-mood or breaks the tone of the show. Onda especially shows change with her voice as she progresses through her career and it was very heartwarming to watch. The opening is cute but the lyrics sung, oh man, those give you a vague idea of what's to come and they powerful. I won't analyze the entire opening as that would require a video and a lot of editing, but I will tell you that reading the lyrics every time you start the episode will get you the full experience of sadness and happiness that made me cry.\\n\\n\r\nCharacter: 10\\n\r\nWhile not too many are present in this anime, the main ones are very well developed and carry much emotional investment by the end of the series. Onda is a young eccentric girl who is a rising voice actor. The conflict between her rise to fame and her relationship with Matsumaru make for a tear-jerking viewijng experience. Matsumaru is an older man who has largely given up on finding a better life and tries to make the best of the situation. The conflict between his relationship with Onka and what he believes she wants also make for an emotional adventure that is sure to invoke feelings inside of you as well. \\n\\n\r\nEnjoyment: 10\\n\r\nOnda is adorable and and worthy of one of your 10 favorite character spots. That aside, what I really enjoyed about this show was the ending. As they are adults in the workforce, they act like adults in the workforce and there is no hiding or confusion of feelings. They speak what they believe and they answer truthfully. Nothing more can be said without spoiling the show.\\n\\n\r\nOverall: 9\\n\r\nRec is a great show for any lover of the romance genre, the emotional payoff heartwarming and it explores obstacles that are non-existent in High School anime. If you feel the need to spend time on anime, I advise you to watch this. It's short, sweet, and will make your heart cry.",
            "date": "2018-12-08T15:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 295461,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6721069.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KnicePerson",
                "username": "KnicePerson"
            },
            "url": "https://myanimelist.net/reviews.php?id=295461"
        },
        {
            "content": "wow............. this anime in my opinion is amazing but on to the review.\r\n  So the story is (if you read its summary) about a loser guy is lucky enough to get a cute voice actress to stay at his place because her house was burnt down which they don't give us a reason of why the fuck it was but anyways they just fast paced episode 1 to get on with the good stuff which guys I recommend watching cause its very dramatic in a sense that you would feel tears coming up when you see how the ups and down these two charactershave in their everyday lives with huge fights between a none but almost a couple and hurtful scenes which makes you wanna slap a character at times.\\n\\n\r\n  The art is brilliant overall its one that is enough to be popular but despite that its a very old style of drawing the mature girls eyes kinda big but big enough to give her the effect of putting on that extra sorrow when she sad. The colors of this anime is very simple if I must add they aren't really that contrast to look like the ones made in 2008 and above that are very clean and smooth and the colors shine brightly but this anime puts enough to give you the special eye shower of color.\\n\\n\r\n  characters are all well developed other than the fact the episodes were to short to even get deeper into each of the characters back round story but that's not the main focus that they were trying to portray. they were trying to tell people how life was like between to people with to jobs that seemed kinda distant. but overall the characters were well done and easy to understand and get how they played their role with each of the their kind of personalities in the story.\\n\\n\r\n  I really enjoyed this anime and because of the heart tugging and tear jerking feeling I had throughout the anime (that I don't feel that often in some romantic or sad stories which are horribly done) I would give this both a 10 for my enjoyment and overall. It was fun watching how both comedy and serous love and drama were balanced out and it gave a sense of reality for the characters to endure throughout living together. (spoiler alert) I mean of course your ganna have troubles with your jobs that you take it out on your girlfriend right.\\n\\n\r\n  thanks for reading and let me know if you have any questions on my page see ya ^_^",
            "date": "2013-11-27T13:53:00+00:00",
            "helpful_count": 9,
            "mal_id": 121601,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3353733.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ataraxia-9",
                "username": "Ataraxia-9"
            },
            "url": "https://myanimelist.net/reviews.php?id=121601"
        },
        {
            "content": "Audrey Hepburn would turn around in her grave if she knew what work her name was attached to.\r\nStory:\r\nOn the surface, Rec leads us to believe that we bear witness to the blooming of a young love and a boy and a girl overcoming the many obstacles in their way to be together. In reality, what we get to see is the formation of an abusive relationship that is presented as the ideal romance. I’m at loss for words how disgusting this is. Apparently, the author is either an utterly broken victim of this in real life, or (more likely) a terrible human being that youshould stay as far away from as possible. In their sick, twisted mind, it is heartwarming to guilt-trip somebody into a relationship and take advantage of a helpless individual. This is wrong on so many levels, that I would like to erase it from my memory, or better yet, from existence. Do you think I’m joking? Take a closer look, it’s not hard to see. Aka has no reason to like Matsumaru, but she feels indebted to him, that’s why she swallows all the abuse. That’s a topic for the character sector, all I can say about the story is, there is no romance, just one guy wanting pussy and a girl in dire straits. The fact that Rec pretends to be a romance is ludicrous.\\n\r\n1/10\\n\\n\r\nArt:\\n\r\nThis anime looks okay, but there is absolutely nothing special about it. Character design is okay, backgrounds are okay, animation is okay, it’s just a huge pile of okay. That’s acceptable for a \"romantic comedy\", which is supposed to score with other qualities. Yeah, that’s not much of a statement, but there really aren’t any strong or weak points to go into deeper detail about.\\n\r\n6/10\\n\\n\r\nSound:\\n\r\nThe music (including opening and ending song) are okay. Yeah, I know, but they just don’t give me anything to work with. The voice acting is a bit disappointing. I don’t doubt that Kanako Sakai is capable of a good performance, but if you voice a voice actress, aren’t you supposed to show off your abilities? Judging from her very small number of roles listed on MAL, I may not be the only one who thinks she’s rather meh in an ocean of great. The rest of the bunch does a decent job, but they don’t have any big challenges to master.\\n\r\n5/10\\n\\n\r\nCharacters:\\n\r\nThere is not a single likeable person in this cast. Matsumaru, the male lead is a despicable piece of shit, who keeps trying to take advantage of Aka all the time. Even worse, he somehow manages to twist the truth around to make her feel guilty about something that HE did. First he date-rapes her (I admit, this is debatable, but looking at how these two behave later on, I’d say the evidence is obvious), then he repeatedly tries to guilt her into sex by giving her shelter after her house burned down. When that fails, he terrorizes her with their work project, making her afraid of somebody finding out and being labeled as nepotist whore. After still not getting more pussy, he makes her feel responsible for his own failures at work and when he has her down to the point where she even apologizes for it, he literally tells her to fuck off. And to top it all off, after he managed to completely break her, he doesn’t ask her to be his girlfriend, no, he DEMANDS her to be his girlfriend. And don’t even get me started on when he tried to get himself another chick, that was a completely different kind of low that I don’t even want to speak about.\\n\r\nSo, does nobody help this poor girl out? How about her agent? Nope, her manager tells her to dub porn or her career is over. None of the side characters is of any help in any way, nor do they add much to the show as a whole.\\n\r\n1/10\\n\\n\r\nEnjoyment:\\n\r\nI hate this anime, it makes me sick just thinking about it. Everybody involved with this should feel ashamed. If they were trying to tell a different story, it could’ve maybe worked, but they want to sell me Rec as a romantic comedy, which it just isn’t. I’d rather accept Schindler’s List as one than this crap. Twilight is a better love story than this. But what shocks me the most is how many people apparently fell for it. My brain can’t comprehend the thinking process that goes into accepting these blatant lies. This isn't a personal attack if you happen to like this show, I just don't understand how or why. Anyway, any more words would be a waste of time, all you need to know is: Don’t watch it!\\n\r\n1/10\\n\\n\r\nOverall:\\n\r\n2.8/10",
            "date": "2017-08-23T10:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 256098,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4655314.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/TrashDax",
                "username": "TrashDax"
            },
            "url": "https://myanimelist.net/reviews.php?id=256098"
        },
        {
            "content": "In spite of this series being fairly short, with length and episode duration, it manages to tell a better story than a lot of full length series. With Rec you really are not expecting anything amazing when you first notice it, but your voice of the series changes astonishingly fast. Really the series itself manages to grab you and keep you from the first episode right to the final scene. \r\nI want to talk about the Art and Animation first off. It's incredible, strictly speaking from a low budget series. The animation is fluid, it flows together very well. The art work is simple, almostlazy in some parts. But with that said the art work itself was unique and part of what grabs you into the series. Beauty in the simplicity. Overall I'd rank the art at around an 8.2/10. Now to focus on what actually grabs and keeps an audience, The Story.\\n\\n\r\nWith this series the story starts off quite innocent, you feel sorry for Matsumaru. You are introduced to cute main girl, Aka Onda(with an exceptional voice acting role by Kanako Sakai to mention). Then after the two enjoy a fated first meeting we are brought to the problem that brings this couple together. Now without spoiling anything, I can say it is not Deus-Ex like, but does seem kind of unluckily convenient for the story progression. With this Aka is invited to stay with Matsumaru, in which they begin a lovers relationship where they are not lovers. Now as the series progresses we have bonding moments and we having moments where the couple(who aren't actually a couple... yet?) are almost driven apart. But with turmoil comes the true feelings. And pray it is not too late. I an say the last 3 episodes have incredible pace for only being 33~ minutes of show time. The story had to be probably the best aspect for the series, personally I'd put it around 8.8/10.\\n\\n\r\nTo close I just want to mention how the characters were handled and overall enjoyment of the series. Introduction of each character was done pretty good, based on the role said character would play. But with a short story kind of series, there was no character background. Did we need it? No. But for a development stand point, minimal. Except in the case of Matsumaru and Aka. You had them develop a very cute romance, you had the two learn about each other and you had them grow to love each other. All in all Rec was a great series, just something to put on if you want to unwind and relax with a cute little series. I personally think Shaft did a good job bringing this story out.",
            "date": "2016-08-25T19:24:00+00:00",
            "helpful_count": 6,
            "mal_id": 227614,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4895859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Namiku",
                "username": "Namiku"
            },
            "url": "https://myanimelist.net/reviews.php?id=227614"
        },
        {
            "content": "I first stumbled on this anime when I was looking through a list of anime that had already been completely aired, and therefore found REC, I looked at the brief summary which said \"A romantic comedy about a boy and a girl, one who is a marketer and the other a voice actor, due to a tragic iccident the girl had to stay with the boy at his apartment, as each day passed they began to develop a relationship.\" \r\nThis brief summary caught my attention, and therefore I decided to spare it some of my time, since they were only 12 minutes long, excluding theintro it was 10 minutes long.\\n\\n\r\nWhat suprised me was how well structured it was, because it was only 10 minutes per episode and only 9 episodes all together. so in 90 minutes, there was a decent introduction to the characters, and then a good 8 episodes filled with development of all the characters and their feelings, it shows how each one gains confidence and how they begin to find themselves reliant on each other, how the guy grows to need her to be by his side, to live with him.\\n\\n\r\nThough there is all these feelings, it is expressed through a series of well placed comedy acts. \\n\\n\r\nTo me it was a 1 and a half hour well spent.\\n\\n\r\nBecause the emotions in the voice acting, was there, and it made me feel good hearing it.\\n\\n\r\nSo yes I would recommend this to any one no matter what you prefer to watch.",
            "date": "2009-08-12T13:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 17701,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/179801.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shintai88",
                "username": "shintai88"
            },
            "url": "https://myanimelist.net/reviews.php?id=17701"
        },
        {
            "content": "Talk about one hell of a breath of fresh air! Rec is a surprisingly good romance anime between TWO ACTUAL ADULTS!\r\nRec is a really short, but sweet adaptation of a manga by the same name. At a measly 9 half-length episodes, Rec was able to firmly stand next to the likes of Toradora by being so different then whatns typical of anime romance.\r\nNow when it comes to those differences, they are actually rather simple. Instead of teenagers in highschool whose entire lives seem to somehow revolve around their romantic relationship, we have two adults leading adult lives working two adult jobs. Did I mention theywere adults??\\n\\n\r\nThe story of Rec is about the two characters, Aka Onda and Fumiko Matsumaru realizing their feelings for eachother as their two careers become intertwined. However the romance never suffocates you, nor does it suffocate the characters, as their lives don't center around it. They met through such a sweet twist of fate, but they come together somewhat because of their jobs, not just because they met one night.\\n\\n\r\nWhen it comes to characters, obviously the ones that matter most Aka and Fumiko, and hey get as much screentime as possible. There are supporting characters, but their purpsoe is to make the world feel larger than just two people, and show that our two leads have social lives outside of eachother as well.\\n\\n\r\nAka Onda is easily the best thing about this show. She is proof that an anime girl doesn't need to be in highschool to be unbelievably cute. Rec may have 9 episodes, but it's qute dense. Not only is there the romance stuff, but also a story about an aspiring seiyuu tryin to make it big. Aka's dream is to be a successful voice actress, and for 9 episodes, she gets fleshed out pretty well.\\n\\n\r\nFumiko, the dude, is a slightly down-on-his-luck salaryman just trying to get by and get an approved proposal. His story is also a compelling one, but understandably less than Aka's. Maybe for japanese salarymen, but not for me. Relatability isn't really the point though. Fumiko was still an interesting guy.\\n\\n\r\nLike I mentioned, Shaft made this series. And boy does it show. Rec is a pretty old Shaft series (2004), so I couldn't find it in HD. But 480p is still good enough. Rec has pretty interesting color design and has a very cozy and warm feel to it. Obviously no sakuga to be found here, but Rec keeps things simple, and that's a good thing in this show.\\n\\n\r\nOverall, Rec was a very refreshing series. It's not incredibly unique or anything, however the cute and cozy presentation, the notably mature characters, and the short runtime make this a VERY worthwhile romance anime. If you want more, I recommend reading the manga, it's pretty good, but not as dense as the anime.\\n\\n\\n\r\nI give Rec an easy and well deserved 9 out of 10. \\n\r\nSnuggle up and watch it on a cold night like I did, it really fits the mood.",
            "date": "2017-07-30T01:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 254208,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5336817.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FalseShepherd13",
                "username": "FalseShepherd13"
            },
            "url": "https://myanimelist.net/reviews.php?id=254208"
        },
        {
            "content": "Rec is one of the shortest romance anime I have ever watched. This anime is more suited for adults as the relationship that develops is between two people in their mid-twenties.\r\nStory: 7/10\r\nRec is about a guy named Fumihiko Matsumaru, a 26 year old man that works in the sales branch of a snack company. One day, he is stood up by the woman who he fell for. As he is about to throw away his tickets to the movie, he meets Aka Onda who is a voice actor in training. She tells him not to waste the tickets and ends up watching the movie withhim. Later that night, Aka's house burns down, traumatizing her. Matsumaru, offers to let Aka sleep over at his condo. This anime is about the daily problems of this pessimistic salesman and rambunctious voice actor. A slice of life, drama, rom com that is most likely to please those of an older audience.\\n\\n\r\nArt: 6/10\\n\r\nThis is an anime with a slightly older art style that isn't too good or too bad. Nothing too special, either.\\n\\n\r\nSound: 6/10\\n\r\nThe music really isn't nothing special. I honestly didn't notice it at all. The voice acting is pretty good, though. The roles for these characters seemed very difficult to voice, and I commend the voice actors for that.\\n\\n\r\nCharacter: 7/10\\n\r\nThe characters are a bit dynamic but there isn't much character development as there is only 9 episodes.\\n\\n\r\nEnjoyment: 7/10\\n\r\nThis is a very light-hearted rom com targeted towards adults. It covers more mature content so I wouldn't recommend this for younger audiences.\\n",
            "date": "2016-09-06T18:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 228470,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5252917.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hana5963",
                "username": "hana5963"
            },
            "url": "https://myanimelist.net/reviews.php?id=228470"
        },
        {
            "content": "Ima keep this review concise and nice just like this anime,\r\nthis anime accomplishes what most romance animes fail to do by the end of their series. At least most of them, and what I mean is that most romance animes don't give you the feeling of romance or a relationship, the hardships that come with a relationship, the feeling of being reunited after that setback, or the confusion that goes on in your head during that time.\r\nThese are all important aspects that can be used in romance animes. But in most romance animes, they instead have either fan service, the protagonist being thick headed, orthe girl/guy not progressing their intent of letting the other person know they like them. Basically, the plot never gets developed, and if it does, it happens very slowly and by the end of the anime you might get a confession or a kiss IF you're lucky.\\n\\n\r\nWhich is what I love about this show, they actually manage to delve into the hardships of relationships and bring out enough character and plot development in only 9 freakin episodes!!! (Each episode only comprising of 10 minutes). It shows a lot of realistic scenarios that can be seen in actual relationships, and manages to pick up the pace which is refreshing compared to other anime romance shows. Not to mention the fact that neither character sticks to a character troupe, but like as if they're actually people, like thinking \"oh, what should i do?? ><\" I just realized that sounds like a tsundere but I promise you in this scenario it's different.\\n\\n\r\nNow admittedly, it's tiny amount of episodes is also sort of its own downfall (when you think about it it's only really 4 and a half episodes), as it doesn't give you as much build up as other shows. But it's a paradox, because for that same reason, that's what makes the show great, as it shows us you don't need 24 full length freakin episodes to bring out the subtle details of romance. It manages to make a fast paced show without making it feel too rushed, just perfect in my opinion honestly. \\n\\n\r\nOther downfalls is that sometimes the voice acting felt a little flat, and the sound was over used a little bit (as in not having a diverse pool of music to choose from), but this could be just due to budget. Despite that, they were still able to make due, but whether it was due to budget or simple laziness, it still gets marked down from a 9 to an 8. Honestly, it's such a short show, if you like romances there's no reason not to get into this.\\n\\n\r\nSo with all in mind: being able to show the nuances of a relationship in such a short amount of time, giving you a satisfying and fulfilled ending, actual people instead of character troupes, this anime in my opinion easily gives you an 8.",
            "date": "2016-03-28T05:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 214512,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3161881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SovietPsycho",
                "username": "SovietPsycho"
            },
            "url": "https://myanimelist.net/reviews.php?id=214512"
        },
        {
            "content": "I'm a sucker for big age-gap animes so I came across Rec, a magnificent anime I never would've known it was. I researched about its plot and all, and considered it to be something I would really enjoy. After I saw the characters, I felt my hopes go down a bit, since it's a typical kind of anime style: with moe and all that crap. Although I only focused my attention on the girl and her moeness, and my negativity took over, this didn't hinder me from watching it. And I'm glad to have done that. Rec was such a great anime. \r\nIt wasn't thatbig of a deal, but that's what makes it great. It's such a laid-back, and something that you would watch with your best friend or your significant other. \\n\\n\r\nIt kind of lacked something, which was the soundtrack. For me, the soundtrack always played a big role in animes. Though I liked the mini opening, it just wasn't enought to satisfy me.\\n\\n\r\nWhen I watched this anime, I felt that breezy feeling of nostalgia. Like trees are swaying, birds were chirping, and laughter from all the people can be audible: that's the feeling I got from Rec. Totally would RECommend. (Ayy??)",
            "date": "2015-06-01T04:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 189329,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4649031.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/araphernalia",
                "username": "araphernalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=189329"
        },
        {
            "content": "This series, while certainly cute an romantic, gets a lower score because at times it shows a totally disturbing view in the what might just be a cultural difference in relationships. The series is only 9 episodes (10 including the special) at 12 minutes each, and the relationship between Matsutaka and Aka seems somewhat  schizophrenic.\r\nSometimes he is very kind and understanding towards Aka, and sometimes he is disturbingly sexually aggressive. Maybe in Japan that is to be expected since he is much older than her and they live together, but the lesson seems to be that Aka is wrong for not wanting to havesex with  him. Maybe I'm being picky, and there are certainly people who like anime where the male is very assertive and dominant, but to me the way Aka is treated is somewhat abusive. He blows up at her for no reason, and even though he's very nasty to her she forgives him (even though he doesn't technically apologize). Some might say this is love, but as a person currently in a loving relationship knows it's more naiveté than anything else. This aspect of the anime is too distracting for me to enjoy it properly.\\n\\n\r\nIf you like romantic anime, this is an OK choice. It's pretty quick and has some very cute moments.",
            "date": "2010-07-12T09:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 28303,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165574.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nintendoll",
                "username": "Nintendoll"
            },
            "url": "https://myanimelist.net/reviews.php?id=28303"
        }
    ],
    [
        {
            "content": "Rec is short and good! A true gem. God I feel like I'm one of the lucky bunch that is SCREENING anime not yet aired while watching this anime !!! Each episode is like 10 minutes, but packed with so MUCH GOODNESS! \r\nThis is romance in a seiyuu setting, not school setting! I assure you it is a lot more interesting and tougher. The premise is a bit sexual which is EVEN BETTER !!! HELL YEAH AKAthe Audrey Hepburn quotes) and the man, named Matsumaru, helped Aka when she lost her home and succeed her dream to be a popular seiyuu. How they manage romance and work is so cute and romantic, and so cuddly.\\n\\n\r\nThe art is fantastic, it may look old, but that does not stop me from seeing how pretty Onda Aka is. \\n\\n\r\nI love both the opening and endings. And Aka's voice is so cute. I'm getting tired of those squeaky voices that try to be cute, but are not. \\n\\n\r\nMatsumaru is a great guy, he's a real man and a mature one, though he was once a failing one. Aka can be cute and young, but the guy cannot be a kid. Aka is the best girl! \\n\\n\r\nOverall Outstanding 10 I LOVE REC !!!",
            "date": "2016-08-01T13:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 225662,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1376541.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/iamYuyaSakaki",
                "username": "iamYuyaSakaki"
            },
            "url": "https://myanimelist.net/reviews.php?id=225662"
        },
        {
            "content": "REC is a relatively enjoyable short watch that goes through an adult romance, which is a rarity in anime.\r\nIts upshot its some of its interesting premises, such as the episodes being themed by various Audrey Hepburn movies. REC unfortunately tends to devolve into the same \"MC is as dense as a brick, which causes misunderstandings\" comedy/drama that is horrifically common.\r\nAll in all it's an enjoyable enough watch for it's length (short). The only caveat is under no circumstances should anyone ever read the original manga. It jumps off a cliff violently shortly after the anime ends, in the worst of ways.",
            "date": "2016-06-07T00:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 220181,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4454087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/milkblob",
                "username": "milkblob"
            },
            "url": "https://myanimelist.net/reviews.php?id=220181"
        },
        {
            "content": "Spoiler Free review of Rec by Heralder.\r\n\"Short and sweet\"\r\nRec is 10 episodes(9+1 special) short anime with episodes ranging from 10-12 minutes.Rec is romance/comedy anime with small amount of drama produced by Studio SHAFT in year 2006.\r\nStory:8\r\nRec follows the story of our two protagonists Matsumaru  Fumihiko(26 year old employed man) and Onda Aka(20 year old girl trying to became voice actress).Story is mainly focused on this couple and show us their day to day life as well as the struggles that they meet along the way.Story is short and sweet most of the time but get some drama at latter episodes.\r\nArt:9\r\nI really liked the animationand color this show had it is SHAFT show so that is to be expected the color palete would go from almost completely gray to vivid in a matter of seconds and character design are done quite well.\\n\\n\r\nSound:7\\n\r\nOp and OST are forgetable and even thou they complement the scenes quite well left me wanting some more tempo and variety.\\n\\n\\n\r\nCharacters:8\\n\r\nShow mainly focuses on above mentioned couple with few side characters simply since it is a quite short show.\\n\r\n- Matsumaru  Fumihiko is 26 old average salaryman who works in the marketing department of a snack company.He is quite cold and pesimistic at beginning but as the show progress it's shown that he's caring and kind.\\n\\n\r\n-Onda Aka is 20 years old \"egg\" of the voice actress and huge Audrey Hepburn fan.She is eccentric and often quotes Hepburns lines from various movies.Due to events revealed in first 2 episodes she is living with Matsumaru.\\n\r\nFor the side characters we have Aka's menager which serves and Matsumaru male coworker which both have a role of helping and supporting our main couple.\\n\\n\r\nEnjoyment:8\\n\r\nRec was exactly what i thought i would be and exactly the thing i wanted to see  at given moment and that was sweet short romance anime.\\n\\n\r\nOverall:8\\n\r\nIf you are looking for a quick watch and want to rest from all the action horror and heavy shows with some light-hearted romance then look no further and go watch Rec.This was Heralder and im out!\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-03-08T06:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 135043,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3487341.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Heralder",
                "username": "Heralder"
            },
            "url": "https://myanimelist.net/reviews.php?id=135043"
        },
        {
            "content": "Overall\t\r\nA neat and very compact love story with a little bit of a different setting, focusing on an aspiring voice actress and the guy she lives with. I like short animes and even though this may be a wee bit too short, it manages to get the story across. \r\nEr... is it marked as \"Ecchi\"? No such thing here.\r\nAnimation\t\r\nStandard graphics, but with a little bit extra attantion to detail; stuff that happens in the background is often ignoren in anime, but REC has a lot of little details going on, which makes the anime come alive.\r\nAnd the character design is good, too.\r\nSound\t\r\nCute opening tune andvaried and fitting background music. Voice acting is good (but should perhaps be top notch considering the theme of this show).\\n\\n\r\nStory\t\\n\r\nA believable and very down-to-earth love story. It might be a bit too short, but I really wouldn't want REC to be another filler-filled 26 episode borefest.\\n\\n\r\nCharacter\t\\n\r\nThe characters don't have much time to grow, but they are likeable nonetheless, and feel like real people.\\n\\n\r\nValue\t\\n\r\nThe length of this anime makes it very re-watchable. \\n\\n\r\nI watched the Lunar snime fansub, which was very good, and added to the enjoyment. The timing was great too.",
            "date": "2015-02-06T08:43:00+00:00",
            "helpful_count": 4,
            "mal_id": 179785,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146571.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/brynolf",
                "username": "brynolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=179785"
        },
        {
            "content": "If you like a predictable anime neatly packaged and also neatly tied with no loose endings to swoop through in one sitting, then definitely give REC a try.\r\n[Story] 7/10\r\nThe story revolves around both of our MC's, depicting their daily routines, hardships in both work and interhuman relationships, and their subsequent conclusions/resolvings. It starts out with fair amount of comedy, which later is surpressed by more serious topics.\r\n[Art and Sound] 7/10\r\nThe artstyle, having a retro feeling to it wasn't my cup of tea although I didn't hate it. In the end it managed to execute and depict everything on a plausible level (that includes not onlycharacters themselves but also surroundings). Sounds were, well they were there, nothing which gets stuck in your memory or get in the way.\\n\\n\r\n[Character] 6/10\\n\r\nCharacter development was rushed, incredibly rushed, along with the story they develop fast and the creators give us just the bare minimum for us to work with, however kudos to at least developing minor and supporting roles since these tend to be neglected in short series. Despite its fast pace, we still do get (or at least I did) moments, where we can side with either of the main characters and sympathise with their situation.\\n\\n\r\n[Enjoyment] 9/10\\n\r\nI went into the series with a right mindset, requesting something down-to-earth like, something not too complex and mainly the ability to watch it in one sitting made me pick this up. I was definitely satisfied.\\n\\n\r\n[Overall] 7/10\\n\r\nMixing all these traits up gives out a decent output, bringing us a short slice of life type of anime with a taste of comedy and striking us in our feels with couple moments. Having only 9 episodes and half the time of an average one, it manages to bring us a dense story with no fillers, yet on the other it unveils flaws of this kind of approach. Nevertheless, in the end all is neatly tied up and doubts can be swept off the table if one bites into this with the right mindset.",
            "date": "2017-01-12T10:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 238126,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5638607.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/eldoudy",
                "username": "eldoudy"
            },
            "url": "https://myanimelist.net/reviews.php?id=238126"
        },
        {
            "content": "This is actually a good series despite the obviously short and few episodes. It actually developed this simple story about how two people came to like each other and even had this tiny issues aside. I must say, I'm kinda reminded of Just my Luck by Lindsay Lohan and Chris Pine as the idea of the story is quite  similar. \r\nThe short episodes worked for me because it is not hassle to watch. It only takes about 15 minutes of your time. Add to that the simplicity of the story, making it easy to watch in between work. \r\nOn the other hand, the storymay be too simple that it can be skipped to watch. \\n",
            "date": "2009-06-08T07:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 15585,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116627.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tg-jade",
                "username": "tg-jade"
            },
            "url": "https://myanimelist.net/reviews.php?id=15585"
        },
        {
            "content": "Time to get yelled at for giving this a 10 by some random member of the mal community but frankly, I dont give a shit and i'll tell you why.\r\nRec was just something I stumbled across (at 2:00 in the morning) and I just figured on watching the first episode and I would see what I thought. I was pulled in automatically and decided to watch the entire series right there on the spot even though it was late at night and I had to be up and 4:30 for work. Lets talk about why I liked it.\r\nStory: Okay a guy gets stood up ona date but meets a new girl as hes about to go storming back home, and upon her apartment building burning down later that night he invites her to stay with him. Throughout the series from here on they kind of tiptoe around a relationship with each other and while other people can see it, they just don't. As such the story is pretty much just them at their jobs and everybody just waiting to see how long it takes for them to realize their feelings for one another. To be honest you know how its going to go the minute you start watching, but I don't think that that is a bad thing.\\n\\n\r\nArt: The show was animated very simply and I think anyone who watches anime should get what I mean by that. They don't waste time with unnecessary details and give us what we need to see so I actually prefer this animation because there's not as much to distract me.\\n\\n\r\nSound: I usually never talk about sound, and if I do its usually to say it sucked, but not here. The other time I will talk about it is when I think that the voice cast was absolutely perfect for their roles and while many people probably don't pay attention to this, or even care, I really focus on this because if the voice actors don't convince me, i'm done then and there. I especially like the actor for aka onda (the girl) which I thought was humorous since she is a voice actor in the show.\\n\\n\r\nCharacters: Never before have I felt that there was a character that I could really relate to, and that all changed with this. Matsumaru is now that anime character that I totally got and related to. \\n\r\nHe works in advertising and he gets to spend time with aka that way due to her job as a voice actress. I also have to say that they are one of the cutest anime couples I have ever seen. Aside from them we have matsumaru's friend and colleague who is funny as hell and aka's manager who is sorta trying harder to make aka and matsumaru's relationship work than they are. Like I said, I liked all of the characters which rarely happens for me.\\n\\n\r\nEnjoyment: ...I gave it a 10, do I really need to say anything else?\\n\\n\r\nOverall: I don't know that I've ever seen an anime that felt so real, and connected with me in such a way as this. I liked everything it had: the story, the humor, and of course the romance. It impresses me how much happens in such a short series, and I will definitely be watching this again, and again. While I don't usually do this, I will make an exception and say that if you are reading this, you need to watch this! Now!",
            "date": "2013-07-26T09:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 106935,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=106935"
        },
        {
            "content": "REC\r\nA bit of a back story \r\nMale lead named Fumihiko he's 26 and work as a project manger for a confectionary company\r\nA female lead named aka 20 just starting out as a voice actress not having the best luck with tho\r\nThis story is fantastic the series is about how the two meet and due to an accident Aka finds her self living with funihiko. the story touches on how the two live together and how the two help each other further there careers and their relationship with each other, for a series that only had 10 eps of 13min episodes I felt the story wastold very very well ive watch allot of 13eps/24eps series and there stories couldn’t compete with this. \\n\r\nThe first 5 mins had a big impact on me\\n\r\nI feel allot people should be able to relate to this anime due to the fact that it touches on allot of real life subjects and how a love life can be effected by ones work life and how no matter what you say at times you cant always say the right thing at times no matter how hard you try\\n\\n\r\n-Spoiler-\\n\r\nthe story starts with Fumihiko waiting for a date with a girl he works with in a rage of being stood up he scrunches up the tickets in his hand and goes to throw them on the ground when he hears a high pitched voice that replies with \"NO!... Don’t throw me away \"  he then spots a small cute girl -Aka- who persuades him to take her into to the movies \"it would be a waste to throw tho's  tickets away so you should go with me\" ill have to remember that one for myself one time lol.\\n\\n\r\nOverall I would really recommend this anime whether it is a filler in between series or a need for something good to watch\\n\\n\\n",
            "date": "2012-05-16T00:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 61291,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1195741.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rukuthehunter",
                "username": "rukuthehunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=61291"
        },
        {
            "content": "REC is, once again, a romance/ slice of life anime. Though it is very special, since it only has 9 episodes and each are about 10 minutes long.\r\nStory:\r\nThe story is very short, to the point and fast paced, as you might expect, since each episode is quite short and there are only very few.\r\nThe show starts of with the main character, Fumihiko Matsumaru, standing in front of a cinema and wanting to throw away his tickets, since his date obviously hadn't arrived. Suddenly this random girl, Onda Aka, starts \"voice acting\" as the tickets, persuading Matsumaru to go with her to see the movie, duringwhich she voice acts the whole time. At the end of the movie she reveals that she &quot;wants to be&quot; Audery Headburn, who she will quote very often during the show. Matsumaru, having seen his date go away with another man, is clearly unhappy and thinks that Aka is a very strange person, to say the least. She then takes him out for dinner, to make him happy. There she tells him how she wants to become a famous voice actress, clearing up some of the confusion from before. When both of them walk back home they realize that they were practically neighbours. Matsumaru, being a bit happier now, goes to bed, only to wake up again by the sound of fire engines. Matsumaru immediately runs out to see whats going on and sees, that Akas house is burning. After finding her alone, in the rain, on a swing, he invites her over to his house, thus laying the foundation for the actual plot. All I can say is the first episode overwhelms you once it's finished and is quite &quot;breath taking&quot;...\\n\r\nThe story then goes on to show how they live together and how there jobs evolve into a problem.\\n\\n\r\nAnimation:\\n\r\nThe animation wasn't great. It didn't bother me, but you could clearly see that it wasn't the most well animated show. But I must say that the characters were designed very well.\\n\\n\r\nSound:\\n\r\nThough I found the voices of the characters to be great I didn't really notice the music during the show at all.\\n\\n\r\nCharacters:\\n\r\nThe Characters are very easy to sympathize with, and you can really feel sorry for them at times. During the show both main characters mature a lot, making each episode better and better.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this show a lot, since it didn't &quot;bullshit around&quot;, but was very fast paced and to the point. The first episode was absolutely amazing, but after that the show went kind of downhill. It wasn't getting that much worse, but the first episode just set the scale really high. Since the characters are really easy to relate to the show was very enjoyable and fun to watch.\\n\\n\r\nOverall:\\n\r\nSince the first episode is only 12 minutes long there is NO reason not to watch it. I highly recommend this show if you've had enough of thosenerve-taking dramas.\\n\\n",
            "date": "2008-05-26T11:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 5007,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/makushimirian",
                "username": "makushimirian"
            },
            "url": "https://myanimelist.net/reviews.php?id=5007"
        },
        {
            "content": "First off i'd like to point out your opinion may differ vastly from mine; reason being i'm not a fan of 'Tsundere' characters. In my opinion, this anime starts off really well. It follows the story of an insufferable prick(my own opinion) of a person: Fumihiko Matsumaru. After being stood up by his date, he's cheered up by an aspiring voice actress Aka Onda. The story starts off fairly decently, the first few episodes show good character development, but then it starts to go down hill.\r\nDue to circumstances they start living together, this is when our protagonist starts pestering Aka for sex. Now if thiswas done for comedic purposes, it's outright bad, it just doesn't work. Trinity seven would be a good example of where characters are set up for sexual humour, this anime fails at that miserably. \\n\\n\r\n ~Spoilers~\\n\r\nTo top it off our protagonist starts becoming more of a bellend when he basically forces himself on Aka, leading to a fight and for some reason the anime wants us to believe that both parties were somehow at fault. Later on Aka starts to become succesful whereas Matsumaru seems to be struggling and he takes out all his frustration on her. If this were set up properly it couldve worked but all this does is give us an insight into the mind of a tsundere character and also shows us how pathetic our 'likeable and relatable' protagonist is.\\n\\n\\n\r\nOverall it is a bang average show, it does have some sweet moments but all of those are usually ruined by our weapon of a protagonist.",
            "date": "2018-04-07T05:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 277217,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6921112.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SNR_17",
                "username": "SNR_17"
            },
            "url": "https://myanimelist.net/reviews.php?id=277217"
        },
        {
            "content": "[SPOILER FREE/SHORT REVIEW]\r\nI enjoyed Rec way more than I originally thought I would. A romantic comedy where the characters actually hook up in the first episode? This is a story where the characters feel real. Its like this is a story that you could actually believe would happen in real life, and that is part of its core appeal. \r\nThe setting is what really lifted this show up and above the typical rom-com/drama. This is not a high school show, and the characters are actual adults that behave like human beings. I cannot stress this enough, the characters, for the most part, act like realpeople with real life struggles and responsibilities. \\n\\n\r\nConsidering this is a show from 2006, I can say that the art isn't really my thing and the animation is pretty lacking; its average at best for a show of its time. I do have to give credit to the voice acting in this show, especially Aka. She put on a lot of different voices, and just by listening you could tell when she was do her job as a voice actor, when she was quoting a movie or just being herself. It was a nice touch.\\n\\n\r\nNow on to the most glaring flaw there is. The directing was extraordinarily flat. There was a strange need for the characters to tell the audience what they were feeling instead of showing it and letting us understand their emotions through their actions. There was also an over-reliance on conversations that feel unnatural because they focus dumping information on the viewer. \\n\\n\r\nDespite this though, I would still recommend this show to anyone interested in romance. 10 minute episodes makes this an incredibly easy watch. The bonus episode is also worth watching in between episode 7 and 8.",
            "date": "2017-11-04T06:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 262495,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5738707.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mowse98",
                "username": "Mowse98"
            },
            "url": "https://myanimelist.net/reviews.php?id=262495"
        },
        {
            "content": "Rec is only 9 episodes long, unless you are including the special, it was short and sweet. \r\nRec has a sort of element that goes straight to the point that continues to have that flow without sudden moments on purpose. It all felt natural, but short, and doing this technique is what most shows fail to accomplish, but this still manages to do so with just 9 episodes.\r\nSometimes you enter a scene with your main character, Matsumaru, and you can tell by the mood how he felt. When all seems down, you get this white, shaddy, background that expresses the emotions. One episode, ---(SPOILERS)---- Matsumaruwas at a state of depressed thoughts, and his color was gray, shady, and depressing, while around him it was colorful, even with Ako sitting beside him being colorful as she is, you can tell how much he felt. \\n\\n\r\nThe official soundtrack had the perfect tone of each scene. When all seems settling and comfortable, you get blown away by the sound of calm, relaxing music that plays over. Make yourself comfortable because this is perfect to listen to relax.\\n\\n\r\nMy only complaint is there are cliche's that hit you in the face because you've seen this happen before. Some may be acceptable because it was understanding, but for comedy sake, not so much, and some details were questionable that seemed cliched, such as a person guessing a relationship. \\n\\n\r\nI would recommend this anime to anyone who are willing to be interested with a peek of interest of a story. You may a few things from this anime that aren't so ignorant and meandering.\\n\\n\r\nI give Rec a SOLID 7/10.",
            "date": "2017-09-28T16:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 259009,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6190384.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PapaRonny",
                "username": "PapaRonny"
            },
            "url": "https://myanimelist.net/reviews.php?id=259009"
        },
        {
            "content": "Story ~\r\nVery interesting plot, story is overall very enjoyable, however, there is always a feeling that I have seen anime with same plot before. Lack some uniqueness\r\nArt~\r\nWhat killed this serie...\r\nfor an anime aired in 2006... the graphic is... very bad...\r\nneed improvment\r\nSound~\r\nSame goes for sound\r\nCharacter Designs~\r\nlack uniqueness, every character look just like character from any other anime...\r\nEnjoyment~\r\nSuprisingly, this serie is very enjoyable, the short episodes are a very refreshing experience\r\nOverall~\r\nVery enjoyable romance anime, refreshing experience\r\ni recommand every1 at least try watching it\r\nYou just might fall in love with it",
            "date": "2008-12-11T06:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 10287,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/12968.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/he",
                "username": "he"
            },
            "url": "https://myanimelist.net/reviews.php?id=10287"
        },
        {
            "content": "Rec is a release that really missed a lot of markets. As anime watchers, we all eagerly await the next season of shows to launch and we all begin to recognize which shows flop and which show will make it into my top 10 list. This show seemed to miss both of those targets.\r\nAs the story opened up, I noticed that there was no deliverance of a standard run of the mill character or plot line. Our main character has his own personality which I believe has yet to be introduced into anime. Whether the watcher finds the main character interesting is up to himor herself, but the girl counterpart is quite the character herself. To watch these two grow towards one another in this awkward scenario they live in, is very entertaining.\\n\\n\r\nThe show capitalizes on its goal, to tell a modern story. It doesn't meander around, filling time. The 9 episodes each mark a point in this anime that holds some sort of meaning which is reflected across the entire show. Each episode continues the plot and grows, and in that sense the story is very powerful. The Art somewhat lacks, but it is understandable because a show like this might not receive much funds for production.\\n\\n\r\nThe voice actors did a Good job, but it was nothing out of the ordinary, it was well done. Overall the experience that Rec offered was short and sweet. It delivered the story in a solid 9 episode series, and that's all there was.",
            "date": "2013-01-17T13:14:00+00:00",
            "helpful_count": 2,
            "mal_id": 83967,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2049107.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GageAnime",
                "username": "GageAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=83967"
        },
        {
            "content": "This anime is one of your regular romatic-comedy animes, but it shows a little more for some reason unexplainable that made me watch. As a anime watching regular I have genres I like and dislike. Lucky for this one I like romantic comedies. The story is about a starting seiyuu (voice actor) Onda Aka, and a office drone that works for a snack food company, Matsumaru Fumihiko. One day as Matsumaru is waiting for a date to the movies that stood him up, Aka came by just when he was about to give up and throw away the tickets and asked if she could havethem. Soon he went to the movies with her instead. As they were going home it was pretty coincidental that they happen to be living close to each other. As he got home he woke up in the middle of the night to find that Aka's apartment was burned down. He took Aka in and well... \"things\" occurred even though the next day they both deny that they are boyfriend and girlfriend. As there life and jobs go on they soon are coworkers and the rest of the story is how their love develop.\\n\\n\r\nStory: 8\\n\r\nClassic run-of-the-mill Romantic Comedy. Most of these gets 7's because I preferably like this genre ,but for some reason this seems like a branch of a branch of romantic comedies and and that makes it more original then most.\\n\\n\r\nArt: 8\\n\r\nI liked the art style simply cute without being to blobish or to realistic (this is anime no need for realism).\\n\\n\r\nSound: 9\\n\r\nWow really liked Aka's Seiyuu (lol reminds me of reading a book about reading a book) I don't think Aya Hirano, Rei Kugumiya, or even Yui Horie could do it better (ok slight exaggerations ,but very slight)\\n\\n\r\nCharacter: 9\\n\r\nI especially like the fact that the male protagonist isn't an idiot and oblivious of the female protagonist liking him like in most other romantic comedies (ex: Saito Hiraga, Ryuuji Takasu, Yuji Sakai)\\n\\n\r\nEnjoyment: 10\\n\r\nIono maybe cuz I haven't seen any of this for a little while or because of the fact I love the show all together ,but anyways 10.\\n\\n\r\nOverall: 8 1/2\\n\r\nFor the sake of me not being able to make it 8 1/2 on the rating I made it 9. I wished the story was a little longer ,but that's why I like these types of shows rather then Shounen short and awesome.",
            "date": "2010-01-16T15:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 22454,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/asjgfhapwh",
                "username": "asjgfhapwh"
            },
            "url": "https://myanimelist.net/reviews.php?id=22454"
        },
        {
            "content": "This anime is really enjoyable with much romance. The real world relations really tug at the viewers heart strings. The drama in here is crazy deep, but crazy short and makes the series feel lacking.\r\nPLUS the whole sleep with the girl before you get to know here is kind of funny and surreal.\r\n8/10, Just too short X(",
            "date": "2009-04-01T20:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 13757,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13757"
        },
        {
            "content": "Rec was to me a subtle but great \"slice of life\" series. With the exception of the first episode. From the meeting at the theatre to the next was like woah, this really fast start to this story. The way one of the characters were acting after the first night was a little unbelievable at first. Anyway this is where the story starts, and from here on it moves along smoothly staying focused on the main characters and how they're dealing with their lives and each other. Two people meet, become friends, fall in love(without knowing it), while following their dreams. Nothing major or draggedon here, just a simple and very enjoyable story.",
            "date": "2013-10-03T23:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 115337,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3213769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mob15ime",
                "username": "Mob15ime"
            },
            "url": "https://myanimelist.net/reviews.php?id=115337"
        },
        {
            "content": "This is my best 2nd romance anime!!!the story of a salary man and voice actress want to be suceesful in life...i liked the story because its good romane and the art is not bad...its like they are couple or something but they dont admit it...plus the girl living with him but sometimes they LQ..its good..please watch its good ending....its 9 ep only 12mins max its so short haysss T_T",
            "date": "2012-06-17T21:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 63685,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1316885.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tri-star",
                "username": "Tri-star"
            },
            "url": "https://myanimelist.net/reviews.php?id=63685"
        },
        {
            "content": "Rec comes to us from director Ryutaro Nakamura, who also directed Serial Experiments Lain and Kino's Journey, two anime who have very high acclaim. Now, even if you haven't seen Rec or Lain or Kino's Journey, you notice Rec looks rather different than Lain and Kino's Journey, and indeed, they are rather different. Serial Experiments Lain and Kino's Journey focus on one female character within a hostile environment which they have to work their way around, and has many dark tones. Rec, on the other hand, is about two people trying to deal with the hardships getting into a relationship in a passive-aggressive environment theycreated for themselves and has lighter tones, and look at me, dancing around the issue. Dancy, Dancy Dancy. Alright, let's just skip to the end, is Rec good? Yes. Is it better than Serial Experiments Lain and Kino's Journey? No.\\n\\n\r\nRec centralizes two characters, Aka, who is an up and coming voice actress with a love for Audrey Hepburn films, and Matsumaru, an average-joe worker who works in the marketing department of a snack company. They met one night, and then Aka's house caught on fire and Matsumaru offered her to stay at his place until she can move back in. Now, these two characters have perfect chemistry, in the fact that while they still are worlds apart from each other, their interaction seems really natural and flows quite nicely. They have a variety of personality, and use all of it when dealing with their problems. While a good number of they time, they do act passive-aggressively, there are many ways they express that, even dipping into their other emotions. The anime sets its priority straight and only focuses on those two characters for most of the time, however, they each have one character to confide in, Hatakeda for Matsumaru and Yoshioka for Aka. These characters are entertaining in their own right, but they aren't all that developed, but that's what makes it better. We can focus on the main characters much more and the two other characters don't over-power that at all.\\n\\n\r\nFor most of the series, we are focused on Aka's problems she addresses in a passive-aggressive manor, and only three episodes where Matsumaru  has problems and expresses them like so. While both of these are rather well executed, I feel like it could have been balanced more. I feel at least one more episode where Matsumaru's problems are addressed could make it a little more worth-while. That being said, Matsumaru's problem-handling portion of Rec is easily the better part. Don't get me wrong, they're both good, but after Aka's life seems to get better, his life gets a little worse and he doesn't know how to deal with it and that creates another main problem after the first main problem gets solved without it being contrived in some sense.\\n\\n\r\nI will admit, the music is just seemingly generic J-Pop stuff, but that's compensated with a focus on story and characters and is not meant to blow you away rather, just to set the mood, and at that, it handles it quite nicely. Still, it could have been a little more interesting. The voice acting is really good though. It flows like a Bruce Lee fight scene in a river, and Bruce is moving with it, creating a good atmosphere with the characters, and making them more enjoyable as a whole. The art of Rec is very well put together, illustrating the right level of shading  to create a good tone, which is not quite dark, but still not entirely light-hearted. Again, like the soundtrack, it's mean to play second fiddle for the story and characters, and it also does a good job at it.\\n\\n\r\nWhen comparing this to Lain or Kino's Journey, you will notice some differences. The main difference is that Rec is about two characters and Lain and Kino's Journey are about one. Lain and Kino's Journey deal with more darker tones and themes, where Rec is more light-hearted. That's not to say they don't have similarities as well. Both take place in a hostile environment, however Rec's environment is not only man-made, but also much smaller than the ones in Lain and Kino's Journey. The both deal with problems of the characters and look at them as people, rather than as characters. The soundtrack and art aren't as vital as the story and characters in all of them, and they're all expressive and free-flowing. So, while it doesn't have all of what made those two shows good, but Nakamura did manage to sneak in a taste of that, and it make the anime all the more delicious.\\n\\n\r\nOverall: Rec, while not as good as Serial Experiments Lain or Kino's Journey, it's still worth watching, and I would recommend it for RomCom fans, as well as fans of Lain and Kino's Journey. Hell, I'd recommend it to almost anyone looking for anything good to watch. 10/10",
            "date": "2012-03-25T13:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 56885,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/444190.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/VGCKenny",
                "username": "VGCKenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=56885"
        },
        {
            "content": "For those of you who like it short n' sweet i would highly suggest this. Even though its only 11 min per ep it's enough to convey the whole story without sidetracking like most anime do. It's too the point, heart warming and pretty funny at some parts.",
            "date": "2010-11-03T20:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 31805,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/hjmndj",
                "username": "hjmndj"
            },
            "url": "https://myanimelist.net/reviews.php?id=31805"
        }
    ],
    [
        {
            "content": "REC is a moderately-paced Anime that is interesting and quite fun to watch. Although it is 9 episodes and 12 mins per ep I still suggest you give this a go if you have nothing to watch.\r\nSummary: Fumihiko Matsumaru is an average salaryman with no girlfriend. He invited his colleague Miss Tanaka to a movie but was stood up. Right at the time he was about to toss tickets into a trash can, a cute girl appeared and asked him not to waste those two tickets. After movie and dinner, he escorted her home and found they live in the same neighborhood, yet unfortunately herapartment caught on fire hours later. Having nowhere else to stay, rookie seiyuu Aka Onda moved to Matsumaru's place, and the two had started a \"more than friend but not yet lovers\" relationship under the same roof while keeping this secret from their employers. \\n\\n\r\nThe plot is quite interesting and nice to watch. Although I would have been more satisfied if they made more Eps or longer time in Eps etc. The ending is kind of conclusive but not really, the reason is that the Anime adaptation of the Manga book REC only covers around 3/4 of the first Volume. The ending will have you wanting to read the manga as well, which I did and have not regretted. If you love comedic and romantic drama, why not give REC a go?",
            "date": "2009-11-02T21:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 20196,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/250734.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/peatar",
                "username": "peatar"
            },
            "url": "https://myanimelist.net/reviews.php?id=20196"
        }
    ]
]