[
    [
        {
            "content": "I have noticed that I haven't written any reviews on bad anime lately so I'm definitely going to try. \r\nZombie Loan is quite a lame excuse for a zombie anime that contains more plot holes and inconsistencies than a George Romero movie (look him up)\r\nStory (Poor)\r\nThe story is quite laughable in every sense of the word. It is a mix of fan service, action, and comedy. Of course there are ways to execute a combo like this well, but it doesn't pull it off at all. They do well to suck you into the show with the first few episodes, but further down the road,you will notice it gets more and more ridiculous to even an open-minded person such as me to accept. The enemies are also pretty unimpressive. When I expect brutal zombie fights, the least I would expect would be puppies, nuns, and otakus. To give the story some credit though, it does get fairly decent towards the end after all the characters have established themselves. Also, don't forget the fan service as they try to hit all points of fan service from bishoujo to loli to bishonen. It's all there. \\n\\n\r\nArt (Mediocre)\\n\r\nTheres nothing wrong with the art, but theres nothing great about it either. It's obvious from the start that the main aspect of the characters are their sex appeal and their HAIR. Yes their hair, its noticeably more detailed than an average anime, and pointy. I'm surprised no ones eyes gets poked out from all the pointy hair flying around. Suffice to say, they drew most of the men in a bishounen style whereas the women were drawn with a cute moe style (again with the fan service). Girls who love that style will like the boys and the same goes to the boys who love the girls. As for me (being a guy), I loved how all the girls were drawn and even their characteristics weren't bad at all. Aside from favoritism, everything else from backgrounds to static objects and stand ins were just average in my book. Nothing to write home about.\\n\\n\r\nSound (Decent)\\n\r\nThe sound is also not very stellar for such a short anime. A lot of MAL users didn't seem to appreciate the opening theme song (ref: MAL forums). As for me, the OP was average it seems like they were trying to steal a page from Death Note with a hard j-rock theme with no real relevance to the show. The sound effects throughout the show are also average. You'll encounter more comedy sounds than anything else. Also, theres a lot of music in the show, but in the same token, theres a lot of 'dead air' (like a faint wind blowing). But for the most part you will wish they lightened up on the background music. It's only saving grace from a &quot;Pathetic&quot; score (1 point), is the voice casting. Well you can tell the girls are all voiced in a cute or 'typical' manner but some of the guys didn't sound too good in my opinion. One of the main characters even has a nasally tone to his ranting and raving which was quite irritating at times. \\n\\n\r\nCharacters (Decent)\\n\r\nAlthough it's very hard to take an  anime like this serious when ALL THREE main characters special abilities are horrible from the start. One can see a band on their neck showing if that person is alive or dead. That ability is fine, but the other two have to switch hands with each other in order to call forth a sword or gun. Which begs the question... why not just keep your own hands to yourself (the reason is also pretty lame IMO). Now I could understand if there was a decent explanation, but its lame. Theres holes like this throughout this show as you would expect from an 11 episode show. Some of the holes are big, like how did they get so good at fighting, or why even bother going to school when your dead and broke. I'm sure you'll find your own issues to pick on throughout your viewing. A good point of the characters though is the fan service aspect as they again cover as many aspects as they can, but even that can help the score that much. \\n\\n\\n\r\nOverall, it's an all right anime that looks like it tries too hard to please a broad audience in such a small time. Even the manga felt to ambitious as well. I believed if Peach-Pit focused more on the story rather than the fan service, it would have been a much better show. Its a shame that such a bad story came from the same person that made Rozen Maiden, Shugo Chara, and Di Gi Charat. \\n\\n\\n\r\nVerdict (4.4)",
            "date": "2008-05-21T03:17:00+00:00",
            "helpful_count": 106,
            "mal_id": 4864,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4864"
        },
        {
            "content": "Story\r\nQuite a unique storyline, much different than most out there. Although the story could have probably developed even more and a lot better if there were more than 11 episodes. That just cut the story too short, which was kinda disappointing.\r\nArt\r\nPersonally, I don't like this type of art style that was used in Z-Loan too much. Usually I'd prefer artwork more like that of Death Note. However, I think the art fit this particular series well, however it isn't the best art out there.\r\nSound\r\nUsually I like loud songs and metal songs, but the opening song was just horrendous. I couldn't stand listening to it. Theending theme was fine though. The background music fit the scenes it was used in well, so they did that good. Nothing else really so say about the music work. It was overall good.\\n\\n\r\nCharacter\\n\r\nVery good characters. The tension between Chika and Shito was great for the story, especially because no matter what, they were stuck together because of their hands. All of the characters were pretty interesting themselves. Michiru had a good background story. Koyomi was my probably favorite, with her energetic normal self, and then becoming the lesbian Yomi, her alter-ego. Then there's all the others like Yuuta, with her &quot;talking&quot; hands, Bekkou (or ferryman), who's the leader of Z-loan, even though he appears like somebody you wouldn't really expect to be in charge, Chika's father, who looks like a girl, Chika's sister, who does nothing but text message on her phone, Shimotsuki, who's a younger girl, yet a chairsperson, Shiba, who at first appears to be a good guy, and the Shinigami, who becomes a like a small creature after losing his core.\\n\r\nThe cast is all very interesting, however, since the series is too short, it didn't allow for too much development, so that's why I give a 8, and not 9.\\n\\n\r\nEnjoyment\\n\r\nDefinitely a great series if you're bored one day and just wanna watch a whole series, packed with parts of action, comedy, and horror. I watched it all in one day, since it's only 11 episodes, and I think it's best viewed like that. Very enjoyable series overall, even if it is very short.\\n\\n\r\nOverall\\n\r\nOverall, as you can see, I give it a 7. For reasons I've already explained above. I'm pretty sure an OVA will be coming out, so at least maybe we'll get to see a better ending in that.",
            "date": "2007-12-22T13:57:00+00:00",
            "helpful_count": 72,
            "mal_id": 1662,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/16265.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Monkey_D_Luffy",
                "username": "Monkey_D_Luffy"
            },
            "url": "https://myanimelist.net/reviews.php?id=1662"
        },
        {
            "content": "Zombie-Loan was quite a fun anime even though it was too short for my liking. Eleven episodes is just too short for a series, considering most have at least 12 episodes. \r\nStory\r\nIt's an interesting story, very original if you ask me, and it has it's good and bad parts. It's somewhat predictable from time to time and there aren't many plot-twists that could surprise you. Plus, I really would have liked more action in it, sometimes it just takes too long for the fighting to start even though it would look like an action anime first. Aside from that, it was pretty good. The worstpart is that it ended abruptly in episode 11, just when the REAL action seemed like it would start. Just the producer's way to say &quot;read the manga if you wanna know what happens&quot;.\\n\\n\r\nArt\\n\r\nI really liked the art, it was quite new to my eyes. The characters are each drawn in their own style and it was interesting to see how the male leads were tall and athletic, with almost no muscles on them and so on. Considering their &quot;status&quot; it suits them well. For the fans, it has some chibi scenes and stick-art scenes some fo the time to add to the fun. The art for the combat scenes was good but not the best, I enjoyed it nevertheless.\\n\\n\r\nSound\\n\r\nWell, the soundtrack was good, nothing much to say about it, each song was fit for the scene. The only thing that bothered my ears was the opening song. Sure, the off-vocal was totally awesome, I really liked the guitar sounds, but when the  singer started &quot;screaming&quot; in I would immediately skip forward. Ending song was fine, though not the best, with a great off-vocal.\\n\\n\r\nCharacter\\n\r\nThe characters were very well made, though most didn't have such a detailed background. Each had it's own unique personality and you could easily start liking one of them. Too bad some characters didn't have enough screen time (even though I liked them more than the main characters) and some had more than they really needed. \\n\\n\r\nOverall I enjoyed this (too) short series. I'd give it a 7.8 as a grand total (but I rounded up to 8). \\n\r\nIf you're into action, comedy, zombie related things and some drama here and there, watch Zombie Loan. Even though it's not one of the greatest anime out there, it's not a waste of time either.",
            "date": "2007-09-16T14:01:00+00:00",
            "helpful_count": 60,
            "mal_id": 867,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3545.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bondius",
                "username": "Bondius"
            },
            "url": "https://myanimelist.net/reviews.php?id=867"
        },
        {
            "content": "Zombie Loan\r\nI thought that i was going to give this a bad score because the first 2 episodes were boring and i didn't like the art style but i always finish what i start and i thought i was going to be tortured watching the other episodes, but the story hooks you in the next episodes and you kind of forget the art style.\r\nStory\r\nAt first it might seem boring because it felt like it was slow and Michiru was boring, to be honest, in all the episodes she is boring and useless and the art style didn't help, but you're hooked to the story becauseit felt interesting and unique, sometimes can be predictable on what's going on, but still it's something you want to see, but it was short even counting the two specials that are episode 12 and 13 and the end leaves you wanting to see what happens next, i think the episode 13th being the most interesting and leaving you with an open ending, overall it was good.\\n\\n\r\nArt & Animation\\n\r\nI didn't like this art style for the most part, i got used to the character design till the episode 6 even tho i thought it wasn't what i liked but i tried to like it, there were parts when the art of the characters design turns to chibi and it was funny, overall was fine.\\n\\n\r\nSound\\n\r\nThe sound, the voice acting and the music were good, i didn't liked the OP or just the singer, it sounded like someone was screaming in pain but the melody was good, the ED was good too, overall the sound was good.\\n\\n\r\nCharacter\\n\r\nThe characters were well developed, there was one that i felt was useless and that was Michiru, she was bland and you could take her from there and you won't miss her, maybe feel sorry for her in some scenes but she started to be a better character till the episode 13 but that wasn't enough, the MCs Shito and Chika were good, not something special but they were good, you will get surprised by them and the interaction between the characters made this good, overall was good because you don't get to know about some characters and i didn't felt attached to them.\\n\\n\r\nEnjoyment\\n\r\nYou can get good enjoyment from this, the comedy was good, the interaction between the characters was the best, even Michiru when she interacted was good, the story is very good and you won't get bored, maybe the first 2 ep. but after those 2 ep. you will like it, overall was good.",
            "date": "2015-08-11T22:42:00+00:00",
            "helpful_count": 27,
            "mal_id": 195894,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195894"
        },
        {
            "content": "First,this anime is way better than I thought.It's very funny and bloody (good combination) but it's too short 11 episodes.So it's seems that the manga is needed to read.\r\nStory\r\nIt has a good story.Zombies having they're organization for chasing an killing other bad zombies.A spooky story with zombies,death gods,reapers other related things.For this too short it had a nice plot but it changed a lot it rather seemed like the episode were all mini stories.But it's tooo funny really it had some awesome moments on which I laughed a lot.It didn't failed action beside the last episode where the producers clearly wanted to stop the anime.Justwhen I thought the action was going to start they bet the ''final boss'' in a simple and not long way.8/10\\n\\n\r\nAnimation\\n\r\nReally awesome everything was  well animated.Especially the character I liked they're style the male character are drown a bit in a shoujo anime style.So it's a unique style and it also didn't lacked in the fighting scenes.The funny scenes are also good made with some simple drawings but it was original.9/10\\n\\n\r\nSound\\n\r\nIt was good,nice rock songs with a lot of instrumental which I liked.The ending song is one of my favorites really nice and it suits it well.The opening was a good instrumental with some nice guitar playing but the vocals weren't too good a screaming voice.I'm just sick of them I'm remembering Maximum the Hormone.It was like a bad copy.The ost is awesome you should check it out.So in the end the songs were good.All rock/metal songs during fights.9/10\\n\\n\r\nCharacter\\n\r\nThis surely the best aspect of the anime.Every one is unique and they have good personalities.You will one of them probably.They had were good personalities and had a lot of funny scenes with them.There were some minor characters that I liked but they hadn't have any screen time.Anyway they were all funny a well drawn.It would be better if some had more screen time but I hope that they have better roles in the manga.9/10\\n\\n\r\nEnjoyment\\n\r\nIt enjoyed this toooo short anime.It had some awesome moments.There were some too  boring episodes but also some really awesome (like the hot spring ep.).So all in all it's a awesome anime but too short.Everyone should watch it but possible read the manga.8/10\\n\\n",
            "date": "2007-12-09T03:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 1554,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9122.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/asch",
                "username": "asch"
            },
            "url": "https://myanimelist.net/reviews.php?id=1554"
        },
        {
            "content": "Story:\r\nThe basics of the story were actually not to bad. Two boys who are bound to each other, a girl with some special powers who starts to help them. Nothing I wouldn't like there. \r\nThe story is short, but though I like short, this one was just too short. There is a big open ending, and when you are finished you have the feeling you still don't know anything. \r\nArt:\r\nThe series are drawn pretty good. I thought the boys where a bit to skinny, but overall the drawings never annoyed me.\r\nSound:\r\nThe opening and ending theme never appealed me, but I guess that especially the openingtheme fitted the story. What I really hated was the voice of Michiru (Japanese). In all the animes I watched I never had a voice I really didn't like, so it was quite a surprise for me it was possible. \\n\\n\r\nCharacter:\\n\r\nYou only get to know a little of the characters. I guess the story was to short to take a deeper look in there pasts. \\n\r\nMichiru was a very annoying character. Perhaps if you like extremely dumb girls, who scream a lot, cry a lot about nothing, get used by others, and have no guts at all, this series is something you should definitely see. \\n\\n\r\nEnjoyment:\\n\r\nI was glad the serie was short, because otherwise I wouldn&acute;t have watched the whole thing. The episodes I liked a bit better where the lasts ones with the grim reaper. He was kind of cute :P.\\n\\n\r\nOverall:\\n\r\nI rarely give a bad mark to a anim&eacute; series, but this is an exception. If they had changed the character and voice of Michiru and developed the story better this series could have easily had a 7. Unfortunately this wasn't the case and it's really a shame.",
            "date": "2009-02-09T03:31:00+00:00",
            "helpful_count": 14,
            "mal_id": 12263,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133367.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tsira",
                "username": "Tsira"
            },
            "url": "https://myanimelist.net/reviews.php?id=12263"
        },
        {
            "content": "Everything that you've borrowed must be paid back properly; that includes human life. If you loaned your life to extend it, then you have to pay for it, no matter how long it takes. And that's what Zombie-Loan is about. \r\nStory: (8/10)\r\nNot a lot of people see it, but this anime has a thick plot and has a lot of substantial themes. It's really interesting. It tackles upon complex issues such as the value of human life, the nature of life and death, the circle of life and even the value of friendship. Those aside, the story development wasn't so bad either. It's downfall lieson the fast paced episodes and the shortness of the series itself. Viewers were not able to enjoy this series long enough. Though I have to say, the cliff hanger ending was good. Makes viewers thirsting for some more. It would be a lot better if this had a sequel.\\n\\n\r\nArt: (8/10)\\n\r\nGraphics is fine. Blood scenes are realistic enough. Female characters were cute. Male characters were bishies. I'm not picky when it comes to art. Their proportions were more than decent. But then again, there was really nothing special about the art.\\n\\n\r\nSound: (6/10)\\n\r\nThe sounds are so-so. The dubbing was done well. But that aside, the OP and ED weren't that enjoyable. The first time I heard the OP, my head began to throb in pain. I have nothing against rock, but I think that was too much. The sounds are decent enough, but wasn't really special.\\n\\n\r\nCharacters: (10/10)\\n\r\nEach of the characters has their own characteristics, their own attitudes, their own past and are capable of standing as an individual character. I think that this is the most important trait that each characters should have. That aside, each characters are interesting in their own way. They have their own story to tell. It's really fun watching them develop as the series goes on.\\n\\n\r\nEnjoyment: (9/10)\\n\r\nThis anime is really enjoyable. While dealing with serious themes, the anime has a light and comical atmosphere. The action scenes were also decent enough. It also gives off some mysterious aura that leaves the viewers wanting for more. I would have given it a 10 if the series wasn't so short.\\n\\n\r\nOverall: (8/10)\\n\r\nA thick plot, good art, interesting characters... this anime would have been better if only it had a longer series. But despite that, the story development was fine and they tackled about interesting issues.",
            "date": "2009-05-06T03:27:00+00:00",
            "helpful_count": 13,
            "mal_id": 14823,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/167269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Silent_Follower",
                "username": "Silent_Follower"
            },
            "url": "https://myanimelist.net/reviews.php?id=14823"
        },
        {
            "content": "Keep in mind, this review covers the main series and two episode special.\r\nWelcome, My Friends, to the final review of horror anime month. Zombie Loan was a manga written by the duo, Peach-Pit, also responsible for Shugo Chara, Rozen Maiden, DearS and some other stuff I have never seen nor read. It was published by Square Enix. The anime version was handled by Xebec in 2007 with eleven episodes airing  two more being released only on the DVD. Let's delve into the series and see what awaits us. \r\nStory:\r\nKita Michiru can see something that no one else can when she takes off her glasses,a dark ring around the neck of a person who's fated to die shortly. One day, she spots a pure black ring around the necks of two classmates, Chika and Shito, who had shortly before survived a bridge accident that had killed everyone else involved. Following the two to warn them, Michiru discovers a secret. They didn't survive the crash. They died and were given a loan that allows them to keep going. To pay off this “zombie” loan, they fight mindless and illegal zombies for bounties. At first, Chika and Shito plan to kill Michiru to keep her quiet, but once they learn of her ability to see the rings they decide to put her to work. She just has to use her shinigami eyes to help them in their endeavours, but it won't be easy. There's a rise in zombies like Chika and Shito, except these zombies operate without authorization and they turn both animals and people into the mindless variety of zombie. \\n\\n\r\nThere are two significant problems with the narrative. The first is that the series has an issue with continuity. There's a major retcon that comes out of absolutely nowhere because... the plot needed it to work. The series also establishes that zombies start to lose their emotions, outright states that it's happening with a specific character and then proceeds to show us that character experiencing anger, distress, and all manner of other emotions in subsequent episodes. There are also some real contrivances for the plot to work. The biggest one being the reason why Chika and Shito are working together. \\n\\n\r\nThose complaints aside, there are some positive aspects to the story as well. The premise is interesting and the tension is developed very organically. The series is also very good in terms of progression. There's always something compelling happening and the stopping points for the individual episodes are very well chosen. The series proper ends at a good point as well, with the completion of a major arc.   Although the extra episodes start a new story arc, but only do the basic introduction for it, which didn't bother me since they are added episodes, but I can see why it might bother someone else. The series also excels at emotional investment. There are some really strong tragic scenes, some good triumphant moments, some touching scenes and amusing comedic moments. That isn't to say that all of the emotional moments work, there are certainly some that don't, but the majority of them do hit the mark. \\n\\n\r\nCharacters: \\n\\n\r\nThere are some really interesting characters in this. Initially, it looks like Shito, Chika and Michiru are all going to be pretty archetypical, but all of them develop beyond that fairly quickly and grow into fairly complex characters. The same is true for a lot of the side characters. Even if I'm not sure whether they're using a pseudo-scientific understanding of dissociative identity disorder with Koyomi or there's something else going on with her. It's probably explained in the manga at some point, but the anime either leaves it out or doesn't get to it. \\n\\n\r\nReally, the only weakness is in the familial dynamics. Chika's interactions with his father and sister are questionable at best. There are also some disturbing implications involved in Shito's back-story. Really, the most natural family relationship is Michiru's dynamic with her aunt and uncle and they barely appear in the anime, act like jerks and are banished from the story. \\n\\n\r\nArt: \\n\\n\r\nThe art is a bit odd. Most of the time it does look really good with some strong character designs, action sequences and backgrounds. However, there are quite a few more light-hearted scenes where the art style switches to a very lazy, minimalistic style. I'm not certain whether they thought stick figure drawings were funny or they just decided that they didn't need to put an effort into drawing those particular scenes. Either way, it looks pretty bad. \\n\\n\r\nSound: \\n\\n\r\nThey got some great actors for this series. Chika is voiced by Suzumura Kenichi (also the voice of KnK's Mikiya Kokutou) Kuwashima Houko (Kurumi 2's Nako) voices Michiru. Shito is voiced by Sakurai Takahiro, the actor known for his work as Cloud Strife. Although he plays against character a bit since he doesn't cross dress or chase after a childhood love interest in this one. The music is decent enough except for the stuff with lyrics. The stuff with lyrics is a cacophonous mess. \\n\\n\r\nHo-yay: \\n\\n\r\nThere's a fair amount of ho-yay in this. Shiba gets some homo-erotic moments with both Chika and Shito and they also get some with each other. During the extra episodes Shito even asks another guy if he can kiss him. It does, however, have more les-yay. Koyomi's second personality, Yomi does quite a few things with Michiru. Things which she really should have asked before doing, but to be fair she does stop when Michiru tells her she doesn't like what she's doing. Although, even with that scene it's hard to call it a one-sided thing. Since, during the two extra episodes, Michiru does demonstrate some feelings for Koyomi. So, there is some pretty blatant stuff both between men and between women but none of it amounts to a full fledged romantic relationship, at least not in the anime. It might in the manga, but I haven't read through it yet so I don't know. So, the ho-yay factor for the anime is going to be a 6/10.\\n\\n\r\nFinal Thoughts: \\n\\n\r\nZombie Loan is a good action adventure series with an interesting premise, compelling build up, strong acting, and good characters. Unfortunately, it also has some serious drawbacks in terms of narrative continuity and character dynamics. So, it is good but not great. My final rating is going to be a solid 7/10. If it sounds interesting to you, check it out. It's only eleven episodes, thirteen if you get into the specials, so it's a pretty fast watch. Well, that's another horror anime month complete. Next week we'll open November with a requested review, Claymore.",
            "date": "2014-10-29T11:15:00+00:00",
            "helpful_count": 10,
            "mal_id": 166685,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=166685"
        },
        {
            "content": "Anyone out there like horror, comedy and action? If so, I believe you'll enjoy this series.\r\nStory:\r\nZombie-Loan's story... well, to be honest, I haven't seen any animes that really focus on zombies, so this was definitely a first for me, so if anyone says this is a rip-off, don't believe them. The story centers mainly around 3 people, Michiru, who has Shinigami eyes, and can see if someone will do soon by seeing a black ring around their neck; and then Chika and Shito. I won't go into detail about their story, because it could spoil everyone, but let's just say that they hunt for zombiesfor a living... in the meantime. The goal is to hunt down zombies, or those that should have passed on but did not, and destroy them and give them a proper funeral. But that;s just the beginning. The story gets much better near the end.\\n\\n\r\nArt:\\n\r\nWell, the art is good, if you ask me. Especially when it goes into those comedic moments. It made me laugh countless times, that's for sure. The art is suitable.\\n\\n\r\nSound:\\n\r\nThe sound was GREAT! I heard everything crystal clear and the music and score was great also. Awesome ending theme, eh?\\n\\n\r\nOverall:\\n\r\nJust watch this series. It is good, I had to keep watching it because I just had to see what happened. It's a shame that the studio cut this series short, because it was scheduled for 20+ episodes. But hey, there's a 2 episode OVA afterward and who knows, there may be more in the future.\\n\\n\r\nI recommend this series to any hardcore anime fan.",
            "date": "2008-08-30T16:22:00+00:00",
            "helpful_count": 9,
            "mal_id": 7583,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/digiboy123",
                "username": "digiboy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=7583"
        },
        {
            "content": "Zombie Loan is the first zombie anime I've seen and I don't know if that's a good thing or not.  I highly doubt it is though.  I overall liked this anime but it did lack some good qualities.\r\nFor starters, Zombie Loan is only 11 episodes long so the storyline lacks depth and moves way too fast.  The concept is a good but really you need more episodes in order for it to work.\r\nThe animation was good.  I'm a sucker for hot anime guys and this anime gave me 2 more.  XD  I also like that they brought a littlehumor to the anime with the characters when they were irritated or happy and their heads and eyes would get big and they'd start waving their arms around.  I do think that the colors could have been brighter and the zombies could have been more rotted and gross looking.\\n\\n\r\nThe music I have mixed feelings about.  The opening music I liked up until the singing.  The background music was sometimes good but I did notice that sometimes it was saxaphones and that made me go wth??  Zombies + Saxaphones= Epic Fail.\\n\\n\r\nI liked the characters a lot and the voice actors did a very good job I think.  And I love how the same guy that did the voice of Hikaru in Ouran High School Host Club was Chika because in a way, those 2 characters are similar.\\n\\n\r\nI did enjoy watching this anime for the most part but when I got down to the last few episodes I got bored with it because as I said before, the storyline moved way to fast.  I give this a low rewatch value.\\n\\n\r\nSo overall, it was a good anime.  Not the best I've seen but good.  Now if they came out with a second season, I might be happier because I really didn't want it to end so fast.",
            "date": "2008-05-21T06:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 4865,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Reira_chan",
                "username": "Reira_chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=4865"
        },
        {
            "content": "What drew me to this anime was the fact that it was a zombie anime, I mean you dont see an anime with zombies too often usualy its just demons and vampires.the zombies are not the typical zombies you see in movies, they are quite intelligent and capable and arn't rotting corpses which puts some originality to this anime.\r\nWell, lets start with the characters Kita Michiru is a girl who has the gift of shinigami eyes, but starts to hate it when she sees black rings on her parents, when they die she starts using glasses to negate the effect of the shinigami eyes. shehas no goals or any aspirations and does not even care if she dies.Kita usualy has a hard time speaking her mind and always does what people tell her to do no question(no backbone whatsover!).Chika and Shito are the zombies who work to repay there debt to zombie loan office(some sort of office that leases life instead of money)which saved them from a tragic accident that happened prior to the series.Chika is lively and out-going kinda, but he has a short temper, he uses a katana! Shito is the more calm one, while Chika is cocky and impulsive one, although Shito can be cold at times. Along the way we meet some more wacky and weird characters in this 11 episode anime although most of them are quite forgettable. The art in this anime is excellent and stylish, while the animation is pretty bad and dont even get me started on the opening theme, which is the worst opening theme I have heard, of course the horrible vocals dont help, ending is only a LITTLE bit better.One of the bad things about this anime is that its way too short, I read somewhere that the manga had 9 volumes, they could have made at least 26 episodes from that.\\n\r\nI GIVE THIS ANIME A 7/10 its pretty good, but I wish it was longer.\\n\\n\r\nYeah, this is one of my old reviews I did for a site about 3-4 years ago,  hope you enjoyed reading it.",
            "date": "2011-06-27T08:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 38376,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/251996.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/digitaldude999",
                "username": "digitaldude999"
            },
            "url": "https://myanimelist.net/reviews.php?id=38376"
        },
        {
            "content": "Well, having just finished this series, I can actually say that I found this to be a really enjoyable short series (IMO too short but I will mention this as I go through the review)\r\nStory: Well my whole reason for starting the show was because I thought the plot was so unique and instantly grabbed me from the few lines, the idea of somebody being able to know when someone is about to die was an instant appeal, throw in some already dead zombies and I was set. Unfortunately as i stated, the show was only 11 episodes long, and for me that was justwaaay too short, and as a result left quite a few questions to be answered at the end. An example being that it is never explained why the two male characters have to switch hands in order to summon their weapons, it says WHAT will happen if they dont switch, and WHAT will happen if they didn't switch back. There are many other little plotholes and things that I would like to have been answered but I shant bother you with them all, because tbh if your going to give this series a try (which I think you should) then you will realise what im saying, it is said that this series was originally going to be 20+ episodes... why did it not?! I really think the story could have had so much more depth and so many of these 'unanswered questions' actually answered, and us not craving a second series. But the actualy storyline was great, and I was thurally gripped from beggining to end, I just wish that it had more time to develop and go into detail but I think that was impossible in just 11 episodes, so theres no suprise as to how many plotholes there was.\\n\\n\r\nArt: Well I'm not a big expert an Art, but on this series I really enjoyed the artwork used, I loved the style of the female characters (they were very cute... especially Michiru) the males... I liked, although Chika's hair was mental and spikey as hell! I felt they semt a tad plain and scruffy compared but still nothing too bad, and there personalities and everything else made up for it IMO, I must say i'm easily pleased when it comes to art, I will hardly ever come out and say 'god that art was pathetic'  or 'I hated that artwork' but thats just me.\\n\\n\r\nSound: Well there wasn't much music throughout the episodes (or none that I can really re-call) so if there was, then obviously nothing really spectacular if I can't even remember there being any, as for the opening and end themes. The opening was... neither good nor bad for me, after reading some reviews and everyone saying how bad the screaming was, I was expecting it to be proper death metal screamo style. But it wasn't although yes the man was screaming/shouting, I would not say it was heavy.. If anything I found the scappy guitar to sound a little like libertines but obviously just much heavier vocals. The ending theme.. I actually had to go back to have a couple of listens, which tbh says it all, again.. neither good nor bad, it goes well with the whole them of the series, and nice still shots of the characters and even had a catchy verse. But yeah.. nothing that really stood out for me.\\n\\n\r\nCharacter: I pretty much liked all the characters.. even the villains, with it only being 11 episodes I found Chika and Shito's relationship to be the most intresting, they were both total....well...... you get the idea, yet at times they semt to really respect each other and come together as a team. But at times they were just hilarious, and I thought they were too very intresting characters (again if more episodes were made, I think they could have been made into even better characters). Michiru played the shy, coy character very well, I especially found her hilarious towards the end, especially the last episodes.. and well her relationship with Koyomo is really quite outstanding, and even though it was fan service stuff, I found more hilarious than anything, and really had me laughing. I also thought there was a couple of useless characters who didn't really bring anything to the series such as Momoka (Chika's younger sister) who.. well did notthing but text on her phone, and also Yuuta who I thought was actually an intresting character whenever she popped up, and I personally would've liked to have seen her in abit more, but unfortunately didn't really think she brought much to the show.\\n\\n\r\nEnjoyment: Thurally enjoyed seeing this series, from the reviews I saw, they were pretty much spot on in that it had a great concept, but unfortunately was let down by there only being 11 episodes, therefore major plotholes etc etc. But nevertheless for what it is, and for what you are given its a great short horror series, with great and likeable characters, an overall very good plot. Also very funny, with it being a horror I expect minimal laughter and gags. But quite a few times I was actually left in stitches from some of the scenes/comments made by characters, and I found that to be a really nice touch seeing as it was something I wasn't really expecting. One thing that I might have wanted to see for more enjoyment was better fight scenes, none of them felt action packed and long enough. Although some of the villains were kinda creepy, they didn't put up much of a fight.\\n\\n\r\nOverall: Unfortunately (without trying to repeat myself over and over which I know I am doing) due to the shortness of the series the story/plot left a lot unanswered and major plotholes revealed, not really giving it time to sink in, and also for some of the characters to develop fully. But on the other hand for what the story is, its a very good idea, and I still enjoyed it nonetheless. Enjoyable characters, humour, zombies. An anime I am not regretting seeing.",
            "date": "2012-01-20T16:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 52189,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1106887.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/randompadley",
                "username": "randompadley"
            },
            "url": "https://myanimelist.net/reviews.php?id=52189"
        },
        {
            "content": "It had what I expected for a series that was around since like early 2000's.\r\nI was kind of expecting a buttload of fanservice and an arrogant protagonist (two things I don't like in anything I watch) but in the case of this series. I didn't have too much of that.\r\nShito seems to throw off that air of arrogance but since he gets an equal amount of punishment in the series, it seems balanced.\r\nThe story was a tad confusing but the arcs are pretty easy to figure out, from what I can understand it's about two dead guys that have to kill zombies in order tocome alive again using the main character girl as help for it. Seems pretty straightforward to me and that's what I enjoy.\\n\\n\r\nOnce I ignored the fanservice and the occasional mood switch of Shito (a prime offender because he pingpongs between being nice and arrogant in less than an episode) and Chika, this series was pretty fun to watch.\\n\\n\r\nAs for the artwork, I expected some skinny bishounens simply because I mean, let's face it, the manga was made in '02.\\n\\n\r\nAnd I can't lie, I didn't like the opening but I loved the ending theme song.\\n\\n\r\nMy overall enjoyment is simply that I liked it, personally. The simple storyline, the cool ending theme, the different characters. I just wish that there were a few more episodes to explain some more stuff but it was a nice little series for what it was.\\n\\n\r\nI recommend it just to get some kicks out of an old school supernatural series.",
            "date": "2016-02-03T11:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 210028,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kid2daKrazx",
                "username": "Kid2daKrazx"
            },
            "url": "https://myanimelist.net/reviews.php?id=210028"
        },
        {
            "content": "Zombie-Loan.. EEH?\r\nIt is a really great Anime.\r\nStoryThe story is good, and it kind of keeps you laughing and smiling, and it makes you wanna watch a few more episodes..Character[b/] I like the way the use Shito as the \"prince\" type in school, but when he is out he actually gets annoyed pretty fast. And Chito, who is the lively little \"kid\". And when you put those together, it is just funny all the way.Enjoyment, I enjoy this anime. It is really funny and has kind of a serious plot. \r\nOVERALL is this a great anime, and I recommend this to every one who likes alittle fun in the everyday life! :P",
            "date": "2008-12-14T06:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 10376,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91892.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hannechan",
                "username": "hannechan"
            },
            "url": "https://myanimelist.net/reviews.php?id=10376"
        },
        {
            "content": "Zombie Loan was a very short anime, but partly I think that's a good thing. If it had continued for an extra 50 episodes it probably would have become a series full of fillers and other rubbish things still managing to cut a lot of things from the manga. But as the manga is still ongoing I think hope for a second series is good, but it will probably be short too (a lot like Vampire Knight and Vampire Knight Guilty). \r\nOverall it is a good anime and you should watch it if you have a day spare.",
            "date": "2008-12-11T10:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 10296,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lolz123",
                "username": "lolz123"
            },
            "url": "https://myanimelist.net/reviews.php?id=10296"
        },
        {
            "content": "Hmm... Overall, I thought this was a pretty good anime. It had a well developed storyline, but I was hoping that it'd be longer, because of its outstanding and creative characters. It's kind of like the other animes, where theres a kiddsh guy and a cold guy and a girl in the middle, but it's a little different, too. I mean each character has their own kind of way to react in a different situation. Like, all the characters in this anime are different from each other, yet the are similar, too. I just like it, because it's a lot of personalities and action allmixed together into a great anime!",
            "date": "2008-03-08T09:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 2966,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40730.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/unforgetableme",
                "username": "unforgetableme"
            },
            "url": "https://myanimelist.net/reviews.php?id=2966"
        },
        {
            "content": "First up I wish to let everyone know there isn't just 12 episodes of this anime, there is technically more than 12 Episodes. There is actually 13 episodes. Proof of this is found on this website if you wish to confirm it for yourselves: http://kissanime.ru/Anime/Zombie-Loan please copy and paste and look at the information on the site (sorry to the writers of the summary of the series but maybe have a look at it too and or check your resource material. I just want to make sure everyone is receiving the correct information is all)\r\nStory: 8\r\nFor a anime with 13 episodes it is quite aweird anime right from the word go. Girl has the ability to see who is going to die and see rings around their necks, before long she comes across the zombie guys who have a contract with a guy who is the caretaker and someone who guides people to the other realm be it heaven or hell. Overall the story isn't what made me curious or interested in this anime, but rather the characters.\\n\\n\r\nArt: 7\\n\\n\r\nIt is pretty average in most circumstances, why do I say this is well for a anime released in 2007, I would have thought that it would have looked a little better. As art can often set the tone of a anime. Overall they at least did their best and in a way I like the feel the art style gives off to help make us all understand where and when this anime is set in. It also helps us understand that most of the events seem to happen after dark.\\n\\n\r\nSound: 5\\n\\n\r\nFor a anime released in 2007, the voices a clear and easy to understand what is said. It could however have used a Original Soundtrack of it's own to help give viewers a clear understanding as to how each character feels. Otherwise the opening just seems like a scream band of sorts and the words are hard to understand as to what is being sung.\\n\\n\r\nCharacter: 8\\n\\n\r\nAs I was watching the anime I noticed that gradually we get to see a different side to each of the characters that we didn't see originally when the anime first started or when we started to watch it. And whilst Kita starts of as a obedient, well behaved average school girl who can see the rings around people's necks which are a sign that they are going to die. She starts off afraid of it but over a period of time she seems to gradually accept that it is apart of her and wo she is. Overall I liked that about her, cause it isn't often that a anime character starts off as somewhat of a weak personality. As of yet I haven't found any characters that I disliked or hated, be it their personality or not.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nRight now I am up to episode 10 out of 13. Normally once I start a anime I will watch it to the very end cause I want to know if they achieve their goals or what they set out to do. But as I stated in the character section of my review, I honestly can't say I am finding it hard to follow or even anything that I honestly dislike as of yet. But it is defiantly interesting enough to make me want to sit down and watch it from start to finish.\\n\\n\r\nOverall: 8\\n\\n\r\nLook this anime has it's flaws much the same as a few others and sure there could be things they could fix to make more and more people watch this and become hooked on it but overall really can't pick out what I dislike or like exactly as of yet. But it is a different storyline in comparrasson to a few others to do with the dead or even spirits such as the anime xxXHolicXxx, but it is a anime that is worth seeing. After all you might like it. I think it really will depend on the individual as to if they would like it for sure. But do give it a go for yourself.\\n",
            "date": "2017-05-23T06:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 248348,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/170888.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShiroKuran3812",
                "username": "ShiroKuran3812"
            },
            "url": "https://myanimelist.net/reviews.php?id=248348"
        },
        {
            "content": "Is the worst Anime i ever saw i hope that the creator cut his hands after doing this shit.\r\nThe story has no sense and is very poor, the character's personality are just horrible and the desing is very bad.\r\nMenwhile i was watching  this Anime i was waiting to the episodes end because it were very boring.\r\nEven the naruto filler episodes are better than this Anime.\r\nI hope that no one has to watch this Anime again because he will suffer a lot.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch ThisAnime.\\n\r\nDon't Watch This Anime.\\n\\n",
            "date": "2016-08-07T13:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 226155,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5466825.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Hambelino",
                "username": "Hambelino"
            },
            "url": "https://myanimelist.net/reviews.php?id=226155"
        },
        {
            "content": "I made it my goal to watch more obscure animes this year, and I definitely hadn't even heard of this one since it came out so long ago. This isn't the greatest anime ever made, but it did keep my attention throughout the whole thing.\r\nI recommend this, not because it's good, but just for those who like to experiment with the shows they watch. The art style is a little strange but you do get used to it over time, I like it since it's kind of a break for me from all the big buff men of the shonen genre. This would have beenreally good if the story was planned out better, the concept had a lot of potential but it really just wasn't executed very well, and a few of the 'plot twists' are easy to guess beforehand.\\n\\n\r\nI'll give this a 6/10, because although its not great, I did actually enjoy watching it.\\n\\n\r\nAlso: On MAL there are only 11 episodes, but if you go over to the Crunchyroll site there are actually 13, however the other 2 don't really do much except set up for the 2nd season (which we never got).",
            "date": "2019-02-03T02:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 300778,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7597296.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KashiNoKuma",
                "username": "KashiNoKuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=300778"
        },
        {
            "content": "I watched the anime on watchanime.info and there were 13 episodes and not 11. \r\nthe storyline is quite basic, but overall it was amusing. if your are looking for something just to pass time, and give you some enjoyment it is a good anime. But it is not something I would rewatch though, since it is quite basic. But the intruduction of A-loan did make it more interesting in the end.\r\nthe characthers are not that intriguing exept for shiito and his backstory. \r\nwhen the main character Michiru turned out to be the only one able to understand the reaper Mr. Zarame, i was hoping shewould prove to be a more strong charachter, but she does not untill the very end. and up untill then she basically just follow shito and chika around.",
            "date": "2018-12-15T11:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 295815,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hjoerdis",
                "username": "Hjoerdis"
            },
            "url": "https://myanimelist.net/reviews.php?id=295815"
        }
    ],
    [
        {
            "content": "I have noticed that I haven't written any reviews on bad anime lately so I'm definitely going to try. \r\nZombie Loan is quite a lame excuse for a zombie anime that contains more plot holes and inconsistencies than a George Romero movie (look him up)\r\nStory (Poor)\r\nThe story is quite laughable in every sense of the word. It is a mix of fan service, action, and comedy. Of course there are ways to execute a combo like this well, but it doesn't pull it off at all. They do well to suck you into the show with the first few episodes, but further down the road,you will notice it gets more and more ridiculous to even an open-minded person such as me to accept. The enemies are also pretty unimpressive. When I expect brutal zombie fights, the least I would expect would be puppies, nuns, and otakus. To give the story some credit though, it does get fairly decent towards the end after all the characters have established themselves. Also, don't forget the fan service as they try to hit all points of fan service from bishoujo to loli to bishonen. It's all there. \\n\\n\r\nArt (Mediocre)\\n\r\nTheres nothing wrong with the art, but theres nothing great about it either. It's obvious from the start that the main aspect of the characters are their sex appeal and their HAIR. Yes their hair, its noticeably more detailed than an average anime, and pointy. I'm surprised no ones eyes gets poked out from all the pointy hair flying around. Suffice to say, they drew most of the men in a bishounen style whereas the women were drawn with a cute moe style (again with the fan service). Girls who love that style will like the boys and the same goes to the boys who love the girls. As for me (being a guy), I loved how all the girls were drawn and even their characteristics weren't bad at all. Aside from favoritism, everything else from backgrounds to static objects and stand ins were just average in my book. Nothing to write home about.\\n\\n\r\nSound (Decent)\\n\r\nThe sound is also not very stellar for such a short anime. A lot of MAL users didn't seem to appreciate the opening theme song (ref: MAL forums). As for me, the OP was average it seems like they were trying to steal a page from Death Note with a hard j-rock theme with no real relevance to the show. The sound effects throughout the show are also average. You'll encounter more comedy sounds than anything else. Also, theres a lot of music in the show, but in the same token, theres a lot of 'dead air' (like a faint wind blowing). But for the most part you will wish they lightened up on the background music. It's only saving grace from a &quot;Pathetic&quot; score (1 point), is the voice casting. Well you can tell the girls are all voiced in a cute or 'typical' manner but some of the guys didn't sound too good in my opinion. One of the main characters even has a nasally tone to his ranting and raving which was quite irritating at times. \\n\\n\r\nCharacters (Decent)\\n\r\nAlthough it's very hard to take an  anime like this serious when ALL THREE main characters special abilities are horrible from the start. One can see a band on their neck showing if that person is alive or dead. That ability is fine, but the other two have to switch hands with each other in order to call forth a sword or gun. Which begs the question... why not just keep your own hands to yourself (the reason is also pretty lame IMO). Now I could understand if there was a decent explanation, but its lame. Theres holes like this throughout this show as you would expect from an 11 episode show. Some of the holes are big, like how did they get so good at fighting, or why even bother going to school when your dead and broke. I'm sure you'll find your own issues to pick on throughout your viewing. A good point of the characters though is the fan service aspect as they again cover as many aspects as they can, but even that can help the score that much. \\n\\n\\n\r\nOverall, it's an all right anime that looks like it tries too hard to please a broad audience in such a small time. Even the manga felt to ambitious as well. I believed if Peach-Pit focused more on the story rather than the fan service, it would have been a much better show. Its a shame that such a bad story came from the same person that made Rozen Maiden, Shugo Chara, and Di Gi Charat. \\n\\n\\n\r\nVerdict (4.4)",
            "date": "2008-05-21T03:17:00+00:00",
            "helpful_count": 106,
            "mal_id": 4864,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2220.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ranivus",
                "username": "Ranivus"
            },
            "url": "https://myanimelist.net/reviews.php?id=4864"
        },
        {
            "content": "Story\r\nQuite a unique storyline, much different than most out there. Although the story could have probably developed even more and a lot better if there were more than 11 episodes. That just cut the story too short, which was kinda disappointing.\r\nArt\r\nPersonally, I don't like this type of art style that was used in Z-Loan too much. Usually I'd prefer artwork more like that of Death Note. However, I think the art fit this particular series well, however it isn't the best art out there.\r\nSound\r\nUsually I like loud songs and metal songs, but the opening song was just horrendous. I couldn't stand listening to it. Theending theme was fine though. The background music fit the scenes it was used in well, so they did that good. Nothing else really so say about the music work. It was overall good.\\n\\n\r\nCharacter\\n\r\nVery good characters. The tension between Chika and Shito was great for the story, especially because no matter what, they were stuck together because of their hands. All of the characters were pretty interesting themselves. Michiru had a good background story. Koyomi was my probably favorite, with her energetic normal self, and then becoming the lesbian Yomi, her alter-ego. Then there's all the others like Yuuta, with her &quot;talking&quot; hands, Bekkou (or ferryman), who's the leader of Z-loan, even though he appears like somebody you wouldn't really expect to be in charge, Chika's father, who looks like a girl, Chika's sister, who does nothing but text message on her phone, Shimotsuki, who's a younger girl, yet a chairsperson, Shiba, who at first appears to be a good guy, and the Shinigami, who becomes a like a small creature after losing his core.\\n\r\nThe cast is all very interesting, however, since the series is too short, it didn't allow for too much development, so that's why I give a 8, and not 9.\\n\\n\r\nEnjoyment\\n\r\nDefinitely a great series if you're bored one day and just wanna watch a whole series, packed with parts of action, comedy, and horror. I watched it all in one day, since it's only 11 episodes, and I think it's best viewed like that. Very enjoyable series overall, even if it is very short.\\n\\n\r\nOverall\\n\r\nOverall, as you can see, I give it a 7. For reasons I've already explained above. I'm pretty sure an OVA will be coming out, so at least maybe we'll get to see a better ending in that.",
            "date": "2007-12-22T13:57:00+00:00",
            "helpful_count": 72,
            "mal_id": 1662,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/16265.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Monkey_D_Luffy",
                "username": "Monkey_D_Luffy"
            },
            "url": "https://myanimelist.net/reviews.php?id=1662"
        },
        {
            "content": "Zombie-Loan was quite a fun anime even though it was too short for my liking. Eleven episodes is just too short for a series, considering most have at least 12 episodes. \r\nStory\r\nIt's an interesting story, very original if you ask me, and it has it's good and bad parts. It's somewhat predictable from time to time and there aren't many plot-twists that could surprise you. Plus, I really would have liked more action in it, sometimes it just takes too long for the fighting to start even though it would look like an action anime first. Aside from that, it was pretty good. The worstpart is that it ended abruptly in episode 11, just when the REAL action seemed like it would start. Just the producer's way to say &quot;read the manga if you wanna know what happens&quot;.\\n\\n\r\nArt\\n\r\nI really liked the art, it was quite new to my eyes. The characters are each drawn in their own style and it was interesting to see how the male leads were tall and athletic, with almost no muscles on them and so on. Considering their &quot;status&quot; it suits them well. For the fans, it has some chibi scenes and stick-art scenes some fo the time to add to the fun. The art for the combat scenes was good but not the best, I enjoyed it nevertheless.\\n\\n\r\nSound\\n\r\nWell, the soundtrack was good, nothing much to say about it, each song was fit for the scene. The only thing that bothered my ears was the opening song. Sure, the off-vocal was totally awesome, I really liked the guitar sounds, but when the  singer started &quot;screaming&quot; in I would immediately skip forward. Ending song was fine, though not the best, with a great off-vocal.\\n\\n\r\nCharacter\\n\r\nThe characters were very well made, though most didn't have such a detailed background. Each had it's own unique personality and you could easily start liking one of them. Too bad some characters didn't have enough screen time (even though I liked them more than the main characters) and some had more than they really needed. \\n\\n\r\nOverall I enjoyed this (too) short series. I'd give it a 7.8 as a grand total (but I rounded up to 8). \\n\r\nIf you're into action, comedy, zombie related things and some drama here and there, watch Zombie Loan. Even though it's not one of the greatest anime out there, it's not a waste of time either.",
            "date": "2007-09-16T14:01:00+00:00",
            "helpful_count": 60,
            "mal_id": 867,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3545.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Bondius",
                "username": "Bondius"
            },
            "url": "https://myanimelist.net/reviews.php?id=867"
        },
        {
            "content": "Zombie Loan\r\nI thought that i was going to give this a bad score because the first 2 episodes were boring and i didn't like the art style but i always finish what i start and i thought i was going to be tortured watching the other episodes, but the story hooks you in the next episodes and you kind of forget the art style.\r\nStory\r\nAt first it might seem boring because it felt like it was slow and Michiru was boring, to be honest, in all the episodes she is boring and useless and the art style didn't help, but you're hooked to the story becauseit felt interesting and unique, sometimes can be predictable on what's going on, but still it's something you want to see, but it was short even counting the two specials that are episode 12 and 13 and the end leaves you wanting to see what happens next, i think the episode 13th being the most interesting and leaving you with an open ending, overall it was good.\\n\\n\r\nArt & Animation\\n\r\nI didn't like this art style for the most part, i got used to the character design till the episode 6 even tho i thought it wasn't what i liked but i tried to like it, there were parts when the art of the characters design turns to chibi and it was funny, overall was fine.\\n\\n\r\nSound\\n\r\nThe sound, the voice acting and the music were good, i didn't liked the OP or just the singer, it sounded like someone was screaming in pain but the melody was good, the ED was good too, overall the sound was good.\\n\\n\r\nCharacter\\n\r\nThe characters were well developed, there was one that i felt was useless and that was Michiru, she was bland and you could take her from there and you won't miss her, maybe feel sorry for her in some scenes but she started to be a better character till the episode 13 but that wasn't enough, the MCs Shito and Chika were good, not something special but they were good, you will get surprised by them and the interaction between the characters made this good, overall was good because you don't get to know about some characters and i didn't felt attached to them.\\n\\n\r\nEnjoyment\\n\r\nYou can get good enjoyment from this, the comedy was good, the interaction between the characters was the best, even Michiru when she interacted was good, the story is very good and you won't get bored, maybe the first 2 ep. but after those 2 ep. you will like it, overall was good.",
            "date": "2015-08-11T22:42:00+00:00",
            "helpful_count": 27,
            "mal_id": 195894,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195894"
        },
        {
            "content": "First,this anime is way better than I thought.It's very funny and bloody (good combination) but it's too short 11 episodes.So it's seems that the manga is needed to read.\r\nStory\r\nIt has a good story.Zombies having they're organization for chasing an killing other bad zombies.A spooky story with zombies,death gods,reapers other related things.For this too short it had a nice plot but it changed a lot it rather seemed like the episode were all mini stories.But it's tooo funny really it had some awesome moments on which I laughed a lot.It didn't failed action beside the last episode where the producers clearly wanted to stop the anime.Justwhen I thought the action was going to start they bet the ''final boss'' in a simple and not long way.8/10\\n\\n\r\nAnimation\\n\r\nReally awesome everything was  well animated.Especially the character I liked they're style the male character are drown a bit in a shoujo anime style.So it's a unique style and it also didn't lacked in the fighting scenes.The funny scenes are also good made with some simple drawings but it was original.9/10\\n\\n\r\nSound\\n\r\nIt was good,nice rock songs with a lot of instrumental which I liked.The ending song is one of my favorites really nice and it suits it well.The opening was a good instrumental with some nice guitar playing but the vocals weren't too good a screaming voice.I'm just sick of them I'm remembering Maximum the Hormone.It was like a bad copy.The ost is awesome you should check it out.So in the end the songs were good.All rock/metal songs during fights.9/10\\n\\n\r\nCharacter\\n\r\nThis surely the best aspect of the anime.Every one is unique and they have good personalities.You will one of them probably.They had were good personalities and had a lot of funny scenes with them.There were some minor characters that I liked but they hadn't have any screen time.Anyway they were all funny a well drawn.It would be better if some had more screen time but I hope that they have better roles in the manga.9/10\\n\\n\r\nEnjoyment\\n\r\nIt enjoyed this toooo short anime.It had some awesome moments.There were some too  boring episodes but also some really awesome (like the hot spring ep.).So all in all it's a awesome anime but too short.Everyone should watch it but possible read the manga.8/10\\n\\n",
            "date": "2007-12-09T03:14:00+00:00",
            "helpful_count": 17,
            "mal_id": 1554,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9122.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/asch",
                "username": "asch"
            },
            "url": "https://myanimelist.net/reviews.php?id=1554"
        },
        {
            "content": "Story:\r\nThe basics of the story were actually not to bad. Two boys who are bound to each other, a girl with some special powers who starts to help them. Nothing I wouldn't like there. \r\nThe story is short, but though I like short, this one was just too short. There is a big open ending, and when you are finished you have the feeling you still don't know anything. \r\nArt:\r\nThe series are drawn pretty good. I thought the boys where a bit to skinny, but overall the drawings never annoyed me.\r\nSound:\r\nThe opening and ending theme never appealed me, but I guess that especially the openingtheme fitted the story. What I really hated was the voice of Michiru (Japanese). In all the animes I watched I never had a voice I really didn't like, so it was quite a surprise for me it was possible. \\n\\n\r\nCharacter:\\n\r\nYou only get to know a little of the characters. I guess the story was to short to take a deeper look in there pasts. \\n\r\nMichiru was a very annoying character. Perhaps if you like extremely dumb girls, who scream a lot, cry a lot about nothing, get used by others, and have no guts at all, this series is something you should definitely see. \\n\\n\r\nEnjoyment:\\n\r\nI was glad the serie was short, because otherwise I wouldn&acute;t have watched the whole thing. The episodes I liked a bit better where the lasts ones with the grim reaper. He was kind of cute :P.\\n\\n\r\nOverall:\\n\r\nI rarely give a bad mark to a anim&eacute; series, but this is an exception. If they had changed the character and voice of Michiru and developed the story better this series could have easily had a 7. Unfortunately this wasn't the case and it's really a shame.",
            "date": "2009-02-09T03:31:00+00:00",
            "helpful_count": 14,
            "mal_id": 12263,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/133367.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tsira",
                "username": "Tsira"
            },
            "url": "https://myanimelist.net/reviews.php?id=12263"
        },
        {
            "content": "Everything that you've borrowed must be paid back properly; that includes human life. If you loaned your life to extend it, then you have to pay for it, no matter how long it takes. And that's what Zombie-Loan is about. \r\nStory: (8/10)\r\nNot a lot of people see it, but this anime has a thick plot and has a lot of substantial themes. It's really interesting. It tackles upon complex issues such as the value of human life, the nature of life and death, the circle of life and even the value of friendship. Those aside, the story development wasn't so bad either. It's downfall lieson the fast paced episodes and the shortness of the series itself. Viewers were not able to enjoy this series long enough. Though I have to say, the cliff hanger ending was good. Makes viewers thirsting for some more. It would be a lot better if this had a sequel.\\n\\n\r\nArt: (8/10)\\n\r\nGraphics is fine. Blood scenes are realistic enough. Female characters were cute. Male characters were bishies. I'm not picky when it comes to art. Their proportions were more than decent. But then again, there was really nothing special about the art.\\n\\n\r\nSound: (6/10)\\n\r\nThe sounds are so-so. The dubbing was done well. But that aside, the OP and ED weren't that enjoyable. The first time I heard the OP, my head began to throb in pain. I have nothing against rock, but I think that was too much. The sounds are decent enough, but wasn't really special.\\n\\n\r\nCharacters: (10/10)\\n\r\nEach of the characters has their own characteristics, their own attitudes, their own past and are capable of standing as an individual character. I think that this is the most important trait that each characters should have. That aside, each characters are interesting in their own way. They have their own story to tell. It's really fun watching them develop as the series goes on.\\n\\n\r\nEnjoyment: (9/10)\\n\r\nThis anime is really enjoyable. While dealing with serious themes, the anime has a light and comical atmosphere. The action scenes were also decent enough. It also gives off some mysterious aura that leaves the viewers wanting for more. I would have given it a 10 if the series wasn't so short.\\n\\n\r\nOverall: (8/10)\\n\r\nA thick plot, good art, interesting characters... this anime would have been better if only it had a longer series. But despite that, the story development was fine and they tackled about interesting issues.",
            "date": "2009-05-06T03:27:00+00:00",
            "helpful_count": 13,
            "mal_id": 14823,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/167269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Silent_Follower",
                "username": "Silent_Follower"
            },
            "url": "https://myanimelist.net/reviews.php?id=14823"
        },
        {
            "content": "Keep in mind, this review covers the main series and two episode special.\r\nWelcome, My Friends, to the final review of horror anime month. Zombie Loan was a manga written by the duo, Peach-Pit, also responsible for Shugo Chara, Rozen Maiden, DearS and some other stuff I have never seen nor read. It was published by Square Enix. The anime version was handled by Xebec in 2007 with eleven episodes airing  two more being released only on the DVD. Let's delve into the series and see what awaits us. \r\nStory:\r\nKita Michiru can see something that no one else can when she takes off her glasses,a dark ring around the neck of a person who's fated to die shortly. One day, she spots a pure black ring around the necks of two classmates, Chika and Shito, who had shortly before survived a bridge accident that had killed everyone else involved. Following the two to warn them, Michiru discovers a secret. They didn't survive the crash. They died and were given a loan that allows them to keep going. To pay off this “zombie” loan, they fight mindless and illegal zombies for bounties. At first, Chika and Shito plan to kill Michiru to keep her quiet, but once they learn of her ability to see the rings they decide to put her to work. She just has to use her shinigami eyes to help them in their endeavours, but it won't be easy. There's a rise in zombies like Chika and Shito, except these zombies operate without authorization and they turn both animals and people into the mindless variety of zombie. \\n\\n\r\nThere are two significant problems with the narrative. The first is that the series has an issue with continuity. There's a major retcon that comes out of absolutely nowhere because... the plot needed it to work. The series also establishes that zombies start to lose their emotions, outright states that it's happening with a specific character and then proceeds to show us that character experiencing anger, distress, and all manner of other emotions in subsequent episodes. There are also some real contrivances for the plot to work. The biggest one being the reason why Chika and Shito are working together. \\n\\n\r\nThose complaints aside, there are some positive aspects to the story as well. The premise is interesting and the tension is developed very organically. The series is also very good in terms of progression. There's always something compelling happening and the stopping points for the individual episodes are very well chosen. The series proper ends at a good point as well, with the completion of a major arc.   Although the extra episodes start a new story arc, but only do the basic introduction for it, which didn't bother me since they are added episodes, but I can see why it might bother someone else. The series also excels at emotional investment. There are some really strong tragic scenes, some good triumphant moments, some touching scenes and amusing comedic moments. That isn't to say that all of the emotional moments work, there are certainly some that don't, but the majority of them do hit the mark. \\n\\n\r\nCharacters: \\n\\n\r\nThere are some really interesting characters in this. Initially, it looks like Shito, Chika and Michiru are all going to be pretty archetypical, but all of them develop beyond that fairly quickly and grow into fairly complex characters. The same is true for a lot of the side characters. Even if I'm not sure whether they're using a pseudo-scientific understanding of dissociative identity disorder with Koyomi or there's something else going on with her. It's probably explained in the manga at some point, but the anime either leaves it out or doesn't get to it. \\n\\n\r\nReally, the only weakness is in the familial dynamics. Chika's interactions with his father and sister are questionable at best. There are also some disturbing implications involved in Shito's back-story. Really, the most natural family relationship is Michiru's dynamic with her aunt and uncle and they barely appear in the anime, act like jerks and are banished from the story. \\n\\n\r\nArt: \\n\\n\r\nThe art is a bit odd. Most of the time it does look really good with some strong character designs, action sequences and backgrounds. However, there are quite a few more light-hearted scenes where the art style switches to a very lazy, minimalistic style. I'm not certain whether they thought stick figure drawings were funny or they just decided that they didn't need to put an effort into drawing those particular scenes. Either way, it looks pretty bad. \\n\\n\r\nSound: \\n\\n\r\nThey got some great actors for this series. Chika is voiced by Suzumura Kenichi (also the voice of KnK's Mikiya Kokutou) Kuwashima Houko (Kurumi 2's Nako) voices Michiru. Shito is voiced by Sakurai Takahiro, the actor known for his work as Cloud Strife. Although he plays against character a bit since he doesn't cross dress or chase after a childhood love interest in this one. The music is decent enough except for the stuff with lyrics. The stuff with lyrics is a cacophonous mess. \\n\\n\r\nHo-yay: \\n\\n\r\nThere's a fair amount of ho-yay in this. Shiba gets some homo-erotic moments with both Chika and Shito and they also get some with each other. During the extra episodes Shito even asks another guy if he can kiss him. It does, however, have more les-yay. Koyomi's second personality, Yomi does quite a few things with Michiru. Things which she really should have asked before doing, but to be fair she does stop when Michiru tells her she doesn't like what she's doing. Although, even with that scene it's hard to call it a one-sided thing. Since, during the two extra episodes, Michiru does demonstrate some feelings for Koyomi. So, there is some pretty blatant stuff both between men and between women but none of it amounts to a full fledged romantic relationship, at least not in the anime. It might in the manga, but I haven't read through it yet so I don't know. So, the ho-yay factor for the anime is going to be a 6/10.\\n\\n\r\nFinal Thoughts: \\n\\n\r\nZombie Loan is a good action adventure series with an interesting premise, compelling build up, strong acting, and good characters. Unfortunately, it also has some serious drawbacks in terms of narrative continuity and character dynamics. So, it is good but not great. My final rating is going to be a solid 7/10. If it sounds interesting to you, check it out. It's only eleven episodes, thirteen if you get into the specials, so it's a pretty fast watch. Well, that's another horror anime month complete. Next week we'll open November with a requested review, Claymore.",
            "date": "2014-10-29T11:15:00+00:00",
            "helpful_count": 10,
            "mal_id": 166685,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=166685"
        },
        {
            "content": "Anyone out there like horror, comedy and action? If so, I believe you'll enjoy this series.\r\nStory:\r\nZombie-Loan's story... well, to be honest, I haven't seen any animes that really focus on zombies, so this was definitely a first for me, so if anyone says this is a rip-off, don't believe them. The story centers mainly around 3 people, Michiru, who has Shinigami eyes, and can see if someone will do soon by seeing a black ring around their neck; and then Chika and Shito. I won't go into detail about their story, because it could spoil everyone, but let's just say that they hunt for zombiesfor a living... in the meantime. The goal is to hunt down zombies, or those that should have passed on but did not, and destroy them and give them a proper funeral. But that;s just the beginning. The story gets much better near the end.\\n\\n\r\nArt:\\n\r\nWell, the art is good, if you ask me. Especially when it goes into those comedic moments. It made me laugh countless times, that's for sure. The art is suitable.\\n\\n\r\nSound:\\n\r\nThe sound was GREAT! I heard everything crystal clear and the music and score was great also. Awesome ending theme, eh?\\n\\n\r\nOverall:\\n\r\nJust watch this series. It is good, I had to keep watching it because I just had to see what happened. It's a shame that the studio cut this series short, because it was scheduled for 20+ episodes. But hey, there's a 2 episode OVA afterward and who knows, there may be more in the future.\\n\\n\r\nI recommend this series to any hardcore anime fan.",
            "date": "2008-08-30T16:22:00+00:00",
            "helpful_count": 9,
            "mal_id": 7583,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9075.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/digiboy123",
                "username": "digiboy123"
            },
            "url": "https://myanimelist.net/reviews.php?id=7583"
        },
        {
            "content": "Zombie Loan is the first zombie anime I've seen and I don't know if that's a good thing or not.  I highly doubt it is though.  I overall liked this anime but it did lack some good qualities.\r\nFor starters, Zombie Loan is only 11 episodes long so the storyline lacks depth and moves way too fast.  The concept is a good but really you need more episodes in order for it to work.\r\nThe animation was good.  I'm a sucker for hot anime guys and this anime gave me 2 more.  XD  I also like that they brought a littlehumor to the anime with the characters when they were irritated or happy and their heads and eyes would get big and they'd start waving their arms around.  I do think that the colors could have been brighter and the zombies could have been more rotted and gross looking.\\n\\n\r\nThe music I have mixed feelings about.  The opening music I liked up until the singing.  The background music was sometimes good but I did notice that sometimes it was saxaphones and that made me go wth??  Zombies + Saxaphones= Epic Fail.\\n\\n\r\nI liked the characters a lot and the voice actors did a very good job I think.  And I love how the same guy that did the voice of Hikaru in Ouran High School Host Club was Chika because in a way, those 2 characters are similar.\\n\\n\r\nI did enjoy watching this anime for the most part but when I got down to the last few episodes I got bored with it because as I said before, the storyline moved way to fast.  I give this a low rewatch value.\\n\\n\r\nSo overall, it was a good anime.  Not the best I've seen but good.  Now if they came out with a second season, I might be happier because I really didn't want it to end so fast.",
            "date": "2008-05-21T06:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 4865,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/44091.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Reira_chan",
                "username": "Reira_chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=4865"
        },
        {
            "content": "What drew me to this anime was the fact that it was a zombie anime, I mean you dont see an anime with zombies too often usualy its just demons and vampires.the zombies are not the typical zombies you see in movies, they are quite intelligent and capable and arn't rotting corpses which puts some originality to this anime.\r\nWell, lets start with the characters Kita Michiru is a girl who has the gift of shinigami eyes, but starts to hate it when she sees black rings on her parents, when they die she starts using glasses to negate the effect of the shinigami eyes. shehas no goals or any aspirations and does not even care if she dies.Kita usualy has a hard time speaking her mind and always does what people tell her to do no question(no backbone whatsover!).Chika and Shito are the zombies who work to repay there debt to zombie loan office(some sort of office that leases life instead of money)which saved them from a tragic accident that happened prior to the series.Chika is lively and out-going kinda, but he has a short temper, he uses a katana! Shito is the more calm one, while Chika is cocky and impulsive one, although Shito can be cold at times. Along the way we meet some more wacky and weird characters in this 11 episode anime although most of them are quite forgettable. The art in this anime is excellent and stylish, while the animation is pretty bad and dont even get me started on the opening theme, which is the worst opening theme I have heard, of course the horrible vocals dont help, ending is only a LITTLE bit better.One of the bad things about this anime is that its way too short, I read somewhere that the manga had 9 volumes, they could have made at least 26 episodes from that.\\n\r\nI GIVE THIS ANIME A 7/10 its pretty good, but I wish it was longer.\\n\\n\r\nYeah, this is one of my old reviews I did for a site about 3-4 years ago,  hope you enjoyed reading it.",
            "date": "2011-06-27T08:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 38376,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/251996.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/digitaldude999",
                "username": "digitaldude999"
            },
            "url": "https://myanimelist.net/reviews.php?id=38376"
        },
        {
            "content": "Well, having just finished this series, I can actually say that I found this to be a really enjoyable short series (IMO too short but I will mention this as I go through the review)\r\nStory: Well my whole reason for starting the show was because I thought the plot was so unique and instantly grabbed me from the few lines, the idea of somebody being able to know when someone is about to die was an instant appeal, throw in some already dead zombies and I was set. Unfortunately as i stated, the show was only 11 episodes long, and for me that was justwaaay too short, and as a result left quite a few questions to be answered at the end. An example being that it is never explained why the two male characters have to switch hands in order to summon their weapons, it says WHAT will happen if they dont switch, and WHAT will happen if they didn't switch back. There are many other little plotholes and things that I would like to have been answered but I shant bother you with them all, because tbh if your going to give this series a try (which I think you should) then you will realise what im saying, it is said that this series was originally going to be 20+ episodes... why did it not?! I really think the story could have had so much more depth and so many of these 'unanswered questions' actually answered, and us not craving a second series. But the actualy storyline was great, and I was thurally gripped from beggining to end, I just wish that it had more time to develop and go into detail but I think that was impossible in just 11 episodes, so theres no suprise as to how many plotholes there was.\\n\\n\r\nArt: Well I'm not a big expert an Art, but on this series I really enjoyed the artwork used, I loved the style of the female characters (they were very cute... especially Michiru) the males... I liked, although Chika's hair was mental and spikey as hell! I felt they semt a tad plain and scruffy compared but still nothing too bad, and there personalities and everything else made up for it IMO, I must say i'm easily pleased when it comes to art, I will hardly ever come out and say 'god that art was pathetic'  or 'I hated that artwork' but thats just me.\\n\\n\r\nSound: Well there wasn't much music throughout the episodes (or none that I can really re-call) so if there was, then obviously nothing really spectacular if I can't even remember there being any, as for the opening and end themes. The opening was... neither good nor bad for me, after reading some reviews and everyone saying how bad the screaming was, I was expecting it to be proper death metal screamo style. But it wasn't although yes the man was screaming/shouting, I would not say it was heavy.. If anything I found the scappy guitar to sound a little like libertines but obviously just much heavier vocals. The ending theme.. I actually had to go back to have a couple of listens, which tbh says it all, again.. neither good nor bad, it goes well with the whole them of the series, and nice still shots of the characters and even had a catchy verse. But yeah.. nothing that really stood out for me.\\n\\n\r\nCharacter: I pretty much liked all the characters.. even the villains, with it only being 11 episodes I found Chika and Shito's relationship to be the most intresting, they were both total....well...... you get the idea, yet at times they semt to really respect each other and come together as a team. But at times they were just hilarious, and I thought they were too very intresting characters (again if more episodes were made, I think they could have been made into even better characters). Michiru played the shy, coy character very well, I especially found her hilarious towards the end, especially the last episodes.. and well her relationship with Koyomo is really quite outstanding, and even though it was fan service stuff, I found more hilarious than anything, and really had me laughing. I also thought there was a couple of useless characters who didn't really bring anything to the series such as Momoka (Chika's younger sister) who.. well did notthing but text on her phone, and also Yuuta who I thought was actually an intresting character whenever she popped up, and I personally would've liked to have seen her in abit more, but unfortunately didn't really think she brought much to the show.\\n\\n\r\nEnjoyment: Thurally enjoyed seeing this series, from the reviews I saw, they were pretty much spot on in that it had a great concept, but unfortunately was let down by there only being 11 episodes, therefore major plotholes etc etc. But nevertheless for what it is, and for what you are given its a great short horror series, with great and likeable characters, an overall very good plot. Also very funny, with it being a horror I expect minimal laughter and gags. But quite a few times I was actually left in stitches from some of the scenes/comments made by characters, and I found that to be a really nice touch seeing as it was something I wasn't really expecting. One thing that I might have wanted to see for more enjoyment was better fight scenes, none of them felt action packed and long enough. Although some of the villains were kinda creepy, they didn't put up much of a fight.\\n\\n\r\nOverall: Unfortunately (without trying to repeat myself over and over which I know I am doing) due to the shortness of the series the story/plot left a lot unanswered and major plotholes revealed, not really giving it time to sink in, and also for some of the characters to develop fully. But on the other hand for what the story is, its a very good idea, and I still enjoyed it nonetheless. Enjoyable characters, humour, zombies. An anime I am not regretting seeing.",
            "date": "2012-01-20T16:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 52189,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1106887.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/randompadley",
                "username": "randompadley"
            },
            "url": "https://myanimelist.net/reviews.php?id=52189"
        },
        {
            "content": "It had what I expected for a series that was around since like early 2000's.\r\nI was kind of expecting a buttload of fanservice and an arrogant protagonist (two things I don't like in anything I watch) but in the case of this series. I didn't have too much of that.\r\nShito seems to throw off that air of arrogance but since he gets an equal amount of punishment in the series, it seems balanced.\r\nThe story was a tad confusing but the arcs are pretty easy to figure out, from what I can understand it's about two dead guys that have to kill zombies in order tocome alive again using the main character girl as help for it. Seems pretty straightforward to me and that's what I enjoy.\\n\\n\r\nOnce I ignored the fanservice and the occasional mood switch of Shito (a prime offender because he pingpongs between being nice and arrogant in less than an episode) and Chika, this series was pretty fun to watch.\\n\\n\r\nAs for the artwork, I expected some skinny bishounens simply because I mean, let's face it, the manga was made in '02.\\n\\n\r\nAnd I can't lie, I didn't like the opening but I loved the ending theme song.\\n\\n\r\nMy overall enjoyment is simply that I liked it, personally. The simple storyline, the cool ending theme, the different characters. I just wish that there were a few more episodes to explain some more stuff but it was a nice little series for what it was.\\n\\n\r\nI recommend it just to get some kicks out of an old school supernatural series.",
            "date": "2016-02-03T11:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 210028,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kid2daKrazx",
                "username": "Kid2daKrazx"
            },
            "url": "https://myanimelist.net/reviews.php?id=210028"
        },
        {
            "content": "Zombie-Loan.. EEH?\r\nIt is a really great Anime.\r\nStoryThe story is good, and it kind of keeps you laughing and smiling, and it makes you wanna watch a few more episodes..Character[b/] I like the way the use Shito as the \"prince\" type in school, but when he is out he actually gets annoyed pretty fast. And Chito, who is the lively little \"kid\". And when you put those together, it is just funny all the way.Enjoyment, I enjoy this anime. It is really funny and has kind of a serious plot. \r\nOVERALL is this a great anime, and I recommend this to every one who likes alittle fun in the everyday life! :P",
            "date": "2008-12-14T06:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 10376,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91892.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/hannechan",
                "username": "hannechan"
            },
            "url": "https://myanimelist.net/reviews.php?id=10376"
        },
        {
            "content": "Zombie Loan was a very short anime, but partly I think that's a good thing. If it had continued for an extra 50 episodes it probably would have become a series full of fillers and other rubbish things still managing to cut a lot of things from the manga. But as the manga is still ongoing I think hope for a second series is good, but it will probably be short too (a lot like Vampire Knight and Vampire Knight Guilty). \r\nOverall it is a good anime and you should watch it if you have a day spare.",
            "date": "2008-12-11T10:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 10296,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lolz123",
                "username": "lolz123"
            },
            "url": "https://myanimelist.net/reviews.php?id=10296"
        },
        {
            "content": "Hmm... Overall, I thought this was a pretty good anime. It had a well developed storyline, but I was hoping that it'd be longer, because of its outstanding and creative characters. It's kind of like the other animes, where theres a kiddsh guy and a cold guy and a girl in the middle, but it's a little different, too. I mean each character has their own kind of way to react in a different situation. Like, all the characters in this anime are different from each other, yet the are similar, too. I just like it, because it's a lot of personalities and action allmixed together into a great anime!",
            "date": "2008-03-08T09:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 2966,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40730.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/unforgetableme",
                "username": "unforgetableme"
            },
            "url": "https://myanimelist.net/reviews.php?id=2966"
        },
        {
            "content": "First up I wish to let everyone know there isn't just 12 episodes of this anime, there is technically more than 12 Episodes. There is actually 13 episodes. Proof of this is found on this website if you wish to confirm it for yourselves: http://kissanime.ru/Anime/Zombie-Loan please copy and paste and look at the information on the site (sorry to the writers of the summary of the series but maybe have a look at it too and or check your resource material. I just want to make sure everyone is receiving the correct information is all)\r\nStory: 8\r\nFor a anime with 13 episodes it is quite aweird anime right from the word go. Girl has the ability to see who is going to die and see rings around their necks, before long she comes across the zombie guys who have a contract with a guy who is the caretaker and someone who guides people to the other realm be it heaven or hell. Overall the story isn't what made me curious or interested in this anime, but rather the characters.\\n\\n\r\nArt: 7\\n\\n\r\nIt is pretty average in most circumstances, why do I say this is well for a anime released in 2007, I would have thought that it would have looked a little better. As art can often set the tone of a anime. Overall they at least did their best and in a way I like the feel the art style gives off to help make us all understand where and when this anime is set in. It also helps us understand that most of the events seem to happen after dark.\\n\\n\r\nSound: 5\\n\\n\r\nFor a anime released in 2007, the voices a clear and easy to understand what is said. It could however have used a Original Soundtrack of it's own to help give viewers a clear understanding as to how each character feels. Otherwise the opening just seems like a scream band of sorts and the words are hard to understand as to what is being sung.\\n\\n\r\nCharacter: 8\\n\\n\r\nAs I was watching the anime I noticed that gradually we get to see a different side to each of the characters that we didn't see originally when the anime first started or when we started to watch it. And whilst Kita starts of as a obedient, well behaved average school girl who can see the rings around people's necks which are a sign that they are going to die. She starts off afraid of it but over a period of time she seems to gradually accept that it is apart of her and wo she is. Overall I liked that about her, cause it isn't often that a anime character starts off as somewhat of a weak personality. As of yet I haven't found any characters that I disliked or hated, be it their personality or not.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nRight now I am up to episode 10 out of 13. Normally once I start a anime I will watch it to the very end cause I want to know if they achieve their goals or what they set out to do. But as I stated in the character section of my review, I honestly can't say I am finding it hard to follow or even anything that I honestly dislike as of yet. But it is defiantly interesting enough to make me want to sit down and watch it from start to finish.\\n\\n\r\nOverall: 8\\n\\n\r\nLook this anime has it's flaws much the same as a few others and sure there could be things they could fix to make more and more people watch this and become hooked on it but overall really can't pick out what I dislike or like exactly as of yet. But it is a different storyline in comparrasson to a few others to do with the dead or even spirits such as the anime xxXHolicXxx, but it is a anime that is worth seeing. After all you might like it. I think it really will depend on the individual as to if they would like it for sure. But do give it a go for yourself.\\n",
            "date": "2017-05-23T06:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 248348,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/170888.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 8,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ShiroKuran3812",
                "username": "ShiroKuran3812"
            },
            "url": "https://myanimelist.net/reviews.php?id=248348"
        },
        {
            "content": "Is the worst Anime i ever saw i hope that the creator cut his hands after doing this shit.\r\nThe story has no sense and is very poor, the character's personality are just horrible and the desing is very bad.\r\nMenwhile i was watching  this Anime i was waiting to the episodes end because it were very boring.\r\nEven the naruto filler episodes are better than this Anime.\r\nI hope that no one has to watch this Anime again because he will suffer a lot.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch This Anime.\r\nDon't Watch ThisAnime.\\n\r\nDon't Watch This Anime.\\n\\n",
            "date": "2016-08-07T13:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 226155,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5466825.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Hambelino",
                "username": "Hambelino"
            },
            "url": "https://myanimelist.net/reviews.php?id=226155"
        },
        {
            "content": "I made it my goal to watch more obscure animes this year, and I definitely hadn't even heard of this one since it came out so long ago. This isn't the greatest anime ever made, but it did keep my attention throughout the whole thing.\r\nI recommend this, not because it's good, but just for those who like to experiment with the shows they watch. The art style is a little strange but you do get used to it over time, I like it since it's kind of a break for me from all the big buff men of the shonen genre. This would have beenreally good if the story was planned out better, the concept had a lot of potential but it really just wasn't executed very well, and a few of the 'plot twists' are easy to guess beforehand.\\n\\n\r\nI'll give this a 6/10, because although its not great, I did actually enjoy watching it.\\n\\n\r\nAlso: On MAL there are only 11 episodes, but if you go over to the Crunchyroll site there are actually 13, however the other 2 don't really do much except set up for the 2nd season (which we never got).",
            "date": "2019-02-03T02:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 300778,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7597296.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KashiNoKuma",
                "username": "KashiNoKuma"
            },
            "url": "https://myanimelist.net/reviews.php?id=300778"
        },
        {
            "content": "I watched the anime on watchanime.info and there were 13 episodes and not 11. \r\nthe storyline is quite basic, but overall it was amusing. if your are looking for something just to pass time, and give you some enjoyment it is a good anime. But it is not something I would rewatch though, since it is quite basic. But the intruduction of A-loan did make it more interesting in the end.\r\nthe characthers are not that intriguing exept for shiito and his backstory. \r\nwhen the main character Michiru turned out to be the only one able to understand the reaper Mr. Zarame, i was hoping shewould prove to be a more strong charachter, but she does not untill the very end. and up untill then she basically just follow shito and chika around.",
            "date": "2018-12-15T11:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 295815,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hjoerdis",
                "username": "Hjoerdis"
            },
            "url": "https://myanimelist.net/reviews.php?id=295815"
        }
    ],
    [
        {
            "content": "Zombie Loan doesn't have any new things to offer. Well, I guess just like any other animes because their stories had just been recycled over and over again. But, as an otaku, you never get bored watching them especially if you're really massively entertained!\r\nWell, of course, the heroes here save lives and benefit from it. And because there are two male leads here, you cannot avoid some Uhmmm..moments here and there..well, good thing there's no special Uhmmm between them. Kinda cute the petty fightings here and there but i'm kinda not into Uhmmm moments between two maleszz..Hek Hek. ^_^ Especially with the Uhmmmm moments betweentwo girls...Hek Hek ^ _^ Please, not with this one. Michiru is so cute with any of the male leads, so let us leave it like that.. Hek Hek ^ _^\\n\\n\r\nYou know what I'm saying if you, of course, have seen the series.\\n\\n\r\nWell, anyways...\\n\\n\r\nThe characters are really likable. Sure there are clichez all over the place, but I never get tired of it. I never thought that Michiru would be a likable character. Coz you know, I'm always into strong-willed females with great personalities that could absolutely make womanhood proud. Hek Hek ^_^ Luckily she changed but her weakness is still adorable. I really really like cut li'l moments between her and Chika! Wow, I get his name right. Chika,Shito, Michiru. Chika, Shito, Michiru. Chika, Shito, Michiru... Hek Hek. I'm getting tongue twisted with their names...^_^\\n\\n\r\nSadly, the theme songs weren't that great. Well, not even good either. They are so upbeat and kinda crazy. I'm not getting it. But there's one insert song which I liked, and I'm gonna search for it.\\n\\n\r\nWhat can I say more? Well, it had been a short trip. It, of course, needs to add more episodes. It left you hanging. I would love to see more of the trio and their eventual romantic affairs..Hek Hek ^_^ I WANT TO SEE MORE ZOMBIE LOAN\\n\\n\r\nFrom a Believer that says this anime deserves a shot!,\\n\r\nMe ^_^",
            "date": "2009-03-27T19:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 13531,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119010.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/docalion",
                "username": "docalion"
            },
            "url": "https://myanimelist.net/reviews.php?id=13531"
        },
        {
            "content": "Zombie Loan is a fantastic, albeit short, anime that revolves around Tachibana Shito (Boy A) and Akatsuki Chika (Boy B) who were rumoured to have died in an accident six months before the story begins. Thanks to one of seven ferrymen (Bekko) from the World Fate Organization, the boys have been \"brought back to life\" through a contract known as a Zombie-Loan. Bekko runs a business (also known as Zombie-Loan, or Z-Loan for short) based on these contracts. Tachibana and Shito are now indebted to the ferryman and they must hunt zombies to earn the funds to pay off their debt within a year, orit's game over, and there will be no coming back a second time. \\n\r\nA great series with lots of action and supernatural references. I love how different mythologies and religious ideas were infused in this anime, allowing a wide audience to be able to enjoy it without to offensive feeling that some animes invoke when they play the religion card. The character development in this series was absolutely great and the overall animation was pretty good, too. I have to rate the sound low, though, for one reason: the opening theme song was utterly horrific. I listened to maybe thirty seconds of it, determined to give it a chance, before quickly skipping ahead to the actual episode. I found this series to be a little too short, but I think the original plan was to have it go for over twenty episodes, so I can't complain about it too much. The action sequences and storyline made this anime one of the greatest I've seen in a while, and I most certainly do recommend it to anyone who likes a good taste of action. Character relationships were well balanced in this particular series, including the surly Tachibana and the reckless Akatsuki (our main zombie-hunting boys). The bit characters were also pretty interesting in their own ways, though some of the lesser characters could have been brought out a bit more, such as the Chairperson of the Academy and her \"pet,\" Lyca. This series doesn't put too much out there for the shojou crowds, but it came across to me as something rather refreshing; finally there is an anime that includes guys, girls, action, sharp-tongues, a little taste of yuri, but not a whole lot of gushy confessions and lovey-dovey smooching. Actually, there were virtually no confessions or smooching. :D\\n\r\nAll in all, an excellent series that left me begging for more. \\n",
            "date": "2009-11-24T11:01:00+00:00",
            "helpful_count": 3,
            "mal_id": 20803,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/189380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Aysel",
                "username": "Aysel"
            },
            "url": "https://myanimelist.net/reviews.php?id=20803"
        },
        {
            "content": "Good for rainy days I guess. Every one I knew was telling me that this was a pretty good anime, so I sat down and made myself watch all 11 episodes. \r\nFirst off I almost quit halfway into the first episode because I personally HATED the art style. And still do to this day. And I'm normally not super picky about these things (I can usually get into a style like 2 episodes in), so me not liking an art style ALL the way through the anime is pretty weird. But you know-the quality of the art wasn't bad, it was just the style soI managed to get myself through this.\\n\\n\r\nThe story line seemed a bit cliché at first, but it gets better. The only thing I didn't really like was how short each arc was, but hey, it's 11 episodes. What do you expect. \\n\\n\r\nOverall, other than a couple of things here and there, it's not that bad of a series. \\n\\n\\n\\n\\n",
            "date": "2013-10-06T19:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 115853,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3228491.jpg",
                "scores": {
                    "animation": 2,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/WithTheSky",
                "username": "WithTheSky"
            },
            "url": "https://myanimelist.net/reviews.php?id=115853"
        },
        {
            "content": "Maybe some spoilers.\r\nThis anime is about a young girl who can see a black line around a persons neck the darker it is the sooner they are going to die. Story: 7, I gave this story line a 7, it's a really cool concept, however the zombies aren't really the whole infectious- destroy their brains to kill them. They're just people who died and are still living. I think what would have made this story better is if here was more episodes, the lack of episodes did make this anime have less of a plot to grow. \r\nArt: 7, there is nothing particularly special aboutthe art, the characters are quite lanky though.\\n\r\nSound: 4, I watched this a few months ago and the music hasn't really stuck with me; not very memorable. \\n\r\nCharacter: 6, There was bit of a backstory to some of the characters but there was no real development of them which happens in longer animes. (You can see a common negative theme here)\\n\r\nEnjoyment: 7, I watched it, it was okay, could have been much better, but it wasn't particularly bad; the fact the story was quite interesting made it enjoyable.\\n\r\nOverall I give it a 7, technically the average is nearer to 6 but still, I'm nice- the main improvement is for there to be more episodes.",
            "date": "2015-09-05T09:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 197865,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4625762.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nolifenocares",
                "username": "nolifenocares"
            },
            "url": "https://myanimelist.net/reviews.php?id=197865"
        },
        {
            "content": "It's a bit of a shame that Zombie-Loan had to end as abruptly as it did considering I did find it quite entertaining to look into. The premise itself was quite original where Chika and Shito are being loaned life as zombies in exchange for hunting evil \"illegal\" zombies. The show effectively mixes serious and comedic moments as it looks into the various dealings that Shito, Chika and the other members of Zombie Loan deal with, particularly the chemistry between Shito and Chika as they don't exactly get along much of the time in the series. The show does do well enough in fleshing outthe backgrounds of the two boys and Michiru and what led them to become clients to Zombie Loan thus it is easy to get some sort of connection with their characters. It also does well enough at covering the exact details surrounding zombies in the world of the series and the conditions surrounding Shito and Chika's deal in still being alive.\\n\\n\r\nHowever with the anime being based on ongoing source material, Zombie-Loan definitely leaves the feel of being incomplete. Some characters have their backgrounds hinted upon yet are never explored and there are some lingering plot developments left hanging such as the presence of several groups serving as adversaries to the Zombie Loan group.\\n\\n\r\nThe presentation to Zombie-Loan does come across as a bit subpar. While scenery and character designs do have a decent amount of detail with subdued colors that fit in well with the supernatural feel the series gives off, the animation noticeably takes shortcuts and the series is nowhere as fluid and vivid as titles like Death Note and Moribito that aired in the same year. While the soundtrack does its part with having insert music tracks that fit in with the mood of specific scenes, none of it really sticks out. Not to mention that the OP and ED musical choices can be quite grating to the ears and are best to skip through.\\n\\n\r\nOverall, Zombie-Loan proved to be enjoyable for me thanks to its original premise and chemistry between Shito, Chika and Michiru. However, it was quite clear this series had a bigger story that it didn't have the time to tell thus unless another season of Zombie-Loan comes out, the viewer is left to try continuing the series through the manga source material. It makes for a worthwhile watch, as long as you go into it knowing that you are only being exposed to one part of the series.",
            "date": "2011-06-13T12:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 37846,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=37846"
        },
        {
            "content": "Oh, what is there to say about Zombie-Loan? It's a bizarre idea smacked together with two completely opposite characters that frequently confess to hating each other.\r\nNow, I could find things to pick at with this anime all day if I wanted to, but I think the weirdest thing among all that I noticed when watching, was that I absolutely, completely, and thoroughly enjoyed it. I loved it! I couldn't stop watching!\r\nAnd if I look back on it with the view of someone trying to give an informed critique, it honestly doesn't make sense. There's a plothole a mile wide, actually there's really several plotholes, it'san off-beat idea, and yet still absolutely loveable.\\n\\n\r\nI'm not really sure how else to discribe it, but I would honestly and rigorously suggest it. I mean, there are all these wonderful zombies running around! And it's only 11 episodes. What more could you ask for?",
            "date": "2008-12-29T11:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 10771,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116793.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dreams-of-ivy",
                "username": "dreams-of-ivy"
            },
            "url": "https://myanimelist.net/reviews.php?id=10771"
        },
        {
            "content": "This anime, along with Claymore may be the most disappointed anime of 2007. I found many similiarities between them.\r\nStory: much like Claymore, it started pretty good: a unique, not very cliched story, though the monster theme is not very uncommon; anyway, it was good. And it was excited untill 5 minutes before the ending... The anime did not even end; it just started! It was not even an open end like Jigoku Shoujo (which many people do not like but I do). Since the story did not end, it's only 4/10. And not to mention, we got yuri actions around. No good!\r\nArt: The animation waspretty good. The colour looked a little dull and unlively but it fit the theme of the anime. The motion was fluid. Generally, there is not much to complain about the animation.\\n\\n\r\nSound: decent but not impressive. Both the opening and ending theme were not particularly good it it sounds OK. 7/10 for sound.\\n\\n\r\nCharacters: my criteria for good characters is: not cliched. And Zombie loan made it. It was not cliched. It was quite unique and good. The only thing that held the character point back was the girl with &quot;yuri&quot; personality.\\n\\n\r\nEnjoyment: yet another similiarity to Claymore. The story was enough for you to enjoy until the 5 minutes before the ending. Once it hit the ending, it made you feel disappointed and think &quot;what the hell the show was all about? Did it end, or just started?&quot;. The anime were supposed to be a stand-alone or promotion for the manga. So bad that I had to give it a 5 for enjoyment.\\n\\n\r\nOverall: this show is just scarely above average. I burned the whole thing to DVD and locked it up forever, never to watch again. Unless they made it the way it should be.",
            "date": "2008-02-04T05:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 2311,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35392.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Deadman1709",
                "username": "Deadman1709"
            },
            "url": "https://myanimelist.net/reviews.php?id=2311"
        },
        {
            "content": "Zombie-Loan is overall a good anime. It consists of 11 episodes. The storyline is quite clear, although the ending didn't really end the story for me. Maybe there will be a second season, or the makers just decided to let the viewer decide for themselves how the story would end. The art is very nice and detailed, and the sound and music was very appropriate in each situation. The characters have a clear personality, but they aren't all flat characters because some of them change a little throughout the story. In every episode there is humour, and that makes it enjoyable too! When a funnymoment occurs, the characters are drawn differently: more simple and that enhances the funny moments a lot, at least that's what I thought XD! Overall, and 8 because the story is good but I have seen better ones, too. There could have been some improvement to the story, in my opinion. But still, I would recommend watching Zombie-Loan: it is worthwhile!",
            "date": "2010-05-05T03:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 25751,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304300.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PhaiaFox",
                "username": "PhaiaFox"
            },
            "url": "https://myanimelist.net/reviews.php?id=25751"
        },
        {
            "content": "TBH it was a good waste of time but... it was a horrible anime. 1st: characters \"ChiruChiru\" shallow soooooooo shallow no development until the vesy last episod, Shito. ((youll know what im talking about)) \" old OOOLLLDD \" 0 character development. only thing he seems to want to be alone. and care about some \"AI\" created lifeform.. Chika: 0 character development \" pretty new \" only one making any sense but still boring. 2nd basicly NOTHING HAPPENED! NOTHING at all! they hunted 1 zombie ( teacher) then the next (butterfly) then shwoosh they where in a \"tag game\" with another \"zombie team\" then SWOOOSH itsall over.. got to be hones here and say it was pretty much the worst anime iw seen in a good while ( not the worst ever, but in a while ) every once in a while we step by a bad anime. but this takes the price i expected so much more from watching it.. wow all i will say.. dont get your hopes up. but watch it if you got time to spare and judge if for your selves this is my opinion not yours! every one says its a good Zombie anime but NAH NAAAAAAH its not.. you got to see like 4 zombies. then the rest is human or other \"IMO\" not Zombie.. if you want something like HOTD this is not what your looking for or if you want something like kore wa zombie desu ka this is not for you....  this is a faint beginning with no ending",
            "date": "2015-09-26T00:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 199628,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4395711.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/xqzzdbd",
                "username": "xqzzdbd"
            },
            "url": "https://myanimelist.net/reviews.php?id=199628"
        },
        {
            "content": "Ok, Zombie Loan isn't really a, say, \"popular\" anime. It hasn't gotten noticeable reviews and doesn't really stand out as a \"special\" anime. It fits in with the common theme of resurrecting the undead and fighting Zombies and demons, which so hasn't been done before... *Cough* High School of the Dead *Cough* D. Gray Man *Cough* Blood Lad... \nStory: 6; This is why\nThe plot line for Zombie Loan is pretty creative, seeking resurrection for individual reasons after dying in a sad accident. There are just too many familiar plot elements that are seen everywhere in all undead demonic zombie anime... Also, the plot is allover the place. Where does it even start?!! The transition from arc-to-arc is so confusing sometimes with a whole bunch of added elements to keep track of! I had to watch that \"Crushed Butterfly Code\" part 4 times to understand it, and I still see it as a whole shitload of unnecessary elements. It's like the author thought of this one day and wanted to show off his \"cleverness\" and just added it, cause, \"who gives a fuck anyway right?\" But seriously, elements were added at the last moment and when they weren't even needed and that just turned the anime into one big clusterfuck of unrelated SHIT! And the ending was the worst out of every anime I've ever watched, y'know, I'm actually gonna switch the plot to a 5, cause I just realized how terrible it is.\\n\\n\nArt: 8\\n\\n\nIts kind of like a mixture between a lazy Death Note and a lazy Code Geass. It's alright, compared to stuff like Lucky Star and the dark colors really set the mood. No one was wearing bright colors in the whole anime. The brightest color I saw was Michiru's hair. And I LOVED IT!\\n\\n\nSound: 7\\n\\n\nThere are actually pretty good moments in the transitional soundtrack of this anime. The action scenes seemed to be pretty well recorded and matched with the right music, and the opening sounded a lot like Trigun, which I sort of like b/c I LOVED the Trigun opening! But its really nothing special if you think about it...\\n\\n\nCharacter: 5\\n\\n\nI'm sorry, there were way too many characters for such a short anime. It was a SIN! Every episode, a new character came in, like that red-haired dick in episode, like, 9. Like, wtf? And those three characters at the end! You didn't even need them! They were the reason the ending sucked! omg, this anime did not know it's limits when it came to character! It was overwhelming! Michiru once again plays that archetypical girl who can't do shit for herself and always gets in the way! That's pathetic! And then she follow them around for the rest of the anime! (It doesn't make sense, I know, just watch it for yourself and you'll see) \\n\\n\nEnjoyment: 7\\n\\n\nB/w the clusterfuck rushed plot, and annoying, superfluous characters, I actually might've enjoyed just a little. I mean, I liked some of the action scenes and the antagonists. But that's really all I have to say about that... Not enough for redemption though... sorry Zombie Loan.\\n\\n\nOverall: 6",
            "date": "2013-09-21T19:35:00+00:00",
            "helpful_count": 2,
            "mal_id": 113735,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2086123.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/HattiewithSugar",
                "username": "HattiewithSugar"
            },
            "url": "https://myanimelist.net/reviews.php?id=113735"
        },
        {
            "content": "i loved this anime!!!! but i am kinda sad because there is only 11 episodes. the zombie loan special ova are basically just continuum of this anime...i really wish they would make a second season for this anime... i was a little disappointed that it ended....but from the ova.... i notices that the green hair guy from A-Loan is going to fall in love with Michiru!!!! and the other girl is jelly!!!!ahhhaha......i love this anime...... PLEASE WE NEED A SECOND SEASON!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "2013-01-21T18:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 84421,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2028679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kaito_Kuruki",
                "username": "Kaito_Kuruki"
            },
            "url": "https://myanimelist.net/reviews.php?id=84421"
        },
        {
            "content": "The concept of the story is what drawn me to this particular anime. It seemed so unique! If only they could have actually put in some more effort in to making it live up to it's full potential, this anime could have been really amazing.\r\nThis anime leaves a lot to be desired, it sorta follows the vague description to the dot, I found myself lacking any kind of emotion while watching this. It made me smile and let out a small chuckle hear and there but nothing at all like I expected. It just makes you wish they would've done 'this' or 'that' to improve....\r\nThoughthe concept was interesting, they failed to actually deliver it which I found fairly disappointing\\n\\n\r\nAs for art, I couldn't say it was bad, It was pretty decent actually. I didn't have much issues looking at it, nothing was particularly 'amazing' about it but in the end I actually liked all the visuals giving the art category a 7. \\n\\n\r\nStarting off I'd like to say I actually thoroughly enjoyed the theme to this anime, aside from that though I don't have much to say about the sound. To describe it I'd just have to say it was kinda just....there. Very forgettable. \\n\\n\r\nCharacters were pretty stereotypical. Hot-headed, cocky boy teamed up with cool-headed, equally cocky boy and a spazz of a girl thrown into the middle. Nothing really special in this category. If you don't mind the traditional set-up, you probably wouldn't have much to complain about. \\n\\n\r\nThis anime I would suggest for a day you really have nothing better to do. Admittedly, I struggled at points to finish it-I had to really push myself to get through the last 3-4 episodes or so. It had it's enjoyable parts and I can see it being perfect just to pass time. Otherwise, I'd just hold it off. Overall though, I'd give this anime a 6. \\n",
            "date": "2011-11-24T20:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 47993,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/428603.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Roulettex3",
                "username": "Roulettex3"
            },
            "url": "https://myanimelist.net/reviews.php?id=47993"
        },
        {
            "content": "mmmmmmmmm zombie is a one of a kind anime \r\nits story and theory is unique and different from other animes \r\n(if u like mystery or detective stuff u should watch zombie loan, oh and there is also a little bit of ecchi, horror-ish and comedy bit in them) \r\nit is kinda hard to explain what this anime is about (since its a one of a kinda and also since that it isn't fully complete)\r\nzombie loan is a pretty good anime,   the art, story, themes, etc was good as but the only bad thing (very bad thing) i guess is that the anime onlywent for 11 episodes (with 2 ova s) and there is no real ending and you don't really get the whole thing yet.\\n\\n\r\nbut it is pretty addictive and enjoying to watch \\n\\n\\n",
            "date": "2009-07-06T09:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 16505,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/141663.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Takundazwa",
                "username": "Takundazwa"
            },
            "url": "https://myanimelist.net/reviews.php?id=16505"
        },
        {
            "content": "Zombie loan is a very good example of low budget anime. I personally thought all the characters were great and the story managed to get the main characters' back stories told well, but unfortunately they were rushed and therefore not really.... big moments threw the series. The villains in this anime were good, but sadly as soon as they appeared, they were gone and the same for their victims. If they had made this series twice its length or more, I believe it would have be a very good anime. The art jumps about a lot between anime style to cartoony quick style.... don't knowif there's a name for it  but I personally enjoyed it. I thought it made it more humorous and creative. The main character is enjoyable  and seems to get better as the series goes along and I'd say if it got longer she would have become a bad ass character ..... but still goofy  in her ways. There is still a lot they could have done with these characters  and I am hoping for another series. A less rushed one. All in all a good anime but sadly rushed story and the sound was nothing special, but I did like the closing credits.  \\n\nHopes this helps \\n\naarelf",
            "date": "2013-09-13T09:26:00+00:00",
            "helpful_count": 2,
            "mal_id": 112793,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3036563.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/aarelf",
                "username": "aarelf"
            },
            "url": "https://myanimelist.net/reviews.php?id=112793"
        },
        {
            "content": "michiru kita was you average high school girl, with an unusual gift. she has shinigami eyes, they allow her to see a black ring around peoples necks. as the ring gets darker the person is nearing death. michiru dislikes the power and wears glasses that hide the rings as her parents died with them. one day michiru bumbs into chika akatsuki and shito tachibana during school. to her suprisement both of them have black rings around there necks, later that day she is at school late at night and sees chika and shito, she is shoked to see them swap hands and weapons apear fromthem.not wanting ther secret to be exposed they think upon killing her but instead make her join the zombie loan, as they have use for her eyes. they explain that the zombie loan is were people who have died (as the two of them died in an accident) make a deal to have another chance at life. chika and shito, along with many other zombies work for the zombie office hunting down other illegal zombies. michiru ends up joining the team for good but little did she know about the danger she was getting into.",
            "date": "2009-04-10T15:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 14021,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/FuckedUpProfile",
                "username": "FuckedUpProfile"
            },
            "url": "https://myanimelist.net/reviews.php?id=14021"
        },
        {
            "content": "I found this anime from a meme but never had the chance to watch it, but the name Zombie Loan was there in my mind so i could watch it someday. Originally this was set for 20+ episodes but for unknown reasons it was reduced to 13. \r\nStory: Nothing amazing to expect, you have the typical kanojo who sees rings of death and two zombies who are part of an organization that helps them to regain their lives. And they get on with their jobs, events here and there adds more plots to the story. IF it did have 20 or maybe 50 episodes, thisanime would have been interesting to the max.\\n\\n\r\nArt: In the end it didn't sound or seemed like a debut but to promote the manga, so i guess the art was a bit off.\\n\\n\r\nSound: Openings were good, music was done by the winner of the 2014 Tokyo Award for SNK so i wasn't amazed that the music was superb. The voice acting was very well done. \\n\\n\r\nCharacter: Even though the character's should have been like life less corpses  (one character was like that) they really did well on the characters, especially Shito, many mysteries are evolved around them, and the Collaboration of Destiny is kinda interesting between them. \\n\\n\r\nEnjoyment: I really enjoyed this one. There were class B comedy moments and hints of Yuri, but it really had the necessary stuff to make it more enjoyable in the end. \\n\\n\r\nOverall: Like i said, if it only had some more episodes..\\n\r\nThe most interesting stuff  started to happen when the anime was ending and i was intrigued to find out what's going to happen next, but basically you'll have to find that out in the manga. It was worth the watch though.",
            "date": "2014-05-07T07:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 142575,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1310853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/greatyu",
                "username": "greatyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=142575"
        },
        {
            "content": "Basically, the anime is about a shy girl- Michiru, who posseses a unique ability to see rings around people's necks. The darker the ring, the sooner the person will die. she soon meets two (sexy) guys: chika akatsuki and shito tachibana, who both have jet black rings around their necks, and that they were supposed to have died in an accident six months ago.With the help of the Zombie Loan loan office, they were given a second chance at life, they be able to pay for their debt by doing the work of Shinigami and killing malicious zombies, and they ask Michiru to assist themwith their work.\\n\\n\r\nin this anime, there are 4 things that make it similar to death note: one is the supernatural creatures roaming about, two is the level of the characters' intelligence, the &quot;shinigami eyes&quot; that michiru posses, and, of course, a crazed maniac trying to bend the laws of nature (you'll know what i mean near the end of the anime). overall, it's a cool anime: you got comedy, action, awesome songs, handsome-looking characters (i mean the male ones), blood. what more could ya ask for? Too bad it leaves you unsastisfied when it's over.\\n\\n\r\nWARNING: Umm....yeah...about the final episode...WORST ENDING EVER.\\n",
            "date": "2008-07-17T16:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 6367,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77333.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/i_luv_ohshc",
                "username": "i_luv_ohshc"
            },
            "url": "https://myanimelist.net/reviews.php?id=6367"
        },
        {
            "content": "At the beginning, I was delighted to find a well drawn anime with a vigorous original plot. The episode wherein they discussed about the Tetragrammaton was indeed intriguing since I'm a fan of religious conspiracies and history myself. However, the last four episode proved to be the demise of my excitement and enjoyment. Sadly, the anime wasn't able to grasp its true potential since I truly believe it could have been better. \r\nBut for utmost respect and humility, I do believe this anime is worth one's time.",
            "date": "2009-06-06T06:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 15524,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/190747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DBayoty",
                "username": "DBayoty"
            },
            "url": "https://myanimelist.net/reviews.php?id=15524"
        },
        {
            "content": "This is actually a pretty good anime. I as soon as I watched the first one I was hooked.\r\nThe plot was interesting and the art wasn't that bad either. I love how the characters all have their own different personalities that really stand out.\r\nAlthough, the ending was a bit of a disappointment. It was a bit like those endings that leave you hanging, but that was expected since the manga wasn't done yet. But I think that they really should continue this series. If they did then I would definately watch it! :)",
            "date": "2009-01-09T16:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 11279,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/xilynnx",
                "username": "xilynnx"
            },
            "url": "https://myanimelist.net/reviews.php?id=11279"
        },
        {
            "content": "Review 15: Zombie Loan. (let's hunt them all)...\r\nthis series can be considered quite an old series of anime compared to others like K and Blood-C (uhhhh, so disturbing).\r\nThe series is obviously about Zombies, but non of them are really the kind of Zombies we would think about.  \r\nThese Zombies are obviously dead people, but they don't go around eating peoples brains like we see in modern games and films. These Zombies are the type of Zombies who kill the Zombies that would usually eat peoples brains. (it confused me to)\r\nWe see the main character Michiru Kita as a normal high school student in thebeginning, with her so called 'Friends' using her o run errands for them all andbeing used by them constantly. After the first episode we realise that thi girl is not normal and she is one of the only people who has eyes called Shinigami eyes. In this series the Shinigami eyes allow you to see either black or grey rings on peoples necks. If the ring is Black then the shinigami will soon take their life, if its grey it means that their life can be lived a bit more longer.\\n\\n\r\nThe other two main characters are Chika and Shito. These two even though allies, hate each other and have to pay off their loan in order to get their lifes back. These two are quite mysterious characters, as they both have their own secrets, they hate each other and they can both take off their right hand. when they do this their weapons are shown. There are distinct differences as Shito is only able to guide souls to hell before the Shinigami clams them whilst Chika can only guide souls to Heaven.\\n\\n\r\nThese three characters, and a freaky other bunch, make up the story line as they are the only ones who actually do the whole zombie hunting thing. But later on their appears to be another mysterious group who are creating Zombie Loans illegally.\\n\\n\r\nThe animation in the series does seem a little outdated for me, but the story line and characters tick all of the boxes for me. The only down side is that the fighting scenes are quite short and usually interuppted by their arguments or someone else getting involved.\\n\\n\r\nA great watch for all ages no matter what type of anime your really in to.\\n\\n\r\nSunday 20th January 2013. 2:25 pm. ~AmyXxx",
            "date": "2013-06-09T03:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 100371,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684043.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AmyWatkinson",
                "username": "AmyWatkinson"
            },
            "url": "https://myanimelist.net/reviews.php?id=100371"
        }
    ],
    [
        {
            "content": "the best way the explain zombie loan is an incomplete series from my pov\r\nits an overall  \r\n1)story really has no ending \r\n2)to many not solve problems (you know what i mean when you watch the anime )\r\n3)action!!!!!\r\n4)NO ROMANCE  \r\nthat's basically it this anime kind of stands out from all the others because the other anime when the main character dies and comes back to life for some mystical reason they usual don't have to pay a loan that is what i call original but if the anime would have ran longer like 20 episodes it would have been okay i rated based onit incompleteness and the entertainment the conflict and answer to the conflict lastly the major heart stoppers they really weren't none    \\n\\n\r\nOVERALL 6 .>__",
            "date": "2012-02-23T22:52:00+00:00",
            "helpful_count": 0,
            "mal_id": 54637,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441911.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daisyfang4",
                "username": "daisyfang4"
            },
            "url": "https://myanimelist.net/reviews.php?id=54637"
        }
    ]
]