[
    [
        {
            "content": "This review contains mild spoilers. \r\n--------------\r\nSeiren offers an insurance policy against the inherent risk of harem anime. You don't have to worry about best girl getting her heart torn to shreds by some milktoast dude choosing the worst possible option. Instead, the milktoast dude chooses every single option in different timelines. Everybody wins!....or do they?\r\nWhat Seiren gains in having multiple routes it loses in meaningful character progression. You won't feel the ultimate satisfaction from watching two lovers grow together over a dozen episodes nor is there any conflict to set up an emotional payoff. This problem is further compounded by boring character designs barely distinguishingeach heroine from the other and the bizarre decision to not have the most interesting girl, Hikari, end up in a relationship with Shouichi. She decides it's more important to focus on her career and never talks to him again until a random five year timeskip where they run into each other in a shop, The End.\\n\\n\r\nShouichi is your standard harem protagonist with zero motivations, zero backbone and zero backstory explaining his personality. There's absolutely nothing going on in his life aside from these random hot girls who want his dick. There's no reason to give a fuck about him and his relationships. Why should anyone root for his success?\\n\\n\r\nIn Seiren's spiritual predecessor Amagami SS, lead character Junichi got stood up by a date on Christmas. The pain from that night gave him a complex about being rejected. We as viewers were given a reason to cheer for his success, bringing a level of catharsis to each arc where he got over his mental hurdle. Amagami SS had better arc resolutions, better designs, 26 more episodes to explore it's concept and most importantly - better girls. There is more personality in the hair of Kaoru than anyone in Seiren altogether.\\n\\n\r\nThere is still merit in watching Seiren if you desire a basic eroge game styled rom com. The girls are cute. The OP/ED themes are catchy. There are certainly some beautiful moments, most notably the underwater kiss in episode 4. Seiren has good qualities, they're just interspersed in an overwhelming dredge of crap that only the most tolerant of romance fans can hope to shift through. If you aren't in that crowd - avoid this like the plague and go re-watch Amagami & Kimi Kiss Pure Rouge for your fix of a satisfy all romance anime.",
            "date": "2017-03-23T10:58:00+00:00",
            "helpful_count": 117,
            "mal_id": 243255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/259533.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/84DaysWithout",
                "username": "84DaysWithout"
            },
            "url": "https://myanimelist.net/reviews.php?id=243255"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nBrace yourself, this is basically a long rant. My beliefs and score are subject to change as the anime goes on.\r\nFirst of all, I WAS excited for this anime, just as I was excited watching Amagami SS. They both follow the Visual Novel-esque story telling that allows each main girl to have their ending with the main character. Unfortunately, Seiren disappointed me throughout the entire first arc, and I will probably drop it if the second arc doesn't impress me. I'll be reviewing in order of (personal) importance, as always spoiler alert.\r\nART- 4: The art is fairly standard. Warm colors with lighttones for the characters and backgrounds. The main male characters look fairly generic and the female main characters actually seem pretty pleasant, if a little bland. There's nothing off about the art, but nothing \"great\" either.\\n\\n\r\nMUSIC - 3: The fact that I don't remember any of the music/didn't stop during scenes to comment on it means it wasn't really memorable in the first place. Nothing really stood out.\\n\\n\r\nSTORY/CHARACTER (Their problems go hand in hand) - 2: \\n\r\nHere's where it really starts to fall off.  Amagami SS explains the protagonist's backstory, it helps sets the pace for his intentions. There is no \"backstory\" for any character whatsoever, motivations are set as \"I'm a high school student who doesn't know what I want to do in life.\" It's a fairly bland and common story, nothing super unique. The story seems to be the MC learning what he wants in life through his experiences with his love interests.  Although this isn't a bad story in and of itself, it is presented terribly. Most of the MC's initial aspirations come off as half-assed. Not only that, the influence from his love interest is minimal (at best), and hardly pointed out throughout his supposed \"growth\". As for \"growth\" I'll separate it as best I can, \"character development\" and \"relationship development.\"\\n\\n\r\nFor character development, the female lead (Tsuneki) gets absolutely no development whatsoever until the last episode of the arc. At this point she suddenly decides that everything she went through for the MC helped her figure out her calling in life. The MC, on the other hand, is completely inconsistent throughout the story, and many of his actions hardly make sense until the very end.\\n\\n\r\nIn a romance anime, the relationship development aspect of the story is the most important. Their interest is made expressly clear throughout the episodes. The progress they make is mainly shown through random outbursts the MC has that make Tsuneki blush, and Tsuneki randomly flirting with the MC and doing things for him a mother or wife would do.  They do have some cute moments, but nothing I could consider \"progress\" until the very last episode where they kiss and talk about the future. \\n\\n\r\nIf the main progress in a character (Tsuneki specifically) AND a relationship comes in the last episode, it spells a recipe for disaster. That is simply what the story and characters are. The premise is bland, the development is close to nonexistent, the MC is inconsistent and I see no reason why she falls for him.\\n\\n\r\nThe worst part is, by far, the \"closure\" of the first arc. Seiren threw Amagami's \"closure endings\" out the fucking window with a friend-zoned MC and a \"Fateful encounter years away with no real conclusion.\" I understand the whole \"open-ended, you make your own ending\" thing but it literally throws what little progress they made into the air and crumbling back down. It's an entire reset to their relationship, which rarely works.\\n\\n\r\nENJOYMENT - 3: You really think after coming this far I'm gonna say I \"enjoyed\" it? Nope. I've enjoyed medical procedures more than going through this cringe worthy mess of a story.\\n\\n\r\nOVERALL - 3: Absolutely nothing in the anime goes above what I can describe as \"decent\", and the most important aspects of a romance story ended up as the worst offenders. I'm dreading continuing it and may change this review depending on the future stories, but at the moment I can't say anything good about this anime. \\n\\n",
            "date": "2017-01-27T22:27:00+00:00",
            "helpful_count": 113,
            "mal_id": 239282,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6013074.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/-Crucival-",
                "username": "-Crucival-"
            },
            "url": "https://myanimelist.net/reviews.php?id=239282"
        },
        {
            "content": "I felt compelled to write a review simply because of all the negative reviews. The negative reviews are absurd for this anime. Most sound entitled simply because the characters and plot didn't go according to how they wanted them to go or meet their benchmark expectations. \r\nThe reality is, if you can't go into a new anime without expectations or comparing to some of your other liked anime, you'll never enjoy it. The anime is still on-going so I'll provide the critique I have so far. \r\nArt: Nothing special, but nice. The characters do have a unique look to them, a little sharp on theedges, but nothing to complain about. It's enjoyable art. \\n\\n\r\nPlot: The plot has been nice. It's a High School Romance setting with a sprinkle of Slice of Life. The story develops smoothly and naturally. The protagonist is a cringe-watching character that gets nervous around girls. His main focus is on graduation exams but encounters a girl that playfully teases him. Due to pretty realistic events that could be seen in real life, both characters are put in situations to develop their relationship. They slowly, but naturally began to develop feelings for each other. First as friends and then as something in between a confession and friendship. The plot highly focuses on the development of their relationship so that's what's special about the first few episodes. Although it does not lead to anything, I think that is the uniqueness of the plot.\\n\\n\r\nThis is not a plot that jumps around or with a random sudden romance. \\n\\n\r\nCharacters: The two main characters are the stars here obviously. The characters eventually develop romantic feelings towards each other, but what's nice about it is that's it's pretty realistic and natural through continued interaction and getting to know each other. Unintentional and unexpectedly, the female character develops these feelings. The guy already had some kind of feelings for her with low expectations, though. A friendship seemed as his expectations. As hints and signs develop, things seem like they're going to go somewhere, but they don't. People might be upset about that, but is something that can definitely happen for the reason it did happen. \\n\\n\r\nEveryone else does a good job in their roles. Characters show humor, kindness, jealousy, interest, etc. It's a fun watch and would recommend so far.",
            "date": "2017-02-02T13:28:00+00:00",
            "helpful_count": 64,
            "mal_id": 239754,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3434419.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ATasteofAnime",
                "username": "ATasteofAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=239754"
        },
        {
            "content": "Teenage hormones are a powerful thing. The trials and tribulations we went through in our adolescence involving relationships and such can seem trivial by comparison to our current lives, but when we were in the moment they seemed so monumental. Whether it was timidly asking a girl out for the first time, or the lucidity and nostalgia of a summer romance, not much can compare to our teen years. Seiren randomly popped up on my radar before the winter season started (probably due to the plethora of attractive female character models), and after its conclusion I can assuredly say two things:\r\nAs a married man inmy late twenties, I am clearly not this show’s intended audience\\n\r\nBeing a teenager is awkward, and it doesn’t translate to quality entertainment\\n\\n\r\n“Seiren”, meaning honest in Japanese, is just that. It tells three girl-centered anecdotes from highschooler Shouichi Kamita’s life, a life in which there are plenty of perverted inner monologues and awkward exchanges with females. The writing is actually pretty accurate given the subject matter, but it doesn’t make the anime any better. Kamita gets nervous around basically every girl he meets (surprise!), with a relatively introverted attitude and a love for gaming. He’s also not that great of a student, or good at pretty much anything he does.. So he’s essentially the anti-Gary Stu character. Each story gradually develops a teenage romance, one scene at a time. Although the result of each relationship is often disappointing or lackluster, the buildup is the real focus of the writing.\\n\\n\r\nAs boring or predictable as Seiren is, the writing is quite accurate. Whether it’s the slow burn of the romance itself or the fickle nature of Kamita’s female counterparts, the writers nail teens in a nutshell. Awkward, irrational and hormonal. That’s not to say that Seiren has a “good” story, because there’s only so much enjoyment one can have in watching two people fumble over themselves for 20 minutes at a time. There’s lots of eye-rolling to be had here. Not to mention the melodrama is thicker than Chun-Li’s thighs. Oh, and the constant blushes emblazoned on the face of Kamita and his peers is mind numbing.\\n\\n\r\nThe main problem I have with Seiren is that the subject matter is just, dull. There's quite a bit less comedic dialogue than a normal slice of life, and the relationship building and love scenes aren't nearly as strong as a romance anime. It's essentially having the worst of both worlds, which for entertainment’s sake, is never a good thing. Would you want to watch a show about your awkward teenage years with lots of missed connections, social inebriation and awkward conversations? I think not. It's why we get older and grow up (at least some of us do), and I can't imagine many of us would care to relive that profound age of existence. It'd be one thing if the relationships “went” anywhere, but again they are stifled by abrupt changes in the way someone “feels” about moving forward. That or the writers play out “what-if” scenarios in which Kamita succeeds in his apparent life goal of becoming a school bus driver. I can't make this stuff up.\\n\\n\r\nCharacter wise, Seiren makes an attempt at creating diverse and complex characters. Unfortunately the anime falters in this respect as well. Although Kamita represents an awkward high school teenager decently, this is the same old character trope we've seen time and time again. He's virtually indistinguishable from some other SoL protagonist I've seen in the past, and the repetition is really starting to get tiresome. Tsuneki is quite easily the most dynamic character in the entire series. She's popular, pretty and wants everyone to know it, most notably Kamita… who for some outlandish reason she acts like a tsundere to. Apparently all it takes for her to fall for him is a few gauche interactions at a summer study camp and him accidentally popping a boner in the men's washroom. But this sizzling romance is quickly extinguished when Tsuneki makes the abrupt announcement that she wants to pursue life as a chef… which evidently can't involve boys whatsoever. \\n\\n\r\nNext up Tooru Miyame, or as I like to refer to her: every teenage pizza-faced nerd’s unicorn. A hot girl that plays videogames, and is actually good at it? Not to mention that she’s single and ready to mingle with our main protagonist? Ok, this one is straight up in fantasyland. Through my time in YouTube I've actually met some decent looking girls who are into gaming, so that part’s not entirely out of the question. The most implausible factor is how easily she is drawn to the charismatic Ken doll himself. The writers attempted to use the two character’s common interest of video games to create a relationship between them. The result? Unbelievable at best. They even go as far as to paint a future with a child involved at the conclusion of the arc. This is just bad writing. \\n\\n\r\nLastly, we have the obligatory “young crush”. Every guy that's ever become a senior in high school can admit to having an interest in a younger girl. That's just how testosterone works. In effect, the storyline is probably the most believable of all three. A cute underclassmen shows up, is extremely impressionable and wants to experience the elusive romance she's read about in teenage manga. The result is a morally questionable relationship that is never meant to go anywhere and spawns a “what if?” scenario of its own. The least entertaining of the three arcs, but probably the most believable. It's a shame they saved it for last.\\n\\n\r\nThe animation and art style in Seiren is attractive in some scenes and dull in others. The inconsistent nature of this plagues the side characters because their models are virtually carbon copies of each other. This could make for some confusing moments in the series where you're not entirely sure who's talking at a given moment. Luckily the girls are pretty cute, which is what I think initially brought me to the show. It's okay, but we should be a bit more detailed in 2017.\\n\\n\r\nThe sound is pretty atrocious. Neither the opening or the endings were really that convincing in making me want to watch the show, in the background music is virtually absent. The voice acting is mediocre, and really could've benefited from having a big-name actor accompanied to the anime. It was like listening to the lite version of your standard slice of life series.\\n\\n\r\nUnless you're a glutton for punishment, or really enjoy watching teenagers stumble over there words professing their love for each other, I would say avoid Seiren at all costs. It can be quite boring at times, and there isn't anything in service to take your mind off of things. Combine this with blend art in nonexistent music and you have a recipe for a snoozer. this is not a show I can recommend to anyone, and is possibly the worst series I watched this season. As always, thanks for checking out the review and be sure to look out for my other winter 2017 reviews this is not a show I can recommend to anyone, and is possibly the worst series I watched this season. As always, thanks for checking out the review and be sure to look out for my other winter 2017 reviews!",
            "date": "2017-03-23T11:46:00+00:00",
            "helpful_count": 37,
            "mal_id": 243259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3895399.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/themegamancave",
                "username": "themegamancave"
            },
            "url": "https://myanimelist.net/reviews.php?id=243259"
        },
        {
            "content": "If I had two words to describe Seiren, one would be “uninspired” and the other would be “bizarre”. I’ll be honest, I’m one of those consumers that values unquantifiable things like creativity, innovation and, if at the right time, something that pushes the boundaries of the medium.\r\nI don’t expect all shows to have this sort of thing, after all part of why I value those things is because of their sparsity within the medium. More often than not I just come across shows that have varying extents of those things and that’s definitely serviceable; I’m not expecting every show I watch to be the nextMushishi or Millennium Actress. Every shows at least nudges some kind of boundary within the medium and that alone is usually somewhat entertaining to watch.\\n\\n\r\nBut let me just say that the only boundaries Seiren pushes are the number of fetishes it can pander to. Boobs and ass are the prerequisites, but legs, feet, navels, urophilia, coprophilia, plushophilia, exhibitionism, BDSM, and whatever the scientific term is for arousal from chicks that look like animals. \\n\\n\r\nAs I said before Seiren is bizarre, it’s this high school romance show with a mixture of issues that range from inherently poor writing to flatout awful production—the way these episodes are organized and put together don’t even work as a saving grace for the show. Hell even the art quality goes to shit quickly. But this incongruous mixture of issues pulls out a show with just some bizarre moments… Man, I consider myself to have a fairly strong command of the English language, but I can’t help but keep circling back to this same word. It’s not even bizarre in an overt fashion like JoJo’s Bizarre Adventure or anything, it’s just these subtle bizarrities that spawn from things like retconning or overall poor writing. \\n\\n\r\nCharacters who are introduced to be petty and resentful, and warned about with lines like “oh you don’t want to get on her bad side, otherwise all the girls in the school will be against you” suddenly turn into magnanimous priests who bestow forgiveness upon those whose sins include lying, betrayal and infidelity. Things like that could really be justified with a small shard of personality, but because of lack of oversight it’s not thought about at all, and when they play out towards the end of arcs it just comes off as bizarre.\\n\\n\r\nAnother example of a bizarrity within the show that really got me laughing was when Kamita nonchalantly pulls out a fucking PSP from his trousers and starts googling the meaning of words mid-conversation. Like, if the Googling of things mid-conversation isn’t strange enough, why is he doing it on a freakin PlayStation Portable? What happened to smartphones? Then it’s put away and never mentioned again. What the hell? Why include strange things that raise questions and not address them? Who goes to school with a PSP in their trouser pocket?\\n\\n\r\nThe shows omnipanderance also compounds onto its already bizarre subtleties, you’ll have a character walking down the street, seemingly musing an innocuous thought that actually turns out to be a BDSM-fetish fantasy, and it’s just dismissed as normal! Where does this come from!? \\n\\n\r\nThe protagonist Kamita is a pussy, for a lack of a better word. Actually, there are plenty of better words, but I’m gonna keep calling him a pussy because this major league dork will cum in his pants at the slightest interaction with a girl. Girl does his laundry? Girl brushes her arm against him? Girl shows her bellybutton? Oh this is too much! I’m gonna bust! I legitimately hate Kamita because he represents this trend of anime protagonists that collectively form a malignant tumor within the medium, metastasizing throughout each and every genre whilst promoting this “stuttering, breathless beta-male gets hot chicks” agenda of sorts that is honestly just dreadful. Seriously, fuck this guy.\\n\\n\r\nThe show’s 12 episodes are evenly divided into three separate arcs, all involving a different female lead, with the a convenient time reset after each arc ends. This division of episodes is much better in theory than it is in practice, because for some reason studio Gokumi thought it was logical to begin with the best girl and then just regress into more and more generic leads and arcs as the show progresses. The first girl Tsuneki is by far the best in the entire show as she possesses a rare trait the other girls do not: a distinct personality.\\n\\n\r\nTsuneki is unique and dynamic, a character that exudes confidence and terrifying levels of spontaneity, always keeping you on your toes and wary of her next actions. She’s frisky and intimate, and is a character you won’t easily find in any other high school romance show. What this show does with her and her arc is not only laughably bad, but also just straight up bizarre. After Tsuneki it’s all downhill, the female leads just become more and more generic as the show progresses.\\n\\n\r\nThe next girl is Tooru, that one girl who has a smooth voice, and is cool, calm and collected at most times. She’s also a gamer girl, which apparently constitutes “original” in the eyes of studio Gokumi.\\n\\n\r\nThe finale female lead, I think her name is Kyoko or something (who actually cares) is by far the most generic; it’s like the writers just gave up at this point. A soft-spoken, innocent childhood friend who’s only meaningful development is understanding that yes, taking a male, childhood friend to shop for lingerie with you is indeed weird, and so is asking him if those rose-coloured panties look good on you. \\n\\n\r\nIf you hadn’t already guessed it, one of Seiren’s biggest problems is, like many other anime, pacing. Four episodes doesn’t give anyone much room to work with when trying to develop a natural, romantic relationship between two leads. Trying to replicate something as special as the blooming of love takes care and time, it’s something that stems from allowing characters to bounce thoughts and emotions off of one another and letting intangible things like their chemistry develop naturally. The spontaneity of the first girl, Tsuneki, made that task marginally easier, but four episodes is simply not enough. It’s frankly a little depressing how they took a great character with a stellar character design and an outstanding voice actress and threw it all out the window by trying to rush her whole relationship with Kamita in four episodes. \\n\\n\r\nSeiren is an uninspired, bizarre, clichéd high school romance show that manages to follow virtually every convention one would come to expect from the genre, only ever subverting it in unrealistic, often cringeworthy ways that leave you questioning the bizarrity of what you just watched. It is simply lame, pointless, represents many of the horrible trends in this medium and somehow adds onto that list with its incessant omni-pandering to fetishes. I wouldn’t recommend this show to anybody. \\n\\n\r\nI hope this review was informative and helpful. And maybe got you to smile a bit as well.\\n",
            "date": "2017-03-25T12:24:00+00:00",
            "helpful_count": 27,
            "mal_id": 243507,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5352541.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Adi",
                "username": "Adi"
            },
            "url": "https://myanimelist.net/reviews.php?id=243507"
        },
        {
            "content": "I was looking forward to this show. Not because of the content, the content seemed to be your standard toolkit for escapism and wish fulfillment for a certain subset of the viewer base (the opening makes that very clear), but because of the fact that this is the only original anime that I know of to adopt the omnibus format. The omnibus format is essentially where the anime diverges from one point in time to show multiple 'what-if' scenarios. In Seiren's case, the format shows us multiple arcs, each independent from each other, where the MC becomes involved with a certain girl in each arc.\r\nSeirenis more or less an indirect sequel to Amagami SS (which I dropped), an anime that adopted the same format. I have to admit, Seiren is better than I expected. The story was compelling enough to make me want to watch it; watching it didn't feel like a chore. The tone is quite lighthearted and considering the tone of Amagami, we can safely assume this will continue to be the case. I also liked the direction the fourth episode took (the concluding episode of the first arc). \\n\\n\r\nThe characters actually had some semblance of depth to them. Sure, a lot of the moments had me rolling my eyes, but hell, I feel like rolling my eyes when I think of my teenage years, so it's only natural i'd feel the same when watching an anime set in high school. If anything, i'd say that is a sign of good writing. \\n\\n\r\nThe fan service wasn't as off putting as I thought it would be. It actually didn't feel that tacked on, which was surprising considering they seemed to have (if memory serves) ramped up the fan service from Amagami \\n\\n\r\nThe character designs have the same problem as Amagami. Some girls, particularly the minor characters, are drawn so similar sometimes that it is hard to tell them apart (especially since you don't see certain characters often). The art is good otherwise. \\n\\n\r\nThe music hardly had a presence. It might be this series' weakest point. The OP and ED are nothing to write home about either. \\n\\n\r\nTo conclude, I think that Seiren might turn out to be better than Amagami. I don't think it'll be anything that special, but I hope it leads us to getting more original anime that use the omnibus format. \\n\\n\r\n***Update: I ended up dropping Seiren. It was just mediocore. \\n",
            "date": "2017-01-26T22:25:00+00:00",
            "helpful_count": 18,
            "mal_id": 239204,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4263391.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gerhakiki",
                "username": "Gerhakiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=239204"
        },
        {
            "content": "Omnibus Format,  is a type of story-telling that divides the whole series into multiple arcs each dedicated to a certain girl which the main characters gets a romantic relationship with. When an arc concludes, everything resets back to the beginning with an all new storyline and characters to follow. The most well-known series that features this kind of story-telling is Amagami SS which is pretty much the spiritual predecessor to our newest addition Seiren. Seiren, an original series made in collaboration with Studio Gakumi and Studio AXsiZ, aired this Spring 2017 is the newest series to feature omnibus format of story-telling. I personally thinkthat Amagami SS is a good show so I was pretty hyped when Seiren was announced but honestly, it didn’t live up to my expectations. There were a lot of flaws that I’ve noticed all throughout the show. To explain further let’s just start the review.\\n\\n\r\nStory\\n\r\nThe story follows Shoichi Kamita as he develops relationship with different girls during high school. Each girl is dedicated to their own arc which follows a unique storyline. A single arc is composed of four episodes each and tells how the main character gets involved into that certain girl, how they developed their relationship and how they ended up in the future. Yeah you heard that right, all of that content in only four episodes. But that isn’t really the problem and even if that wasn’t the case, I’d still be bothered anyways. None of the storylines that the arcs followed are compelling or even interesting.  Each of them has their own fair share of weirdness and cringe. And the conflicts that serves to brighten up the storyline makes little to no sense at all. Fan service is seemingly dominant and the amount of romantic scenes that can establish a concrete relationship between the characters is lacking. With regards to characters development, you can’t really expect much from a show that features an omnibus format of story-telling. Though I can tell, the character development is somewhat there but you can’t really feel it knowing that after the reset, all the connections between the viewers and the characters will all be lost anyways. Viewers who are new with omnibus format will probably encounter this problem but those who have watched similar shows firsthand will probably be fine with it. But beyond all of this, there’s something I’d like to point out and is something that I really praise from the show. Even if the arc that a character is dedicated to is already over, the characters still appear in considerable amount of screen time and throughout the following arc. They appear merely as supporting characters but with quite relevance with the storyline. This feels as if the characters are given a lot of importance. But I guess this is possible because Seiren is an original and not a visual novel adoption unlike other anime of the same league. \\n\\n\r\nCharacters\\n\r\nThe main character of the show is just your typical beta mc that always blushes to whatever a girl does in front of her. There’s really no revealing trait to mention for the main character. He’s just your generic harem main character though I can’t really say that this show is a harem. So having a generic main character, it’s clear enough that the female characters should lead the show. The female characters are likable and appealing. Their character itself is just the right stuff to compensate what the main character lacked. As I mentioned, characters relationship in this show will come and go but not the characters themselves. There’s a really good set of supporting characters that really stood out to me during the whole show. They add up to the overall vibe of the show. So other than the main character, I don’t have any problem when it comes to the characters.\\n\\n\r\nArt \\n\r\nThere are some parts where the art shines and some parts it lacks. In general, the art is very vibrant. There are some notable parts where the animation will just blew you away. And the amount of detail is just right though a little bit more could have been better.  The character designs are also quite attractive. It pretty much reminds me of Amagami SS. Though unlike Amagami SS, I’ve noticed there’s not enough distinction between the characters. All the female characters have similar hair and the facial expressions are pretty much the same with all the characters. It’s really hard to recognize a character at first glance. But this isn’t much of a problem and I let it slide all the time. And still, I can say I liked the art of this show.\\n\\n\r\nSound\\n\r\nThere’s really not much to talk about when it comes to sounds. There’s really no memorable soundtrack that comes in mind when I think of it. The opening theme of the show is quite nice. The closing theme changes every arc. There’s nothing more to it that I’ve noticed other than these.\\n\\n\r\nOverall, I don’t think Seiren is a bad show. Maybe I expected a lot more but there are really a lot of obvious flaws in this show.  But I can’t say I didn’t enjoy this show. With all the laughs and weirdness this show offered to me, I say I enjoyed it quite a bit. So far, there are only three arcs featured in this show but it seems that there’s supposed to be more. If ever there will be a second season for this show, I’d give it another change.\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-24T17:26:00+00:00",
            "helpful_count": 11,
            "mal_id": 243425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5461087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fureiya",
                "username": "Fureiya"
            },
            "url": "https://myanimelist.net/reviews.php?id=243425"
        },
        {
            "content": "Recently, I read a manga about a geezer becoming young again through \"magic\". It was essentially a pseudo-reincarnation. Easiest way to spot a power fantasy. \r\nAnyway, geezer decides to drown us in nostalgia by setting up and ruling a dungeon like in RPGs of old. He summons a hot demon to oversee the construction. The hero (female) arriving to stop him is won over within a chapter. \"Ugly\" slave girl given to him as tribute is made beautiful in one fricking panel. Sounds typical? It is. Except he bangs all the girls.\r\nAnd boom, best harem MC ever. This turd is essentially Kirito in every form,but that one is bland writing, while here we have 'nothing but respect for this MC'. That is honestly the top comment on a chapter on Kissmanga. With 200+ upvotes. Just because, sex.\\n\\n\r\nThis just shows the mentality regarding bland MC's. If you want to check out the manga, I don't blame you, honestly.\\n\\n\r\nSo, Seiren. I could say it is a sweet romance. I could say 4 episodes is just right, without pointless rivals and irritating love shapes. I could say the art is decent, and the girls cute. \\n\r\n On the other hand, I could say it is nothing new. The girls all fall neatly into tropes we've seen before. I could say the characters are inconsistent wrt personality. I could say there is no romance or drama for a lot of the runtime, potentially making this a snoozefest.\\n\r\nI can say a lot of things, but most of them would be invalidated by the herbivore of a MC. \\n\\n\r\nDull, self insert MC's are the cancer of today's anime for many. Not the self-insert part, mind you. Onii-sama has 4k favorites. No, having a dull MC is the death knell of a show nowadays. Seiren is no different. Hard to care about his romance when the character is the definition of 'boring'.\\n\\n\r\nApparently, this sells in Japan. So we'll get more of such shows. There's nothing we can do. Or is there?\\n\r\nYou got me, this is not a review, but a petition for everyone to buy 10 copies of Inferno Coppu.  If it succeeds, studios take notice of it and we get more MC's on the level of Inferno Coppu. If it doesn't, you have 10 copies of the greatest thing to ever come out of the anime medium. \\n\r\nIt's a win-win honestly.\\n\r\nTill this revolution occurs, the only winners will be the studios making money of average titles like Seiren.\\n\\n\r\nSay no to mediocrity. Buy Inferno Cop today.",
            "date": "2017-02-20T00:18:00+00:00",
            "helpful_count": 11,
            "mal_id": 240977,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6052894.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_alpha-q_",
                "username": "_alpha-q_"
            },
            "url": "https://myanimelist.net/reviews.php?id=240977"
        },
        {
            "content": "Alright, since all the reviews here are full of bullshit and too long to read I had to make one of my own. The anime had potential but at around the first girl they messed up bad, it was a major turn-off and since then it only got worse. The anime is really cliche and generic. It's awkward and boring. The main character is useless like in most of the anime these days. I don't recommend it, but if you are bored and you have nothing better to do with your life then it sure is a good way of wasting your time.",
            "date": "2017-03-28T09:55:00+00:00",
            "helpful_count": 8,
            "mal_id": 243797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/GuyInTheShadows",
                "username": "GuyInTheShadows"
            },
            "url": "https://myanimelist.net/reviews.php?id=243797"
        },
        {
            "content": "Seiren is a very visual novel-esc anime. Each story arc revolves around a romance with one of three different girl, Hikari Tsuneki, Tooru Miyamae, and Kyoko Touno.\r\nStory(6)- there isn't much for story here, it's just a romance series. the series is spit into three arcs. Each ending with the main character ending up with the individual girl, and the story restarts in the next arc. It doesn't go right back to the beginning, but rather after the point where the next romance option would come up. I can tell that the second and third arcs have some connection. I never really saw where Arc 2fit into there, but whatever. We know how each story will  end to a point. We don't know the specific ending or how we get to it. This story is fairly sweet at many points. I also really love how it's colder in the third arc, because it's around Christmas time, and I believe that the cold season is the PERFECT season for Romance. Something about the clothes, art, and the air just scream romance.\\n\\n\r\nArt(8)-Now to talk about the art. I really like the character designs. They look very nice, but nows to talk about the fanservice. There's fanservice here, BUT the fanservice isn't silly stuff like jiggle physics, and the more unreasonable. It's more realistic, like cosplay, swimsuits, or being able to see through the clothes a bit when in the water. They also use more detailed art in order to make the fanservice look good. I would also like to point out the amazing opening, that had some fantastic direction. Where it would show the girls and then they'd transform into test followed by shots of the girls doing whatever. That part where Shoichi kisses whoever is behind the curtain is also really good, because it show how the three girls' look pretty different, but have the same base design. That flowers in the opening were also really nice. The endings for the show also had really nice, visual novel-esc artwork, which is a nice touch.\\n\\n\r\nSound(8)- I LOVE the music in this show. My favorite piece is the opening, which might be my favorite opening from Winter 2017. I enjoy the endings as well. I can't remember them perfectly though. I enjoy the litle bits of background music that are here as well. The music here was done by Nobuaki Nobusawa, who did the music for series like Lord Marksman and Vanadis, Dagashi kashi, and Cerberus. This was my first encounter with him though.\\n\\n\r\nCharacter(9)- Now I will bring up that the main character, Shoichi, is very self-insert, which would be bad  in a series with dramatic stakes, but it's fine here, because the main focus is the heroins of the series. None of them are Tsunderes, Yanderes, Derederes, etc, etc. They do fall under a few archetypes, like popular girl, or childhood friend, but they have very likable personalities, and I would say that I would be interested in all three of them. Shout out to Hikari Tsuneki, who is best girl. She's a likable character, and probably the most important, because she's in every Arc, and its not just a cameo either, she plays a certain purpose in arcs 2 and 3. Even after her Arc had ended though, I could still route for the other characters to end up together, but Tsuneki is my personal favorite. I like the side characters as well, even if some of them were kind of weird in little ways, I had still enjoyed most of them. My favorites being Moene, Shoichi's older sister, and  Ikuo, Shoichi's best friend. I did find a few characters annoying, but they mostly fell under reason, as they would be people I'd find annoying in real life. I'll note that Shoichi does have some weird fetishes, but it's fairly standard for your average teenage boy.\\n\\n\r\nEnjoyement(9)- I really enjoyed this series, and it's a shame that so many people have been hating on it, because its a nice show to watch.\\n\\n\r\nOverall(8)- I think Seiren is nice series to enjoy. It's nothing grounbreaking, but its certainly enjoyable. I recommend trying the first 4 episodes before making a clear decision on it.",
            "date": "2017-03-25T20:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 243540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5413433.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NG_Chloe",
                "username": "NG_Chloe"
            },
            "url": "https://myanimelist.net/reviews.php?id=243540"
        },
        {
            "content": "I went into this anime as a full-on Amagami SS fan. Something nice with great romance progression and a cute story. I was happy when I found out that Amagami was getting well...an alternate as one can say.\r\nThis review will be edited as each arc finishes.\r\nWas I satisfied? Well...yes and no.\r\nHere's why.\r\nWe have the setting to be set somewhat set in the same highschool from Amagami. NGL I was expecting some sort of cameos from Amagami characters. (Unless there was and I didnt see, if there was, tell me)\r\nTsuneki Hikari, Or should I say, Haruka 2.\r\nBoth have similar designs, and in a way, similar personalities(although I tend to find Hikari just a smudge hotter than haruka..Just a smudge) She is the first girl out of the 3 arcs.\\n\\n\r\nWas I satisfied with the Romance? Not really. Even so, I did enjoy the way the MC and Hikari interacted with eachother. But with only 4 episodes to work with, the romance progression or the character progression was pretty hard to try and pull off. There was little to no progression between the 2 characters. Then again, this is only 4 episodes, but Amagami was able to do some nice development in 4 eps.\\n\\n\r\nbut that doesn`t mean I was dissatisfied...\\n\r\nI had fun with this arc, I liked the characters and I loved some of the conversations they had. Even if there was very little progression, I had my fair enjoyment of this arc.\\n\\n\r\nIn conclusion..I guess, I just wanted more so that there was more room for romance progression, plot progression, and character development. \\n\\n\r\nHere`s hoping that the Tooru arc will be good. She`s the one I`m looking most forward to.",
            "date": "2017-02-01T14:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 239674,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5306763.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ItzToxic",
                "username": "ItzToxic"
            },
            "url": "https://myanimelist.net/reviews.php?id=239674"
        },
        {
            "content": "So when LA heard the same author of Amagami SS was going to make an original anime under a similar format, LA was first excited!, then immediately remembered the failure in the form of Photo Kano but LA was still excited nonetheless.\r\nLA will be tackling the plot by each of the girl's arcs (4 episodes each) in an omnibus format just how Seiren itself does it, so without further ado...\r\nHikari Tsuneki's arc is if anything is our introductory arc, showing us the characters, settings etc, as well as showing us the central girl for this arc Hikari herself. Hikari as as character if LA wouldsay in Amagami SS terms, she's essentially what happens if Haruka and Tsukasa mashed together. She's a rather soft yet brash tsundere who loves teasing our main protagonist and her voiced by Ayane Sakura in her tsundere vocals is typical that this character can come off rather *ahem* bitchy...LA however kinda found her character endearing, if anything her carrying her arc (instead of the main protagonist). The chemistry between Hikari and the main protagonist feels artificial to say the least usually because of the all the coincidences and forced teasing she does to him. Her arc later gets rather serious but again, Hikari solves it herself, making the romance even more forced to say the least. Hikari as a character gets more screentime even away from her own arc (quite clearly showing us the author's favourite in the process) and sure we get more development as it were from her but she is typically her tsundere self and not opening up as much (heck she didn't even open up even in her own arc!...unless you count the aftermath of the drama that occurred in her arc). Hikari is LA's favourite character in the series (tsundere are kinda thing for LA.......shut up!) but she had probably the worst arc in the anime and her arc just didn't do justice for Hikari at all...LA was expecting a Haruka & Tsukasa a la great romance...instead LA got a forced romance with a main protagonist who's out of his league and coincidences leading to a fated romance. \\n\\n\r\nTooru Miyamae's arc for LA is the literal middle ground for Seiren as an anime for LA, both being rather quirky in it's own weird way and showing it's weaknesses at the same time. Tooru Miyamae voiced by Shino Shimoji and her as a character is pretty fleshed out, being an open-minded gamer girl who thinks just a bit too much about games, she can be said to be a wish-fulfillment girl in a ways but she's packed with her own drama with her games in general. Mainly because she hangs out with guys for the games and has a competitive streak towards it is where her drama comes from and that is actually well done. The quirkiness of her arc comes from the gaming terminology, the fanservice from Tooru and the cameo of Hikari and it's expected what all this entails. LA didn't mind the quirkiness as much as Tooru really was the central girl of her own arc and had a bit of playful relationship with our main protagonist but for LA, not to the point of it being legitimate romance, more like a friendship romance at best, because of that in Amagami SS terms, she's the merged persona of Ai and Kaoru, Ai for her hobby taking the forefront (just change swimming as the drama to gaming) and Kaoru for her personality and status towards the main protagonist. Her arc had her faults just like Hikari all through the romance we all wanted to see as legitimate, but a playfully quirky relationship is a good consolation nonetheless.\\n\\n\r\nFinally we have the childhood best friend of our main protagonist, Kyouko Touno voiced by Juri Kimura and seriously, story and romantically-wise, this might the best arc. LA will say this arc in \"Amagami SS terms\" is what happens if Rihoko's first season arc ACTUALLY had a happy ending!, this arc also had shades of Sae as well all due to Kyouko being a rather shy character (but not as shy as Sae), but the Rihoko similarities are fierce in this one, from being childhood friends, Kyouko and Rihoko being part of the home ec. club (along with some familiar faces?). Seriously though, LA just felt this romance between Kyouko and the main protagonist one of the more legitimate ones in the series, this is mainly because, the main protagonist isn't shooting out of his own league for one, instead we are going for the childhood friend, an anime trope that is rarely done and what with the main protagonist prior backstory with Kyouko along with some legitimately quirky fanservice (this being our previous 2 heroines gets the grunt of it though Kyouko DOES get some, it IS her arc) yet great bonding moments, it's romance is decent at best, sure drama occurs, but the drama doesn't push the romance away like Hikari and Tooru's ones did, instead it's based on the main protagonist having legitimate feelings for Kyouko, thus doesn't feel fake or artificial, not to mention HOW his endevour was execute was natural especially coming from BOTH Kyouko as well as or main protagonist .\\n\\n\r\nWell LA talked lots about our main girls of the series, but not the man protagonist himself...well the main protagonist Shouichi Kamita is well, an otaku of many things (gaming and magical girl genre...don't ask), is typically perverted albeit conservative about it and is generally your nice guy who wants to help. He is generally the weakness link the arcs (besides Kyouko) mainly in the romance department which is kinda crucial in a romance anime, but what with the anime's omnibus format to suit the needs of the girl in question, it's kinda expected that his personality is bland, but the one thing LA will not forgive to Shouichi is the fact that he creates the romance to be artificially fake (Hikari's and shades of Tooru's did that). Even Amagami SS' main protagonist Junichi had some shades of legitimate romance here and there that weren't forced in most of his arcs which only emphasized the girl in question's arc to develop BOTH of their characters and romances together. Seiren's main protagonist makes the romance forced and fake for 2/3's of his arcs and no it's not because of the fanservice or the anime's quirky way of doing things...it's Shouichi as a character and how his coincidences or his bland personality (or his interests to be honest) that leads to his romances, he doesn't pursue his romance, he's just the nice guy helping out the girl in question. Romance is later. Shouichi is the biggest problem of this anime especially in the romance department and having a blank slate in which the male audience can relate to just isn't enough if our main protagonist isn't ACTIVE or have the sense of urgency in his pursuit of romance and his romances either comes last after the drama or coincidences allows him to pursue his romance. Ok enough ranting...\\n\\n\r\nThe minor cast consists of recurring characters like Miu Hiyama voiced by Shiori Izawa, Tomoe Kamita, Shouchi's OLDER sister voiced by Manami Numakura, Ikuo Nanasaki voiced by Ryota Asari (hmmm names familiar), Shouichi's friend and Ruise Sanjou voiced by Honoka Kuroki, the student council president along with satellite character and much more and yes...it's expected that this kind of minor cast are nothing but support with the remaining heroines getting nothing more than cameos until their arc arrives (this includes Tooru and Kyouko in some respects).\\n\\n\r\nLA talked alot about comparing Amagami SS to Seiren, well with good reason is that one, Seiren's timeline is 9 years after Amagami SS once again set in the same school as Amagami SS, Ikuo Nanasaki is Ai's younger brother who's much more different and finally the Miss Santa Contest is a blatant one. Ohhh and with this, Seiren also has an affinity towards it's own as the arcs progress thus giving Seiren it's own quirky personality in the name of fanservice most of the time, it's themes namely being an obsession with deer products (games, the actual animal, meat of it etc...also don't ask.), the aforementioned Miss Santa contest and the Crimson Mask super sentai show.\\n\\n\r\nIn terms of animation by Studio Gokumi and AXsiZ, the animation for the most part from the backgrounding to the character designs are pretty well done as well as many of the minor to main cast to be striking with some exotic character design, with the exception being Shouichi with good reason, bland main male protagonist...-sigh- typical. The animation on the background does look gorgeous at times and LA will praise Studio Gokumi and AXsiZ in their level of detail across the board, this especially important in the anime's more romantic scenes where Christmas is kinda a central event and the Winter scenes are gorgeous if anything. Overall, decent job from Studio Gokumi and AXsiZ with some rather decently exotic yet somewhat bland character designs.\\n\\n\r\nIn terms of voice acting, the voice acting is acceptable across the board, with no squeakers let alone any annoying vocals here and there. LA quite enjoyed Ayane Sakura as Hikari and the rare times she was there, Yukari Tamura as Shouichi's teacher Masami Onigata. But again, like its animation, the voice cast is decent but not much to praise about...well besides Ayane Sakura and Juri Kimura but nonetheless, the voice cast is decent.\\n\\n\r\nIf LA could put Seiren as an analogy with the rest of Amagami SS and Photo Kano, then LA would say that Amagami SS is like the brilliant older sister who does have her faults but knows what she needs to do and does it well, Seiren is like the second sister and middle child of the bunch where she's pretty shy and awkward most of the time, but just give her a bit of time and she'll open up to you and she looks up to her oldest sister *cough* homages *cough*....Photo Kano is like the naive youngest sister of the sisters who just doesn't know what the hell she's doing, being too focused on one thing and too little on many others...\\n\\n\r\nWell, Seiren is technically only halfway done, what with another season covering the later three girls of Miu Hiyama, Makoto Kamizaki and Ruise Sanjou with LA being intrigued by Miu's character in particular what with her constant cameos...let's just hope Seiren will get better in the romance department (LA is looking at you Shouichi), otherwise..LA's analogy about Seiren, Amagami SS and Photo Kano WILL be accurate.",
            "date": "2017-03-24T21:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 243440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=243440"
        },
        {
            "content": "Seiren is the spiritual sucessor to the anime/visual novel Amagami. although not having seen Amagami (although i plan to because i like some context with my doujin), the basic of the story is about a guy falling in love with a girl and trying to get into a relationship with them in the span of 4ish episodes with a kiss at the finale,until the show resets and he does it again with a different girl because repercussions aren't something we want to deal with when watching anime. that's what it pretty much devolves into, and in this show there are three girls that the maincharacter tries to get with. from these three arc in my opinion only the first arc was entertaining, and while i wanted the next arc to be just as \"good\" the next two became rather boring, which may be due to how repetitive it quickly becomes and the lackluster endings each arc has.\\n\\n\r\n there are several characters in this show, but of course the most important ones are the main cast consisting of the Mc and all three chicks since all the other characters are one-note (not like the main cast ins't as well). the main protagonist is Shouichi who serves as the self-insert for the viewers since there really isn't much of a personality for him other than falling in love with the main girls, and reacting to the things happening around him. he's just bland in order to serve his role. the first girl is Hikari who is one of the most popular girls in the school, as well as a cook and has goals outside of school. despite being a bit of a bitch she is the only one with a personality be it she is a bit rude. the next girl is Tooru who is a girl obsessed with gaming, and a stoic personality who has trouble connecting with other people. although i really wanted to like her she ended up being boring. the final girl is kyouko the obligatory childhood friend who is nice...oh and no one really develops as a characther other than falling in love.\\n\r\nall in all Hikari is best girl and the rest of the cast is bland. 1 Hikari/10.\\n\\n\r\n the art looks nice all the girls in the show look visually appealing even the ones who are made to look like shit.the men look decent as well, but i don't care about them. the background looks decent, but nothing noteworthy, same goes for the lighting and so on. there's not much to say in terms if animation since there's not a lot of movement going on especially subtle things like how the characters don't blink unless they are talking.\\n\\n\r\nas for sound, eh, nothing not worthy when it comes to the sound track, and the voice actress did a well enough job to sound good.\\n\\n\r\noverall- the production value is decent enough, and Hikari is best girl\\n\r\n3.33/10 pretty much 1/3 of the show (guess which 1/3)\\n\\n\r\nalso what is with this show and the deers, they are practically the shows mascot and plot device at times. \\n\\n\r\nalso also i'm waiting for the doujins that may never cum",
            "date": "2017-03-24T16:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 243418,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243418"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nA woman in glasses really gets me going.\r\nPart of it comes from the fact that I myself wear glasses; I can relate on some level with her bifocal style. Part of it comes from the subtext; an air of intelligence and maturity takes over. Part of it comes from instinct; I simply like the look itself.\r\nI have other fetishes. Ones too private and too personal to share on a public forum. Seiren has its fair share of fetishes, too, but it hides nothing as it gives its audience an average romantic outing – in moreways than one.\\n\\n\r\nSTORY\\n\\n\r\nSeiren adopts a structure known as the “omnibus.” In this case, for a romance anime, the description implies that the story will center not on a single relationship but rather many different relationships over the course of its run (hence the prefix “omni”). The main protagonist meets the girl of his dreams, the two eventually fall in love, and the whole thing resets back to the beginning for a new fate altogether. Think choosing a separate route in a visual novel, and it’s very similar in construction.\\n\\n\r\nFor Seiren, it sits at twelve episodes in length, giving four episodes per arc and thus four episodes for each of the potential girls: Hikari, Tooru, and Kyouko. Thanks to this structure, it makes it quite easy to analyze the show in individual sections and then overall as an entire package.\\n\\n\r\nHikari’s arc comes first. Shouichi goes to a study retreat in the mountains to focus on his future, and she finds herself there as well. Not of her own free will but due to a series of unfortunate events.\\n\\n\r\nThis secluded, close-proximity setting lends itself well to many a moment between the two lovebirds. She pulls him aside to have private conversations, she invites herself into his room, and she even goes into the men’s bath with him to show off her new bikini. The two constantly interact, building their relationship up from nothing and into something believable.\\n\\n\r\nSimultaneously, the arc focuses on Hikari and her fun. For instance, Hikari’s always-wearing-Shouichi’s-sweats running gag creates a common stepping stone that the anime uses to its comedic and romantic advantage. She jokes to another female student about how her and Shouichi went at it as hard as the washing machine cleans the clothes, and her nonchalance with the situation gives Shouichi extra, lewder thoughts about her that he may otherwise not have been thinking about.\\n\\n\r\nAlmost everything goes right in this arc – save for the finale. Disregarding Hikari’s awkward acceptance of her friend screwing her over, the two share a kiss together beneath the gentle waves of the ocean. Only, following this beautiful, memorable moment, she tells Shouichi that she’ll be studying abroad to learn how to cook. In other words, no romantic payoff is had. It makes the whole arc feel pointless let alone defeats the purpose of rooting the show in romance to begin with.\\n\\n\r\nTooru’s arc comes second. She somewhat stumbles into Shouichi’s gamer group where he and his two friends play a popular deer-raising role-playing game. Tooru plays the game too, and, when the four of them start gaming together on a new video game, it becomes a fun time for everyone.\\n\\n\r\nOnce again, the setting gives Tooru and Shouichi their chances at love. They “mate” in-game during their trip to a café. He invites her to his secret gaming spot where old-school classics let them connect over simpler games by their lonesome. He accompanies her during the ComiMa expo. Like life, video games aren’t always about the single-player experience, so their partnership creates many a moment for them.\\n\\n\r\nYet the multiplayer approach is also this arc’s downfall, for one of the bigger issues is that it doesn’t always feel like Tooru’s arc. More specifically, Seiren involves Hikari from the first arc a bit too much. She plays the role of Tooru’s gaming rival and former friend. But, when she was literally the main love interest in the previous arc, seeing her here just makes her presence distracting to say the least.\\n\\n\r\nUnlike said rival, though, Tooru finishes the arc strong. While she admits that she doesn’t wish to drastically alter what she shares with Shouichi right now, she commits herself to him and him to her beneath a striking full moon. Where the two were once just online partners, they end up as star-crossed lovers.\\n\\n\r\nKyouko’s arc comes third. She’s Shouichi’s childhood friend, and that relationship has stuck with them all the way into high school. He sees her as a “kid,” and she sees him as a “girl.” Which (expectedly) leads to many a roadblock.\\n\\n\r\nIn comparison to the first two arcs, this arc includes a poor premise. Kyouko turns down Shouichi rather early on, leading to a weird rift between the two. And, after she joins the home ec club, the two don’t get to spend too much time together. She’s doing club things, and he’s left figuring out if he should pursue his feelings for her. When they do go end up somewhere, it’s less a natural extension of the plot and more a coincidence of events.\\n\\n\r\nThe friendzone (or perhaps “girl-friend zone”) direction seems odd, but it makes sense in that they have been nothing more than besties. So, the events center on them overcoming that barrier. Amidst glowing moonlight, Kyouko’s festive look cannot help but put Shouichi in awe. Later, he gives her a hand-me-down coat when she goes over to his house. She even takes him underwear shopping with her, making them see the other in a different way entirely.\\n\\n\r\nKyouko’s finale also concludes on a heartwarming note. While perhaps a bit too cliched with the rooftop location and the background fireworks, their kiss signals the two have finally gone past their pasts and see each other as the one they love. Not as a “girl” or a “kid” but instead as a man and a woman.\\n\\n\r\nAs described above, each arc flubs a particular part. Hikari doesn’t have a strong finale, Tooru doesn’t have strong focus, and Kyouko doesn’t have a strong premise. In other words, each individual arc misses the mark slightly in their own fashion. However, on a larger scale, the anime remains more consistent in execution.\\n\\n\r\nMore specifically, Seiren showcases a handful of romantic relationships that come to fruition in a normal manner. No mega drama crops up during its run, and the narratives themselves don’t go for anything unique. It’s simply a believable set of relationships that the audience can perhaps relate to or at least understand if only because the anime remains so grounded.\\n\\n\r\nBetter yet, this structure inherently provides a lot of variety in these relationships. The kouhai, the fellow classmate, and the senpai. The sweet, homely girl. The teasing, outgoing girl. The quiet, passionate girl. A knitter, a cook, and a toymaker. Each girl has her own interests, her own problems, and her own traits that the audience get to watch unfold one after another.\\n\\n\r\nThe anime also loves its fetishes. Ranging from kinky to eyebrow-raising, Seiren seems to surely have something in store for everyone. Leftover butt imprints. Sweatpants markings. Furry cosplay. Hickeys. Undergarment decorations. Hair whorls. And those are only a small sample from the sizable list. Its fetishistic nature can oft be weird at times, but it no doubt adds to the anime’s overall charm.\\n\\n\r\nIf nothing else, Seiren earns props for delivering not one but three full romance stories with actual development and conclusions. In anime, it’s (perhaps unfortunately) noteworthy when the romance actually goes somewhere, so seeing it multiple times over, back to back to back, certainly defies the medium’s usual approach.\\n\\n\r\nIn fact, the anime even goes so far as to create small epilogues for each coupling, showing where they are several years later. Each one derives from smaller details in each arc. For Hikari, Shouichi becomes a dietary expert, and the two (presumably) rekindle their love at the restaurant where she secretly worked. For Tooru, she becomes a teacher, and Shouichi becomes a bus driver. For Kyouko, Shouichi became a manga editor while she looks a lot more like an adult.\\n\\n\r\nThe show does have references and small crossovers between the different plots, but they don’t heavily influence another plot’s progression. And, while the anime delivers solid romance here and there, a lack of thematic exploration may leave the audience wanting. Nevertheless (and for better or for worse), the anime ends up as a regular enough show.\\n\\n\r\nART/ANIMATION\\n\\n\r\nSeiren’s visual direction leaves a lot to be desired.\\n\\n\r\n“Plain” best describes the artistry. It’s yet another show in a long line of shows where a school dominates the setting. That’s not inherently a problem – until the anime doesn’t do much with it. It doesn’t go for anything too fancy, opting more for standard framing and orientation for its different shots. Lighting can play a bigger role for sunset scenes or arcade colors at night, but the artistry remains fairly uninspired throughout the season.\\n\\n\r\nThe show gets a bit more adventurous when it comes to those fetishes it likes so much. Shouichi envisions Hikari wetting herself while wearing a typical elementary-school outfit (yellow hat, blue shirt, and red-square backpack). Tooru sidles over Shouichi which incidentally puts her chest in full-frontal view for him and the audience to view the action. Kyouko undresses herself without care in the middle of Shouichi’s home’s hallway, leaving little left necessary for the imagination.\\n\\n\r\nGoing back the other way once more, the anime’s animated segments don’t have much going for them either. Not that there’s anything horrendous or blatantly egregious. The anime just doesn’t feel the need to provide movement of a higher quality.\\n\\n\r\nIt can surprise on occasion, though. For example, in episode seven, the bunny doll that Shouichi receives from Tooru changes its face to match that of Shouichi’s when Tooru arrives to ask him to help her out at the ComiMa event. An unnecessary detail that brings comedy and ups engagement nonetheless.\\n\\n\r\nSeiren at least deserves praise when it comes to the designs of Hikari, Tooru, and Kyouko. Again, the show doesn’t do anything fancy, but the girls have an allure, an attractiveness that’s achieved through simple choices. Hikari’s side ponytail. Tooru’s brown eyes. Kyouko’s soft smile. Much like the story, these designs stick with a normalcy and a simplicity that don’t evoke wonder but do make it tough to look away.\\n\\n\r\n(And as an extra side note, Kyouko’s stare lingers a bit too much at the start of her ED’s visuals. It comes off as less cute and more creepy than intended.)\\n\\n\r\nCHARACTERS\\n\\n\r\nArguably speaking, Seiren’s greatest strength comes from the characters and the arcs they go through. The anime does not have too much time for each girl, but Hikari, Tooru, and Kyouko experience individual problems that they must overcome – as Shouichi lends a hand however he can.\\n\\n\r\nHikari’s arc focuses on her seriousness, and her entrance defines her character right away. Sitting atop Shouichi’s desk, she teases him (with tongue out) about how much fun she has messing with the helpless teen. And, as she talks with her friends and rumors swirl about her, it becomes clear that Hikari is both proactive and independent.\\n\\n\r\nHowever, she still doesn’t seem to care too much about anything else besides having fun. Her parents find out about her part-time job, so they send her away to Shouichi’s retreat. But there’s no fun to be had. She finds studying boring, she can’t use her phone, and she tries to sneak away from the hotel to get to the mixer she covered up as a family trip. Without anything else to do, she teases Shouichi with every chance she can get to have her fun.\\n\\n\r\nThe more she interacts with him, the more sides of her come out. She gets flustered when Shouichi compliments her navel, and she gets rather angry when he tells her he saw her at her secret workplace. She also learns to do the laundry, studies more than she most likely ever has before, and even cooks food for others, letting Shouichi see her in “a new light.” All the while, the other students believe her to be a “slut” that she takes as a challenge – which involves more teasing and vending-machine misunderstandings for Shouichi.\\n\\n\r\nAfter clearing up who ratted her out to her parents, she shares an intimate moment with Shouichi at the beach that solidifies the feelings they share for one another. After speaking with him more and reminiscing about the summer course, she realizes how much he has done to support her, to give her the confidence she needs to believe in herself moving forward. Thus, she makes a serious decision, opting to study abroad to sharpen her cooking skills that he praised her for weeks earlier.\\n\\n\r\nUnfortunately, that leaves the two separated and without a satisfying romantic conclusion. While it’s certainly not the best ending imaginable, it’s still an interesting route to take. Letting Hikari – a character whose entire path centered on becoming more serious – continue following seriousness through a life-defining event makes for a realistic approach that provides a close to her fun-filled arc.\\n\\n\r\nTooru’s arc focuses on her loneliness. Although, it doesn’t seem to be that way initially, for she stumbles upon Shouichi’s gamer group and joins them in their online escapades. Tooru herself is somewhat quiet and slightly naïve despite her age. She also likes to sing anime songs and can even craft miniature toys. Combined with her gaming abilities, she seems to easily connect with most people around her.\\n\\n\r\nOnce she gets back into GusGal, a multiplayer shooting game, Shouichi becomes her partner in their dual matches. But she’s too good. Not only does her popularity as a strong player want others to fight alongside her, thereby kicking Shouichi out, but also her playstyle attracts criticism. She wants to win through utter domination and no matter the cost. It stops others from reaching her level and gets them upset when she doesn’t hold back.\\n\\n\r\nHikari expresses similar thoughts when she warns Shouichi of Tooru’s aggressive tendencies. They were once gaming buddies, but, due to Tooru’s drive, they (and other friends) eventually parted ways. Soon after, Tooru heavily invests herself in GusGal+, skipping class and once again making enemies (of the online variety).\\n\\n\r\nShouichi (with Hikari’s advice) doesn’t back away. He visits her at home, learns a bit more about her and her past, and the two play some classic arcade games together (minus the “instakills”) at his secret gaming spot. He even gives her a “ring” that obviously foreshadows their eventual coupling.\\n\\n\r\nShe understands that the games have started to take over her life to some degree, so she backs away from them for a while. In their stead, she creates a new stuffed toy that she wishes to sell at the ComiMa expo – so long as Shouichi is there to support her.\\n\\n\r\nAnd support he does. He tries his best (well or otherwise) to sell her toys, he comes up with the idea of selling her Deermas as an accessory, he protects her from the paparazzi, and figures out her (lewd) outfit issue.\\n\\n\r\nHis support and words and feelings get through to Tooru. She realizes now that, after everything that has happened and everyone she has known, he’s the only one who has chased after her to be by her side no matter what. (A “playstyle” she’s very much familiar with.) They choose not to change their relationship drastically, but Tooru and Shouichi share an intimate moment as well, coalescing as offspring both in and out of the video game that brought them together in the first place.\\n\\n\r\nKyouko’s arc focuses on her growing up into a woman. Originally, she’s framed as a child. She’s Shouichi’s childhood friend, she’s a year younger, she likes manga from their childhood, she has a slender frame, and she brings up subjects like fan clubs that make her seem like a middle schooler still.\\n\\n\r\nSurprisingly, Shouichi goes for it all rather early in the arc, but Kyouko shoots him down. She sees him more as a “girl next door” rather than as a man. Plus, she doesn’t want to ruin what they’ve always had (risqué hotel hopping notwithstanding).\\n\\n\r\nKyouko is also aware of her childish nature, so she does what she can to correct it. She gives up some of her manga, she joins the Home Ec club to gain lifestyle knowledge, and she acts bolder like taking Shouichi with her to get new panties for herself.\\n\\n\r\nShe wrestles with her feelings for Shouichi, for she cannot admit that she sees him differently. That is until he tells her the opposite from his perspective. That, after her dedication towards the club and her recent actions, he can no longer treat her like a middle-school kid.\\n\\n\r\nStill, at the Founder’s Day festival, Kyouko hesitates in front of Shouichi’s persistence to speak with her in private. Yet she knows that there’s something that makes her happier now. Her friends give her a final push (and some oden), and, once on the rooftop, she shows how much she has grown up. She sits between his legs, “confesses” her feelings, and faces him in earnest. The two cap off her arc with a romantic kiss, fireworks exploding in the background.\\n\\n\r\nHikari takes life seriously, Tooru escapes loneliness, and Kyouko grows up. Each girl develops in some fashion, giving each arc a rounded experience for the characters. Given that they only receive four episodes each, their changes are even more meaningful overall.\\n\\n\r\nThroughout every arc, one true constant remains: Shouichi. While he’s destined to be the too-plain protagonist given the omnibus format, Shouichi isn’t without quirks of his own. Namely (as Hikari would put it), his depravity. The boy is a horny, high-school teenager, so his mind wanders and his gaze leers as many a sexual situation appears before him.\\n\\n\r\nMore commonly, he treads the line between just wimpy enough to know his place and just brave enough to push his relationship with each girl to that next romantic step. For example, during Kyouko’s arc, he may take his loss after she turns him down for a date, but he’s not afraid to say, “I can’t tell without seeing you wear them,” during their underwear aside.\\n\\n\r\nNo matter what, though, Shouichi supports the girls however he can. He helps them fight what holds them back on both a mental and personal level, making his romantic relationships with them worthwhile. He sincerely cares about Hikari’s cooking and the misunderstandings targeted at her. He really wants to be with Tooru even though she runs away and he can’t match her skill. He looks out for Kyouko as much as he can.\\n\\n\r\nAnd, like any good romantic relationship, they help him become a better person, too. Hikari inspires him to become more independent and care about his future. Tooru gives him the means to prove his worth. Kyouko forces Shouichi to man up.\\n\\n\r\nHis changes aren’t as noticeable as those of the girls since he resets with each arc and realistically isn’t the focus. However, he gains just as much from these relationships as they do – proving that romance no doubt affects both sides for the better.\\n\\n\r\nMUSIC/SOUND\\n\\n\r\nSeiren creates three specific ending tracks – one for each girl. These tracks reflect the girls’ personalities and interests in some fashion, acting as an extension of the characters themselves in audio form.\\n\\n\r\nHikari’s track, “Shunkan Happening,” is upbeat and quick, incorporating a slick starting guitar solo and some piano work. It’s fun, what with its fast-lyrical delivery, but it doesn’t stick out as anything interesting on the ear.\\n\\n\r\nTooru’s track, “Muteki no Megami,” is arguably the best of the three if only because it goes for something different. The computerized effects fit with her gaming motif, and the instrumental work focuses on echoes and singular sounds. Such sounds invite a melancholic, somewhat haunting tone that goes along with her loneliness. The second half is more hopeful, though, aligning with her eventual change of situation.\\n\\n\r\nKyouko’s track, “Koi no Theory,” is the simplest of the three. Light, silly sounds get at a more “childish” composition, and a consistent beat keeps the song from going anywhere other than straight ahead. While filled with trumpets and the occasional flourish, its tame nature unfortunately makes it all too forgettable.\\n\\n\r\nAs for Seiren’s opening track, “Kimi no Hana,” it begins rather nicely as drum tapping supports the vocalist, and the lead up into the main portion of the piece signals something grand. But, once it actually does get going, the whole thing sounds a bit flat as the instruments overtake the unemotive singing. It’s a reserved OP that fits with the overall feeling of the show itself, so it at least has that going for it.\\n\\n\r\nListening to everything else, the voice acting performances aren’t anything noteworthy, but the original soundtrack does contain a few tracks that strengthen many of the anime’s scenes. A resonating piano piece channels tension. Harps, wind instruments, violins, and chimes fill the air during certain romantic segments. A provocative, ringing tune accompanies Shouichi’s perverted thoughts, and a slow, punctuated song brings a more comedic vibe when possible.\\n\\n\r\nENJOYMENT\\n\\n\r\nI must admit that, having not seen any part of the Amagami series, parts of the show are lost on me. From the tidbits I picked up elsewhere, certain characters are related or are direct references to the spiritual predecessor. And the constant inclusion of deer – Hikari runs away from deer, Tooru plays a video game inspired by the animals, Kyouko’s senior classmates sell venison – is presumably a funny callback. (I may be wrong about that.) Not that I needed to watch anything before this one, but it most likely would have helped.\\n\\n\r\nRegardless, I liked Hikari, Tooru, and Kyouko (in that order), so I had a pretty all right time with the show.\\n\\n\r\nA jokester myself, Hikari’s playful personality made her the most fun and the most attractive. Seeing her in the other arcs (intruding or otherwise) was nice, but it also made me sad because she was first-in-first-out queue style.\\n\\n\r\nTooru’s mature persona (and all that entails) likewise made her attractive. So did her video-game-playing background, for I am an avid gamer myself (who is currently Diamond rank in Gears of War 4). But it was her embarrassed nods that had me grinning the widest.\\n\\n\r\nAs for Kyouko, while she was a bit too docile for my tastes, her thoughtfulness was something I could definitely appreciate. It’s what made her bold sit-in-between-Shouchi’s-lap move get two-thumbs up from me.\\n\\n\r\nOverall, the lack of higher drama and comedy didn’t make the anime very engaging for me. Although, I was a big fan of the romance itself. Which, at the end of the day, matters most in this case. The shy reactions. The heart-skipping build-up. The kissing culminations. Romance is the favorite of my favorites genre-wise, so I couldn’t complain much about the progression shown.\\n\\n\r\nHowever. To me, it seemed as if each arc needed one more episode. An episode that would have the couple just after hooking up (or in Hikari’s case whatever long-distance relationship aside they could muster). The whole idea is to show their budding romance up to and including the confession, meaning it never wanted to provide anything extra to begin with. And, to be fair, they provided epilogue pieces to minutely satiate my desire here. But those small snippets only made me want to see them actually together even more.\\n\\n\r\nBased off the opening track’s visuals, it seems as though the series has another three girls lined up for more omnibus action. If another cour is somewhere out there on the horizon, the show certainly has a lot to improve on.\\n\\n\r\nSeiren is about as average an anime as it comes. A simplistic set of narratives, a plain artistic direction, a regular set of musical offerings, and a few entertaining sequences. The characters and their romance give more, but they aren’t enough to completely fix the apparent astigmatisms.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, Hikari, Tooru, and Kyouko may flub different parts of their arcs, but the omnibus format works well in establishing different setups and creating a set of grounded, charming romances for the audience to follow\\n\\n\r\nArt/Animation: Fine, decidedly plain, the artistry doesn’t stick out much, but the provocative scenes and designs of the girls include much-needed intrigue\\n\\n\r\nCharacters: Good, with only four episodes apiece, Hikari takes life more seriously, Tooru escapes loneliness, and Kyouko grows up, all while Shouichi changes too, proving that romance betters those involved\\n\\n\r\nMusic/Sound: Fine, each girl’s ED acts as an extension of themselves, the OP comes off a bit flat, the OST contains several nice tracks, and the VA performances are nothing of note\\n\\n\r\nEnjoyment: Fine, Hikari, Tooru, and Kyouko were some combination of fun, attractive, and cute, but the missed references and lack of post-hook-up episodes left a small void\\n\\n\r\nFinal Score: 5/10",
            "date": "2018-03-08T21:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 273385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=273385"
        },
        {
            "content": "Nothing about this feels like it should have been an anime. In fact it may have been better as live action considering the animation is minimal, color pallet is drab, and character design pretty generic. I understand not every anime has to be about heroes and destiny, mechs and magic, aliens and demons, time travel and parallel dimensions... BUT they should be a little more interesting than some completely average high school character (with seemingly nothing going on) besides not knowing what to do with his life (so then like every high school character ever). In a show where characters appearing \"normal\" seems to bethe unique twist instead of appearing super eccentric, kawaii, or \"anime-y\", no one feels particularly relate-able or interesting or funny. Like the forgot to infuse the characters with well... \"character\". I found myself bored and un-charmed all the way through desperately waiting for something, anything to happen but it never came. If it sounds like I don't enjoy slice of life, high school comedy/romance shows you're dead wrong. Shows like Orange get what this show feels like it wish it could do. Where other high school shows with a twist like Angel Beats I feel does a disservice to the show.",
            "date": "2017-05-05T21:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 247040,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5459059.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Zeemod155",
                "username": "Zeemod155"
            },
            "url": "https://myanimelist.net/reviews.php?id=247040"
        },
        {
            "content": "In a season filled to the brim with great animes. Seiren was not one in the category of perfection or masterpiece rank. This was not expected due to the anime being created by the same people who worked on Amagami SS. Seiren follows the same way of developing a story quite like amagami SS with the only diference that it follows for 3 main girls & only went on for 12 episodes. \r\n[Story]6/10\r\nThe story elements in seiren follow how the main character Shouichi Kamita interacts with the 3 main heroine. The anime is divided in 3 arcs one for each heroine which are Tsuneki Hikari(eps1-4), Miyamae Tooru(eps 5-8) and Touno Kyouko(eps 9-12). Each arc has its way of telling this story, but honestly the best arc by far was kyouko's arc since it had the best story & it actually felt different in relation to the other arcs. Not that the other ones are bad but they feel repetitive.\\n\r\n[Art]8/10\\n\r\nThe anime's art style was really good ironically art wise each heroine looked different & felt different. The atmosphere & town looked great there was great attention to detail in art. The studio did a great job to ilustrate this anime.\\n\r\n[Sound]9/10\\n\r\nSound wise this anime had great attention to background & atmosphere the noise of animals, in between day & night was great. Also this anime had a great op & also great endings themes for each heroine.\\n\r\n[Character]8/10\\n\r\nThe character development in this show was amazing truly one of the good things it has going for it. Each character personally felt different in comparrisson to their story lacking counter part. Also the whole heroine cast has great synergy with the main protagonist. \\n\r\n[Enjoyment]7/10\\n\r\nThis anime offers pretty good enjoyment although it feels that the plot doesn't move forward or at really slow pace which takes away from the full enjoyment of the series. Otherwise it could have been one of the most enjoyable anime of the season. \\n\r\n[Overall]7/10\\n\r\nThe anime was good with all the flaws it had they manage to leverage in some other aspects like the character development made up for the lacking story elements. Seiren is not a must watch, but a should I watch hardcore fans of romace anime are going to find good in seiren lets hope for a great second season cause we know there is a whole cast of other heroines to cover.\\n",
            "date": "2017-03-27T18:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 243738,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5698059.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/alchris97",
                "username": "alchris97"
            },
            "url": "https://myanimelist.net/reviews.php?id=243738"
        },
        {
            "content": "So, a romcom, harem based anime has just ended for this 1st part of Winter 2017 season, now it's pretty obvious that this is a spin-off of Amagami SS, where it involves one guy with a harem allocated in each arc, now even thought both have different studios and producers, for some reason the setting where the same and so as the uniforms, so, here is how I rate this 12 episode anime:\r\nStorywise: Ok, so let's get over each arc\r\nTsuneki Hikari arc: It was set in some remote place where it's summer and the guy has decide to attend some kind of \"save Our Score\"seminar, with Tsuneki who reluctantly tagged along m just as know know if Shouich rant her out about her having a part-time job. Now, that's is quite cheesy to start her arc, you tagged alone just because you suspected your classmate as the one who rant you out is outta her mind, also the romance she had with with the guy was more like a play thingy and I really find it, too, annoying that the guy should have just broken up with that bitch.\\n\\n\r\nToru Miyame arc: This arc is more like a sotacon thing, since it involves a quintessential sempai romance, her's was complicated kind of romance , co'z of the fact that she's has something against who seemly doesn't share her gaming addiction. Her plot arc, wasn't something that can be understood , due to all kinds of hairy compromises, reason and other things that one such as me , would wanna just go in there and hit someone with a paper fan on the head, now let's face it, the complications were simply added just to keep up with her 4 part arc.\\n\\n\r\nKyouko Touno arc: Here we have the quintessential kohai thing, here is an arc that one can relate, since there is a struggle of being a childhood friend to being romantically involve with the guy, now, this for me was this anime's redeeming factor so, for her arc, I'm gonna gun for a \"Good\" 7.\\n\\n\r\nArt: well, artwise it was a bit different from Amagami SS, since both doesn't feature any panchira thingy around here, I'm gonna give it a \"Good\" 7 since it was decent in a way, but the score was for Tsuneki's sexy summer out fit and since she is the only one who was in a bikini in her arc.\\n\\n\r\nSound: I'm just gonna give it a \"Fair\" 6 since I have no comment as to who did whose voices here, but I kinda like the opening theme, but not much.\\n\\n\r\nCharacters: Since I did mentioned that this is a spin off of Amagami SS, now, the characters maybe different, but, the personalities of the characters here are still the same, in Amagami SS there is one guy to six girls ratio, here it's just one guy to three girls ration, however, here, the girls themselves were a combination of other personalities of the characters from Amagami SS like :\\n\\n\r\nTsuneki Hikari: her personality is a combination of that of Ayatsuji Tsukasa's sadistic and ambitious trait with that of Morishima Haruka's flirtatious and playful trait.\\n\\n\r\nMiyame Touro: Hers is that of Nanasaki Ai's aloofness and stoic personality combine that with Tanamach Kauro's independent mindedness.\\n\\n\r\nTouno Kyouko: She has Sakurai Ryouko's flare for anything that is edible and artistic side, she also has Nakata Sae's naive and insecurity side. and just like  Ryouko she too is classmates  with the guy's sister and she also has two club sempai's who also has the same characteristic but different names, like Koharu Uno who replaces Ruriko Yuzuki from Amagami SS and Nao Tokioka who also has the same wired personalty of that of Hiba Manaka who is also from Amagami SS.\\n\\n\r\nAlso let's not forget Kamita Shouichi who is basically the same as Tachibana Junichi, both in role and personalty, so from here is is really a \"Mediocre\" 5.\\n\\n\r\nEnjoyment: Well, I basically have some reservations t the first two arc, but then again having the 3rd arc is good , but not very good, just a \"Good\" 7.\\n\\n\r\nOverall: it's \"Good\" 7, it's decent, but the first two arc were just too complicated and annoying, it was just the 3rd arc that has made a difference with this anime, yes it was good enough, but not good enough to for studios Gokumi and  AXsiZ , to make additions like a pic drama or any OVA's for that matter.\\n\\n\\n\r\nWhoahoho OUT!   \\n\\n\\n\\n\\n\\n",
            "date": "2017-03-26T12:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 243607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 1,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=243607"
        },
        {
            "content": "-I'm sorry for all mistakes, english isn't my native language-\r\nI'll start right off the bat. I'm enjoying Seiren so far. It's simplistic, yet kinda stupid, both story and characters are often enough to make me smile. But i'm really far from saying this anime is any good. But as much as Seiren has problems, i can't name it \"the worst thing ever\"\r\nStory & Characters - 2\r\nSeiren doesn't have absolutly anything good or original in itself. All characters have really strong drawn personalities which we've seen in maaany other series. I think the only good point here is perverted protagonist in world of \"Ordinary\" people. Samestory with story. Seiren has 3 arcs and every one of them tells a story how our protagonist is getting together with each of 3 main heroines. Such type of plot clealry block any posibillities of character development, that's why our characters stay with the same personality for entire series. As even worse, it heavly brokes immersion, because of which we feel like we couldn't care less for our heroes.\\n\\n\r\nArt - 4\\n\r\nBackgrounds look fine, there is not too many detals in them. But characters design really disappoints. All female characters look really similliar, because of which i pretty often had problems with distinction them.\\n\\n\r\nSound - 3\\n\r\nSoundtrack is forgettable and sometimes it doesn't fit with what is happening on the screen. Opening isn't something amazing, i was skipping them after the first listen, endings don't sound too appealing either.\\n\\n\r\nEnjoyment - 6\\n\r\nOk, Seiren definitly isn't a good series, or even medicore. Objectively looking, it's really bad, something between 2-3. But for unknown reasons... i had fun (or have, the show is still going on). Maybe weren't these the best moments of my life, but i don't really regret time spended on this series. Of course, seiren still is a bad anime, but if you can \"turn off\" your brain for these 20 minutes, you can have some actual fun. It looks like sometimes you need something to just laught off and spend free time on something nonsenical... but yet, there are waaaay better series this season for a good time, like Second Season of Konosuba or Little Witch Academia. You can take Seiren just when you think you saw everything good this season.\\n\\n\r\nOverall - 4",
            "date": "2017-03-13T10:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 242479,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4564638.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/gingerbrad",
                "username": "gingerbrad"
            },
            "url": "https://myanimelist.net/reviews.php?id=242479"
        },
        {
            "content": "No spoilers up ahead.\r\nIf you're looking for a staple omnibus format anime akin to the likes of Amagami SS, this anime is for you. Every four-episode arc is indicative of a distinct route the protagonist takes with a different girl who he becomes initially acquainted with, ultimately leading to a specific culmination of experiences with that very girl. \r\nThe first arc is with Tsuneki, and the second is with Miyamae Tooru.\r\nAdmittedly, the first arc could have been a bit better, but the route is quite respectful of realistic occurrences. The second arc, however, is a much better journey, and sets a high standard for thesubsequent arc. The sublime artwork and distinctly paced episodic storyline is a fresh, albeit not completely out-of-the-box, take on the genre this anime belongs to. \\n\\n\r\nYou'll only know if you like the anime if you watch it. But do remember, the second arc (Episodes 5-8) is far better than the first one (1-4) - so expect to like some arcs much more than the other.",
            "date": "2017-02-24T18:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 241312,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BBBBBBBBBBBBE",
                "username": "BBBBBBBBBBBBE"
            },
            "url": "https://myanimelist.net/reviews.php?id=241312"
        },
        {
            "content": "I'm just going to say it outright; if anyone is going to remember this anime at all, it will be as Amagami SS's eccentric little sister. The \"eccentric\" part comes from the fact that the story presents some rather bizarre events and quotes, while the \"little sister\" part comes from not only the fact that it not only noticeably comes from the same universe, but a couple of the characters are actually younger siblings of Amagami SS characters! (Let's not forget the omnibus format both series share, too.) In fact, this connection with Amagami SS was why I selected this anime to be among thosefrom the Winter 2017 anime that I watched in the first place; in spite of this decision, however, my expectations were actually quite low. Unfortunately, I was proven right.\\n\\n\r\nLadies and gentlemen, welcome to my review of Amagami SS's eccentric little sister, \"Seiren\".\\n\\n\r\nSeiren follows the romantic misadventures of Shoichi Kamita, a second-year high school boy. Similarly to Amagami SS, four episodes each cover the heroines that Shoichi ends up romancing, except the number of girls is halved this time. First, we've got Hikari Tsuneki, the cheerful \"idol\" of Shoichi's class with a secret job at a restaurant. Then, we've got Tooru Miyamae, a gamer girl who joins Shoichi and his friends in playing what I've come to think of as \"a deer version of Pokemon\". Finally, we've got Kyouko Tono, Shoichi's childhood friend who just joined the Home Economics Club. As time goes on in each of the girls' arcs, Shoichi becomes closer with either one of these girls and gradually falls in love with her....whether or not he actually has any chemistry with any of them.\\n\\n\r\nWhat could I possibly mean by that last sentence? I mean exactly what I said; Shoichi does not have very strong chemistry with any of these girls. I mean, when you're creating an anime with this format, it's hard to build a strong connection between our protagonist with all of the girls he gets with, but there's bound to be at least one girl who has a believable relationship with him. Unfortuately, in Seiren, there is none of that; in the best case scenario, I would see Shoichi and the girl whose arc is ongoing as just friends, and that's pretty much it. Each of their stories suffer a bit because of this, too, and when an anime's story is taken down with two characters' chemistry, especially when it's done three times in the same series, we've got ourselves a bit of a problem. Although the story can surprise you with its bizarre ideas at times (for example, there is a character with a real thing for bunnies), it doesn't help too much.\\n\\n\r\nNow, let's discuss the characters. I remember liking Junichi, the protagonist of Amagami SS, a lot, especially since he had what Shoichi didn't: a believable personality. Shoichi, on the other hand, is a rather boring main character with little personality; it's not as easy to root for this guy. The heroines aren't much help, either. While Hikari is definitely the most interesting of the bunch, it really didn't feel like she got a lot of development, so I couldn't get myself to like her. Tooru had potential, but as time went on, she seemed to become less and less of an interesting character; by the end of her arc, I had given up on her. As for Kyouko.... ugh, where do I even begin? Out of all of the heroines - no, out of all of the characters, period - she has to be the character, or at least one of the characters, with the least amount of personality, and I honestly felt that her relationship with Shoichi, as well as her entire arc, was the weakest. Out of the supporting cast, there are a few memorable characters, but most of them are pretty forgettable.\\n\\n\r\nThe animation, done by Studio Gokumi, wasn't terrible; sometimes, the movement of the characters was a bit awkward, but for the most part, it wasn't terrible. After all, a particular diamond in the rough from Seiren came from a beautifully-animated scene in episode 4; I won't say what it is because of spoilers, but anyone who has actually watched this series might know what I'm talking about. The voice acting wasn't too bad, either; for the most part, the voice actors played their roles well, although some weren't really as good. The opening and endings themes were also nice to listen to, albeit not songs to listen to over and over again.\\n\\n\r\nOverall, Seiren was a below-average anime. I won't stop you if you're desperate to watch it, but if you're looking for an anime with an omnibus format where the protagonist ends up with more than one girl in more than one alternate universe, I'd prefer that you watch Amagami SS. I mean, let's be honest; it's more memorable than Seiren.",
            "date": "2017-04-06T20:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 244893,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=244893"
        }
    ],
    [
        {
            "content": "This review contains mild spoilers. \r\n--------------\r\nSeiren offers an insurance policy against the inherent risk of harem anime. You don't have to worry about best girl getting her heart torn to shreds by some milktoast dude choosing the worst possible option. Instead, the milktoast dude chooses every single option in different timelines. Everybody wins!....or do they?\r\nWhat Seiren gains in having multiple routes it loses in meaningful character progression. You won't feel the ultimate satisfaction from watching two lovers grow together over a dozen episodes nor is there any conflict to set up an emotional payoff. This problem is further compounded by boring character designs barely distinguishingeach heroine from the other and the bizarre decision to not have the most interesting girl, Hikari, end up in a relationship with Shouichi. She decides it's more important to focus on her career and never talks to him again until a random five year timeskip where they run into each other in a shop, The End.\\n\\n\r\nShouichi is your standard harem protagonist with zero motivations, zero backbone and zero backstory explaining his personality. There's absolutely nothing going on in his life aside from these random hot girls who want his dick. There's no reason to give a fuck about him and his relationships. Why should anyone root for his success?\\n\\n\r\nIn Seiren's spiritual predecessor Amagami SS, lead character Junichi got stood up by a date on Christmas. The pain from that night gave him a complex about being rejected. We as viewers were given a reason to cheer for his success, bringing a level of catharsis to each arc where he got over his mental hurdle. Amagami SS had better arc resolutions, better designs, 26 more episodes to explore it's concept and most importantly - better girls. There is more personality in the hair of Kaoru than anyone in Seiren altogether.\\n\\n\r\nThere is still merit in watching Seiren if you desire a basic eroge game styled rom com. The girls are cute. The OP/ED themes are catchy. There are certainly some beautiful moments, most notably the underwater kiss in episode 4. Seiren has good qualities, they're just interspersed in an overwhelming dredge of crap that only the most tolerant of romance fans can hope to shift through. If you aren't in that crowd - avoid this like the plague and go re-watch Amagami & Kimi Kiss Pure Rouge for your fix of a satisfy all romance anime.",
            "date": "2017-03-23T10:58:00+00:00",
            "helpful_count": 117,
            "mal_id": 243255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/259533.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/84DaysWithout",
                "username": "84DaysWithout"
            },
            "url": "https://myanimelist.net/reviews.php?id=243255"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nBrace yourself, this is basically a long rant. My beliefs and score are subject to change as the anime goes on.\r\nFirst of all, I WAS excited for this anime, just as I was excited watching Amagami SS. They both follow the Visual Novel-esque story telling that allows each main girl to have their ending with the main character. Unfortunately, Seiren disappointed me throughout the entire first arc, and I will probably drop it if the second arc doesn't impress me. I'll be reviewing in order of (personal) importance, as always spoiler alert.\r\nART- 4: The art is fairly standard. Warm colors with lighttones for the characters and backgrounds. The main male characters look fairly generic and the female main characters actually seem pretty pleasant, if a little bland. There's nothing off about the art, but nothing \"great\" either.\\n\\n\r\nMUSIC - 3: The fact that I don't remember any of the music/didn't stop during scenes to comment on it means it wasn't really memorable in the first place. Nothing really stood out.\\n\\n\r\nSTORY/CHARACTER (Their problems go hand in hand) - 2: \\n\r\nHere's where it really starts to fall off.  Amagami SS explains the protagonist's backstory, it helps sets the pace for his intentions. There is no \"backstory\" for any character whatsoever, motivations are set as \"I'm a high school student who doesn't know what I want to do in life.\" It's a fairly bland and common story, nothing super unique. The story seems to be the MC learning what he wants in life through his experiences with his love interests.  Although this isn't a bad story in and of itself, it is presented terribly. Most of the MC's initial aspirations come off as half-assed. Not only that, the influence from his love interest is minimal (at best), and hardly pointed out throughout his supposed \"growth\". As for \"growth\" I'll separate it as best I can, \"character development\" and \"relationship development.\"\\n\\n\r\nFor character development, the female lead (Tsuneki) gets absolutely no development whatsoever until the last episode of the arc. At this point she suddenly decides that everything she went through for the MC helped her figure out her calling in life. The MC, on the other hand, is completely inconsistent throughout the story, and many of his actions hardly make sense until the very end.\\n\\n\r\nIn a romance anime, the relationship development aspect of the story is the most important. Their interest is made expressly clear throughout the episodes. The progress they make is mainly shown through random outbursts the MC has that make Tsuneki blush, and Tsuneki randomly flirting with the MC and doing things for him a mother or wife would do.  They do have some cute moments, but nothing I could consider \"progress\" until the very last episode where they kiss and talk about the future. \\n\\n\r\nIf the main progress in a character (Tsuneki specifically) AND a relationship comes in the last episode, it spells a recipe for disaster. That is simply what the story and characters are. The premise is bland, the development is close to nonexistent, the MC is inconsistent and I see no reason why she falls for him.\\n\\n\r\nThe worst part is, by far, the \"closure\" of the first arc. Seiren threw Amagami's \"closure endings\" out the fucking window with a friend-zoned MC and a \"Fateful encounter years away with no real conclusion.\" I understand the whole \"open-ended, you make your own ending\" thing but it literally throws what little progress they made into the air and crumbling back down. It's an entire reset to their relationship, which rarely works.\\n\\n\r\nENJOYMENT - 3: You really think after coming this far I'm gonna say I \"enjoyed\" it? Nope. I've enjoyed medical procedures more than going through this cringe worthy mess of a story.\\n\\n\r\nOVERALL - 3: Absolutely nothing in the anime goes above what I can describe as \"decent\", and the most important aspects of a romance story ended up as the worst offenders. I'm dreading continuing it and may change this review depending on the future stories, but at the moment I can't say anything good about this anime. \\n\\n",
            "date": "2017-01-27T22:27:00+00:00",
            "helpful_count": 113,
            "mal_id": 239282,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6013074.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/-Crucival-",
                "username": "-Crucival-"
            },
            "url": "https://myanimelist.net/reviews.php?id=239282"
        },
        {
            "content": "I felt compelled to write a review simply because of all the negative reviews. The negative reviews are absurd for this anime. Most sound entitled simply because the characters and plot didn't go according to how they wanted them to go or meet their benchmark expectations. \r\nThe reality is, if you can't go into a new anime without expectations or comparing to some of your other liked anime, you'll never enjoy it. The anime is still on-going so I'll provide the critique I have so far. \r\nArt: Nothing special, but nice. The characters do have a unique look to them, a little sharp on theedges, but nothing to complain about. It's enjoyable art. \\n\\n\r\nPlot: The plot has been nice. It's a High School Romance setting with a sprinkle of Slice of Life. The story develops smoothly and naturally. The protagonist is a cringe-watching character that gets nervous around girls. His main focus is on graduation exams but encounters a girl that playfully teases him. Due to pretty realistic events that could be seen in real life, both characters are put in situations to develop their relationship. They slowly, but naturally began to develop feelings for each other. First as friends and then as something in between a confession and friendship. The plot highly focuses on the development of their relationship so that's what's special about the first few episodes. Although it does not lead to anything, I think that is the uniqueness of the plot.\\n\\n\r\nThis is not a plot that jumps around or with a random sudden romance. \\n\\n\r\nCharacters: The two main characters are the stars here obviously. The characters eventually develop romantic feelings towards each other, but what's nice about it is that's it's pretty realistic and natural through continued interaction and getting to know each other. Unintentional and unexpectedly, the female character develops these feelings. The guy already had some kind of feelings for her with low expectations, though. A friendship seemed as his expectations. As hints and signs develop, things seem like they're going to go somewhere, but they don't. People might be upset about that, but is something that can definitely happen for the reason it did happen. \\n\\n\r\nEveryone else does a good job in their roles. Characters show humor, kindness, jealousy, interest, etc. It's a fun watch and would recommend so far.",
            "date": "2017-02-02T13:28:00+00:00",
            "helpful_count": 64,
            "mal_id": 239754,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3434419.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ATasteofAnime",
                "username": "ATasteofAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=239754"
        },
        {
            "content": "Teenage hormones are a powerful thing. The trials and tribulations we went through in our adolescence involving relationships and such can seem trivial by comparison to our current lives, but when we were in the moment they seemed so monumental. Whether it was timidly asking a girl out for the first time, or the lucidity and nostalgia of a summer romance, not much can compare to our teen years. Seiren randomly popped up on my radar before the winter season started (probably due to the plethora of attractive female character models), and after its conclusion I can assuredly say two things:\r\nAs a married man inmy late twenties, I am clearly not this show’s intended audience\\n\r\nBeing a teenager is awkward, and it doesn’t translate to quality entertainment\\n\\n\r\n“Seiren”, meaning honest in Japanese, is just that. It tells three girl-centered anecdotes from highschooler Shouichi Kamita’s life, a life in which there are plenty of perverted inner monologues and awkward exchanges with females. The writing is actually pretty accurate given the subject matter, but it doesn’t make the anime any better. Kamita gets nervous around basically every girl he meets (surprise!), with a relatively introverted attitude and a love for gaming. He’s also not that great of a student, or good at pretty much anything he does.. So he’s essentially the anti-Gary Stu character. Each story gradually develops a teenage romance, one scene at a time. Although the result of each relationship is often disappointing or lackluster, the buildup is the real focus of the writing.\\n\\n\r\nAs boring or predictable as Seiren is, the writing is quite accurate. Whether it’s the slow burn of the romance itself or the fickle nature of Kamita’s female counterparts, the writers nail teens in a nutshell. Awkward, irrational and hormonal. That’s not to say that Seiren has a “good” story, because there’s only so much enjoyment one can have in watching two people fumble over themselves for 20 minutes at a time. There’s lots of eye-rolling to be had here. Not to mention the melodrama is thicker than Chun-Li’s thighs. Oh, and the constant blushes emblazoned on the face of Kamita and his peers is mind numbing.\\n\\n\r\nThe main problem I have with Seiren is that the subject matter is just, dull. There's quite a bit less comedic dialogue than a normal slice of life, and the relationship building and love scenes aren't nearly as strong as a romance anime. It's essentially having the worst of both worlds, which for entertainment’s sake, is never a good thing. Would you want to watch a show about your awkward teenage years with lots of missed connections, social inebriation and awkward conversations? I think not. It's why we get older and grow up (at least some of us do), and I can't imagine many of us would care to relive that profound age of existence. It'd be one thing if the relationships “went” anywhere, but again they are stifled by abrupt changes in the way someone “feels” about moving forward. That or the writers play out “what-if” scenarios in which Kamita succeeds in his apparent life goal of becoming a school bus driver. I can't make this stuff up.\\n\\n\r\nCharacter wise, Seiren makes an attempt at creating diverse and complex characters. Unfortunately the anime falters in this respect as well. Although Kamita represents an awkward high school teenager decently, this is the same old character trope we've seen time and time again. He's virtually indistinguishable from some other SoL protagonist I've seen in the past, and the repetition is really starting to get tiresome. Tsuneki is quite easily the most dynamic character in the entire series. She's popular, pretty and wants everyone to know it, most notably Kamita… who for some outlandish reason she acts like a tsundere to. Apparently all it takes for her to fall for him is a few gauche interactions at a summer study camp and him accidentally popping a boner in the men's washroom. But this sizzling romance is quickly extinguished when Tsuneki makes the abrupt announcement that she wants to pursue life as a chef… which evidently can't involve boys whatsoever. \\n\\n\r\nNext up Tooru Miyame, or as I like to refer to her: every teenage pizza-faced nerd’s unicorn. A hot girl that plays videogames, and is actually good at it? Not to mention that she’s single and ready to mingle with our main protagonist? Ok, this one is straight up in fantasyland. Through my time in YouTube I've actually met some decent looking girls who are into gaming, so that part’s not entirely out of the question. The most implausible factor is how easily she is drawn to the charismatic Ken doll himself. The writers attempted to use the two character’s common interest of video games to create a relationship between them. The result? Unbelievable at best. They even go as far as to paint a future with a child involved at the conclusion of the arc. This is just bad writing. \\n\\n\r\nLastly, we have the obligatory “young crush”. Every guy that's ever become a senior in high school can admit to having an interest in a younger girl. That's just how testosterone works. In effect, the storyline is probably the most believable of all three. A cute underclassmen shows up, is extremely impressionable and wants to experience the elusive romance she's read about in teenage manga. The result is a morally questionable relationship that is never meant to go anywhere and spawns a “what if?” scenario of its own. The least entertaining of the three arcs, but probably the most believable. It's a shame they saved it for last.\\n\\n\r\nThe animation and art style in Seiren is attractive in some scenes and dull in others. The inconsistent nature of this plagues the side characters because their models are virtually carbon copies of each other. This could make for some confusing moments in the series where you're not entirely sure who's talking at a given moment. Luckily the girls are pretty cute, which is what I think initially brought me to the show. It's okay, but we should be a bit more detailed in 2017.\\n\\n\r\nThe sound is pretty atrocious. Neither the opening or the endings were really that convincing in making me want to watch the show, in the background music is virtually absent. The voice acting is mediocre, and really could've benefited from having a big-name actor accompanied to the anime. It was like listening to the lite version of your standard slice of life series.\\n\\n\r\nUnless you're a glutton for punishment, or really enjoy watching teenagers stumble over there words professing their love for each other, I would say avoid Seiren at all costs. It can be quite boring at times, and there isn't anything in service to take your mind off of things. Combine this with blend art in nonexistent music and you have a recipe for a snoozer. this is not a show I can recommend to anyone, and is possibly the worst series I watched this season. As always, thanks for checking out the review and be sure to look out for my other winter 2017 reviews this is not a show I can recommend to anyone, and is possibly the worst series I watched this season. As always, thanks for checking out the review and be sure to look out for my other winter 2017 reviews!",
            "date": "2017-03-23T11:46:00+00:00",
            "helpful_count": 37,
            "mal_id": 243259,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3895399.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/themegamancave",
                "username": "themegamancave"
            },
            "url": "https://myanimelist.net/reviews.php?id=243259"
        },
        {
            "content": "If I had two words to describe Seiren, one would be “uninspired” and the other would be “bizarre”. I’ll be honest, I’m one of those consumers that values unquantifiable things like creativity, innovation and, if at the right time, something that pushes the boundaries of the medium.\r\nI don’t expect all shows to have this sort of thing, after all part of why I value those things is because of their sparsity within the medium. More often than not I just come across shows that have varying extents of those things and that’s definitely serviceable; I’m not expecting every show I watch to be the nextMushishi or Millennium Actress. Every shows at least nudges some kind of boundary within the medium and that alone is usually somewhat entertaining to watch.\\n\\n\r\nBut let me just say that the only boundaries Seiren pushes are the number of fetishes it can pander to. Boobs and ass are the prerequisites, but legs, feet, navels, urophilia, coprophilia, plushophilia, exhibitionism, BDSM, and whatever the scientific term is for arousal from chicks that look like animals. \\n\\n\r\nAs I said before Seiren is bizarre, it’s this high school romance show with a mixture of issues that range from inherently poor writing to flatout awful production—the way these episodes are organized and put together don’t even work as a saving grace for the show. Hell even the art quality goes to shit quickly. But this incongruous mixture of issues pulls out a show with just some bizarre moments… Man, I consider myself to have a fairly strong command of the English language, but I can’t help but keep circling back to this same word. It’s not even bizarre in an overt fashion like JoJo’s Bizarre Adventure or anything, it’s just these subtle bizarrities that spawn from things like retconning or overall poor writing. \\n\\n\r\nCharacters who are introduced to be petty and resentful, and warned about with lines like “oh you don’t want to get on her bad side, otherwise all the girls in the school will be against you” suddenly turn into magnanimous priests who bestow forgiveness upon those whose sins include lying, betrayal and infidelity. Things like that could really be justified with a small shard of personality, but because of lack of oversight it’s not thought about at all, and when they play out towards the end of arcs it just comes off as bizarre.\\n\\n\r\nAnother example of a bizarrity within the show that really got me laughing was when Kamita nonchalantly pulls out a fucking PSP from his trousers and starts googling the meaning of words mid-conversation. Like, if the Googling of things mid-conversation isn’t strange enough, why is he doing it on a freakin PlayStation Portable? What happened to smartphones? Then it’s put away and never mentioned again. What the hell? Why include strange things that raise questions and not address them? Who goes to school with a PSP in their trouser pocket?\\n\\n\r\nThe shows omnipanderance also compounds onto its already bizarre subtleties, you’ll have a character walking down the street, seemingly musing an innocuous thought that actually turns out to be a BDSM-fetish fantasy, and it’s just dismissed as normal! Where does this come from!? \\n\\n\r\nThe protagonist Kamita is a pussy, for a lack of a better word. Actually, there are plenty of better words, but I’m gonna keep calling him a pussy because this major league dork will cum in his pants at the slightest interaction with a girl. Girl does his laundry? Girl brushes her arm against him? Girl shows her bellybutton? Oh this is too much! I’m gonna bust! I legitimately hate Kamita because he represents this trend of anime protagonists that collectively form a malignant tumor within the medium, metastasizing throughout each and every genre whilst promoting this “stuttering, breathless beta-male gets hot chicks” agenda of sorts that is honestly just dreadful. Seriously, fuck this guy.\\n\\n\r\nThe show’s 12 episodes are evenly divided into three separate arcs, all involving a different female lead, with the a convenient time reset after each arc ends. This division of episodes is much better in theory than it is in practice, because for some reason studio Gokumi thought it was logical to begin with the best girl and then just regress into more and more generic leads and arcs as the show progresses. The first girl Tsuneki is by far the best in the entire show as she possesses a rare trait the other girls do not: a distinct personality.\\n\\n\r\nTsuneki is unique and dynamic, a character that exudes confidence and terrifying levels of spontaneity, always keeping you on your toes and wary of her next actions. She’s frisky and intimate, and is a character you won’t easily find in any other high school romance show. What this show does with her and her arc is not only laughably bad, but also just straight up bizarre. After Tsuneki it’s all downhill, the female leads just become more and more generic as the show progresses.\\n\\n\r\nThe next girl is Tooru, that one girl who has a smooth voice, and is cool, calm and collected at most times. She’s also a gamer girl, which apparently constitutes “original” in the eyes of studio Gokumi.\\n\\n\r\nThe finale female lead, I think her name is Kyoko or something (who actually cares) is by far the most generic; it’s like the writers just gave up at this point. A soft-spoken, innocent childhood friend who’s only meaningful development is understanding that yes, taking a male, childhood friend to shop for lingerie with you is indeed weird, and so is asking him if those rose-coloured panties look good on you. \\n\\n\r\nIf you hadn’t already guessed it, one of Seiren’s biggest problems is, like many other anime, pacing. Four episodes doesn’t give anyone much room to work with when trying to develop a natural, romantic relationship between two leads. Trying to replicate something as special as the blooming of love takes care and time, it’s something that stems from allowing characters to bounce thoughts and emotions off of one another and letting intangible things like their chemistry develop naturally. The spontaneity of the first girl, Tsuneki, made that task marginally easier, but four episodes is simply not enough. It’s frankly a little depressing how they took a great character with a stellar character design and an outstanding voice actress and threw it all out the window by trying to rush her whole relationship with Kamita in four episodes. \\n\\n\r\nSeiren is an uninspired, bizarre, clichéd high school romance show that manages to follow virtually every convention one would come to expect from the genre, only ever subverting it in unrealistic, often cringeworthy ways that leave you questioning the bizarrity of what you just watched. It is simply lame, pointless, represents many of the horrible trends in this medium and somehow adds onto that list with its incessant omni-pandering to fetishes. I wouldn’t recommend this show to anybody. \\n\\n\r\nI hope this review was informative and helpful. And maybe got you to smile a bit as well.\\n",
            "date": "2017-03-25T12:24:00+00:00",
            "helpful_count": 27,
            "mal_id": 243507,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5352541.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Adi",
                "username": "Adi"
            },
            "url": "https://myanimelist.net/reviews.php?id=243507"
        },
        {
            "content": "I was looking forward to this show. Not because of the content, the content seemed to be your standard toolkit for escapism and wish fulfillment for a certain subset of the viewer base (the opening makes that very clear), but because of the fact that this is the only original anime that I know of to adopt the omnibus format. The omnibus format is essentially where the anime diverges from one point in time to show multiple 'what-if' scenarios. In Seiren's case, the format shows us multiple arcs, each independent from each other, where the MC becomes involved with a certain girl in each arc.\r\nSeirenis more or less an indirect sequel to Amagami SS (which I dropped), an anime that adopted the same format. I have to admit, Seiren is better than I expected. The story was compelling enough to make me want to watch it; watching it didn't feel like a chore. The tone is quite lighthearted and considering the tone of Amagami, we can safely assume this will continue to be the case. I also liked the direction the fourth episode took (the concluding episode of the first arc). \\n\\n\r\nThe characters actually had some semblance of depth to them. Sure, a lot of the moments had me rolling my eyes, but hell, I feel like rolling my eyes when I think of my teenage years, so it's only natural i'd feel the same when watching an anime set in high school. If anything, i'd say that is a sign of good writing. \\n\\n\r\nThe fan service wasn't as off putting as I thought it would be. It actually didn't feel that tacked on, which was surprising considering they seemed to have (if memory serves) ramped up the fan service from Amagami \\n\\n\r\nThe character designs have the same problem as Amagami. Some girls, particularly the minor characters, are drawn so similar sometimes that it is hard to tell them apart (especially since you don't see certain characters often). The art is good otherwise. \\n\\n\r\nThe music hardly had a presence. It might be this series' weakest point. The OP and ED are nothing to write home about either. \\n\\n\r\nTo conclude, I think that Seiren might turn out to be better than Amagami. I don't think it'll be anything that special, but I hope it leads us to getting more original anime that use the omnibus format. \\n\\n\r\n***Update: I ended up dropping Seiren. It was just mediocore. \\n",
            "date": "2017-01-26T22:25:00+00:00",
            "helpful_count": 18,
            "mal_id": 239204,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4263391.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gerhakiki",
                "username": "Gerhakiki"
            },
            "url": "https://myanimelist.net/reviews.php?id=239204"
        },
        {
            "content": "Omnibus Format,  is a type of story-telling that divides the whole series into multiple arcs each dedicated to a certain girl which the main characters gets a romantic relationship with. When an arc concludes, everything resets back to the beginning with an all new storyline and characters to follow. The most well-known series that features this kind of story-telling is Amagami SS which is pretty much the spiritual predecessor to our newest addition Seiren. Seiren, an original series made in collaboration with Studio Gakumi and Studio AXsiZ, aired this Spring 2017 is the newest series to feature omnibus format of story-telling. I personally thinkthat Amagami SS is a good show so I was pretty hyped when Seiren was announced but honestly, it didn’t live up to my expectations. There were a lot of flaws that I’ve noticed all throughout the show. To explain further let’s just start the review.\\n\\n\r\nStory\\n\r\nThe story follows Shoichi Kamita as he develops relationship with different girls during high school. Each girl is dedicated to their own arc which follows a unique storyline. A single arc is composed of four episodes each and tells how the main character gets involved into that certain girl, how they developed their relationship and how they ended up in the future. Yeah you heard that right, all of that content in only four episodes. But that isn’t really the problem and even if that wasn’t the case, I’d still be bothered anyways. None of the storylines that the arcs followed are compelling or even interesting.  Each of them has their own fair share of weirdness and cringe. And the conflicts that serves to brighten up the storyline makes little to no sense at all. Fan service is seemingly dominant and the amount of romantic scenes that can establish a concrete relationship between the characters is lacking. With regards to characters development, you can’t really expect much from a show that features an omnibus format of story-telling. Though I can tell, the character development is somewhat there but you can’t really feel it knowing that after the reset, all the connections between the viewers and the characters will all be lost anyways. Viewers who are new with omnibus format will probably encounter this problem but those who have watched similar shows firsthand will probably be fine with it. But beyond all of this, there’s something I’d like to point out and is something that I really praise from the show. Even if the arc that a character is dedicated to is already over, the characters still appear in considerable amount of screen time and throughout the following arc. They appear merely as supporting characters but with quite relevance with the storyline. This feels as if the characters are given a lot of importance. But I guess this is possible because Seiren is an original and not a visual novel adoption unlike other anime of the same league. \\n\\n\r\nCharacters\\n\r\nThe main character of the show is just your typical beta mc that always blushes to whatever a girl does in front of her. There’s really no revealing trait to mention for the main character. He’s just your generic harem main character though I can’t really say that this show is a harem. So having a generic main character, it’s clear enough that the female characters should lead the show. The female characters are likable and appealing. Their character itself is just the right stuff to compensate what the main character lacked. As I mentioned, characters relationship in this show will come and go but not the characters themselves. There’s a really good set of supporting characters that really stood out to me during the whole show. They add up to the overall vibe of the show. So other than the main character, I don’t have any problem when it comes to the characters.\\n\\n\r\nArt \\n\r\nThere are some parts where the art shines and some parts it lacks. In general, the art is very vibrant. There are some notable parts where the animation will just blew you away. And the amount of detail is just right though a little bit more could have been better.  The character designs are also quite attractive. It pretty much reminds me of Amagami SS. Though unlike Amagami SS, I’ve noticed there’s not enough distinction between the characters. All the female characters have similar hair and the facial expressions are pretty much the same with all the characters. It’s really hard to recognize a character at first glance. But this isn’t much of a problem and I let it slide all the time. And still, I can say I liked the art of this show.\\n\\n\r\nSound\\n\r\nThere’s really not much to talk about when it comes to sounds. There’s really no memorable soundtrack that comes in mind when I think of it. The opening theme of the show is quite nice. The closing theme changes every arc. There’s nothing more to it that I’ve noticed other than these.\\n\\n\r\nOverall, I don’t think Seiren is a bad show. Maybe I expected a lot more but there are really a lot of obvious flaws in this show.  But I can’t say I didn’t enjoy this show. With all the laughs and weirdness this show offered to me, I say I enjoyed it quite a bit. So far, there are only three arcs featured in this show but it seems that there’s supposed to be more. If ever there will be a second season for this show, I’d give it another change.\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-24T17:26:00+00:00",
            "helpful_count": 11,
            "mal_id": 243425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5461087.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Fureiya",
                "username": "Fureiya"
            },
            "url": "https://myanimelist.net/reviews.php?id=243425"
        },
        {
            "content": "Recently, I read a manga about a geezer becoming young again through \"magic\". It was essentially a pseudo-reincarnation. Easiest way to spot a power fantasy. \r\nAnyway, geezer decides to drown us in nostalgia by setting up and ruling a dungeon like in RPGs of old. He summons a hot demon to oversee the construction. The hero (female) arriving to stop him is won over within a chapter. \"Ugly\" slave girl given to him as tribute is made beautiful in one fricking panel. Sounds typical? It is. Except he bangs all the girls.\r\nAnd boom, best harem MC ever. This turd is essentially Kirito in every form,but that one is bland writing, while here we have 'nothing but respect for this MC'. That is honestly the top comment on a chapter on Kissmanga. With 200+ upvotes. Just because, sex.\\n\\n\r\nThis just shows the mentality regarding bland MC's. If you want to check out the manga, I don't blame you, honestly.\\n\\n\r\nSo, Seiren. I could say it is a sweet romance. I could say 4 episodes is just right, without pointless rivals and irritating love shapes. I could say the art is decent, and the girls cute. \\n\r\n On the other hand, I could say it is nothing new. The girls all fall neatly into tropes we've seen before. I could say the characters are inconsistent wrt personality. I could say there is no romance or drama for a lot of the runtime, potentially making this a snoozefest.\\n\r\nI can say a lot of things, but most of them would be invalidated by the herbivore of a MC. \\n\\n\r\nDull, self insert MC's are the cancer of today's anime for many. Not the self-insert part, mind you. Onii-sama has 4k favorites. No, having a dull MC is the death knell of a show nowadays. Seiren is no different. Hard to care about his romance when the character is the definition of 'boring'.\\n\\n\r\nApparently, this sells in Japan. So we'll get more of such shows. There's nothing we can do. Or is there?\\n\r\nYou got me, this is not a review, but a petition for everyone to buy 10 copies of Inferno Coppu.  If it succeeds, studios take notice of it and we get more MC's on the level of Inferno Coppu. If it doesn't, you have 10 copies of the greatest thing to ever come out of the anime medium. \\n\r\nIt's a win-win honestly.\\n\r\nTill this revolution occurs, the only winners will be the studios making money of average titles like Seiren.\\n\\n\r\nSay no to mediocrity. Buy Inferno Cop today.",
            "date": "2017-02-20T00:18:00+00:00",
            "helpful_count": 11,
            "mal_id": 240977,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6052894.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 2,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/_alpha-q_",
                "username": "_alpha-q_"
            },
            "url": "https://myanimelist.net/reviews.php?id=240977"
        },
        {
            "content": "Alright, since all the reviews here are full of bullshit and too long to read I had to make one of my own. The anime had potential but at around the first girl they messed up bad, it was a major turn-off and since then it only got worse. The anime is really cliche and generic. It's awkward and boring. The main character is useless like in most of the anime these days. I don't recommend it, but if you are bored and you have nothing better to do with your life then it sure is a good way of wasting your time.",
            "date": "2017-03-28T09:55:00+00:00",
            "helpful_count": 8,
            "mal_id": 243797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/GuyInTheShadows",
                "username": "GuyInTheShadows"
            },
            "url": "https://myanimelist.net/reviews.php?id=243797"
        },
        {
            "content": "Seiren is a very visual novel-esc anime. Each story arc revolves around a romance with one of three different girl, Hikari Tsuneki, Tooru Miyamae, and Kyoko Touno.\r\nStory(6)- there isn't much for story here, it's just a romance series. the series is spit into three arcs. Each ending with the main character ending up with the individual girl, and the story restarts in the next arc. It doesn't go right back to the beginning, but rather after the point where the next romance option would come up. I can tell that the second and third arcs have some connection. I never really saw where Arc 2fit into there, but whatever. We know how each story will  end to a point. We don't know the specific ending or how we get to it. This story is fairly sweet at many points. I also really love how it's colder in the third arc, because it's around Christmas time, and I believe that the cold season is the PERFECT season for Romance. Something about the clothes, art, and the air just scream romance.\\n\\n\r\nArt(8)-Now to talk about the art. I really like the character designs. They look very nice, but nows to talk about the fanservice. There's fanservice here, BUT the fanservice isn't silly stuff like jiggle physics, and the more unreasonable. It's more realistic, like cosplay, swimsuits, or being able to see through the clothes a bit when in the water. They also use more detailed art in order to make the fanservice look good. I would also like to point out the amazing opening, that had some fantastic direction. Where it would show the girls and then they'd transform into test followed by shots of the girls doing whatever. That part where Shoichi kisses whoever is behind the curtain is also really good, because it show how the three girls' look pretty different, but have the same base design. That flowers in the opening were also really nice. The endings for the show also had really nice, visual novel-esc artwork, which is a nice touch.\\n\\n\r\nSound(8)- I LOVE the music in this show. My favorite piece is the opening, which might be my favorite opening from Winter 2017. I enjoy the endings as well. I can't remember them perfectly though. I enjoy the litle bits of background music that are here as well. The music here was done by Nobuaki Nobusawa, who did the music for series like Lord Marksman and Vanadis, Dagashi kashi, and Cerberus. This was my first encounter with him though.\\n\\n\r\nCharacter(9)- Now I will bring up that the main character, Shoichi, is very self-insert, which would be bad  in a series with dramatic stakes, but it's fine here, because the main focus is the heroins of the series. None of them are Tsunderes, Yanderes, Derederes, etc, etc. They do fall under a few archetypes, like popular girl, or childhood friend, but they have very likable personalities, and I would say that I would be interested in all three of them. Shout out to Hikari Tsuneki, who is best girl. She's a likable character, and probably the most important, because she's in every Arc, and its not just a cameo either, she plays a certain purpose in arcs 2 and 3. Even after her Arc had ended though, I could still route for the other characters to end up together, but Tsuneki is my personal favorite. I like the side characters as well, even if some of them were kind of weird in little ways, I had still enjoyed most of them. My favorites being Moene, Shoichi's older sister, and  Ikuo, Shoichi's best friend. I did find a few characters annoying, but they mostly fell under reason, as they would be people I'd find annoying in real life. I'll note that Shoichi does have some weird fetishes, but it's fairly standard for your average teenage boy.\\n\\n\r\nEnjoyement(9)- I really enjoyed this series, and it's a shame that so many people have been hating on it, because its a nice show to watch.\\n\\n\r\nOverall(8)- I think Seiren is nice series to enjoy. It's nothing grounbreaking, but its certainly enjoyable. I recommend trying the first 4 episodes before making a clear decision on it.",
            "date": "2017-03-25T20:05:00+00:00",
            "helpful_count": 6,
            "mal_id": 243540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5413433.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NG_Chloe",
                "username": "NG_Chloe"
            },
            "url": "https://myanimelist.net/reviews.php?id=243540"
        },
        {
            "content": "I went into this anime as a full-on Amagami SS fan. Something nice with great romance progression and a cute story. I was happy when I found out that Amagami was getting well...an alternate as one can say.\r\nThis review will be edited as each arc finishes.\r\nWas I satisfied? Well...yes and no.\r\nHere's why.\r\nWe have the setting to be set somewhat set in the same highschool from Amagami. NGL I was expecting some sort of cameos from Amagami characters. (Unless there was and I didnt see, if there was, tell me)\r\nTsuneki Hikari, Or should I say, Haruka 2.\r\nBoth have similar designs, and in a way, similar personalities(although I tend to find Hikari just a smudge hotter than haruka..Just a smudge) She is the first girl out of the 3 arcs.\\n\\n\r\nWas I satisfied with the Romance? Not really. Even so, I did enjoy the way the MC and Hikari interacted with eachother. But with only 4 episodes to work with, the romance progression or the character progression was pretty hard to try and pull off. There was little to no progression between the 2 characters. Then again, this is only 4 episodes, but Amagami was able to do some nice development in 4 eps.\\n\\n\r\nbut that doesn`t mean I was dissatisfied...\\n\r\nI had fun with this arc, I liked the characters and I loved some of the conversations they had. Even if there was very little progression, I had my fair enjoyment of this arc.\\n\\n\r\nIn conclusion..I guess, I just wanted more so that there was more room for romance progression, plot progression, and character development. \\n\\n\r\nHere`s hoping that the Tooru arc will be good. She`s the one I`m looking most forward to.",
            "date": "2017-02-01T14:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 239674,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5306763.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ItzToxic",
                "username": "ItzToxic"
            },
            "url": "https://myanimelist.net/reviews.php?id=239674"
        },
        {
            "content": "So when LA heard the same author of Amagami SS was going to make an original anime under a similar format, LA was first excited!, then immediately remembered the failure in the form of Photo Kano but LA was still excited nonetheless.\r\nLA will be tackling the plot by each of the girl's arcs (4 episodes each) in an omnibus format just how Seiren itself does it, so without further ado...\r\nHikari Tsuneki's arc is if anything is our introductory arc, showing us the characters, settings etc, as well as showing us the central girl for this arc Hikari herself. Hikari as as character if LA wouldsay in Amagami SS terms, she's essentially what happens if Haruka and Tsukasa mashed together. She's a rather soft yet brash tsundere who loves teasing our main protagonist and her voiced by Ayane Sakura in her tsundere vocals is typical that this character can come off rather *ahem* bitchy...LA however kinda found her character endearing, if anything her carrying her arc (instead of the main protagonist). The chemistry between Hikari and the main protagonist feels artificial to say the least usually because of the all the coincidences and forced teasing she does to him. Her arc later gets rather serious but again, Hikari solves it herself, making the romance even more forced to say the least. Hikari as a character gets more screentime even away from her own arc (quite clearly showing us the author's favourite in the process) and sure we get more development as it were from her but she is typically her tsundere self and not opening up as much (heck she didn't even open up even in her own arc!...unless you count the aftermath of the drama that occurred in her arc). Hikari is LA's favourite character in the series (tsundere are kinda thing for LA.......shut up!) but she had probably the worst arc in the anime and her arc just didn't do justice for Hikari at all...LA was expecting a Haruka & Tsukasa a la great romance...instead LA got a forced romance with a main protagonist who's out of his league and coincidences leading to a fated romance. \\n\\n\r\nTooru Miyamae's arc for LA is the literal middle ground for Seiren as an anime for LA, both being rather quirky in it's own weird way and showing it's weaknesses at the same time. Tooru Miyamae voiced by Shino Shimoji and her as a character is pretty fleshed out, being an open-minded gamer girl who thinks just a bit too much about games, she can be said to be a wish-fulfillment girl in a ways but she's packed with her own drama with her games in general. Mainly because she hangs out with guys for the games and has a competitive streak towards it is where her drama comes from and that is actually well done. The quirkiness of her arc comes from the gaming terminology, the fanservice from Tooru and the cameo of Hikari and it's expected what all this entails. LA didn't mind the quirkiness as much as Tooru really was the central girl of her own arc and had a bit of playful relationship with our main protagonist but for LA, not to the point of it being legitimate romance, more like a friendship romance at best, because of that in Amagami SS terms, she's the merged persona of Ai and Kaoru, Ai for her hobby taking the forefront (just change swimming as the drama to gaming) and Kaoru for her personality and status towards the main protagonist. Her arc had her faults just like Hikari all through the romance we all wanted to see as legitimate, but a playfully quirky relationship is a good consolation nonetheless.\\n\\n\r\nFinally we have the childhood best friend of our main protagonist, Kyouko Touno voiced by Juri Kimura and seriously, story and romantically-wise, this might the best arc. LA will say this arc in \"Amagami SS terms\" is what happens if Rihoko's first season arc ACTUALLY had a happy ending!, this arc also had shades of Sae as well all due to Kyouko being a rather shy character (but not as shy as Sae), but the Rihoko similarities are fierce in this one, from being childhood friends, Kyouko and Rihoko being part of the home ec. club (along with some familiar faces?). Seriously though, LA just felt this romance between Kyouko and the main protagonist one of the more legitimate ones in the series, this is mainly because, the main protagonist isn't shooting out of his own league for one, instead we are going for the childhood friend, an anime trope that is rarely done and what with the main protagonist prior backstory with Kyouko along with some legitimately quirky fanservice (this being our previous 2 heroines gets the grunt of it though Kyouko DOES get some, it IS her arc) yet great bonding moments, it's romance is decent at best, sure drama occurs, but the drama doesn't push the romance away like Hikari and Tooru's ones did, instead it's based on the main protagonist having legitimate feelings for Kyouko, thus doesn't feel fake or artificial, not to mention HOW his endevour was execute was natural especially coming from BOTH Kyouko as well as or main protagonist .\\n\\n\r\nWell LA talked lots about our main girls of the series, but not the man protagonist himself...well the main protagonist Shouichi Kamita is well, an otaku of many things (gaming and magical girl genre...don't ask), is typically perverted albeit conservative about it and is generally your nice guy who wants to help. He is generally the weakness link the arcs (besides Kyouko) mainly in the romance department which is kinda crucial in a romance anime, but what with the anime's omnibus format to suit the needs of the girl in question, it's kinda expected that his personality is bland, but the one thing LA will not forgive to Shouichi is the fact that he creates the romance to be artificially fake (Hikari's and shades of Tooru's did that). Even Amagami SS' main protagonist Junichi had some shades of legitimate romance here and there that weren't forced in most of his arcs which only emphasized the girl in question's arc to develop BOTH of their characters and romances together. Seiren's main protagonist makes the romance forced and fake for 2/3's of his arcs and no it's not because of the fanservice or the anime's quirky way of doing things...it's Shouichi as a character and how his coincidences or his bland personality (or his interests to be honest) that leads to his romances, he doesn't pursue his romance, he's just the nice guy helping out the girl in question. Romance is later. Shouichi is the biggest problem of this anime especially in the romance department and having a blank slate in which the male audience can relate to just isn't enough if our main protagonist isn't ACTIVE or have the sense of urgency in his pursuit of romance and his romances either comes last after the drama or coincidences allows him to pursue his romance. Ok enough ranting...\\n\\n\r\nThe minor cast consists of recurring characters like Miu Hiyama voiced by Shiori Izawa, Tomoe Kamita, Shouchi's OLDER sister voiced by Manami Numakura, Ikuo Nanasaki voiced by Ryota Asari (hmmm names familiar), Shouichi's friend and Ruise Sanjou voiced by Honoka Kuroki, the student council president along with satellite character and much more and yes...it's expected that this kind of minor cast are nothing but support with the remaining heroines getting nothing more than cameos until their arc arrives (this includes Tooru and Kyouko in some respects).\\n\\n\r\nLA talked alot about comparing Amagami SS to Seiren, well with good reason is that one, Seiren's timeline is 9 years after Amagami SS once again set in the same school as Amagami SS, Ikuo Nanasaki is Ai's younger brother who's much more different and finally the Miss Santa Contest is a blatant one. Ohhh and with this, Seiren also has an affinity towards it's own as the arcs progress thus giving Seiren it's own quirky personality in the name of fanservice most of the time, it's themes namely being an obsession with deer products (games, the actual animal, meat of it etc...also don't ask.), the aforementioned Miss Santa contest and the Crimson Mask super sentai show.\\n\\n\r\nIn terms of animation by Studio Gokumi and AXsiZ, the animation for the most part from the backgrounding to the character designs are pretty well done as well as many of the minor to main cast to be striking with some exotic character design, with the exception being Shouichi with good reason, bland main male protagonist...-sigh- typical. The animation on the background does look gorgeous at times and LA will praise Studio Gokumi and AXsiZ in their level of detail across the board, this especially important in the anime's more romantic scenes where Christmas is kinda a central event and the Winter scenes are gorgeous if anything. Overall, decent job from Studio Gokumi and AXsiZ with some rather decently exotic yet somewhat bland character designs.\\n\\n\r\nIn terms of voice acting, the voice acting is acceptable across the board, with no squeakers let alone any annoying vocals here and there. LA quite enjoyed Ayane Sakura as Hikari and the rare times she was there, Yukari Tamura as Shouichi's teacher Masami Onigata. But again, like its animation, the voice cast is decent but not much to praise about...well besides Ayane Sakura and Juri Kimura but nonetheless, the voice cast is decent.\\n\\n\r\nIf LA could put Seiren as an analogy with the rest of Amagami SS and Photo Kano, then LA would say that Amagami SS is like the brilliant older sister who does have her faults but knows what she needs to do and does it well, Seiren is like the second sister and middle child of the bunch where she's pretty shy and awkward most of the time, but just give her a bit of time and she'll open up to you and she looks up to her oldest sister *cough* homages *cough*....Photo Kano is like the naive youngest sister of the sisters who just doesn't know what the hell she's doing, being too focused on one thing and too little on many others...\\n\\n\r\nWell, Seiren is technically only halfway done, what with another season covering the later three girls of Miu Hiyama, Makoto Kamizaki and Ruise Sanjou with LA being intrigued by Miu's character in particular what with her constant cameos...let's just hope Seiren will get better in the romance department (LA is looking at you Shouichi), otherwise..LA's analogy about Seiren, Amagami SS and Photo Kano WILL be accurate.",
            "date": "2017-03-24T21:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 243440,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=243440"
        },
        {
            "content": "Seiren is the spiritual sucessor to the anime/visual novel Amagami. although not having seen Amagami (although i plan to because i like some context with my doujin), the basic of the story is about a guy falling in love with a girl and trying to get into a relationship with them in the span of 4ish episodes with a kiss at the finale,until the show resets and he does it again with a different girl because repercussions aren't something we want to deal with when watching anime. that's what it pretty much devolves into, and in this show there are three girls that the maincharacter tries to get with. from these three arc in my opinion only the first arc was entertaining, and while i wanted the next arc to be just as \"good\" the next two became rather boring, which may be due to how repetitive it quickly becomes and the lackluster endings each arc has.\\n\\n\r\n there are several characters in this show, but of course the most important ones are the main cast consisting of the Mc and all three chicks since all the other characters are one-note (not like the main cast ins't as well). the main protagonist is Shouichi who serves as the self-insert for the viewers since there really isn't much of a personality for him other than falling in love with the main girls, and reacting to the things happening around him. he's just bland in order to serve his role. the first girl is Hikari who is one of the most popular girls in the school, as well as a cook and has goals outside of school. despite being a bit of a bitch she is the only one with a personality be it she is a bit rude. the next girl is Tooru who is a girl obsessed with gaming, and a stoic personality who has trouble connecting with other people. although i really wanted to like her she ended up being boring. the final girl is kyouko the obligatory childhood friend who is nice...oh and no one really develops as a characther other than falling in love.\\n\r\nall in all Hikari is best girl and the rest of the cast is bland. 1 Hikari/10.\\n\\n\r\n the art looks nice all the girls in the show look visually appealing even the ones who are made to look like shit.the men look decent as well, but i don't care about them. the background looks decent, but nothing noteworthy, same goes for the lighting and so on. there's not much to say in terms if animation since there's not a lot of movement going on especially subtle things like how the characters don't blink unless they are talking.\\n\\n\r\nas for sound, eh, nothing not worthy when it comes to the sound track, and the voice actress did a well enough job to sound good.\\n\\n\r\noverall- the production value is decent enough, and Hikari is best girl\\n\r\n3.33/10 pretty much 1/3 of the show (guess which 1/3)\\n\\n\r\nalso what is with this show and the deers, they are practically the shows mascot and plot device at times. \\n\\n\r\nalso also i'm waiting for the doujins that may never cum",
            "date": "2017-03-24T16:46:00+00:00",
            "helpful_count": 5,
            "mal_id": 243418,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243418"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nA woman in glasses really gets me going.\r\nPart of it comes from the fact that I myself wear glasses; I can relate on some level with her bifocal style. Part of it comes from the subtext; an air of intelligence and maturity takes over. Part of it comes from instinct; I simply like the look itself.\r\nI have other fetishes. Ones too private and too personal to share on a public forum. Seiren has its fair share of fetishes, too, but it hides nothing as it gives its audience an average romantic outing – in moreways than one.\\n\\n\r\nSTORY\\n\\n\r\nSeiren adopts a structure known as the “omnibus.” In this case, for a romance anime, the description implies that the story will center not on a single relationship but rather many different relationships over the course of its run (hence the prefix “omni”). The main protagonist meets the girl of his dreams, the two eventually fall in love, and the whole thing resets back to the beginning for a new fate altogether. Think choosing a separate route in a visual novel, and it’s very similar in construction.\\n\\n\r\nFor Seiren, it sits at twelve episodes in length, giving four episodes per arc and thus four episodes for each of the potential girls: Hikari, Tooru, and Kyouko. Thanks to this structure, it makes it quite easy to analyze the show in individual sections and then overall as an entire package.\\n\\n\r\nHikari’s arc comes first. Shouichi goes to a study retreat in the mountains to focus on his future, and she finds herself there as well. Not of her own free will but due to a series of unfortunate events.\\n\\n\r\nThis secluded, close-proximity setting lends itself well to many a moment between the two lovebirds. She pulls him aside to have private conversations, she invites herself into his room, and she even goes into the men’s bath with him to show off her new bikini. The two constantly interact, building their relationship up from nothing and into something believable.\\n\\n\r\nSimultaneously, the arc focuses on Hikari and her fun. For instance, Hikari’s always-wearing-Shouichi’s-sweats running gag creates a common stepping stone that the anime uses to its comedic and romantic advantage. She jokes to another female student about how her and Shouichi went at it as hard as the washing machine cleans the clothes, and her nonchalance with the situation gives Shouichi extra, lewder thoughts about her that he may otherwise not have been thinking about.\\n\\n\r\nAlmost everything goes right in this arc – save for the finale. Disregarding Hikari’s awkward acceptance of her friend screwing her over, the two share a kiss together beneath the gentle waves of the ocean. Only, following this beautiful, memorable moment, she tells Shouichi that she’ll be studying abroad to learn how to cook. In other words, no romantic payoff is had. It makes the whole arc feel pointless let alone defeats the purpose of rooting the show in romance to begin with.\\n\\n\r\nTooru’s arc comes second. She somewhat stumbles into Shouichi’s gamer group where he and his two friends play a popular deer-raising role-playing game. Tooru plays the game too, and, when the four of them start gaming together on a new video game, it becomes a fun time for everyone.\\n\\n\r\nOnce again, the setting gives Tooru and Shouichi their chances at love. They “mate” in-game during their trip to a café. He invites her to his secret gaming spot where old-school classics let them connect over simpler games by their lonesome. He accompanies her during the ComiMa expo. Like life, video games aren’t always about the single-player experience, so their partnership creates many a moment for them.\\n\\n\r\nYet the multiplayer approach is also this arc’s downfall, for one of the bigger issues is that it doesn’t always feel like Tooru’s arc. More specifically, Seiren involves Hikari from the first arc a bit too much. She plays the role of Tooru’s gaming rival and former friend. But, when she was literally the main love interest in the previous arc, seeing her here just makes her presence distracting to say the least.\\n\\n\r\nUnlike said rival, though, Tooru finishes the arc strong. While she admits that she doesn’t wish to drastically alter what she shares with Shouichi right now, she commits herself to him and him to her beneath a striking full moon. Where the two were once just online partners, they end up as star-crossed lovers.\\n\\n\r\nKyouko’s arc comes third. She’s Shouichi’s childhood friend, and that relationship has stuck with them all the way into high school. He sees her as a “kid,” and she sees him as a “girl.” Which (expectedly) leads to many a roadblock.\\n\\n\r\nIn comparison to the first two arcs, this arc includes a poor premise. Kyouko turns down Shouichi rather early on, leading to a weird rift between the two. And, after she joins the home ec club, the two don’t get to spend too much time together. She’s doing club things, and he’s left figuring out if he should pursue his feelings for her. When they do go end up somewhere, it’s less a natural extension of the plot and more a coincidence of events.\\n\\n\r\nThe friendzone (or perhaps “girl-friend zone”) direction seems odd, but it makes sense in that they have been nothing more than besties. So, the events center on them overcoming that barrier. Amidst glowing moonlight, Kyouko’s festive look cannot help but put Shouichi in awe. Later, he gives her a hand-me-down coat when she goes over to his house. She even takes him underwear shopping with her, making them see the other in a different way entirely.\\n\\n\r\nKyouko’s finale also concludes on a heartwarming note. While perhaps a bit too cliched with the rooftop location and the background fireworks, their kiss signals the two have finally gone past their pasts and see each other as the one they love. Not as a “girl” or a “kid” but instead as a man and a woman.\\n\\n\r\nAs described above, each arc flubs a particular part. Hikari doesn’t have a strong finale, Tooru doesn’t have strong focus, and Kyouko doesn’t have a strong premise. In other words, each individual arc misses the mark slightly in their own fashion. However, on a larger scale, the anime remains more consistent in execution.\\n\\n\r\nMore specifically, Seiren showcases a handful of romantic relationships that come to fruition in a normal manner. No mega drama crops up during its run, and the narratives themselves don’t go for anything unique. It’s simply a believable set of relationships that the audience can perhaps relate to or at least understand if only because the anime remains so grounded.\\n\\n\r\nBetter yet, this structure inherently provides a lot of variety in these relationships. The kouhai, the fellow classmate, and the senpai. The sweet, homely girl. The teasing, outgoing girl. The quiet, passionate girl. A knitter, a cook, and a toymaker. Each girl has her own interests, her own problems, and her own traits that the audience get to watch unfold one after another.\\n\\n\r\nThe anime also loves its fetishes. Ranging from kinky to eyebrow-raising, Seiren seems to surely have something in store for everyone. Leftover butt imprints. Sweatpants markings. Furry cosplay. Hickeys. Undergarment decorations. Hair whorls. And those are only a small sample from the sizable list. Its fetishistic nature can oft be weird at times, but it no doubt adds to the anime’s overall charm.\\n\\n\r\nIf nothing else, Seiren earns props for delivering not one but three full romance stories with actual development and conclusions. In anime, it’s (perhaps unfortunately) noteworthy when the romance actually goes somewhere, so seeing it multiple times over, back to back to back, certainly defies the medium’s usual approach.\\n\\n\r\nIn fact, the anime even goes so far as to create small epilogues for each coupling, showing where they are several years later. Each one derives from smaller details in each arc. For Hikari, Shouichi becomes a dietary expert, and the two (presumably) rekindle their love at the restaurant where she secretly worked. For Tooru, she becomes a teacher, and Shouichi becomes a bus driver. For Kyouko, Shouichi became a manga editor while she looks a lot more like an adult.\\n\\n\r\nThe show does have references and small crossovers between the different plots, but they don’t heavily influence another plot’s progression. And, while the anime delivers solid romance here and there, a lack of thematic exploration may leave the audience wanting. Nevertheless (and for better or for worse), the anime ends up as a regular enough show.\\n\\n\r\nART/ANIMATION\\n\\n\r\nSeiren’s visual direction leaves a lot to be desired.\\n\\n\r\n“Plain” best describes the artistry. It’s yet another show in a long line of shows where a school dominates the setting. That’s not inherently a problem – until the anime doesn’t do much with it. It doesn’t go for anything too fancy, opting more for standard framing and orientation for its different shots. Lighting can play a bigger role for sunset scenes or arcade colors at night, but the artistry remains fairly uninspired throughout the season.\\n\\n\r\nThe show gets a bit more adventurous when it comes to those fetishes it likes so much. Shouichi envisions Hikari wetting herself while wearing a typical elementary-school outfit (yellow hat, blue shirt, and red-square backpack). Tooru sidles over Shouichi which incidentally puts her chest in full-frontal view for him and the audience to view the action. Kyouko undresses herself without care in the middle of Shouichi’s home’s hallway, leaving little left necessary for the imagination.\\n\\n\r\nGoing back the other way once more, the anime’s animated segments don’t have much going for them either. Not that there’s anything horrendous or blatantly egregious. The anime just doesn’t feel the need to provide movement of a higher quality.\\n\\n\r\nIt can surprise on occasion, though. For example, in episode seven, the bunny doll that Shouichi receives from Tooru changes its face to match that of Shouichi’s when Tooru arrives to ask him to help her out at the ComiMa event. An unnecessary detail that brings comedy and ups engagement nonetheless.\\n\\n\r\nSeiren at least deserves praise when it comes to the designs of Hikari, Tooru, and Kyouko. Again, the show doesn’t do anything fancy, but the girls have an allure, an attractiveness that’s achieved through simple choices. Hikari’s side ponytail. Tooru’s brown eyes. Kyouko’s soft smile. Much like the story, these designs stick with a normalcy and a simplicity that don’t evoke wonder but do make it tough to look away.\\n\\n\r\n(And as an extra side note, Kyouko’s stare lingers a bit too much at the start of her ED’s visuals. It comes off as less cute and more creepy than intended.)\\n\\n\r\nCHARACTERS\\n\\n\r\nArguably speaking, Seiren’s greatest strength comes from the characters and the arcs they go through. The anime does not have too much time for each girl, but Hikari, Tooru, and Kyouko experience individual problems that they must overcome – as Shouichi lends a hand however he can.\\n\\n\r\nHikari’s arc focuses on her seriousness, and her entrance defines her character right away. Sitting atop Shouichi’s desk, she teases him (with tongue out) about how much fun she has messing with the helpless teen. And, as she talks with her friends and rumors swirl about her, it becomes clear that Hikari is both proactive and independent.\\n\\n\r\nHowever, she still doesn’t seem to care too much about anything else besides having fun. Her parents find out about her part-time job, so they send her away to Shouichi’s retreat. But there’s no fun to be had. She finds studying boring, she can’t use her phone, and she tries to sneak away from the hotel to get to the mixer she covered up as a family trip. Without anything else to do, she teases Shouichi with every chance she can get to have her fun.\\n\\n\r\nThe more she interacts with him, the more sides of her come out. She gets flustered when Shouichi compliments her navel, and she gets rather angry when he tells her he saw her at her secret workplace. She also learns to do the laundry, studies more than she most likely ever has before, and even cooks food for others, letting Shouichi see her in “a new light.” All the while, the other students believe her to be a “slut” that she takes as a challenge – which involves more teasing and vending-machine misunderstandings for Shouichi.\\n\\n\r\nAfter clearing up who ratted her out to her parents, she shares an intimate moment with Shouichi at the beach that solidifies the feelings they share for one another. After speaking with him more and reminiscing about the summer course, she realizes how much he has done to support her, to give her the confidence she needs to believe in herself moving forward. Thus, she makes a serious decision, opting to study abroad to sharpen her cooking skills that he praised her for weeks earlier.\\n\\n\r\nUnfortunately, that leaves the two separated and without a satisfying romantic conclusion. While it’s certainly not the best ending imaginable, it’s still an interesting route to take. Letting Hikari – a character whose entire path centered on becoming more serious – continue following seriousness through a life-defining event makes for a realistic approach that provides a close to her fun-filled arc.\\n\\n\r\nTooru’s arc focuses on her loneliness. Although, it doesn’t seem to be that way initially, for she stumbles upon Shouichi’s gamer group and joins them in their online escapades. Tooru herself is somewhat quiet and slightly naïve despite her age. She also likes to sing anime songs and can even craft miniature toys. Combined with her gaming abilities, she seems to easily connect with most people around her.\\n\\n\r\nOnce she gets back into GusGal, a multiplayer shooting game, Shouichi becomes her partner in their dual matches. But she’s too good. Not only does her popularity as a strong player want others to fight alongside her, thereby kicking Shouichi out, but also her playstyle attracts criticism. She wants to win through utter domination and no matter the cost. It stops others from reaching her level and gets them upset when she doesn’t hold back.\\n\\n\r\nHikari expresses similar thoughts when she warns Shouichi of Tooru’s aggressive tendencies. They were once gaming buddies, but, due to Tooru’s drive, they (and other friends) eventually parted ways. Soon after, Tooru heavily invests herself in GusGal+, skipping class and once again making enemies (of the online variety).\\n\\n\r\nShouichi (with Hikari’s advice) doesn’t back away. He visits her at home, learns a bit more about her and her past, and the two play some classic arcade games together (minus the “instakills”) at his secret gaming spot. He even gives her a “ring” that obviously foreshadows their eventual coupling.\\n\\n\r\nShe understands that the games have started to take over her life to some degree, so she backs away from them for a while. In their stead, she creates a new stuffed toy that she wishes to sell at the ComiMa expo – so long as Shouichi is there to support her.\\n\\n\r\nAnd support he does. He tries his best (well or otherwise) to sell her toys, he comes up with the idea of selling her Deermas as an accessory, he protects her from the paparazzi, and figures out her (lewd) outfit issue.\\n\\n\r\nHis support and words and feelings get through to Tooru. She realizes now that, after everything that has happened and everyone she has known, he’s the only one who has chased after her to be by her side no matter what. (A “playstyle” she’s very much familiar with.) They choose not to change their relationship drastically, but Tooru and Shouichi share an intimate moment as well, coalescing as offspring both in and out of the video game that brought them together in the first place.\\n\\n\r\nKyouko’s arc focuses on her growing up into a woman. Originally, she’s framed as a child. She’s Shouichi’s childhood friend, she’s a year younger, she likes manga from their childhood, she has a slender frame, and she brings up subjects like fan clubs that make her seem like a middle schooler still.\\n\\n\r\nSurprisingly, Shouichi goes for it all rather early in the arc, but Kyouko shoots him down. She sees him more as a “girl next door” rather than as a man. Plus, she doesn’t want to ruin what they’ve always had (risqué hotel hopping notwithstanding).\\n\\n\r\nKyouko is also aware of her childish nature, so she does what she can to correct it. She gives up some of her manga, she joins the Home Ec club to gain lifestyle knowledge, and she acts bolder like taking Shouichi with her to get new panties for herself.\\n\\n\r\nShe wrestles with her feelings for Shouichi, for she cannot admit that she sees him differently. That is until he tells her the opposite from his perspective. That, after her dedication towards the club and her recent actions, he can no longer treat her like a middle-school kid.\\n\\n\r\nStill, at the Founder’s Day festival, Kyouko hesitates in front of Shouichi’s persistence to speak with her in private. Yet she knows that there’s something that makes her happier now. Her friends give her a final push (and some oden), and, once on the rooftop, she shows how much she has grown up. She sits between his legs, “confesses” her feelings, and faces him in earnest. The two cap off her arc with a romantic kiss, fireworks exploding in the background.\\n\\n\r\nHikari takes life seriously, Tooru escapes loneliness, and Kyouko grows up. Each girl develops in some fashion, giving each arc a rounded experience for the characters. Given that they only receive four episodes each, their changes are even more meaningful overall.\\n\\n\r\nThroughout every arc, one true constant remains: Shouichi. While he’s destined to be the too-plain protagonist given the omnibus format, Shouichi isn’t without quirks of his own. Namely (as Hikari would put it), his depravity. The boy is a horny, high-school teenager, so his mind wanders and his gaze leers as many a sexual situation appears before him.\\n\\n\r\nMore commonly, he treads the line between just wimpy enough to know his place and just brave enough to push his relationship with each girl to that next romantic step. For example, during Kyouko’s arc, he may take his loss after she turns him down for a date, but he’s not afraid to say, “I can’t tell without seeing you wear them,” during their underwear aside.\\n\\n\r\nNo matter what, though, Shouichi supports the girls however he can. He helps them fight what holds them back on both a mental and personal level, making his romantic relationships with them worthwhile. He sincerely cares about Hikari’s cooking and the misunderstandings targeted at her. He really wants to be with Tooru even though she runs away and he can’t match her skill. He looks out for Kyouko as much as he can.\\n\\n\r\nAnd, like any good romantic relationship, they help him become a better person, too. Hikari inspires him to become more independent and care about his future. Tooru gives him the means to prove his worth. Kyouko forces Shouichi to man up.\\n\\n\r\nHis changes aren’t as noticeable as those of the girls since he resets with each arc and realistically isn’t the focus. However, he gains just as much from these relationships as they do – proving that romance no doubt affects both sides for the better.\\n\\n\r\nMUSIC/SOUND\\n\\n\r\nSeiren creates three specific ending tracks – one for each girl. These tracks reflect the girls’ personalities and interests in some fashion, acting as an extension of the characters themselves in audio form.\\n\\n\r\nHikari’s track, “Shunkan Happening,” is upbeat and quick, incorporating a slick starting guitar solo and some piano work. It’s fun, what with its fast-lyrical delivery, but it doesn’t stick out as anything interesting on the ear.\\n\\n\r\nTooru’s track, “Muteki no Megami,” is arguably the best of the three if only because it goes for something different. The computerized effects fit with her gaming motif, and the instrumental work focuses on echoes and singular sounds. Such sounds invite a melancholic, somewhat haunting tone that goes along with her loneliness. The second half is more hopeful, though, aligning with her eventual change of situation.\\n\\n\r\nKyouko’s track, “Koi no Theory,” is the simplest of the three. Light, silly sounds get at a more “childish” composition, and a consistent beat keeps the song from going anywhere other than straight ahead. While filled with trumpets and the occasional flourish, its tame nature unfortunately makes it all too forgettable.\\n\\n\r\nAs for Seiren’s opening track, “Kimi no Hana,” it begins rather nicely as drum tapping supports the vocalist, and the lead up into the main portion of the piece signals something grand. But, once it actually does get going, the whole thing sounds a bit flat as the instruments overtake the unemotive singing. It’s a reserved OP that fits with the overall feeling of the show itself, so it at least has that going for it.\\n\\n\r\nListening to everything else, the voice acting performances aren’t anything noteworthy, but the original soundtrack does contain a few tracks that strengthen many of the anime’s scenes. A resonating piano piece channels tension. Harps, wind instruments, violins, and chimes fill the air during certain romantic segments. A provocative, ringing tune accompanies Shouichi’s perverted thoughts, and a slow, punctuated song brings a more comedic vibe when possible.\\n\\n\r\nENJOYMENT\\n\\n\r\nI must admit that, having not seen any part of the Amagami series, parts of the show are lost on me. From the tidbits I picked up elsewhere, certain characters are related or are direct references to the spiritual predecessor. And the constant inclusion of deer – Hikari runs away from deer, Tooru plays a video game inspired by the animals, Kyouko’s senior classmates sell venison – is presumably a funny callback. (I may be wrong about that.) Not that I needed to watch anything before this one, but it most likely would have helped.\\n\\n\r\nRegardless, I liked Hikari, Tooru, and Kyouko (in that order), so I had a pretty all right time with the show.\\n\\n\r\nA jokester myself, Hikari’s playful personality made her the most fun and the most attractive. Seeing her in the other arcs (intruding or otherwise) was nice, but it also made me sad because she was first-in-first-out queue style.\\n\\n\r\nTooru’s mature persona (and all that entails) likewise made her attractive. So did her video-game-playing background, for I am an avid gamer myself (who is currently Diamond rank in Gears of War 4). But it was her embarrassed nods that had me grinning the widest.\\n\\n\r\nAs for Kyouko, while she was a bit too docile for my tastes, her thoughtfulness was something I could definitely appreciate. It’s what made her bold sit-in-between-Shouchi’s-lap move get two-thumbs up from me.\\n\\n\r\nOverall, the lack of higher drama and comedy didn’t make the anime very engaging for me. Although, I was a big fan of the romance itself. Which, at the end of the day, matters most in this case. The shy reactions. The heart-skipping build-up. The kissing culminations. Romance is the favorite of my favorites genre-wise, so I couldn’t complain much about the progression shown.\\n\\n\r\nHowever. To me, it seemed as if each arc needed one more episode. An episode that would have the couple just after hooking up (or in Hikari’s case whatever long-distance relationship aside they could muster). The whole idea is to show their budding romance up to and including the confession, meaning it never wanted to provide anything extra to begin with. And, to be fair, they provided epilogue pieces to minutely satiate my desire here. But those small snippets only made me want to see them actually together even more.\\n\\n\r\nBased off the opening track’s visuals, it seems as though the series has another three girls lined up for more omnibus action. If another cour is somewhere out there on the horizon, the show certainly has a lot to improve on.\\n\\n\r\nSeiren is about as average an anime as it comes. A simplistic set of narratives, a plain artistic direction, a regular set of musical offerings, and a few entertaining sequences. The characters and their romance give more, but they aren’t enough to completely fix the apparent astigmatisms.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, Hikari, Tooru, and Kyouko may flub different parts of their arcs, but the omnibus format works well in establishing different setups and creating a set of grounded, charming romances for the audience to follow\\n\\n\r\nArt/Animation: Fine, decidedly plain, the artistry doesn’t stick out much, but the provocative scenes and designs of the girls include much-needed intrigue\\n\\n\r\nCharacters: Good, with only four episodes apiece, Hikari takes life more seriously, Tooru escapes loneliness, and Kyouko grows up, all while Shouichi changes too, proving that romance betters those involved\\n\\n\r\nMusic/Sound: Fine, each girl’s ED acts as an extension of themselves, the OP comes off a bit flat, the OST contains several nice tracks, and the VA performances are nothing of note\\n\\n\r\nEnjoyment: Fine, Hikari, Tooru, and Kyouko were some combination of fun, attractive, and cute, but the missed references and lack of post-hook-up episodes left a small void\\n\\n\r\nFinal Score: 5/10",
            "date": "2018-03-08T21:05:00+00:00",
            "helpful_count": 3,
            "mal_id": 273385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=273385"
        },
        {
            "content": "Nothing about this feels like it should have been an anime. In fact it may have been better as live action considering the animation is minimal, color pallet is drab, and character design pretty generic. I understand not every anime has to be about heroes and destiny, mechs and magic, aliens and demons, time travel and parallel dimensions... BUT they should be a little more interesting than some completely average high school character (with seemingly nothing going on) besides not knowing what to do with his life (so then like every high school character ever). In a show where characters appearing \"normal\" seems to bethe unique twist instead of appearing super eccentric, kawaii, or \"anime-y\", no one feels particularly relate-able or interesting or funny. Like the forgot to infuse the characters with well... \"character\". I found myself bored and un-charmed all the way through desperately waiting for something, anything to happen but it never came. If it sounds like I don't enjoy slice of life, high school comedy/romance shows you're dead wrong. Shows like Orange get what this show feels like it wish it could do. Where other high school shows with a twist like Angel Beats I feel does a disservice to the show.",
            "date": "2017-05-05T21:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 247040,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5459059.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Zeemod155",
                "username": "Zeemod155"
            },
            "url": "https://myanimelist.net/reviews.php?id=247040"
        },
        {
            "content": "In a season filled to the brim with great animes. Seiren was not one in the category of perfection or masterpiece rank. This was not expected due to the anime being created by the same people who worked on Amagami SS. Seiren follows the same way of developing a story quite like amagami SS with the only diference that it follows for 3 main girls & only went on for 12 episodes. \r\n[Story]6/10\r\nThe story elements in seiren follow how the main character Shouichi Kamita interacts with the 3 main heroine. The anime is divided in 3 arcs one for each heroine which are Tsuneki Hikari(eps1-4), Miyamae Tooru(eps 5-8) and Touno Kyouko(eps 9-12). Each arc has its way of telling this story, but honestly the best arc by far was kyouko's arc since it had the best story & it actually felt different in relation to the other arcs. Not that the other ones are bad but they feel repetitive.\\n\r\n[Art]8/10\\n\r\nThe anime's art style was really good ironically art wise each heroine looked different & felt different. The atmosphere & town looked great there was great attention to detail in art. The studio did a great job to ilustrate this anime.\\n\r\n[Sound]9/10\\n\r\nSound wise this anime had great attention to background & atmosphere the noise of animals, in between day & night was great. Also this anime had a great op & also great endings themes for each heroine.\\n\r\n[Character]8/10\\n\r\nThe character development in this show was amazing truly one of the good things it has going for it. Each character personally felt different in comparrisson to their story lacking counter part. Also the whole heroine cast has great synergy with the main protagonist. \\n\r\n[Enjoyment]7/10\\n\r\nThis anime offers pretty good enjoyment although it feels that the plot doesn't move forward or at really slow pace which takes away from the full enjoyment of the series. Otherwise it could have been one of the most enjoyable anime of the season. \\n\r\n[Overall]7/10\\n\r\nThe anime was good with all the flaws it had they manage to leverage in some other aspects like the character development made up for the lacking story elements. Seiren is not a must watch, but a should I watch hardcore fans of romace anime are going to find good in seiren lets hope for a great second season cause we know there is a whole cast of other heroines to cover.\\n",
            "date": "2017-03-27T18:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 243738,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5698059.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/alchris97",
                "username": "alchris97"
            },
            "url": "https://myanimelist.net/reviews.php?id=243738"
        },
        {
            "content": "So, a romcom, harem based anime has just ended for this 1st part of Winter 2017 season, now it's pretty obvious that this is a spin-off of Amagami SS, where it involves one guy with a harem allocated in each arc, now even thought both have different studios and producers, for some reason the setting where the same and so as the uniforms, so, here is how I rate this 12 episode anime:\r\nStorywise: Ok, so let's get over each arc\r\nTsuneki Hikari arc: It was set in some remote place where it's summer and the guy has decide to attend some kind of \"save Our Score\"seminar, with Tsuneki who reluctantly tagged along m just as know know if Shouich rant her out about her having a part-time job. Now, that's is quite cheesy to start her arc, you tagged alone just because you suspected your classmate as the one who rant you out is outta her mind, also the romance she had with with the guy was more like a play thingy and I really find it, too, annoying that the guy should have just broken up with that bitch.\\n\\n\r\nToru Miyame arc: This arc is more like a sotacon thing, since it involves a quintessential sempai romance, her's was complicated kind of romance , co'z of the fact that she's has something against who seemly doesn't share her gaming addiction. Her plot arc, wasn't something that can be understood , due to all kinds of hairy compromises, reason and other things that one such as me , would wanna just go in there and hit someone with a paper fan on the head, now let's face it, the complications were simply added just to keep up with her 4 part arc.\\n\\n\r\nKyouko Touno arc: Here we have the quintessential kohai thing, here is an arc that one can relate, since there is a struggle of being a childhood friend to being romantically involve with the guy, now, this for me was this anime's redeeming factor so, for her arc, I'm gonna gun for a \"Good\" 7.\\n\\n\r\nArt: well, artwise it was a bit different from Amagami SS, since both doesn't feature any panchira thingy around here, I'm gonna give it a \"Good\" 7 since it was decent in a way, but the score was for Tsuneki's sexy summer out fit and since she is the only one who was in a bikini in her arc.\\n\\n\r\nSound: I'm just gonna give it a \"Fair\" 6 since I have no comment as to who did whose voices here, but I kinda like the opening theme, but not much.\\n\\n\r\nCharacters: Since I did mentioned that this is a spin off of Amagami SS, now, the characters maybe different, but, the personalities of the characters here are still the same, in Amagami SS there is one guy to six girls ratio, here it's just one guy to three girls ration, however, here, the girls themselves were a combination of other personalities of the characters from Amagami SS like :\\n\\n\r\nTsuneki Hikari: her personality is a combination of that of Ayatsuji Tsukasa's sadistic and ambitious trait with that of Morishima Haruka's flirtatious and playful trait.\\n\\n\r\nMiyame Touro: Hers is that of Nanasaki Ai's aloofness and stoic personality combine that with Tanamach Kauro's independent mindedness.\\n\\n\r\nTouno Kyouko: She has Sakurai Ryouko's flare for anything that is edible and artistic side, she also has Nakata Sae's naive and insecurity side. and just like  Ryouko she too is classmates  with the guy's sister and she also has two club sempai's who also has the same characteristic but different names, like Koharu Uno who replaces Ruriko Yuzuki from Amagami SS and Nao Tokioka who also has the same wired personalty of that of Hiba Manaka who is also from Amagami SS.\\n\\n\r\nAlso let's not forget Kamita Shouichi who is basically the same as Tachibana Junichi, both in role and personalty, so from here is is really a \"Mediocre\" 5.\\n\\n\r\nEnjoyment: Well, I basically have some reservations t the first two arc, but then again having the 3rd arc is good , but not very good, just a \"Good\" 7.\\n\\n\r\nOverall: it's \"Good\" 7, it's decent, but the first two arc were just too complicated and annoying, it was just the 3rd arc that has made a difference with this anime, yes it was good enough, but not good enough to for studios Gokumi and  AXsiZ , to make additions like a pic drama or any OVA's for that matter.\\n\\n\\n\r\nWhoahoho OUT!   \\n\\n\\n\\n\\n\\n",
            "date": "2017-03-26T12:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 243607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5298153.jpg",
                "scores": {
                    "animation": 1,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Whoahoho",
                "username": "Whoahoho"
            },
            "url": "https://myanimelist.net/reviews.php?id=243607"
        },
        {
            "content": "-I'm sorry for all mistakes, english isn't my native language-\r\nI'll start right off the bat. I'm enjoying Seiren so far. It's simplistic, yet kinda stupid, both story and characters are often enough to make me smile. But i'm really far from saying this anime is any good. But as much as Seiren has problems, i can't name it \"the worst thing ever\"\r\nStory & Characters - 2\r\nSeiren doesn't have absolutly anything good or original in itself. All characters have really strong drawn personalities which we've seen in maaany other series. I think the only good point here is perverted protagonist in world of \"Ordinary\" people. Samestory with story. Seiren has 3 arcs and every one of them tells a story how our protagonist is getting together with each of 3 main heroines. Such type of plot clealry block any posibillities of character development, that's why our characters stay with the same personality for entire series. As even worse, it heavly brokes immersion, because of which we feel like we couldn't care less for our heroes.\\n\\n\r\nArt - 4\\n\r\nBackgrounds look fine, there is not too many detals in them. But characters design really disappoints. All female characters look really similliar, because of which i pretty often had problems with distinction them.\\n\\n\r\nSound - 3\\n\r\nSoundtrack is forgettable and sometimes it doesn't fit with what is happening on the screen. Opening isn't something amazing, i was skipping them after the first listen, endings don't sound too appealing either.\\n\\n\r\nEnjoyment - 6\\n\r\nOk, Seiren definitly isn't a good series, or even medicore. Objectively looking, it's really bad, something between 2-3. But for unknown reasons... i had fun (or have, the show is still going on). Maybe weren't these the best moments of my life, but i don't really regret time spended on this series. Of course, seiren still is a bad anime, but if you can \"turn off\" your brain for these 20 minutes, you can have some actual fun. It looks like sometimes you need something to just laught off and spend free time on something nonsenical... but yet, there are waaaay better series this season for a good time, like Second Season of Konosuba or Little Witch Academia. You can take Seiren just when you think you saw everything good this season.\\n\\n\r\nOverall - 4",
            "date": "2017-03-13T10:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 242479,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4564638.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/gingerbrad",
                "username": "gingerbrad"
            },
            "url": "https://myanimelist.net/reviews.php?id=242479"
        },
        {
            "content": "No spoilers up ahead.\r\nIf you're looking for a staple omnibus format anime akin to the likes of Amagami SS, this anime is for you. Every four-episode arc is indicative of a distinct route the protagonist takes with a different girl who he becomes initially acquainted with, ultimately leading to a specific culmination of experiences with that very girl. \r\nThe first arc is with Tsuneki, and the second is with Miyamae Tooru.\r\nAdmittedly, the first arc could have been a bit better, but the route is quite respectful of realistic occurrences. The second arc, however, is a much better journey, and sets a high standard for thesubsequent arc. The sublime artwork and distinctly paced episodic storyline is a fresh, albeit not completely out-of-the-box, take on the genre this anime belongs to. \\n\\n\r\nYou'll only know if you like the anime if you watch it. But do remember, the second arc (Episodes 5-8) is far better than the first one (1-4) - so expect to like some arcs much more than the other.",
            "date": "2017-02-24T18:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 241312,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6069903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BBBBBBBBBBBBE",
                "username": "BBBBBBBBBBBBE"
            },
            "url": "https://myanimelist.net/reviews.php?id=241312"
        },
        {
            "content": "I'm just going to say it outright; if anyone is going to remember this anime at all, it will be as Amagami SS's eccentric little sister. The \"eccentric\" part comes from the fact that the story presents some rather bizarre events and quotes, while the \"little sister\" part comes from not only the fact that it not only noticeably comes from the same universe, but a couple of the characters are actually younger siblings of Amagami SS characters! (Let's not forget the omnibus format both series share, too.) In fact, this connection with Amagami SS was why I selected this anime to be among thosefrom the Winter 2017 anime that I watched in the first place; in spite of this decision, however, my expectations were actually quite low. Unfortunately, I was proven right.\\n\\n\r\nLadies and gentlemen, welcome to my review of Amagami SS's eccentric little sister, \"Seiren\".\\n\\n\r\nSeiren follows the romantic misadventures of Shoichi Kamita, a second-year high school boy. Similarly to Amagami SS, four episodes each cover the heroines that Shoichi ends up romancing, except the number of girls is halved this time. First, we've got Hikari Tsuneki, the cheerful \"idol\" of Shoichi's class with a secret job at a restaurant. Then, we've got Tooru Miyamae, a gamer girl who joins Shoichi and his friends in playing what I've come to think of as \"a deer version of Pokemon\". Finally, we've got Kyouko Tono, Shoichi's childhood friend who just joined the Home Economics Club. As time goes on in each of the girls' arcs, Shoichi becomes closer with either one of these girls and gradually falls in love with her....whether or not he actually has any chemistry with any of them.\\n\\n\r\nWhat could I possibly mean by that last sentence? I mean exactly what I said; Shoichi does not have very strong chemistry with any of these girls. I mean, when you're creating an anime with this format, it's hard to build a strong connection between our protagonist with all of the girls he gets with, but there's bound to be at least one girl who has a believable relationship with him. Unfortuately, in Seiren, there is none of that; in the best case scenario, I would see Shoichi and the girl whose arc is ongoing as just friends, and that's pretty much it. Each of their stories suffer a bit because of this, too, and when an anime's story is taken down with two characters' chemistry, especially when it's done three times in the same series, we've got ourselves a bit of a problem. Although the story can surprise you with its bizarre ideas at times (for example, there is a character with a real thing for bunnies), it doesn't help too much.\\n\\n\r\nNow, let's discuss the characters. I remember liking Junichi, the protagonist of Amagami SS, a lot, especially since he had what Shoichi didn't: a believable personality. Shoichi, on the other hand, is a rather boring main character with little personality; it's not as easy to root for this guy. The heroines aren't much help, either. While Hikari is definitely the most interesting of the bunch, it really didn't feel like she got a lot of development, so I couldn't get myself to like her. Tooru had potential, but as time went on, she seemed to become less and less of an interesting character; by the end of her arc, I had given up on her. As for Kyouko.... ugh, where do I even begin? Out of all of the heroines - no, out of all of the characters, period - she has to be the character, or at least one of the characters, with the least amount of personality, and I honestly felt that her relationship with Shoichi, as well as her entire arc, was the weakest. Out of the supporting cast, there are a few memorable characters, but most of them are pretty forgettable.\\n\\n\r\nThe animation, done by Studio Gokumi, wasn't terrible; sometimes, the movement of the characters was a bit awkward, but for the most part, it wasn't terrible. After all, a particular diamond in the rough from Seiren came from a beautifully-animated scene in episode 4; I won't say what it is because of spoilers, but anyone who has actually watched this series might know what I'm talking about. The voice acting wasn't too bad, either; for the most part, the voice actors played their roles well, although some weren't really as good. The opening and endings themes were also nice to listen to, albeit not songs to listen to over and over again.\\n\\n\r\nOverall, Seiren was a below-average anime. I won't stop you if you're desperate to watch it, but if you're looking for an anime with an omnibus format where the protagonist ends up with more than one girl in more than one alternate universe, I'd prefer that you watch Amagami SS. I mean, let's be honest; it's more memorable than Seiren.",
            "date": "2017-04-06T20:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 244893,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=244893"
        }
    ],
    [
        {
            "content": "So what to write about Seiren? If the review could be done in one word, it is shit.\r\nBut a one word review will be deleted by the mods, so read on. The Anime is like a successor to Amagami SS and I had high hopes for it. Seiren started on a good note and I enjoyed the first few episodes and though that this was good. Boy, I was so wrong.\r\nThe first arc is quite interesting, and the story is good. Basically if you do not know, Seiren deals with a 3 heroine arc. The MC gets to date all of them in the threearcs and end with them. Each arc has a separate storyline and the next one starts afresh. The first arc kicks off with a Tsundere cutie, and you can enjoy it pretty much. The next one is with a shy senpai and the enjoymnet's are so-so. But the last arc with a kouhai, clearly kills it.\\n\\n\r\nHorrible direction, horrible plot executions and flaw filled dialogues kill Seiren. Whatever enjoyment you get from the first few epiosdes, you lose more than that at the end. So is anything good in it?\\n\\n\r\nThe animation is smooth. The girls are really great looking and the opening video with girls is definitely a score. The OSTs also does a great job. The OP is just awesome and the EDs are also peaceful for the ears. The songs are a place where Seiren deserves praise. As for story, and characters, it's just meh.\\n\\n\r\nThe average MC, Kamita is a loser who by luck hooks up to the best girls in the school(here's to hoping that something like that happens with me too, lol). There is no character development or whatsoever, so the critics should avoid putting on their thinking caps and try praising the characters. \\n\\n\r\nI would not recommend anyone to watch it unless there are people who have nothing else to do. Sure the girls are pretty and you may want to make some of them you waifu, but that's all. Nothing more. If you have extra time, go and try getting a real waifu, instead of fantasizing with the 2D ones here(sigh).",
            "date": "2017-03-24T23:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 243452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5717953.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stranger_Hanyo",
                "username": "Stranger_Hanyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=243452"
        },
        {
            "content": "Well it's my first review so I am not sure if it will be too good.\r\nIt's an enjoyable anime with really nice art and story.While the ending of the first part wasn't the one I could hope for it was still really nice.The second part on the other hand so far is really enjoyable and I have a lot of expectations from it!\r\nAside from that the characters are nice helps built a nice atmosphere for the anime and the art and sound are nicely done too adding more reasons to why someone should give it a chance!\r\nOverall I would give it a 7 cause evenfor all the above the first's part ending made me think of dropping it.Other than that I don't see why someone shouldn't see it in the first place.",
            "date": "2017-02-14T15:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 240601,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4454452.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/GiaQuando",
                "username": "GiaQuando"
            },
            "url": "https://myanimelist.net/reviews.php?id=240601"
        },
        {
            "content": "Sometimes, things happen by accident or sheer luck, just like this series. \r\nEven though this format of anime isn't new, for example Yosuga no Sora or Amagami (and it's reasonable to compare), this show pulls three alt-arcs related to the MC, Kamita, during the course of 12 episodes. Some of the recurring rom-com themes and cliches appear, but its appeal holds around the development of characters.\r\nUsing visuals and almost-impossible turn of events, romance flourishes between the girls and the MC, each scenary is different from the other, simple but effective.\r\nThe problem I saw with this show it's the lenght and cast, although the two heroines,Tsuneki and Miyamae, had their charm and reason to be 'that' likeable, plus their chemistry with the MC seems appealing, in the last 4 episodes was the opposite, it feels tiring, maybe a short cut of arcs or a extension of the previous two FMC... could've been the right call.\\n\\n\r\nThe art feels correct, using the vibes of Amagami as a resource, if Seiren were an actual spin-off of that show, it would seem right.",
            "date": "2019-02-07T16:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 301120,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7792094.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kaleid101",
                "username": "Kaleid101"
            },
            "url": "https://myanimelist.net/reviews.php?id=301120"
        },
        {
            "content": "I think the most important thing to explain about this anime is the format it takes. The show is split into three arcs at four episodes a piece with each arc representing a different continuity where the main character ends up with different girls.\r\nWhat  I liked about the show:\r\nThe format of the show was a breath of fresh air for me. After watching other romance animes it's nice seeing a show that explores all the options the main character has. Speaking personally, I've seen other romance shows where you know who the main character is going to pair up with and while you maywish for him to be with another character to see that relationship develop it ends up being all for naught. This show is good for those that feel similar in that regard of wanting to see the main character with some of the other heroine options he has and seeing how those relationships develop. \\n\\n\r\nI also liked the drawing for the characters. Each heroine has her own look and feel to help distinguish them and I like the individuality. \\n\\n\r\nThe music was good. The opening and ending tracks were nice to listen to but nothing to write home about either. The individuality of each ending track corresponding to the girl the arc was focused on was a nice touch. \\n\\n\r\nWhat I didn't like about the show:\\n\\n\r\nWhile the format of the show was a breath of fresh air it also worked against it considering you only had 12 episodes to work with. Since each arc is only 4 episodes long you have to build the relationships up very quickly. Most of what you end up see is pre-relationship feelings that climax with the two either coming together or not and then a time-skip showing how they progressed. This personally left me with a feeling of wanting more from some arcs and not being fully invested in the relationships as they developed. I would've loved to see the show have more episodes so that each relationship had a bit more time to develop and you more reason to be invested.",
            "date": "2019-01-16T15:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 299216,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7730171.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GulielmusPrime",
                "username": "GulielmusPrime"
            },
            "url": "https://myanimelist.net/reviews.php?id=299216"
        },
        {
            "content": "TL;DR: No real depth but likeable characters, if you want some short cute romance, watch it.\r\nSeiren explores 3 different scenarios all revolving around the same male character, so instead of some Harem or love-rivalry, it shows you how it could play out with each of them separately. Now, that of course means that there is not much time to explore the characters themselves, but nonetheless I found every one of them to be quite likeable. After all, I don't see the reason why a story revolving around romance should always contain characters with some crazy backstory, looks or personality. Most people are absolutely normal andnot standing out, so shouldn't that be something many people can relate to?\\n\\n\r\nNone of the girls were like completely crazy over him, and he wasn't depicted as a stuttering pussy who can't say a word around girls either. He's an ordinary guy, a bit shy in some aspects but takes action when it's needed. The girls and the way the 3 arcs play out are pretty different, made it interesting imo. \\n\r\nOverall it builds up a nice atmosphere if you just want to see some romantic development between people without much drama or tragedy attached to it, and without much depth to think about. Shut down the brain and enjoy. \\n\\n\r\nAll 3 arcs also show their future, jumping 5 / 10 years into the future at the end of their final episodes, basically giving you 3 happy endings in one show.",
            "date": "2018-11-18T03:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 294281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7157568.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Leyren",
                "username": "Leyren"
            },
            "url": "https://myanimelist.net/reviews.php?id=294281"
        },
        {
            "content": "I get why this anime isn't universally beloved, but I seriously don't understand why it gets so much hate. Maybe I was just in the perfect mood to watch it, but i found it to be very enjoyable despite it's downsides. It has a better than average soundtrack and about what you would expect from the genre as far a animation goes. \r\nWhat makes it really great to me is that the jokes are few, but often times they hit like a ton of bricks and they are extremely memorable. I doubt anybody who ever watched this show is going to forget that scene inspiredby \"The Ring\" or the bath scene i the first chapter.\\n\\n\r\nSpeaking of that, the biggest downside of the anime by far is the ending of the first chapter. Everybody knows Tsuneki is best girl, but the anime doesn't treat her like the top-tier waifu that she is!\\n\\n\r\nAnother big problem is that the side characters are for the most part utterly boring. Other than that though, it's a decent anime. Nothing anywhere near as low as a 3.",
            "date": "2018-10-08T20:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 291298,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Returnality",
                "username": "Returnality"
            },
            "url": "https://myanimelist.net/reviews.php?id=291298"
        },
        {
            "content": "Guys, I'm gonna tell the truth. This anime is very good, and I recommend this to you guys. I believe that those people don't have the right to insult this anime. If they think its bad, say nothing. Like, I've been watching anime for years now. In my opinion, I think that you have to watch more anime to understand what is it actually like, for example, when I first watched 'Relife' for the first time, I was bored in the first 5 episodes. But after some years, I watched it and it was fantastic like best ending ever. So what I'm trying to sayis that we have different mind/anime sets, and when years have passed, we would change our thoughts of it. (HAVING MORE EXPERIENCE DOES MATTER IN ANIME)................",
            "date": "2018-08-26T02:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 287391,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5951328.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/blackwhite621",
                "username": "blackwhite621"
            },
            "url": "https://myanimelist.net/reviews.php?id=287391"
        },
        {
            "content": "To me, this is one example of a high school story that could have based in real events. \r\nGiven its a story about 3 different girls, the character development needs to happen fast, but it is done in such a way that it doesn't feel rushed. You can see why they all grow closer.\r\nThe main character is likable because it's not a total wimp. Many of these kinds of Anime have male characters that are incapable of moving the story forward on their own and it annoys me.\r\nOne of the things I like the most was the peek into the future after each girl's arch.It was a very nice touch.\\n\\n\r\nIn the end, I thought it was a very balanced show. Very well animated, characters I think could exist in real life and a likeable lead. Lengthwise it's short enough to still see the character development and not long enough to see filler episodes without any kind of substance.",
            "date": "2018-07-28T03:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 284970,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Pak3nuh",
                "username": "Pak3nuh"
            },
            "url": "https://myanimelist.net/reviews.php?id=284970"
        },
        {
            "content": "Seiren is a spiritual successor to Amagami SS, and holds many similarities. It features a male Japanese high school student who meets a series of girls and establishes formal relationships with them, with different episodes dedicated to different arcs, much like a Visual Novel (which Amagami was, but Seiren is an original work). Due to the fact that it was released in 2017, the animation and sound are much better than its 2010 counterpart. Its characters, however, which were what made Amagami the hit that it was, fall short.\r\nThe 12 episodes of Seiren are divided into 3 arcs, 4 episodes each. They belong to HikariTsuneki, a cheerful tsundere, Toru Miyamae, a quiet but passionate girl with an interest in video games, and Kyoko Tono, a childhood friend of Shoichi (the main character) with a rather childlike personality, and the 3 girls have their arcs given in this respective order. Hikari's arc was very strong, and when I first saw it, I had high hopes for Seiren, thinking it'd be of equal quality to Amagami, a show I hold dear to my heart. After her arc ends, it really doesn't warrant watching because the other girls are too uninteresting to keep me interested, and, due to the genre, it has no redeeming factors as a result of this.\\n\\n\r\nAt the end of the day, Seiren isn't a Birdemic, but it really wasn't what I thought it would be. None of the side characters are note-worthy, and neither are all but one of the main ones, which is a strong disappointment considering how memorable Amagami was. It's not bad, but I would have greatly preferred a season 3 to Amagami.",
            "date": "2018-03-02T08:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 272809,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6943364.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SCLFI",
                "username": "SCLFI"
            },
            "url": "https://myanimelist.net/reviews.php?id=272809"
        },
        {
            "content": "Seiren is a smooth rom-com, more indicated to someone who doesen't requires much from the drama part in a romance, it's a happy story composed by three short stories. It's was funny, but not deep.\r\n     Despite the cliches, it was enjoyable, with simple to noticiable changes in the stories plot depending on the route. The design is ok, it could be better if the differences between each charecter's set was more noticiable, I got a bit confused in some scenes, but nothing that really bored me. The MC it's not very striking, without big goals ordetails about his past to let his personality more acessible.\\n\r\n     Within 12 eps the character development was commited, with little time to deepen their boundaries in a touching way, what can be noticed in the lack of big challenges to be surpassed, so the drama is quite modest. Routes showed up some of each set's future, without showing very dramatic rejections.",
            "date": "2018-01-26T06:49:00+00:00",
            "helpful_count": 1,
            "mal_id": 269704,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6808769.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SilverHakushaku",
                "username": "SilverHakushaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=269704"
        },
        {
            "content": "Story: 6/10\r\nThe stories were nice overall. I enjoyed the Amagami SS feeling in which a certain number of episodes are dedicated to each relationship. This makes sure that there will be an actual ending to the story instead of a cliff-hanger, one of those situations where the main character never makes a choice on who he wants to date, and any outrage from fans who wanted another character to have been chosen instead. That aside, this was one of the only good things the story actually had to it.\r\nI felt, similar to other reviewers, that this work didn't live up to what it was meantto be. Maybe because it felt slower, less fulfilling than Amagami SS and their endings, but there could have been more. The story progression was average for the most part, with a few good parts, the part of these stories that really buried the hatchet for me were the endings.\\n\\n\r\nThe first story had good progression but completely botched the last episode, the ending wasn't very appealing either with no later insight on what occurred afterwards. \\n\\n\r\nThe second story had so many paths that could have been taken but ended similarly to the first one, only that this story actually had a clear ending to it.\\n\\n\r\nI have no comment on the third one because I never got around to finishing it.\\n\\n\r\nArt:  8/10\\n\\n\r\nI enjoyed the art style used in this anime. It didn't go too far into the realistic area that most anime's are trying right now and it wasn't blocky like some of the older ones.\\n\\n\r\nSound: 7/10 \\n\\n\r\nOverall enjoyable sound, I enjoyed the opening theme the most.\\n\\n\r\nCharacter:5/10\\n\\n\r\nThis is the part that really messes with me the most. All of these characters you can barely tell apart until after the third episode. I understand that they were trying to make this more relatable instead of having girls with pink hair and blue hair, but it became confusing trying to tell these characters apart. I also hated the way the main character acted, Shouichi seemed too cowardly, he had nothing going for him. I'm glad that the girls had lots going for them academically and in sports, but Shouichi was depressing overall, he had no courage, was reminiscent of other anime MC's, and was so cowardly that it hurt.\\n\\n\\n\r\nEnjoyment:7/10\\n\\n\r\nThis show brought back memories of Amagami SS, it's sort of like a refresher or backup to it. I enjoyed this show because of the way it was made, with a story that had a guaranteed ending instead of the route that many anime take in where the MC never chooses a girl and you have to play the game or read the manga to find out how it ends.\\n\\n\r\nOverall: 7/10\\n\\n\r\nThat's all there was to this, it seemed like a knockoff, or discount version of Amagami SS, I liked how the character was different in a way, but I didn't like that the differences made him depressing for the most part, my reviews probably would have been higher if it wasn't for the fact that there is already another anime better than this one, it's a nice time consumer with some touching scenes. \\n\\n",
            "date": "2017-09-17T20:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 257860,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DarkHarmonics",
                "username": "DarkHarmonics"
            },
            "url": "https://myanimelist.net/reviews.php?id=257860"
        },
        {
            "content": "Hi, here's another review, I just completed watching the anime, and I'll tell you my conclusion here. This review will have spoilers, although I doubt it matters, but you never know, but I already said it.\r\nMusic\r\nAs for music, I really do not remember anything except the OP. I think it's monotome in general, except the OP, I love it ... unlike other romance anime, that fill the OP of hearts, to make you vomit .... I really liked the OP of Seiren, .. has that Romance effect cute and melancholy.\r\nStrokes and drawing\r\nAs for the art of drawing, I liked that the characters have different featuresto that of other animes, there were areas that seemed to be drawn quickly and a bit neglected, but they were generally not good. I do not say more, because this point is very subjective.\\n\\n\\n\r\nCharacters and history\\n\\n\r\nAs for the protagonists, the one that I loved most was Tsuneki, like most, his personality makes you enjoy the \"arc of Tsuneki\" has a personality more worked. Although the conclusion is daunting, (unlike the other 2) I guess they wanted it.\\n\\n\r\nTooru, on the other hand, seemed more unreal and complex,. I know a lot of gamer girls, from amateur to professional, and even so, the character of Tooru, looks pretty unreal, something that is very shocking after Tsuneki, but what I really think was wrong here, is that the complex personality of Tooru , It needs more than 4 chapters to develop, everything was very fast and incongruous in this arc.\\n\r\nShe is very shy, unlike the other two girls (Tsuneki and Kyouko), so you have to give her more time to get things done. I think that forced her personality, so that its history reaches into 4 chapters.\\n\\n\r\nAs for Kyouko, it is true that his character is generic in several anime, but I seemed, very tender the \"Arc of Kyouko\", was predictable, but tender. The youngest girl, whom you have to protect because of her lack of maturity.\\n\\n\r\nAs for Shouichi, his opaque personality seemed to me okay, .. WHY? ... because Seiren is an anime style \"adaptation of romantic Visual Novel\". And several guys feel that they \"are in the place of Shouichi\", it is for this reason that their personality is opaque. But this leaves out, the guys with strong personality, (who have seen this anime) .. if unfortunately it is so, and surely they hate the personality of Shouichi.\\n\\n\r\n---------\\n\r\nIn if I do not call much attention to \"Romances for Arcs\" because they involve many emotions, which are truncated at the start of a new Arc, and that to me is very tiring. But hey, that's part of it.\\n\\n\r\nThe worst of Seiren, in my opinion, are all fucking fetishes, which seemingly integrate all animes Shounen and Seinen of romance. That is, I am also a boy of 20 and a little more, and I also like the scenes risque, like the upskirts, attractive girls, and situations like that, in the anime.\\n\\n\r\nBut to put so many disgusting fetishes and banned parafilias (referring to lolicon, etc, ....), just because yes, I think that ruin any Anime. It becomes vomiting, I think I speak in the name of the vast majority of guys who see anime \"romance, or harem\", that this is disgusting, I do not know what shit happens with Japan.\\n\\n\r\nLet's be honest, we are men, and we like girls, and see anime with pretty girls, and comic and perverted situations, but there is a limit. And that's why I say: I do not know what the fuck happens to Japan.\\n\\n\r\nThe best I would say, is the romantic setting (excluding the above), especially the first 4 episodes.\\n\\n\r\nAnyway, it is not an anime to see again, because you are enchanted with the story and want to repeat it ... Since it sins of the same as the horror films of USA., \"Terror, .. terror .. terror ... pornographic scene that ruins the story and plot. \"\\n\\n\r\nI would have preferred 3 romantic arches, with better developed history. Which is what Seiren painted at first.\\n\\n\r\nThank you for reading and have a nice day.",
            "date": "2017-08-27T13:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 256364,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6513721.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Lowliet-ml",
                "username": "Lowliet-ml"
            },
            "url": "https://myanimelist.net/reviews.php?id=256364"
        },
        {
            "content": "A lot of people say this anime kinda reminds them on Amagami SS. I can't say so, because I never watched Amagami, but I can definitely see the art is the same as Amagami's. They say that this is not a worthy anime, a worse version of Amagami which I also cannot confirm. They say this is an uninspired anime, which I agree on. In some situations we can definitely see the \"filler\" parts, but it's not so noticable. Although this is a copy of Amagami and it is an uninspired show, I loved every minute of it. I'm not into romance anime at all.I watched only like 6-7 romance anime and I really can't be the person who compares the quality of this anime to other romance anime. But I just feel the need to write this review, give my opinion about Seiren and tell why I liked it.\\n\\n\r\nStory:For a guy who hasn't watched a lot of romance anime, I think this anime has a decent story. The story has 3 \"arcs\" in which our main protagonist Shouichi Kamita, imagines himself in future with each of those 3 girls. But the question is: who the real girl is? In case you don't want spoilers, skip the next paragraph.\\n\\n\r\nThe show starts with a typical laid-back solo guy who likes this girl Tsuneki. She doesn't seem to care much about him and teases him every time they talk. But then comes the end of 1st high school year and our main character, Shouichi who seems to care about school in comparison to other school anime main characters, goes to a summer camp to study. In the first evening, a girl soaked in water gets in his room through the window right in front of him. That girl appears to be Tsuneki. She got here by the accident and wants to leave, but after some time spent with Shouichi she decides to stay. They develop their relationship and after coming home they fall in love. But, they just can't be together because of her future job. And so, our protagonist lost his chance until he meets Miyamae, a fellow gamer. When did this turn into a gaming anime? He and his friends spend some time together playing with her and they fall in love. But of course, she is a 3rd grader and has to study and leave them. The 3rd arc of the anime, if I can say that, is about Kyouko, his childhood friend. She is childish in the beginning, but they develop their relationship and she becomes more adult. Who would have thought, they fall in love again. In the end it appears they are still together, but there is a problem. After each girl's arc he imagines himself 5 or 10 years later with them. And my question is: who is his first choice? I think it could be Kyouko, but I'm really not sure.\\n\\n\r\nSo this was a \"little\" summary of the story, which is very decent. It is kinda weird watching a romance anime (non-harem of course) with 3 girls falling in love with the main guy. I really wonder who the main girl is. But the thing what is bothering me more than the main girl, are actual relationships between Shouichi and his girlfriends. For me, this is the biggest lack in the whole anime. Actually, they don't seem to love each other. They are like: \"Hh, yeah, I like you and want to be with you\" but for temporary. Real love doesn't seem to exist in this anime. I don't know if I'm not seeing things, but he is definitely not in real love with the first 2 girls. But the 3rd girl seems like a real one, but it could only be my imagination. Or the fact there are 3 main girls is actually ruining the real love of this anime. However, considering this big lack, I still loved the story.   Story: 7/10.\\n\\n\r\nArt: This anime's art is nothing special, but the characters really appeal to eyes. There is maybe a little lack of uniqueness because the art of Kyouko and Tomoe seems identical on first. But later I realised Tomoe has more brownish hair.   Art: 7/10.\\n\\n\r\nSound: The opening song is ok. Endings are not ok. There are 3 endings and honestly, I listendes to them only once and I skipped them every other time. The thing I absolutely loved were the themes from actual anime. They were so appealing.   Sound 5/10.\\n\\n\r\nCharacter: This is both a very happy and a very sad anime. There are some happy, funny moments and there are some sad ones. But as I mentioned in the story, I miss this feel of real love in anime. Characters seem to care about each other and they like each other, but that's all. There is no real passion. But other than the biggest lack in a romance anime, the anime was very good and it made me happy. Especially the last 5 minutes of last episode.   Character: 5/10 (only because the lack of love).\\n\\n\r\nEnjoyment: Although there is no love in this anime, I highly enjoy it. I do not know if that's because I watched a little amount of romance anime or the anime is really good.   Enjoyment: 9/10.\\n\\n\r\nOverall: My review probably is exaggerated, but the most important thing in your opinions about some show, movie or a book is your enjoyment. I can't just get here and critically say there is no love. This is a disgrace for romance anime. I give it a 2. NO! I can't. Because I personally have enjoyed this anime. A lot of fans are very critical about anime and they actually write what the anime is, not their opinion about the anime. I know one like that in real life. He doesn't enjoy any anime he watches. He just watches it and gives a 4 in reviews. Why bother watching anime then if you don't like it. I only want to say, the next time you want to decide either to watch the anime or not by reading reviews, skip the critics. There is always a person who will rate a great anime with 2. Only read the positive reviews, because if someone enjoyed the anime, why wouldn't you enjoy it too? So that's all from this review, hopefully you will skip the 2-rated reviews and hopefully you start watching this an like this anime.   Overall: 7/10.\\n\\n\\n",
            "date": "2017-08-23T11:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 256105,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176604.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Goldee_",
                "username": "_Goldee_"
            },
            "url": "https://myanimelist.net/reviews.php?id=256105"
        },
        {
            "content": "This review is on my opinion on the anime\r\nIn all honestly the anime was doing really good until they screwed it up on episode 5. The anime has 3 different stories into 1 anime which really pissed me off.\r\nStory:7/10 3 different stories put into 1 anime. The story started off amazing where there is an unpopular guy in school and a really popular girl hitting on him. It was moving on to the right direction until episode 5. Basically there is 3 different arcs.1st arc 1 guy and 1 girl fall in love and when they kiss BOOM, next episode starting with a new girland new story. The anime would've been sooooo much better if they focused on 1 girl and 1 story.\\n\\n\r\nArt 8/10 I rate the art 8/10 because when people look for an anime to watch they focus on genre and art styles. The art style used in this anime was amazing, from romantic scenes and video games I think the anime art is amazing.\\n\\n\r\nSound 8/10 The sound I give an 8 because the sound the video games made was almost identical to a irl video game. The sound of being scared to death and playing the right music for a romantic scene I think an 8 would be perfect.\\n\\n\r\nCharacter 8/10 I love each character in the anime. I love their personality and how they all have something in common. Lets me honest not all girls are the same and this anime proves the point. But the fact that the anime switched between girls really made me make the decision. If they had focused on 1 girl then I would've gave it a 9.\\n\\n\r\nEnjoyment 7/10 I said 7 because it really pissed me off when they just switch between girls. The anime and romantic scenes are beautiful but if they had focused on 1 girl then the enjoyment would be soooo much better. The anime was ruined during the 2nd arc but I still kinda enjoyed the 2nd arc. The 3rd arc was the worst arc of all. \\n\\n\r\nOverall the anime is a 7/10 only because they switched between girls. If the story was mainly on the main girl Tsuneki then the anime would've been 1 million times better. \\n\\n\r\nOther than that I would recommend this anime because I still loved it\\n",
            "date": "2017-08-18T15:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 255761,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141734.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AnimeSpirits",
                "username": "AnimeSpirits"
            },
            "url": "https://myanimelist.net/reviews.php?id=255761"
        },
        {
            "content": "My rate for Seiren is a 9/10\r\nSeiren is one of my favorite shows but there is two things I hate about it. What I hate about the show is 1. How he didn't end up with Tsuneki Hikari 2. The person he ended up with. When I first saw the show ( only 7 seconds in ) I said \"ok so there isn't any English dubs.\" A few months passed and I saw the show cover again and I just wanted to watch it. I finished the Tsuneki Hikari arc and thought to myself \"not too bad\" and read the forum discussion and people weresaying \"the Tsuneki hikari arc sucked\" but it really wasn't all bad. I finished the Tooru Miyamae arc and I said \"tf is he a hoe he just kissed 2 people.\" I finished the last arc it's not bad but really he had to end up with his child hood friend what are you for real. Overall it's a great show and you should watch it. My concluding thought is he should have ended up with Hikari and my favorite scene was when they kissed under water. But for real Hikari should have not said anything and let him confess and said yes because of the fact that after 5 years she comes back to work and not come back for him like smd.",
            "date": "2017-07-20T12:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 253312,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6305074.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/UZl",
                "username": "UZl"
            },
            "url": "https://myanimelist.net/reviews.php?id=253312"
        },
        {
            "content": "Okay so I am writing this while I let the last episode load up. Seiren is one of those hidden gems in the romance genre. With a low score of 6.33 (20170619), my best guess is that it did not live up to anyone's expectations. However, this is my first time watching a show where the MC develops relationships with 3 different female characters (not a harem) that are 4 episodes each. To summarize it up the MC develops a relationship with a female character to push, encourage and motivate them to better themselves. While the two start off as strangers, the relationship builds andthe emotions of love do as well. \\n\r\nThe greatest strength of Seiren is the development of the female characters. While they are not perfect, the MC helps them strengthen their weaknesses and find their path in life. While the time with each female protagonist is short, Seiren makes good use of that time to develop them. \\n\r\nReally my only issue with this show is the MC. The dude is a giant cuck. I am not saying that the MC needs to be all that is man. His lack of development is what brings this show down. I would have liked to seen a more balanced MC. This is the kind of guy that is too good, to the point where it is a fault. \\n\r\nWhile the pure romance genre typically is not something I enjoy, this is one I would highly recommend to others.",
            "date": "2017-06-18T23:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 250315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4900873.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lovevillain",
                "username": "lovevillain"
            },
            "url": "https://myanimelist.net/reviews.php?id=250315"
        },
        {
            "content": "Seiren is a Romance Anime that goes through a different path compared to other Romance/Harem Animes. The show goes through 4 episodes dedicated to one of the girls that the MC deals with and it left me with pretty good impressions. \r\nStory: 6/10\r\nThe story deals with a high school guy named Shouichi who deals with different girls in various timelines. The episodes deal with how he gets to be in a relationship with each girl, which takes, as I mentioned, 4 episodes to show this development. While the formatting of the episodes is something different, there wasn't anything new in terms of character development ormassive, plot-changing development. \\n\\n\r\nArt: 7/10\\n\r\nThe art style was alright, I enjoyed the character designs, even though it isn't the greatest art style I've seen. There was some fanservice that made me groan, but it was tolerable enough for me. Overall, it was pleasing enough for my tastes. \\n\\n\r\nSound: 7/10\\n\r\nThe OP and ED were alright, but nothing memorable out of the two, and the songs played in the episodes weren't very memorable. \\n\\n\r\nCharacter: 6/10\\n\r\nThe main character is a guy named Shouichi who is your average guy, but only that he's a bit more timid than the average harem MC, as well as he tends to have some odd peverse thoughts (You'll understand this if you see his dream with Hikari). Hikari is pretty much a popular girl who over time warms up to Shouihi (Kinda like a Tsundere) during their timeline, although I felt she was a little too bitchy and spoiled of a character. Tooru is an upperclassmen who spends time playing video games, whether it be in school with friends, in an arcade, or in her house, but she's a friendly person who enjoys the company of others. Finally, Kyouko is the childhood friend and neighbor (if I remember correctly) of Shouichi who is a little naïve, but wants Shouichi to see her as a growing young woman and not as a childhood friend. There are also some characters that were okay, but nothing very noteworthy of them to be mentioned here. Overall, Tooru was my favorite character since I personally could relate to her for the love of video games. \\n\\n\r\nEnjoyment: 7/10\\n\r\nI enjoyed the show pretty well, I liked some of the funny scenes in the show, some of the fanservice made me groan, but I thought it was pretty well done for a Romance Anime. The characters could've been fleshed out a little more, but I think they were good enough for my taste. There's nothing really big that changes the genre of Romance, except the format of the episodes, but it was a pretty good anime. This isn't the type of anime for everyone, and I don't recommend it, but I don't think it should be completely avoided. Watch if you want to, but don't expect anything revolutionary to the Romance Anime genre. This is just another anime that views a part of everyday adolescent romance.",
            "date": "2017-05-17T07:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 247907,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5843414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/OBruxo",
                "username": "OBruxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247907"
        },
        {
            "content": "I was really anticipating this anime when it was announced. I saw the cover art and was really anticipating some really ecchi stuff which I enjoy (Porn sells).But instead got a bit disappointed with the lack of everything.\r\n6 for the story. Meh rushed because of the constant change of a girlfriend and holy shit shoichi is a tryhard.\r\n8 for the art I mean you cant not love dem thighs\r\n7 for sound opening good nothing else really.\r\n3 for character these were the most shallow, uninteresting ,clichéd and underdeveloped characters ever.Shoichi had NOTHING going for him and he has a boring hairstyle and is just all aroundannoying weeb. The girls in this series are the same too with a bitch, a shy gamer grill and a childhood friend...\\n\\n\r\nMeh still was looking foward to what happends on the end so 8 for enjoyement.\\n\\n\r\n6 overall because sure I was watching the show every week bu still didn't like it that much and wasn't that rememberable after only couple of weeks.\\n",
            "date": "2017-04-26T10:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 246354,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4347425.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jessechugaga",
                "username": "jessechugaga"
            },
            "url": "https://myanimelist.net/reviews.php?id=246354"
        },
        {
            "content": "Seiren is one of the two animes of this anime season that are not based off an established source such as a light novel or manga but are rather based on an original story that was created for this anime. Seiren is a romance/ comedy anime itself a genre hybrid that I rarely see in animes. Apart from the genre another reason that this anime drew me in was because of its somewhat unique story structure in that the anime itself is actually three different story arcs that are combined into one anime. Usual practice within not just romance animes but also animes in generalis that there will be a main plot with several subplots that are contained within it. The fact that Seiren opted to make use of this approach instead was surprising and made it somewhat unique. \\n\\n\r\nStory and setting \\n\r\nThe story of Seiren revolves around the life of the main character Shouichi Kamita a second-year high school student who is in the middle of preparing for his university entrance exams and the next step in his life. Amid this phase of his life and his upcoming departure from his school life and into higher education begin to think back of the things that he hasn’t managed to do in the past that he may not be able to do when he’s in university because he will be too busy with his studies. Foremost among this is establishing a relationship with a girl that he likes and spending his life with her as they both step into the next part of life. To not have these regrets Shouichi plans to spend his remaining time in high school to not just keep up with his studies but also to enjoy the remaining years of his school year and make some good memories of the relationships that he both established and will establish. \\n\\n\r\nAs stated earlier Seiren itself a 12 episode or a half season anime makes use of a rather unique story structure in that its self-divided into three different story arcs that form part of the overall plot. Each of these story arcs has its own heroine and each is a self-contained story which means that the events and conclusions of one arc will not spill over the other arc with each new arc rewinding to before the previous arc started. With some exception, each of the heroines are present in each of the arcs along with the support characters that support the arcs main heroine. Seiren has three main heroines so each has a set number of episodes that are assigned to them. I feel that this form of storytelling was unique as it allowed the story to focus on one heroine at a time and allow us as the viewers to see how the relationship between the anime’s respective heroines slowly develop. \\n\\n\r\nShouichi \\n\\n\r\nShouichi voiced by veteran voice actor Atsushi Tamaru of Asterisk wars fame is one of the main characters of the show and is the protagonist of the series. A second-year high school student Shouichi is an earnest, honest and kind person that is nonetheless a bit of a pervert as he often has the tendency to think rather impure thoughts when meeting girls. Despite that Shouichi is a rather down to earth character in that he that he cares about the feelings of others and always consider them before making any rash decisions. Shouichi is also the type of person that would never leave a person that’s in trouble alone and would always try to help them whenever he can. Character wise Shouichi changes quite a bit over all three of the story arcs becoming braver and determined and focused not just on his future but also in trying to understand the feelings that he and the respective heroines have for each other as their relationship changes. As characters go Shouichi was an interesting character in that though he started the series by having a rather bland and care free personality but later developed into a caring and dependable person that was also understanding and kind. The tendency of him to think impure thoughts when he’s with the girls is more comical than serious more so when the respective girl figures out what he’s thinking and punishes him for it. I felt that Atsushi Tamaru did a pretty good job portraying Shouichi. \\n\\n\r\nHikari \\n\\n\r\nHikari voiced by veteran seiyuu Ayane Sakura of Charlotte and Trinity seven fame is one of the main characters of the series and one of the series three heroines. An attractive and somewhat willful girl Hikari is the class idol of class 2-B which is also the class that Shouichi is in. Though Hikari is aware on how pretty she appears to others Hikari isn’t arrogant about it or haughty and indeed Hikari’s personality is the opposite of what a typical class/school idol should be like. Personality wise Hikari is a cheerful, positive and spirited young woman that can given time get along with most people that she can meet. Unlike the typical school idol type of character Hikari has little in the way of ego besides what girls her age would have. Although appearing to enjoy high school life and not appearing to be worried about either her grades or her future it’s the opposite. Below her positive and cheerful personality Hikari really has no idea on what she wants to do in the future and though her grades are average they are not high enough for her parents tastes. As a result, it can be said that Hikari has many worries and problems that normal people would not be able to see due to her cheerful face that she puts up as a shield to protect herself. As members of the same class Hikari and Shouichi do know each other but mostly as people from the same class as neither had the time to really talk to each other and establish a proper friendship. However, it is apparent from early on that Hikari does like to tease Shouichi usually by sitting on his desk when he’s away. Whether this is due to her playful nature or whether it’s just for fun is anyone’s guess. \\n\r\nThe friendship between the two ultimately start when they both found themselves forced to attend summer classes as both had failed to attain high enough scores in the preceding exams. The process in which the two began to slowly establish their friendships I felt was good as it felt natural and gradual. Because of the friendship and bond that they had managed to forge Shouichi was able to understand some of the insecurities that Hikari felt and help her find something that she likes and use that as a basis for creating her future path. I felt that the romance and the bond that Hikari and Shouichi managed to establish over their arc was well done as it developed from the respect that both have developed for each other as they listened to each other’s problems and helped suggest ways to solve them. I also liked how Hikari’s future was established after an observation and suggestion from Shouichi after seeing her cook just once. All in all, I felt that Ayane Sakura really did a great job portraying Hikari. \\n\\n\r\nTooru\\n\\n\r\nTooru voiced by new seiyuu Shino Shimonji is one of the main characters of the series and one of the three heroines of the series. A third-year student and thus Shouichi’s senpai within the school Toru is a quiet, shy and awkward girl that finds it hard to talk to people that don’t share her interests. Toru is both an avid gamer and an excellent crafter able to create many different types of goods that includes key rings. Toru and Hikari are old friends in that both attended the same middle school and were both avid gamers back in the day however because of their move to high school their relationship soon become more withdrawn. Because of her quiet nature and her rather introverted personality Toru can be hard to know and as a result she is a bit of a loner within her loss with only a handful of friends. In her story arc Toru and Shouichi met by chance and swiftly become friends as they both share a common interest which in this case is in gaming. As a result of the common interest and the easy-going nature of Shouichi and his friends Toru was able to find a place where she could belong and talk to people about things that they both care about. Like the rest of the story arcs Toru has her own problems and issues that plague her which is mainly caused by her obsession with games and the social effect that this has on not just herself but also with her friends. As a result of their shared interests this is something that Shouichi knows all too well and it’s from this that Shouichi is able to begin the effort to change her personality. With Toru’s arc, I liked the idea that the two were able to find a topic that both were interested in as this is one of the cornerstones of forging a friendship and I felt that the interactions that the two had with regards to the games that they played were also pretty funny. It was interesting to see the effects of obsessive gaming being used as a personality fault and seeing Shouichi gradually change this by being with her more was nice to see. I felt that Shino Shimonji despite still being new did a great job voicing Toru. \\n\\n\\n\r\nKyoko \\n\r\nKyoko voiced by veteran seiyuu Juri Kimura is one of the main characters of the series and one of the three heroines within the show. A childhood friend of Shouichi and now a first year within the same high school Kyoko is an innocent, kind and rather naive person that can act somewhat childish at times. As a result of being a childhood friend Kyoko has a rather close relationship with Shouichi frequently coming over for special events such as new year’s or Christmas eve. A notable trait of Kyoko is that she has two different sides to her personality. The childish side loves cute things and reads manga while the other side of her is a honor student that has excellent grades. As a result of the fact that they grew up together Kyoko can be rather carefree around Shouichi with regards to clothing choices which has the effect of causing many comical and awkward situations. Despite that the friendship that she establishes with Shouichi is something that she values immensely. As with all heroines on the show Kyoko has her own problems that Shouichi has to solve as part of their evolving relationship. With Kyoko, I liked the fact that the childhood friend troupe which has long been a staple of character stories in anime and manga were expanded upon and used as a challenge for the main character in order to be able to develop a romantic relationship with her. Another trait of Kyoko that I found was quite funny was how naive she is with regards to love matters which I found to be pretty amusing. Overall I felt that Kyoko was a pretty well designed character and her interactions with Shouichi was the funniest out of the three heroines. \\n\\n\r\nArts and animation \\n\\n\r\nIn terms of arts I felt that the character designs for each of the main characters as well as the support characters were pretty well done. The designs for the school uniforms that the cast wears I felt was pretty well designed. The anime featured a number of different and valued environments that included not just the school but also the surrounding areas and also a remote hotel for the first arc of the series and I felt that these were pretty well designed. Animation I felt was pretty good and was pretty crisp and clear. \\n\\n\r\nMusic \\n\r\nThe opening and ending themes I felt were pretty well done and the scene music. \\n\\n\r\nVoice acting \\n\r\nIn terms of voice acting I felt that both the main and support cast actually did a pretty good job with some of the guest characters being surprisingly good as well. In particular, Ayane Sakura and Juri Kimura who voiced the characters of Hikari and Kyoko as veterans did a decent job portraying their characters. Tooru’s seiyuu Shino Shimoji despite being relatively new I felt did a pretty good job voicing her character. Additionally, a number of support characters I felt were portrayed pretty well by their respective seiyuu’s these being Manami Namakura who portrayed Shouichi’s sister Tomoe and Mai Kadowaki who portrayed the character Mako who is a character that Shoichi and Hikari meet at the summer school. \\n\\n\r\nOverall conclusion \\n\\n\r\nFor a romance anime to work it has to have both a strong main character and either a strong heroine or in this case a series of strong and likable heroines that have a unique personality. Additionally, it also needs to have a strong story that ties all this together. In this Seiren, actually has all these requirements as it has a strong main character and three heroines that are each unique and attractive to a degree. In terms of story the unique fact that they divided it into three self-contained story arcs was a good move on the studio’s part as it allowed a closer look at the developing relationship between the main character and the respective heroine. With regards to the heroines I felt that each of the challenges that they had to face with regards to their future was well designed and in accordance with their own personality traits and watching both the heroine and Shouichi try to find a way to solve it was interesting. Overall I felt that Seiren had a great story, a unique story structure, a great cast of characters, capable voice acting and good character and uniform designs. \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2017-03-31T14:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 244164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=244164"
        },
        {
            "content": "I see this anime is compared to Amagami SS a lot. I haven't seen Amagami SS so I won't be able to make that kind of comparison and personally I don't feel the need to since Seiren is an anime that stands alone and should be allowed to convey its story in its own way. I personally enjoy Seiren very much even though I've only finished till episode 9. Really looking forward to the rest of it. \r\n- The ART is beautiful and compelling. The lighting gives you a sense of pureness and warmth.\r\n- The STORY is light-hearted and not exactly the highlight of theseries. Nevertheless, the simple story line is to compliment the personality of the characters. \\n\r\n- CHARACTER DEVELOPMENT is very little and isn't what impresses me, but their dialogues are intriguing to me. Their reactions to every situation or to one another seem natural and utterly hilarious. \\n\r\n- The MUSIC is nice enough in my opinion. \\n\\n\r\nI hope you guys will also have a good time with this anime like I did ^^",
            "date": "2017-03-04T19:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 241883,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5882843.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gimmekitkat",
                "username": "gimmekitkat"
            },
            "url": "https://myanimelist.net/reviews.php?id=241883"
        }
    ]
]