[
    [
        {
            "content": "In an age where media is thriving and the economy is stagnating and slowing to a crawl there’s often the question of product quality versus a more cost-effective approach. This holds especially true for the anime industry where the bulk of the paying audience are exploitable and easy to profit from. There's a sizable amount of anime where a certain degree of integrity and quality is held over the potential of large sales numbers  and, conversely, there are shows where quality is disregarded and instead replaced by a number of efficient pandering methods.\r\nUnfortunately, Haiyore Nyaruko-san is one of the latter. \r\nThe anime takes placein a world where deities of the Cthulhu Mythos are secretly wreaking havoc on Earth, often having their horrifying appearance and demeanor replaced by that of a cute teenage girl... or boy. After the titular Nyarlathotep arrives on Earth to save Mahiro from a sudden alien attack, she chooses to stay at his house after deciding that she loves him. This, of course, confuses our dear protagonist and gives precedence to his tsundere behavior. \\n\\n\r\nAs the episodes pass more deities begin to work their way into Mahiro's treasured and so-claimed \"normal life\". The first of which is Cthuko, a twintailed and obsessive bisexual incessantly chasing after Nyaruko and her body much like Nyaruko does with Mahiro. Hastur also makes an appearance, a young boy who looks very much like a girl and frequently causes confusion to Mahiro as a result of that. Other characters include Mahiro's mother, secretely working as a deity hunter, and Ghutatan, another deity in the form of a small girl that joins in on the shenanigans for the final two episodes. \\n\\n\r\nCalling any of these characters interesting would be a gross overstatement. \\n\\n\r\nThese are one-dimensional and stereotypical archetypes that do little except fulfilling the audience's penchant for attractive young girls. Most of the interaction between them revolves around the same repeated jokes and situations, used again and again with not a single care for change. Nyaruko will behave in a forcefully lewd manner towards Mahiro, often involving sudden kisses or talks of marriage, and then he'll become angry and stab her with a fork. Cthuko will go on to do most of the same towards Nyaruko and she'll push him away because of her love towards Mahiro. After seeing this interaction repeated for the nth time it becomes incredibly stale and tiring. It really makes evident that there is nothing going for the characters besides their physical appeal, and Xebec frequently exploits that and uses it as its way to catch an audience.\\n\\n\r\nIn between all the awful character interaction there's an abundance of superfluous otaku references. These include dozens upon dozens of titles such as Back to the Future, Ichigo Mashimaro, Ashita no Joe, Denpa Onna, and Haruhi. Now, references to other anime can be amusing and add to the comedic value when they're implemented well but that's very far from being the case here. There aren't just a few thrown in during each individual episode, but rather dozens of times in each, sometimes flipping from one reference to another in the span of about 15 seconds. There's no transition and little context, they just happen. Repeatedly. What's most shameful isn't necessarily how bad or annoying these references can be, but that Xebec has apparently decided that comedy isn't even relevant as long as you make piles of references towards shows that the audience may have enjoyed. \\n\\n\r\nThere's a point where it becomes funny and then there is a point where it just devolves into frustration and pandering. The occasional anime reference can be quite nice, but in Nyaruko-san it does nothing but infuriate and make watching the series an arduous experience due to their superfluous usage. Haiyore! Nyaruko-san is an anime that has about all the comedic sophistication of Hannah Montana and Meet the Spartans. \\n\\n\r\nFor an anime that is constantly parodying other series and their tropes, it really makes you wonder when the same cliches and issues are present in the show itself. Harem members suddenly \"transfer\" into the same classroom as the protagonist, characters decide to neglect their duties to go on a trip to the beach, the protagonist and main heroine (mistakenly) bodyswap with eachother, and people walk in during inopportune moments and misunderstandings follow as a result. There's a glaring amount of cliches and, sadly, these are mostly important or genuine aspects of the series rather than simple parodies or references. If you're looking for anything unique or original in that regard then you are most definitely not going to find what you want here. \\n\\n\r\nThe only thing to set this series apart from any other bad harem anime is the addition of the Cthulhu Mythos, but even this is mostly made irrelevant by how the story and deities are changed and bastardized from their Lovecraftian counterparts. It's an element that seems unique and interesting at the start of the series but it quickly fades from prominence in favor of fanservice and otaku references. A pretty unfortunate fact considering the rich amount of content and depth found in the Mythos. Much more value than in this anime, anyway. \\n\\n\r\nOddly enough, the series is actually bearable during the rare dramatic moments. When the terrible character dynamic is put aside and Mahiro and Nyaruko think about how much they really like eachother, it can actually be somewhat heartwarming and the characters can almost verge on being likable. It's just unfortunate that these moments can't even be counted with a full hand. \\n\\n\r\nAnother minor positive can be attributed to the art. While the budget is modest and the animation quality is passable at best, the vibrant art style and color palette makes the show a lot more pleasing to look at than most. It's refreshing to see something that actually contains color when the majority of anime instead rely on dull hues of grey, brown, or blue. That said, you can polish a piece of trash, but it will always remain nothing more than trash. \\n\\n\r\nIt's hard to determine just where this series went wrong. Perhaps the concept of the series was already flawed and doomed to failure, but a large amount of the blame can be shifted towards the studio and their insistence on pandering over quality. For people that are simply looking for a show that they can watch while turning their brains off, this is a poor but not quite terrible choice. For the people who want something more in their entertainment that extends beyond aimless fanservice and otaku exploitation, Haiyore Nyaruko-san is an insulting series with any inherent value or amusing moments being next to nil.\\n\\n\r\nSomehow I think Cthulhu monsters might be less frightening than Haiyore Nyaruko-san.",
            "date": "2012-06-29T18:38:00+00:00",
            "helpful_count": 499,
            "mal_id": 64805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=64805"
        },
        {
            "content": "Before you instantly downvote this Review for not being a 10, 9 or 8; I'd like to remind you that a 7 should be considered a \"Good\" RATING.  Anything above a 5 should be considered \"good\". MAL reviews are broken, but I'm at least trying to fix mine. Please take the time to read it all. \r\nHere's a quick TL;DR rundown of Haiyore! Nyaruko-san\r\n1- You've probably seen it before. There's nothing special about this Anime. The story is just a sequence of events thrown together so as to fit as many gags as possible in, the characters are recycled, the gags are overused. Ifyou're looking for plot, or great comedy, you won't find it in Nyaruko.\\n\\n\r\n2- The Anime is character based. As with all Anime targeted towards an Otaku audience aiming to be as marketable as possible, Nyaruko's strength is with it's characters. They're memorable, they're funny and they each have their own distinct trope. Some people maybe see this as a bad thing, and in a sense it is, but for what Nyaruko is aiming for, it's succeeded in making the characters as fun as possible.\\n\\n\r\n3- Because it's a character-driven anime, the art and character designs are great. Who cares about plot when you have these beautiful pictures to look at? Or so they want us to think. It's not that bad though. They designs are clear-cut, distinct and present the constant moe and service very well.\\n\\n\r\n4- The music is good. Catchy OP; better ED. All's nice and well. Of course, they're just OPs you've heard a million and ten times before in other Anime, and Nyaruko doesn't even try to be original. It knows it doesn't need to be.\\n\\n\r\n5- It's a light hearted watch. As I've said on countless other Anime, don't take it too seriously. No; it's not GREAT, it's not groundbreaking and it certainly won't appeal to everyone. But if you want something light-hearted and fun, and you enjoy squealing at moe characters and laughing at over the top gags, then you'll probably enjoy this.",
            "date": "2012-05-09T07:26:00+00:00",
            "helpful_count": 490,
            "mal_id": 60885,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/660485.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scruff",
                "username": "Scruff"
            },
            "url": "https://myanimelist.net/reviews.php?id=60885"
        },
        {
            "content": "I really don't get why this anime gets so many bad reviews. Actually, I do. \r\nHaiyore! Nyaruko-san is the epitome of a plot-less anime, with the absence of \"true\" romance, conflicts, or any character goals. This makes Nyaruko-san very polar; you either love this kind of random comedy, or hate it. And I happen to love it. It is such a relaxing, fun anime to watch, something you can enjoy without having to focus too hard on picking up the details.\r\nThe core of the anime is based around light parody comedy, while throwing in a TON of references. This anime has so many references tovideo games, TV shows, anime, etc. that you won't catch them all. And of course, it's very enjoyable  when you do understand one. All of the characters are very likable, allowing viewers to easily become attached to them. \\n\\n\r\nThis anime never takes itself seriously, and you shouldn't either. It has no problem creating plot holes, turning a tense situation into a joke, or breaking the fourth wall. By definition, Nyaruko-san does everything that would make an anime bad; but because it does it purposely, and pulls it off so well while giving you a great laugh, you can't help but enjoy it.\\n\\n\r\nA mix of To-Love Ru's supernatural & Lucky Star's comedy, Haiyore! Nyaruko-san does everything that caters to fans of those anime, while still presenting refreshing ideas. A high recommendation for fans of those genres.",
            "date": "2013-08-06T17:54:00+00:00",
            "helpful_count": 226,
            "mal_id": 108557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2981555.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kyuutoryuu",
                "username": "Kyuutoryuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=108557"
        },
        {
            "content": "The most unexpected anime series airing in this 2012 spring season I would say would have to be Haiyore! Nyaruko-san. It can be categorized as both Parody and Comedy at the same time and shows great promise as it is a series that does not take itself seriously and is unafraid to show itself as such. If it's able to keep up the level of quality, this series has a good chance of becoming the best comedy series of this year.\r\nIn H.P. Lovecraft's stories, the Cthulhu was an unspeakable, indescribable horror that haunted the collective dreams of mankind. In Nyaruko-san, the Cthulhu is a cutegirl sent from the stars to protect a typical normal guy.\\n\\n\r\nMahiro Yasaka is a normal high school guy until he finds himself pursued by a monster one night, only to be saved by a cute girl bloodily slaughtering the monster with her bare hands and then jauntily declaring, “I am the chaos that always creeps up to you with a smile, Nyarlothotep!”, Nyaruko for short, while striking a sentai hero-type pose.\\n\\n\r\nShe was sent there to protect Mahiro and it's revealed that she practically begged for the assignment, partly so that she can get her hands on some Earth entertainment (anime and manga apparently being highly-valued throughout the universe) and partly so that she can cozy up to Mahiro, much to his dismay.\\n\\n\r\nHowever Mahiro isn't completely dominated by Nyaruko, but tries, in his own ways, to fight back the stranger who \"destroyed\" his peaceful life. At this point that usually involves him wielding and trying to skewer Nyaruko with a table fork.\\n\\n\r\nNyaruko, despite being in some respects the stereotypical hyper-aggressive girl, is such an abjectly ridiculous character, and is played with such unrelenting enthusiasm, that it's difficult to watch the episode without a constant bemused smirk on one's face. Nyaruko is way too perky for a creature of a well-known horror mythology and generally a lot of fun to watch. She's always moving and switches conversational modes at the drop of a hat. It helps that she looks nice as well. She also has a proportionate body without either inflate-a-boobs or a little girl figure.\\n\\n\r\nThe first episode enjoys small recognizable moments, with Nyaruko's back story fast-forwarded (complete with squeaky VHS sounds), comments about how the show will get taken off the air if the characters aren't careful, and a slew of images in a store that have a very familiar look to them. Add in some sentai jokes and a Pokémon reference and you get a parody element that helps to make this more entertaining than it might appear at first glance.\\n\\n\r\nThat said, within its hyperactive romance-comedy framework, the series works really well. Nyaruko is amusingly nuts and the jokes about her Lovecraftian origin are entertaining. She's only in cute girl form because her real form would cost Mahiro a lot of \"sanity points\" and her horrific origins are hilariously apparent in her sickening fighting style (brutal beat downs using rocks to crowbars). She's also refreshingly open about her feelings for Mahiro which reminds me so much of Lala from To LOVE-Ru.\\n\\n\r\nThe animation isn't perfect, but there's enough flow that it's easy to watch and the music has a definite sense that it could grow on you.\\n\\n\r\nThis looks to be a series that will have me groaning at the end of each episode, disappointed that I need to wait for the next episode.",
            "date": "2012-04-10T21:24:00+00:00",
            "helpful_count": 90,
            "mal_id": 58515,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tenko_Ranchi",
                "username": "Tenko_Ranchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=58515"
        },
        {
            "content": "Comedy...it is very subjective, whether or not you consider a show to be funny or not simply depends on you, I think that mindset sums up Haiyore! Nyaruko-san perfectly.\r\nThis show is about a young high school boy (I know, I know) named Mahiro Yasaka, he lives an ordinary life until one day he is attacked by a demon and saved by a young alien girl by the name of Nyarlko. Afterwards she confesses her love for him and well we get a stereotypical \"hijinks ensues\" plot for the rest of the show. The main focus is Mahiro fending off Nyarlko's constant advances (which as kindof refreshing, it's usually the other way around) We get introduced to a few entertaining characters, Cthuko, a alien girl who is in love with Nyarlko and constantly tried to keep her apart from Mahiro, even threatening to burn him into ash at one point. Hastur, a trap who is in love with Mahiro and constantly vies for his affection.\\n\\n\r\nThe art and sound aren't necessarily bad, but they're not anything you'd remember all that much, doubt any of you are on the edge of your seats for the Nyarlko Original Soundtrack, one thing I will say is the opening is stupidly good, check it out on youtube if you have a chance, amazingly addictive.\\n\\n\r\nThe characters are the main selling point of the show, the interactions between all of the different characters and the situations they find themselves in are just priceless, but as I said before, this is purely subjective.\\n\\n\r\nEnjoyment is either very high or very low depending on whether you fall into the niche of this particular show. It's moe, It's ecchi, it's comedy, and it's satire, if these don't appeal to you then you simply will not like this show.\\n\\n\r\nOverall I give this show an 8 out of 10. It's a hilarious show with a nice cast of characters that interact with each other in hilarious ways, it might not be for you, the plot might put you off, but give it the old 3 episode rule and you might find another show to add to your list!",
            "date": "2012-06-28T23:16:00+00:00",
            "helpful_count": 32,
            "mal_id": 64711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309278.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vylash",
                "username": "Vylash"
            },
            "url": "https://myanimelist.net/reviews.php?id=64711"
        },
        {
            "content": "I was deeply saddened that I had literally nothing to watch. All the good series that people recommend or consider amazing have been seen by me over these past 2-3 years. There's a bunch of good anime this season but that's once a week so when I saw this series I decided to give it a shot.\r\nStory: The story revolves around a young boy who is being targeted by monsters in order to become a slave to be traded by an intergalaxy agency of criminals. Special \"enforcers\" are sent out to Earth in order to prevent the criminals from having their way. Other main heroineis the Cthulhu(spelling?) deity who has taken the form of a young girl and is assigned to our male protagonist. This show is HILARIOUS, and the fact that there's some love-crushing introduced in the first episode really bumped this show up a lot for me. I didn't see a \"romance\" tag on it so at first I was a bit iffy.\\n\\n\r\nArt: The artwork is really nice. It's similar to Sora No Otoshimono which the style of artwork I like.\\n\\n\r\nSound: Hmm I only watched the OP for maybe 10 sec. It seemed upbeat and spunky which is nice. Didn't really pull me in like certain other OP (Angel beats for instance)\\n\\n\r\nCharacters: The characters are nice. Our male protagonist doesn't act like the typical male that doesn't show any romantic emotions towards the females who are attracted to him (he at least thought she was cute and blushed, etc). \\n\\n\r\nAll in all it seems like this is a cute like comedy show with a hint of romance here and there. I hope the romance becomes a little bit more heavy. But as of now this show is GREAT.\\n\\n\r\nI highly recommend it.",
            "date": "2012-04-15T12:55:00+00:00",
            "helpful_count": 18,
            "mal_id": 58883,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=58883"
        },
        {
            "content": "I have only seen two episodes so far, but I decided to drop it, you can see where this anime is going. A romance between the two main characters and some fights to save the world.\r\nWhy did I drop it? I don't know it myself exactly, but the whole anime feels like a dejavu. If I am watching an Anime with a plot like this, which is your average boy meets girl and save the world plot, I expect a nice execution  and outstanding characters, but it fails in those aspects. This show's main characters are two kids who play kiddy love, the mainprotagonist is a bossy guy who has some aggression-issues and a girl who wont stop to talk nonsense......This show has no comedy, the battles are boring and the protagonist lack deepth.\\n\\n\r\nThe art is decent and the music as well. I think some people might like  this show, but if you are looking for something special , then don't watch this anime, you will find better anime than this.",
            "date": "2012-05-09T06:10:00+00:00",
            "helpful_count": 17,
            "mal_id": 60883,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38887.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hellwyr",
                "username": "hellwyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=60883"
        },
        {
            "content": "This will is more sort of a warning than it is a review.\r\nThe anime itself has nothing original to itself. There is no plot or I just forgot it. The anime itself does not even care.\r\nThis is a comedy anime, I know, but the comedy aspect could be better. It is FULL of references and nothing out of their own creation. Even tho I know for sure I could not catch about 80% of the references, you can just tell they just didnt do it themselves. I just think it is too much of  a multi-parody, and it never stops.\r\nI'm sorry if you thinkthis is not helpful or that I just straight up hate on the anime. I don't hate on comedies, specially if they make me laugh. But this was too much greed. \"Easy money\".",
            "date": "2014-08-31T11:01:00+00:00",
            "helpful_count": 16,
            "mal_id": 158639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3685101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/DolbyThX",
                "username": "DolbyThX"
            },
            "url": "https://myanimelist.net/reviews.php?id=158639"
        },
        {
            "content": "Quick and dirty review time!\r\nReally, they tote this as a Cthulhu Mythos based anime, but the only connection to the mythos I know is a couple names of ancient psychic outer god alien beings slapped onto teenager characters who are some kind of space cop aliens living on earth, thats about it. Beyond that, a handful of references and a couple gags relating to the dice and paper RPG are all that tie this into the mythos at all. It's funny, kind of twisted, but overall nothing special, yet another cute romantic comedy with a harem theme based around a normal everyday teenage boy whois pulled into a fantastic situation that results in him being involved with cute girls that all end up part of his daily life in some way for the rest of the show. Also, like most harem anime, he is some kind of super being with a freakish level of willpower, just like the main character of every damn harem anime, because he refuses to give into his desires and have any kind of intimate contact with any of the multiple very attractive women literally climbing naked into his bed at every opportunity. I swear Japan has the weirdest ideas about teenage boys and the kind of restraint they are capable of. Inhuman. These kids could put Buddhist monks to shame.\\n\r\nBut yah, the jokes here are a little more to my liking than most being somewhat more \"edgy\" than your average fan service driven romantic comedy. It's one of the first to have a very well integrated gay theme on the harem side of things that gets actual consideration rather than just being a joke character thats immediately shot, beaten, or thrown out the moment they show up and make a pass at the male lead. This one gets some cute awkward \"what if\" moments and generally gets as much care and attention from the main character as the female options. Overall, worth watching I would say.",
            "date": "2012-08-19T17:26:00+00:00",
            "helpful_count": 14,
            "mal_id": 70325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/69324.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gorbash",
                "username": "Gorbash"
            },
            "url": "https://myanimelist.net/reviews.php?id=70325"
        },
        {
            "content": "I really Like the anime Haiyore Nyaruko-San because its shows the beings\r\nFrom Different World can Get along with Each Other and Becomes Friends \r\nAs well, I Love the part where they Show the characters Being Interested in\r\nGames,Anime,Novels, and Showing Akihabara-being the Center of Anime\r\nGoods and Stuff\r\nthe anime Have Really Nice Design For each character",
            "date": "2012-07-29T18:02:00+00:00",
            "helpful_count": 11,
            "mal_id": 68081,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/439315.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/WhiteQueenKurumi",
                "username": "WhiteQueenKurumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=68081"
        },
        {
            "content": "After reading many of these reviews, or quickly scanning them, I realized there really wasn't a middle ground - you either loved it or hated it. And it seems to me most people wanted to hate something like this. But maybe both sides are missing the point: after all, for the people who want to bury this in the ground: lower your sophisticated and urbane shields for a second and try to understand WHY this anime wasn't deep or anything. And for the people who think this is flawless, it isn't. But perhaps I should make a stand here and try to look at BOTHsides of the issue.\\n\\n\r\nStory: 6/10\\n\\n\r\nAlright, so the story was complete trash. But that's because it's a PARADY of a serious anime; after all, every huge fight and build up turned into something comedic. But that was the point. This wasn't supposed to be some deep, symbolic story where you'll fall to your knees, begging God or Zeus for forgiveness; no, it was supposed to be funny, to blow it off as if nothing. But that doesn't mean it was good, either. It was annoying, really, to have such intergalactic conflicts blown off as trivial. I mean honestly, give me one good villain! Perhaps the story arc, bland and straight as an arrow, could have been reworked to include elements to give the story, well, a story to follow and hold on to. But for whatever reason they didn't. Eh.\\n\\n\r\nArt: 8/10\\n\\n\r\nObviously, this is where the production costs went. The artwork was flawless. Almost. The environments were kinda....bland. There were certain times, when the story LOOKED like it was going somewhere, when the artwork excelled - but most of the time, it was flat and, well, nothing special. But the characters were drawn nice, and everything seemed cutsey and too good to be true kind of drawings. The aliens and monsters were nicely drawn as well, but once again, nothing special. So, I'll give it a decent score.\\n\\n\r\nSound: 8/10\\n\\n\r\nI'm not going to berate the sound either. It was actually quite good. The theme song was typical of comedic animes, catchy and, well, funny. The background music at critical times wasn't the typical orchestra, but opera-sounding voices, which was a nice deviation from the typical drum rolling and whatnot. But here, everything seemed to be in order. So, this deserves a decent score as well.\\n\\n\r\nCharacter: 6/10\\n\\n\r\nThey really shouldn't have messed this up. I would have forgiven the studio for the lack of storyline, but you can't have static, stereotypical, almost perfectly archetypal characters that bore the audience. I mean come on, have SOME character change in some way. And really. Take out these lovey-dovey characterizations of Nyaruko and Ctchuko. I was intrigued, though, when these Greek references to gods and stuff were first introduced; but Hasta don't act like no God of Wind all the time. Sigh. And a tsundere as a main character: where haven't I seen THAT before? It wasn't awful, though, because there was SOME development, albeit almost nonexistant. But it wasn't there.\\n\\n\r\nOverall: 7/10\\n\\n\r\nOk, it wasn't horrible, but it wasn't stellar, either. Where does that put us? Somewhere in the middle. It was entertaining, but not particularly engaging either. The rewatch value would be extremely low and I would not recommend this to other people when asked to name a few anime, but that doesn't mean to completely skip it, either. It was entertaining, and funny. But I cringed several times where I shouldn't have, and certain points....well, I'll stop there. Don't completely discount this anime, though, because of the reviews, nor go into it with a heart of gold - keep a cautious distance, but don't be shy in embracing what this anime has to offer. Oh, and Merry Christmas!",
            "date": "2012-12-24T21:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 81236,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/726905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ibelucas",
                "username": "Ibelucas"
            },
            "url": "https://myanimelist.net/reviews.php?id=81236"
        },
        {
            "content": "Anime Review: \u2028Haiyore! Nyaruko-San!\u2028\r\nBy Bobjonez98\r\nStory: 6/10- \r\nThis is a tough one, the longest arc lasts maybe 3 episodes and the rest are either 1 or 2 episodes long. But the shorter arcs are actually the more entertaining ones. The story revolves around Nyaruko, who has come to earth to protect Mahiro from the evil deities of the Cthulu Mythos, hilarity ensues as anime is the only world where a Cthulu can become a bespectacled, green-haired cute anime girl.\r\nCharacters: 8/10-\u2028\r\nNyaruko is spunky, jumpy, head-over-heels in love, and that special breed of adorable/annoying. Some of her antics make her a little difficult to swallow, but she's stillquite likable. Kuuko, the quiet, lustful redhead and Hastur, the girlish young wind boy add a few unconventional relationship paradigms. Overall, the characters are likeable enough, they make for good, over-the-top comedy, and interesting interactions.\\n\\n\r\nAnimation: 8/10-\u2028\\n\r\nWith lots of fight sequences, energetic character jumps and motions, there are a lot of opportunities for the animation quality to shine. It's a tad dark at times, but never for very long. The depictions of most of the Cthulu deities are faithful, except for the ones that have been made into cute girls and boys.\\n\\n\r\nOp/Ed: 7/10|6/10-\u2028\\n\r\nThe opening to me at least sounds like a late 80's American cartoon mystery show. It makes an attempt to be catchy and upbeat, but the choices in key and beat make it hard to sound bouncy and upbeat. Overall though, it's still pretty good. The ending is unremarkable, the accompanying animation is good, but it seems to be your standard harem series ending affair.\\n\\n\r\nMusic: 7/10-\u2028\\n\r\nFor Monaca, this seems a bit sub par. Monaca usually has the magic to work a few memorable tunes into my head, but I honestly can't give you any. The battle music serves merely as a background, and the airy conversational tunes seem to disappear into the sky. They're there, and they provide good ambiance, but they're just not memorable like they are in Working!! or the Monogatari Series.\\n\\n\r\nOverall: 6/10-\u2028\\n\r\nThis is a very difficult series to give an overall score to. It doesn't meet my criteria for a 7, and it suffers from the same flaws as most of the series I have given 6s to. It has an uncanny quality to make you want to keep watching, just to see what happens next, but it isn't as substantial a series as I would like. I feel like I should probably mention the anime references. Throughout the course of the series, in several scenes, nods are given to a MULTITUDE of other series/games/ pop culture phenomena. To name a few: Pokemon, Final Fantasy, Left 4 Dead, The World God Only Knows, Haruhi, Denpa Onna to Seishun Otoko, Back to the Future, Digimon, Working, Umi no Misaki, Please Teacher, One Piece, Bleach, Naruro, Dragon Ball Z, any magical girl series, Star Wars, And Code Geass. If anything, this series is just a quick fun watch that you can play \"name that reference\" with.\\n",
            "date": "2013-03-25T22:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 90931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1937926.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bobjonez98",
                "username": "Bobjonez98"
            },
            "url": "https://myanimelist.net/reviews.php?id=90931"
        },
        {
            "content": "Mythology. Something that you don’t see everyday in anime. But I came across it in so many places, hence I would give it a try. Well, before I watched the anime, I always replayed its opening song because it was awesome.\r\nThe anime, produced by XEBEC, starts with the meeting between Mahiro, a normal high school boy, and Nyaruko, a Nyarlathotepian (or alien). She was sent into Earth by an organisation to protect Mahiro from aliens that lurked in this planet. As it progresses, more characters are introduced, be it with the pair or against them.\r\nThe story has some funny moments. You ain’t looking at anordinary heroine, but a crazy one. The one who obsess with anime and manga, not as someone who is serious to follow commands. That makes the anime good, in the sense of comedy. Fan-service is spread in these twelve episodes and they are not very excessive.\\n\\n\r\nWith mythology as a theme to the story, there isn't really much talk about myths. Don’t expect a lengthy explanation about each creatures, otherwise go to Wikipedia and do your own research.\\n\\n\r\nThere are quite a number of battles, meaning good potential action. I would say that most of them are interesting. The rest fell short for its repetition. Even after a few episodes, the story’s quality started to decline for its low action but again peaked again after a while.\\n\\n\r\nThere are a lot of references, mostly coming from anime and manga. I managed to pick a few but I didn’t care much. There is some romance too, which isn’t fully developed. Think of it as one-way. I actually think there’s a harem Mahiro has. hehe…\\n\\n\r\nSometimes, drama can seep in, especially the last episode. But usually it can be broken off into comedy, which I am not happy about. Therefore, if you are looking for a serious story, I’m afraid this anime is not for you. I guess it is good for chuckles only.\\n\\n\r\nThe characters aren’t very special. Mahiro is someone who doesn’t like a particular person and tries to avoid that person. Nyaruko is someone who wants to be attached to another particular person. This cat-and-mouse relationship has really never changed throughout the story, but there is some development in both characters.\\n\\n\r\nTheir other friends are Kuuko, who loves Nyaruko a lot by some weird reason, Hasuta, who looks like a girl but is really a boy, and Kurei, who is the gossiper of their class. Not much character development is seen in these three, but they are adapted to what has been going in.\\n\\n\r\nThe art is nice. I find the opening and ending animations very cute. The scenery is good-looking, especially on places where aliens frequent on Earth, as it gives a different look outside the human world. The character designs are well-down and facial expressions can be both cute and nice. I like how the scenes change as a battle is about to start. The action animation is great.\\n\\n\r\nI really can’t stop listening to the opening song the moment I started playing it. It has some nice beats to get your body moving. It sounds like you want to dance. Meanwhile, the ending song has a different approach, and it really bored the heck out of me, honestly. The background music is nice and the voice acting is great. There are certain voice actors recognisable from their other characters, like Nyaruko, who is voiced by Kana, who voices Hinata and Komari.\\n\\n\r\nIn the end, I enjoyed it for a while, until the part where there’s little action. I wished it could have gotten better, and if I were to remove these anime and manga references, and change Nyaruko’s personality, I think the anime can be more interesting. I will still watch the second season and see how it goes.\\n\\n\r\nDon’t take this anime too seriously. Watch it and laugh.\\n\\n\r\n(And I don't see any bad reviews at all. About two reviews received a rating of 3 and I totally respect their decision.)",
            "date": "2014-09-11T10:39:00+00:00",
            "helpful_count": 9,
            "mal_id": 159919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440083.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SkyNoHoshi",
                "username": "SkyNoHoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=159919"
        },
        {
            "content": "I liked this as a fun non serious show to watch with a fun cast of characters.\r\nIf you go into this trying to take it serious you will probably have a bad time tbh. This show likes to take the piss out of the common Harem and crappy high school story genre. \r\nA show that is similar in terms of how the show treats itself is Renai Boukun. While i did actually like that show compared to others opinion of it. This is probably a better show in terms of how it handles itself. With Renai Boukun it could seem unfocused or lost in whereit's going. This on the other hand knows what it wants to do it seems. \\n\\n\r\nOnly real complaints are four and you could say that they are just personal opinion so they don't really matter in a actual review.\\n\\n\r\n1. The Harem. While i know that it's a harem story to make fun of them. It doesn't change my opinion that harems are annoying and can ruin stories. Parodies no exception.\\n\\n\r\n2. The MC could be pretty annoying at times like most shows of this genre. I kind of want to hope the creators purposely made him like that to mimic others shows with crappy MC's but i doubt it. \\n\\n\r\n3. I feel that if the story was focused around Nyaruko as the MC and not the boy in this that it may have been a better story. I really like the relationship between Nyaruko and Cthuko and they're also my shipped couple of the series. \\n\\n\r\n4. The weird trap ... Nough said \\n\\n\r\nWhile those are my complaints there are things that i did really like. Such as how they don't just focus on one bad guy all through out the series. Most bad guys will only last 1 or 2 episodes. Having long story archs in things like a parody show can be annoying. \\n\\n\r\nTwo episodes i really liked that were back to back were when the MC and Nyaruko switched bodies. I don't know why but i just felt that the two of them are better suited in each others bodies ( Yes i know how wrong that sounds) With how this story is i wouldn't be surprised if it ended the season with the two of them still not in their own bodies. The personalities really just fit well in the other character. Especially the MC in Nyaruko's body.\\n\\n\r\nOverall a really fun story to just have some good laughs. \\n",
            "date": "2017-11-10T07:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 262929,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=262929"
        },
        {
            "content": "Uu~! Nyaa~! Uu~! Nyaa~! Uu~! Nyaa~! (dun-dun-da-dunn) Let's Nyaa~!\r\nEr-herm....First off I just want emphasize that the nature of the show makes reviewing it difficult. Enjoyment of it is highly subjective to the viewer so please take that into account. \r\nHaiyore! Nyaruko-san is a comedic parody on a rampage. It's essentially the epitome of mindless entertainment with consistent gags, references, and over-used humor. It has a very clear audience: people with significant history and interest in anime. Outside of this group, the quality of show will likely be lost. With humor also being a subjective quality, appreciation (or lack thereof) of Haiyore varies from person toperson, so it's not for everyone. This is a show geared towards those with more extensive histories in anime due to the sheer volume of references crammed into each episode. Personally, I don't have that great a history and many of these blew right past me. That said, almost everything is constructed from parody, meaning that aside from the characters themselves and the basic plot line, there is almost no original content within Haiyore. You could even go as far to saying figuring out all of the references in each episode is a game since there are so many. I believe there are several dozen in the first episode alone.\\n\\n\r\nWhat little story there is comes from the Cthulhu Mythos written by H. P. Lovecraft. The various events that take place loosely stem from the various deities portrayed within the Mythos. I have not read these stories so I cannot comment on how connected they really are, however. Little focus is placed on the story but it serves as possibly the only thing to keep the events from rocketing off into deep space.\\n\\n\r\nThe characters are what makes the show entertaining. Despite a lack of significant development, each have defined personalities which promote the wacky humor present in Haiyore. The story's hero, Mahiro Yasaka, appears to be an ordinary school boy but is thrown into a chaotic situation. Forcibly placing herself beside him is the extremely energetic and upbeat Nyarlathotep (\"Nyaruko\"). She one of the many \"Great Ones\" from the Mythos sent to protect Mahiro, though there are ulterior motives behind her appearance. Think of the two of them as a parody on the generic romance genre relationships, but with insanity thrown in. To top of the trio of main characters is Cthuko (\"Kuuko Cthugha\"). Sworn enemy of Nyaruko by virtue of their heritage, she is beyond smitten with her, much to Nyaruko's displeasure. Though these characters don't develop much, they are enjoyable by virtue of their various antics.\\n\\n\r\nWith little focus on the development of story and characters, the artwork and audio received more attention. The artwork is appealing and smooth throughout, with scenery covering a vast range of areas. I wont say where though, that would spoil some of the fun. Each of the main characters has a defining design, well except for Mahiro since he's just an ordinary boy. With aliens present, expect some funky looking characters scattered about, but they're nothing displeasing. I enjoyed how they designed each character and animated them. The audio keeps pace with the non-serious nature of the show, though remains appropriate for each situation. I greatly enjoyed the opening song as well, if you can't tell with the start of this review. I have no qualms with the visual/audio aspects. \\n\\n\r\nIf you're looking for a one word summation of Haiyore, it would have to be chaos. Chaotic turns are everywhere. Haiyore is meant to be watched with your brain turned off. It's nothing amazing and enjoyment ranges dramatically from person-to-person. If you're someone who enjoys gag-related humor, parodies of shows you've previously watched, and nonsensical progression, you fit right into the niche of Haiyore. If you fall outside this niche, I would be hesitant to watch it as you'll likely miss where the entertainment value is coming from.\\n\\n\r\nThanks for reading my review of Haiyore!, Nyaruko-san. Remember that the helpful and not helpful buttons are not agree/disagree buttons. If you disagree with my views feel free to message me and discuss. Also, if you did not find my review helpful, please let me know what I can improve upon to make future reviews more useful. Thanks again!",
            "date": "2013-06-24T13:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 102235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2408739.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MentalSyndrome",
                "username": "MentalSyndrome"
            },
            "url": "https://myanimelist.net/reviews.php?id=102235"
        },
        {
            "content": "Beautiful! FUN! Totally satisfying.\r\nThis anime has almost no plot, except the main female wants to get into the MC's pants.....simple eh? Once you watch the anime you will understand, why this may be problematic and begin to enjoy it to it's fullest.\r\nThe main female voice acting is just superb, and is the main reason you will watch this show. Sure it is quirky, at times stupid, but in the end it is just pure entertainment and fun. I am not going to go into all the details but simply to say, if you need a smile (especially if you finished watching something like Clannad AfterStory), then this is the anime for you.",
            "date": "2015-06-27T16:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 191494,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674297.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Elandrial",
                "username": "Elandrial"
            },
            "url": "https://myanimelist.net/reviews.php?id=191494"
        },
        {
            "content": "This is a review from a person who has not seen the rest of the Haiyore! series.\r\nI've noticed other reviews with reference to them, and since I have yet to see them, I'm just going to do a Raw Review. Anyway, you don't really have to have watched the others to understand this.\r\nInitially, Haiyore! Nyaruko-san is about an alien (later to develop into a group of aliens) disguising herself(themselves) as humans to protect earth. Although this may make it seem to be an anime based on the supernatural and alien-like, it's not.\r\nHayore! Nyaruko-san is more focused on the daily life of our male protagonist whiletrying to adapt to his unwanted distractions. Hayore!'s plot-line is very Harem-like, as there are three characters that share a (weird) relationship with our main man. (They share a house too!) Although you can't really call it much of a Harem. (you'll see once you watch at least half of it..)\\n\\n\r\nThe plot though is very loosely tied. It does'nt really have much of a story-line. So it's not really a serious anime. There will be times when you may get tired of watching it too. The anime is focused more on Comedy, so expect a lot of that.\\n\\n\r\nThe art is more on the \"moe\" side, so expect a lot of \"Kawaii!!!\" moments. It also offers a colorful background and a very nice array of colors through the different worlds. Although most of the times, the story takes the seriousness out of the area and just adds more comedy.\\n\\n\r\nAll in all, Hayore! Hyaruko-san is definitely a must-watch to those who want a comedic, lighthearted anime which doesn't need much brain power to comprehend... Except maybe the Space CQC thing, which totally takes away the \"close quarters\" in \"close quarter combat\"\\n",
            "date": "2012-06-16T02:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 63535,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1342693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kuro_kuro",
                "username": "kuro_kuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=63535"
        },
        {
            "content": "This will be my first true review of any series and I promise not to hold any punches!\r\nWhen I started watching this series I had very high hopes for it.  There seemed to be a lot of great possibilities they could have brought into play.  Ancient deity, actually an alien, many different aliens, etc...\r\nThat they ended up following the path they did was bewildering to say the least.  I was seriously disappointed in the lack of building up of the main character Mahiro.  So little is known about this character by the end of the series - he had great potentialand it was never explored.\\n\\n\r\nWhat I thought was fantastic about this series is the voice acting of Nyaruko!  What a breath of fresh air to have a female lead who is so over the top and so much fun!  Her acting alone has made me give this series a higher score than it really deserved.\\n\\n\r\nAll in all - it's fun - there's a few laughs here and there (more during the 1st 1/2 of the series) - but you'll forget the story line mere hours after finishing the series.",
            "date": "2013-01-29T14:34:00+00:00",
            "helpful_count": 7,
            "mal_id": 85279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1112169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/thumpz99",
                "username": "thumpz99"
            },
            "url": "https://myanimelist.net/reviews.php?id=85279"
        },
        {
            "content": "This review contains coarse language and awful humour.\r\nThis review is for both Haiyore! Nyaruko-san and Haiyore! Nyaruko-san W\r\nSTORY\r\n\tHaiyore! Nyaruko-san is a take on the Lovecraftian myths mixed with your usual ecchi harem setting. The outcome is strange, to say the least.\r\n\tThe protaganist is Mahiro Yasaka a cardboard-cutout, self-inserting relationship oblivious high school boy who stumbles into a world of magical crap. Sound familiar? It is. The real personalities of the show are the three side characters, all based off of Cthulu mythos malign deities.\r\n\tNyaruko is the personification of the outer god Nyarlathotep. She comes to Earth on a mission to save Mahiro, and subsequently fallsin love wit him. She also has one of the longest ahoge I have ever seen.\\n\r\n\tSecondly is Cthuko, the red headed Cthughan who is love with Nyaruko for whatever reason, however eventually she understands the point of a harem and starts going after Mahiro too.\\n\r\n\tFinally is the god of wind, Hastur, who's chosen form is an adrogenous boy with hair that looks like a beetle. He is also officially classed as a whiny shit. He looks up to Mahiro for tripping him up or something. Literally no one likes him, not even his own family.\\n\r\n\tThere are also quite a few side characters ranging from Mahiro's Mum who turns out to be a monster hunter, a shit 'childhood friend' trope character and a space bat that can turn into a 10 year old girl.\\n\\n\r\n\tMost episodes are isolated , with the staus quoue being reestablished at the end of each episode. Every single arc seems to go like this: SoL shenanigans for 10 mins, an alien is invading Earth or some shit and everything is serious, the only way to stop them is to throw powerlevels at eachother in an over the top fight scene while Mahiro comes along and does nothing except get in the way, it turns out the villian's motivation was really stupid and there wasn't anything to worry about anyway and so everyone goes back home and tries to have sex with Mahiro. There you go, no need to watch it, that's what happens.\\n\\n\r\nPRODUCTION\\n\r\n\tOverall the quality of the animation was decent, as long as no one moved. Most of the action sequences happened when the writer's seemed to be getting bored of a serious plotline, and so, to fit in with the ridiculous situation, the animation was bad. However this didn't seem too bad, because it fits with the series' tone. Kudos to Xebec, the studio that always seems to make sub-par animation seem bareable.\\n\\n\r\n\tOn the other hand, the soundtrack was amazing. With a relatively small number of tracks, all were very well made and fitting to an adaptation of the Cthulu mythos. Also both OPs, entitled 'I want a gay Horse' and 'Sons of Bitches', are some of the catchiest songs ever made.\\n\\n\r\nCONCLUSION\\n\r\n\tOverall I recommend skipping this show. It has it's highlights but is a pretty meh show in general. The story is generic, the story pacing was awful and the entire thing is drenched in references, most of which no one got. I would recommend watching the first OP and first episode, followed by the second OP and then nothing more. Also, as is with most harem anime, nobody wins, which is always annoying. However, if you are really into the whole Cthulu mythos, then ignore this show entirely, except for character names, there are no similarities what so ever.\\n\\n\r\nAlso remember that Xebec made Love Hina and you should watch that because it's good(ish).\\n\\n\r\nMETA\\n\r\nLength- \t2 cours / 24 eps / 9.6 hrs\\n\r\nRelease-\tSpring 2012 & Spring 2013\\n\r\nStudio-\tXebec\\n\r\nSource-\t2009 LN by Manta Aisora / 1928 Novel by HP Lovecraft\\n\r\nAlts-\t\tOVA / 2x Manga / OVA / Game\\n\\n\r\nRATING\\n\r\nWatch?-\t\t\tNo\\n\r\nBest Character-\tNyaruko\\n\r\nWorst Character-\tHasta\\n\r\nBest Feature-\t\tBoth OPs",
            "date": "2015-08-16T06:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 196296,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3979565.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/iklone",
                "username": "iklone"
            },
            "url": "https://myanimelist.net/reviews.php?id=196296"
        },
        {
            "content": "I couldn't watch any more of this if I tried. It's such a slog. Two episodes was all I could manage, and I'm surprised with myself that I didn't stop at the first. Therefore this is a brief review.\r\nTo begin with, the initial concept is great. Nyarlathotep, the crawling chaos, servant of Azathoth, transforms into a little anime girl. Great start. That's why I watched this in the first place. It seems like it would appeal to a fan like me. However, everything went downhill after that. \r\nNow, Nyarlathotep was a unique entity in the Lovecraft mythos. Attempting to create an established race out ofthe shapeshifter is a bold move to say the least. As far as Nyaruko's personality goes, while it is true that Nyarlathotep was a fair bit more sociable and scheming than the other Outer Gods, it was by no means a ditz. From this, and from the depictions of Night-gaunts (they're supposed to be dead silent!) and Shantak-birds.  it was clear that the creator (creators?) only had a surface-level knowledge of Lovecraft. Whether this was due to laziness or availability of the stories is unknown to me.\\n\r\nIt's not like the non-Lovecraft parts are any better. That weak-ass fight (complete with Pokemon reference) was equal parts not funny and boring. The slice-of-life aspect is probably the strongest of them all, but if I wanted good gimmick-less high school anime I have plenty of those to choose from.\\n\r\nI may be a sperg for getting picky about source material and giving this such a low score, but when I hear the phrase \"Lovecraft anime\", I expect a bit more. I'll keep my eyes peeled should anything of similar concept appear in the future.",
            "date": "2015-12-10T10:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 205187,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4775815.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RiftSalad",
                "username": "RiftSalad"
            },
            "url": "https://myanimelist.net/reviews.php?id=205187"
        }
    ],
    [
        {
            "content": "In an age where media is thriving and the economy is stagnating and slowing to a crawl there’s often the question of product quality versus a more cost-effective approach. This holds especially true for the anime industry where the bulk of the paying audience are exploitable and easy to profit from. There's a sizable amount of anime where a certain degree of integrity and quality is held over the potential of large sales numbers  and, conversely, there are shows where quality is disregarded and instead replaced by a number of efficient pandering methods.\r\nUnfortunately, Haiyore Nyaruko-san is one of the latter. \r\nThe anime takes placein a world where deities of the Cthulhu Mythos are secretly wreaking havoc on Earth, often having their horrifying appearance and demeanor replaced by that of a cute teenage girl... or boy. After the titular Nyarlathotep arrives on Earth to save Mahiro from a sudden alien attack, she chooses to stay at his house after deciding that she loves him. This, of course, confuses our dear protagonist and gives precedence to his tsundere behavior. \\n\\n\r\nAs the episodes pass more deities begin to work their way into Mahiro's treasured and so-claimed \"normal life\". The first of which is Cthuko, a twintailed and obsessive bisexual incessantly chasing after Nyaruko and her body much like Nyaruko does with Mahiro. Hastur also makes an appearance, a young boy who looks very much like a girl and frequently causes confusion to Mahiro as a result of that. Other characters include Mahiro's mother, secretely working as a deity hunter, and Ghutatan, another deity in the form of a small girl that joins in on the shenanigans for the final two episodes. \\n\\n\r\nCalling any of these characters interesting would be a gross overstatement. \\n\\n\r\nThese are one-dimensional and stereotypical archetypes that do little except fulfilling the audience's penchant for attractive young girls. Most of the interaction between them revolves around the same repeated jokes and situations, used again and again with not a single care for change. Nyaruko will behave in a forcefully lewd manner towards Mahiro, often involving sudden kisses or talks of marriage, and then he'll become angry and stab her with a fork. Cthuko will go on to do most of the same towards Nyaruko and she'll push him away because of her love towards Mahiro. After seeing this interaction repeated for the nth time it becomes incredibly stale and tiring. It really makes evident that there is nothing going for the characters besides their physical appeal, and Xebec frequently exploits that and uses it as its way to catch an audience.\\n\\n\r\nIn between all the awful character interaction there's an abundance of superfluous otaku references. These include dozens upon dozens of titles such as Back to the Future, Ichigo Mashimaro, Ashita no Joe, Denpa Onna, and Haruhi. Now, references to other anime can be amusing and add to the comedic value when they're implemented well but that's very far from being the case here. There aren't just a few thrown in during each individual episode, but rather dozens of times in each, sometimes flipping from one reference to another in the span of about 15 seconds. There's no transition and little context, they just happen. Repeatedly. What's most shameful isn't necessarily how bad or annoying these references can be, but that Xebec has apparently decided that comedy isn't even relevant as long as you make piles of references towards shows that the audience may have enjoyed. \\n\\n\r\nThere's a point where it becomes funny and then there is a point where it just devolves into frustration and pandering. The occasional anime reference can be quite nice, but in Nyaruko-san it does nothing but infuriate and make watching the series an arduous experience due to their superfluous usage. Haiyore! Nyaruko-san is an anime that has about all the comedic sophistication of Hannah Montana and Meet the Spartans. \\n\\n\r\nFor an anime that is constantly parodying other series and their tropes, it really makes you wonder when the same cliches and issues are present in the show itself. Harem members suddenly \"transfer\" into the same classroom as the protagonist, characters decide to neglect their duties to go on a trip to the beach, the protagonist and main heroine (mistakenly) bodyswap with eachother, and people walk in during inopportune moments and misunderstandings follow as a result. There's a glaring amount of cliches and, sadly, these are mostly important or genuine aspects of the series rather than simple parodies or references. If you're looking for anything unique or original in that regard then you are most definitely not going to find what you want here. \\n\\n\r\nThe only thing to set this series apart from any other bad harem anime is the addition of the Cthulhu Mythos, but even this is mostly made irrelevant by how the story and deities are changed and bastardized from their Lovecraftian counterparts. It's an element that seems unique and interesting at the start of the series but it quickly fades from prominence in favor of fanservice and otaku references. A pretty unfortunate fact considering the rich amount of content and depth found in the Mythos. Much more value than in this anime, anyway. \\n\\n\r\nOddly enough, the series is actually bearable during the rare dramatic moments. When the terrible character dynamic is put aside and Mahiro and Nyaruko think about how much they really like eachother, it can actually be somewhat heartwarming and the characters can almost verge on being likable. It's just unfortunate that these moments can't even be counted with a full hand. \\n\\n\r\nAnother minor positive can be attributed to the art. While the budget is modest and the animation quality is passable at best, the vibrant art style and color palette makes the show a lot more pleasing to look at than most. It's refreshing to see something that actually contains color when the majority of anime instead rely on dull hues of grey, brown, or blue. That said, you can polish a piece of trash, but it will always remain nothing more than trash. \\n\\n\r\nIt's hard to determine just where this series went wrong. Perhaps the concept of the series was already flawed and doomed to failure, but a large amount of the blame can be shifted towards the studio and their insistence on pandering over quality. For people that are simply looking for a show that they can watch while turning their brains off, this is a poor but not quite terrible choice. For the people who want something more in their entertainment that extends beyond aimless fanservice and otaku exploitation, Haiyore Nyaruko-san is an insulting series with any inherent value or amusing moments being next to nil.\\n\\n\r\nSomehow I think Cthulhu monsters might be less frightening than Haiyore Nyaruko-san.",
            "date": "2012-06-29T18:38:00+00:00",
            "helpful_count": 499,
            "mal_id": 64805,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39613.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Veronin",
                "username": "Veronin"
            },
            "url": "https://myanimelist.net/reviews.php?id=64805"
        },
        {
            "content": "Before you instantly downvote this Review for not being a 10, 9 or 8; I'd like to remind you that a 7 should be considered a \"Good\" RATING.  Anything above a 5 should be considered \"good\". MAL reviews are broken, but I'm at least trying to fix mine. Please take the time to read it all. \r\nHere's a quick TL;DR rundown of Haiyore! Nyaruko-san\r\n1- You've probably seen it before. There's nothing special about this Anime. The story is just a sequence of events thrown together so as to fit as many gags as possible in, the characters are recycled, the gags are overused. Ifyou're looking for plot, or great comedy, you won't find it in Nyaruko.\\n\\n\r\n2- The Anime is character based. As with all Anime targeted towards an Otaku audience aiming to be as marketable as possible, Nyaruko's strength is with it's characters. They're memorable, they're funny and they each have their own distinct trope. Some people maybe see this as a bad thing, and in a sense it is, but for what Nyaruko is aiming for, it's succeeded in making the characters as fun as possible.\\n\\n\r\n3- Because it's a character-driven anime, the art and character designs are great. Who cares about plot when you have these beautiful pictures to look at? Or so they want us to think. It's not that bad though. They designs are clear-cut, distinct and present the constant moe and service very well.\\n\\n\r\n4- The music is good. Catchy OP; better ED. All's nice and well. Of course, they're just OPs you've heard a million and ten times before in other Anime, and Nyaruko doesn't even try to be original. It knows it doesn't need to be.\\n\\n\r\n5- It's a light hearted watch. As I've said on countless other Anime, don't take it too seriously. No; it's not GREAT, it's not groundbreaking and it certainly won't appeal to everyone. But if you want something light-hearted and fun, and you enjoy squealing at moe characters and laughing at over the top gags, then you'll probably enjoy this.",
            "date": "2012-05-09T07:26:00+00:00",
            "helpful_count": 490,
            "mal_id": 60885,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/660485.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scruff",
                "username": "Scruff"
            },
            "url": "https://myanimelist.net/reviews.php?id=60885"
        },
        {
            "content": "I really don't get why this anime gets so many bad reviews. Actually, I do. \r\nHaiyore! Nyaruko-san is the epitome of a plot-less anime, with the absence of \"true\" romance, conflicts, or any character goals. This makes Nyaruko-san very polar; you either love this kind of random comedy, or hate it. And I happen to love it. It is such a relaxing, fun anime to watch, something you can enjoy without having to focus too hard on picking up the details.\r\nThe core of the anime is based around light parody comedy, while throwing in a TON of references. This anime has so many references tovideo games, TV shows, anime, etc. that you won't catch them all. And of course, it's very enjoyable  when you do understand one. All of the characters are very likable, allowing viewers to easily become attached to them. \\n\\n\r\nThis anime never takes itself seriously, and you shouldn't either. It has no problem creating plot holes, turning a tense situation into a joke, or breaking the fourth wall. By definition, Nyaruko-san does everything that would make an anime bad; but because it does it purposely, and pulls it off so well while giving you a great laugh, you can't help but enjoy it.\\n\\n\r\nA mix of To-Love Ru's supernatural & Lucky Star's comedy, Haiyore! Nyaruko-san does everything that caters to fans of those anime, while still presenting refreshing ideas. A high recommendation for fans of those genres.",
            "date": "2013-08-06T17:54:00+00:00",
            "helpful_count": 226,
            "mal_id": 108557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2981555.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kyuutoryuu",
                "username": "Kyuutoryuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=108557"
        },
        {
            "content": "The most unexpected anime series airing in this 2012 spring season I would say would have to be Haiyore! Nyaruko-san. It can be categorized as both Parody and Comedy at the same time and shows great promise as it is a series that does not take itself seriously and is unafraid to show itself as such. If it's able to keep up the level of quality, this series has a good chance of becoming the best comedy series of this year.\r\nIn H.P. Lovecraft's stories, the Cthulhu was an unspeakable, indescribable horror that haunted the collective dreams of mankind. In Nyaruko-san, the Cthulhu is a cutegirl sent from the stars to protect a typical normal guy.\\n\\n\r\nMahiro Yasaka is a normal high school guy until he finds himself pursued by a monster one night, only to be saved by a cute girl bloodily slaughtering the monster with her bare hands and then jauntily declaring, “I am the chaos that always creeps up to you with a smile, Nyarlothotep!”, Nyaruko for short, while striking a sentai hero-type pose.\\n\\n\r\nShe was sent there to protect Mahiro and it's revealed that she practically begged for the assignment, partly so that she can get her hands on some Earth entertainment (anime and manga apparently being highly-valued throughout the universe) and partly so that she can cozy up to Mahiro, much to his dismay.\\n\\n\r\nHowever Mahiro isn't completely dominated by Nyaruko, but tries, in his own ways, to fight back the stranger who \"destroyed\" his peaceful life. At this point that usually involves him wielding and trying to skewer Nyaruko with a table fork.\\n\\n\r\nNyaruko, despite being in some respects the stereotypical hyper-aggressive girl, is such an abjectly ridiculous character, and is played with such unrelenting enthusiasm, that it's difficult to watch the episode without a constant bemused smirk on one's face. Nyaruko is way too perky for a creature of a well-known horror mythology and generally a lot of fun to watch. She's always moving and switches conversational modes at the drop of a hat. It helps that she looks nice as well. She also has a proportionate body without either inflate-a-boobs or a little girl figure.\\n\\n\r\nThe first episode enjoys small recognizable moments, with Nyaruko's back story fast-forwarded (complete with squeaky VHS sounds), comments about how the show will get taken off the air if the characters aren't careful, and a slew of images in a store that have a very familiar look to them. Add in some sentai jokes and a Pokémon reference and you get a parody element that helps to make this more entertaining than it might appear at first glance.\\n\\n\r\nThat said, within its hyperactive romance-comedy framework, the series works really well. Nyaruko is amusingly nuts and the jokes about her Lovecraftian origin are entertaining. She's only in cute girl form because her real form would cost Mahiro a lot of \"sanity points\" and her horrific origins are hilariously apparent in her sickening fighting style (brutal beat downs using rocks to crowbars). She's also refreshingly open about her feelings for Mahiro which reminds me so much of Lala from To LOVE-Ru.\\n\\n\r\nThe animation isn't perfect, but there's enough flow that it's easy to watch and the music has a definite sense that it could grow on you.\\n\\n\r\nThis looks to be a series that will have me groaning at the end of each episode, disappointed that I need to wait for the next episode.",
            "date": "2012-04-10T21:24:00+00:00",
            "helpful_count": 90,
            "mal_id": 58515,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/456379.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tenko_Ranchi",
                "username": "Tenko_Ranchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=58515"
        },
        {
            "content": "Comedy...it is very subjective, whether or not you consider a show to be funny or not simply depends on you, I think that mindset sums up Haiyore! Nyaruko-san perfectly.\r\nThis show is about a young high school boy (I know, I know) named Mahiro Yasaka, he lives an ordinary life until one day he is attacked by a demon and saved by a young alien girl by the name of Nyarlko. Afterwards she confesses her love for him and well we get a stereotypical \"hijinks ensues\" plot for the rest of the show. The main focus is Mahiro fending off Nyarlko's constant advances (which as kindof refreshing, it's usually the other way around) We get introduced to a few entertaining characters, Cthuko, a alien girl who is in love with Nyarlko and constantly tried to keep her apart from Mahiro, even threatening to burn him into ash at one point. Hastur, a trap who is in love with Mahiro and constantly vies for his affection.\\n\\n\r\nThe art and sound aren't necessarily bad, but they're not anything you'd remember all that much, doubt any of you are on the edge of your seats for the Nyarlko Original Soundtrack, one thing I will say is the opening is stupidly good, check it out on youtube if you have a chance, amazingly addictive.\\n\\n\r\nThe characters are the main selling point of the show, the interactions between all of the different characters and the situations they find themselves in are just priceless, but as I said before, this is purely subjective.\\n\\n\r\nEnjoyment is either very high or very low depending on whether you fall into the niche of this particular show. It's moe, It's ecchi, it's comedy, and it's satire, if these don't appeal to you then you simply will not like this show.\\n\\n\r\nOverall I give this show an 8 out of 10. It's a hilarious show with a nice cast of characters that interact with each other in hilarious ways, it might not be for you, the plot might put you off, but give it the old 3 episode rule and you might find another show to add to your list!",
            "date": "2012-06-28T23:16:00+00:00",
            "helpful_count": 32,
            "mal_id": 64711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309278.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Vylash",
                "username": "Vylash"
            },
            "url": "https://myanimelist.net/reviews.php?id=64711"
        },
        {
            "content": "I was deeply saddened that I had literally nothing to watch. All the good series that people recommend or consider amazing have been seen by me over these past 2-3 years. There's a bunch of good anime this season but that's once a week so when I saw this series I decided to give it a shot.\r\nStory: The story revolves around a young boy who is being targeted by monsters in order to become a slave to be traded by an intergalaxy agency of criminals. Special \"enforcers\" are sent out to Earth in order to prevent the criminals from having their way. Other main heroineis the Cthulhu(spelling?) deity who has taken the form of a young girl and is assigned to our male protagonist. This show is HILARIOUS, and the fact that there's some love-crushing introduced in the first episode really bumped this show up a lot for me. I didn't see a \"romance\" tag on it so at first I was a bit iffy.\\n\\n\r\nArt: The artwork is really nice. It's similar to Sora No Otoshimono which the style of artwork I like.\\n\\n\r\nSound: Hmm I only watched the OP for maybe 10 sec. It seemed upbeat and spunky which is nice. Didn't really pull me in like certain other OP (Angel beats for instance)\\n\\n\r\nCharacters: The characters are nice. Our male protagonist doesn't act like the typical male that doesn't show any romantic emotions towards the females who are attracted to him (he at least thought she was cute and blushed, etc). \\n\\n\r\nAll in all it seems like this is a cute like comedy show with a hint of romance here and there. I hope the romance becomes a little bit more heavy. But as of now this show is GREAT.\\n\\n\r\nI highly recommend it.",
            "date": "2012-04-15T12:55:00+00:00",
            "helpful_count": 18,
            "mal_id": 58883,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/474763.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SevenKnights",
                "username": "SevenKnights"
            },
            "url": "https://myanimelist.net/reviews.php?id=58883"
        },
        {
            "content": "I have only seen two episodes so far, but I decided to drop it, you can see where this anime is going. A romance between the two main characters and some fights to save the world.\r\nWhy did I drop it? I don't know it myself exactly, but the whole anime feels like a dejavu. If I am watching an Anime with a plot like this, which is your average boy meets girl and save the world plot, I expect a nice execution  and outstanding characters, but it fails in those aspects. This show's main characters are two kids who play kiddy love, the mainprotagonist is a bossy guy who has some aggression-issues and a girl who wont stop to talk nonsense......This show has no comedy, the battles are boring and the protagonist lack deepth.\\n\\n\r\nThe art is decent and the music as well. I think some people might like  this show, but if you are looking for something special , then don't watch this anime, you will find better anime than this.",
            "date": "2012-05-09T06:10:00+00:00",
            "helpful_count": 17,
            "mal_id": 60883,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/38887.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hellwyr",
                "username": "hellwyr"
            },
            "url": "https://myanimelist.net/reviews.php?id=60883"
        },
        {
            "content": "This will is more sort of a warning than it is a review.\r\nThe anime itself has nothing original to itself. There is no plot or I just forgot it. The anime itself does not even care.\r\nThis is a comedy anime, I know, but the comedy aspect could be better. It is FULL of references and nothing out of their own creation. Even tho I know for sure I could not catch about 80% of the references, you can just tell they just didnt do it themselves. I just think it is too much of  a multi-parody, and it never stops.\r\nI'm sorry if you thinkthis is not helpful or that I just straight up hate on the anime. I don't hate on comedies, specially if they make me laugh. But this was too much greed. \"Easy money\".",
            "date": "2014-08-31T11:01:00+00:00",
            "helpful_count": 16,
            "mal_id": 158639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3685101.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/DolbyThX",
                "username": "DolbyThX"
            },
            "url": "https://myanimelist.net/reviews.php?id=158639"
        },
        {
            "content": "Quick and dirty review time!\r\nReally, they tote this as a Cthulhu Mythos based anime, but the only connection to the mythos I know is a couple names of ancient psychic outer god alien beings slapped onto teenager characters who are some kind of space cop aliens living on earth, thats about it. Beyond that, a handful of references and a couple gags relating to the dice and paper RPG are all that tie this into the mythos at all. It's funny, kind of twisted, but overall nothing special, yet another cute romantic comedy with a harem theme based around a normal everyday teenage boy whois pulled into a fantastic situation that results in him being involved with cute girls that all end up part of his daily life in some way for the rest of the show. Also, like most harem anime, he is some kind of super being with a freakish level of willpower, just like the main character of every damn harem anime, because he refuses to give into his desires and have any kind of intimate contact with any of the multiple very attractive women literally climbing naked into his bed at every opportunity. I swear Japan has the weirdest ideas about teenage boys and the kind of restraint they are capable of. Inhuman. These kids could put Buddhist monks to shame.\\n\r\nBut yah, the jokes here are a little more to my liking than most being somewhat more \"edgy\" than your average fan service driven romantic comedy. It's one of the first to have a very well integrated gay theme on the harem side of things that gets actual consideration rather than just being a joke character thats immediately shot, beaten, or thrown out the moment they show up and make a pass at the male lead. This one gets some cute awkward \"what if\" moments and generally gets as much care and attention from the main character as the female options. Overall, worth watching I would say.",
            "date": "2012-08-19T17:26:00+00:00",
            "helpful_count": 14,
            "mal_id": 70325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/69324.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gorbash",
                "username": "Gorbash"
            },
            "url": "https://myanimelist.net/reviews.php?id=70325"
        },
        {
            "content": "I really Like the anime Haiyore Nyaruko-San because its shows the beings\r\nFrom Different World can Get along with Each Other and Becomes Friends \r\nAs well, I Love the part where they Show the characters Being Interested in\r\nGames,Anime,Novels, and Showing Akihabara-being the Center of Anime\r\nGoods and Stuff\r\nthe anime Have Really Nice Design For each character",
            "date": "2012-07-29T18:02:00+00:00",
            "helpful_count": 11,
            "mal_id": 68081,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/439315.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/WhiteQueenKurumi",
                "username": "WhiteQueenKurumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=68081"
        },
        {
            "content": "After reading many of these reviews, or quickly scanning them, I realized there really wasn't a middle ground - you either loved it or hated it. And it seems to me most people wanted to hate something like this. But maybe both sides are missing the point: after all, for the people who want to bury this in the ground: lower your sophisticated and urbane shields for a second and try to understand WHY this anime wasn't deep or anything. And for the people who think this is flawless, it isn't. But perhaps I should make a stand here and try to look at BOTHsides of the issue.\\n\\n\r\nStory: 6/10\\n\\n\r\nAlright, so the story was complete trash. But that's because it's a PARADY of a serious anime; after all, every huge fight and build up turned into something comedic. But that was the point. This wasn't supposed to be some deep, symbolic story where you'll fall to your knees, begging God or Zeus for forgiveness; no, it was supposed to be funny, to blow it off as if nothing. But that doesn't mean it was good, either. It was annoying, really, to have such intergalactic conflicts blown off as trivial. I mean honestly, give me one good villain! Perhaps the story arc, bland and straight as an arrow, could have been reworked to include elements to give the story, well, a story to follow and hold on to. But for whatever reason they didn't. Eh.\\n\\n\r\nArt: 8/10\\n\\n\r\nObviously, this is where the production costs went. The artwork was flawless. Almost. The environments were kinda....bland. There were certain times, when the story LOOKED like it was going somewhere, when the artwork excelled - but most of the time, it was flat and, well, nothing special. But the characters were drawn nice, and everything seemed cutsey and too good to be true kind of drawings. The aliens and monsters were nicely drawn as well, but once again, nothing special. So, I'll give it a decent score.\\n\\n\r\nSound: 8/10\\n\\n\r\nI'm not going to berate the sound either. It was actually quite good. The theme song was typical of comedic animes, catchy and, well, funny. The background music at critical times wasn't the typical orchestra, but opera-sounding voices, which was a nice deviation from the typical drum rolling and whatnot. But here, everything seemed to be in order. So, this deserves a decent score as well.\\n\\n\r\nCharacter: 6/10\\n\\n\r\nThey really shouldn't have messed this up. I would have forgiven the studio for the lack of storyline, but you can't have static, stereotypical, almost perfectly archetypal characters that bore the audience. I mean come on, have SOME character change in some way. And really. Take out these lovey-dovey characterizations of Nyaruko and Ctchuko. I was intrigued, though, when these Greek references to gods and stuff were first introduced; but Hasta don't act like no God of Wind all the time. Sigh. And a tsundere as a main character: where haven't I seen THAT before? It wasn't awful, though, because there was SOME development, albeit almost nonexistant. But it wasn't there.\\n\\n\r\nOverall: 7/10\\n\\n\r\nOk, it wasn't horrible, but it wasn't stellar, either. Where does that put us? Somewhere in the middle. It was entertaining, but not particularly engaging either. The rewatch value would be extremely low and I would not recommend this to other people when asked to name a few anime, but that doesn't mean to completely skip it, either. It was entertaining, and funny. But I cringed several times where I shouldn't have, and certain points....well, I'll stop there. Don't completely discount this anime, though, because of the reviews, nor go into it with a heart of gold - keep a cautious distance, but don't be shy in embracing what this anime has to offer. Oh, and Merry Christmas!",
            "date": "2012-12-24T21:03:00+00:00",
            "helpful_count": 10,
            "mal_id": 81236,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/726905.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Ibelucas",
                "username": "Ibelucas"
            },
            "url": "https://myanimelist.net/reviews.php?id=81236"
        },
        {
            "content": "Anime Review: \u2028Haiyore! Nyaruko-San!\u2028\r\nBy Bobjonez98\r\nStory: 6/10- \r\nThis is a tough one, the longest arc lasts maybe 3 episodes and the rest are either 1 or 2 episodes long. But the shorter arcs are actually the more entertaining ones. The story revolves around Nyaruko, who has come to earth to protect Mahiro from the evil deities of the Cthulu Mythos, hilarity ensues as anime is the only world where a Cthulu can become a bespectacled, green-haired cute anime girl.\r\nCharacters: 8/10-\u2028\r\nNyaruko is spunky, jumpy, head-over-heels in love, and that special breed of adorable/annoying. Some of her antics make her a little difficult to swallow, but she's stillquite likable. Kuuko, the quiet, lustful redhead and Hastur, the girlish young wind boy add a few unconventional relationship paradigms. Overall, the characters are likeable enough, they make for good, over-the-top comedy, and interesting interactions.\\n\\n\r\nAnimation: 8/10-\u2028\\n\r\nWith lots of fight sequences, energetic character jumps and motions, there are a lot of opportunities for the animation quality to shine. It's a tad dark at times, but never for very long. The depictions of most of the Cthulu deities are faithful, except for the ones that have been made into cute girls and boys.\\n\\n\r\nOp/Ed: 7/10|6/10-\u2028\\n\r\nThe opening to me at least sounds like a late 80's American cartoon mystery show. It makes an attempt to be catchy and upbeat, but the choices in key and beat make it hard to sound bouncy and upbeat. Overall though, it's still pretty good. The ending is unremarkable, the accompanying animation is good, but it seems to be your standard harem series ending affair.\\n\\n\r\nMusic: 7/10-\u2028\\n\r\nFor Monaca, this seems a bit sub par. Monaca usually has the magic to work a few memorable tunes into my head, but I honestly can't give you any. The battle music serves merely as a background, and the airy conversational tunes seem to disappear into the sky. They're there, and they provide good ambiance, but they're just not memorable like they are in Working!! or the Monogatari Series.\\n\\n\r\nOverall: 6/10-\u2028\\n\r\nThis is a very difficult series to give an overall score to. It doesn't meet my criteria for a 7, and it suffers from the same flaws as most of the series I have given 6s to. It has an uncanny quality to make you want to keep watching, just to see what happens next, but it isn't as substantial a series as I would like. I feel like I should probably mention the anime references. Throughout the course of the series, in several scenes, nods are given to a MULTITUDE of other series/games/ pop culture phenomena. To name a few: Pokemon, Final Fantasy, Left 4 Dead, The World God Only Knows, Haruhi, Denpa Onna to Seishun Otoko, Back to the Future, Digimon, Working, Umi no Misaki, Please Teacher, One Piece, Bleach, Naruro, Dragon Ball Z, any magical girl series, Star Wars, And Code Geass. If anything, this series is just a quick fun watch that you can play \"name that reference\" with.\\n",
            "date": "2013-03-25T22:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 90931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1937926.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bobjonez98",
                "username": "Bobjonez98"
            },
            "url": "https://myanimelist.net/reviews.php?id=90931"
        },
        {
            "content": "Mythology. Something that you don’t see everyday in anime. But I came across it in so many places, hence I would give it a try. Well, before I watched the anime, I always replayed its opening song because it was awesome.\r\nThe anime, produced by XEBEC, starts with the meeting between Mahiro, a normal high school boy, and Nyaruko, a Nyarlathotepian (or alien). She was sent into Earth by an organisation to protect Mahiro from aliens that lurked in this planet. As it progresses, more characters are introduced, be it with the pair or against them.\r\nThe story has some funny moments. You ain’t looking at anordinary heroine, but a crazy one. The one who obsess with anime and manga, not as someone who is serious to follow commands. That makes the anime good, in the sense of comedy. Fan-service is spread in these twelve episodes and they are not very excessive.\\n\\n\r\nWith mythology as a theme to the story, there isn't really much talk about myths. Don’t expect a lengthy explanation about each creatures, otherwise go to Wikipedia and do your own research.\\n\\n\r\nThere are quite a number of battles, meaning good potential action. I would say that most of them are interesting. The rest fell short for its repetition. Even after a few episodes, the story’s quality started to decline for its low action but again peaked again after a while.\\n\\n\r\nThere are a lot of references, mostly coming from anime and manga. I managed to pick a few but I didn’t care much. There is some romance too, which isn’t fully developed. Think of it as one-way. I actually think there’s a harem Mahiro has. hehe…\\n\\n\r\nSometimes, drama can seep in, especially the last episode. But usually it can be broken off into comedy, which I am not happy about. Therefore, if you are looking for a serious story, I’m afraid this anime is not for you. I guess it is good for chuckles only.\\n\\n\r\nThe characters aren’t very special. Mahiro is someone who doesn’t like a particular person and tries to avoid that person. Nyaruko is someone who wants to be attached to another particular person. This cat-and-mouse relationship has really never changed throughout the story, but there is some development in both characters.\\n\\n\r\nTheir other friends are Kuuko, who loves Nyaruko a lot by some weird reason, Hasuta, who looks like a girl but is really a boy, and Kurei, who is the gossiper of their class. Not much character development is seen in these three, but they are adapted to what has been going in.\\n\\n\r\nThe art is nice. I find the opening and ending animations very cute. The scenery is good-looking, especially on places where aliens frequent on Earth, as it gives a different look outside the human world. The character designs are well-down and facial expressions can be both cute and nice. I like how the scenes change as a battle is about to start. The action animation is great.\\n\\n\r\nI really can’t stop listening to the opening song the moment I started playing it. It has some nice beats to get your body moving. It sounds like you want to dance. Meanwhile, the ending song has a different approach, and it really bored the heck out of me, honestly. The background music is nice and the voice acting is great. There are certain voice actors recognisable from their other characters, like Nyaruko, who is voiced by Kana, who voices Hinata and Komari.\\n\\n\r\nIn the end, I enjoyed it for a while, until the part where there’s little action. I wished it could have gotten better, and if I were to remove these anime and manga references, and change Nyaruko’s personality, I think the anime can be more interesting. I will still watch the second season and see how it goes.\\n\\n\r\nDon’t take this anime too seriously. Watch it and laugh.\\n\\n\r\n(And I don't see any bad reviews at all. About two reviews received a rating of 3 and I totally respect their decision.)",
            "date": "2014-09-11T10:39:00+00:00",
            "helpful_count": 9,
            "mal_id": 159919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440083.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SkyNoHoshi",
                "username": "SkyNoHoshi"
            },
            "url": "https://myanimelist.net/reviews.php?id=159919"
        },
        {
            "content": "I liked this as a fun non serious show to watch with a fun cast of characters.\r\nIf you go into this trying to take it serious you will probably have a bad time tbh. This show likes to take the piss out of the common Harem and crappy high school story genre. \r\nA show that is similar in terms of how the show treats itself is Renai Boukun. While i did actually like that show compared to others opinion of it. This is probably a better show in terms of how it handles itself. With Renai Boukun it could seem unfocused or lost in whereit's going. This on the other hand knows what it wants to do it seems. \\n\\n\r\nOnly real complaints are four and you could say that they are just personal opinion so they don't really matter in a actual review.\\n\\n\r\n1. The Harem. While i know that it's a harem story to make fun of them. It doesn't change my opinion that harems are annoying and can ruin stories. Parodies no exception.\\n\\n\r\n2. The MC could be pretty annoying at times like most shows of this genre. I kind of want to hope the creators purposely made him like that to mimic others shows with crappy MC's but i doubt it. \\n\\n\r\n3. I feel that if the story was focused around Nyaruko as the MC and not the boy in this that it may have been a better story. I really like the relationship between Nyaruko and Cthuko and they're also my shipped couple of the series. \\n\\n\r\n4. The weird trap ... Nough said \\n\\n\r\nWhile those are my complaints there are things that i did really like. Such as how they don't just focus on one bad guy all through out the series. Most bad guys will only last 1 or 2 episodes. Having long story archs in things like a parody show can be annoying. \\n\\n\r\nTwo episodes i really liked that were back to back were when the MC and Nyaruko switched bodies. I don't know why but i just felt that the two of them are better suited in each others bodies ( Yes i know how wrong that sounds) With how this story is i wouldn't be surprised if it ended the season with the two of them still not in their own bodies. The personalities really just fit well in the other character. Especially the MC in Nyaruko's body.\\n\\n\r\nOverall a really fun story to just have some good laughs. \\n",
            "date": "2017-11-10T07:19:00+00:00",
            "helpful_count": 4,
            "mal_id": 262929,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=262929"
        },
        {
            "content": "Uu~! Nyaa~! Uu~! Nyaa~! Uu~! Nyaa~! (dun-dun-da-dunn) Let's Nyaa~!\r\nEr-herm....First off I just want emphasize that the nature of the show makes reviewing it difficult. Enjoyment of it is highly subjective to the viewer so please take that into account. \r\nHaiyore! Nyaruko-san is a comedic parody on a rampage. It's essentially the epitome of mindless entertainment with consistent gags, references, and over-used humor. It has a very clear audience: people with significant history and interest in anime. Outside of this group, the quality of show will likely be lost. With humor also being a subjective quality, appreciation (or lack thereof) of Haiyore varies from person toperson, so it's not for everyone. This is a show geared towards those with more extensive histories in anime due to the sheer volume of references crammed into each episode. Personally, I don't have that great a history and many of these blew right past me. That said, almost everything is constructed from parody, meaning that aside from the characters themselves and the basic plot line, there is almost no original content within Haiyore. You could even go as far to saying figuring out all of the references in each episode is a game since there are so many. I believe there are several dozen in the first episode alone.\\n\\n\r\nWhat little story there is comes from the Cthulhu Mythos written by H. P. Lovecraft. The various events that take place loosely stem from the various deities portrayed within the Mythos. I have not read these stories so I cannot comment on how connected they really are, however. Little focus is placed on the story but it serves as possibly the only thing to keep the events from rocketing off into deep space.\\n\\n\r\nThe characters are what makes the show entertaining. Despite a lack of significant development, each have defined personalities which promote the wacky humor present in Haiyore. The story's hero, Mahiro Yasaka, appears to be an ordinary school boy but is thrown into a chaotic situation. Forcibly placing herself beside him is the extremely energetic and upbeat Nyarlathotep (\"Nyaruko\"). She one of the many \"Great Ones\" from the Mythos sent to protect Mahiro, though there are ulterior motives behind her appearance. Think of the two of them as a parody on the generic romance genre relationships, but with insanity thrown in. To top of the trio of main characters is Cthuko (\"Kuuko Cthugha\"). Sworn enemy of Nyaruko by virtue of their heritage, she is beyond smitten with her, much to Nyaruko's displeasure. Though these characters don't develop much, they are enjoyable by virtue of their various antics.\\n\\n\r\nWith little focus on the development of story and characters, the artwork and audio received more attention. The artwork is appealing and smooth throughout, with scenery covering a vast range of areas. I wont say where though, that would spoil some of the fun. Each of the main characters has a defining design, well except for Mahiro since he's just an ordinary boy. With aliens present, expect some funky looking characters scattered about, but they're nothing displeasing. I enjoyed how they designed each character and animated them. The audio keeps pace with the non-serious nature of the show, though remains appropriate for each situation. I greatly enjoyed the opening song as well, if you can't tell with the start of this review. I have no qualms with the visual/audio aspects. \\n\\n\r\nIf you're looking for a one word summation of Haiyore, it would have to be chaos. Chaotic turns are everywhere. Haiyore is meant to be watched with your brain turned off. It's nothing amazing and enjoyment ranges dramatically from person-to-person. If you're someone who enjoys gag-related humor, parodies of shows you've previously watched, and nonsensical progression, you fit right into the niche of Haiyore. If you fall outside this niche, I would be hesitant to watch it as you'll likely miss where the entertainment value is coming from.\\n\\n\r\nThanks for reading my review of Haiyore!, Nyaruko-san. Remember that the helpful and not helpful buttons are not agree/disagree buttons. If you disagree with my views feel free to message me and discuss. Also, if you did not find my review helpful, please let me know what I can improve upon to make future reviews more useful. Thanks again!",
            "date": "2013-06-24T13:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 102235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2408739.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MentalSyndrome",
                "username": "MentalSyndrome"
            },
            "url": "https://myanimelist.net/reviews.php?id=102235"
        },
        {
            "content": "Beautiful! FUN! Totally satisfying.\r\nThis anime has almost no plot, except the main female wants to get into the MC's pants.....simple eh? Once you watch the anime you will understand, why this may be problematic and begin to enjoy it to it's fullest.\r\nThe main female voice acting is just superb, and is the main reason you will watch this show. Sure it is quirky, at times stupid, but in the end it is just pure entertainment and fun. I am not going to go into all the details but simply to say, if you need a smile (especially if you finished watching something like Clannad AfterStory), then this is the anime for you.",
            "date": "2015-06-27T16:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 191494,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4674297.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Elandrial",
                "username": "Elandrial"
            },
            "url": "https://myanimelist.net/reviews.php?id=191494"
        },
        {
            "content": "This is a review from a person who has not seen the rest of the Haiyore! series.\r\nI've noticed other reviews with reference to them, and since I have yet to see them, I'm just going to do a Raw Review. Anyway, you don't really have to have watched the others to understand this.\r\nInitially, Haiyore! Nyaruko-san is about an alien (later to develop into a group of aliens) disguising herself(themselves) as humans to protect earth. Although this may make it seem to be an anime based on the supernatural and alien-like, it's not.\r\nHayore! Nyaruko-san is more focused on the daily life of our male protagonist whiletrying to adapt to his unwanted distractions. Hayore!'s plot-line is very Harem-like, as there are three characters that share a (weird) relationship with our main man. (They share a house too!) Although you can't really call it much of a Harem. (you'll see once you watch at least half of it..)\\n\\n\r\nThe plot though is very loosely tied. It does'nt really have much of a story-line. So it's not really a serious anime. There will be times when you may get tired of watching it too. The anime is focused more on Comedy, so expect a lot of that.\\n\\n\r\nThe art is more on the \"moe\" side, so expect a lot of \"Kawaii!!!\" moments. It also offers a colorful background and a very nice array of colors through the different worlds. Although most of the times, the story takes the seriousness out of the area and just adds more comedy.\\n\\n\r\nAll in all, Hayore! Hyaruko-san is definitely a must-watch to those who want a comedic, lighthearted anime which doesn't need much brain power to comprehend... Except maybe the Space CQC thing, which totally takes away the \"close quarters\" in \"close quarter combat\"\\n",
            "date": "2012-06-16T02:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 63535,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1342693.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kuro_kuro",
                "username": "kuro_kuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=63535"
        },
        {
            "content": "This will be my first true review of any series and I promise not to hold any punches!\r\nWhen I started watching this series I had very high hopes for it.  There seemed to be a lot of great possibilities they could have brought into play.  Ancient deity, actually an alien, many different aliens, etc...\r\nThat they ended up following the path they did was bewildering to say the least.  I was seriously disappointed in the lack of building up of the main character Mahiro.  So little is known about this character by the end of the series - he had great potentialand it was never explored.\\n\\n\r\nWhat I thought was fantastic about this series is the voice acting of Nyaruko!  What a breath of fresh air to have a female lead who is so over the top and so much fun!  Her acting alone has made me give this series a higher score than it really deserved.\\n\\n\r\nAll in all - it's fun - there's a few laughs here and there (more during the 1st 1/2 of the series) - but you'll forget the story line mere hours after finishing the series.",
            "date": "2013-01-29T14:34:00+00:00",
            "helpful_count": 7,
            "mal_id": 85279,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1112169.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/thumpz99",
                "username": "thumpz99"
            },
            "url": "https://myanimelist.net/reviews.php?id=85279"
        },
        {
            "content": "This review contains coarse language and awful humour.\r\nThis review is for both Haiyore! Nyaruko-san and Haiyore! Nyaruko-san W\r\nSTORY\r\n\tHaiyore! Nyaruko-san is a take on the Lovecraftian myths mixed with your usual ecchi harem setting. The outcome is strange, to say the least.\r\n\tThe protaganist is Mahiro Yasaka a cardboard-cutout, self-inserting relationship oblivious high school boy who stumbles into a world of magical crap. Sound familiar? It is. The real personalities of the show are the three side characters, all based off of Cthulu mythos malign deities.\r\n\tNyaruko is the personification of the outer god Nyarlathotep. She comes to Earth on a mission to save Mahiro, and subsequently fallsin love wit him. She also has one of the longest ahoge I have ever seen.\\n\r\n\tSecondly is Cthuko, the red headed Cthughan who is love with Nyaruko for whatever reason, however eventually she understands the point of a harem and starts going after Mahiro too.\\n\r\n\tFinally is the god of wind, Hastur, who's chosen form is an adrogenous boy with hair that looks like a beetle. He is also officially classed as a whiny shit. He looks up to Mahiro for tripping him up or something. Literally no one likes him, not even his own family.\\n\r\n\tThere are also quite a few side characters ranging from Mahiro's Mum who turns out to be a monster hunter, a shit 'childhood friend' trope character and a space bat that can turn into a 10 year old girl.\\n\\n\r\n\tMost episodes are isolated , with the staus quoue being reestablished at the end of each episode. Every single arc seems to go like this: SoL shenanigans for 10 mins, an alien is invading Earth or some shit and everything is serious, the only way to stop them is to throw powerlevels at eachother in an over the top fight scene while Mahiro comes along and does nothing except get in the way, it turns out the villian's motivation was really stupid and there wasn't anything to worry about anyway and so everyone goes back home and tries to have sex with Mahiro. There you go, no need to watch it, that's what happens.\\n\\n\r\nPRODUCTION\\n\r\n\tOverall the quality of the animation was decent, as long as no one moved. Most of the action sequences happened when the writer's seemed to be getting bored of a serious plotline, and so, to fit in with the ridiculous situation, the animation was bad. However this didn't seem too bad, because it fits with the series' tone. Kudos to Xebec, the studio that always seems to make sub-par animation seem bareable.\\n\\n\r\n\tOn the other hand, the soundtrack was amazing. With a relatively small number of tracks, all were very well made and fitting to an adaptation of the Cthulu mythos. Also both OPs, entitled 'I want a gay Horse' and 'Sons of Bitches', are some of the catchiest songs ever made.\\n\\n\r\nCONCLUSION\\n\r\n\tOverall I recommend skipping this show. It has it's highlights but is a pretty meh show in general. The story is generic, the story pacing was awful and the entire thing is drenched in references, most of which no one got. I would recommend watching the first OP and first episode, followed by the second OP and then nothing more. Also, as is with most harem anime, nobody wins, which is always annoying. However, if you are really into the whole Cthulu mythos, then ignore this show entirely, except for character names, there are no similarities what so ever.\\n\\n\r\nAlso remember that Xebec made Love Hina and you should watch that because it's good(ish).\\n\\n\r\nMETA\\n\r\nLength- \t2 cours / 24 eps / 9.6 hrs\\n\r\nRelease-\tSpring 2012 & Spring 2013\\n\r\nStudio-\tXebec\\n\r\nSource-\t2009 LN by Manta Aisora / 1928 Novel by HP Lovecraft\\n\r\nAlts-\t\tOVA / 2x Manga / OVA / Game\\n\\n\r\nRATING\\n\r\nWatch?-\t\t\tNo\\n\r\nBest Character-\tNyaruko\\n\r\nWorst Character-\tHasta\\n\r\nBest Feature-\t\tBoth OPs",
            "date": "2015-08-16T06:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 196296,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3979565.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/iklone",
                "username": "iklone"
            },
            "url": "https://myanimelist.net/reviews.php?id=196296"
        },
        {
            "content": "I couldn't watch any more of this if I tried. It's such a slog. Two episodes was all I could manage, and I'm surprised with myself that I didn't stop at the first. Therefore this is a brief review.\r\nTo begin with, the initial concept is great. Nyarlathotep, the crawling chaos, servant of Azathoth, transforms into a little anime girl. Great start. That's why I watched this in the first place. It seems like it would appeal to a fan like me. However, everything went downhill after that. \r\nNow, Nyarlathotep was a unique entity in the Lovecraft mythos. Attempting to create an established race out ofthe shapeshifter is a bold move to say the least. As far as Nyaruko's personality goes, while it is true that Nyarlathotep was a fair bit more sociable and scheming than the other Outer Gods, it was by no means a ditz. From this, and from the depictions of Night-gaunts (they're supposed to be dead silent!) and Shantak-birds.  it was clear that the creator (creators?) only had a surface-level knowledge of Lovecraft. Whether this was due to laziness or availability of the stories is unknown to me.\\n\r\nIt's not like the non-Lovecraft parts are any better. That weak-ass fight (complete with Pokemon reference) was equal parts not funny and boring. The slice-of-life aspect is probably the strongest of them all, but if I wanted good gimmick-less high school anime I have plenty of those to choose from.\\n\r\nI may be a sperg for getting picky about source material and giving this such a low score, but when I hear the phrase \"Lovecraft anime\", I expect a bit more. I'll keep my eyes peeled should anything of similar concept appear in the future.",
            "date": "2015-12-10T10:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 205187,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4775815.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RiftSalad",
                "username": "RiftSalad"
            },
            "url": "https://myanimelist.net/reviews.php?id=205187"
        }
    ],
    [
        {
            "content": "Well, this is the first time i'm writing a review, and probably the last, but i just have to review this. \r\nI guess the only real problem i have with the show is the main character Nyaruko. About 1.5 - 2 years ago i dropped this show because she was SO ANNOYING. It was painfull to watch most of the time because of her, and it was also painful to watch it again when i decided to try and watch it again.\r\nThe way i see the story(might be wrong but i don't care), it isn't really a story at all... it's mostly funny gags thatare somewhat enjoyable from time to time. There isn't really much progress other than introdusing a few new characters. But since some of the gags are fun, i'll give a 4\\n\\n\r\nI really like the art... It is good. Not the best but it's close. That's why i give 8.\\n\\n\r\nI also like the soundtrack, but i like most soundtracks so i doesn't really say much, but i'll give it a 7.\\n\\n\r\nAs i said earlier, Nyaruko pretty much ruined a lot for me. I simply don't like her character. Sure she can be cute sometimes but there is a limit to how much i can handle a character being so annoying. The other characters is easier to deal with since they are not as crazy as Nyaruko, but you have to decide that yourself, since there is a lot of mixed feelings to the characters. So characters gets 4.\\n\r\nAlso, MC-kun is a male Tsundere :3. that's kind of refreshing, i dunno why.\\n\\n\r\nSo, did i enjoy Haiyore! Nyaruko-san? Well, not as much as i would want. But it has some good points that are enjoyable. And i probably would like it more if Nyaruko wasn't so god damn annoying all the time. \\n\\n\r\n6/10. Now i have to survive the second season.... Sigh... Guess i'll go buy some forks.   \\n\\n\\n\\n",
            "date": "2015-07-29T07:04:00+00:00",
            "helpful_count": 6,
            "mal_id": 194608,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2326099.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Joworaka",
                "username": "Joworaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=194608"
        },
        {
            "content": "This is based on the show as a whole instead of just the first aeason\r\nEpisodes - 24 episodes throughout 2 seasons (and a bunch of OVA episodes)\r\nGenres - Comedy, Parody, Sci-Fi, Harem, Romance\r\nWhat I Liked about the show -\r\nCharacter\r\n1 - I loved the comedy/Parody from Nyaruko and she was cute\r\nEnjoyment\r\n1 - I couldn't go a episode without laughing because I found this funny\r\nWhat I Disliked about the show - \r\nCharacter\r\n1 - I found the character of Hastur was so annoying throughout the whole series\r\nFavourite Character - My favourite character from the show is Nyaruko, she was my favourite character because I loved the comedy fromher and the parodies from her as well\\n\\n\r\n Overall - 8/10",
            "date": "2015-12-13T02:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 205422,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4860455.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratedR7585",
                "username": "ratedR7585"
            },
            "url": "https://myanimelist.net/reviews.php?id=205422"
        },
        {
            "content": "So This what Half Life 3 looks like meets the Cthulhu Invasion.. That's a weird combination\r\nThe Gordon Freeman in this series is neither An Cthulhu wields a crowbar as a main weapon...\r\nHunting on an Scavenger Hunt was so deadly and it's also part of comedy aspects... (Man that's dark and hilarious at the same time)\r\nThe Main character so far was just a decent guy with no self precautions until that girl came to her.. which reminds me of that one time show like bludgeoning angel dokuro-chan.. \r\nDue to troubles and antics by Nyaruko... The more he falls into her stupidity, he always takes it muchseriously and  avoid every gag which is much common to him...\\n\\n\r\nToo Decent to call this a normal Parody show.. (Like Blood Lad, and Binbougami Ga) but it's enjoyable too.. I honestly get on crack literally in the end..\\n\\n",
            "date": "2016-12-20T23:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 235977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5472966.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HikiNEET021",
                "username": "HikiNEET021"
            },
            "url": "https://myanimelist.net/reviews.php?id=235977"
        },
        {
            "content": "I personally enjoyed this anime to an extent. I actually went into this blindly without any knowledge or expectations. It turned out to be a pretty funny rom-com with the exception of a few things. \r\nPlot: 7. I give it a 7 based on the fact that it does its job as a comedy. I mean there's some moments where there's mild drama or romance and then there's a load of gags that are humorous at most. The problem I had with this the most is that well, there really isn't any direction in this. It's basically one guy forcibly going on adventures with aliengirls. So basically, it's another rom-com harem.. must I say School Days (yes I thought it was funny, but annoying.) I digress, I personally thought it needed a direction instead of just one linear path of straight up funny innuendos.\\n\\n\r\nArt: Pretty nice, in 1080p that is >_> It's not outdated obviously and the characters don't have extremely outrageous eye sizes? I like the art, especially some scenes were nice. \\n\\n\r\nSound: Good seiyuu and good sounds ++.\\n\\n\r\nCharacters: The characters are likeable with the exception of that blonde kid who looked like a girl but actually is a guy who happens to go gay with the main character. Hasuta",
            "date": "2013-07-02T19:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 103547,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2523939.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/panduhkun",
                "username": "panduhkun"
            },
            "url": "https://myanimelist.net/reviews.php?id=103547"
        },
        {
            "content": "Haiyore! Nyaruko-san is a parody anime.  Because of this, I thought the best way to review this is to reference as many things as I can in this one review.  \r\nStory: The plot of this anime is pretty much, well, non-existent.  Think about \"Demon King Daimao\" and \"Angel Beats!\", and throw all of those somewhat plotless ideas away because there seriously is no plot to this.  In fact, it might very well be similar to \"Zero no Tsukaima\" and \"Shakugan no Shana\" because of the idea that there are many antagonists within the story that each get a sort of smallarc in a sense.  Also, think about \"To Love-Ru\" for the alien aspect.  The story revolves around a 17 year old named Mahiro who finds out that a cthulu life-form known as Nyarlathotep or Nyaruko for short has come and protect him from other alien life-forms from doing god knows what to him.  From then on, more cthulu-like creatures show up and hilarity ensues.  \\n\\n\r\nCharacters: Nyaruko, as the lead heroine, is a mix of Haruhi's enthusiasm, Konata's otakuness, Tomoyo's appearance, and Haruko Haruhara's insanity.  And possibly every single lovesick female that can exist in anime ever.  In short, she is an overly active silver-haired girl that can pretty much kick ass in any situation, proving to be truly the heart of this show, giving it its character.  She also possesses one of the largest ahoge's ever, which changes shape according to her mood, which is actually pretty funny.  Next, Mahiro.  Now, think of the most tsundere character you can think of, and multiply it by 3.  To put it short, Mahiro is one of the most tsundere characters you can ever meet.  As the main male, he has to put up with all of these antics that the freeloaders in his house come up with, resulting in some funny scenes that usually involve forks.  Yes, forks.  Next, Kuuko.  Kuuko can be considered as the sacred combination of origami and kotori from \"Date a live\", as well as Mafuyu from \"Seitokai no Ichizon.\"  As an obsessive and borderless person, she constantly fawns over Nyaruko and loves playing video games.  And finally, Hastua.  Yes, I know there are more characters, but I just wanted to point out the main 4.  Hastua is the trap in the series and can be considered as a mix of a dandere character and Fuko from \"Clannad\".  Yes, it's a boy, accept it.  Though usually quiet, Hastua adds in as the shy one, eventually becoming more outgoing as the series goes.  Keep in mind that these characters are just one-sided.  \\n\\n\r\nArt and Sound: As an art style, the characters look really well done and the animation is fluid.  The action scenes are pretty good as well and are well, random due to the circumstances the anime puts its action scenes in.  For sound, think of the most catchy and energetic soundtrack you can think of.  This will probably top that.  The OP is one of the catchiest and upbeat things to ever come out of anime.  As for the ending, the tone is still energetic, but a bit more toned down then the OP.\\n\\n\r\nPersonal enjoyment: Now, for me, this can be considered as a guilty pleasure anime.  The way I see it, there are 2 love triangles in this anime, each of them revolving around the 4 main characters.  This anime, truly has something for everybody.  It has a slice of life feel, action, comedy, parody, harem, yaoi, yuri, ecchi, horror (only for one episode, sort of), mystery, etc.  Though this anime really has no plot, it's not supposed to.  People judge this anime for something it isn't.  It's supposed to be true mindless fun in the sense of testing one's otakuness.  They constantly break the fourth wall, which is hilarious, they constantly make references to things, this is that otaku test I was talking about, and they put it in the way that is just pure comedy.  However, it should be noted that this anime has an obsession with wanting to speed relationships up and make babies.  Seriously, not even kidding.  It seems as though that the characters really want to make children, and girl on girl and guy on guy apparently works to succeed this task.  There is also a massive amount of foreshadowing which is just slipped in so precariously, that the characters and the audience don't notice, creating some sort of scavenger hunt that makes this anime unique.  To put it simply, I love this anime and if anyone out there wants to watch something that takes your mind off of pretty much anything in life, then I would highly recommend watching this because there is nothing better then getting a smile on your face.  Until then, may the owner of the Wicked eye watch over you!",
            "date": "2013-09-21T17:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 113729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=113729"
        },
        {
            "content": "This anime in the first 4 episodes is pretty funny to watch. You'll get a few laughs, however the anime kinda dulls down from episode 5 and on but comes back in episode 7. Still it can't hurt to watch it once in a while.",
            "date": "2013-03-15T18:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 89863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2307187.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hollow_head1",
                "username": "hollow_head1"
            },
            "url": "https://myanimelist.net/reviews.php?id=89863"
        },
        {
            "content": "Before saying anything about the anime itself let me mention one thing: Good luck getting that opening out of your head. It's been over a year now and I still catch myself humming \"I wanna chaos\".\r\nOk let us be clear: If you don't know who Lovecraft is, too bad. You might as well stop reading. If you don't like lolis, too bad, you might as well stop reading. If you don't like references well too f$%^ing bad. Stop reading.  Nyaruko-san takes the deities of the Cthulhu mythos and turns them into absolutely adorable lolis with questionable motives and morals. You have Nyarlathotep, turning intoNyaruko, our female lead, who obsesses over our male lead, Mahiro, an average highschool boy. Then you have Cthuga, the fire-breathing deity, turned to Cthuko, a bisexual redhead madly (pun intended) in love with Nyaruko and also fancying a bit the protagonist. And lastly, (and let me take a big breath here), we have me, Hastur, the Lord of Carcosa, the Unspeakable One, the Wind of Death, portrayed as (sigh) an adorable blonde trap. Hasuta-kun, who's also in love with the protagonist. So basically you have 3 sex(and not only)-crazed aliens looking like lolis, making a sh£$load of references to pretty much everything, all trying to win over the straight man, Mahiro. \\n\\n\r\nThe plot doesn't progress anywhere, nor does it intend to. The anime never takes itself seriously, and just keeps throwing jokes and references at us with an occasional romantic scene between nyaruko and Mahiro. Most episodes are one-shot stories with no connection to each other (other than the occasional reference), usually with an event foreshadowed at the start of the episode which leads to the climax and a gag near the end. Hell, from a point onward we see Mahiro and Nyaruko trying to find the foreshadows so that they know what to expect (yeah, Deadpool-like 4th wall jokes, legions of them).\\n\\n\r\nThe animation is pretty good as far as comedies go (hell, maybe even needlessly so) and the design of the aliens is simply too cute (you'll end up loving Nyaruko even if she usually acts like a jerk. The sound is also surprisingly ok, with the voice actors being surprisingly not annoying when they're doing almost-intentionally-annoying voices (still can't figure that out, nyaruko's voice for example should definitely be annoying and yet it isn't).\\n\\n\r\nReasons to watch:\\n\\n\r\n1)Plenty of brain-cell-killing humor.\\n\r\n2)If you like the Cthulhu Mythos it's a must.\\n\r\n3)References and more references and more references.\\n\r\n4)The art is incredibly cute for the girls and the trap.\\n\r\n5)It's a harem (kinda) anime without tsundere characters.\\n\r\n6)Rediculously catchy opening songs for both the original series and W.\\n\r\n7)Surprisingly romantic scenes thrown here and there.\\n\\n\r\nReasons not to watch:\\n\\n\r\n1)They displayed me as a trap (write my name in reverse)...",
            "date": "2015-03-03T04:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 181602,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3484693.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lord_Rutsah",
                "username": "Lord_Rutsah"
            },
            "url": "https://myanimelist.net/reviews.php?id=181602"
        },
        {
            "content": "Date: June 25, 2012\r\nSubject: Prisoner #90210 Ratchet\r\nNotes: Subject of test was put in a room and subjected to Haiyore! Nyaruko-san. Subject was then told to give his thoughts. The following is a transcript of his thoughts on this anime.\r\nPurpose: To understand why anime of the “Harem” genre turn him into a raging lunatic. The results will be used to decide in what sector of the asylum to place him.\r\nTranscript: I can’t believe I just sat through twelve episodes of this underwhelming, clichéd, and uninteresting mess of an anime. And it’s not like this anime didn’t have the chance to do something other than be aload of crap. It had an interesting idea in using Lovecraft lore in the plot. In fact, that was the best part of the series was when it embraced its inspiration. But after maybe two episodes of embracing the inspiration, it throws it away and instead has the occasional reference that only fans of Lovecraft could catch. “Hahaha, she mentioned The Rats in the Walls! That’s funny!” Or sometimes it’s more in your face, as if it needs to remind us that this is in no way just a generic piece of crap that has a decent enough idea behind it, but would rather throw that away to fit in with the rest of the harem crowd. “My bikini says Lovecraft! Because you probably forgot this had to do with Lovecraft lore and not tits and sexual references!” If this anime got rid of the Lovecraft references and inspiration and instead replaced it with aliens or demons or anything else from the harem anime genre, it would be the same fucking thing. Way to use the one decent thing you had going for you. Nope, got to get those beach and body swap episodes in instead of doing something new and innovative.\\n\\n\r\nBut hey, Haiyore! has cute girls. And that’s the only good thing about this load of smelly squid monster shit. The only reason I kept coming back to watch it was because I was susceptible to the wiles of the adorable Kuuko and Nyarko. And I mean, they aren’t even that great in the character department. But they have good design and I feel bad that I was put under the animators spell. It shows I’m still just a horny little teenaged boy. And of course Kuuko had to be a lesbian which makes things even better. You know, it’s pretty fucking bad when the only thing I can say about this show is: I watched it in the vague hope of seeing Kuuko make out with Nyarko.\\n\\n\r\nI mean, this anime, as I said, started with some good ideas behind it. Sure it was cute girls embodying horrible monsters that could make you go insane, but it had this whole Lovecraft world and I wanted to experience lots of that. It had lots of references to anime and Lovecraft! THERE WAS A FUCKING REFERENCE TO THE CALL OF CTHULU ROLE PLAYING GAME FROM THE EIGHTIES! I mean, I could laugh at these smart references! But then Kuuko joined the party. Then Hasuta. And then it was just a big harem and it was boring and uninteresting and uninspired and…FUUUUUUUUUUUCK!\\n\\n\r\nAnd don’t even get me started on the random loli that shows up at the door. Holy fuck was she cute! But holy crap was I groaning! I figured she was okay and wasn’t going to join the party, instead hanging around as a plot point. But instead, at the end, she says she wants to marry our main character, Mahiro! Mahiro is a fucking vagina magnet (well…and a penis magnet…a genital magnet) and he’s a terrible character! He sucks! He’s an asshole! You have a girl throwing herself at you and you won’t even kiss her? Sure she’s a horrible tentacle monster on the inside, but don’t listen to your parents! It’s not about what’s on the inside, it’s about what’s on the outside! His nightmare is kissing this poor tentacle monster from outer space! This girl just wants some loving! GIVE IT TO HER!\\n\\n\r\nDid I even mention anything about the plot? I am so scatterbrained right now because I have no idea how to talk about how bad this is. I mean, it starts with these aliens coming to Earth because Earth is the universe’s porn hub. We have the best pornographic video games and comics. And apparently that’s a big thing in space. And this girl, Nyarko, gets to protect Mahiro and its ultra-exciting because she loves him! But he’s a tsundere douchebag! He tries to kill her with a fork at one point! GOD I HATE HIM!\\n\\n\r\nDid I mention that there are bad aliens who attack the Earth? Yeah, they turn the sky red and violet because that wasn’t annoying enough on Shakugan no Shana. And the fights are freaking lame. They are all uninteresting.\\n\\n\r\nHell, that sums up the series. Uninteresting. I mean, you have the beach episode because you can’t have an anime without your characters in slutty swimsuits. Thankfully, Kuuko is conservative. But then again, there’s always that conservative school swimsuit girl. Speaking of which, there is a pool episode. And a body swap episode that is just creepy. I mean, I guess the part where Nyarko masturbates in Mahiro’s body was funny, but when she makes out with herself essentially, I was so creeped out.\\n\\n\r\nThere was nothing interesting about the plot. Nothing about it was fun. I was bored! There was this guy who I guess was Nyarko’s brother, but he never shows up but for one episode. And there are only a few episodes where Nyarko and company fight aliens. The rest are just generic, conventional harem adventures.\\n\\n\r\nCan I please ask you this writers of harem light novels and anime…why are the main characters so unrealistic? If a real human were in the situation where three chicks want to fuck him, he wouldn’t cry about it, find it annoying, and wish them to Hell. HE’D FUCK THEM! You know why Japan’s birthrate is going down? Because Japanese boys watch this and learn a lesson: Neglect women because they are annoying and kissing them is horrible.\\n\\n\r\nThe music is as conventional as everything else. The animation isn’t really that great. Characters do look absolutely cute and adorable up close, but from afar they look kind of weird.\\n\\n\r\nDid I mention Nyarko? I liked her. I felt for her! She likes this guy and he blows her off all the time. I mean, I know nothing about her character than she likes Mahiro and is loud. I’m sure there is more to her than that, but who knows? She’s too busy being his insane stalker. Kuuko kicks ass because she’s all quiet except when she can act lesbian with Nyarko. And she plays video games. She is the best character, as well as the funniest. Her utterance of the words “I’m wet” will forever stick with me and be a screencap I use forever; it was just that funny. And the loli was just…a loli. She didn’t have a lot of character. Though I do think Mahiro doesn’t like Nyarko because he is a lolicon. That whole shower scene and sleeping on the lap thing didn’t gel with me. That got a little creepy.\\n\\n\r\nAnd don’t forget that freaky Hasuta guy. Actually, let’s forget about him because there’s nothing memorable about him.\\n\\n\r\nI mean, I’m not as much mad because Haiyore! is shit as much as the untapped potential. It could have been a really good play on the mythology of Lovecraft, but is instead a harem anime with nothing to distinguish it from any other harem anime then the fact it kind of uses the Lovecraft lore a few times. I mean, it had some genuinely funny moments and I even found myself laughing at some of the stupid harem parts. But taken overall, it’s just not good. The only memorable part will be the cute girls. They are very distinguished from the rest of those girls in harem anime, but otherwise, nothing else is distinguished.\\n\\n\r\nKuuko…oh Kuuko, thank you for being the one bright part of this shitfest. If you were not there to make me laugh, then I would probably have stuck my dick in a soda bottle full of lemon juice just to negate the pain.\\n\\n\r\nDiagnosis: After this review he proceeded to bang his head against the floor for an hour trying to forget ever watching this show while at the same time yelling Kuuko so he at least remembered her. In my professional opinion, he needs to be placed in solitary confinement and put in a straightjacket. It’s G-block for him.",
            "date": "2015-05-22T11:26:00+00:00",
            "helpful_count": 5,
            "mal_id": 188501,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188501"
        },
        {
            "content": "This anime is for those who want a good laugh. It starts out with what seems to be the making of a story but then just goes, 'screw it' and slowly dissolves into gag jokes and characters, mostly characters. The only real plot is how Nyaruko is madly in love Mahiro and keeps trying to 'swoon' him. \r\nHere is a basic run down of the story:\r\nMahiro is walking home from school and is suddenly transported into an alternate dimension and attacked by a freakish demon and begins to freak out, only to be saved by what can only be described as the most flamboyant characterever, Nyaruko, who immediately falls in love with Mahiro and tries to do everything in her power to sleep with him. Nyaruko is an alien who's duty is to protect earth from undocumented aliens. these aliens are only after one thing (rejoice otaku's): Entertainment. Manga, anime, music, games, everything they want it. Earth entertainment (specifically japanese) is considered amazing in space and aliens invade earth to get it. Each arc starts out like a serious problem but then ends up being solved by some obscure foreshadowing and pointless events that make no sense. Two more aliens ( Cthuko and Hasta) help Mahiro and Nyaruko, but I'll leave their story out since it is really interesting and I don't want to spoil. \\n\\n\r\nThis show's main attraction is its characters, parodies, and gag jokes. The characters all have a firm base that they never leave. Nyaruko is madly in love with, and possibly insane, Mahiro, who couldn't care less about her and constantly points out discontinuities in the show (breaking the fourth wall). Again, I'm leaving Cthuko and Hasta out to let you see for yourselves. Being an Otaku anime, it references every type of anime with all sorts of hilarious parodies. \\n\\n\r\nThis anime is almost impossible to predict because of its constant twists and turns. Anything that can happen will happen through means of a plot device that Nyaruko will make up on the spot. It's mindless stupidity, without being annoying. The song is catchy, and the story arcs are all entertaining. Enjoy your watch!",
            "date": "2013-09-13T15:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 112821,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3121995.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mythical_Truth",
                "username": "Mythical_Truth"
            },
            "url": "https://myanimelist.net/reviews.php?id=112821"
        },
        {
            "content": "Haiyore! Nyaruko-san - A Review as dry as the gin I drink while watching this.\r\n---------\r\n\tPhew, so this is my first review. And I picked Nyarko-san of all shows to start? Why?\r\n\tThe reason is simple - among all shows I have watched so far, this one has stood out to me for its remarkable intensity.\r\n\tIntensity in what? Brutal comedy! Lack of dignity! Shameless reference-hogging! Self-awareness! But most of all, confidence. \r\n\tThe people behind this show probably knew what they were creating here, and had way too much fun making it.\r\n\tI won't repeat the plot and setting here, MAL got you covered. \r\n\tAs an aside, the OPof this show is so immensely anime that I would show it to anyone who needs a lesson on what this medium can come down to.\\n\\n\\n\r\nA) What I expected when going into this show: (backstory, expectations, predisposition) \\n\\n\r\n\tI first stumbled upon this gem of a show when doing my routine stroll through crunchyroll's sidebar list of anime to find something extraordinary.\\n\r\n\tUpon first sight, a heartfelt laugh escaped by chest - All my alarm bells for \"Gimmicky show\" were ringing at full volume.\\n\r\n\tAn anthropo-comedy show, I was sure of it. But with a lovecraftian god (and Nyarlathotep of all!) as the main chick? I was BEYOND sceptical about the quality of this idea.\\n\r\n\tApart from that basic info (which made the show seem painfully generic and at the same time highly interesting), I had no ideas as to what i should expect.\\n\r\n\tThe pictures on MAL and CR were too incongruous with my idea of a show featuring old-school horror.\\n\\n\r\n\tAs an aside, I watched Blend S before this show (I did NOT like it), and had a predisposition to thinking that nothing could possibly have less dignity than that show.\\n\r\n\tIf you can't tell yet, I'm not a fan of useless fanservice.\\n\\n\r\nB) What the viewing experience is like:\\n\\n\r\n\tIt's like nothing I've seen so far. There are lots of shows which people recommend you to \"turn your brain off\" to; \\n\r\n\tThis notion always struck me as odd, but now I understand it all too well.\\n\r\n\tYou cannot watch Nyarko-san without sacrificing some sanity. In that sense, it is quite a subtle application of lovecraftian psychology/horror. \\n\r\n\tSure, it doesn't SCARE you to insanity, but it sure drives up a wall! The show constantly fulfills every cliché expectations you might have, and goes even beyond.\\n\r\n\tIt indulges in its craziness, grabs you by the hand and doesn't let it go until you have lost either your virginity, your temper or your sanity.\\n\r\n\tThe only way you can enjoy the show is to accept it as what it is, and not question the premise, the execution, or...basically anything.\\n\\n\r\n\tHow does this craziness manifest itself? \\n\r\n\tHyperactivity of the plot; Nothing stands still for even a second. \\n\r\n\tReferences to anime and gaming culture as well as Lovecraft's works that bear no impact on the plot 50% of the time and are clearly there to entertain the knowledgeable viewers.\\n\r\n\tShameless fanservice and harem tropes. Yes. This is a harem.(As if there were a way to avoid this nowadays >.>) I have to admit, this show is as close to an ecchi as you can possibly go without it being categorised as such.\\n\r\n\tPrepare yourself for the most thirsty aliens you have seen in media, as well as a mother that loves her son maybe a bit too much.\\n\\n\\n\r\nC) What I think this show excels at:\\n\\n\r\n\tNyarko-san is a rare case of \"Terrible concept - brilliant execution\". The creators of this show knew that there was nothing serious they could make of this setting,\\n\r\n\tand thus they went for the complete opposite - total, utter absurdity.\\n\\n\r\n\tThe pacing of the show leaves no gaps to be bored. Every shot shows something interesting or relevant to the plot, and rarely is there a moment where you are let off the hook.\\n\r\n\tEven though the humour might not be of your taste, its comedic timing is spot on. This is a rare sight nowadays, and really makes this show enjoyable when you find value in its brand of wish-fulfillment, absurd humour.\\n\r\n\tIts references range from everything in between Pokemon and obscure shows you probably haven't heard about. (Pop team epic, anyone?)\\n\r\n\tAs an interesting aside: The show seems to give off a strong vibe that the video game obsession most of the characters have is reflective of the creators. I think it's telling that this show has more actual gamers in it than Gamers!.\\n\\n\r\n\tAnother facette of this execution is the way the plot is constructed long-term: There is no real overarching structure to it, but a (very predictable) and elaborate plan to increase the shenanigan density overall.\\n\r\n\tAs soon as the dynamics between the current characters could start getting out of hand or stale, the show introduces a twist to make up for it. Be it a new character that breaks the symmetry of the love triangle (rectangle? pentagram?)\\n\r\n\tor just a plain ol' body swap -  Nyarko-san never fails to deliver the kind of entertainment that keeps you on your toes, whether you like it or not.\\n\r\n\tThere is also (for this kind of show seemingly out-of-place) foreshadowing and adherence to Chekov's gun. In particular, a certain gimmicky charm comes to mind as being useful again and again in vital moments of the show.\\n\\n\r\n\tOn that note, an honourable mention is the *perfection* with which the main chick, Nyarko-san, is executed. She is possibly the most annoying, hyperactive, clingy, perverted love interest that a teenage boy could dream of, and as such fills her role spot on.\\n\r\n\tShe reacts to everything, forces the main character into the most embarrassing situations and literally wants his babies more than anything. The show pulls no breaks in characterising her as the most inhumanly obsessive lover you could imagine.\\n\r\n\tWhich...sounds annoying and unrealistic at first...until you realise it.\\n\r\n\tThis is genius. She's a lovecraftian god. OF COURSE she's inhuman! Of course she is destroying the sanity of both the main character and the viewer! Of course the stunts of absurd, meta comedy she pulls are seemingly out-of-the-blue.\\n\r\n\tThe seemingly pointless idiocy of the characters and plot shit actually serves to provide a lovecraftian horror that is not scary, but endearing (in a way).\\n\\n\r\n\tBeyond this, the show mainly focuses on turning the lovecraftian mythos into a source of humour, which further supports this thesis. However, not much about it stands out as much as the main cast.\\n\\n\\n\\n\r\nD) What I think it fails at:\\n\r\n\tWhich is a shame, really, since the main cast is terribly developed. Any development they get is limited to Mahiro (perfectly generic harem protagonist) slowly getting more accepting of his relationship with Nyarko. \\n\r\n\tApart from this, there is no discernible change in the dynamics between the characters, which is a shame, even though the dynamics at hand are quite stable and can be exercised in various ways.\\n\r\n\tAnother issue is the lack of motivation for the events at hand - mainly the romantic interest of Nyarko in Mahiro. There are only veeeery slight glimpses as to what she finds attractive about him, if there is anything at all.\\n\\n\r\n\tHe gets no proper characterisation, as is standard in harem anime, which makes it very difficult to empathise with Nyarko's infatuation with him. Similarly, but in a slightly less problematic manner, his disdain for her is rarely elaborated on.\\n\r\n\tThis is, yet again, a staple of many harem shows, but it bears mentioning. There ARE some good reasons as to why the MC does not reciprocate Nyarko's feelings - from a meta perspective, the tension would drop immediately if he did, and the show would instantly devolve into hentai.\\n\r\n\tIn-story, the MC simply has no interest in her. Even if he had, there would be no way to discern it - his character is so flat that it does not allow for interpretations of his preferences. Some speculation has gone into the idea that the MC is gay - however, there is probably a simpler explanation.\\n\r\n\tHis life gets invaded by an obsessive alien that could kill him in an instant if she wanted to, and wants his babies. She never leaves him alone, or any choice, for that matter. Swap the sexes, and you'd call the police.\\n\r\n\tIf you want to, you can think of him as a pendant to Kira from JJBA Pt4 - He just wants a quiet life. If that makes him any more redeemable as a character, my job is done. The anime, however, had to fail before I could fix it.\\n\r\n\tFurthermore, he has no idea why she likes him - he doubts the reality behind her feelings for him, as has been elaborated on in a later episode. Perhaps the MC had been tricked into a fraud relationship before, making him anxious about this whole shebang?\\n\r\n\t...No, of course not. The show doesn't even remotely care to give motivation to him and Nyarko, which is a missed opportunity in its own right, if not for the potential character development it could entail.\\n\r\n\tBy the end of the season, you do have some small advances in the disposition of the MC towards Nyarko, which is nice. However, the way it was handled overall was suboptimal.\\n\\n\r\n\tAlso, it does not present a proper homage to Lovecraft with this. If that's what you came here for...I dont know what's wrong with you. Good horror? In anime? And then in a show centered around one titular cute girl character? Get out.\\n\\n\r\nE) What the show surprised me with: (in a positive or neutral way)\\n\\n\r\n\tThe expertise with which it pulls off its wish-fulfillment, dirty jokes, and sets them up so nonchalantly. It is confident in being predictable and cliché. And even though I despise the crude humour it devolves to sometimes, It shifts its focus often enough to make it bearable.\\n\r\n\tThere is variety - of the good kind.\\n\r\n\tOverall, it was more than I expected of a show about a...uh...you know the plot what am I talking about.\\n\r\n\tIt turned a frighteningly weird premise into an enjoyable, even if dubious, ride. And with the last two episodes, it might actually have gotten to a point in quality that I can safely say was...pretty good?\\n\\n\\n\r\nF) What I wish the anime had done, but didn't: \\n\\n\r\n\tThe plot, oh my goooood. Most of the time, an arc lasts about 2 episodes, maybe 3. During these sections, the show keeps focus, but there could have been done much, MUCH more with the setting of lovecraft's creations forming an intergalactic society.\\n\r\n\tThey could have traveled to the stars! Traveled in time, not even Yith-style! (props for inserting the Yith,though). However, the show doesn't bother. The characters live at the MCs house for the entirety of the plot. Bluh.\\n\\n\r\n\tCan someone please just write fanfic about this? Wait, NO DONT PLEASE-\\n\\n\r\nG) Should you watch it? (whom is it for)\\n\\n\r\n\tIf you dislike trashy shows, RUN and hope Nyarko-chan doesn't find you and steal your virginity. This is as trashy as it gets. We're talking a Yuri-BoysLove-Vanilla love pentagram that provides enough fanservice to make me question if Eromanga sensei could be like this. (I did not watch the latter, so these are only suspicions)\\n\r\n\tIf you're in for something deep and engaging, you will be bored. There's no lore or intellect to be found here.\\n\r\n\tBUT, if you're in for mindless, intense humour that will rip you out of your chair, paired with some juicy fanservice here and there, in one truly weird setting, then this is the train you should hop onto.\\n\r\n\tDepending on your preferences, this might even be a very good show for you.\\n\\n\r\n---------\\n\r\nSCORING: \\n\r\n1) Proficiency in execution\\n\r\n\t9/10 - You'd be surprised how much work goes into making a good trash harem.\\n\\n\r\n2) Depth of concepts and characterisation\\n\r\n\t3/10 - There's some depth if you're willing to see it, but I couldn't write an essay about it either.\\n\\n\r\n3) Entertainment value \\n\r\n\t8/10 - For how ridiculous this show is, and for how little dignity I have left, I had a blast. Almost as much as with Gamers! \\n\\n\r\n4) Memorability (decided a month later)\\n\r\n\t-/10 - I predict that in a month, I will only remember the scenes of Nyarko being overly attached girlfriend. (Preemptive 5/10)\\n\\n\r\nQuality Score: (average of PROF and DPT )\\n\r\n\t6/10\\n\\n\r\nFun score: (Product of ENT and MEM divided by 10, long-term)\\n\r\n\t4/10\\n\\n\r\nTotal: (decided on a whim or vodka)\\n\r\n\t5.5/10 - average, but nice\\n\\n\\n\r\nWhew, I can't believe this is over. 12 episodes can feel soooo long.\\n\r\nWait, what did you say? There's a SEASON TWO? WHAT DO YOU MEAN THERE'S AN OVA?!?!?!?!?! \\n\r\n[opens emergency Vodka flask]\\n\r\n...Some other time. Maybe never. \\n\r\nHopefully.\\n\r\n....\\n\r\n....\\n\r\nOkay, so what's season 2 about?",
            "date": "2018-02-15T14:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 271582,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6730953.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Slangens",
                "username": "Slangens"
            },
            "url": "https://myanimelist.net/reviews.php?id=271582"
        },
        {
            "content": "My opinion about this anime is that the male main character should be more honest about his feelings for Nyarko, besides that it's good and i love Nyarko's voice... the way she speak makes my day ^_^, \r\nafter the third episode i noticed alot of similarites from other animes, one girl attached to the male and another girl attached to the girl who's attached to the male and a love triangle begins. \r\nI recommend this anime to people who's after a good laugh and ecchi moments and action at same time, some few few few love moments...",
            "date": "2012-06-28T01:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 64619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1352079.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/martver",
                "username": "martver"
            },
            "url": "https://myanimelist.net/reviews.php?id=64619"
        },
        {
            "content": "Some reviews are harsh, some are good, ad here is my piece of mind:  I like this anime. Granted it could ghave been a lot more, but as it is using the works of a Master Writer as H.P. Lovecraft and makes a parody with the Chthulhu Mytos, the idea itself would deserve a 9, not even counting its audacity!\r\nThose that know H.P.Lovecraft will laugh and recognize a lot on this story, especially the presence of the Yith, the Mi-go  and Nyarlatothep of course. The use of such characters (Cthuga is very funny, and given its original being so much powerful and terrfic,even more hilarious).\\n\\n\r\nAs Lovecraft's work can be considered Science Fiction, the way it was parodied here is fantastic, and many parts are so much more funny if you know what and which stories its parodiy comes from. \\n\\n\r\nWhen I first knew what was the concept of this anime I was thrilled, and even though it is parody I laughed a lot. \\n\\n\r\nThat being said, I also like strong female characters with resolution and decisiveness, and Nyaruko knows what she wants. The boy is your regular dork and waste his time refusing the adorable Nyaruko (aha, must have a reason for the gags, as her atempts are funny). Chthuga is funny, but I am not a fan of Yuri anyway, but she is ot the aggressive one against the male character as in other stories and that was refreshing. \\n\\n\r\nOf course they could have done much, much more with such an idea, but as this is a parody, then ok. \\n\\n\r\nI recomend it for its execution, art, music, and for its origial and daring concept! And if you know or not Lovecraft's works, either way you will laugh a lot (although it is much more fun for those that do read Lovecraft's works)",
            "date": "2012-09-12T05:52:00+00:00",
            "helpful_count": 4,
            "mal_id": 72177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/135660.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VoidHawk",
                "username": "VoidHawk"
            },
            "url": "https://myanimelist.net/reviews.php?id=72177"
        },
        {
            "content": "This series appeared cute and lighthearted, but it's just so damned hollow and constantly beats viewers over the head with its overabundance of sexual tropes. It's as if they wanted to throw a bone to as many fetishists as possible yet never delivers any kind of real satisfaction to any of them because the main character wants only to be left the fuck alone. Even his mother wants to ride his dick, and I get that there's a market for that, it's just that they tried too hard on the wrong aspects. It's an incessant display of a sloppy love triangle, square, pentagon, hexagon, whatever,while haphazardly throwing in whatever nonsensical back story to give credence to the madness. I have thoroughly enjoyed silly anime like Love Hina, Crayon Shin-chan, Dragon Crisis, Sora no Otoshimono... but this was just not fun for me. Watch it if you like, but this is why I dropped it. Ugh.",
            "date": "2015-01-14T15:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 177861,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/AdmiralWiggin",
                "username": "AdmiralWiggin"
            },
            "url": "https://myanimelist.net/reviews.php?id=177861"
        },
        {
            "content": "This is one anime that almost did not thinkpart of the story, not even merely the background story as a setting for the situation-comedy love her so most did not give a clear reason for the characters to stay together. Indeed, there are still about Nyaruko opening story that comes to protecting Mahiro, but it was only last up to two episodes before then the whole story becomes meaningless. So what could be the advantages of this anime? Comedy crazy? Looks like neither. Parodi the flagship feels too forced, more just tryingto show a resemblance to the original work that became a reference basis ratherthan pay attention to the element of comedy itself. Using the Star Wars-style scrolling text to convey a bad joke will not make anyone laugh. And, OMG, it even went satirically political! .... Meanwhile, the slapsticknya also very repetitive and seem random. Mahiro scenethat constantly wear a fork to punish Nyaruko just look stupid when both Mahiro and Nyaruko each did not have the background to specifically use a fork or fear him. Anime is occasionally may still bemade to smile, but most of the comedy is very bland.",
            "date": "2017-02-25T13:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 241374,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5418319.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rizkiawan-kun",
                "username": "Rizkiawan-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=241374"
        },
        {
            "content": "Every now and again there comes along something that leaves such little impact that you're bound to forget about it not long after hearing about it or watching it. Something so unremarkable that not long after finding out about it or finished consuming it, that years, months, weeks, or days later, you come across it swearing that you haven't heard of it despite the fact that you've already told people about your opinions on it or have marked it down that you've watched it. Haiyore! Nyaruko-san is one of those things.\r\nOur story follows Mahiro Yasaka, an ordinary student, until one day he is suddenly attackedby a dangerous monster while walking out in his neighborhood. Just when he is cornered in a dead end street and everything seems lost, he is saved by a silver-haired girl Nyaruko. This give claims to be the shape-shifting deity Nyarlathotep, from the pages of horror author H.P. Lovecraft Cthulhu Mythos, sent by the Space Defence Agency to Earth.\\n\\n\r\nAfter being rescued from the alien, Nyaruko falls madly in love with Mahiro and forces herself into his household, much to his annoyance. Soon, they are joined by two other deities, Cthuko, a girl obsessed with Nyaruko, and Hasuta, a young boy who is also obsessed with Miahiro (which comes across kinda creepy). Together, the three aliens protect Mahiro from various extraterrestrial dangers that threaten both his and the Earth's well-being, all while making his life a living hell.\\n\\n\r\nReading through the story synopsis, there were two things that popped out. One, it's the most cliched setup for one of the most cliched types of shows, a comedy harem show, and secondly, the fact that the Cthulhu mythology was chosen as the backdrop for this harem comedy. I think we all know why Cthulhu was chosen, because it's a recognisable name to draw in an audience, and because the gimmick of a Cthulhu harem comedy is the only thing holding this thing together. If the unspeakable gods from the pages of Lovecraft weren't here, someone looking for something to watch probably wouldn't have even given this a second glance.\\n\\n\r\nThere isn't all to much beyond the initial premise. Nyaruko chases after Mahiro, Mahiro rejects her. Rince and repeat until our main character inevitably has a crush on Nyaruko. As a harem comedy, it's incredibly generic. The only reason that anyone would want to watch this would be a unique spin on the Cthulhu mythos, and it doesn't really do anything unique with said concept. It doesn't really use stories that Lovecraft wrote to it's full potential of comedy. It doesn't even use some of the potential. It's just an excuse to have characters in a harem setting with the occasional wacky thing happening. It's the laziest type of adaptation, an excuse just to have recognizable characters on screen.\\n\\n\r\nIf you're going to have all of the Cthulhu gods in a comedy story, do something with it. Maybe make light of the Eldritch horrors in such way that the deities don't understand the horrors of the mind and reality warping they cause, or have everyone question why the main character suddenly has a harem only for one of the gods to turn everyone into half fish people like The Shadow Over Innsmouth, but make them look clumsy and terrible at their job. Instead, what we've got is bog standard harem comedy and references to other better things.\\n\\n\r\nAlso, the series has the audacity to try and have a montage of \"all the good times\" at the end despite the \"characters\" being so 1 dimensional and shallow that they're barely characters. If anything I'm easily going to forget about his 10 minutes after I upload this review and use that brain space to remember something actually interesting. Since the series barely has anything going for it, I would lump the OVA in with this review, but that also has nothing of substance either. It's just a brief parody of the\"Magical Girl\" genre.\\n\\n\r\nHaiyore! Nuarulo-san should be skipped over. It's bland, boring, and does nothing unexpected or anything that would differenciate itself from the dozens, if not hundreds of other harem comedies out there, both the ones that are genuinely trying to be regular harem comedies, and the ones that try to subvert the genre, have some sort of twist, or even a gimmick that tries to differenciate between itself and other harem comedies. I guess the one thing that this series did that was good was increse interest for Lovecraft's works in Japan when this aired on TV.",
            "date": "2019-01-04T03:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 298004,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2295033.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/megafat",
                "username": "megafat"
            },
            "url": "https://myanimelist.net/reviews.php?id=298004"
        },
        {
            "content": "Nyaruko-san was cute and had some nice art, but I couldn't stick with it. \r\nThere is simply not enough content to stay entertained throughout, and they can only ride their lovecraft gimmick for so long before it gets old- and that's coming from a lovecraft fan.\r\nIf you are just looking for a fun anime with fan service and goofy lovecraft parody type characters then look no further, otherwise it's not really worth the time.",
            "date": "2013-03-26T04:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 90947,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2350303.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RamblingSurvivor",
                "username": "RamblingSurvivor"
            },
            "url": "https://myanimelist.net/reviews.php?id=90947"
        },
        {
            "content": "I like the concept of this anime, bringing mythology creatures from the Cthulhu mythos and turn them into cute girls and this battle between the monsters and gods is quite fun to watch, also the whole mc's family belongs to the clan of silver forks ninja thing which sounds kinda dumb but funny.\r\nThe only downside to this anime is how unlikable the mc is, maybe it's just me but the dude acts like a total jackass everytime Nyaruko makes a move on him. I know that most anime when it comes to a girl falling madly with a guy but since due to anime's logicthe guy is either too embarrassed, dumb, dense, or in love with someone else and he always find a way to slip away when the girl tries to force her love on him but here the guy acts like a total ahole, his actions are basically saying \"f u, get away from me, i don't love you, get out of my life\" and because of this i sometimes wonder why the hell would he even feel sad or emotional when Nyaruko leaves him, oh and he also wines like a btch sometimes making him much more annoying than any monsters in the anime",
            "date": "2018-10-27T13:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 292774,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6207270.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Melody_scarlet",
                "username": "Melody_scarlet"
            },
            "url": "https://myanimelist.net/reviews.php?id=292774"
        },
        {
            "content": "An alien deity girl is sent to earth to protect an earthling from space monsters. Turns out she falls for him. This show doesn't really have any crazy plot or anything like that. It's just full of gags, parodies and funny stuff. A lot of the jokes have to do with Nyarko(Alien girl) being a pervert and trying to get with Mahiro(MC dude). I always find pervert girls in anime amusing so I thought it was pretty funny. Mahiro builds himself a nice little harem and even has a boy fall for him so he's got options. lol. Mahiro has to deal with pervert girlsliving with him and all the weird space stuff they bring with them. It's amusing to see. It has a bunch of comedy/parody,ecchi, Scifi and some action. It's a nice little silly anime to watch.",
            "date": "2016-10-09T03:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 231424,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4600871.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/yoshihiro56",
                "username": "yoshihiro56"
            },
            "url": "https://myanimelist.net/reviews.php?id=231424"
        },
        {
            "content": "Even after binge-watching this entire show, I'm genuinely unsure how I feel about it. I'm a huge fan of H.P. Lovecraft and the universe he created, and I enjoyed the references and jokes in this, but there's no plot, the characters are extremely simple, and it's generally kind of hard to make my mind up on. One example of this is the fact that Hastur, the unspeakable, the king in yellow, is a tiny trap child. On the one hand, that's hilarious to me. On the other, I can't help but be sincerely confused as to why. \r\nEven though I enjoyed this show, I feellike I don't want people to know that I enjoyed it. I'm not into rom-com animes, and there is 0 chance I would have watched this if it wasn't just for the absurdity of an anime where Nyarlathotep, the crawling chaos, is a small anime girl. I wouldn't really recommend this to anyone, but I wouldn't tell anyone to avoid it. It's alright, I enjoyed it (even if it wasn't good per se), and I guess that's enough.",
            "date": "2018-02-18T11:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 271852,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5899250.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/King328",
                "username": "King328"
            },
            "url": "https://myanimelist.net/reviews.php?id=271852"
        },
        {
            "content": "Ok , i knew this anime when i saw about anime kiss scene on google image.\r\nAnd bam , i saw this anime , and also i searched it on MAL . Oh , i see comedy , parody , and SCI-FI , and i think little bit of \"harem\" . Ok , i will give a shot about this anime\r\nOk , so far i'm enjoying this anime , not masterpiece at all . But it's worth it for watching , i like the references makes from Nyaruko , the sound from Cthuko , and the \"trap\" Hasuta , i like three of them. And forMC i think that's decent MC of the anime , where the girls surrounded him , and that's why i call this \"harem\"\\n\\n\r\nIf you want to some comedy with parody references and also little bit \\n\r\n\"romance\" , maybe this anime will be fit for you. Try it :)\\n\\n",
            "date": "2016-07-26T08:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 225049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5455181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/-Hex-",
                "username": "-Hex-"
            },
            "url": "https://myanimelist.net/reviews.php?id=225049"
        }
    ],
    [
        {
            "content": "Man, oh man, if you look at my list, you'll noticed that I tend to prefer English dubbed anime over subbed anime. This is the anime that changed that. I'll have to give it credit for that.\r\nHere I was, looking for something after finishing Shakugan No Shana II, and I come across this show. The premise was unique enough that it warranted me to take a look at it, and at 13 Episodes, it wasn't that much of a time investment. A weekend to be precise. \r\nLet me start by talking about the Characters, I'm giving them a nine, not because I found them particularlyendearing lall the time. (Though Mahiro is a particularly skilled straight man. Usually.), but because of their designs. Each one is unique and instantly recognizable. I could watch a 1000 anime and instantly recognize these characters. I suppose it's part of the reason I give the art an 8 as well.\\n\\n\r\nThe story, however, doesn't go anywhere. With the exception of a very-moving 1st half of Episode 12, a lot of punchlines come from: Mahiro does something to Nyaruko. Nyaruko does the exact the same thing to Ryuuko later in the episode. While it is a clever way to show off the two MCs compatibility to each other from a romantic perspective,, if it's not up your alley for humor, it's going to be obnoxious. And while the show goes to great lengths not to be an Episode of the Week format with cliffhangers, none of them go anywhere. They're all resolved within a couple of minutes of the next episode. And Brick Jokes, part of any good comedy's humor are severely lacking.\\n\\n\r\nThe opening is very catchy, and while it fits for the first 11 Episodes, Episode 12 puts it in a very awkward place.   \\n\\n\r\nOne of the writers must have loved video games, because you've got your parodies of Video Game Consoles, not just 2012's modern ones. (360 and PS3), but a WonderSwan knockoff is even plot-relevant for an episode. How many non-Japanese people are even familiar with the WonderSwan's existence?",
            "date": "2016-06-19T10:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 221180,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5208224.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnotherStatsGuy",
                "username": "AnotherStatsGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=221180"
        },
        {
            "content": "(A very long time ago; things used to be different. Now this much is true:) Comedy, especially slapstick comedy, and I don't make for a perfectly good team. What comedy finds \"funny,\" I vehemently HATE; what I find \"funny,\" it's considered \"boring.\" The \"Generation Gap\" does that.\r\nI came towards \"Nyaruko-san\" with fear and caution: I might get yet another moe-fied piece of animu garbage; where the spotlighted male lead would yet another spineless herbivore.\r\nWell... Said male lead, Mahiro, has a female voice actress. (We could say that he's in middle school or that Japan's overall herbivorism had taken its toll.) But that's about it. He'sable to surprise me by being \"the fan who smacks the idiots\" as oppose to being yet another \"butt of thy jokes.\"\\n\\n\r\nSo here we have this show about Nyaruko, a moe-fied Nyarlothotep and brazen female otaku, constantly trying to pull it out of Mahiro's pants for reasons unknown... Comedy ensues, references are made, Akihabara is considered as \"THE place to go\" for \"Earth's entertainment(?)\"... (Hollywood? Bueller?)\\n\\n\r\nMy only complaint is with Mahiro's seiyuu being female instead of male. If his male friend can haz it, then why not?\\n\\n\r\n(Hoping for an English dub release from Media Blasters as well... ;_; )",
            "date": "2012-06-25T23:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 64461,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=64461"
        },
        {
            "content": "What can I say? This series makes Mel Brooks films look mature; and that is what I love about it! The characters are beautifully drawn, the music is catchy enough to get stuck in my head for days, and there hasn't been an episode yet where my sides haven't started to ache from the laughter. Just when you think it's starting to get serious, something totally ridiculous comes right out of nowhere.\r\nIf you like comedy on a level of absurdity that rivals flicks like \"Monty Python and the Holy Grail,\" \"Spaceballs,\" \"Airplane,\" and \"Robin Hood: Men in Tights,\" then I am sure your gut willsplit just as much for \"Haiyore! Nyaruko-san.\"\\n\\n\r\nNyaruko-san is immature comedy at its very best (maturity is so overrated, anyway). Now where exactly did we place that fourth wall?",
            "date": "2013-06-16T19:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 101281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/coastalmaineiac",
                "username": "coastalmaineiac"
            },
            "url": "https://myanimelist.net/reviews.php?id=101281"
        },
        {
            "content": "I first watched a bit of this franchise back with the online airing of Haiyoru! Nyaruani, which I never finished due to lack of interest. I gave Nyaruko another chance in Nyaruko-san but I'm sad to report that it still isn't that good. Nyaruko is about the not-so-ordinary slice-of-life story of Mahiro who, like in To LoveRu, finds a sudden instant-girlfriend in the form of a crazy alien, and soon finds himself in the middle of yet another harem. This light comedy differentiates itself in two ways. First, Nyaruko's personality and goal of protecting Mahiro and, really indirectly, the Earth as a galactic policeman makesfor an interesting premise. Second, the series makes use of lots of parodies of other anime series. While the second differentiation is interesting, it's not worth wading through a lot of bad plot to say \"oh, that was from Gundam OO... nice...\".\\n\\n\r\nAnimation:\\n\r\nThe overall animation is not bad, especially considering that it isn't in Adobe Flash this time around. The overall coloring is nice, with some occasionally stellar backgrounds. As for character styling, Nyaruko has one crazy-large ahoge, which she can apparently control to make shapes and what not (though not to the extent of Yami in To Love-Ru). Some of the clothing (or lack thereof) is a bit odd but given they're aliens I guess it's okay? It seems alien-based series always need a mascot, this time in the form of a hippo-bat-bird chimera.\\n\\n\r\nXebec's previous works include Kanokon, To LoveRu, Ladies vs Butlers, and MM! thus you can expect that there will be substantial fan service. Much of it is in the form of intentional ecchi similar to that found in Kanakon, though there is also a strong emphasis on yuri elements- and you have Hasuta, a guy who wants to have Mahiro's baby, if that makes any sense to you... There is some action involved, but I found it to be average harem quality, i.e. nothing to be impressed with.\\n\\n\r\nSound:\\n\r\nImmediately, the OP announces the seriousness of the series with a bunch of \"Ooh~ Nyaa!\"s. It's a playful but melodically uninspiring piece, though playing the first part at 0.5x speed makes for some good chuckles. The ED feels like the complete opposite of the OP, a very calm and conservative piece. BGM is fairly plain with one weird chant piece used repeatedly throughout.\\n\\n\r\nVA-wise, Kana Asumi did a great job giving Nyaruko a uniquely outgoing personality. Eri Kitamura also, again, demonstrates her unfathomable range as Mahiro; definitely a pretty convincing guy voice. The others were a mix as I found Rie Kugimiya a weird fit for Hasuta.\\n\\n\r\nStory:\\n\r\nThere's two ways you can look at the story here, from the innovative parody angle and from the lethargic plot angle.\\n\\n\r\nFrom the parody angle, this series is pretty entertaining. You can easily find over a dozen parodies in this show ranging from Haruhi to Half Life to The God Only Knows. I'll let you find some of the other ones but do note that it covers a surprisingly broad spectrum of anime and production companies.\\n\\n\r\nUnfortunately, the bare bones plot used to create these parody situations was pretty pitiful. You are presented with a handful of antagonists to move the story along, and they are laughably bad at best. The series is pretty arc-based, building (barely) to a final climax and likewise bare bones resolution. Though the show occasionally moves quickly and sometimes ends on cliffhangers, there are also many conversation points at which one could easily fall asleep. As Nyaruko is 1000% committed to Mahiro, there never feels like there is any real tension or risk- leading to my overall apathy towards the plot.\\n\\n\r\nFor me, the plot had the greater impact of the two and as stated already, it's not really worth it just for the parodies. So what about the characters?\\n\\n\r\nCharacter:\\n\r\nThere's a handful of primary and supporting characters, which can easily be bucketed as harem members and the rest, respectively. The series does try to be different by having homosexual tendencies but you never really get anything meaningful as Mahiro is just your standard, indecisive and weak male lead- though he actually does seem to be more rude than the typical nice guy. In the end, the only meaningful character is Nyaruko, who shows her devotion in a very Kanakon fashion, though with additional flair and Super-Sentai-ish body movements. Unfortunately, even with Nyaruko, all the relationships in this series are static- no one really develops at all.\\n\\n\r\nValue:\\n\r\nThis series deserves credit for pulling together so many parodies from such a breadth of genres. However, it walks a very well-treaded path in all other categories resulting in a standard, if not sub par, addition to the over-crowded slice of life, comedic harem genre. In retrospect, To Love-Ru offers a more progressive plot and richer character development with a fairly similar premise. Is this a show to watch? You can watch the first episode and use Nyaruko's personality as a litmus test, but in general I'd say pass this one.",
            "date": "2015-11-13T00:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 203263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=203263"
        },
        {
            "content": "So far the best anime i have ever watched and will always be my fav\r\nStory :\r\nLearn everything about girls and boy and how to be a tsundere with a fork only! 10/10\r\nArt :\r\n10/10\r\nsound :\r\n10/10 best soundeffects and music \r\nEnjoyment :\r\n10/10\r\nrewatched it over 30 times now\r\nI really wished if this anime was longer but sometimes you should act like Mahiro-san and move on\r\nNyaruko didn't just draw a smile for her love only\r\nshe draw a smile on my face and will draw a smile on your face too\r\nSo laides and gentlmen grab your chips and watch this anime NOW!!\r\n(P.S : it's better to watch ONE episodeonly every week if you want to enjoy it even more)\\n",
            "date": "2016-01-05T11:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 207819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5103339.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MaxIsJoe",
                "username": "MaxIsJoe"
            },
            "url": "https://myanimelist.net/reviews.php?id=207819"
        },
        {
            "content": "So I rated enjoyment a 9 but the whole show a 7? What gives?\r\nI guess the short version is I liked it a lot despite its shortcomings. I'm being overcritical.\r\nSee, this is a parody show. Both of otaku entertainment culture and of the Chtulhu mythos. And I love both those things. So I am totally into this... even while I acknowledge that the whole thing is pretty cliche and silly.\r\nMaybe I'm unfairly biased against harem anime because of the hate it gets from the Really Serious Fans... though I don't even want to call this a harem, because there's only two people chasing after ourprotagonist, and one's a young boy. Maybe it's because I'm bored of the monster-of-the-week... but that's not it either, because for the most part these are all pretty cute story concepts and well-executed even if not super original.\\n\\n\r\nNo, I think at the end of the day I am doing this show a disservice because I've mentally classed it as a guilty pleasure and I don't want to acknowledge how much I enjoyed it.\\n\\n\r\nWell... and also there's only so much of it you can watch at once, because it's all so very tongue-in-cheek. But I absolutely love the concept of eldritch abominations as high-school anime types. I actually feel for Nyaruko's constant unsuccessful pursuit of Mahiro. I like his batty mother. I dig the rich dense references[1] that pack every episode, many of which I actually get (go me).\\n\\n\r\nBattles get a little repetitive, but honestly that's part of the point. I would say the art suffers at some points for obvious shortcuts, whether it's repeated scenes (episode 12 is largely a clip show) or pan frames or whatnot, but it's still generally good quality.\\n\\n\r\nI think the biggest detracting factor is that unless you're already pretty familiar with the source material being parodied, this show just isn't going to make any sense. You'll get that *something* is happening, but what exactly will probably elude you, and that's just going to be frustrating. I love it. But I also love the Laundry Files[2].\\n\\n\r\nSo at the end of the day I think I would say if you suspect you'll like this series, odds are good you'll love this series. If you've looked at the cover and have no idea what's going on... maybe go watch something else.\\n\\n\r\nOH! And I forgot to mention, totally the catchiest OP/ED I've heard in a long long while. (And no, the lyric is not actually \"Gay horse gay horse! I want a gay horse[3]!\" But you'll never be able to hear anything else now...)\\n\\n\\n\r\n[1] http://nyaruref.blogspot.com/2012/04/haiyore-nyaruko-san-episode-1.html -- check out this guide if you're watching, it's really good.\\n\\n\r\n[2] Charlie Stross' urban-fantasy book series about a British government agency tasked with using math-based magic to protect the world from Cthulhu-mythos eldritch horrors and the crazed humans who would try to use them. Start here: https://www.amazon.com/Atrocity-Archives-Laundry-Files-Novel/dp/0441016685/\\n\\n\r\n[3] https://en.wikipedia.org/wiki/Secretariat_(horse) -- okay, the thing about him being a \"reticent breeder\" is actually overstated, the horse has like 600 known first-generation offspring so clearly he wasn't too shy of the fillies, but... c'mon, it's a joke.",
            "date": "2017-07-27T20:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 254000,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6284433.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/aesaloniichan",
                "username": "aesaloniichan"
            },
            "url": "https://myanimelist.net/reviews.php?id=254000"
        },
        {
            "content": "Spiritually, Lovecraftian horror and cute girls anime are perfect opposites; on the spectrum of things that exist, no matter what criteria you use to judge, these two things will be at loggerheads.  But, of course, anime is the eternal struggle to reimagine every personality, object, and abstract concept into a cute girl, and starting with diametric opposition is either the obvious move or so decadently stupid that anyone still conscious enough to react probably couldn’t form a coherent argument against it.\r\nDid it work, though?  Haiyore! Nyaruko-san was cute for the first episode or two, when Nyaruko was a ball of energy driven bypure novelty and some adorable randomly interspersed English.  The OP is endearing and I’m a big fan of the ED.  Otherwise, a lot of this show is kind of a slog.  Most of the jokes revolve around how much every character is in love with every other character (except for Mahiro, that featureless trash).  The rest are merely references to better shows (and the occasional worse show).  All the humor has the same setup, and often the same fork-related punchline; that stops being charming quite rapidly.  Before long, I realized that the only reason I was still watching was for Nyaruko, and then mostly because I enjoyed Kana Asumi’s voice work so much.\\n\\n\r\nThe first episode or two made it seem like there would be a consistent running narrative throughout the show, but that quickly dies down once Nyaruko, Kuuko, and eventually Hastur gather up their convenient excuses for living under the same roof and continuing to be relevant to the show.  From there, the show devolves into a handful of episodic arcs that only serve as excuses for more lazy jokes and don’t build off each other.  The larger universe occasionally toured or mentioned isn’t all that interesting or fleshed-out, and aims more for momentary convenience than cohesion.  Stuff springs into existence when it’s necessary and vanishes when the joke has passed.  There’s not much reason to expect anything more from a middle-of-the-road rom com, except, perhaps, if that rom com were based on one of the most iconic and expansive mythoi in the modern world and had a lot of opportunities to be better than a totally mediocre weekly wacky waifu roundup.  This didn’t have to be brilliant, but it could have been less of a horrid bore.\\n\\n\r\nTalk about an unlikable protagonist.  Mahiro expresses no reciprocation of Nyaruko’s feelings and yet we’re meant to believe that there will eventually be some manner of fulfillment.  His response to Nyaruko’s advances is never the perfectly reasonable, “Why would I want to be in a relationship with the God of a Thousand Forms?  Won’t my soul get warped beyond conceivable reality?”  Instead, it’s just, “Ew, girls.  I’m 15 and unrelatable.”  He’s always indignant and testy, as if it’s somehow a great tragedy and a major inconvenience that there’s a cute girl who lives with him, watches anime with him, and loves him unconditionally.  Mahiro is an obnoxious brat and there is no evident reason at all why Nyaruko should be so head-over-heels in love with him.  This kid is every terrible, bland, pasty, infuriating romantic comedy anime protagonist.  Yet this is also unlike so many other shows that string the audience along through the characters’ indecisiveness; Mahiro has made his decision quite firmly, but we’re expected to blatantly disregard it.  You, I, Nyaruko, the real Nyarlathotep, H.P. Lovecraft, and the whole world deserve better.\\n\\n\r\nI suppose I allowed myself to be convinced briefly that this show would be different, but don’t be fooled by the fact that the girl on the cover is apparently one of Nyarlathotep’s many incarnations.  It’s not all that funny or charming and is instead tedious, predictable, and kind of trashy.  This is just like any other show you could be wasting your time by watching.  Pick a better one.\\n",
            "date": "2017-07-03T14:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 251865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5690418.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AgentofSSUSteel",
                "username": "AgentofSSUSteel"
            },
            "url": "https://myanimelist.net/reviews.php?id=251865"
        },
        {
            "content": "In short, the story is about a love triangle between a faggot, a needy alien, a lesbian needy alien, and a gay guy who doesn't understand the basics of biology.  Nothing here makes sense, and the best jokes are references or meta jokes. \r\n  Nyaruko carries the show on her back and, let's be honest here, she is the only reason for anyone to spend more than 20 minutes watching this anime.\r\n If you're looking for a good or fun plot, character development, good fights or just a good harem, don't watch this show. If you looked up some clip on youtubeor looked at Nyaruko's art and felt interested, then go for it.",
            "date": "2017-02-20T08:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 240990,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4734626.jpg",
                "scores": {
                    "animation": 6,
                    "character": 0,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kouh4i",
                "username": "kouh4i"
            },
            "url": "https://myanimelist.net/reviews.php?id=240990"
        },
        {
            "content": "Lost potential, thy name is Nyaruko-san\r\nA little disclaimer to start: this review will cover both seasons of the Nyaruko-san anime TV series because they are both similar enough to warrant it.\r\n\tOn paper, Nyaruko-san has a lot going for it. It’s got a comedy-harem set up, the girls are all human manifestations of lovecraftian horror monsters, but some girls have the hots more for each other than out lead guy, which is a plus (hey, I’m a simple guy, girl-love is always going to score a few extra points with me). This show should have been a cash cow like Monster Musume before that was evena thing. But this show comes up short on its payload at nearly every turn .So, where (and why) did this show miss the mark?\\n\\n\r\n\tFirst off, a bit of history. While the true-blue anime series didn’t see the light of day until 2012, this IP began as a light novel series entitled “Haiyore! Nyaruko-san” in October of 2009 and got its “anime” debut as a series of five to ten minute flash shorts from 2010 to 2011, and these shorts are admittedly pretty damn hilarious; I highly recommend you check them out. But what about the main course? Ehh. . . . \\n\\n\r\n\tThe show kicks off with our eponymous silver-haired heroine being introduced by saving the main guy, Mahiro, from some demonic entity and we just kind of go from there with no real explanation of what where when or why; it’s just all there for the sake of being there because, well, we’re marketing this as a character driven show to sell a shit-ton of figurines and other merch for the otakus so who cares about idle details like compelling narrative, or any narrative for that matter.\\n\\n\r\n\tAnd that is your first insight into how this anime will go on to conduct itself: just doing so for the sake of doing so. “Forced” does not even begin to describe this show or its humor. So many of the jokes center around just random stuff: like the shoehorned super mega video game console that has too many features and fails or the fact that Mahiro’s main weapons are forks for no discernible reason.\\n\\n\r\n\tAs for the plot, there isn’t one, this show is almost completely an episodic affair. “Oh that’s fine, it worked for Space Dandy, right?” you might say. Well, Space Dandy had some great episodes, some good episodes, some mediocre ones, and a few outright stinkers. It basically just pinballed all over the place. Nyaruko-san? Well, it just flatlines it all the way through. At no point does this show ever get any more interesting or funnier than in its first five minutes. Not only that, but they use up all their jokes in the first half of the first season! We’re six episodes deep into a twenty-four episode run, people, and we just blew our load in the first quarter!?\\n\\n\r\n\tThe jokes are just too fast and too out of left field to work for twenty plus minutes, and then it hit me: Nyaruko-san wasn’t bad in spite of its run time, it was bad because of it. With the five minute long episodes, the showrunners would craft a single joke around an entire episode and it wouldn’t feel forced or too drawn out because it would just hit and roll off so well. Set-up, build up, punchline, laugh, credits roll, watch the next one. It’s a formula that works well for online shorts but falls flat on its face when drug out for nearly half an hour.\\n\\n\r\n\tThe OP and ED are both above average to good for both seasons, but the show really shines in art style and character design. The show is definitely distinctive; you’re not going to mistake it for anything else coming down the pipe during the same time period, but all of this isn’t enough to save the show as a whole.\\n\\n\r\n\tAnd don’t get me wrong, there’s potential here, I see it; Fuck yeah, I see it, but it is just poorly executed. Even still, droves of people seem to enjoy both seasons of this anime, and I’m not the type of person to tell them they’re wrong, but this show just isn’t for everybody; go watch the shorts instead if you had to make a choice.",
            "date": "2016-11-06T06:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 233325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3661241.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/S1apSh0es",
                "username": "S1apSh0es"
            },
            "url": "https://myanimelist.net/reviews.php?id=233325"
        },
        {
            "content": "I have only seen two episodes of this anime. Here's the story of how I got into this anime and why I decided to drop it. \r\nI first got into this anime after hearing that it makes a lot of anime references. I thought, \"This could be fun!\" and had fun watching the first episode. Then, I get to episode two and there was a particular scene I did not approve of. \r\nHere's what happens, Nyaruko, the female protagonist runs into an old enemy of hers (who's name I can't remember) whom she hasn't seen in quite a while. Just when Nyaruko is ready tofight her, she unexpectedly confesses that she has a very large sexual crush on Nyaruko. She ties her up to her bed and start's kissing Nyaruko's crotch while she is screaming at her to stop. In other words, it's a rape scene.\\n\\n\r\nPersonally, I get really annoyed whenever I see rape in anime, not only because I think it will put a bad influence on whoever watches it, but also because, to me, rape is seriously the worst possible thing you could do to a person, even worse than killing. If you are killed by someone, then unless ghosts are real, you only have that pain (physical and emotional) for a little bit. If you are raped, i.e. forced to be touched and kiss by someone you don't like, you are walking around with that pain for the rest of your life. Somehow, the Japanese find suffering like this to be entertaining, and I cannot understand why.\\n\\n\r\nI get especially annoyed whenever I see homosexual rape in anime, like this one. It has been mythologized for a very long time in western culture (I do not know if it's the same in Japanese culture. If someone can clarify that for me, it would be very much appreciated.) that gay people are rapists. All they live for is to have sex with people of their gender, even if that person isn't queer. Whenever I see rape in anime between two boys or two girls, that's the first thing that comes to mind, which is why I can't stand most yaoi like Junjou Romantica.",
            "date": "2016-06-06T18:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 220167,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5253211.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TanakaRiza",
                "username": "TanakaRiza"
            },
            "url": "https://myanimelist.net/reviews.php?id=220167"
        },
        {
            "content": "You can't float a show on one enjoyable character. \r\nWhat little 'story' you get is poorly tied together and constantly excused as being nothing more than a gag.\r\nIt's just worthless otakubait.",
            "date": "2014-09-11T18:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 159963,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BobathonSaget",
                "username": "BobathonSaget"
            },
            "url": "https://myanimelist.net/reviews.php?id=159963"
        },
        {
            "content": "Honestly i just don't like Mahiro Yasaka. I like the story, art, and everything except the boy (Mahiro Yasaka) the character ruined the anime for me. just my opinion. I kept trying to watch the rest of this but i just could'nt...This is the first time a character actually made me dislike parts of an  anime.... but it's just i don't like 1 character that's all. I don't completly dislike the anime iteself but only 1  aspect of it. but i'll decide to drop it just because of that. The characters are the main parts of anime for me. I get really connectedwith the characters of all the animes i've watched. I can't just connect with one that i completley dislike.",
            "date": "2018-10-27T17:33:00+00:00",
            "helpful_count": 0,
            "mal_id": 292789,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EffectorPlayz",
                "username": "EffectorPlayz"
            },
            "url": "https://myanimelist.net/reviews.php?id=292789"
        },
        {
            "content": "Usually i'm a sucker for parody anime but this has got to be one of the worst parody series i've watched simply because when i watch a Parody series i expect a Parody series every parody each second but good grief i haven't seen one ounce of parody from a series whatsoever\r\n    The anime takes place in a world where deities of the Cthulhu Mythos are secretly wreaking havoc on Earth, often having their horrifying appearance and demeanor replaced by that of a cute teenage girl... or boy. After the titular Nyarlathotep arrives on Earth to save Mahiro from a sudden alienattack, she chooses to stay at his house after deciding that she loves him. This, of course, confuses our dear protagonist and gives precedence to his tsundere behavior and the worst thing is Mahiro is just a straight up cunt and he's one of the reasons i've dropped the series\\n\r\n    The animation is the only redeeming quality of this anime the animation studio is done by Xebec who have done series like To-Love-Ru, Shaman King, Keijo, Maken-ki etc\\n\r\n    The ost isn't as bad but at the same time it's not exactly humorous so it's average\\n\r\n    Now for the characters oh jeez usually character development for me is essential for me to like a series but this series has one of the shittest character developments i've seen Mahiro beats Nyaruko for no fucking reason and Hasuta developed some series for Mahiro i thought nah screw this i'm out and from there i dropped the series simply because i just can't get into the series\\n\\n\\n\r\nSo yeah this series gets a 4 and i personally don't recommend it there's so many better parody series out there and this series will piss you off",
            "date": "2017-09-16T05:06:00+00:00",
            "helpful_count": 0,
            "mal_id": 257651,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6136789.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheRogueStudent",
                "username": "TheRogueStudent"
            },
            "url": "https://myanimelist.net/reviews.php?id=257651"
        },
        {
            "content": "First off let me that since this is partly a parody anime you'll lose a lot the enjoyment if you have no idea what anime they are referencing (although they use some pretty popular ones so most anime fans should be fine).\r\nStory:\r\nThe story for this show is mediocre at best and completely nonsensical but that is part of the fun. The plot is not deep and even when the show seems to be getting serious it is just setting itself up for more gags. But it does have at least a few serious moments especially between Mahiro and Nyaruko. \r\nCharacters:\r\nThis is the driving force ofthis series. The plot is just an excuse to get the characters in situations but it is what the characters do within these situations that make the show fun. You never really know if they are going to parody another show, do their own thing, or actually act serious for a bit.\\n\\n\r\nSound:\\n\\n\r\nPersonally I loved the opening song. But besides that some of the in show music (like whenever the world shifts red) are fairly good although not really anything original.\\n\\n\r\nOverall:\\n\\n\r\nThis show is not serious but it was not meant to be. Personally I had a lot of fun watching it and I'm sad that it has ended.\\n\\n\\n\\n",
            "date": "2012-07-08T07:42:00+00:00",
            "helpful_count": 0,
            "mal_id": 65693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237207.jpg",
                "scores": {
                    "animation": 0,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Metazoxan_Dexal",
                "username": "Metazoxan_Dexal"
            },
            "url": "https://myanimelist.net/reviews.php?id=65693"
        },
        {
            "content": "I'm currently on episode 8 so far, however I feel I need to state my opinion of the show thus far. This may be updated in the future, but for the most part many of my opinions of the show are unlikely to change. \r\nStating Haiyore! Nyaruko-san, I had fun with the non-serious tone of the show and much of that has held throughout thus far. However the show has a few glaring problems that even casual watchers will have a tough time avoiding. For starters the protagonist, Mahiro Yasaka, is the most unlikable main character out of any anime I have ever watched. Hemakes generic ecchi protagonists look like Romeo and Einstein rolled into one. Not only is Mahiro stupid in every manner possible, he's also an ungrateful cretin who constantly complains about his life, he pushes his problems onto other people, can't solve any simple social situation himself unless it involves beating on a girl. Not to mention he has the shortest memory imaginable as he seems clueless to the intent of other characters which have been stated by said characters no less than 1 minute ago in the episode IN FRONT OF HIM. Throughout 8 episodes he has had no character development, however let's try to focus on the rest of the cast. Don't expect anything, just your typical bunch of archetypes, in comparison I like the rest of the them a lot more than the protagonist no matter the flaws they seem to have. For the most part I like Nyaruko, however her blind affection toward Mahiro start to wear thin after a few episodes. Also I'm not lying about Mahiro, at one point  he's threatened that he will become a gay sex slave and at this point I was cheering for it to happen, unfortunately for the show and its characters that plan didn't fall through. \\n\\n\r\nMoving onto the story... I don't review very often and even I can predict the majority of the plot twists and who's going to be involved in the development. Honestly this isn't a show you watch for the story, but even then the writing is absolutely attrocious. The sound and art are average with no glaring issues. \\n\\n\r\nIf you decide to watch this show, turn your brain off, expect the obvious and just try to enjoy the show for what it is. Otherwise don't bother.\\n\r\nAlso Mahiro is worst MC.",
            "date": "2016-07-17T20:19:00+00:00",
            "helpful_count": 0,
            "mal_id": 224297,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/373754.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Roy57on",
                "username": "Roy57on"
            },
            "url": "https://myanimelist.net/reviews.php?id=224297"
        }
    ]
]