[
    [
        {
            "content": "MOD EDIT: *The review contains spoilers*\r\nThere’s a reason why average amount of anime audiences tend to choose, common, less-risky and visually appealing type of show for their seasonal line-ups rather than the irregular one, because sometimes you’ll get something like Kokkoku: Weird, Slow, and simply put a fucking waste of time. The anime really doesn’t deserve more attention it needed to be.\r\nThat doesn’t to say this is kind of stuff that is hard to get into. In fact the anime has pretty straightforward idea: it got superpower, it got alternate world and it got basic tales of good and evil where the good guy tryingto save families whilst try escaping from said world. In all, the basic concept of the anime is quite alright, the execution however is where causing the major problem.\\n\\n\r\nFirst of all. When I said “weird” that doesn’t meant to say the plot was convoluted or full of disgusting phenomenon (although it does at some point because the visual style). It just the many poorly written even that happen during the show; perverted jokes happen ruining the serious event many times; character changing sides because they want to; valuable item founded in unjustifiable way; the inconsistencies of the world where the good guy sometimes running, sometimes walking when chased by the bad guy, and don’t forget the ED video where it is show lots of skins of female characters. What’s that all about? The journey to say the least is a weird experience that raising “wtf?” during the critical moment. The show also likes to teases the audiences with a cliffhanger at the end of the episode only to show that there is nothing dangerous later on. If it have occurred once, it is tolerable, but when happens many times, it is simply become not exciting anymore. Most of the insult comes from the conclusion, which is anticlimactic to say the least where the bad guy gets second chance despite how much people does he sacrificed. Random revelation of the mastermind, and pulling deus ex machina in the end.\\n\\n\r\nToo many things, the superpower stuff also done poorly. There is no limitation or risk whatsoever for the superpower from the heroes but there are weaknesses on the villain. I know it is understandable to create weaknesses onto the villains because otherwise there’s possibility of pulling an aspull in order to defeat it, but making the heroes overpowering the villain is not right as well, because there is not much tension going on especially when you have unlimited teleportation power. There is lots of cliché, breaking the rule event, such as superpower revealed whenever the author want it to be or  when the heroes’ power becomes stronger even though it was said many times that he had already at his limits, just because the protagonist cheered them up.\\n\\n\r\nThe second problem is the alternative world itself or called “Stasis” in this show. I can’t recall any anime that surrounding quantum break or time stops world other than Kokkoku in recent year. But even in this novelty, there nothing much it can helps. They try info dumping the world along the way, but the end what we learn is: a) if you try to kill the people who cannot move within the world of Stasis you’ll be ‘punished’ by the ‘Herald’ and b) The Herald is actually the deceased of the previous Stasis user who are not strong enough or defeated. Other than that, everything else is just the same, literally there’s nothing special about this world. \\n\\n\r\nThere are also no consequences or relation between Stasis and the real world, making it somewhat of a riddle as to why the show makes use of such setting in the first place. You could replace the setting to something like closed room with many daily life’s supplies like Danganronpa, where it also had someone punished you if you breaking the rule and there not much differences. \\n\\n\r\nBy appearances the world is also offer nothing visually appealing since it is the same as the real world. Only the difference is that everything is stopped. As a whole, the show does not deliver anything in the way of a particular outlook on the world, a concept that resonates in everything that happens or a focus on the role of the Herald in the world and the show: while the creators could have had the series be focused far more strongly on the notion that the Herald are really everywhere, living a shadow-existence without all that much interacting with the human world, perhaps there would have been something more of a point to the stories, even if that point wouldn't be all that interesting. As it stands, there is no real point or purpose to the show.  \\n\\n\r\nThe third issue is the pacing which is horrendously slow. It literally takes the entire series for the heroes to be finally backed into the real world. Most of the time it was devoted to chasing, running, teleporting, pushing bad guy back to reality, showing a bit of their backgrounds and some info dumping about the stasis which could be summarized of what I said above. There are so many unnecessary events occurs and the actual content of the show is actually quite shorter than it was presented.\\n\\n\r\nThe Whole stuff about family were not works too since the shows are too busy about planning strategy and info dumping so there’s not enough time to bonds these characters considering the length of the series. It was been established that they are families but practically the cast had not much differences than the typical survival-death type of series when stranger became friends just because they share the same goals. \\n\\n\r\nAlthough there are character’s backdrops. They are quite meaningless in regard to their characterization, it doesn’t serve anything aside from as to why they are could be able living in Stasis. Even in content, the backdrops are just ‘good ol tragic’ backstory that we have already seen uptent time. \\n\\n\r\nThe villain motivation was okay I guess but it was definitely ‘weird’ to say the least, because it surely raises the question as to why are they feel the need to be kills someone. For appearances, they are very lacking in charisma. The characters in general weren’t deep and very clearly black and white. They are pretty much closer to being plot devices as an exposition tools because they did plan and talked a lot but don’t have anything besides that. If I have to give this show credit for anything, they did a good job at making Takafumi easy to hate. (Because clearly, the man is a douche).\\n\\n\r\nAt the end of the day as much as Kokkoku’s novelty in doing time-stops world concept. It didn’t manage to make up itself to be memorable series. Nobody’s going to talk about its plot. Nobody’s going to remember its visual and nobody’s going to care about its characters. What they will care about is the OP song which is probably the catchiest in this season. Overall, it is more interesting for the ideas brewing under the surface than it is for anything that actually transpires.\\n\\n\r\nAvoid it.\\n",
            "date": "2018-03-25T15:02:00+00:00",
            "helpful_count": 109,
            "mal_id": 275057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3365201.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DannyTheDonkey",
                "username": "DannyTheDonkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=275057"
        },
        {
            "content": "Kokkoku is an ambitious failure. It fails to understand the limits of its budget and writing, taking on far more than it could possibly handle. Its story is idiotic and illogical, the art is ugly as sin, the characters are frustrating as hell, and its glacial pacing makes it one of the most boring 'thrillers' I have ever seen.\r\nIt juggles many intruiging ideas like stopping time, a dysfunctional family, psychic powers, and many more, but Kokkoku wastes them on mediocre execution. \r\nThe dysfunctional Yukawa family comprises the main characters; an unusual choice for the cast that piqued my interest. It would be an understatement tosay they don’t get along with one another. They hit, yell at, and curse at each other. The main character and older sister in the family Juri is the most put together of them all. In the first episode, we’re introduced to Juri's NEET older brother Tsubasa, slob father Takafumi, her nephew Makoto, and wise grandfather. She’s usually the one who has to take care of things like picking Makoto up from school, making dinner, and taking care of the family while her sister goes to work. It's understandable why Juri's searching jobs to move out, but sadly she has yet to be accepted after many interviews. Her living situation is well detailed early on and gave me enough to want to see her family grow and change, hopefully becoming tolerable enough for her to happily live with them. \\n\\n\r\nWhat better of a catalyst to kick off all of their character arcs than a kidnapping? An unbelievable tragedy that happens to two of the family members, but I was intrigued how Kokkoku would answer why this would happen to such a mundane family. Little did I know, there wouldn’t be any logical answers for the many questions that are continuously piled on top of one another all the way into the final episode. After the two are kidnapped, the family receives an impossible ransom request and are unable to ask the police for help. \\n\\n\r\nKnowing they would have to take matters into their own hands, Juri’s grandfather reveals his magical time freezing rock, hoping that they can use it save their family members. The rock gets only one partial explanation at the end that handwaves away any need for logic and chalks it up to ’it just works that way’. This is only the first of many gripes I have with the woefully underdeveloped sci-fi setting and spotty world logic that plagues Kokkoku at every turn. \\n\\n\r\nJuri, her father, and grandfather enter the frozen time world of Stasis. Once entering, the three of them find it won’t be as easy as they thought to retrieve their stolen family. They would go on to fight against the evil criminal group responsible for the kidnapping who also somehow accessed stasis and entered it at the very same moment as the Yukawa’s… Um… What? How? These plot issues crop up everywhere while watching Kokkoku, and the show doesn’t even acknowledge them.\\n\\n\r\nRepeatedly it bends our suspension of disbelief, with no care if it breaks or not. The ridiculous setup at least quickly introduces us to the leader of the group and cruel antagonist Sagawa. Coincidentally, the criminal group is looking for the magical time freezing rock so they can use it to commit crimes and what-not. \\n\\n\r\nStasis is a very intriguing idea that thankfully does get some moral exploration, but from a logical perspective, Kokkoku rarely makes an effort to be more than nonsensical. When a story wants to be mature and realistic it cannot have such glaring plot issues. It's so difficult to be immersed in this anime when the story is so unbelievable, no matter how maturely it presents itself.\\n\\n\r\nIn spite of this, the show offers up some intruiging moral implications. The grandfather states how this world can lead to people losing all sense of morality while they know there isn’t any consequence. It’s a thought-provoking moral quandary to put forward right away; what would you do if you had this power? Adding to the moral intrigue are the giant tree-like monsters known as Heralds. These frightening creatures enforce the rules of Stasis by brutally killing anyone who dares to break them, namely no killing allowed.\\n\r\nSadly we don't get much more in terms of moral intrigue until the end, instead, the show tries to distract us with a shallow but occasionally entertaining mystery.\\n\\n\r\nPlagued with horribly inconsistent pacing, the mystery story becomes nearly impossible to get engaged with. Most of the show takes place in Stasis, spent following the Yukawa family as they plan what there next move will be to save their family and escape. I'm not saying I dislike thrillers with a strategic side to them, but here it feels like Kokkoku is stalling for time. Even the backstories and explanation conversations that fill up much of the screentime have barely any relevance to the story in the long run.  \\n\\n\r\nFrequently we're forced to watch the characters discuss random backstories, shallow world explanations, and pointless strategy discussions; all of this presented as crucial information. After watching all twelve episodes I can tell you with certainty, those scenes are just filler.  Almost nothing that happens in Kokkoku actually matters, it is just a collection of speed bumps only existing to stall for time. Trying it’s best to distract you from how poorly written the story and characters are.\\n\\n\r\nAs a mystery, it’s moderately successful at keeping you guessing, but sadly it’s deeply flawed story isn’t good enough to justify the many cliffhangers we’re left with. Let alone provide us with even a single satisfying payoff. Hell, the word satisfying would only come to my mind in one scene of the show. The final shot episode twelve ends with is technically satisfying, but at that moment the show also reached its peak in disappointment because instead of giving us even one answer for any of its intriguing twist it simply ends. That’s it. Kokkoku spits in its audience’s face and says ’you got what you came for, now leave’. \\n\\n\r\nMaybe if the characters were better I could have gone a little bit easier on the terrible story. The idea of a dysfunctional family being forced to put aside their differences in the face of grave danger is cool, it was easy to connect with their arguments. But my problem is that there is nothing to them beyond those frustrating fights and annoying personalities.  \\n\\n\r\nJuri is likable in how strong-willed she is, but there’s really nothing else to her than a strong-willed woman who wants to protect her family. She's a likable character for these traits but lacked the characterization beyond surface level information. The rest of them are just annoying. Makoto nags about wanting things because ‘he’s a kid and doesn’t know what’s going on’ only existing as a plot device to be kidnapped and add stakes (which works but is a cheap trick). Takafumi stays a stupid slob for the entire show, never changing, only adding frustration. At least Tsubasa's character had major growth thanks to the low point in life he started on, sadly we don’t see much of him in the show diminishing the impact of his arc. And the grandfather’s only purpose is to be the wise old guy, is a lame excuse to get some random family involved in Stasis.  \\n\\n\r\nWe occasionally see the characters tested by the events that occur throughout the show, but that often felt like the writer shifting them around to keep the plot moving when considering how little (if at all) they change. They start as a dysfunctional family and for all, we know they still are one after the show ends.\\n\\n\r\nThere is one definitive change made to some of the Yukawa family members throughout the show, some of them get psychic powers while in Stasis. As if pulled out of thin air, for unexplained reasons certain characters have abilities like teleportation and sending people out of Stasis. These powers seem like little more than plot contrivances added so the Yukawa's can get out of dangerous run-ins with the crime group. \\n\\n\r\nThe menacing villain at first made up for the family's overall annoyances; that is until he got a development episode which just boils his mysterious presence down to a pretty pointless and irrelevant explanation. I really couldn't figure out what the point was to him getting an extensive backstory when all it did was take was extinguish his intimidation and replace it with an interesting but ultimately irrelevant story. His story is meant to explain why he’s so evil and wants to kill people, but it feels like they forgot that important part of his character because it is in no way referred to in his story. You’re really going to tell me he just started killing because his childhood was a little different than everyone else’s? Why not Kokkoku, it’s not like I believed anything you were selling me this far into your shitshow of a story anyways. The issues don’t end here with the characters, both art and sound have their own problems too. \\n\\n\r\nThe newly founded Geno Studio gets off to a rough start with Kokkoku; which is worrying considering they’re at the helm of the much anticipated Golden Kamuy adaptation. Environments are made of dull colors and lack much personality. They were likely aiming to create a believable world, and they did, but the issue is how unappealing it is to look at. Perhaps if there were details added to the environment (ie: visual symbolism) it wouldn't feel tiresome to look at the thing.\\n\r\nCharacters look decent but in the later episodes, they frequently look off model. At its worst we see them warped with just plain ugly looking faces. These flaws are so surprising in a show that does not require much animation, it takes place in a frozen world and most of the screen time is dedicated to conversations explaining what’s going on and planning what to do next. It’s hard to take a character seriously when their face looks like a potato.\\n\\n\r\nMost of the voice acting is suitably grating on the ears to fit the annoying characters. Juri is well voiced thankfully, a decent reprieve from the others. The opening song Flashback is fun, frantic, and wild. The song is unlike any this season, one of the best. The op’s visuals of it are great too, even changing slightly with the show's progression. \\n\r\nThe ed is trash. It’s full of fanservice of the two lead female characters (the only female characters in the show) which doesn’t send a good message. Any tension from the cliffhangers is totally drained by this tone-deaf ed. I’m not sure if Geno Studio had a fanservice quota to meet (because the show is thankfully devoid of it) or if this was some misguided creative decision, but it does not fit this anime.\\n\\n\r\nScore Breakdown:\\n\r\n[Story: 3/10] Poorly paced, illogical, unbelievable.\\n\r\n[Character: 4/10] Unlikable, uninteresting, little to no development.\\n\r\n[Art: 4/10] Passable at best, ugly at worst.\\n\r\n[Sound: 5.5/10] Great op, mediocre sound effects, weak voice work.\\n\r\n[Enjoyment: 5/10] Glacial pacing hampers excitement.\\n\\n\r\n[Overall: 4.3/10]\\n\r\nKokkoku has lots of ideas, but it has no clue what to do with them. You’d expect it to make something of all of its pieces, but then it just ends. A collection of intriguing but mediocre parts doesn’t culminate into a good whole. It’s as boring and mediocre as it could possibly be. Just skip it and listen to the op instead.",
            "date": "2018-03-25T12:35:00+00:00",
            "helpful_count": 47,
            "mal_id": 275036,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=275036"
        },
        {
            "content": "Let the time... STOP. \r\nYou are now stuck in a world where everything is frozen, except you. What now?\r\nThat's basically what Kokkoku is about, Juri and her group is stuck in the \"Statis\" along with the bad guys of course.\r\nReview will contain minor spoilers, I guess.\r\nKokkoku started out as an interesting anime, interesting premise. Why are they stuck in the Statis? What is that world? And what is that huge creature shown in the OP (or the ending of the first episode?)\r\nMany questions, some answered, some not, but meanwhile- The bad guys are taking place. Well, they want to research this statis, so they're bad.Oh and they kill people too because why not.\\n\\n\r\nThe \"bad\" people REALLY weren't fleshed out at all, they felt like some random background characters, which maybe was true to classify them as background.\\n\\n\r\nKokkoku went from a mystery thriller anime of trying to unveil the mysteries of the Statis to.... Let's all fight the bad guy boss!\\n\\n\r\nWell that sounds familiar right? Many anime and stories in general have this, which is fine. But it was nothing like what the premise showed, the start didn't make me think it'll be just going full force forward into the enemy. Oh and just you wait until you see his foolish backstory. It's better you don't know it though.\\n\\n\r\nOn the other hand, what I think was nice to see is the strong female lead. Juri, and later on Majima were a nice change of pace. Strong, determined, you don't see that in anime every day.\\n\\n\r\nBut... While many remained in the background, those who didn't remain in the background were... lacking.\\n\\n\r\nTakafumi (dad) was always annoying and brought nothing except problems. I can deal with that, as they somewhat tried to make it funny. Well.. It didn't work.\\n\\n\r\nThe NEET brother was more on the side, but he didn't contribute anything too.\\n\\n\r\nMakoto, the kid, was always the \"prince\"/\"princess\" of this show (aka PROTECT THE PRESIDENT), but oh btw he's also pretty strong it seems, because why not.\\n\\n\r\nNow to the more main characters, It was nice seeing Grandpa in action, reminds me of Inuyashiki. But what was... weird? Is that he knew of this Statis from his father and yet never questioned it. So he was pretty clueless, except some useful abilities (ex: Aegis to prevent being thrown out) and teleport. But that's all there is to him. He's just there to save Juri whenever she needs to get out.\\n\\n\r\nMajima... Gets some spotlight, she wants to protect/save her family, and she's a bit familiar with the Statis, Well I guess that works.\\n\\n\r\nOh also I want to mention, the OP and ED are top tier.\\n\\n\r\nSo... Did I enjoy Kokkoku? Kinda, I can also say that it's better to binge. Would I go out of my way to recommend it to others? Probably not.\\n\\n\r\nIt was really good at the beginning, but... failed and fell. Trainwreck. One weird thing after another. And yes that includes the bad guy's back story.\\n\r\nAt the beginning every episode went so fast as I enjoyed it, I thought it would be close to AOTS (well after SoraYori), but nah, too many \"fillers\" if I can call it that. \\n\\n\r\nDisappointment, yet still a honorable mention for the good first half.",
            "date": "2018-03-25T09:05:00+00:00",
            "helpful_count": 31,
            "mal_id": 275006,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262007.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dadnaya",
                "username": "dadnaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=275006"
        },
        {
            "content": "Back in time, when I was wandering around at the anime list of what were about to air in Winter Season, there were an specific anime I got attracted to: Kokkoku, the PV, the art and the synopsis looked great and quite different from what we normaly watch. But is it being different what makes an anime good? Not in this case. This review might be heavy on spoilers.\r\nFrom my life time, I always wanted to stop time and do whatever I want, be it kissing girls, trying to finish my homework, trying to have more time at certain stuff, things like that. And whenI saw that this anime had this \"time stop\" theme on it, I wanted to check out what was it about and the logic behind it. And when I watched it, I have thoughts of being an Inuyashiki again, meaning that it would disappoint and suck, yet there was something on it that was relieving on that sense, we were having some explanations about the logic behind it, and even if some things were quite convenient, it had something that make me think: \"Well this makes sense\". But in fact, things weren't that far to become retarded in no time.\\n\\n\r\nThe story goes around Juri, a Woman who one day got a call from kidnappers that kidnapped his brother and her nephew. Armed with a Knife (because reasons) she decides to go and set them free. Fortunately, Her grandfather stops her from doing a mistake. Here we are introduced to the \"Stone\" a Stone that is capable of stopping time. After some assurances, they decide to stop time. So, this is not your JoJo kind of Dio Stopping time, everything will stay still until they use the stone to go back after doing what they had to do. Unfortunately, when they reach the place were they have Juri's Brother and her Nephew, they found out that they aren't the only ones capable of moving while time is stopped, this is also where the \"herald\" appears, an omnipresent being that serves as an overseer of \"Statis\" (this is how the stopped world is called), this herald holds the power to instantly kill someone who is threatening the life of the \"Stopped\" (This is what the people that isn't moving is called) with a single blow of its hands. This is also the place were we see the grandpa using his teleport ability.\\n\\n\r\nThis pretty much sums up the introduction of Kokkoku, it was alright at this moment, but then, what went wrong?\\n\\n\r\nOn the first episodes, we are set on explaining how Statis works and how the abilities works. The abilities explanation is quite bullshit, as the grandpa just says that \"it happens spontaneously\", still the abilities aren't god tier. Grandpa's teleportation isn't accurate, and later on we are introduced to Juri's ability which is very practical for the situation she's in, her ability is to force someone out of statis as she touches the chest of whoever threatens her. I accepted the \"logic\" behind these abilities because they weren't good enough as an advantage against their enemies. We are introduced to another abilities later on in the anime, which I won't go into much detail to avoid spoilers (Potential spoilers for the end of the anime)\\n\\n\r\nThen, we come to the heralds explanation. Oh boy, the Heralds were the thing that most sense had in this anime, the effort put into its explanation was noticeable. Apparently, when someone enters in Statis without concern and starts freaking out because they are weak of mind, the \"jelly\" of their body starts leaving it, transforming them into Heralds (In this anime, your \"Jelly\" is what maintains you in Statis). But then, the anime starts destroying its explanations attempting to do a more \"complex\" story and this is were Kokkoku throws everything they have done to shit. This anime suffered from a lot of twists on the main plot: it goes from saving your family from kidnappers, to fanatical people of the \"stone\" trying to claim what's theirs, to a \"Villain\" transforming into Hulk, to a \"Villain\" that wanted to stay in statis and \"see the future\" by himself, to a Evangelion kind of psycho shit. The amount of bullshit and plot conveniences thrown at your face starts increasing by a lot. And boy, it doesn't work.\\n\\n\r\nIt saddens me that they spent a lot of time trying to explain what Statis is and how Heralds works just to make it go full retard in no time. The main antagonist of this series tried to make himself a \"conscious\" herald with powers that exceeds humans. As I said before, this is supposed to make him live in statis to witness what the future holds, I mean, if he wanted to do that, why would he need to do a lot of killing in order to do that? As easy as he can go by himself and explain statis to Juri's family and see if he can borrow their stone for scientific purposes instead of threatening the lives of innocent people. But well, the anime decided to go for the most \"complex\" and ludicrous way in order to do that, which obviously backfired.\\n\\n\r\nAfter the appearance of \"The Hulk\" this anime went downhill pretty fast as more and more bullshit were thrown at the screen because the plot demands it. This anime had the potential to be as good and interesting as Steins;Gate, but it went full retard like Inuyashiki. Hell, there's even an ability shown later in the anime that consists of CONTROLLING HERALDS as if they were pets LMFAO.\\n\\n\r\nProbably, the only good thing about this anime is the Opening, which is very unique, there is nothing else left to speak on over the Art and Sound department.\\n\\n\r\nEnjoyment 6/10: Even if things went retard, I must say that this anime can keep you entertained as long as you disconnect your brain from your logic data base. \\n\\n\r\nOverall: 5/10",
            "date": "2018-03-25T12:38:00+00:00",
            "helpful_count": 16,
            "mal_id": 275037,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5202766.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HereticHunter",
                "username": "HereticHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=275037"
        },
        {
            "content": "A SERIOUSLY UNDERRATED AND DEEPLY MISUNDERSTOOD ANIME. \r\nI'm going to have to sucker punch you and give a simultaneously review of Stein's Gate and Kokkoku. Beware of the reviewer who said he was  disappointed by Kokkoku, after watching Stein Gate. Stein Gate's characters are all 1-dimensional caricatures, unlike Kokkoku's characters, almost all of whom, act like real human beings and hold conflicting emotions and desires which make them feel like 3-dimensional people. \r\nThe family we see kidnapped by a religious cult in Kokkoku feels like a real-life Japanese family. If you prefer funny, unpredictable, and absurd characters rather than realistic human beings, then Kokkokuis not for you. \\n\\n\r\nAnd if you want to laugh at how pathetic and silly the cast of characters are then Kokkoku is definitely not for you. Kokkoku's narrative psychologically compels you to empathize with all its characters no matter how villainous they are.\\n\\n\r\nAnother reviewer complained about the tonal shifts. Yes, Kokkoku has almost random tonal shifts that mostly stem from the behavior of one specific character: the pompous father who mistakenly believes in his own \"heroics\". Tonal shifts actually happen in real life, imagine you are drinking and laughing with your friends and all of a sudden you receive a phone call from a hospital saying that one of your relatives has been hospitalized. The tonal shifts in Kokkoku make the characters feel more realistic. I think any reviewer who complains about the tonal shifts, simply doesn't know what aspect of Kokkoku's story or characters that they really dislike and are just pointing out the show's most salient (obvious) qualities. \\n\\n\r\nComplaining about any anime's tonal shifts is like watching the transformer movies and complaining about the excessive number of explosions or the occassional racist scene while ignoring the movie series' awful and somewhat boring story. Beware of superficial observations masquerading as meaningful critiques. \\n\\n\r\nKokkoku's 2 biggest weaknesses are how it develops the personality and motivation of its cult leader and all the other members of the religious cult. Kokkoku's writer, Seita Horio, has clearly made no effort to actually research the motivations of people who join cults, and he shows a half-assed job at showing the consequences of inherting the position of cult leader. That's why I gave Kokkoku 7 instead of 10 for its charachers. But I'm probably being generous since I like the show's premise. \\n\\n\r\nWatch any documentary about religious cults, or read any book on the subject of religious cults, and you will see that people always join new cults for selfish reasons. The dymanics of Kokkoku's religious cult, \"the Genuine Love Society\" are absurd and simply impossible. The psychopathic behavior exhibited by the members of the Genuine Love Society toward the family harboring time control stones, contradicts their obviously benign goal of saving humanity. This contradiction is never explained and I think it should be explained because real human beings have real reasons, however illogical or irrational, for having conflicting motivations and desires. There is a logic to everything we do, even if that logic is impenetrable. \\n\\n\r\nThroughout the first 11 episodes, there is just no reason at all for the Genuine Love Society to harbor any hatred toward the family they eventually attack. I haven't read the manga so I cannot say if it takes a different approach to developing the religious cult in the manga.\\n\\n\r\nAnd the cult leader is just a hot mess of characterization. Unfortunately the writer, or maybe just the creators of the anime, genuinely believe the silly rationalizations the cult leader uses to justify his murderous and psythopathic tendencies. Religious cults are more than just a sexy storytelling tool... they are a serious social problem even in modern Japan. \\n\\n\r\nI expect the following season to be far worse because of the cult leader's characterization and back story, but so far so good.\\n",
            "date": "2018-03-22T05:31:00+00:00",
            "helpful_count": 10,
            "mal_id": 274521,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sageofagora",
                "username": "sageofagora"
            },
            "url": "https://myanimelist.net/reviews.php?id=274521"
        },
        {
            "content": "Why should you watch Kokkoku?\r\nStory is Outstanding (10). Kokkoku is one of those stories that you didn't know until it was adapted to anime form and even if it was it is usually got overshadowed by main stream or fan service anime. You can put this anime side by side with the likes of Kiseiju (Parasyte) and Elfen Lied mainly because the story. The premise of another world or dimension existing alongside our reality is something really interesting especially for me to dive into. The moment you watch the first episode, you will immediately get sucked into the stasis until the last episode. Believe mewhen I say you will feel autophobic when you watch this, so if you want to enjoy this anime I would definitely advise you to binge watch this alone in an isolated room.\\n\\n\r\nArt is Very Good (8). I could give it a 9 but it would be already biased on my side if I did. The art has a grungy feel in a good way that really sets the isophobic mood of the story. The direction they chose for the art of the opening and ending theme is superb and it contrast the vibe of the series with sharp vivid colors which I adore.\\n\\n\r\nSound is Outstanding (10). One of the greatest thing about this anime aside from its story is the soundtrack. Kokkoku has one of the best opening themes that I have heard in my entire anime life (Flashback\" by MIYAVI vs. KenKen). The mixture of electronic/disco music with the art I have mentioned a while ago is a perfect marriage of two great things. The Ending theme is also something not to be overlooked as it eases you through the ending of the episode with its melancholic tunes. Everything in between balances the overall presentation of the anime.\\n\\n\r\nCharacters are Great (9). Of course, you can't have a great story with dull characters. The main character Juri, and her family are well made and easily distinguishable from each other. I did not feel there are support characters in the story as everyone is give a chance to have their own moment. If there is one complain that I had while watching Kokkoku, it is that the main antagonist of the story (Junji Sagawa) lacked in the villainy department which affected my viewing of the story. He could have been more fleshed out and his character seemed a bit rushed in the anime. *I need to read the manga if they failed to adapt his character  correctly in the anime.\\n\\n\r\nOverall, Kokkoku is an experience you should try. If you are not into the mature psychological or supernatural genre I would greatly recommend you to watch it as a mild introduction to the genre. And if you are a hardcore fan of this genre I am dead sure that you would enjoy it!\\n\\n\r\n9.4 Jelly Fish out of 10.\\n\\n\r\n#Kokkoku #WinterAnimeRetrospectiveReview #AnimeMoments",
            "date": "2018-03-27T04:15:00+00:00",
            "helpful_count": 9,
            "mal_id": 275299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6582532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jmsjrdn",
                "username": "jmsjrdn"
            },
            "url": "https://myanimelist.net/reviews.php?id=275299"
        },
        {
            "content": "This is my first time writing a review, so I hope this can be helpful for at least one person.\r\nTo be completely fair, I am very aware that I probably have a dissident opinion regarding this anime. However, I think the other reviews paint this anime in particular in a bad light. I agree that the art is a bit clunky at times, the pacing is weird, to say the least, and the end is sort of tacked on. But all of that aside, I think that this is a great little anime to watch if you need something to tide you over between seasonsof your favorites anime. \\n\\n\r\nAt times, the connection between characters feels very thin, and it's a little hard to feel a connection to them, as the viewer. At other times, you may feel a deep connection to what the characters are trying to accomplish. \\n\\n\r\nThe story is fairly different, as compared to other anime that I've seen. Although I know for a fact that the premise of stopping time has been done before, I personally haven't seen it in an anime before. It is an interesting concept, however, and I'm glad this has explored it in the way that it has. \\n\\n\r\nOverall, I enjoyed it, despite the flaws, and the janky art style. also, don't get your shorts in a knot about the ED, it's fun and enjoyable.",
            "date": "2018-04-03T14:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 276729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6593564.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LandingZone",
                "username": "LandingZone"
            },
            "url": "https://myanimelist.net/reviews.php?id=276729"
        },
        {
            "content": "Kokkoku has ended today and I'm sad to see it go. It was a wonderful concept with a wonderful execution. This anime is about a 20 something year old girl of a poor family named Juri. One day, her nephew and brother get kidnapped and ransomed an amount of money they cannot pay. Fortunately, the family holds an ancient relic in the form of a stone that lets them enter a world called, \"Stasis\". Stasis is a place where time has stopped in the exact same moment the Stasis spell was activated, only allowing people who has activated the spell to move around in thisstopped time. The Juri along with her Grandfather and Father to save her captured family members. But are there are others in the stasis as well...\\n\\n\r\nThis show, I felt, did very well in the execution of this quite unique concept. The family is interesting to watch, and they're logic on what to do next is sound. It almost feels like they're real people. What they do is somewhat realistic to what reasonable, rational people would do. The art is pretty, especially using the time where they stopped time effectively. The entire show takes place at sunset and the lighting reflects that beautifully in my opinion. The animation is alright, no dips, but lots of still images. Although, that's to be expected, they're in stopped time after all. Also, the show does this thing where when a character throws an object it just stops moving halfway through. It helps you remember this is a place of stopped time. The OP and ED are some of the best this season especially with the OP being a a mish mash conglomerate of colors, subtext, and symbolism precluding to the show. With all this great things to say about this show, the main, overbearing issue that I have with this show is the ending. The resolution came from an ex machina which I utterly hate. Although, this doesn't stop Kokkoku from being a great show. I give it a 9 out of 10, with a recommendation for everyone to watch. This has been your spoiler free but not really review on Kokkoku",
            "date": "2018-03-25T20:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 275098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=275098"
        },
        {
            "content": "This is my first review ever, and its because i absolutely enjoyed this anime. it's currently airing but i am very sure it won't be disappointing.\r\nStory 7/10\r\nThe story feels new and fresh, i'm saying this because any one who's into animes knows the usual alternate universe or another world has been used up alot, but kokkoku finds a way to make it feel new, although Juri has failed a lot of interviews, her brother is a NEET, her sister is a single parent and her dad was laid off, this dysfunctional family is struggling on the outside and they are at the bottom of thefood chain but they have a tremendous power which the grandfather knew all along but kept it hidden. It makes you wonder why the grandfather never thought of doing things for their own benefit.....then he had to reveal the secret to protect his family because Makoto and Tsubasa got kidnapped by a mysterious organisation.  \\n\r\nI'll say i like the dysfunctional family angle we don't see that often, it makes you compare this situation to real life issues.\\n\\n\r\nArt 8/10\\n\r\nI totally loved the art style, its beautiful and even more intriguing when characters enter the stasis. the effect of the frozen time on the character is well done. The CG on every single life form on stasis was well thought, the trees, bicycle even the water at that point frozen in time. This blows your mind.\\n\\n\r\nSound 8/10\\n\r\nNothing much to say here. The opening theme is catchy, i have never tried to skip it, it sticks in your mind for a long time. The ending theme was good too.\\n\\n\r\nCharacter 7/10\\n\r\nSo far a remarkable job has been done in expressing each character, Juri is determined to rescue her family, her edgy character to push through obstacles shows shes not willing to go down without a fight, Her grandfather on the other-hand is wise but logical, her father so far is weak but looks like he has a scary side to him, i like the way its been expressed, not rushed, you get a feel of each character including the protagonist.\\n\\n\r\nEnjoyment 8/10\\n\r\nKokkoku is a show that is slowly intriguing, it doesn't hit you like a bang, but you find yourself wondering what would happen? The story is not so different but the supernatural feel keeps your mind at work as you try to understand why events occur in different order. I hope you enjoy this.",
            "date": "2018-03-06T05:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 273175,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6169466.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Violapatra",
                "username": "Violapatra"
            },
            "url": "https://myanimelist.net/reviews.php?id=273175"
        },
        {
            "content": "I had never heard of Kokkoku when I watched the first episode, but I was hooked afterwards. Now, here at the end, I definitely enjoyed myself, but I can see it probably isn't for everybody.\r\nArt 3/5\r\nWell drawn, the action scenes do a good job of communicating the speed and impact of every action, and the cast are all distinctly designed without having to resort to goofy hats or anything. In fact, kudos to the animators for keeping the details of the time stop in mind when lots of small objects are flying or falling. However, it makes extensive use of CGI for several elements -personally, I think it blends well enough with the more traditional animation, but if you strongly dislike it in your anime, its going to annoy you frequently. \\n\\n\r\nSound 4/5\\n\r\nMuch like the animation, the sound effects do a great job of putting oomph behind the action scenes. Most of the music, when there is any, doesn't stand out too strongly, but I think \"Flashback\" is the best OP of the season - its a great song and the visuals accompanying it are really slick. Like a friend of mine said: \"You gotta respect someone who can turn 'punching a man's heart' into a beat drop.\"\\n\\n\r\nCharacter 3/5\\n\r\nI think Juri makes for a good main character. She's got some playfulness to her, but she's mostly a serious woman who gets stuff done. Like the show's description says, her response to the yakuza kidnapping her nephew is to grab a knife and get ready to cut some fools. As things progress, she shows little hesitation in getting things done when push comes to shove, but its obvious the situation is wearing away at her and you wonder if she can hold on.\\n\r\nHer grandpa is cool, and is similarly willing to step up to the occasion in a crisis. The rest of the cast is kind of hit or miss; the brother and father wear on my nerves, and quite a few are just kind of there.\\n\\n\r\nStory 4/5\\n\r\nThe show starts off with a really interesting premise, that being the time stop spell. From episode 2 onwards, it expands on this premise is some interesting directions. Without spoiling anything, let's just say the spell has some rules and exceptions that play heavily into the advancement of the story, but don't feel broken or unnatural.\\n\r\nThat said, I feel like I need to dock points for the ending. Not that its bad -just that they REALLY needed another episode or two to smooth it out. It feels very abrupt.\\n\\n\r\nEnjoyment 4/5\\n\r\nKokkoku moves slowly (not because of the time stop, hur hur hur) but I enjoyed the ride all the same. The first episode made me want to see where it was going, each episode ended at the perfect cliffhanger to keep me interested, and in the last third, s*** gets crazy and I wanted to see how it would one-up itself.\\n\\n\r\nOverall 4/5\\n\r\nKokkoku feels unique and is a fun experience - the action scenes have some good brutality to them and some of the imagery is hilarious in how bonkers it is. Unfortunately, its pacing is definitely not for everyone and its story has some major rough edges.",
            "date": "2018-04-06T16:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 277153,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/440852.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/YarrickOE",
                "username": "YarrickOE"
            },
            "url": "https://myanimelist.net/reviews.php?id=277153"
        },
        {
            "content": "Kokkoku is an anime that kind of leans heavily on the high concept side of storytelling. While the translation for the title is “Moment by Moment”, I  believe that it’s better dubbed as “Moment” as everything takes place technically in one single moment. The reason why is because the  concept of the show is “ what if we had an action/thriller story, but almost everything occurred when time froze”. Of course the show has its twist and turns, the inciting point, the characters, the development, and every other minutiae that i’ll hopefully get to later. Still it's high concept is one of itsmain selling points of the show, and means to draw in viewers. However its concept can only get it so far, and without well thought out characters and plot all that’s left is the concept and it’s wasted potential. \\n\\n\r\nFamily dynamic\\n\\n\r\nOr maybe I should say the lack of? well, kind of. The main bulk of the cast of the show are the Yakawa family with Juri being the Heroine pf the story. Before the inciting point of the show happens the focus of the show is on Juri and the living situation that she and her family is in. While they are not living in the most dire of straits, they are not living the most comfortable life either. It’s during this time that you get a basic understanding of each person and their function in the family, and whether they are helping or hindering the family. This is all fine, however very little comes out of this. The most development to be had is just how each family member feels about each other, and they just roll with that, and not much really evolves for that. I’m fine if the family members don’t get along with each other, or that they have little redeemable qualities, but the problem is that they do nothing with it. Really the only characters that seemed to have some sort of dynamic going on for them is juri and her grandfather. It could easily be chalked up to the fact that they are the ones with the most screen time, but i don’t feel as that’s enough to discredit the fact that there was some sort of connection between them that really wasn’t there for the other family members.while their relationship may have been fine there’s still very little interesting character interactions between much of the cast which slowly unveils how lacking many of these characters are, with 2 specific characters being our prime example.\\n\\n\r\nThe Protagonist and Foil\\n\\n\r\nThe first one obviously being the Protagonist/Heroine of the show, Juri. As the proganist, she is the one that the viewer spends the most time with, and over time intimately learn many things about them that other characters don’t know and what we’ll never get from the other characters. Like most of her family she had the basics of her personality and backstory covered in the beginning. She is shown to be as sort of a headstrong women with a bit of sass, and it’s because of this she’s been having trouble getting employed. Add upon this her families living situational and it shows she’s not living the most happiest of life even feeling some contempt towards her family. However it’s also evident that she cares about her family since after the inciting point which was her brother and nephew being kidnap, she willing tries to go save them by herself with nothing more with a kitchen knife which does overlap with her headstrong personality.  All of this shows that she really isn’t that badly written of the character. The problem is that after the plot starts, any sense of development goes out the window, with the only thing left is more backstory for her. She still does a lot of things, and shows different emotions throughout the story, but none of them really help define her personality or give us a new side of her to examine. It’s just her regular personality placed in a different context each time. \\n\\n\r\nThe other character worth examining is Shoko whoi believe is to be the Foil to the protagonist, at least what they were presented to be. Both Shoko and Junji have several things that compare and contrast one another that makes them a foil for the other character. They both a some history with each other, they both entered Stasis in order to “save” their family, and they both wear opposing colors with Shoko wearing black leather and junji wearing White jacket thing. There’s little to go on since almost all the characters just have the basics and nothing more. The only reason these to are worth standing out is with the whole save their family plot happens for both of them. They do conflict initially, but it’s not like they are against each other on a personal level, and after they do team up there’s really no dynamic between them. Even worse is after shoko completes her plan she just becomes irrelevant to the entire story, and is just there for the ride with her becoming more of another support character than anything else. So when looking at all the characters I don’t think there bad, just underwritten.  Well except maybe one.\\n\\n\r\nThe Big Bad\\n\\n\r\nThe big bad of the story, junji, is really a character who’s appeal goes through a few ups and downs. Initially he was just a cultist leader whose only purpose in the show was to start and drive the plot. He came off as unassuming and kind of boring as he was just there for most of the show not doing much but giving commands to his henchmen. Of course he does change after a while figuratively and literally, and his intentions while given as exposition are more interesting than what would come from any other antagonist in his role.   However that goes to a waste as he becomes another generic and uninteresting characters via his actions. They do try to reconcile it with some backstory for him but it just comes of needlessly and just makes him more boring, \\n\\n\r\nWorld Building\\n\\n\r\nThe story for the show is rather uninteresting as stated previously that the antagonist was the main driver for the plot with the other characters just reacting to it. So out of everything that occured in the show one of the interesting parts of it was the stasis world. While not a world in it’s own right, it does still have it’s own set of rules that it goes by. The show never tries to go out of its way to explain how things work in stasis, as how it works is beyond the comprehension of the characters. Many things are better left unexplained like how they’re able to live in stasis, or what heralds or the jellyfishes really are. It gives the show a sense of mysticism and and need to explain it would ruin what it’s trying to present. They also do really interesting things in terms of animation when it comes to stasis, nothing really amazing but interesting enough that adds to the show. \\n\r\nByakugan\\n\r\nAnother thing worth noting in the story is a certain power that several characters have in the story. The reason i refer it as Byakugan is because the power is always associated with characters having full white eyes and the protagonists power in particular being very reminiscent of it. The powers take large leaps of suspension of disbelief as the show goes on. When it was first introduced it was tolerable much like the world they were in, it wasn’t really worth it do delve into what it was. However as the show when along and more people began also having powers did it feel like it was for the convenience of the plot and nothing much else.\\n\\n\r\nProduction value\\n\\n\r\nSeeing as this is Geno studios first work who are basically the studio that rise after manglobe ended, the production value was okay. The character designs were fine, the background art was fine for contemporary japan, they did some interesting things with the stasis visually. Still the colour gradient for the show was boring and any sort of distant shots of the characters just looked terrible. The animation was passable, but nothing worth noting. The heralds actually looked good in CG as they have off this animousy otherworldly appearance, but only when there standing still or move quickly because they look laughable when they move for a long period of time. the soundtrack for the show was fine, nothing really stood out outside of maybe one or two tracks.\\n\\n\r\nDespite how much of a mess it all came to be i still enjoyed parts of it. like the idea of the stasis world and i did become more interesting in the final episode, but it’s better left as a concept.some of the characters were fine and the family would be more interesting in another genre with another script. Overall i think the show is just fine where the pieces where underdeveloped, and are more interesting as pieces rather than as a whole.",
            "date": "2018-03-25T11:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 275027,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=275027"
        },
        {
            "content": "Here we go again, another one of those which you either love or hate. No in-between. \r\nWe've seen plenty of instances in the past in which anime series have utilized time-related concepts as their main plot device, and more often than not it may be confusing and over-complicate matters. Kokkoku, for me, is one of the better series to have handled the concept well. \r\nThe story basically sees all our characters enter the strange and mysterious world of \"Stasis\", which is a version of the real world stopped at a single moment in time. As usual, conflicts between two factions occur and everything starts happening.If you're already having trouble figuring out what \"Stasis\" actually is, trust me, you don't have to worry, because it really is a simple concept to understand, and they explain it fairly well. \\n\\n\r\nThe story and its execution is really what makes this show for me. Every episode reveals new bits of information or action, and ends with frustrating cliffhangers which just makes you wonder more, want more. As a result, the entire flow of the series was really solid and in no way episodic. Amidst all the seriousness, they also managed to add in humor at appropriate times which wouldn't turn the viewer off. The ending may have been somewhat predictable towards the end but I thought it was well done and, most importantly, it gave the entire case a good, simple closure. \\n\\n\r\nCompared to the story, however, everything else was just about decent. I felt the mature art style actually really fitted the show. Like, if there were beautiful or moe girls in this show I don't think it would be possible to take the plot seriously. In addition, the characters in the show were mostly grown adults, so naturally a more mature art style would be suitable for it. Music wise, I just want to point out that the ED and its animation is really good and you should check it out regardless. On to the characters, unfortunately we really got to know more about only three of them with regards to their backstories as such. However, I felt those three alone were enough to drive the story forward, and any extras would have thrown it off its track. \\n\\n\r\nOverall, I really enjoyed this series. They made use of one single concept to propel the plot forward right till the finish line, and they executed it well. If you're planning on finding a show to binge at one go, Kokkoku would be a suitable candidate for sure. \\n\\n\r\nFew years into the future, I may not be able to remember everything about this series. But what I would remember, was that this was truly a dark horse of the Winter 2018 season. I hope this review has done enough for you to give this a shot, and I hope you'll enjoy it as much as I did.",
            "date": "2018-04-01T19:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 276438,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3423567.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/henkuku",
                "username": "henkuku"
            },
            "url": "https://myanimelist.net/reviews.php?id=276438"
        },
        {
            "content": "I liked this anime a lot,\r\nIt was my favorite anime of the winter 2018 ongoing anime.\r\nThe art style was pretty nice and fit very good with this kind of story.\r\nThe characters where portrayed in a good matter.\r\nAt the start of the anime, you are kinda curious about what is going to happen.\r\nThen, it is starting to get interesting, and you want to see more.\r\nEventually you'll be hooked to this anime, since it has this certain vibe.\r\nThen you realize this anime is almost to its end, and you are starting to feel a little sad.\r\nThe story never got boring in my opinion, and was always veryinteresting.\\n\r\nThis was one of the few anime's that I think had a really good ending!!!\\n\r\nNormally when an anime ends, I feel a little sad and empty because it's over, but in this case I don't mind, because of the good ending.\\n\\n\r\nSome more story about the world itself could have been told in a spin-off, but that is very unlikely to happen.\\n\\n\r\nI would definitely recommend this anime.",
            "date": "2018-03-27T06:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 275316,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6126070.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BlaxadowFire",
                "username": "BlaxadowFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=275316"
        },
        {
            "content": "The story was actually really good until the brought the backstory of the Church into it. I was all about This dysfunctional family trying to get their kidnapped brother and grandson back from some bad guys, and in turn fight some people in this frozen timeline. Then things got weird, people turned into trees, people were being rescued from being trees, and a woman who we knew was very important in the very beginning doesn't show up the entire series until...spoiler alert...the last episode. This series took a nose dive after episode 6 and spiraled out of control once episode 10 aired.\r\nI really enjoyed theart and animation. Having things freeze to where they needed to be was pretty interesting. The character designs were really well done as well.\\n\\n\r\nThe op and ed were top tier. I was a-ok with the fanservice in the ed. I know most people were not but hell oh well.\\n\\n\r\nThe characters were interesting again up until a certain point. The family was funny at times and the chicks were pretty kick ass. Honestly if I got more fanservice out of Juri and Majima I would have ranked it higher.\\n\\n\r\nThe enjoyment was like a roller coaster. Some episodes I really enjoyed and others had me going \"Oh I guess that happened?\"\\n\\n\r\nOverall this anime had a lot of pluses and minuses. I think one of it's major flaws was trying to find see if it was an Action or Comedy anime. Seriously there were times with some pretty serious moments and things just got weird and you're sitting there like \"Did he really just ask to bang her?\"\\n\\n\r\nOh also the question of \"Well what happens when time is stopped in stasis and everyone is gone? Never gets answered. For the most part.",
            "date": "2018-03-25T19:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 275089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275089"
        },
        {
            "content": "With people started to like those skip the opening button just to get into the point of some anime, an anime made us realize that you should not skip the opening just to have that hype so you can stay and watch a mediocre yet predictable anime like this one. While having the source material have ended long before the adaptation as an advantage, Kokkoku, an anime adaptation of a manga created by Seita Horio, did not manage to steal many hearts to invest and drive themselves into the world of stasis.\r\nThe major flaw of Kokkoku lies in the very predictable and mediocre plot. Threeepisodes in and I already guessed how the ending will like. And... My prediction was not too far off. Even with this predictable plot, Kokkoku still did not manage to deliver their lore of the stones and the specters well and left me with lot of holes here and there. While I could not sense the rushy feeling inside this anime, I sensed that the timing of when they delivered the lore one by one was a bit off which kinda disappointing from my side.\\n\\n\r\nWhile the soundtrack of this anime fits its bargain by being eerily perfect for a show with the theme of hide and seek between good, bad, and something other than that, what I should underline from this anime's sound of course its opening. I just can't stop listen that opening. This opening alone is an example of how an opening should have done : hype up the show in the beginning so people will stay and watch the show. The opening alone could be a reason why I choose to stay and watch the whole show.\\n\\n\r\nTo be honest, I have listened Flashback back in 2017 when it just came out (with other songs from MIYAVI's Samurai Sessions Vol. 2) and already guessed that sooner or later his name will shine in the community. If you said that \"THIS OPENING IS MY JAM!\", I suggest that you should listen to MIYAVI's other tracks. It's all worth it. Trust me.\\n\\n\r\nWhile managed to sway me with MIYAVI's song as the opening, Kokkoku's story did not stand out very well and I will only say \"Okay, I let it slide.\" just because the opening managed to keep me stay and watch all of them.",
            "date": "2018-03-25T12:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 275031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5318995.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Its-Maki-kun",
                "username": "Its-Maki-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=275031"
        },
        {
            "content": "I would say, since Boku Dake Ga Inai Machi, this another time traveling or I should say heart Stopping anime is quite a pretty good anime for this season. I don't care if others don't like it but I'm sure you're gonna love it. It is a story about a family forced to stay inside a place where the time has stopped ticking (I'm not gonna spoil everything but I am sure you're gonna love this plot.) and they are being chased with a cult.The real plot here is not how are they gonna escape the conflict but how the conflict would shape them asa family.",
            "date": "2018-02-07T19:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 270994,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Koalas_InTheRain",
                "username": "Koalas_InTheRain"
            },
            "url": "https://myanimelist.net/reviews.php?id=270994"
        },
        {
            "content": "I only wanted to log this series into what I have run through, but seeing top reviews actually make this series out to be bad and not well written, I can't stand by without saying anything. \r\nLet's be frank, this series isn't something you can really like/love at first sight. It's a mess and it happens in like, what the hell? Only 1 moment? Almost a day? Not to mention loop holes in writing are all over the place. Many explanations don't meet up with what they were supposed to answer, it's like they are not even trying to explain anything to be with...... Evenart style, sound, aren't that outstanding. So, what's there to like it?\\n\\n\r\nSurprisingly, there is. Or in fact, there are. \\n\\n\r\nAs you can see in the synopsis, the main characters can somehow \"stop time\" and \"move around when time and everyone else just \"stop\". It's a fundamental setting for this series' plot and as funny/surprising yet so natural as it is, this setting was put into question right the moment it was introduced, then, and there. Although it was lightly brushed off explanations come much later to give us the idea of how it works. Pay attention, and you will like it.\\n\\n\r\nMoving on, story premises are all about reuniting family members. Yet, they keep running around to miss each other. Well yeah, that's how every story like this one go. But Kokkoku was different. They move around very much on their own, keep missing each other on their own. Very much like how it would be in reality where people do things how they see fit and end up making efforts of one another go to waste. For this one, it deserves points for the clever development method. \\n\\n\r\nAnd then characters. One thing you can notice almost right away is that they keep switching. I mean, come on, a neet goes outside on his own for his nephew, an oldman who got laid off start talking about stuff very sciency all of a sudden, and later on, characters switching sides like it was nothing...... What's with the inconsistency? It's like the characters don't even try to keep to their own settings except for 1 single core reason of existence in the whole 12 episodes. Yes, only 1 core reason of existence. For the main characters, it was to protect their family, for the shitty oldman, it was to look as cool as he can, to others, faith, money, stuff. \\n\r\nBut then, there was clearly 1 single character whose objectives changed over time. Then 1 more just lose their reason then picked up another right away. Then again, another who takes the middle ground with 1 core reason but somehow seems like it changed over time. \\n\r\nTheir actions are also hard to read. You can imagine parts of it, but you can not clearly predict it all, just like how you can't predict what others will do but can imagine it in real life. That's unlike many other series where intentions are clear for viewers/readers. It makes characters moving from inconsistent to lively, realistic, complicated and extremely 3D. They even keep their promises just as they talked about it too. \\n\\n\r\nAs I mentioned above, there are stuff left not explained in the story writing. But if you pay attention, you somehow see hints everywhere. From how bad the family situation is despite all the power, to who the heck was mentioned at the end. It was fun thinking how it connects and would make room for many theories. I wonder if MatPat on Film Theorists would want to pick some up (lol). \\n\\n\r\nFor a TLDR summary, Kokkoku is a complicated, very mundane and easy to misunderstand series. But if you go into it, you might like it, but you will still have to admit that it's not that good. Heh, talk about how life like this series is.",
            "date": "2018-12-15T09:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 295806,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Demundo",
                "username": "Demundo"
            },
            "url": "https://myanimelist.net/reviews.php?id=295806"
        },
        {
            "content": "Throw another one to the pile of “euh” anime. Kokkoku I think accurately gets across the feeling of getting a bus to go somewhere nice and then you miss your stop and get out in a place you don’t know and look pretty bad. What started out as an intriguing thriller that meshed the usual kidnapping scenario with supernatural elements turned out to be a weird supernatural drama that went all over the place instead of focusing what was good about it. \r\nI genuinely liked the beginning of it, first half of Kokkoku stood out to be as anime thriller done right. We kick offin a grounded setting with simple characters that should be easy enough to sympathize with or relate to for anyone with no shortage of empathy. Then something terrible happens and a family that was barely scraping by is put in a terrifying situation where their relatives are about to die unless they get a lot of money in unreasonably short amount of time. Spoiler: they have either and that prompts out main character Juri’s grumpy grandpa to whip out the ol’ time stop magic stone. When they use that to get to the meeting place they discover that they’re not the only ones walking around in the world of stasis. Unknown group set all this up to lure them out and get their hands on the magic stone. Juri and her grandpa get away but now the show is on as we know all the participants and the threat is established.\\n\\n\r\nThis constitutes for the huge chunk of my enjoyment of Kokkoku, it’s the usual story set in very unusual circumstances which forces things to change just enough to make me invested. As I said in Museum review, thrillers largely live on their execution and not the story and Kokkoku was largely amazing at it. Until bullshit starts happening and supernatural elements take over we’re watching two underdogs incapable of putting up a fight struggle against an overwhelming force in a stopped world rules of which they don’t yet know or understand.\\n\\n\r\nUnfortunately this doesn’t last long and as the show starts to indulge in its own world and characters as the stronger aspects of the show slowly but surely peter out. This wouldn’t have been such a bad thing if Kokkoku could support either of these directions but it can’t. \\n\\n\r\nFleshing out the mystical world doesn’t actually add anything to this story. There’s a reason a lot of shows don’t explain the supernatural as it’s a mysterious force that nobody understands but can serve as a valuable catalyst for something actually interesting. Kokkoku doesn’t agree with that and dumps a bunch of information about the entities within the stasis, their roles and origin while simultaneously leaving out so much that what we got doesn’t pain a full enough picture to enjoy looking at it.\\n\\n\r\nWhen it tries to focus on characters it doesn’t work either cause none of them are that complex, they don’t need to be. Once again, a thriller or a mystery show can survive of off the thrill and mystery. We don’t need a character study to enjoy something like Redline or Mononoke. Yet once again we take quite a few hikes off the main path to learn more about the past of people which won’t be playing that big of the role in the narrative. \\n\\n\r\nI still think there’s a bit of enjoyment to find in seeing the ideas author had for this setting but these ideas aren’t worth much in the big picture because of how sloppily they’re tied to everything else.\\n\\n\r\nThe ending is also a huge asspull that comes out of nowhere but at least the emotional payoff at the end was pretty sweet.\\n\\n\r\nOverall Kokkoku is just another show that can’t seem to understand its own identity as it keep going somewhere without knowing why and eventually stops to wave goodbye. Is it worth a watch? I don’t know, while it’s pretty easy to say that it doesn’t seem to success in doing anything it set out to do Kokkoku is still eccentric enough to stand out from other anime in an endearing way and as such I don’t regret my time with it a single bit.\\n\\n\r\nP.S. - If you’re not going to watch it I at least implore you to check out OP and ED, s’good.",
            "date": "2018-04-20T12:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 278575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063579.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gundroog",
                "username": "Gundroog"
            },
            "url": "https://myanimelist.net/reviews.php?id=278575"
        },
        {
            "content": "In a sense, this has been such an amazing experience. I'm glad to find some improvement in psychologicals nowadays since they've been overwhelmed with the fanservice-themed anime these days. However, don't worry, even if you're not a fan of psychological anime you'll still enjoy this in most cases.\r\nStory\r\nThe family enters Stasis in order to save a NEET and a little kid who were kidnapped on their way home. Stasis is like time travelling, but very detailed. Every thought about how it would be to leap through time? Well, I know I did and this anime incorporates it magnificently. What's even more amusing is the factthat they had such tight bounds to logic all-throughout the anime. They never used the common anime logic. No peculiar instances that only convenience the MC or anything alike. It's a fair fight with no villain or hero, just people with different interests that intervene with one another.\\n\\n\r\nFurthermore, it didn't feel anime themed at all. What I mean by that is the whole thing when they have a 5 minute tea break with the viillain discussing their interests out of the fight, promising not to let anyone die and all those Shounen bull. Instead, it feels more natural as if a normal family was suddenly trapped in time and facing these peculiarities and that's absolutely amazing. The one thing I can complain about here is the ending. It felt too forced towards a happy ending, but that didn't affect the story as a whole.\\n\\n\\n\r\nArt\\n\r\nDidn't impress me that much, but didn't disappoint me either. The animation felt a little bit awkward or, how can I say this, laid-back. But in overall it didn't demote the experience of the anime as a whole. In fact, you might as well say that it fits the anime itself since it wasn't all that serious in either case.\\n\\n\r\nSound\\n\r\nProbably one of the best in the season. The OST is magnificent and fits with the atmosphere; never skipped the opening. The voice actors also did a fine job, sometimes they felt comic, sometimes oddly serious, but always felt natural.\\n\\n\r\nEntertainment\\n\r\nThe whole anime was amazing, but I really hated those cliffhangars every episode. At first, they were indeed interesting and added some thrill, but later on they started getting annoying. You don't have to worry about that if you're planning to binge it, though. The plot is non-linear so be ready for plenty of plot-twists which really makes it all the better. In other words, you'll enjoy this anime if you like laid-back action and some slice of life comedy.",
            "date": "2018-04-02T06:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 276510,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6576458.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MoodMojo",
                "username": "MoodMojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=276510"
        },
        {
            "content": "When I was a kid I used to fantasies about being all alone in a still and quiet world. To just walk around in it and explore without disruption, gave kid me the chills and the feelings of excitement and calm at the same time. I don´t know where that fantasy originated from, maybe a book I read, but it stayed with me for a long time. So, naturally, I was very intrigued when reading the synopsis Kokkoku (Moment by Moment). An anime that bases in this frozen world concept, count me in! But did it evoke the same feeling my childhood fantasies? I willget down to that now. \\n\\n\r\nKokkoku take the concept still and quiet world and go all the way with it. The normal but a bit dysfunctional family Yukawa, are suddenly forced to use their magical heirloom to save two of the family members by stop time and enter what is called Stasis. Unlike me, they don´t feel excitement and calm when entering this quiet and still world. Which is completely understandable, because they are not alone. Other people also seemingly have the power walk around in frozen time, and monster-like creatures called Heralds are lurking around. And in this still and frozen world, a cat and mouse game for life and death take its place.\\n\\n\r\nThis was absolutely an interesting premise (at least to me for obvious reasons). But its just that, what I wrote in the section above is a pretty good summarize of all that happens in these 12-episodes long story. It does have its little twists, like some of the characters has powers, and of the mysteries of this world is explored. That was the highlights. Otherwise its pretty straight forward, family tries to save their family members and get out of Stasis alive, and a secret society that have their own agenda. It was absolutely refreshing several ways; 1) the main characters are not a group of high school students, but a normal family. 2) the concept of a frozen reality is not a concept used 3 times every season. 3) The only real fanservice is in the ending song. All plus in my book. But even do refreshing in many ways, it still kind of missed “it”, to really pull me in and looking forward to it. I can´t really put my finger on what, I just found myself mildly interested in the story. \\n\\n\r\nThe characters are just as the story kind of fresh and lovely under used. Useless overweight unemployed dad? Check. Sake loving grandfather? Check. NEET older brother in his late 20´s? Check. The voice of reason little sister? Check. Together they were realistically portrayed as dysfunctional family. I think that made up a fresh group of main characters in an anime, as far the family theme goes. But were they super interesting? Njaaaa… Not really, just fresh in anime, at least to me. They weren´t thought provoking, nor very memorable. \\n\\n\r\nKokkoku is the work of the newly founded Geno Studio, and the art animation is absolutely decent. The characters can look a bit sloppy at distance, and nothing astonishing otherwise. Backgrounds often looks good, depict the Japanese suburb nicely. \\n\\n\r\nThe VA´s (Japanese) all did their job without any complaints from me. Slow and uninterested voice of NEET brother? Its on spot. Annoying and loud voice of loser dad? Oh yes, they nailed it. Gruffy and hoarse voice of old sake loving grandpa? Yes, indeed. The soundtrack was fine, just as the characters though, not that memorable. The opening is however quite memorable, with a pop-rocky beat.\\n\\n\r\nDid it entertain my as much as my childhood fantasies? Well, sad to say no. Do I regret my time? Absolutely no. Even if it became more of a chore then a pleasure towards the end, the interesting concept and the mildly explored Stasis world was enough to pull me through to the end. The cat and mouse game became e little dragged on as it was the main focus. I would´ve liked a bit more world exploring, such as the complexity of the Stasis world and its inhabitants, the origin of the magical stones and the power it could bestow normal people and so on. That would´ve made this more enjoyable to me. I can recommend Kokkoku to you that can coup with narrow storytelling and slow pace, its not a bad show, its just not a the brightest star in the sky.\\n",
            "date": "2018-03-25T10:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 275019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=275019"
        }
    ],
    [
        {
            "content": "MOD EDIT: *The review contains spoilers*\r\nThere’s a reason why average amount of anime audiences tend to choose, common, less-risky and visually appealing type of show for their seasonal line-ups rather than the irregular one, because sometimes you’ll get something like Kokkoku: Weird, Slow, and simply put a fucking waste of time. The anime really doesn’t deserve more attention it needed to be.\r\nThat doesn’t to say this is kind of stuff that is hard to get into. In fact the anime has pretty straightforward idea: it got superpower, it got alternate world and it got basic tales of good and evil where the good guy tryingto save families whilst try escaping from said world. In all, the basic concept of the anime is quite alright, the execution however is where causing the major problem.\\n\\n\r\nFirst of all. When I said “weird” that doesn’t meant to say the plot was convoluted or full of disgusting phenomenon (although it does at some point because the visual style). It just the many poorly written even that happen during the show; perverted jokes happen ruining the serious event many times; character changing sides because they want to; valuable item founded in unjustifiable way; the inconsistencies of the world where the good guy sometimes running, sometimes walking when chased by the bad guy, and don’t forget the ED video where it is show lots of skins of female characters. What’s that all about? The journey to say the least is a weird experience that raising “wtf?” during the critical moment. The show also likes to teases the audiences with a cliffhanger at the end of the episode only to show that there is nothing dangerous later on. If it have occurred once, it is tolerable, but when happens many times, it is simply become not exciting anymore. Most of the insult comes from the conclusion, which is anticlimactic to say the least where the bad guy gets second chance despite how much people does he sacrificed. Random revelation of the mastermind, and pulling deus ex machina in the end.\\n\\n\r\nToo many things, the superpower stuff also done poorly. There is no limitation or risk whatsoever for the superpower from the heroes but there are weaknesses on the villain. I know it is understandable to create weaknesses onto the villains because otherwise there’s possibility of pulling an aspull in order to defeat it, but making the heroes overpowering the villain is not right as well, because there is not much tension going on especially when you have unlimited teleportation power. There is lots of cliché, breaking the rule event, such as superpower revealed whenever the author want it to be or  when the heroes’ power becomes stronger even though it was said many times that he had already at his limits, just because the protagonist cheered them up.\\n\\n\r\nThe second problem is the alternative world itself or called “Stasis” in this show. I can’t recall any anime that surrounding quantum break or time stops world other than Kokkoku in recent year. But even in this novelty, there nothing much it can helps. They try info dumping the world along the way, but the end what we learn is: a) if you try to kill the people who cannot move within the world of Stasis you’ll be ‘punished’ by the ‘Herald’ and b) The Herald is actually the deceased of the previous Stasis user who are not strong enough or defeated. Other than that, everything else is just the same, literally there’s nothing special about this world. \\n\\n\r\nThere are also no consequences or relation between Stasis and the real world, making it somewhat of a riddle as to why the show makes use of such setting in the first place. You could replace the setting to something like closed room with many daily life’s supplies like Danganronpa, where it also had someone punished you if you breaking the rule and there not much differences. \\n\\n\r\nBy appearances the world is also offer nothing visually appealing since it is the same as the real world. Only the difference is that everything is stopped. As a whole, the show does not deliver anything in the way of a particular outlook on the world, a concept that resonates in everything that happens or a focus on the role of the Herald in the world and the show: while the creators could have had the series be focused far more strongly on the notion that the Herald are really everywhere, living a shadow-existence without all that much interacting with the human world, perhaps there would have been something more of a point to the stories, even if that point wouldn't be all that interesting. As it stands, there is no real point or purpose to the show.  \\n\\n\r\nThe third issue is the pacing which is horrendously slow. It literally takes the entire series for the heroes to be finally backed into the real world. Most of the time it was devoted to chasing, running, teleporting, pushing bad guy back to reality, showing a bit of their backgrounds and some info dumping about the stasis which could be summarized of what I said above. There are so many unnecessary events occurs and the actual content of the show is actually quite shorter than it was presented.\\n\\n\r\nThe Whole stuff about family were not works too since the shows are too busy about planning strategy and info dumping so there’s not enough time to bonds these characters considering the length of the series. It was been established that they are families but practically the cast had not much differences than the typical survival-death type of series when stranger became friends just because they share the same goals. \\n\\n\r\nAlthough there are character’s backdrops. They are quite meaningless in regard to their characterization, it doesn’t serve anything aside from as to why they are could be able living in Stasis. Even in content, the backdrops are just ‘good ol tragic’ backstory that we have already seen uptent time. \\n\\n\r\nThe villain motivation was okay I guess but it was definitely ‘weird’ to say the least, because it surely raises the question as to why are they feel the need to be kills someone. For appearances, they are very lacking in charisma. The characters in general weren’t deep and very clearly black and white. They are pretty much closer to being plot devices as an exposition tools because they did plan and talked a lot but don’t have anything besides that. If I have to give this show credit for anything, they did a good job at making Takafumi easy to hate. (Because clearly, the man is a douche).\\n\\n\r\nAt the end of the day as much as Kokkoku’s novelty in doing time-stops world concept. It didn’t manage to make up itself to be memorable series. Nobody’s going to talk about its plot. Nobody’s going to remember its visual and nobody’s going to care about its characters. What they will care about is the OP song which is probably the catchiest in this season. Overall, it is more interesting for the ideas brewing under the surface than it is for anything that actually transpires.\\n\\n\r\nAvoid it.\\n",
            "date": "2018-03-25T15:02:00+00:00",
            "helpful_count": 109,
            "mal_id": 275057,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3365201.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DannyTheDonkey",
                "username": "DannyTheDonkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=275057"
        },
        {
            "content": "Kokkoku is an ambitious failure. It fails to understand the limits of its budget and writing, taking on far more than it could possibly handle. Its story is idiotic and illogical, the art is ugly as sin, the characters are frustrating as hell, and its glacial pacing makes it one of the most boring 'thrillers' I have ever seen.\r\nIt juggles many intruiging ideas like stopping time, a dysfunctional family, psychic powers, and many more, but Kokkoku wastes them on mediocre execution. \r\nThe dysfunctional Yukawa family comprises the main characters; an unusual choice for the cast that piqued my interest. It would be an understatement tosay they don’t get along with one another. They hit, yell at, and curse at each other. The main character and older sister in the family Juri is the most put together of them all. In the first episode, we’re introduced to Juri's NEET older brother Tsubasa, slob father Takafumi, her nephew Makoto, and wise grandfather. She’s usually the one who has to take care of things like picking Makoto up from school, making dinner, and taking care of the family while her sister goes to work. It's understandable why Juri's searching jobs to move out, but sadly she has yet to be accepted after many interviews. Her living situation is well detailed early on and gave me enough to want to see her family grow and change, hopefully becoming tolerable enough for her to happily live with them. \\n\\n\r\nWhat better of a catalyst to kick off all of their character arcs than a kidnapping? An unbelievable tragedy that happens to two of the family members, but I was intrigued how Kokkoku would answer why this would happen to such a mundane family. Little did I know, there wouldn’t be any logical answers for the many questions that are continuously piled on top of one another all the way into the final episode. After the two are kidnapped, the family receives an impossible ransom request and are unable to ask the police for help. \\n\\n\r\nKnowing they would have to take matters into their own hands, Juri’s grandfather reveals his magical time freezing rock, hoping that they can use it save their family members. The rock gets only one partial explanation at the end that handwaves away any need for logic and chalks it up to ’it just works that way’. This is only the first of many gripes I have with the woefully underdeveloped sci-fi setting and spotty world logic that plagues Kokkoku at every turn. \\n\\n\r\nJuri, her father, and grandfather enter the frozen time world of Stasis. Once entering, the three of them find it won’t be as easy as they thought to retrieve their stolen family. They would go on to fight against the evil criminal group responsible for the kidnapping who also somehow accessed stasis and entered it at the very same moment as the Yukawa’s… Um… What? How? These plot issues crop up everywhere while watching Kokkoku, and the show doesn’t even acknowledge them.\\n\\n\r\nRepeatedly it bends our suspension of disbelief, with no care if it breaks or not. The ridiculous setup at least quickly introduces us to the leader of the group and cruel antagonist Sagawa. Coincidentally, the criminal group is looking for the magical time freezing rock so they can use it to commit crimes and what-not. \\n\\n\r\nStasis is a very intriguing idea that thankfully does get some moral exploration, but from a logical perspective, Kokkoku rarely makes an effort to be more than nonsensical. When a story wants to be mature and realistic it cannot have such glaring plot issues. It's so difficult to be immersed in this anime when the story is so unbelievable, no matter how maturely it presents itself.\\n\\n\r\nIn spite of this, the show offers up some intruiging moral implications. The grandfather states how this world can lead to people losing all sense of morality while they know there isn’t any consequence. It’s a thought-provoking moral quandary to put forward right away; what would you do if you had this power? Adding to the moral intrigue are the giant tree-like monsters known as Heralds. These frightening creatures enforce the rules of Stasis by brutally killing anyone who dares to break them, namely no killing allowed.\\n\r\nSadly we don't get much more in terms of moral intrigue until the end, instead, the show tries to distract us with a shallow but occasionally entertaining mystery.\\n\\n\r\nPlagued with horribly inconsistent pacing, the mystery story becomes nearly impossible to get engaged with. Most of the show takes place in Stasis, spent following the Yukawa family as they plan what there next move will be to save their family and escape. I'm not saying I dislike thrillers with a strategic side to them, but here it feels like Kokkoku is stalling for time. Even the backstories and explanation conversations that fill up much of the screentime have barely any relevance to the story in the long run.  \\n\\n\r\nFrequently we're forced to watch the characters discuss random backstories, shallow world explanations, and pointless strategy discussions; all of this presented as crucial information. After watching all twelve episodes I can tell you with certainty, those scenes are just filler.  Almost nothing that happens in Kokkoku actually matters, it is just a collection of speed bumps only existing to stall for time. Trying it’s best to distract you from how poorly written the story and characters are.\\n\\n\r\nAs a mystery, it’s moderately successful at keeping you guessing, but sadly it’s deeply flawed story isn’t good enough to justify the many cliffhangers we’re left with. Let alone provide us with even a single satisfying payoff. Hell, the word satisfying would only come to my mind in one scene of the show. The final shot episode twelve ends with is technically satisfying, but at that moment the show also reached its peak in disappointment because instead of giving us even one answer for any of its intriguing twist it simply ends. That’s it. Kokkoku spits in its audience’s face and says ’you got what you came for, now leave’. \\n\\n\r\nMaybe if the characters were better I could have gone a little bit easier on the terrible story. The idea of a dysfunctional family being forced to put aside their differences in the face of grave danger is cool, it was easy to connect with their arguments. But my problem is that there is nothing to them beyond those frustrating fights and annoying personalities.  \\n\\n\r\nJuri is likable in how strong-willed she is, but there’s really nothing else to her than a strong-willed woman who wants to protect her family. She's a likable character for these traits but lacked the characterization beyond surface level information. The rest of them are just annoying. Makoto nags about wanting things because ‘he’s a kid and doesn’t know what’s going on’ only existing as a plot device to be kidnapped and add stakes (which works but is a cheap trick). Takafumi stays a stupid slob for the entire show, never changing, only adding frustration. At least Tsubasa's character had major growth thanks to the low point in life he started on, sadly we don’t see much of him in the show diminishing the impact of his arc. And the grandfather’s only purpose is to be the wise old guy, is a lame excuse to get some random family involved in Stasis.  \\n\\n\r\nWe occasionally see the characters tested by the events that occur throughout the show, but that often felt like the writer shifting them around to keep the plot moving when considering how little (if at all) they change. They start as a dysfunctional family and for all, we know they still are one after the show ends.\\n\\n\r\nThere is one definitive change made to some of the Yukawa family members throughout the show, some of them get psychic powers while in Stasis. As if pulled out of thin air, for unexplained reasons certain characters have abilities like teleportation and sending people out of Stasis. These powers seem like little more than plot contrivances added so the Yukawa's can get out of dangerous run-ins with the crime group. \\n\\n\r\nThe menacing villain at first made up for the family's overall annoyances; that is until he got a development episode which just boils his mysterious presence down to a pretty pointless and irrelevant explanation. I really couldn't figure out what the point was to him getting an extensive backstory when all it did was take was extinguish his intimidation and replace it with an interesting but ultimately irrelevant story. His story is meant to explain why he’s so evil and wants to kill people, but it feels like they forgot that important part of his character because it is in no way referred to in his story. You’re really going to tell me he just started killing because his childhood was a little different than everyone else’s? Why not Kokkoku, it’s not like I believed anything you were selling me this far into your shitshow of a story anyways. The issues don’t end here with the characters, both art and sound have their own problems too. \\n\\n\r\nThe newly founded Geno Studio gets off to a rough start with Kokkoku; which is worrying considering they’re at the helm of the much anticipated Golden Kamuy adaptation. Environments are made of dull colors and lack much personality. They were likely aiming to create a believable world, and they did, but the issue is how unappealing it is to look at. Perhaps if there were details added to the environment (ie: visual symbolism) it wouldn't feel tiresome to look at the thing.\\n\r\nCharacters look decent but in the later episodes, they frequently look off model. At its worst we see them warped with just plain ugly looking faces. These flaws are so surprising in a show that does not require much animation, it takes place in a frozen world and most of the screen time is dedicated to conversations explaining what’s going on and planning what to do next. It’s hard to take a character seriously when their face looks like a potato.\\n\\n\r\nMost of the voice acting is suitably grating on the ears to fit the annoying characters. Juri is well voiced thankfully, a decent reprieve from the others. The opening song Flashback is fun, frantic, and wild. The song is unlike any this season, one of the best. The op’s visuals of it are great too, even changing slightly with the show's progression. \\n\r\nThe ed is trash. It’s full of fanservice of the two lead female characters (the only female characters in the show) which doesn’t send a good message. Any tension from the cliffhangers is totally drained by this tone-deaf ed. I’m not sure if Geno Studio had a fanservice quota to meet (because the show is thankfully devoid of it) or if this was some misguided creative decision, but it does not fit this anime.\\n\\n\r\nScore Breakdown:\\n\r\n[Story: 3/10] Poorly paced, illogical, unbelievable.\\n\r\n[Character: 4/10] Unlikable, uninteresting, little to no development.\\n\r\n[Art: 4/10] Passable at best, ugly at worst.\\n\r\n[Sound: 5.5/10] Great op, mediocre sound effects, weak voice work.\\n\r\n[Enjoyment: 5/10] Glacial pacing hampers excitement.\\n\\n\r\n[Overall: 4.3/10]\\n\r\nKokkoku has lots of ideas, but it has no clue what to do with them. You’d expect it to make something of all of its pieces, but then it just ends. A collection of intriguing but mediocre parts doesn’t culminate into a good whole. It’s as boring and mediocre as it could possibly be. Just skip it and listen to the op instead.",
            "date": "2018-03-25T12:35:00+00:00",
            "helpful_count": 47,
            "mal_id": 275036,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4150781.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RebelPanda",
                "username": "RebelPanda"
            },
            "url": "https://myanimelist.net/reviews.php?id=275036"
        },
        {
            "content": "Let the time... STOP. \r\nYou are now stuck in a world where everything is frozen, except you. What now?\r\nThat's basically what Kokkoku is about, Juri and her group is stuck in the \"Statis\" along with the bad guys of course.\r\nReview will contain minor spoilers, I guess.\r\nKokkoku started out as an interesting anime, interesting premise. Why are they stuck in the Statis? What is that world? And what is that huge creature shown in the OP (or the ending of the first episode?)\r\nMany questions, some answered, some not, but meanwhile- The bad guys are taking place. Well, they want to research this statis, so they're bad.Oh and they kill people too because why not.\\n\\n\r\nThe \"bad\" people REALLY weren't fleshed out at all, they felt like some random background characters, which maybe was true to classify them as background.\\n\\n\r\nKokkoku went from a mystery thriller anime of trying to unveil the mysteries of the Statis to.... Let's all fight the bad guy boss!\\n\\n\r\nWell that sounds familiar right? Many anime and stories in general have this, which is fine. But it was nothing like what the premise showed, the start didn't make me think it'll be just going full force forward into the enemy. Oh and just you wait until you see his foolish backstory. It's better you don't know it though.\\n\\n\r\nOn the other hand, what I think was nice to see is the strong female lead. Juri, and later on Majima were a nice change of pace. Strong, determined, you don't see that in anime every day.\\n\\n\r\nBut... While many remained in the background, those who didn't remain in the background were... lacking.\\n\\n\r\nTakafumi (dad) was always annoying and brought nothing except problems. I can deal with that, as they somewhat tried to make it funny. Well.. It didn't work.\\n\\n\r\nThe NEET brother was more on the side, but he didn't contribute anything too.\\n\\n\r\nMakoto, the kid, was always the \"prince\"/\"princess\" of this show (aka PROTECT THE PRESIDENT), but oh btw he's also pretty strong it seems, because why not.\\n\\n\r\nNow to the more main characters, It was nice seeing Grandpa in action, reminds me of Inuyashiki. But what was... weird? Is that he knew of this Statis from his father and yet never questioned it. So he was pretty clueless, except some useful abilities (ex: Aegis to prevent being thrown out) and teleport. But that's all there is to him. He's just there to save Juri whenever she needs to get out.\\n\\n\r\nMajima... Gets some spotlight, she wants to protect/save her family, and she's a bit familiar with the Statis, Well I guess that works.\\n\\n\r\nOh also I want to mention, the OP and ED are top tier.\\n\\n\r\nSo... Did I enjoy Kokkoku? Kinda, I can also say that it's better to binge. Would I go out of my way to recommend it to others? Probably not.\\n\\n\r\nIt was really good at the beginning, but... failed and fell. Trainwreck. One weird thing after another. And yes that includes the bad guy's back story.\\n\r\nAt the beginning every episode went so fast as I enjoyed it, I thought it would be close to AOTS (well after SoraYori), but nah, too many \"fillers\" if I can call it that. \\n\\n\r\nDisappointment, yet still a honorable mention for the good first half.",
            "date": "2018-03-25T09:05:00+00:00",
            "helpful_count": 31,
            "mal_id": 275006,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262007.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/dadnaya",
                "username": "dadnaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=275006"
        },
        {
            "content": "Back in time, when I was wandering around at the anime list of what were about to air in Winter Season, there were an specific anime I got attracted to: Kokkoku, the PV, the art and the synopsis looked great and quite different from what we normaly watch. But is it being different what makes an anime good? Not in this case. This review might be heavy on spoilers.\r\nFrom my life time, I always wanted to stop time and do whatever I want, be it kissing girls, trying to finish my homework, trying to have more time at certain stuff, things like that. And whenI saw that this anime had this \"time stop\" theme on it, I wanted to check out what was it about and the logic behind it. And when I watched it, I have thoughts of being an Inuyashiki again, meaning that it would disappoint and suck, yet there was something on it that was relieving on that sense, we were having some explanations about the logic behind it, and even if some things were quite convenient, it had something that make me think: \"Well this makes sense\". But in fact, things weren't that far to become retarded in no time.\\n\\n\r\nThe story goes around Juri, a Woman who one day got a call from kidnappers that kidnapped his brother and her nephew. Armed with a Knife (because reasons) she decides to go and set them free. Fortunately, Her grandfather stops her from doing a mistake. Here we are introduced to the \"Stone\" a Stone that is capable of stopping time. After some assurances, they decide to stop time. So, this is not your JoJo kind of Dio Stopping time, everything will stay still until they use the stone to go back after doing what they had to do. Unfortunately, when they reach the place were they have Juri's Brother and her Nephew, they found out that they aren't the only ones capable of moving while time is stopped, this is also where the \"herald\" appears, an omnipresent being that serves as an overseer of \"Statis\" (this is how the stopped world is called), this herald holds the power to instantly kill someone who is threatening the life of the \"Stopped\" (This is what the people that isn't moving is called) with a single blow of its hands. This is also the place were we see the grandpa using his teleport ability.\\n\\n\r\nThis pretty much sums up the introduction of Kokkoku, it was alright at this moment, but then, what went wrong?\\n\\n\r\nOn the first episodes, we are set on explaining how Statis works and how the abilities works. The abilities explanation is quite bullshit, as the grandpa just says that \"it happens spontaneously\", still the abilities aren't god tier. Grandpa's teleportation isn't accurate, and later on we are introduced to Juri's ability which is very practical for the situation she's in, her ability is to force someone out of statis as she touches the chest of whoever threatens her. I accepted the \"logic\" behind these abilities because they weren't good enough as an advantage against their enemies. We are introduced to another abilities later on in the anime, which I won't go into much detail to avoid spoilers (Potential spoilers for the end of the anime)\\n\\n\r\nThen, we come to the heralds explanation. Oh boy, the Heralds were the thing that most sense had in this anime, the effort put into its explanation was noticeable. Apparently, when someone enters in Statis without concern and starts freaking out because they are weak of mind, the \"jelly\" of their body starts leaving it, transforming them into Heralds (In this anime, your \"Jelly\" is what maintains you in Statis). But then, the anime starts destroying its explanations attempting to do a more \"complex\" story and this is were Kokkoku throws everything they have done to shit. This anime suffered from a lot of twists on the main plot: it goes from saving your family from kidnappers, to fanatical people of the \"stone\" trying to claim what's theirs, to a \"Villain\" transforming into Hulk, to a \"Villain\" that wanted to stay in statis and \"see the future\" by himself, to a Evangelion kind of psycho shit. The amount of bullshit and plot conveniences thrown at your face starts increasing by a lot. And boy, it doesn't work.\\n\\n\r\nIt saddens me that they spent a lot of time trying to explain what Statis is and how Heralds works just to make it go full retard in no time. The main antagonist of this series tried to make himself a \"conscious\" herald with powers that exceeds humans. As I said before, this is supposed to make him live in statis to witness what the future holds, I mean, if he wanted to do that, why would he need to do a lot of killing in order to do that? As easy as he can go by himself and explain statis to Juri's family and see if he can borrow their stone for scientific purposes instead of threatening the lives of innocent people. But well, the anime decided to go for the most \"complex\" and ludicrous way in order to do that, which obviously backfired.\\n\\n\r\nAfter the appearance of \"The Hulk\" this anime went downhill pretty fast as more and more bullshit were thrown at the screen because the plot demands it. This anime had the potential to be as good and interesting as Steins;Gate, but it went full retard like Inuyashiki. Hell, there's even an ability shown later in the anime that consists of CONTROLLING HERALDS as if they were pets LMFAO.\\n\\n\r\nProbably, the only good thing about this anime is the Opening, which is very unique, there is nothing else left to speak on over the Art and Sound department.\\n\\n\r\nEnjoyment 6/10: Even if things went retard, I must say that this anime can keep you entertained as long as you disconnect your brain from your logic data base. \\n\\n\r\nOverall: 5/10",
            "date": "2018-03-25T12:38:00+00:00",
            "helpful_count": 16,
            "mal_id": 275037,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5202766.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HereticHunter",
                "username": "HereticHunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=275037"
        },
        {
            "content": "A SERIOUSLY UNDERRATED AND DEEPLY MISUNDERSTOOD ANIME. \r\nI'm going to have to sucker punch you and give a simultaneously review of Stein's Gate and Kokkoku. Beware of the reviewer who said he was  disappointed by Kokkoku, after watching Stein Gate. Stein Gate's characters are all 1-dimensional caricatures, unlike Kokkoku's characters, almost all of whom, act like real human beings and hold conflicting emotions and desires which make them feel like 3-dimensional people. \r\nThe family we see kidnapped by a religious cult in Kokkoku feels like a real-life Japanese family. If you prefer funny, unpredictable, and absurd characters rather than realistic human beings, then Kokkokuis not for you. \\n\\n\r\nAnd if you want to laugh at how pathetic and silly the cast of characters are then Kokkoku is definitely not for you. Kokkoku's narrative psychologically compels you to empathize with all its characters no matter how villainous they are.\\n\\n\r\nAnother reviewer complained about the tonal shifts. Yes, Kokkoku has almost random tonal shifts that mostly stem from the behavior of one specific character: the pompous father who mistakenly believes in his own \"heroics\". Tonal shifts actually happen in real life, imagine you are drinking and laughing with your friends and all of a sudden you receive a phone call from a hospital saying that one of your relatives has been hospitalized. The tonal shifts in Kokkoku make the characters feel more realistic. I think any reviewer who complains about the tonal shifts, simply doesn't know what aspect of Kokkoku's story or characters that they really dislike and are just pointing out the show's most salient (obvious) qualities. \\n\\n\r\nComplaining about any anime's tonal shifts is like watching the transformer movies and complaining about the excessive number of explosions or the occassional racist scene while ignoring the movie series' awful and somewhat boring story. Beware of superficial observations masquerading as meaningful critiques. \\n\\n\r\nKokkoku's 2 biggest weaknesses are how it develops the personality and motivation of its cult leader and all the other members of the religious cult. Kokkoku's writer, Seita Horio, has clearly made no effort to actually research the motivations of people who join cults, and he shows a half-assed job at showing the consequences of inherting the position of cult leader. That's why I gave Kokkoku 7 instead of 10 for its charachers. But I'm probably being generous since I like the show's premise. \\n\\n\r\nWatch any documentary about religious cults, or read any book on the subject of religious cults, and you will see that people always join new cults for selfish reasons. The dymanics of Kokkoku's religious cult, \"the Genuine Love Society\" are absurd and simply impossible. The psychopathic behavior exhibited by the members of the Genuine Love Society toward the family harboring time control stones, contradicts their obviously benign goal of saving humanity. This contradiction is never explained and I think it should be explained because real human beings have real reasons, however illogical or irrational, for having conflicting motivations and desires. There is a logic to everything we do, even if that logic is impenetrable. \\n\\n\r\nThroughout the first 11 episodes, there is just no reason at all for the Genuine Love Society to harbor any hatred toward the family they eventually attack. I haven't read the manga so I cannot say if it takes a different approach to developing the religious cult in the manga.\\n\\n\r\nAnd the cult leader is just a hot mess of characterization. Unfortunately the writer, or maybe just the creators of the anime, genuinely believe the silly rationalizations the cult leader uses to justify his murderous and psythopathic tendencies. Religious cults are more than just a sexy storytelling tool... they are a serious social problem even in modern Japan. \\n\\n\r\nI expect the following season to be far worse because of the cult leader's characterization and back story, but so far so good.\\n",
            "date": "2018-03-22T05:31:00+00:00",
            "helpful_count": 10,
            "mal_id": 274521,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sageofagora",
                "username": "sageofagora"
            },
            "url": "https://myanimelist.net/reviews.php?id=274521"
        },
        {
            "content": "Why should you watch Kokkoku?\r\nStory is Outstanding (10). Kokkoku is one of those stories that you didn't know until it was adapted to anime form and even if it was it is usually got overshadowed by main stream or fan service anime. You can put this anime side by side with the likes of Kiseiju (Parasyte) and Elfen Lied mainly because the story. The premise of another world or dimension existing alongside our reality is something really interesting especially for me to dive into. The moment you watch the first episode, you will immediately get sucked into the stasis until the last episode. Believe mewhen I say you will feel autophobic when you watch this, so if you want to enjoy this anime I would definitely advise you to binge watch this alone in an isolated room.\\n\\n\r\nArt is Very Good (8). I could give it a 9 but it would be already biased on my side if I did. The art has a grungy feel in a good way that really sets the isophobic mood of the story. The direction they chose for the art of the opening and ending theme is superb and it contrast the vibe of the series with sharp vivid colors which I adore.\\n\\n\r\nSound is Outstanding (10). One of the greatest thing about this anime aside from its story is the soundtrack. Kokkoku has one of the best opening themes that I have heard in my entire anime life (Flashback\" by MIYAVI vs. KenKen). The mixture of electronic/disco music with the art I have mentioned a while ago is a perfect marriage of two great things. The Ending theme is also something not to be overlooked as it eases you through the ending of the episode with its melancholic tunes. Everything in between balances the overall presentation of the anime.\\n\\n\r\nCharacters are Great (9). Of course, you can't have a great story with dull characters. The main character Juri, and her family are well made and easily distinguishable from each other. I did not feel there are support characters in the story as everyone is give a chance to have their own moment. If there is one complain that I had while watching Kokkoku, it is that the main antagonist of the story (Junji Sagawa) lacked in the villainy department which affected my viewing of the story. He could have been more fleshed out and his character seemed a bit rushed in the anime. *I need to read the manga if they failed to adapt his character  correctly in the anime.\\n\\n\r\nOverall, Kokkoku is an experience you should try. If you are not into the mature psychological or supernatural genre I would greatly recommend you to watch it as a mild introduction to the genre. And if you are a hardcore fan of this genre I am dead sure that you would enjoy it!\\n\\n\r\n9.4 Jelly Fish out of 10.\\n\\n\r\n#Kokkoku #WinterAnimeRetrospectiveReview #AnimeMoments",
            "date": "2018-03-27T04:15:00+00:00",
            "helpful_count": 9,
            "mal_id": 275299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6582532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jmsjrdn",
                "username": "jmsjrdn"
            },
            "url": "https://myanimelist.net/reviews.php?id=275299"
        },
        {
            "content": "This is my first time writing a review, so I hope this can be helpful for at least one person.\r\nTo be completely fair, I am very aware that I probably have a dissident opinion regarding this anime. However, I think the other reviews paint this anime in particular in a bad light. I agree that the art is a bit clunky at times, the pacing is weird, to say the least, and the end is sort of tacked on. But all of that aside, I think that this is a great little anime to watch if you need something to tide you over between seasonsof your favorites anime. \\n\\n\r\nAt times, the connection between characters feels very thin, and it's a little hard to feel a connection to them, as the viewer. At other times, you may feel a deep connection to what the characters are trying to accomplish. \\n\\n\r\nThe story is fairly different, as compared to other anime that I've seen. Although I know for a fact that the premise of stopping time has been done before, I personally haven't seen it in an anime before. It is an interesting concept, however, and I'm glad this has explored it in the way that it has. \\n\\n\r\nOverall, I enjoyed it, despite the flaws, and the janky art style. also, don't get your shorts in a knot about the ED, it's fun and enjoyable.",
            "date": "2018-04-03T14:20:00+00:00",
            "helpful_count": 7,
            "mal_id": 276729,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6593564.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LandingZone",
                "username": "LandingZone"
            },
            "url": "https://myanimelist.net/reviews.php?id=276729"
        },
        {
            "content": "Kokkoku has ended today and I'm sad to see it go. It was a wonderful concept with a wonderful execution. This anime is about a 20 something year old girl of a poor family named Juri. One day, her nephew and brother get kidnapped and ransomed an amount of money they cannot pay. Fortunately, the family holds an ancient relic in the form of a stone that lets them enter a world called, \"Stasis\". Stasis is a place where time has stopped in the exact same moment the Stasis spell was activated, only allowing people who has activated the spell to move around in thisstopped time. The Juri along with her Grandfather and Father to save her captured family members. But are there are others in the stasis as well...\\n\\n\r\nThis show, I felt, did very well in the execution of this quite unique concept. The family is interesting to watch, and they're logic on what to do next is sound. It almost feels like they're real people. What they do is somewhat realistic to what reasonable, rational people would do. The art is pretty, especially using the time where they stopped time effectively. The entire show takes place at sunset and the lighting reflects that beautifully in my opinion. The animation is alright, no dips, but lots of still images. Although, that's to be expected, they're in stopped time after all. Also, the show does this thing where when a character throws an object it just stops moving halfway through. It helps you remember this is a place of stopped time. The OP and ED are some of the best this season especially with the OP being a a mish mash conglomerate of colors, subtext, and symbolism precluding to the show. With all this great things to say about this show, the main, overbearing issue that I have with this show is the ending. The resolution came from an ex machina which I utterly hate. Although, this doesn't stop Kokkoku from being a great show. I give it a 9 out of 10, with a recommendation for everyone to watch. This has been your spoiler free but not really review on Kokkoku",
            "date": "2018-03-25T20:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 275098,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=275098"
        },
        {
            "content": "This is my first review ever, and its because i absolutely enjoyed this anime. it's currently airing but i am very sure it won't be disappointing.\r\nStory 7/10\r\nThe story feels new and fresh, i'm saying this because any one who's into animes knows the usual alternate universe or another world has been used up alot, but kokkoku finds a way to make it feel new, although Juri has failed a lot of interviews, her brother is a NEET, her sister is a single parent and her dad was laid off, this dysfunctional family is struggling on the outside and they are at the bottom of thefood chain but they have a tremendous power which the grandfather knew all along but kept it hidden. It makes you wonder why the grandfather never thought of doing things for their own benefit.....then he had to reveal the secret to protect his family because Makoto and Tsubasa got kidnapped by a mysterious organisation.  \\n\r\nI'll say i like the dysfunctional family angle we don't see that often, it makes you compare this situation to real life issues.\\n\\n\r\nArt 8/10\\n\r\nI totally loved the art style, its beautiful and even more intriguing when characters enter the stasis. the effect of the frozen time on the character is well done. The CG on every single life form on stasis was well thought, the trees, bicycle even the water at that point frozen in time. This blows your mind.\\n\\n\r\nSound 8/10\\n\r\nNothing much to say here. The opening theme is catchy, i have never tried to skip it, it sticks in your mind for a long time. The ending theme was good too.\\n\\n\r\nCharacter 7/10\\n\r\nSo far a remarkable job has been done in expressing each character, Juri is determined to rescue her family, her edgy character to push through obstacles shows shes not willing to go down without a fight, Her grandfather on the other-hand is wise but logical, her father so far is weak but looks like he has a scary side to him, i like the way its been expressed, not rushed, you get a feel of each character including the protagonist.\\n\\n\r\nEnjoyment 8/10\\n\r\nKokkoku is a show that is slowly intriguing, it doesn't hit you like a bang, but you find yourself wondering what would happen? The story is not so different but the supernatural feel keeps your mind at work as you try to understand why events occur in different order. I hope you enjoy this.",
            "date": "2018-03-06T05:42:00+00:00",
            "helpful_count": 6,
            "mal_id": 273175,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6169466.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Violapatra",
                "username": "Violapatra"
            },
            "url": "https://myanimelist.net/reviews.php?id=273175"
        },
        {
            "content": "I had never heard of Kokkoku when I watched the first episode, but I was hooked afterwards. Now, here at the end, I definitely enjoyed myself, but I can see it probably isn't for everybody.\r\nArt 3/5\r\nWell drawn, the action scenes do a good job of communicating the speed and impact of every action, and the cast are all distinctly designed without having to resort to goofy hats or anything. In fact, kudos to the animators for keeping the details of the time stop in mind when lots of small objects are flying or falling. However, it makes extensive use of CGI for several elements -personally, I think it blends well enough with the more traditional animation, but if you strongly dislike it in your anime, its going to annoy you frequently. \\n\\n\r\nSound 4/5\\n\r\nMuch like the animation, the sound effects do a great job of putting oomph behind the action scenes. Most of the music, when there is any, doesn't stand out too strongly, but I think \"Flashback\" is the best OP of the season - its a great song and the visuals accompanying it are really slick. Like a friend of mine said: \"You gotta respect someone who can turn 'punching a man's heart' into a beat drop.\"\\n\\n\r\nCharacter 3/5\\n\r\nI think Juri makes for a good main character. She's got some playfulness to her, but she's mostly a serious woman who gets stuff done. Like the show's description says, her response to the yakuza kidnapping her nephew is to grab a knife and get ready to cut some fools. As things progress, she shows little hesitation in getting things done when push comes to shove, but its obvious the situation is wearing away at her and you wonder if she can hold on.\\n\r\nHer grandpa is cool, and is similarly willing to step up to the occasion in a crisis. The rest of the cast is kind of hit or miss; the brother and father wear on my nerves, and quite a few are just kind of there.\\n\\n\r\nStory 4/5\\n\r\nThe show starts off with a really interesting premise, that being the time stop spell. From episode 2 onwards, it expands on this premise is some interesting directions. Without spoiling anything, let's just say the spell has some rules and exceptions that play heavily into the advancement of the story, but don't feel broken or unnatural.\\n\r\nThat said, I feel like I need to dock points for the ending. Not that its bad -just that they REALLY needed another episode or two to smooth it out. It feels very abrupt.\\n\\n\r\nEnjoyment 4/5\\n\r\nKokkoku moves slowly (not because of the time stop, hur hur hur) but I enjoyed the ride all the same. The first episode made me want to see where it was going, each episode ended at the perfect cliffhanger to keep me interested, and in the last third, s*** gets crazy and I wanted to see how it would one-up itself.\\n\\n\r\nOverall 4/5\\n\r\nKokkoku feels unique and is a fun experience - the action scenes have some good brutality to them and some of the imagery is hilarious in how bonkers it is. Unfortunately, its pacing is definitely not for everyone and its story has some major rough edges.",
            "date": "2018-04-06T16:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 277153,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/440852.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/YarrickOE",
                "username": "YarrickOE"
            },
            "url": "https://myanimelist.net/reviews.php?id=277153"
        },
        {
            "content": "Kokkoku is an anime that kind of leans heavily on the high concept side of storytelling. While the translation for the title is “Moment by Moment”, I  believe that it’s better dubbed as “Moment” as everything takes place technically in one single moment. The reason why is because the  concept of the show is “ what if we had an action/thriller story, but almost everything occurred when time froze”. Of course the show has its twist and turns, the inciting point, the characters, the development, and every other minutiae that i’ll hopefully get to later. Still it's high concept is one of itsmain selling points of the show, and means to draw in viewers. However its concept can only get it so far, and without well thought out characters and plot all that’s left is the concept and it’s wasted potential. \\n\\n\r\nFamily dynamic\\n\\n\r\nOr maybe I should say the lack of? well, kind of. The main bulk of the cast of the show are the Yakawa family with Juri being the Heroine pf the story. Before the inciting point of the show happens the focus of the show is on Juri and the living situation that she and her family is in. While they are not living in the most dire of straits, they are not living the most comfortable life either. It’s during this time that you get a basic understanding of each person and their function in the family, and whether they are helping or hindering the family. This is all fine, however very little comes out of this. The most development to be had is just how each family member feels about each other, and they just roll with that, and not much really evolves for that. I’m fine if the family members don’t get along with each other, or that they have little redeemable qualities, but the problem is that they do nothing with it. Really the only characters that seemed to have some sort of dynamic going on for them is juri and her grandfather. It could easily be chalked up to the fact that they are the ones with the most screen time, but i don’t feel as that’s enough to discredit the fact that there was some sort of connection between them that really wasn’t there for the other family members.while their relationship may have been fine there’s still very little interesting character interactions between much of the cast which slowly unveils how lacking many of these characters are, with 2 specific characters being our prime example.\\n\\n\r\nThe Protagonist and Foil\\n\\n\r\nThe first one obviously being the Protagonist/Heroine of the show, Juri. As the proganist, she is the one that the viewer spends the most time with, and over time intimately learn many things about them that other characters don’t know and what we’ll never get from the other characters. Like most of her family she had the basics of her personality and backstory covered in the beginning. She is shown to be as sort of a headstrong women with a bit of sass, and it’s because of this she’s been having trouble getting employed. Add upon this her families living situational and it shows she’s not living the most happiest of life even feeling some contempt towards her family. However it’s also evident that she cares about her family since after the inciting point which was her brother and nephew being kidnap, she willing tries to go save them by herself with nothing more with a kitchen knife which does overlap with her headstrong personality.  All of this shows that she really isn’t that badly written of the character. The problem is that after the plot starts, any sense of development goes out the window, with the only thing left is more backstory for her. She still does a lot of things, and shows different emotions throughout the story, but none of them really help define her personality or give us a new side of her to examine. It’s just her regular personality placed in a different context each time. \\n\\n\r\nThe other character worth examining is Shoko whoi believe is to be the Foil to the protagonist, at least what they were presented to be. Both Shoko and Junji have several things that compare and contrast one another that makes them a foil for the other character. They both a some history with each other, they both entered Stasis in order to “save” their family, and they both wear opposing colors with Shoko wearing black leather and junji wearing White jacket thing. There’s little to go on since almost all the characters just have the basics and nothing more. The only reason these to are worth standing out is with the whole save their family plot happens for both of them. They do conflict initially, but it’s not like they are against each other on a personal level, and after they do team up there’s really no dynamic between them. Even worse is after shoko completes her plan she just becomes irrelevant to the entire story, and is just there for the ride with her becoming more of another support character than anything else. So when looking at all the characters I don’t think there bad, just underwritten.  Well except maybe one.\\n\\n\r\nThe Big Bad\\n\\n\r\nThe big bad of the story, junji, is really a character who’s appeal goes through a few ups and downs. Initially he was just a cultist leader whose only purpose in the show was to start and drive the plot. He came off as unassuming and kind of boring as he was just there for most of the show not doing much but giving commands to his henchmen. Of course he does change after a while figuratively and literally, and his intentions while given as exposition are more interesting than what would come from any other antagonist in his role.   However that goes to a waste as he becomes another generic and uninteresting characters via his actions. They do try to reconcile it with some backstory for him but it just comes of needlessly and just makes him more boring, \\n\\n\r\nWorld Building\\n\\n\r\nThe story for the show is rather uninteresting as stated previously that the antagonist was the main driver for the plot with the other characters just reacting to it. So out of everything that occured in the show one of the interesting parts of it was the stasis world. While not a world in it’s own right, it does still have it’s own set of rules that it goes by. The show never tries to go out of its way to explain how things work in stasis, as how it works is beyond the comprehension of the characters. Many things are better left unexplained like how they’re able to live in stasis, or what heralds or the jellyfishes really are. It gives the show a sense of mysticism and and need to explain it would ruin what it’s trying to present. They also do really interesting things in terms of animation when it comes to stasis, nothing really amazing but interesting enough that adds to the show. \\n\r\nByakugan\\n\r\nAnother thing worth noting in the story is a certain power that several characters have in the story. The reason i refer it as Byakugan is because the power is always associated with characters having full white eyes and the protagonists power in particular being very reminiscent of it. The powers take large leaps of suspension of disbelief as the show goes on. When it was first introduced it was tolerable much like the world they were in, it wasn’t really worth it do delve into what it was. However as the show when along and more people began also having powers did it feel like it was for the convenience of the plot and nothing much else.\\n\\n\r\nProduction value\\n\\n\r\nSeeing as this is Geno studios first work who are basically the studio that rise after manglobe ended, the production value was okay. The character designs were fine, the background art was fine for contemporary japan, they did some interesting things with the stasis visually. Still the colour gradient for the show was boring and any sort of distant shots of the characters just looked terrible. The animation was passable, but nothing worth noting. The heralds actually looked good in CG as they have off this animousy otherworldly appearance, but only when there standing still or move quickly because they look laughable when they move for a long period of time. the soundtrack for the show was fine, nothing really stood out outside of maybe one or two tracks.\\n\\n\r\nDespite how much of a mess it all came to be i still enjoyed parts of it. like the idea of the stasis world and i did become more interesting in the final episode, but it’s better left as a concept.some of the characters were fine and the family would be more interesting in another genre with another script. Overall i think the show is just fine where the pieces where underdeveloped, and are more interesting as pieces rather than as a whole.",
            "date": "2018-03-25T11:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 275027,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4894211.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LaLeLuLiLo",
                "username": "LaLeLuLiLo"
            },
            "url": "https://myanimelist.net/reviews.php?id=275027"
        },
        {
            "content": "Here we go again, another one of those which you either love or hate. No in-between. \r\nWe've seen plenty of instances in the past in which anime series have utilized time-related concepts as their main plot device, and more often than not it may be confusing and over-complicate matters. Kokkoku, for me, is one of the better series to have handled the concept well. \r\nThe story basically sees all our characters enter the strange and mysterious world of \"Stasis\", which is a version of the real world stopped at a single moment in time. As usual, conflicts between two factions occur and everything starts happening.If you're already having trouble figuring out what \"Stasis\" actually is, trust me, you don't have to worry, because it really is a simple concept to understand, and they explain it fairly well. \\n\\n\r\nThe story and its execution is really what makes this show for me. Every episode reveals new bits of information or action, and ends with frustrating cliffhangers which just makes you wonder more, want more. As a result, the entire flow of the series was really solid and in no way episodic. Amidst all the seriousness, they also managed to add in humor at appropriate times which wouldn't turn the viewer off. The ending may have been somewhat predictable towards the end but I thought it was well done and, most importantly, it gave the entire case a good, simple closure. \\n\\n\r\nCompared to the story, however, everything else was just about decent. I felt the mature art style actually really fitted the show. Like, if there were beautiful or moe girls in this show I don't think it would be possible to take the plot seriously. In addition, the characters in the show were mostly grown adults, so naturally a more mature art style would be suitable for it. Music wise, I just want to point out that the ED and its animation is really good and you should check it out regardless. On to the characters, unfortunately we really got to know more about only three of them with regards to their backstories as such. However, I felt those three alone were enough to drive the story forward, and any extras would have thrown it off its track. \\n\\n\r\nOverall, I really enjoyed this series. They made use of one single concept to propel the plot forward right till the finish line, and they executed it well. If you're planning on finding a show to binge at one go, Kokkoku would be a suitable candidate for sure. \\n\\n\r\nFew years into the future, I may not be able to remember everything about this series. But what I would remember, was that this was truly a dark horse of the Winter 2018 season. I hope this review has done enough for you to give this a shot, and I hope you'll enjoy it as much as I did.",
            "date": "2018-04-01T19:01:00+00:00",
            "helpful_count": 4,
            "mal_id": 276438,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3423567.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/henkuku",
                "username": "henkuku"
            },
            "url": "https://myanimelist.net/reviews.php?id=276438"
        },
        {
            "content": "I liked this anime a lot,\r\nIt was my favorite anime of the winter 2018 ongoing anime.\r\nThe art style was pretty nice and fit very good with this kind of story.\r\nThe characters where portrayed in a good matter.\r\nAt the start of the anime, you are kinda curious about what is going to happen.\r\nThen, it is starting to get interesting, and you want to see more.\r\nEventually you'll be hooked to this anime, since it has this certain vibe.\r\nThen you realize this anime is almost to its end, and you are starting to feel a little sad.\r\nThe story never got boring in my opinion, and was always veryinteresting.\\n\r\nThis was one of the few anime's that I think had a really good ending!!!\\n\r\nNormally when an anime ends, I feel a little sad and empty because it's over, but in this case I don't mind, because of the good ending.\\n\\n\r\nSome more story about the world itself could have been told in a spin-off, but that is very unlikely to happen.\\n\\n\r\nI would definitely recommend this anime.",
            "date": "2018-03-27T06:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 275316,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6126070.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BlaxadowFire",
                "username": "BlaxadowFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=275316"
        },
        {
            "content": "The story was actually really good until the brought the backstory of the Church into it. I was all about This dysfunctional family trying to get their kidnapped brother and grandson back from some bad guys, and in turn fight some people in this frozen timeline. Then things got weird, people turned into trees, people were being rescued from being trees, and a woman who we knew was very important in the very beginning doesn't show up the entire series until...spoiler alert...the last episode. This series took a nose dive after episode 6 and spiraled out of control once episode 10 aired.\r\nI really enjoyed theart and animation. Having things freeze to where they needed to be was pretty interesting. The character designs were really well done as well.\\n\\n\r\nThe op and ed were top tier. I was a-ok with the fanservice in the ed. I know most people were not but hell oh well.\\n\\n\r\nThe characters were interesting again up until a certain point. The family was funny at times and the chicks were pretty kick ass. Honestly if I got more fanservice out of Juri and Majima I would have ranked it higher.\\n\\n\r\nThe enjoyment was like a roller coaster. Some episodes I really enjoyed and others had me going \"Oh I guess that happened?\"\\n\\n\r\nOverall this anime had a lot of pluses and minuses. I think one of it's major flaws was trying to find see if it was an Action or Comedy anime. Seriously there were times with some pretty serious moments and things just got weird and you're sitting there like \"Did he really just ask to bang her?\"\\n\\n\r\nOh also the question of \"Well what happens when time is stopped in stasis and everyone is gone? Never gets answered. For the most part.",
            "date": "2018-03-25T19:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 275089,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275089"
        },
        {
            "content": "With people started to like those skip the opening button just to get into the point of some anime, an anime made us realize that you should not skip the opening just to have that hype so you can stay and watch a mediocre yet predictable anime like this one. While having the source material have ended long before the adaptation as an advantage, Kokkoku, an anime adaptation of a manga created by Seita Horio, did not manage to steal many hearts to invest and drive themselves into the world of stasis.\r\nThe major flaw of Kokkoku lies in the very predictable and mediocre plot. Threeepisodes in and I already guessed how the ending will like. And... My prediction was not too far off. Even with this predictable plot, Kokkoku still did not manage to deliver their lore of the stones and the specters well and left me with lot of holes here and there. While I could not sense the rushy feeling inside this anime, I sensed that the timing of when they delivered the lore one by one was a bit off which kinda disappointing from my side.\\n\\n\r\nWhile the soundtrack of this anime fits its bargain by being eerily perfect for a show with the theme of hide and seek between good, bad, and something other than that, what I should underline from this anime's sound of course its opening. I just can't stop listen that opening. This opening alone is an example of how an opening should have done : hype up the show in the beginning so people will stay and watch the show. The opening alone could be a reason why I choose to stay and watch the whole show.\\n\\n\r\nTo be honest, I have listened Flashback back in 2017 when it just came out (with other songs from MIYAVI's Samurai Sessions Vol. 2) and already guessed that sooner or later his name will shine in the community. If you said that \"THIS OPENING IS MY JAM!\", I suggest that you should listen to MIYAVI's other tracks. It's all worth it. Trust me.\\n\\n\r\nWhile managed to sway me with MIYAVI's song as the opening, Kokkoku's story did not stand out very well and I will only say \"Okay, I let it slide.\" just because the opening managed to keep me stay and watch all of them.",
            "date": "2018-03-25T12:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 275031,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5318995.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Its-Maki-kun",
                "username": "Its-Maki-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=275031"
        },
        {
            "content": "I would say, since Boku Dake Ga Inai Machi, this another time traveling or I should say heart Stopping anime is quite a pretty good anime for this season. I don't care if others don't like it but I'm sure you're gonna love it. It is a story about a family forced to stay inside a place where the time has stopped ticking (I'm not gonna spoil everything but I am sure you're gonna love this plot.) and they are being chased with a cult.The real plot here is not how are they gonna escape the conflict but how the conflict would shape them asa family.",
            "date": "2018-02-07T19:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 270994,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Koalas_InTheRain",
                "username": "Koalas_InTheRain"
            },
            "url": "https://myanimelist.net/reviews.php?id=270994"
        },
        {
            "content": "I only wanted to log this series into what I have run through, but seeing top reviews actually make this series out to be bad and not well written, I can't stand by without saying anything. \r\nLet's be frank, this series isn't something you can really like/love at first sight. It's a mess and it happens in like, what the hell? Only 1 moment? Almost a day? Not to mention loop holes in writing are all over the place. Many explanations don't meet up with what they were supposed to answer, it's like they are not even trying to explain anything to be with...... Evenart style, sound, aren't that outstanding. So, what's there to like it?\\n\\n\r\nSurprisingly, there is. Or in fact, there are. \\n\\n\r\nAs you can see in the synopsis, the main characters can somehow \"stop time\" and \"move around when time and everyone else just \"stop\". It's a fundamental setting for this series' plot and as funny/surprising yet so natural as it is, this setting was put into question right the moment it was introduced, then, and there. Although it was lightly brushed off explanations come much later to give us the idea of how it works. Pay attention, and you will like it.\\n\\n\r\nMoving on, story premises are all about reuniting family members. Yet, they keep running around to miss each other. Well yeah, that's how every story like this one go. But Kokkoku was different. They move around very much on their own, keep missing each other on their own. Very much like how it would be in reality where people do things how they see fit and end up making efforts of one another go to waste. For this one, it deserves points for the clever development method. \\n\\n\r\nAnd then characters. One thing you can notice almost right away is that they keep switching. I mean, come on, a neet goes outside on his own for his nephew, an oldman who got laid off start talking about stuff very sciency all of a sudden, and later on, characters switching sides like it was nothing...... What's with the inconsistency? It's like the characters don't even try to keep to their own settings except for 1 single core reason of existence in the whole 12 episodes. Yes, only 1 core reason of existence. For the main characters, it was to protect their family, for the shitty oldman, it was to look as cool as he can, to others, faith, money, stuff. \\n\r\nBut then, there was clearly 1 single character whose objectives changed over time. Then 1 more just lose their reason then picked up another right away. Then again, another who takes the middle ground with 1 core reason but somehow seems like it changed over time. \\n\r\nTheir actions are also hard to read. You can imagine parts of it, but you can not clearly predict it all, just like how you can't predict what others will do but can imagine it in real life. That's unlike many other series where intentions are clear for viewers/readers. It makes characters moving from inconsistent to lively, realistic, complicated and extremely 3D. They even keep their promises just as they talked about it too. \\n\\n\r\nAs I mentioned above, there are stuff left not explained in the story writing. But if you pay attention, you somehow see hints everywhere. From how bad the family situation is despite all the power, to who the heck was mentioned at the end. It was fun thinking how it connects and would make room for many theories. I wonder if MatPat on Film Theorists would want to pick some up (lol). \\n\\n\r\nFor a TLDR summary, Kokkoku is a complicated, very mundane and easy to misunderstand series. But if you go into it, you might like it, but you will still have to admit that it's not that good. Heh, talk about how life like this series is.",
            "date": "2018-12-15T09:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 295806,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Demundo",
                "username": "Demundo"
            },
            "url": "https://myanimelist.net/reviews.php?id=295806"
        },
        {
            "content": "Throw another one to the pile of “euh” anime. Kokkoku I think accurately gets across the feeling of getting a bus to go somewhere nice and then you miss your stop and get out in a place you don’t know and look pretty bad. What started out as an intriguing thriller that meshed the usual kidnapping scenario with supernatural elements turned out to be a weird supernatural drama that went all over the place instead of focusing what was good about it. \r\nI genuinely liked the beginning of it, first half of Kokkoku stood out to be as anime thriller done right. We kick offin a grounded setting with simple characters that should be easy enough to sympathize with or relate to for anyone with no shortage of empathy. Then something terrible happens and a family that was barely scraping by is put in a terrifying situation where their relatives are about to die unless they get a lot of money in unreasonably short amount of time. Spoiler: they have either and that prompts out main character Juri’s grumpy grandpa to whip out the ol’ time stop magic stone. When they use that to get to the meeting place they discover that they’re not the only ones walking around in the world of stasis. Unknown group set all this up to lure them out and get their hands on the magic stone. Juri and her grandpa get away but now the show is on as we know all the participants and the threat is established.\\n\\n\r\nThis constitutes for the huge chunk of my enjoyment of Kokkoku, it’s the usual story set in very unusual circumstances which forces things to change just enough to make me invested. As I said in Museum review, thrillers largely live on their execution and not the story and Kokkoku was largely amazing at it. Until bullshit starts happening and supernatural elements take over we’re watching two underdogs incapable of putting up a fight struggle against an overwhelming force in a stopped world rules of which they don’t yet know or understand.\\n\\n\r\nUnfortunately this doesn’t last long and as the show starts to indulge in its own world and characters as the stronger aspects of the show slowly but surely peter out. This wouldn’t have been such a bad thing if Kokkoku could support either of these directions but it can’t. \\n\\n\r\nFleshing out the mystical world doesn’t actually add anything to this story. There’s a reason a lot of shows don’t explain the supernatural as it’s a mysterious force that nobody understands but can serve as a valuable catalyst for something actually interesting. Kokkoku doesn’t agree with that and dumps a bunch of information about the entities within the stasis, their roles and origin while simultaneously leaving out so much that what we got doesn’t pain a full enough picture to enjoy looking at it.\\n\\n\r\nWhen it tries to focus on characters it doesn’t work either cause none of them are that complex, they don’t need to be. Once again, a thriller or a mystery show can survive of off the thrill and mystery. We don’t need a character study to enjoy something like Redline or Mononoke. Yet once again we take quite a few hikes off the main path to learn more about the past of people which won’t be playing that big of the role in the narrative. \\n\\n\r\nI still think there’s a bit of enjoyment to find in seeing the ideas author had for this setting but these ideas aren’t worth much in the big picture because of how sloppily they’re tied to everything else.\\n\\n\r\nThe ending is also a huge asspull that comes out of nowhere but at least the emotional payoff at the end was pretty sweet.\\n\\n\r\nOverall Kokkoku is just another show that can’t seem to understand its own identity as it keep going somewhere without knowing why and eventually stops to wave goodbye. Is it worth a watch? I don’t know, while it’s pretty easy to say that it doesn’t seem to success in doing anything it set out to do Kokkoku is still eccentric enough to stand out from other anime in an endearing way and as such I don’t regret my time with it a single bit.\\n\\n\r\nP.S. - If you’re not going to watch it I at least implore you to check out OP and ED, s’good.",
            "date": "2018-04-20T12:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 278575,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063579.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gundroog",
                "username": "Gundroog"
            },
            "url": "https://myanimelist.net/reviews.php?id=278575"
        },
        {
            "content": "In a sense, this has been such an amazing experience. I'm glad to find some improvement in psychologicals nowadays since they've been overwhelmed with the fanservice-themed anime these days. However, don't worry, even if you're not a fan of psychological anime you'll still enjoy this in most cases.\r\nStory\r\nThe family enters Stasis in order to save a NEET and a little kid who were kidnapped on their way home. Stasis is like time travelling, but very detailed. Every thought about how it would be to leap through time? Well, I know I did and this anime incorporates it magnificently. What's even more amusing is the factthat they had such tight bounds to logic all-throughout the anime. They never used the common anime logic. No peculiar instances that only convenience the MC or anything alike. It's a fair fight with no villain or hero, just people with different interests that intervene with one another.\\n\\n\r\nFurthermore, it didn't feel anime themed at all. What I mean by that is the whole thing when they have a 5 minute tea break with the viillain discussing their interests out of the fight, promising not to let anyone die and all those Shounen bull. Instead, it feels more natural as if a normal family was suddenly trapped in time and facing these peculiarities and that's absolutely amazing. The one thing I can complain about here is the ending. It felt too forced towards a happy ending, but that didn't affect the story as a whole.\\n\\n\\n\r\nArt\\n\r\nDidn't impress me that much, but didn't disappoint me either. The animation felt a little bit awkward or, how can I say this, laid-back. But in overall it didn't demote the experience of the anime as a whole. In fact, you might as well say that it fits the anime itself since it wasn't all that serious in either case.\\n\\n\r\nSound\\n\r\nProbably one of the best in the season. The OST is magnificent and fits with the atmosphere; never skipped the opening. The voice actors also did a fine job, sometimes they felt comic, sometimes oddly serious, but always felt natural.\\n\\n\r\nEntertainment\\n\r\nThe whole anime was amazing, but I really hated those cliffhangars every episode. At first, they were indeed interesting and added some thrill, but later on they started getting annoying. You don't have to worry about that if you're planning to binge it, though. The plot is non-linear so be ready for plenty of plot-twists which really makes it all the better. In other words, you'll enjoy this anime if you like laid-back action and some slice of life comedy.",
            "date": "2018-04-02T06:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 276510,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6576458.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MoodMojo",
                "username": "MoodMojo"
            },
            "url": "https://myanimelist.net/reviews.php?id=276510"
        },
        {
            "content": "When I was a kid I used to fantasies about being all alone in a still and quiet world. To just walk around in it and explore without disruption, gave kid me the chills and the feelings of excitement and calm at the same time. I don´t know where that fantasy originated from, maybe a book I read, but it stayed with me for a long time. So, naturally, I was very intrigued when reading the synopsis Kokkoku (Moment by Moment). An anime that bases in this frozen world concept, count me in! But did it evoke the same feeling my childhood fantasies? I willget down to that now. \\n\\n\r\nKokkoku take the concept still and quiet world and go all the way with it. The normal but a bit dysfunctional family Yukawa, are suddenly forced to use their magical heirloom to save two of the family members by stop time and enter what is called Stasis. Unlike me, they don´t feel excitement and calm when entering this quiet and still world. Which is completely understandable, because they are not alone. Other people also seemingly have the power walk around in frozen time, and monster-like creatures called Heralds are lurking around. And in this still and frozen world, a cat and mouse game for life and death take its place.\\n\\n\r\nThis was absolutely an interesting premise (at least to me for obvious reasons). But its just that, what I wrote in the section above is a pretty good summarize of all that happens in these 12-episodes long story. It does have its little twists, like some of the characters has powers, and of the mysteries of this world is explored. That was the highlights. Otherwise its pretty straight forward, family tries to save their family members and get out of Stasis alive, and a secret society that have their own agenda. It was absolutely refreshing several ways; 1) the main characters are not a group of high school students, but a normal family. 2) the concept of a frozen reality is not a concept used 3 times every season. 3) The only real fanservice is in the ending song. All plus in my book. But even do refreshing in many ways, it still kind of missed “it”, to really pull me in and looking forward to it. I can´t really put my finger on what, I just found myself mildly interested in the story. \\n\\n\r\nThe characters are just as the story kind of fresh and lovely under used. Useless overweight unemployed dad? Check. Sake loving grandfather? Check. NEET older brother in his late 20´s? Check. The voice of reason little sister? Check. Together they were realistically portrayed as dysfunctional family. I think that made up a fresh group of main characters in an anime, as far the family theme goes. But were they super interesting? Njaaaa… Not really, just fresh in anime, at least to me. They weren´t thought provoking, nor very memorable. \\n\\n\r\nKokkoku is the work of the newly founded Geno Studio, and the art animation is absolutely decent. The characters can look a bit sloppy at distance, and nothing astonishing otherwise. Backgrounds often looks good, depict the Japanese suburb nicely. \\n\\n\r\nThe VA´s (Japanese) all did their job without any complaints from me. Slow and uninterested voice of NEET brother? Its on spot. Annoying and loud voice of loser dad? Oh yes, they nailed it. Gruffy and hoarse voice of old sake loving grandpa? Yes, indeed. The soundtrack was fine, just as the characters though, not that memorable. The opening is however quite memorable, with a pop-rocky beat.\\n\\n\r\nDid it entertain my as much as my childhood fantasies? Well, sad to say no. Do I regret my time? Absolutely no. Even if it became more of a chore then a pleasure towards the end, the interesting concept and the mildly explored Stasis world was enough to pull me through to the end. The cat and mouse game became e little dragged on as it was the main focus. I would´ve liked a bit more world exploring, such as the complexity of the Stasis world and its inhabitants, the origin of the magical stones and the power it could bestow normal people and so on. That would´ve made this more enjoyable to me. I can recommend Kokkoku to you that can coup with narrow storytelling and slow pace, its not a bad show, its just not a the brightest star in the sky.\\n",
            "date": "2018-03-25T10:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 275019,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5471783.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Raggadish",
                "username": "Raggadish"
            },
            "url": "https://myanimelist.net/reviews.php?id=275019"
        }
    ],
    [
        {
            "content": "An anime stuck in one moment, felt like LA mostly wasted 270 minutes worth for that \"one moment\"...\r\nKokkoku is one of the more promising concept of an anime LA had seen in a while, a bunch of cultist kidnap the main protagonist Juri Yukawa voiced by Chika Anzai's family members and they have little time to give them an abundant amount of money, so Juri's Grandpa voiced by Kazuhiro Yamaji quickly decides to use an old Stone that allows them to stop time, easy right, wrong, the cultist have the same power, now the Yukawa family and the cultist duke it out in the StalledTime.\\n\\n\r\nTHIS kind of concept of an anime is great and LA was really on board for the first 3/4's of the anime with little to no breaking of the Stalled Time's rules involved with Heralds, being monstrous beings being the judges of the Stalled Time in place. So with all the rules out in place, stakes in place and an awesome concept, why does LA feel sooo underwhelming by the end of it...well that a bit later.\\n\\n\r\nFor characters, most of them are their stereotypical personalities from Juri our main protagonist being one of the more protective characters especially when it concerns ANY of her family members, Grandpa, is more or less the Grampiest Grampa and also being a badass, mainly due to him knowing how to momentarily teleport in the Stalled Time, Tsubasa voiced by Hirofumi Nojima the older brother NEET was a wasted potential of character, being that he's one of the kidnapped members but his screentime and presences would have done something, instead our main butt monkey but oddly with some \"common sense\" father of Juri, Takafumi gets it and sure he helped Juri and Grandpa but he had scummy tactics and a coward for the time being (not to mention his pointless power feud with Juri and Grandpa didn't help his image) and finally from the Yukawa family, the youngest member, Makoto voiced by Ryuuto Iwata having some significance in the plot, the only interesting thing would be that yeah sure he's a kid thus doesn't know any better yet he has a more moral compass in comparison to Takafumi was interesting dynamic considering Makoto's screentime was largely with him in the process.\\n\\n\r\nOn the \"villains\" side of things, well we have devoted cultist bent on getting the Stone but there are some focused characters in the mix, such as Shouko Majima voiced by Asami Seto, being just a person who wanted to save her family from the Heralds due to an incident involving the Stalled Time with Sako voiced by Hiroyuki Yoshino being the jerk with the heart of gold who isn't exactly one of the cultist, more like one of the mercenaries brought in by the main villain of this anime, Junji Sagawa voiced by Hozumi Gouda who's goals are interesting but...well he's got a weird goal in mind. \\n\\n\r\nReally the thing is with Kokkoku's characters, they don't really develop while they are in the Stalled Time, it's more or less their interactions and their actions that define them, even with the main players of the anime having their backstories told and everything, what with them being in the Stalled Time, yes we do learn about them but it doesn't really change their goals as a whole, Junji has his goals in place and will do anything to get to it, Juri and Grandpa wants to save their family members and get out of the Stalled Time as fast as they can.\\n\\n\r\nIn terms of animation by Genos Studio, who had members form the defunct Manglobe animating Kokkoku and to honest, the animation is very detailed to say the least and pays attention to the small details especially when the anime gets in the Stalled Time, character designs are smooth and striking even if the majority of the cast are in their default attire and though the anime uses CGI with the Heralds they were integrated \"ok\" to say the least. LA will say that Kokkoku does have some odd tendencies to give us some awkward fanservice moments here and there, some unintentional and LA brings this up considering how serious and high stakes of the anime it has, but the fanservice doesn't completely gets in the way of the plot, it's there...and it's awkward, intentional or not.  LA will say that because of the anime's setting of the Stalled Time allows Genos Studio to not put any kinetic motion to the background thus backgrounds as beautiful or dull of the environments are at times nonetheless Genos Studio for LA at least, did a pretty job in the animation department expected from former Manglobe animators, especially the character designs. \\n\\n\r\nVoice acting was decent overall for LA, with Chika Anzai and Kazuhiro Yamaji being the spotlight for this anime to be fair, Asami Seto got to do some her more dramatic cadences as well as being the mysterious character for a bit with Hiroyuki Yoshino being the jerk with the heart of gold to a T. Oddly enough as much as LA hated Takafumi as a character, Kouji Tsujitani was comedic relief..not great comedic relief, but comedic relief nonetheless and finally Hozumi Gouda did \"ok\" as the main villain of this anime as well as Ryuuto Iwata as Makoto but they are probably the two voice actors LA didn't really had much to say about, nonetheless good voice cast overall.\\n\\n\r\nSo, Kokkoku has good production value, good early concept, somewhat stabilized rules and conditions of the anime and decent characters so why does LA think Kokkoku was underwhelming...well that's because of the last quarter LA had yet to talk about. Kokkoku had SUCH a good thing going for it, from it's base concept, high stakes, decent characters and NOT breaking the rules of it's pre-established Stalled Time which is especially hard in a \"time travel-esque\" plotline like this but it's once it gets to the last quarter is when in LA's eyes loses any sense of what it was trying to do in the first place and go fully uncanny valley and the ONLY defense LA will say with this is as much as it goes full uncanny valley, the characters actions have some sense of logical reasoning considering what crazy shit it leads into, anyways dump in an asspull of a finale and what great praise LA had for Kokkoku just left LA with a bitter taste of that underwhelming pie, don't get LA wrong, Kokkoku's build up, concept and the world of the Stalled Time was great and LA won't ignore that but an ending is everything and for Kokkoku to essentially give up not only at the finish line but at it's climax, well it just taints the entire pie.\\n\\n\r\nIf there is one word to call Kokkoku that would be \"underwhelming\", if LA could say more than it would be \"great in concept, but fails in it's ending hurdle HARD\". Not horrible of an anime but man was LA expected more than this...",
            "date": "2018-10-15T17:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 291835,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=291835"
        },
        {
            "content": "*Disclaimer*\r\nJust personal scratch.\r\nAdvised, possible spoilers.\r\nOpinion & Informal\r\nArt: 6/10 Mix of standard art/animation and CGI. Anatomy believable. No impact art or scenes really found here.\r\nAnimation: 5/10 Movements somewhat believable. Then again, they used the special world to get away with pretty much anything that might not be believable. CGI movements was average and nothing special. Special effects were sparse and uninteresting. Not much fluidity or impact scenes at all.\r\nPlot: 5/10 So I was expecting something a bit more based on the premise of the synopsis. This show was a letdown. It delivered something pretty mediocre and average. It had a lot of potential to flesh outsome really complex themes and ideas. However, it was really bland in its execution. There is no better way to describe the plot other than one dimensional. The show had the opportunity to introduce and explore some deep themes and ideas but it instead took a very predictable, cliche and risk-free route. It basically squandered its potential to explore some complex themes. The plot development was particularly stupid too. It introduced some interesting world and it dips its toes in special rules but ultimately the show fails to do anything with those. It introduces the world really plainly and that's about it. It's basically a stopped world. The show doesn't explore the intricacies of how and why. It introduces some sort of complexity with the rules about harming The Stalled but that's it. It doesn't take any of those things further than just a basic \"oh yeah, here's some world and here's two rules about it\"...that's it. The show doesn't go into how the world exists or was created. \\n\\n\r\nDevelopment: 5/10 To sum up the plot development the show fails to deliver any meaningful form of how and why. \\n\\n\r\nCharacters: 5/10 None of the characters besides the main girl were likable. All the characters including the main girl were bland and one dimensional. The main girl got pretty much zero development as a character, or another way to put it she didn't really get any meaningful backup to development. For example, in the earlier episodes she's afraid and hesitant but then all of a sudden she finds the resolve to be some spunky/leader type girl. The encounter where she becomes stronger as a person wasn't at all backed up with any meaningful reasons, development or plot. She basically became courageous because the rest of the story needed her to be otherwise the show would be going nowhere. The main girl was just a tiny bit likable. Everyone else I disliked. \\n\\n\r\nMusic: 7/10 The OP was super catchy and was the only real reason I picked this up. The actual show's bgm and sound design was unnoticeable and nothing special. The show didn't even really use the super catchy OP in any of the scenes to hype anything up which was a waste. \\n\\n\r\nConclusion: 4/10 Somewhat open-ended conclusion. Questions answered but a few more introduced that would leave a lingering feeling. Unsatisfying. \\n\\n\r\nOverall: 5/10 Overall, the show threw away any potential it had at being above average or even good because it failed to take the opportunity it's premise provided it; the show didn't explore any interesting themes and concepts the initial plot provided it with. The show took a very one-dimensional plot and development route that is honestly a waste. The show could have done a lot more with the cards it had. The only redeeming thing this show had was the OP. The OP was cool af. 5/10",
            "date": "2018-09-05T15:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 288214,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2481421.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheHentaiKing",
                "username": "TheHentaiKing"
            },
            "url": "https://myanimelist.net/reviews.php?id=288214"
        },
        {
            "content": "I wrote a review for Kokkoku when only a few episodes were out because I felt that the scores didn't give a good representation of the story. Now I've deleted my old review, edited my score (slightly... maybe) and am back to give a better rounded review - hope it helps!\r\nFirst - **Kokkoku isn't going to be a widely liked anime.** It's a bit too off-key, a bit too targeted of a general overarching concept/tone/genre for that. If you aren't a fan of something that gets its primary draw from being simply surrealist, or if you don't want to sit through a bit of aslow burn for the good in the beginning, end, and for the general sake of the tone, this isn't worth a watch for you. \\n\\n\r\nBUT, if you have an itch to watch something generally surrealist in tone, if you appreciate David Lynch, Mousou Dairinin, Junji Ito, or old school Twilight Zone, and especially if you can sit through some slow burn I think it's worth giving Kokkoku a shot!\\n\\n\r\nMy overall rating for Kokkoku lives and dies by the plot (and surrealist tone). Overall, while I really enjoyed Kokkoku, it fell short for me plot-wise. The beginning was well-paced and got me on board for some surrealist drama with some possible psychological horror undertones. Then... it dragged. It felt like there were great ideas, great bits of plot to be followed, but that they just *weren't going there*, and it was incredibly disappointing. Then the last 2-3 episodes happened, and suddenly Kokkoku was back in its stride. Those first and last episodes were great, and are making me conflicted between giving Kokkoku an 8 or a 9 (because, it was still \"good\" to \"very good,\" despite the dragging plot). The middle episodes had me questioning how many ideas Kokkoku had going for it, and whether it was going to fall short, or fall *terribly* short, of my expectations. Happily, it ended up being something in the middle, and I'm glad to have watched it for the ideas that it did end up offering the viewer.\\n\\n\r\nCharacters were great - I'm surprised when I see people complain about them. Each character added a different perspective to the plot and the setting (there were no redundant or particularly uninteresting characters), and everyone felt very *human* - neither too perfect nor too imperfect.\\n\\n\r\nArt was really enjoyable - scenery was beautiful, and characters had artistic quirks where it counted. I think the art deserves a ton of praise for how intelligently done it was.\\n\\n\r\nSo, summarizing the negative characteristics of the plot, which are really the negatives overall - Kokkoku starts off great, then drags, repeats certain \"dramatic\" moments too much to the point of some predictability, then gets great again. There was so much world building, and plot development, that could have happened that Kokkoku doesn't, to my liking, take advantage of, and which I think it suffers for. \\n\\n\r\nI had originally said that the intro and outtro songs would, combined, give a good perspective on what Kokkoku is like. I rescind that now. If you want a better idea of what Kokkoku will be like, watch the outtro (though the show itself doesn't rely as much on fanservice as the outtro would have you believe, the tone of the outtro is closer to the overall tone of the show).\\n\\n\r\nThe intro is amazing, and well worth a watch even if you aren't someone for whom Kokkoku will tickle your fancy.",
            "date": "2018-03-31T17:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 276030,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hairam",
                "username": "hairam"
            },
            "url": "https://myanimelist.net/reviews.php?id=276030"
        },
        {
            "content": "It would have been a 5 if the ending hadn't been so nice haha. This review is spoiler free !\r\nStory: 6/10\r\nI picked this series up right away simply because the story seemed very different, and well, it is extremely different. I enjoyed the originality of the series but at times it feels convoluted. I still don't entirely understand the show and that's disappointing. It feels rushed in parts where I could see them expanding on a specific concept or character idea. I understand the general gist of the story but I still have more questions than answers. It's most definite that we won't be gettinga sequel which blows. While I did enjoy the ending and how it was tied together, I think the final episode could have been more fleshed out in more than one episode. Again, awesome concept, but poor execution. \\n\\n\r\nArt & Sound: 6/10\\n\\n\r\nArt/Animation is pretty average. It looks bland in most scenes and doesn't really captivate me in anyway. The score is also average, nothing outstanding. The only great part of the whole score is the Opening! I love the opening. One of the best of the year by far (as of March). \\n\\n\r\nCharacter: 7/10\\n\\n\r\nMost of the characters are enjoyable and Juki does get some development as our main protagonist. However, I don't feel any emotional attachment to any of the characters. I can't say I really remember their names ? I liked the grandfather and Juki the most but other than that, they're all pretty forgettable. The main villain is alright, but he's not that great either. AND he has the weirdest twist to him. Like weird on a whole new level just like the major Psycho Pass twist (if you don't know what I'm talking about then you need to go watch Psycho Pass!!!!) To me, the characters are just average but not unbearable. \\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nDespite the criticisms, I did enjoy myself. There were some highlights to a otherwise very average show. I was always interested what was going to happen next and I really did like the ending :)\\n\\n\r\nOverall: 6/10\\n\\n\r\nWould I recommend? Yes, to people new to anime. To people who have seen a lot of anime and know what they like, no, unless you're into weird anime like this haha.",
            "date": "2018-03-25T19:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 275088,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3776165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeZ0id",
                "username": "AnimeZ0id"
            },
            "url": "https://myanimelist.net/reviews.php?id=275088"
        },
        {
            "content": "I want to do this review, but before I need to tell some truths about the users of MAL: I really find counterproductive revisions on the [profile] page of the work before its end. I do not see problems with certain people developing some kind of hatred for the series, but remember there is a synopsis in the profile, and that if someone read it then you are aware of what will happen when you start your successive episodes. The rule of three, which involves three watched episodes to see whether or not it is worth watching a series is much advocated in the webcommunity, however, few people take this into account and prefer to do a review on the site page where [by except I believe it should be so] there should only be comments of who actually saw the work as a whole, not just three episodes. The forum was made for weekly discussions about each episode. I really hope that My Anime List users who have this kind of practice grow up and stop with that kind of childish attitude.\\n\\n\\n\r\nThe supernatural story about certain families who have an artifact that activates temporal powers is really a good premise. In certain respects, Kokkoku manages to pack his mysteries and keep you stuck. Although these premises were interesting, there was something that could really be remarkable in the series. Maybe a stronger direction. However, since I am not a reader of the original material, I could hardly comment. Even so, the series as a whole was interesting, with some unusual events. However, I also have personal complaints about these \"happenings\", as some scenes of brutality could have been much more striking, but were worked on to reduce gore. That was a loss. Another question is the work of Geno Studio: although a new studio that will have a lot of work to improve, Geno Studio had serious difficulties during the course of the series: some scenes were not well finished, and these technical failures were very evident from the medium to the Last. Scenes from a distant perspective clearly showed these shortcomings, with the designer deforming on certain occasions.\\n\\n\r\nHowever, I must point out that, although Kokkoku left out in its technical part on several occasions, it was still very busy. But these failures and the lack of a more exquisite direction in scenes that were supposed to be better elaborated really ended up diminishing the quality. Overall, the animation flowed, but the consistency errors were really one point off the curve. I personally would not judge the studio for this one work, since it's a studio that started now, and is still structuring itself with its producer. But Golden Kamuy is coming and will be a good point of evaluation. Anyway, I believe this was a good story, but it had some drawbacks to make the production really good, as, for example, the technical part [consistency], the direction, both general and animation [more elaborate scenes]. I still recommend it.",
            "date": "2018-03-25T14:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 275053,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5561908.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ronie91",
                "username": "ronie91"
            },
            "url": "https://myanimelist.net/reviews.php?id=275053"
        },
        {
            "content": "Kokkoku is a solid series exploring what happens if you have the ability to stop time (to enter a frozen world called \"stasis\"), but the series fails to really realize its full potential and a lot of important questions remain unanswered. \r\nNOTE: this review is spoiler free\r\nSTORY - 5 \r\nThe story is a bit strange. It starts off very different from the usual, with an adult casts of characters attempting to rescue their nephew/grandchild who gets kidnaped by a gang for ransom money. The grandpa apparently has a magical stone which is able to stop time that had been secretly passed down in their familyfor generations. They (the grandpa, the main character Juri, her father and NEET brother) activate it to rescue the child but unknowingly, another group enters this frozen world of \"stasis\" at the same time. This group turns out to be religious cult that worship the mystical stone and want to steal the stone from the Yukawa family \"to make the world a better place\" (I'm assuming through world domination). The main antagonist of the series ends up being Sagawa - the leader of this religious cult. \\n\\n\r\nFrom rescuing the boy and exploring the world/rules of stasis, the story shifts into the second half to defeating Sagawa and returning to the normal world. \\n\\n\r\nART AND ANIMATION - 5 \\n\r\nThe art is simply decent. The characters look very plain and generic. Nothing really stands out about their design to be honest and their design is highly forgettable. Overall, the series looks decent but there was never a moment \"wow, that scene looks really awesome!\" I do however want to give props to the CGI work done on the herald (the monstrous guardians of the world of stasis who kill anyone that breaks the rules) as being well done with fluid movement. They didn't seem out of place and blended in with the rest of the 2D characters seamlessly. However, the series still doesn't stand out at all in terms of art or animation. \\n\\n\r\nSOUND - 6 \\n\r\nThe best part about the OST for this series is hands down the opening. Its catchy, memorable, and stands out from all the other openings this season in terms of sound. The transition music during the break intervals is also unique and different. The ending was quite plain though and the other background music in the show is either existent or forgettable to the point where I honestly can't recall what other pieces in the OST sound like. The sound in this series is honestly much closer to a 4 or 5 but the opening and transition sequences bump it to a solid 6 \\n\\n\r\nCHARACTERS - 7 \\n\r\nThe characters are the most unique aspect of this anime. The overwhelming majority of the casts is adult, with 1 child being involved. There was never a SINGLE HIGH SCHOOL OR MIDDLE SCHOOL CHILD. That honestly deserves a standing ovation on its own. \\n\\n\r\nWe have the main character Juri - an average adult woman struggling to find a job. She looks up to her older sister who works tirelessly to support her son Makoto. Juri (Makoto's aunt) want to help support Makoto to grow up to be a decent adult that the family can be proud of. \\n\\n\r\nJuri's father is a stay-at-home-good-for-nothing and arguably the worst character in the show. He is a scumbag honestly but written o be believable. He choses to remain unemployed while his adult daughter works odd jobs to support her son on her own and does not contribute financially, but cares a lot about being respected as \"the head of the family.\" He has been shown to be someone willing to manipulate and abuse any power given to him to get rich. \\n\\n\r\nJuri's older NEET brother is a shut in that loves gaming but hardly goes out. There isn't really much characterization for how he ended up as a NEET but there is an interesting moment when his character is used to demonstrate what humans are capable of when pushed against the wall. He doesn't get as much screen time as the rest of the casts though. \\n\\n\r\nJuri's grandfather is an upright man with strong morals. He is respectable, dependable, and cares about his granddaughter Juri and great-grandson Makoto immensely. He is willing to sacrifice himself for his granddaughter's well-being. \\n\\n\r\nJuri's nephew Makoto - he gets kidnapped early on but is overall a good kid. His perspective of the world of stasis shows how innocent children are (and how readily they accept new unexplainable things) but other than that, he is just a regular kid that loves his mom and family. \\n\\n\r\nSagawa - the main antagonist. Despite his antagonistic role, he really isn't the typical villian and has zero interest in getting rich, gaining power, or taking over the world. He only want to see the end of time/the universe and see how humanity changes, which would be impossible with his normal human lifespan of ~100 years. His desire to see time unfold is his only reason for chasing the stone and he uses the religious cult he is in charge of only as a means to an end. He does get a flashback that explains his pasts. By far, he is the most interesting and well developed character in the series. \\n\\n\r\nThere are 3 other notable characters - a doctor, an ex-member of Sagawa's religious cult, and a woman that agreed to temporarily work with Sagawa. The woman does have a strong motive for chasing down the stone and the Yukimora family, but the doctor was just being blackmailed/fearing for his life, while the ex-member was simply hired help. The other members of the religious cult are just fodder.\\n\\n\r\nOverall, the casts is diverse and deviate from the norm, and Sagawa isn't a generic villain, but a lot of characters could have been given more characterization and fleshed out a bit more, landing this at a 7. \\n\\n\r\nENJOYMENT - 7 \\n\r\nThe series was overall enjoyable with a unique story that deviates from the norm. It was interesting from start to finish. The episodes knew when to have a cliffhanger and the world of stasis had a lot of unique dynamics. However, by the end, your left wondering what the anime accomplished and what its goal/message was...to defeat Sagawa? To show the dangers of being able to stop time? Although the series was enjoyable, it feels like there wasn't a real PURPOSE for the story to exist or unfold.   \\n\\n\r\nOVERALL - 6 \\n\r\nThe anime has a lot of good but there are too many unanswered questions and wasted potential for this to be rated any higher than a 6...\\n\\n\r\n-How did the Yukimura family get the stone?\\n\r\n-The ending...we don't enough details about the woman who was \"born with a specter in her body\" Is she the only one? Are there others? What about details of her husband? How does this woman feel about never aging and freely being in the world of stasis? \\n\r\n-The mechanics of how Sagawa could \"reset\" his life...so to speak\\n\\n\r\nInstead of focusing the anime on the story of Juri, it would have honestly been so much more interesting to focus the story on the unnamed woman in the final episode who was \"born with a specter.\" What where her experiences? How did see meet her husband? How did she feel watching her husband change from being in love with her and wanting to be with her to becoming obsessed with the world of stasis? How does she feel about the way humanity has changed over time? It also would have made more sense for this woman to have meet Sawaga and \"set him free\" or helped him, as this woman is essentially the ideal that Sagawa was trying to reach. I feel like it would have been so much more meaningful for Sagawa to meet her and realize how painful her existence is and that the anime would have been infinitely more interesting and dynamic if she was the main character instead. \\n\\n\r\nHowever, the anime still did explore and create some interesting concepts via the world of stasis, so taking into account all its flaws and strengths, it lands at an overall score of 6",
            "date": "2018-03-25T12:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 275039,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3858971.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PandorazChaos",
                "username": "PandorazChaos"
            },
            "url": "https://myanimelist.net/reviews.php?id=275039"
        },
        {
            "content": "Kokkoku is one of the best anime series this season due to the various interesting elements like the Story, Art style and Sound. \r\nThe story and plot itself is nothing we've seen that stands out, it's just time travel with an object that's regarded as a family heirloom for generations at will.\r\nI would say, since Boku Dake Ga Inai Machi, this another time traveling or I should say heart Stopping anime is quite a pretty good anime for this season. I don't care if others don't like it but I'm sure you're gonna love it.\r\nThe MC being the one girl Juri Yukawa whose life takesa toll when nothing goes her way and meeting her dysfunctional family of weirdos and only when her life is mystified by the family heirloom then she becomes OP, with the help of her grandfather whose memories align with the heirloom, making both characters literally OPed from the start. The only consequences were with the organization known as the Genuine Love Society and the useless family members whose presence hinders the rich development of the Stasis world and the Herald.",
            "date": "2018-02-28T06:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 272659,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5524109.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/God_Yamcha_234",
                "username": "God_Yamcha_234"
            },
            "url": "https://myanimelist.net/reviews.php?id=272659"
        },
        {
            "content": "I think this review is mostly for those whom have seen the show but if you haven't then let me just say don't watch it and expect for action filled mystery.\r\nThe show showed quite early on that it wasn't going to take itself seriously. There is no puzzle to solve or riddles to figure out. It's a ride with family drama because they are quite a dysfunctional family. Which our main character Juri explained to us in the first episode. The show is about the people in this household that don't have their shit together. That is why the most responsible people in the houselike the two mothers where not dragged into the stasis.\\n\\n\r\nI'm just a bit pissed by the reviews that wrote this show off as straight out shit. It's all about taste when it comes to Kokkoku. If you like characters with realistic take on an unrealistic situation then yeah you'll most likely like it. But if you want answers for all the question Kokkoku made then you'll be deeply disappointed.\\n\\n\r\nI think in episode two when Juri's grandfather answered Juri's father question about how the the stasis works is Kokkoku in a nutshell. Cause he doesn't have the answer for all those scientific questions. Kokkoku's author doesn't either so to make it believable obviously the character's have to be believable. That's it.\\n\\n\r\nStory: 6\\n\r\nI give the story a 6 cause it was a bit lazily planned out and it's not a new concept but still some originality that made it interesting and fairly executed. In the end it was never about stasis or mystery. Just family drama. That was fine by me. (Also it is a bit about accepting the inevitable deaths and go on with life.)\\n\\n\r\nArt: 4\\n\r\nDecent. It was sometimes good and sometimes bad. Not outstanding at all. Just decent. There are some CG scenes but it wasn't enough to make want to gauge out my eyes at least.\\n\\n\r\nSound: 6\\n\r\nI find Juri's voice a bit annoying sometimes but that's me. There's no soundtrack that stood out much. The opening was good though.\\n\\n\r\nCharacter: 7\\n\r\nYeah I liked them. Sure the other cult members were flushed down easily, they had no personalities and that's kinda disappointing. I mean personalities/characters can be shown in different ways but Kokkoku just \"nah\". The main characters were well done in my opinion. They weren't super realistic and complex but it wasn't bad at all. Every choice that they made showed that they have some kind of thought and it reflected their personalities quite well. I liked that. \\n\\n\r\nEnjoyment: 7\\n\r\nI liked that their choices reflected their personalities. It was plausible to me so I enjoyed it even though the world building were kinda messy and lazy. It's a perfect late night binge that isn't trying to be more than what it is. Easy to comprehend and that's it. It was wholesome, I wouldn't wish for another season though. \\n\\n\r\nOverall: 7\\n\\n\r\nUh yeah.\\n\\n\\n",
            "date": "2018-12-30T13:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 297508,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3691915.jpg",
                "scores": {
                    "animation": 4,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kurutteru",
                "username": "Kurutteru"
            },
            "url": "https://myanimelist.net/reviews.php?id=297508"
        },
        {
            "content": "Concept: 7/10\r\n An interesting concept. It deals with freezing time in alternate universe. Bits and pieces of super powers. It piques my attention, draws me which is a good start. The first two episodes are attention grabbers.\r\nPlot: 6/10\r\nAlright, this anime has amazing concept. Nonetheless because of the plot holes, unnecessary events and the way the plot is expanded does not flow that well, I deduct marks on this part. And the villain to me is kind of mediocre, nothing extravagant that I should take note off. The fighting scenes are... umm, so-so. I expected something more. If directed properly, the amount of episodes of thisanime would be somewhere around 7-8 but the resolution and climax of this anime are dragged until episode 12. \\n\\n\r\nCharacters: 5/10\\n\\n\r\nI don't have any favourite character in this anime. All characters are very mediocre. Nothing special about them even when some of them do possess cool super powers. But I think they can definitely omit a few characters like for example the Dad and also Tsubasa. The anime works just fine without them. Though If I do really have to choose which character I like, then I'll go with Makoto, the little kid. At least he's cute. And the Herald. Yeap, I find the Heralds cute too.\\n\\n\\n\r\nGore: 6/10\\n\\n\r\nNo bad. Kind of cool with the appearance of the Herald, it's definitely not a show for kids. However, as the episode continues, the scenes in my opinion becomes less thrilling and gory so I wouldn't say it's one of the best gory anime.",
            "date": "2018-12-14T04:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 295751,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5567684.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kurosmile",
                "username": "kurosmile"
            },
            "url": "https://myanimelist.net/reviews.php?id=295751"
        },
        {
            "content": "Juri has had a tiring day going through a whole line-up of job interviews and decides to let her NEET brother Tsubasa go fetch their nephew for a change. Never did she expect they'd end up being kidnapped. When they receive a call to pay a ransom, her grandfather reveals they have a mysterious stone that allows them to freeze time. Thinking they had the upperhand, they suddenly find themselves attacked by unknown assailants who were immune to the stone's effects and wanted it for themselves.\r\nWhen I first watched this I thought it had a vibe similar to Gantz. It ran at a steady seriouspace with short bursts of drama with a very dark and continuous mysterious atmosphere to it just like when the participants of Gantz was trying to figure out the game or the black ball. It also has about the same amount of gore. Funnily enough the director Yoshimitsu Ouhashi did the storyboarding for that show.\\n\\n\r\nThe mystery kind of kept me watching and I think the characters are likeable because despite having powers they each have their own vulnerabilities that make them human. How the situation progresses makes it quite a compelling show to watch in this short series.\\n\\n\r\nOn another note, the OP theme song is horrible IMO but the ED \"Asayake to Nettaigyo [Sunrise and Tropical Fish]\" is pretty good.",
            "date": "2018-09-18T05:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 289303,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7426800.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xcomprr",
                "username": "xcomprr"
            },
            "url": "https://myanimelist.net/reviews.php?id=289303"
        },
        {
            "content": "A refreshing new story. The protagonist Jiisan Yukawa when faced with a dire situation to save his great-grandson Makoto and Tsubasa (both were kidnapped when Tsubasa was bringing Makoto home from school) reveal a family secret. He had a stone that had been passed down in his family from one generation to the next. The stone holds the pathway to the stasis (a world where time is stopped or a static world). When blood is soaked in the stone it activates the stone. Some jellyfish like creature called Specter appear from the stone and enter the bodies of the people around the stone. Specters areinhabitants of the stasis. There also exist a duplicate stone which cannot be activated on its own rather is depends on the master stone for activation. This stone also spawns Specter. Once in the stasis, the protagonist with his son Takafumi Yukawa and granddaughter Juri Yukawa go to rescue them. While they were there, some people rendezvous with them. They were there after the protagonist and the stone. These were the members of Genuine Love Society. When a member of the society tries to kill a stalled, a handler appears and crushed the head of the killer. Once a person dies in the stasis, its Specter enters a stalled person in the Yukawa bloodline only because Specters are familiar with there blood. Then the members realise that the handler or the Herald as they call is not as big as they had read in the scriptures. They later on find out the handlers converts its mass to energy, which is utilized in materializing and moving. When all the energy of the handler is used up, it dies. The protagonist had the power of short distance teleportation while his granddaughter had the power to expel the Specter from the bodies of humans.",
            "date": "2018-07-27T02:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 284875,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/krullun",
                "username": "krullun"
            },
            "url": "https://myanimelist.net/reviews.php?id=284875"
        },
        {
            "content": "Well.. as expected for a seinen anime, Kokkoku did not fail to deliver what it tries to point out. Right off the bat, things come to a strange situation and it is really confusing to know what the story is all about. I honestly can't describe this series and I don't really know what to say about it. The only thing that comes to my mind is that the feeling I had when watching this was that I have seen this story development before and it's really that predictable. Among the other supernatural series, this one was the most plain for me. The story mightbe unique but the plot is all but something that was stolen from somewhere else. The art wasn't that much of a failure and it did its job to bring out the seinen feel that can be compared with other series. The soundtrack is decent and the opening and ending themes fit very well with the psychological genre. The characters however... through the whole duration of the show, I couldn't believe how serious and calm they are having been put in a supernatural and life threatening situation. I don't know if I should be amazed or disappointed at how they act so normal even though everything isn't so right anymore. I can't say that I enjoyed this series because throughout watching it, I was sort of lost and confused though everything was explained and enough information was displaced. I just didn't seem to catch the feel and passion for this show. I can't really recommend this if you're here to enjoy. I might be able to recommend this to people who want a change of pace? If so, then prepare to enter the world of stasis from this series... Kokkoku",
            "date": "2018-04-25T01:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 278957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=278957"
        },
        {
            "content": "The premise of the anime is interesting so it isn't hard to watch all 12 episodes. I like the art and the humor sprinkled in between. To me, I think the plot could have been better paced as a movie. I feel that there are many underdevelop lines, and if there is a theme it is not very clearly delivered. There is so much potential to be more whether it was as an action-drama genre or through a psychological/philosophical route. Yet, it doesn't push the boundaries. Or to put it in a non-spoilery manner, the anime provide fixed, optimized, socially accepted answers. \r\nDespite these flaws,I enjoy just watching the process, just watching the action and not thinking too much about it.",
            "date": "2018-03-30T23:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 275843,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2684595.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/dsleech",
                "username": "dsleech"
            },
            "url": "https://myanimelist.net/reviews.php?id=275843"
        },
        {
            "content": "Kokkoku is the type of anime that started off interesting, dulled a bit in the middle, and then threw an ending I honestly hadn't expected. While there were some portions of the ending I had expected, the way they wrapped it up was definitely different.\r\nThe entire concept of Kokkoku was interesting to me from the beginning. It wasn't your every day time travel story. In truth, it's much more complicated than that. It really isn't even time travel more than it is \"time freezing.\" I thought it was unique and interesting. The layers of Kokkoku is something I can definitely appreciate with fondness.\r\nWhile I didenjoy the story, the art and sound itself were okay for me. I wasn't overly attached to them and they didn't do anything for me. The only reason I'm  giving the sound a 6 instead of a 5 is due to the simple fact that the op was so good it gets a point all on its own. The characters were all enjoyable to me though and I did enjoy Juri's character development over the course of the story.\\n\\n\r\nWhile Kokkoku is not a masterpiece by any means, I would still recommend this anime to some. I don't think of it as one of the best anime I've ever seen, but I still found it enjoyable and think those interested should at least give it a chance. Bottom line; would I watch it again? Probably not. Would I still recommend it to others? Yes.",
            "date": "2018-03-28T17:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 275503,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971075.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rachachan",
                "username": "rachachan"
            },
            "url": "https://myanimelist.net/reviews.php?id=275503"
        },
        {
            "content": "Kokkoku is one of the best mystery thrillers in ages. The characters found in this series are very relatable as being ordinary people caught up in a supernatural crisis. With each episode the mystery grows bigger as the main cast is given more surreal obstacles to overcome,and it can lead to some of the most frustrating cliffhangers as you're excited to learn more. Mixed with stunning visuals and a well done soundtrack, the story is complimented by a fantastic mix of everything else that makes for a quality journey. While Kokkoku is far from perfect, it is a fantastic and thrilling journey from beginning toend, and one you certainly would not regret watching.",
            "date": "2018-03-26T01:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 275124,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6046829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/iMustang",
                "username": "iMustang"
            },
            "url": "https://myanimelist.net/reviews.php?id=275124"
        },
        {
            "content": "Eu quero fazer esta revisão, mas antes eu preciso dizer algumas verdades sobre os usuários do MAL: eu realmente acho contraproducentes revisões na página [perfil] da obra antes de seu término. Eu não vejo problemas certas pessoas desenvolverem algum tipo de ódio para com a série, mas lembrem-se que há uma sinopse no perfil, e que se alguém a leu então está a par do que vai acontecer ao iniciar os seus sucessivos episódios. A regra de três, que implica três episódios assistidos para ver se vale a pena ou não assistir uma série é muito defendida na comunidade da web, porém, poucas pessoas levamem consideração isso e preferem fazer uma revisão na página da obra, onde [pelo menos eu acredito que deveria ser assim] só deveriam haver comentários de quem realmente viu a obra como um todo, e não somente três episódios. O fórum foi feito para discussões semanais sobre cada episódio. Realmente espero que os usuários do My Anime List que têm esse tipo de prática cresçam e parem com esse tipo de atitude infantil. \\n\\n\\n\r\nA história sobrenatural a respeito de certas famílias que possuem um artefato que ativa poderes temporais é realmente uma boa premissa. Em certos aspectos, Kokkoku consegue embalar os seus mistérios e manter você preso. Embora essas premissas fossem interessantes, faltou algo que pudesse realmente ser marcante na série. Talvez uma direção mais forte. Porém, como eu não sou um leitor do material original, dificilmente poderia opinar. Mesmo assim, a série como um todo foi interessante, com alguns acontecimentos inusitados. Porém, também tenho queixas pessoais sobre esses “acontecimentos”, pois algumas cenas de brutalidade poderiam ter sido muito mais marcantes, mas foram trabalhadas de modo a diminuir o gore. Isso foi uma perda. Outra questão é o trabalho do Geno Studio: embora um estúdio novo que terá muito trabalho para se aprimorar, Geno Studio teve sérias dificuldades ao decorrer da série: algumas cenas não estavam bem-acabadas, e essas falhas técnicas ficaram muito evidentes do meio para o final. Cenas de uma perspectiva longínqua mostrava claramente essas deficiências, com o designer deformando em certas ocasiões. \\n\\n\r\nPorém, eu devo ressaltar que, embora Kokkoku deixasse a desejar em sua parte técnica em várias ocasiões, ainda assim era bem movimentado. Mas essas falhas e a falta de uma direção mais primorosa em cenas que deveriam ser mais bem elaboradas acabaram realmente decaindo a qualidade. De modo geral, a animação fluía, mas os erros de consistência foram realmente um ponto fora da curva. Eu, pessoalmente, não julgaria o estúdio por esse único trabalho, visto que é um estúdio que começou agora, e ainda está se estruturando com sua produtora. Mas Golden Kamuy está chegando e será um bom ponto de avaliação. Enfim, eu acredito que essa foi uma boa história, mas que teve alguns empecilhos para tornar a produção realmente boa, como, por exemplo, a parte técnica [consistência], a direção, tanto geral quanto de animação [cenas mais elaboradas]. Ainda assim eu recomendo.",
            "date": "2018-03-25T14:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 275055,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6084664.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ronie19",
                "username": "Ronie19"
            },
            "url": "https://myanimelist.net/reviews.php?id=275055"
        }
    ]
]