[
    [
        {
            "content": "\"Even if we lose by 100 points, there’s a chance a meteor will strike the other team’s bench in the last second.\"—Kuroko Tetsuya\r\nSequel to season one, Kuroko No Basket 2 does not disappoint. The new season begins with a mild time-skip after the inter-high matches. Seiren High—no longer the underdog—is now of equal footing in terms of basketball recognition. The most notable difference the time-skip offers would be the physical improvement of the players; all other improvements—such as unique skills—are publicly developed in season 2. If anything, the anime has adapted an even faster pace and incorporates an unexpectedly drastic increase in the amount ofaction per episode. Games are now longer, more intense, and developed. The level of play has increased to a higher caliber. There are no more \"easy\" opponents in this Winter Cup. Each team has a unique play style, some specializing in more specific areas such as defense, offence, or speed. However, all teams must bend their play style in order to counter their opponent. This constant change of pace and strategy creates a fast paced, entertaining battle. The shounen aspect of the anime often shines during the intense moments of the game—where players are at full potential. Although shounen abilities are bound to be unrealistic, the anime counteracts some of this illogic by offering thorough explanations behind some abilities such as Kuroko's misdirection. As stated before, the games have gotten longer, meaning there are less games played but more detail to each specific match. \\n\\n\r\nThe entertainment level has reached an all new high, various jaw dropping moments are wisely incorporated to avoid repetition. To top it off, the anime captures viewer's attention by further expanding in the realm of character depth. Kuroko gains more expression and passion, and remains a glowing catalyst. Kuroko, \"the shadow\", cheering along with his team speaks volumes about how much character development takes place. Other basketball players too, receive a hefty amount of attention. Aces are prominent as usual, but now regular players are given much more spotlight. Whether it be three pointers, fakes, dunks, or passes each play is valuable. There are many times where players simply want to give up; honestly it's not easy to have endless motivation in face of defeat. Each character has their insecurities and doubts when it comes down to their skill level and natural talent, but it's ultimately up to them to decide if they will let that affect them. Teamwork is demonstrated through many lights, with emotionally supportive remarks accompanied by intermediate coordination, the value of trusting your teammates is highlighted. \\n\\n\r\nThe large amount of characters does have its downfall though. Not all characters receive recognition deserved, and even some of the former \"mini-main characters\" become less prevalent. The freshman hardly get any playtime, if any at all. They are mostly seen cheering on the team, rather than competing with the team. We miss out on the development and improvement of other teams due to the heavy focus on Seirin High. Still, the character development we do get is appreciated and worthwhile. Dual gender fan-service is implemented in two or three episodes, but it doesn't hinder the plot.\\n\\n\r\nArt and sound has improved, not dramatically, but notably. Scenes where game-play is at peak, is where the artistic improvements are easily visible. The characters have more \"fluid\" movements, and facial expressions are clearer. The OP and ED are pleasing, and fit well with the heart-racing action. Voices are well done as usual, the English, however, is horrible. It's to be expected though,  as I believe none of the voice actors use English other than for acting. \\n\\n\r\nSomething that has bothered me throughout the series was the exaggerated portrayal of the members of the Generation of Miracles. Members of the GoM were depicted as godlike undefeatable players. Although the GoM's abilities certainly deserve enormous recognition, no individual player—so far—has shown to be as overpowered as claimed; which is good. Each team has their own Aces, and below those Aces are above-average important players crucial to the team.  Currently, the setup of one GoM per team, makes the competition in the Winter Cup relatively equal. The key games are expected to be close battles. \\n\\n\r\nAnother slightly problematic area is time. Seirin is an \"end-game\" team, but sometimes the star moments are too miraculous and timely. Like season 1, many times Seirin manages to unrealistically catch up towards the last minute(s) of the game. Some moments are so exaggerated that 20 seconds in the game timer is actually 3-4 minutes of the episode. Timing could have been better, to accommodate  the intense game play. Even though it's nice to see a team catch up inspirationally, it should be saved for rare occasions. Under-use is better than over-use in situations like these. \\n\\n\r\nI would strongly recommend viewers who enjoyed season one, to watch this season. Kuroko No Basket 2 manages to leave you wanting more. It was far too easy for me to finish these 25 episodes, as some games were so intense and involving it was difficult to stop watching. \\n\\n\r\nThanks for reading this review, have a great day! \\n\\n\\n",
            "date": "2014-04-12T10:20:00+00:00",
            "helpful_count": 157,
            "mal_id": 139671,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NostalgiaCrisis",
                "username": "NostalgiaCrisis"
            },
            "url": "https://myanimelist.net/reviews.php?id=139671"
        },
        {
            "content": "The long awaited second season of Kuroko no Basuke- if you found the first season enjoyable, then I assure you... the second will not disappoint.\r\nAs expected, the second season acted as a continuation from the first, cutting straight to the Winter Cup and previewing of most of the main participating teams. If I were to describe the plot in one sentence, it would simply be 'Seirin High fights to win the Winter Cup.' \r\nAnd that's all the second season needed to be as incredibly epic it was.\r\nWas this story unique? In a way, it was. In a way, it wasn't. Kuroko no Basuke is categorizedas a shounen anime; therefore, do not watch this series (this goes for the first season as well, obviously) not expecting certain shounen elements. Don't watch this series if you utterly DESPISE shounen, because more than likely, you will be disappointed. Like any other shounen, Kuroko no Basuke has friendship elements- players power up for the sake of friendship. \\n\\n\r\nHowever, the uniqueness of this anime all boils down to one thing: the characters. If crazy as fuck abilities are what made this anime a shounen, then it's these characters that pull the show back to reality. I've seen many a shounen, and while the characters are awesome, the excitement is often short-lived. Shounen protagonists may not always be completely flat. I have seen promising characters with engaging and emotional pasts and come to love them. But what TRULY makes a series, which happens over a span of time, is character DEVELOPMENT. There is nothing more disappointing than jumping in with the characters and following along on their journey, only to realize they never grow. \\n\\n\r\nBecause of these incredibly dynamic characters (and despite being a relatively short series, the number of characters who got development is impressive) a complex plot lies underneath that one simple sentence. Humans are complex, and the way these characters are portrayed is almost astonishing. This plot is nothing to awe at; just hearing it alone won't prepare you in the slightest for what this series will bring you... but it suits it incredibly well. This is about high school boys doing what they love- playing basketball. A plot more complicated than this simply will not do. \\n\\n\r\nThis plot, however, will have its downsides for certain people. For one: it is incredibly exaggerated. Characters will have five minute dialogues in the middle of the court, thought speeches in the middle of a dunk or a shot, and impossibly agile movements that are enough to make your eyes spin. A major complaint for this show is that it’s very unrealistic compared to actual basketball. And the truth could not have been said better. Face it folks, never in your life will you see someone legitimately shoot a basketball on the opposite end of the court, have an arc high enough to nearly reach the ceiling, and make it in without so much as touching the rim. If you are looking specifically for honest, realistic basketball, then save yourself some time because that is not what you will find here. (I would suggest Slam Dunk.)\\n\\n\r\nHowever, this exaggerated plot is also what makes this anime unique, because it takes basketball on a completely different level- and does it well. While this show may be ridiculous, this provides all the more opportunities to break out huge levels of excitement and pure thrill from the watchers. It made this as interesting, epic and thrilling as it was. Never once was I bored watching them play a game. And as mentioned before, this is a shounen; characters will have ridiculous abilities… but these abilities are also very cool. :D\\n\\n\r\nTwo: on a basic level, the show can be predictable. From watching, you could probably guess who wins or loses. This is that kind of anime that makes you think, ‘The main guys will probably win.’ In that sense, and in that sense only, this show is predictable.\\n\\n\r\nBut the method by which they win is not predictable. A game will take unexpected twists and turns, and while you probably know that they’ll come out on top in the end, you may wind up thinking at some point, ‘This looks really bad for Seirin.’ By the time the last buzzer sounds, having seen them struggle like hell, you would feel that they truly did deserve their victory, that they did not just pull a victory from their asses in the name of ‘friendship’ because the physical and mental struggles were so well depicted. While Kuroko no Basuke did throw logic out the window and made its own, there is a certain flow to their victories that follow logic to that extent. Forgive my poor explanation, but that’s all I can say on this particular matter.\\n\\n\r\nThree: there’s… fanservice? Kuroko no Basuke is by no means chock full of it, but during those few instances, they don’t hold back, both on the male and female side. If you despise fanservice, then this anime may not be so great for you.\\n\\n\r\nThe plot has excellent pacing with endings that make you want to pull your hair out. Humor is a strong point with this one, and the show never tries too hard to be funny which is good. Their moments are well timed and contributed to my enjoyment quite a bit. In terms of plot, the show is definitely well off. \\n\\n\r\nThe art has certainly ramped up quite a bit from the first season, both in the drawing of its characters and the animation... oh, the animation. It's nothing to laugh at. In the first season, the animation, most particularly in the beginning, was on that fine line between average and just plain bad. While it did have its moments (one being Aomine's ridiculous play) for the most part it wasn't anything to brag about. It did its job, but, for lack of any other way to say it, it was average. The SECOND season, however, had little or nothing to complain about. If you've seen the first season, the second you see the second season's OP... you know this series will be one hell of a ride. Just those few short minutes will tell you how far the show has come in terms of animation and art. The characters appear slightly older (which isn't unexpected) and art also a bit cleaner and brighter, well worthy of 2013/14. If you are a person who watches anime for attractive characters, then you will not be disappointed. Of course, there is and always will be those moments where the video stops to buffer or you happen to pause at a particularly awkward moment and the character was drawn so terribly in that one frame that it's enough to make you want to face palm. Very rarely do I notice these awkward moments while the video is running, however, and when I do it's never for more than a few seconds and not nearly enough to take my enjoyment away from it or make me complain. \\n\\n\r\nSound for the second season was another plus in my book. As far as I know, all the characters of season one retained their VA's into season two, and I have no qualms with the new additions. Kagami's English is still laughably bad, but whether you consider that a pro or con, I'll leave to you. Soundtrack, while not as good as the first season's, does have its redeeming pieces and never worked against the story. However, they have gotten repetitive to the point where I've NOTICED that tracks were being used more than a few times, and as this was never a problem for me in the first season, this could be called a negative. The openings and endings, however... were excellent, There's no other way to put it. While the actual sound tracks weren't as good as in season one, the openings and endings I believe to have exceeded the first's overall quality. I've come to like each and every one of them, which is unusual because no matter how short a series there would always be a few I didn't have particular love for. But, all of them were excellent. Though the first OP and the second ED (sung by Kuroko, mind you) are my personal favorites, I've fallen for every single one of them. \\n\\n\r\nAs mentioned before, the characters are where the show excels. Ever changing and growing, if there's a single character you dislike, there will be at least ten you love. Ranging from a small, quiet and unnoticeable boy (gee I wonder who that is) to an eight feet tall lazy ass freshman of a colossal titan on the court, each and every one of the characters has their own memorable quirk that will make impossible to forget. These guys WILL use their pasts to jerk feels from you, whether you like it or not. They have their weaknesses, their strengths, and the way they interact with each other is pure gold. Truly, they are high school boys. They may fight, they may argue, and they may beat each other senseless, but they come through in the end. I have zero complaints as far as their appearance and designs (you could literally tell who's who just by looking at their hair) and their personalities complimented their skills on the court quite well. Unfortunately, I do have SOME complaints in terms of the characters, and while they weren't enough to keep me from loving this show, I do believe they're worth mentioning. \\n\\n\r\nMost certainly, I was overjoyed that some characters who were in the last season had a chance to show who they really were. A good amount of characters were explored, an amazing amount of characters developed... but a lot of characters were also left neglected. The girls, though I hate to say it, were used for little more than fanservice. Sure, Momoi dragged Aomine's ass to see a game and Riko trained the boys, and though I wouldn't say they weren't portrayed as a significant part of the plot, they didn't get nearly as much development as they should have. Seirin's coach, despite training them to the level where they had advanced to the finals of the Interhigh with nothing but freshmen, and being a freshman and a GIRL herself, had her past explored very little. But, a tad more of her personality is revealed so the whole season wasn't just for naught. However, I can't say the same applied to Touo's manager, who also seems under appreciated. A few more females wander their way into the second season, and while logically they did have MAJOR roles in terms of impact on the characters, their situation in terms of screen time and development aren't any better than those of our previous women. Other under appreciated characters includes the other freshmen on the team, who literally got NOTHING during the second season, though they trained just as hard as the others. These characters should have definitely been given more attention, and it is upsetting that they didn't get more than they did. Regardless, it wasn't enough just yet to keep from watching the show, and I do believe the other characters were developed to the point where this isn't a large problem as for a 25 episode series, the sheer amount of development was already amazing. \\n\\n\r\nMy enjoyment? This may have already been obvious, but I enjoyed this series like no other. Sure, some series may have had me laughing a bit more, crying a bit more, and thoroughly ENGAGED a bit more, but what made Kuroko no Basuke special for me was the careful and vast amounts of all three. The anime is very balanced in every aspect and will not fail to get you hyped. Having already rewatched the first season as well as the majority of the specials, I wouldn't hesitate for a second to do the same for this season. Even on the last episode, I was grinning like an idiot yet incredibly sad when it ended. I love this series from the bottom of my heart and would love to get this out to as many people as possible. If someone I knew wished to give anime a try, I would gladly direct their attention to this wonderful series, because it had nearly every positive characteristic the world of anime has to offer. \\n\\n\r\nBut, as I've also hinted, Kuroko no Basuke is not a perfect series. It has its flaws, and while there are few in my opinion, these flaws will break the show for some people. Again, if you hate shounen, do not watch this. If you’re looking for “realistic” basketball, do not watch this. If women with F-cup breasts are enough to ruin a show for you, do not watch this. If people with ridiculously bright colored hair turn you off, then for the love of God, please do not watch this.\\n\\n\r\nHowever, if you’re someone like me who’s willing to dive into any anime, regardless of how crazy it looks and how impossible it is, just for the thrill and enjoyment of it, then please, do watch this. Because from Kuroko no Basuke, thrill, enjoyment, and a HECKLOAD of feels… will come.\\n",
            "date": "2014-03-30T07:50:00+00:00",
            "helpful_count": 93,
            "mal_id": 137881,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2743841.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tanngerine",
                "username": "tanngerine"
            },
            "url": "https://myanimelist.net/reviews.php?id=137881"
        },
        {
            "content": "I have watched the 1st Season of Kuroko no Basket, it was enjoyable as characters were building up on the series and Seirin team is still raising up. Overall, I have enjoyed the 1st season even though some episodes seemed boring.\r\nNow for the 2nd season, I it was fair overall until the show reached the match between Seirin High and Tou team. To make long story short, the match took too many episodes (even though this was expected in a sports anime), but what I did not like is the power-up (Saiyan) style part of the play, when players were waking up and powering allsuddenly. You might think this was a part of a strategy used while playing in the match, but in fact it was a lame act to add some Shounen style to a sports anime.\\n\\n\r\nIf you want to watch a real basketball anime (even though it is not a new one), I would recommend watching Slam Dunk.",
            "date": "2014-03-08T10:40:00+00:00",
            "helpful_count": 82,
            "mal_id": 135057,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lelouchu",
                "username": "Lelouchu"
            },
            "url": "https://myanimelist.net/reviews.php?id=135057"
        },
        {
            "content": "Kuroko no Basket is actually one of the most exciting sports anime I've watched so far, indeed, some people may say it like \"damn those characters can play fcking godly!\" for most kiseki no sedai players, but that's what makes the show more interesting right?\r\nThere's a little spoiler, so read at your own risk.\r\nStory: 7/10\r\nThe story of the season two is actually a continuation from the last episode of season 1, which is the winter cup tournament, I know that some of the games actually takes us to watch for 2-3 episodes long, some of them are fun to watch and some of themare not. I actually really like for how all the game for each tournament goes on the story but my only main problem is that it is kinda funny to see that Seirin always wins by one point ahead their opponent, I know, there are times that they actually lack abilities to beat the other teams, but they always ended up being the winner. It actually also makes me hate to say this but, just to make Seirin win the game, Kagami's bein' to overpowered and feels like godly himself. That's why I hate Seirin so much.\\n\\n\r\nAnimation: 9/10\\n\\n\r\nI can't say much about the animation and the flow of every character in the series, it is almost perfect, not like some robotic things the other anime have.\\n\\n\r\nSound: 8/10\\n\r\nhttps://www.youtube.com/watch?v=qcF4Bjr-kIk\\n\\n\r\nI have too much to discuss about the sound of the anime, but first, let me just say this that THE ANIME'S FIRST OPENING OR THE OTHER SELF IS JUST AMAZING!! I prefer the first one than the second one. Okay time for the anime's sound..\\n\\n\r\nThere's actually nothing wrong with Kuroko no Basuke's 2nd season sound, in fact it is actually quite clear. Except for the english thing Kagami and Himuro spoke, I can barely understand it, in fact it's obvious that I will not understand their english if there's no subs. /sobssobs\\n\\n\r\nCharacter: 9/10\\n\\n\r\nOH YES THIS. It actually made me laughed when I realized that only the Kiseki no Sedai, along with Momoi Satsuki and Taiga have these amazing hair colors lmao.\\n\\n\r\n*coughs* Okay excuse me for that, but the character illustrations are so far good. Every character is unique, and for every character they have different styles of gaming and such.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nThanks to Kagami and Himuro's english, I actually enjoyed the anime lol jk. But the anime is really exciting as it is, you really don't know who will win the game. Unless you know about the power of one point ahead of Seirin. As I said, every character has their own styles of playing, which it makes it even more exciting.\\n\\n\r\nOverall: 8/10\\n\\n\r\nCan't say much for now, read it all above and you'll know why. But I definitely recommend this anime if you love sports genre. Lovely art and amazing opening and ending songs.",
            "date": "2014-07-28T23:23:00+00:00",
            "helpful_count": 74,
            "mal_id": 154187,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331917.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ginkei",
                "username": "ginkei"
            },
            "url": "https://myanimelist.net/reviews.php?id=154187"
        },
        {
            "content": "Sports have always been a popular topic for debate. Every game is different that shows new elements and surprises. Some of these include plays that will be memorable for years while other includes players that makes in impact in the business. In order to make an impact in basketball, one must have the passion and desire to not only win but play for everyone including themselves. The fundamental concept is that sports should also be played not just for competition but also to develop one’s own character. In Kuroko no Basket 2, we witness characters in a different light as they step up to thefield and deliver basketball plays like never before. It’s more than just about winning a game but to earn the respect of everyone they hope for.\\n\\n\r\nTaking off from season 1, Kuroko no Basket: Second Season is the direct sequel of season 1. It chronicles the lives of two basketball players, Kuroko Tetsuya and Kagami Taiga as part of a team from Seirin High as they take on opponents that tests the limits of their abilities. Among these opponents include the infamous “Generation of Miracles”, famed players from a previous generations known for their prestigious talent and skills that strikes fear into anyone’s mind. Kuroko is known as a former member of this prestigious team by the nickname “Phantom Man”, for his ability to remain undetected on the field. On the other hand, we have Kagami Taiga, a man born with integrity and mind to aim for the top. Together, there is hope for them to become a legend themselves.\\n\\n\r\nBecoming a legend is easier said than done. Throughout the second season, there are many obstacles and challenges that tests our players in ways like never before. It stretches beyond just physically but also on mental levels as opponents they face are willing to do anything, and I mean absolutely anything to win a game. It becomes not just a burden but a fact of unprofessional-like behavior that aims to take down Taiga and Kuroko’s dreams. \\n\\n\r\nDreams aren’t easy to achieve of course. Season 1 presented the struggles of what’s it is like to be a basketball player on the field. Season 2 brings that struggle to a new level as the players compete in the highly competitive “Winter Cup”. As a tournament, many other players becomes part of the game as in the form of walls. It’s difficult for Seirin to overcome these walls because of various circumstances. Among these walls also includes members of the Generation of Miracles including Aomine, Midorima, and Murasakibara. Their playing style is unique among other players that are well known even in the current generation. Despite this, there’s a sense of strength that draws the audience in watching Seirin take them in the Winter Cup. This is because the way this show characterize their style by not telling but showing. The show not only have that but is also known for both its successions of slow moving and rapid movements during nearly every play. Almost every intense play is coordinated to a very fine detail of degree that analyzes itself with dialogues and reactions. Whether they come off as being narrative or in the open, every play gets down straight to the point and presents it as what’s there. It doesn’t hide any facts or negate the way characters play with their style. Kuroko no Basket 2 defines its style as every character plays in their own way that makes them unique, dynamic, and in ways we can come to appreciate.\\n\\n\r\nWhile the series focuses more on competition, there are also room for flashbacks as we get to see how and why players became who they are today. Among these include supporting characters Hyuga and Kiyoshi as part of Seirin’s team. What makes the sequel stands out in this way is its explication of supporting characters. In other words, nearly every player on the main team gets a spotlight that reflects on their ambitions. We don’t just get to see how main characters always hogging the spotlight but also other teammates make their stand and achieve their own dreams. This is a similar case with season 1 that focuses a bit more on back-stories. Perhaps one main drawback is the lack of exploration focused on Kuroko. While we do know a bit more about him, the guy is still a mystery known to many by the name “Phantom Man”. Season 2 doesn’t explore his character any better and viewers may feel a bit lost in the dark. \\n\\n\r\nAnd speaking of dark in a different manner, Kuroko no Basket 2 also debuts the final member of the Generation of Miracle known to many as Seijuro Akashi. He is the captain that led his team to three consecutive victories and is known by his philosophy of ‘Since I always win, I'm always right.” Really though? When you play with that sense of goal in mind, it kills the fun out of a game. To make matters worse for Seirin, Akashi displays fierce integrity and wants absolute authority over those who he encounters. His first meeting with Kagami demonstrates a dangerous situation that catches the latter off guard. Intimidating is just one word to describe his character but in the tournament meets so much more with his dangerous nature. Unfortunately, this season only focuses a minimal amount of time on his background story. The reason might relate to its adaptation as the manga is far ahead of the anime. Likewise, the story itself of season 2 also seems to move slowly with dragged out dialogues and plays. Some games seems to be repetitive, predictable, and often seems to be forceful in terms of execution.\\n\\n\r\nThe artwork of Kuroko no Basket lives up to its standards. The main characters and Generation of Miracles are categorized as being prominent in the scenes so their designs stands out more. In particular, Akashi’s character design gives him a menacing presence that shows why he is the captain of his team. Other characters also displays an impressive stance on the field that are credible. Even female characters such as Momoi and Riko are presented with integrity rather than as a cheerleader in the background. The action of Kuroko no Basket also remains intense as ever as the camera captures the style of each play. On the other hand, backgrounds are hardly noticeable and some characters’ expressions can be described as vigorous yet redundant. There are also some occasional fan service although is credible but can get distracting.\\n\\n\r\nSoundtrack wise, KnK goes beyond the expectations with its OST. It captures the mood of each game regardless which teams are playing. The momentum is always kept in pace with the way characters move while coordinating with their style of play. The OP and ED songs demonstrates the principles of its characters with their intensity. All characters’ voice acting also fits with their roles that displays their personalities. Whether their voice mannerism is intimidating, honorable, or commanding, it makes sense with their characters. Needless to say, energy level is all time high during climatic scenes and thanks to the soundtrack, it doesn’t waste a second in delivering just that.\\n\\n\r\nI wouldn’t this sequel of KnB as the next big thing but it suddenly made an impact as a sports theme anime. While it neglects some realism with players’ playing styles, it makes it up with its back stories and momentum. There are the morals and principles in playing the game that doesn’t focus exclusively just on basketball. Instead, it also relates to the characters and how they came to be as they are in present day. On the other hand, the Generation of Miracles is a refreshment to the series that presents an atmosphere of competitiveness. Sports are about competitions and you’re in the right place for that. Even more so, Kuroko no Basket 2 sets its bar high to the point as a series of more than just a game. \\n",
            "date": "2014-06-04T23:35:00+00:00",
            "helpful_count": 53,
            "mal_id": 145909,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=145909"
        },
        {
            "content": "Kuroko no Basket (Kuroko's Basketball) is without a doubt, the most popular sports anime and this is the second installment in the anime series, Kuroko no Basket Second Season.\r\nThe second season of Kuroko no Basket starts off from where it left in the first season : The Inter High School Competition is over and our favorite Basketball team, Seirin is preparing for the upcoming Winter Cup, which has become the biggest Interschool Basket ball competition in the country. It covers the preliminaries and the first few rounds of the Winter Cup, a national level Basketball tournament. \r\nStory - 7/10\r\nThe story of this season is thealmost identical to the first one : Seirin High Basketball teams enters a tournament with hopes of winning it and going as far as it could, there's some training in between and some comedy mixed in.\\n\r\nIt's pretty simple but simple doesn't mean it's bad. It's just a sports anime so you can't expect it to have a story which is too deep.\\n\\n\r\nHoweover, it's very predictable. Seirin wins it's matches at the last moment through some miracle pulled off by Kagami and by a very small margin. Why is it always Kagami?\\n\r\nSeirin just makes unbelievable comebacks towards the end of the games and somehow manages to overcome the odds. Well, this can happen sometimes but it gets old and idiotic when it happens all the time.\\n\\n\r\nArt - 8/10\\n\r\nThe art in the series is extremely good, with the matches animated to give us the full thrill and enjoyment of it. Having said that, there are a few characters whose facial design are too alike. For eg : Kagami and Akashi. \\n\r\nBut overall, the art and animation is great and I don't think I can complaint about it.\\n\\n\r\nSound : 8.5/10\\n\r\nI didn't pay much attention to the openings or endings but they were certainly good. The best thing about the sound was the voice acting which was really perfect. I would say that the voice acting is one of the best features of the show.\\n\r\nThe soundtrack is also brilliant with a few of them letting us experience the complete feel of the matches.\\n\\n\r\nCharacters : 5/10\\n\r\nNow, what can i say about the characters? I really have a mixed opinion on them since I loved the interactions of these characters off the field, when they were in a match, the power displayed by them is simply unrealistic, which has led me to give Kuroko no Basket a score on the lower side.\\n\\n\r\nKuroko, apparently our main protagonist(yes, Kagami is not the main protagonist) is a calm and cool character as you must know after watching the first season. He doesn't change much as far as his character goes, but he doesn't get better much better at basketball either here, and that's the major reason why I came to dislike Kuroko no Basket 2nd season. He's an excellent character but I can't say the same thing for him as a player now.\\n\r\nHe was supposed to be the sixth member of the Generation of Miracles and all this season, we've been shown how weak and powerless he is without anyone else helping him out. In the first season, I could understand this but even now, he isn't developing? What's the meaning of that. \\n\r\nDon't get me wrong, Kuroko is an awesome character with a great personality. In fact, I love him but I hate the fact that he's been shafted aside almost all of the time. I even like that he's been shown to be different than other player and how his style is so unique, but again, the little development he gets feels like nothing compared to what Kagami get; it's so infuriating. It's not like he didn't want to become the best player, he even admitted to Kagami that he was using him and in truth, Kuroko himself wanted to become the best player in Japan so there was no reason for the author to hold him back.\\n\r\nHonestly, Kuroko felt like he was a supporting character and not the main protagonist of the show and I was really gutted because of that fact.\\n\\n\\n\r\nOn the other hand, Kagami who is the secondary protagonist steals all the spotlight and it feels as if, this anime is KAGAMI NO BASKET 2nd season and not Kuroko no Basket 2nd Season. There is character development, no doubt but he grows too fast and overtakes everyone.\\n\\n\r\nThe other characters, both new and old, also got their fair share of development but in the end, the focal point and the main focus of Kuroko no Basket 2nd Season always remained Kagami instead of Kuroko.\\n\\n\r\nPros :\\n\\n\r\n1. Excellent animation and the matches are stunning to say the least.\\n\r\n2. Keeps you interested more often than not. ( As long as you are watching this show as a neutral and don't support Kuroko in the way I did).\\n\\n\r\nCons :\\n\\n\r\n1. COMPLETELY UNREALISTIC\\n\r\nI mean come on, at least keep it believable. While those power ups were thrilling to watch, for someone like me, who likes his shows to feel realistic, Kuroko no Basket 2nd Season stretched the limit far too much for my liking. \\n\r\nThis season brings in a new power up for Kagami named The ZONE. Well, I say they brought this power up for him is because even though Aomine used it too, Kagami used it multiple times to get out of sticky situations\\n\r\nI watched this show for Basketball, not for those ridiculous transformations that we so often see in tens of shounen anime every year. It is quite exhilarating to watch but I felt they took it too far by making some of the players do unbelievable things that real basketball players can only dream of.\\n\r\nThe author could have at least tried to keep it a little believable. Like he could've exaggerated but not too much. There should have been a limit. Almost all of GoM's abilities are unrealistic and so are most of Kagami's abilities. Kuroko's misdirection and vanishing drive can be understood that he misdirects his opponent's gaze and escapes in that second but Misdirection overflow, no matter how awesome it might be, is impossible to achieve. How can Kuroko misdirect someone's gaze who's not even close to looking at him and how can the others have the same effect that Kuroko gained after so much training.\\n\r\nAs I said, I am not against exaggerating a little bit but there has to be a limit. \\n\\n\r\n2. Lack of focus on Kuroko.\\n\r\nWhy the hell are you trying to make another Naruto here? The focus given to Kagami is just like the focus given to Sasuke in Naruto and Shippuden. Kuroko hardly stars in matches. Yeah we know he's a shadow but why does the author need to shove it down our throat that Kuroko IS USELESS ALONE AND NEEDS SUPPORT.\\n\\n\r\nI am not against team play, in fact, I really like watching the co-ordinations of players with one another but as I said, the problem arose when they overpowered Kagami. Just think about it : Kagami is been playing basketball for since he was a child and in all those years, he became a decent player(like he was in episode 1). And suddenly, in a matter of months, he then became so strong that he was not just competing with players from the Generation of Miracles, but also beating them at their own game. Yea, we know he was motivated and determined but those things don't put you on par with players superior to you. His power ups were just stupid.\\n\\n\r\nWhen watching Seirin's matches, it was like all the other players of the team were combining their strengths to win and Kagami was able to all other things on his own. \\n\\n\r\n3. Pacing.\\n\r\nThe season is simply too slow. A match of 40 minutes takes around 80 minutes while we are watching. Did I mention that only two Winter Cup games of Seirin took place in the entire season?\\n\\n\r\n4. Lack of a subplot \\n\r\nNow, this isn't as big a deal as the others but it's still a problem. I really would have liked if they would've developed the relationship between Kuroko and Satsuki. Satsuki declares that she's Kuroko's girlfriend but she doesn't even care about him even after he's lost and is down, she doesn't even call him. Then why was she introduced as his girlfriend in the first place?\\n\\n\\n\r\nEnjoyment : 5/10\\n\\n\r\nFor me, I like to see the main characters in action but Kuroko is so overshadowed by others, especially Kagami, it's pathetic. I seriously would've enjoyed the series more if the central focus of the series was Kuroko and not Kagami, which really bugged me. \\n\r\nAnd I finished Kuroko no Basket first season in one day and the same with the second season. So, you can see how much I wanted things to develop for Kuroko.\\n\\n\r\nI am really surprised no one else complains about how less Kuroko is developed and how others hog the screentime he deserved. He was such a great character and only if he would've been shown to get better(at a rate at least half to what Kagami grew), in my opinion, this could've been a lot better.\\n\\n\r\nOverall : 6/10\\n\r\nI feel like I am doing it a favor by giving it even a score of 6. Really, it could've been an amazing anime only if focused on Kuroko more. The first season was similar but I let it slide since it was just like an introduction but I think, I am done with the series. I doubt I would be able to continue unless I hear that Kuroko is really developing his basketball.\\n\r\nThe setting and premise of the series was so good that I feel sad that I won't be able to continue it, but I just can't take more of that Kagami power up bullshit.\\n\\n\r\nThe thing is, halfway into this season, I was getting bored, not because the episodes were boring but because I wanted Kuroko to get better but due to Kagami growing at a staggering rate, the little development Kuroko got in basketball through his new techniques felt like nothing. It was like Kuroko didn't get better at all.\\n\r\nThis series is good, no question, but I believe it had the potential to become a real masterpiece IF THE FOCUS WAS ON KUROKO. \\n\\n\r\nAs for would I recommend it to you or not, I am conflicted here. I can't say it's a bad anime because it isn't, it's just that I like my protagonists to grow overtime(and even though Kuroko did grow, the problem was that the pace at which Kagami grows is just ridiculous) and want to see them develop not some sidekick.\\n\\n\\n\\n\\n",
            "date": "2015-07-07T05:20:00+00:00",
            "helpful_count": 37,
            "mal_id": 192624,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435439.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inferno792",
                "username": "Inferno792"
            },
            "url": "https://myanimelist.net/reviews.php?id=192624"
        },
        {
            "content": "Kuroko no Basket Season 2\r\nThe first season of Kuroko no Basket was good, but this season definitely stepped its game up. The main focus of this season is the games, and I'm pretty sure a game is going on in every single episode. This isn't a bad thing though, because the games are insanely intense.\r\nStory: 7/10\r\nThe story for this show is a typical one, wanting to become the best basketball players/team but it still has a very good execution. Kuroko no Basket 2 takes its time on each game so the story isn't rushed at all. I'm pretty sure only two games happened this season.But that might be a little too slow for a sports show. Obviously it's better for a show to be kept at a nice pace than rushed, but there definitely could have been a third game in this season. Still, the story itself is good, and I couldn't help but enjoy watching it.\\n\\n\r\nArt: 8/10\\n\r\nThe art is very detailed in this show. You can see the exhaustion of each of the players during the game such as the sweat and trembling legs, which lets you know how hard they're trying. Even each of the characters have a design unique to itself, which is definitely a good thing. The only problem I still have with this show is the shadowing, but that's just my personal opinion and it doesn't bother me much.\\n\\n\r\nSound: 8/10\\n\r\nThe sound in this second season is a lot better than the first. Both the opening and the ending were good songs, and I don't think i skipped it once. During the games, they integrated the music very well and it made the games even more fun to watch. The music is very well done.\\n\\n\r\nCharacter: 8/10\\n\r\nThe characters are very well made in this show, because each character has something unique in them that the next character won't have. Both Kuroko and Kagami are a great duo for the main characters, and their interactions are very entertaining. The opposing teams had interesting characters too, which made their games very intense.\\n\\n\r\nEnjoyment: 10/10\\n\r\nAlthough there are some things I didn't mention before that I don't like about this show (mainly the godlike super powers), it was still unbelievably fun to watch. There are cliffhangers after almost every episode which got me wanting to watch more and more. This show is fantastic in terms of enjoyment.\\n\\n\r\nOverall: 8/10\\n\r\nKuroko no Basket 2nd Season is a very fun show overall, and even though this show got me mad at certain points, I was still wanting to watch more. Kuroko no Basket 2 is a promising sequel that will be very enjoyable if you liked the first season.",
            "date": "2014-03-29T14:59:00+00:00",
            "helpful_count": 28,
            "mal_id": 137761,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2780297.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Takkyon",
                "username": "Takkyon"
            },
            "url": "https://myanimelist.net/reviews.php?id=137761"
        },
        {
            "content": "Kuroko no Basket season 2 will not disappoint you in any way. It is as good as season 1 and in some aspects one may claim that it is better.\r\nThe story picks up exactly where the previous season left us off. It does not have any weird gaps or any tiresome flashbacks. In essence you dive right into the story the moment you press play and that is something very good. It continues with the same pace as the first season and though it may seem to pick up speed at certain points let me assure you that it does not. It allows the viewerto feel the tension, joy, sorrow, anxiety, anger etc of the characters in order to cheer and/or hate them. More importantly it does not have any plotholes. Of course there are some things left unanswered during season 2 but that is only natural since it seems the series will go to season 3 as well.\\n\\n\r\nArt wise you can expect the same high quality animation you got during the first season. Of course this does not mean that there are now differences between the first and the second season. I am no expert but I get the impression that the characters faces and their facial expressions have improved quite a bit. Other than that the art is pretty much the same.\\n\\n\r\nThe soundtrack like in the first season was not spectacular but I have to admit that it was quite enjoyable overall. Yes there were cases where I was not particularly interested in the background music but there where also cases that I was simply astonished by the music. \\n\\n\r\nCharacter development improved greatly from the first season. Actually improve may not be quite accurate it was just the fact that it revealed a great deal more for numerous characters both main and support. Each character is driven by a completely different set of beliefs and experiences towards different goals. The character development led me to understand them all and in the majority of cases like them as well since I could clearly understand their personalities and their thought process.\\n\\n\r\nThe overall enjoyment of this season, for me at least, is through the roof since I was extremely anxious about the story development since the first season. In other words I was so hooked with the series that I forced myself to watch it only when I had an abundance of time so that I may binge watch it and enjoy it with no breaks, intermissions or pesky things like work.\\n\\n\r\nOverall I think that this is a must see series and season. Whatever your tastes and preferences may be Kuroko no Basket is an amazing series that deserves our time.",
            "date": "2014-05-04T13:52:00+00:00",
            "helpful_count": 22,
            "mal_id": 142329,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=142329"
        },
        {
            "content": "I like the story of an underdog team trying to win, but its been done so many times in sports anime. [8/10] \r\nArt is as it should be in this generation so I would expect no less. [8/10]\r\nI loved the sound of the ball when the players hit a swish and the sound of the squeaking shoe  because it is very satisfying and really reminds me of being on the court myself. [9/10]\r\nCharacter development wasn't as good as the first season because I felt like the 5 legendary players aren't talked about as much as in the first season, but I haven't not finishedthe anime yet so [6/10]\\n\\n\r\nAs I've already said I'm a basketball player so I felt everything was too unreal, like Midorima's three pointers and Kuroko's drive, I mean has the creator even played basketball. when you play defence you should watch you guard's waist to see which way they're going so therefore Kuroko's Drive is impossible. I understand this is an anime they have to make it cool but Slam Dunk looked cool and was more realistic. How does a bunch of high schoolers play for 25 min shifts [4/10] too unrealistic for me.\\n\\n\\n\r\nI would NOT recommend anybody who likes real basketball to watch this since it's more of a \"who has a better power\" show. This only my opinion so don't hate on me if I made you upset. Overall [4/10]",
            "date": "2014-07-23T20:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 153457,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3934481.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chronologically",
                "username": "Chronologically"
            },
            "url": "https://myanimelist.net/reviews.php?id=153457"
        },
        {
            "content": "Kuroko no Basket Season 2 continued right where Season 1 left off, and in fact, the entire story got even better. The basketball matches became even more exciting with the addition of \"the zone\" and there was more basketball action instead of character development/chatting. But there were even more characters to enjoy watching. Kuroko no Basket Season 2 was all in all so much fun!\r\n(SPOILER IF YOU HAVEN'T SEEN THE FIRST SEASON) \r\nStory: After the Seirin's crushing loss to Tōō in the interhigh tournament, the players are training harder than ever to compete in the Winter Cup Tournament. With Kiyoshi retiring after the winter cupdue to injury reasons, and Kuroko and Kagami's final chance to prove themselves over the Generation of Miracle players/teams, the stakes are higher than ever before. Is willpower and teamwork enough to overcome the obstacles that await Seirin high at the Winter Cup? The only word to describe the entire plot is: EXCITING. The first season incorporated school-life, off the court-life and practice alongside the basketball matches, but the second season focuses primarily (almost solely) on the basketball matches. The basketball matches are more exciting and epic than ever before! I was jumping around, laughing, smiling, cheering and even crying (at the end) while watching all the stuff that goes down before/during/after each match. \\n\\n\r\nArt: Wow, was it just me or did the art get even better than season 1? The \"Zone\" in which only 3 players have been revealed can get into allows the player to exceed the limit of energy that a person's body can exercise and go crazy was a nice addition to the games, but also the artwork portrayal of it. It looked like electricity in their eyes, that was really cool to see! The basketball games were portrayed wondrously, perfection.\\n\\n\r\nSound: I actually loved, like LOVED both openings and the ending for Kuroko no Basket's 2nd season. They added more music in during the basketball matches that certainly added more tension and excitement to each game. When the teammates on the bench shouted, \"Defense, Defense\" the entire game felt so realistic, even when obviously the stuff that happens on the court is so unrealistic. The sound in the anime goes *Swish* \\n\\n\r\nCharacter: More characters are introduced in Season 2, for example Tatsuya Himuro, Kagami's \"brother\" figure, and Atsushi Murasakibara, the center of the Generation of Miracles. There's even more character development, such as Kagami/Himuro's past, , Aomine's true character, and Kuroko's tweek in game-style (he learns something new that's amazing!). There were additions of more strong female characters who added comedy relief and tension to the entire story. Just like Season 1, Season 2 succeeds in creating highly enjoyable and likable characters. Oh and Akashi finally shows up, yay! \\n\\n\r\nEnjoyment: My enjoyment level in watching an anime or sport has never been so high. When Kagami was facing Aomine and Murasakibara in the Zone, it had to be one of the most exiting moments I've ever seen in anime. I was literally jumping around screaming \"GUUOOOO KAGAMI!!\" \"BLOOCK HIMM AOMINE!!\". And Kuroko... I loved him! I love all the characters, I love the story, I'm starting to love basketball, and I LOVE KUROKO NO BASKETBALL. ♥♥♥!!!",
            "date": "2014-11-14T22:08:00+00:00",
            "helpful_count": 14,
            "mal_id": 168637,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4166901.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lydiia",
                "username": "Lydiia"
            },
            "url": "https://myanimelist.net/reviews.php?id=168637"
        },
        {
            "content": "******this is a spoiler free******\r\nFirst thing first. I love this anime but i hate it as well . \r\nI did not read the manga of this series .\r\nSeason 1 and 2 are more or less the same\r\nStory:4/10\r\nCliche plots in my opinion. Because Seirin is gonna win the winter cup and beat akashi ... since this title of these whole series is call \" kuroko no basket\" and not \"akashi no basket\" . This means that the main character this kuroko and not the GOMs simply means that kuroko is gonna win with the flow of the cliche plots. But it makes you wanna watch forsome reasons.\\n\\n\r\nArt:6/10\\n\r\nBasically fine nothing wrong except for 1 which i really wanna slap the shit of it. which is the shadow where the characters have especially under their neck . Since season i've noticed it in fact from the very start . I was wonder what shit is that , we normal people don't have and how in the hell they got it .... it's really funny and ridiculous if you think properly.\\n\\n\r\nSound: 5/10\\n\r\nNothing wrong or bad which i can complaint or say . I only like the OP \" the other self \" .\\n\\n\r\nCharacter:7/10 ( biased ) \\n\r\nI really like the characters for exmaple Aomine and Kise and Akashi . Reason for liking aomine is he's very badass and i just simply like it and really don't understand why he lost to kuroko and kagami. As for Kise i like this blone hair and his pretty face he is very hot . As for Akashi i like his intimidating personality this just make me feels he's the king of the GOM where all the miracles are . But i juz simply hate the existence of kagami and kuroko to spoil the whole series .... I understand why many fan girls are going crazy for kuroko in my eyes he is only acting cute and make me wanna puke every episode . \\n\\n\r\nEnjoyment:6/10\\n\r\nI really did enjoy this whole anime when i am watching every episode i was screaming like mad hahaha even in 3 or 4 am .... ( i finish this in 2 days in fact 1 day because i start at near midnight cos if i round off it'll only be 1 day ) And  once again i did not give a 8 or 9 in this section is because of kuroko since he is the main character of course he is gonna get lots of showing time which make my mood go down. \\n\\n\r\nOverall : 6/10 \\n\r\nThis anime can be far way better if kuroko and kagami isn't here i know that this is a biased statement but this is just my opinion.If Seirin wins the winter cup im gonna give the whole 3 season a score of 1.\\n\\n\r\n I highly recommend you ( potential viewer ) to watch this because putting aside the bias things this anime is very good . And im glad that i waited 6 months for this season 2 to air finish then start watching .",
            "date": "2014-06-14T22:09:00+00:00",
            "helpful_count": 13,
            "mal_id": 147045,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=147045"
        },
        {
            "content": "This is one of, if not, the best shounen sports anime I’ve ever seen. Sports anime that are based around American sports, can often fall into the category of being comically poor representations of the sport they’re portraying. KuroBasu has already established itself as being a show that, while dramatized, still offers an informed view of how basketball actually works. The 2nd season of the show continues to build on a strong foundation of the first season, adds compelling dimensions to the characters, and an ever increasing intensity in the games.\r\nKuroko no Basuke is bound to be compared to the classic series “Slam Dunk,” but,for my money, this show has been a big step up from that series. The action is great. The plot is simple enough to not get in the way of the action by making things feel poorly paced, ridiculous or unbelievable. The characters are interesting and diverse. The strategy within the games adds a great layer to the already impressive action. All in all, it’s got a lot to offer for shounen fans, sports anime fans and basketball fans alike.",
            "date": "2014-07-07T04:29:00+00:00",
            "helpful_count": 10,
            "mal_id": 150817,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3169925.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PTR2013",
                "username": "PTR2013"
            },
            "url": "https://myanimelist.net/reviews.php?id=150817"
        },
        {
            "content": "I enjoyed watching KNB season 1, but season 2 was a great disappointment.\r\nStory: 5/10\r\nThis is the continuation of KNB season 1. In season 1 they showed us Kuroko's unique way of playing basket ball. It was so interesting and amazing. The thing about GoM is also very interesting and really cool.\r\nBut in season 2, they made it look as if Kagami is the main protagonist and not Kuroko. It became more about Kagami and how great he is, that he could even surpass the GoM even without Kuroko.  Kagami always level up in almost every match. Instead of focusing on Kuroko's unique way ofplaying Basketball, they focused on Kagami and made Kuroko unneeded.  It became Kagami no basket instead of Kuroko's\\n\\n\r\nArt: 8/10\\n\r\nThe art is good especially during their matches.\\n\r\nAlthough sometimes I feel like their nose are missing.\\n\\n\r\nSound: 7/10\\n\r\nThe opening and ending songs are just okay. \\n\r\nThe sound effect is good.\\n\\n\r\nCharacters: 8/10\\n\r\nThey main characters are still the same.\\n\r\nThe GoM are still as interesting as ever, that's why it was disappointing that they lose easily.\\n\r\nThere were some new characters but I find them cheesy.\\n\\n\r\nOverall: 6/10\\n\r\nKNB season 1 is really good but this one is a big disappointment.\\n\r\nThey focused too much on Kagami even though he's annoying and made Kuroko looked pitiful.",
            "date": "2015-11-20T16:52:00+00:00",
            "helpful_count": 10,
            "mal_id": 203812,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4992636.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MTKN9068",
                "username": "MTKN9068"
            },
            "url": "https://myanimelist.net/reviews.php?id=203812"
        },
        {
            "content": "Kuroko no Basket is one of the shows that one can't criticize easily ,it was  very interesting . i really enjoyed the exciting moments throughout the anime \r\nStory: 9\r\nthe story has progressed since first season with the appearance  of the rest of the generation of miracles and it was progressing with a relatively fast pace .\r\nArt: 9\r\nThe Art was beautiful. I give credits to the studio to be able to bring the full potential of the manga . it was very fitting for the story and had a constant level throughout the whole series\r\nSound: 9\r\nthe sound track was amazing . it makes youreally get in the mood and feel the excitment of the matches . the voice actors did great job \\n\\n\r\nCharacter: 8\\n\\n\r\ni fell in love with kuroko's character he was one of my favourite protagonists . every character has its unique way . i think  if there were any flaws it will be the sometimes unexplained strange bahaviour of some characters like akashi.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nthis is one of the best sports anime ever",
            "date": "2014-10-10T06:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 164315,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3554241.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Elsyaad",
                "username": "Elsyaad"
            },
            "url": "https://myanimelist.net/reviews.php?id=164315"
        },
        {
            "content": "Kuroko no Basuke 2nd season, I'll be writing this review with the idea that you've seen the 1st season.\r\nKnb 2 is much better than the 1st season, mostly due to the fact that it has much more competitive matches and more of the Generation of Miracles are shown with respect to the first season. Other than that, another generation of legendary basketball players, known as the Uncrowned Kings, is introduces in this season thereby raising the stakes and level of game in the matches.\r\nStory 9/10:\r\nSeiren High enters the winter cup where they face the Generation of Miracle for a much bigger title. The Uncrowned Kingsalso make an appearance as opponents similar to the GoM and seiren also has to face them in order to proceed in the championship. Old friends are introduces and secrets of some side characters are revealed. As always, there is a lot to expect from the sequel and it is very interesting.\\n\\n\r\nArt 8/10:\\n\r\nI loved the high octane game in the matches versus the Generation of Miracles. New abilities are shown spectacularly and the animation and graphics quality is good. Nothing changes in the art department from the prequel but the new characters are pretty well designed.\\n\\n\r\nSound 8/10:\\n\r\nIt's opening and ending themes were better than the first season's. Enjoyable to watch and listen to but not so much enjoyable to watch/listen everytime. \\n\\n\r\nCharacter 9/10:\\n\r\nThe GoM characters are further defined and any misunderstandings about their behaviour is removed here. Their personality makes quite a change after facing losses and due to Kuroko. New characters introduced are pretty decent and the past of some important new characters is described as well as of a few main characters. Kagami's character is more explained in this sequel and he makes a drastic improvement in his game personality which becomes clearly visible. His past is also shown in the sequel. Only one GoM member is left to be explained and 2 of the Uncrowned Kings are shown in this sequel.\\n\\n\r\nEnjoyment 10/10:\\n\r\nThis sequel was very very enjoyable. New abilities and unbelievable match ups make you want to watch it non stop. The games themselves intensify to an extent to keep you glued to your seat. The new abilities leave you astounded and give you goosebumps. The ever changing flow of the games keeps you guessing about the winner. All in all, this is a very enjoyable sequel. Apart from the games, some comedy is always there, in our out of the game. Practice sessions, some days off are amusing to watch.\\n\\n\r\nOverall, I loved this sequel and you will too if you enjoyed the prequel. New abilities, epic match ups and new characters are all it takes to make this sequel an amazing success to such an awesome series.",
            "date": "2015-01-29T05:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 179177,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=179177"
        },
        {
            "content": "This season.........THIS FREAKING SEASON. Wow I enjoyed the first season but this season was just amazing. Let's start with what we already know, Kuroko no basket is a sport shounen anime that has to do with basketball. This season left off right where season 1 left off with Kuroko and the rest of the Seirin basketball team entering the winter cup. That one statement alone is the foundation for much of this season's plot. In the transition between seasons the characters have grown and improved a lot for this big tournament after a blow out loss. So what did I think? Well I have tosay Kuroko no basket is one of the most exciting and addicting anime I have ever seen. Every episode you just want to see more and more. The voice acting was very solid though some of the English they attempted was a little awkward and broken. The animation was just beautiful especially when the characters are in the zone, the aesthetics just look great. Overall the characters I proved this season and I mentioned in my season 1 review that I had high expectations for them.....and MY GOD they didn't disappoint. The story was very good overall despite it having some shounen cliches present. But yeah the amount if plot development p,action, and excitement is more than enough to keep any fan of kuroko no basket satisfied. \\n\r\n  In conclusion Kuroko no Basket Season 2 was AMAZING; from the visuals to the art, the plot, the characters, and some kickass music. So I have no problem with giving this season a 10 and I'm so excited to watch season 3.",
            "date": "2015-11-21T13:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 203886,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4931947.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/711nono",
                "username": "711nono"
            },
            "url": "https://myanimelist.net/reviews.php?id=203886"
        },
        {
            "content": "I never thought I would like Kuroko no Basket. I am a lazy teenage girl, sport just isn't my thing, and yet here I am completely hooked on this anime that revolves around sport - I've found myself rewatching matches over and over and I went as far as to read the whole manga in a day because I couldn't wait for the next episodes to come out. Everything about this series adds up.\r\nStory (10/10)\r\nFor an anime as simple as a basketball team trying to win their way through the ranks, Kuroko no Basket incorporates amazing back stories on each of the characters, with lotsof flashbacks shown throughout the series - but it's not the annoying type of flashbacks that would come in the middle of a battle, these flashbacks are very well placed in the middle of each basketball match, simultaneously giving us a break from the action while building anticipation for the next match. The back stories give us the information needed about characters to sympathize with them even during the climaxes of battle. \\n\r\nWhen it comes to the actual basketball matches, nothing is lacking. It's true that each character is totally overpowered, but because of that during the games there is twists and turns, even total backflips on what the outcome is going to be. It makes normal basketball look boring.\\n\\n\r\nCharacters (10/10)\\n\r\nThe characters were the highlight of KnB for me. If the story is good, the characters are outstanding.\\n\r\nLike I said before - most of the characters have back stories, which makes it easy to sympathize with them during the heat of battle or even off the court, but the best thing about the characters is that each and every one of them have a different, three dimensional personality. \\n\r\nWhile this can be said for most anime, I think its shown very strongly in this series - there isn't a boring character in there, it's almost crazy how different and interesting each one is, but at the same time I find myself legitimately believing that these characters could be people in the real world. The silly one liners or short conversations put in for comic relief sound like things I could actually picture my peers saying, plus the fact that its implied that teammates hang out outside of practice makes KnB seem realistic in the way that they capture high school teenagers. It gives a feel that not many other anime give.\\n\\n\r\nArt (10/10)\\n\r\nKnBs art is great. I feel like the characters are designed amazingly, and each persons appearance fits their personality. \\n\r\nThe action scenes are done so well I find myself unable to take my eyes off the screen as I watch fluid exchanges between characters with different colours and angles used to convey more feeling of suspense during the intense battle scenes.\\n\r\nThe only criticism I would have is that during the start of the first season, occasionally characters faces would look weird if shown from a certain angle, but they fixed that up during the second season.\\n\\n\r\nSound (8/10)\\n\r\nI don't usually pay attention to sound in anime, and while sometimes I don't skip intros its usually to watch the animation at the start/end, not for the sound, so I'm not quite fit to review this, but something I have picked up on is the music they use when the games begin to get fierce.\\n\r\nThe music is used to build suspense, and it does it very well. I find myself entranced in the complete badassness of it all, and while the action scenes are already great the music definitely adds to it.\\n\r\nOther than that, sound effects are used well, it sounds exactly like it should on a basketball court - feet moving, balls bouncing, cheers from the crowd. The sound was done how it should be done.\\n\\n\r\nEnjoyment (10/10)\\n\r\nKuroko no Basuke has me entranced in this crazy world of teenage basketball stars and crazy characters. It's a personal favourite. It gets your blood boiling and after you've watched an episode you feel as if you can't go another minute without watching another. I would definitely recommend it, if you don't mind being obsessed.\\n\\n\r\n-Just a side note; this is the first review I've written, so my apologies if I've left anything important out xxx",
            "date": "2014-04-02T06:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 138307,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3670833.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/saikea",
                "username": "saikea"
            },
            "url": "https://myanimelist.net/reviews.php?id=138307"
        },
        {
            "content": "Kuroko no Basket\r\nReview By: John Fragglepuss Evans\r\nKuroko no Basket combines basketball with anime in such a good way. The basics of basketball are there, but they are combined with the action and drama that anime utilizes so well. The dunks are intense, the passes are intense and they use beams of light to show just how amazing the passes truly are. Kuroko and Kagami remind me of the old NBA combo of John Stockton and Karl Malone, one with finesse and the other with raw power. In true sports anime fashion, the matches are all important and all last several episodes while the drama andintensity unfold.\\n\\n\r\nThe first season was new and hilarious, but it starts to get old when the second season is more of the same.\\n\\n\r\nYou might enjoy this if: You are a sports anime veteran or even if you are a sports anime rookie.\\n\\n\r\nYou might not like it if: Over dramatized motions and slow-motion sweat is too much for you.\\n\\n\r\nNote to the Viewer: Be prepared to get sucked into the story and watch a season in a day.",
            "date": "2015-04-20T20:14:00+00:00",
            "helpful_count": 7,
            "mal_id": 186108,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4571079.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fragglepuss",
                "username": "Fragglepuss"
            },
            "url": "https://myanimelist.net/reviews.php?id=186108"
        },
        {
            "content": "If you haven't watch the series yet, see my first season review instead. I also won't repeat on what I said on the first season review.\r\nhttp://myanimelist.net/reviews.php?id=192244\r\nThe second season of Kuroko no Basket is a huge improvement since the first seasons. There are more surprises and thrills on the second season than the first one. The second season shows Seirin getting back up after that loss on the previous season. How they really developed the Team Seirin so far is great. We can really see their struggles on how are they going to get back up.\r\nThe animation also has it's plus because there are more greatanimated moments on this season than the first one like \"The Zone\" and I thought it was a great job from Production I.G.\\n\\n\r\nOverall, still great and it still maintains it's thrill in basketball except, it's this season is better.\\n\\n\r\nScore: 9/10",
            "date": "2015-07-04T01:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 192247,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=192247"
        },
        {
            "content": "So, I feel like I have a lot to say about this season of Kuroko no Basket. The first thing is to praise this anime on how brilliant it is at storytelling and suspense. Even more so than the first season, this season hit those points perfectly. I said this in my previous review, but Kuroko no Basket wasn't remarkable to me initially. It doesn't deserve anything less than 10 points, but it also isn't astounding. However, this season may have changed my views on that.\r\nAs I mentioned, the building of suspense is one of the few things this anime truly shines with, and it'ssomething that I appreciate. It's very good at skewing your expectations. For example, during most of the games that Serin plays, there is an immaculate push and pull that is seen. In other words, each game begins by making the audience feel like Serin will have a fighting chance. Throughout the rest of the game, that chance will be broken and will reemerge again and again, and by the end of it, you will have no idea who will win or who will lose. Neither option will be surprising, but because the suspense is built up so well, you will feel just as dejected or just as joyful as the characters do when they lose or win respectively. This push and pull technique is used often in storytelling, but I personally don't see it used as convincingly as it's used in Kuroko no Basket. \\n\\n\r\nAnother thing this anime is exceptional at is character work and development. Each time a character, namely Kuroko and Kagami, decides to get stronger, there will be a clear motive as to why they do so. Besides that fact, it isn't an unrealistic development. This anime doesn't raise it's characters up to a point so high that they can defy all logic previously set by the storyline. Bleach, for example, is an anime that harbored some unrealistic development of it's main character, Ichigo. It was entertaining, but knowing that someone is going to win no matter what can get boring very quickly. In Kuroko no Basket, the character's development doesn't always mean assured victory, and that's refreshing.\\n\\n\r\nThe one negative I have about this season (and it's sort of cosmetic) is the fact that the new moves that the characters develop will have names to them. For example, Kuroko's Ignite Pass. They sound cool initially, but it isn't realistic. Even if the only ones who've heard the move's name is Serin's Coach and Kuroko, during a game, everyone will comment on it using the name. It is a little irksome, but as I said, it's just a cosmetic issue. I understand that it's used for effect and not for realism, and it doesn't change my enjoyment of the anime at all.\\n\\n\r\nHopefully this review helped some of you decide if this season or this anime is worth watching. To me, it's top quality at every moment. I suggest you give it a go.",
            "date": "2018-08-17T11:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 286705,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=286705"
        }
    ],
    [
        {
            "content": "\"Even if we lose by 100 points, there’s a chance a meteor will strike the other team’s bench in the last second.\"—Kuroko Tetsuya\r\nSequel to season one, Kuroko No Basket 2 does not disappoint. The new season begins with a mild time-skip after the inter-high matches. Seiren High—no longer the underdog—is now of equal footing in terms of basketball recognition. The most notable difference the time-skip offers would be the physical improvement of the players; all other improvements—such as unique skills—are publicly developed in season 2. If anything, the anime has adapted an even faster pace and incorporates an unexpectedly drastic increase in the amount ofaction per episode. Games are now longer, more intense, and developed. The level of play has increased to a higher caliber. There are no more \"easy\" opponents in this Winter Cup. Each team has a unique play style, some specializing in more specific areas such as defense, offence, or speed. However, all teams must bend their play style in order to counter their opponent. This constant change of pace and strategy creates a fast paced, entertaining battle. The shounen aspect of the anime often shines during the intense moments of the game—where players are at full potential. Although shounen abilities are bound to be unrealistic, the anime counteracts some of this illogic by offering thorough explanations behind some abilities such as Kuroko's misdirection. As stated before, the games have gotten longer, meaning there are less games played but more detail to each specific match. \\n\\n\r\nThe entertainment level has reached an all new high, various jaw dropping moments are wisely incorporated to avoid repetition. To top it off, the anime captures viewer's attention by further expanding in the realm of character depth. Kuroko gains more expression and passion, and remains a glowing catalyst. Kuroko, \"the shadow\", cheering along with his team speaks volumes about how much character development takes place. Other basketball players too, receive a hefty amount of attention. Aces are prominent as usual, but now regular players are given much more spotlight. Whether it be three pointers, fakes, dunks, or passes each play is valuable. There are many times where players simply want to give up; honestly it's not easy to have endless motivation in face of defeat. Each character has their insecurities and doubts when it comes down to their skill level and natural talent, but it's ultimately up to them to decide if they will let that affect them. Teamwork is demonstrated through many lights, with emotionally supportive remarks accompanied by intermediate coordination, the value of trusting your teammates is highlighted. \\n\\n\r\nThe large amount of characters does have its downfall though. Not all characters receive recognition deserved, and even some of the former \"mini-main characters\" become less prevalent. The freshman hardly get any playtime, if any at all. They are mostly seen cheering on the team, rather than competing with the team. We miss out on the development and improvement of other teams due to the heavy focus on Seirin High. Still, the character development we do get is appreciated and worthwhile. Dual gender fan-service is implemented in two or three episodes, but it doesn't hinder the plot.\\n\\n\r\nArt and sound has improved, not dramatically, but notably. Scenes where game-play is at peak, is where the artistic improvements are easily visible. The characters have more \"fluid\" movements, and facial expressions are clearer. The OP and ED are pleasing, and fit well with the heart-racing action. Voices are well done as usual, the English, however, is horrible. It's to be expected though,  as I believe none of the voice actors use English other than for acting. \\n\\n\r\nSomething that has bothered me throughout the series was the exaggerated portrayal of the members of the Generation of Miracles. Members of the GoM were depicted as godlike undefeatable players. Although the GoM's abilities certainly deserve enormous recognition, no individual player—so far—has shown to be as overpowered as claimed; which is good. Each team has their own Aces, and below those Aces are above-average important players crucial to the team.  Currently, the setup of one GoM per team, makes the competition in the Winter Cup relatively equal. The key games are expected to be close battles. \\n\\n\r\nAnother slightly problematic area is time. Seirin is an \"end-game\" team, but sometimes the star moments are too miraculous and timely. Like season 1, many times Seirin manages to unrealistically catch up towards the last minute(s) of the game. Some moments are so exaggerated that 20 seconds in the game timer is actually 3-4 minutes of the episode. Timing could have been better, to accommodate  the intense game play. Even though it's nice to see a team catch up inspirationally, it should be saved for rare occasions. Under-use is better than over-use in situations like these. \\n\\n\r\nI would strongly recommend viewers who enjoyed season one, to watch this season. Kuroko No Basket 2 manages to leave you wanting more. It was far too easy for me to finish these 25 episodes, as some games were so intense and involving it was difficult to stop watching. \\n\\n\r\nThanks for reading this review, have a great day! \\n\\n\\n",
            "date": "2014-04-12T10:20:00+00:00",
            "helpful_count": 157,
            "mal_id": 139671,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2446429.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/NostalgiaCrisis",
                "username": "NostalgiaCrisis"
            },
            "url": "https://myanimelist.net/reviews.php?id=139671"
        },
        {
            "content": "The long awaited second season of Kuroko no Basuke- if you found the first season enjoyable, then I assure you... the second will not disappoint.\r\nAs expected, the second season acted as a continuation from the first, cutting straight to the Winter Cup and previewing of most of the main participating teams. If I were to describe the plot in one sentence, it would simply be 'Seirin High fights to win the Winter Cup.' \r\nAnd that's all the second season needed to be as incredibly epic it was.\r\nWas this story unique? In a way, it was. In a way, it wasn't. Kuroko no Basuke is categorizedas a shounen anime; therefore, do not watch this series (this goes for the first season as well, obviously) not expecting certain shounen elements. Don't watch this series if you utterly DESPISE shounen, because more than likely, you will be disappointed. Like any other shounen, Kuroko no Basuke has friendship elements- players power up for the sake of friendship. \\n\\n\r\nHowever, the uniqueness of this anime all boils down to one thing: the characters. If crazy as fuck abilities are what made this anime a shounen, then it's these characters that pull the show back to reality. I've seen many a shounen, and while the characters are awesome, the excitement is often short-lived. Shounen protagonists may not always be completely flat. I have seen promising characters with engaging and emotional pasts and come to love them. But what TRULY makes a series, which happens over a span of time, is character DEVELOPMENT. There is nothing more disappointing than jumping in with the characters and following along on their journey, only to realize they never grow. \\n\\n\r\nBecause of these incredibly dynamic characters (and despite being a relatively short series, the number of characters who got development is impressive) a complex plot lies underneath that one simple sentence. Humans are complex, and the way these characters are portrayed is almost astonishing. This plot is nothing to awe at; just hearing it alone won't prepare you in the slightest for what this series will bring you... but it suits it incredibly well. This is about high school boys doing what they love- playing basketball. A plot more complicated than this simply will not do. \\n\\n\r\nThis plot, however, will have its downsides for certain people. For one: it is incredibly exaggerated. Characters will have five minute dialogues in the middle of the court, thought speeches in the middle of a dunk or a shot, and impossibly agile movements that are enough to make your eyes spin. A major complaint for this show is that it’s very unrealistic compared to actual basketball. And the truth could not have been said better. Face it folks, never in your life will you see someone legitimately shoot a basketball on the opposite end of the court, have an arc high enough to nearly reach the ceiling, and make it in without so much as touching the rim. If you are looking specifically for honest, realistic basketball, then save yourself some time because that is not what you will find here. (I would suggest Slam Dunk.)\\n\\n\r\nHowever, this exaggerated plot is also what makes this anime unique, because it takes basketball on a completely different level- and does it well. While this show may be ridiculous, this provides all the more opportunities to break out huge levels of excitement and pure thrill from the watchers. It made this as interesting, epic and thrilling as it was. Never once was I bored watching them play a game. And as mentioned before, this is a shounen; characters will have ridiculous abilities… but these abilities are also very cool. :D\\n\\n\r\nTwo: on a basic level, the show can be predictable. From watching, you could probably guess who wins or loses. This is that kind of anime that makes you think, ‘The main guys will probably win.’ In that sense, and in that sense only, this show is predictable.\\n\\n\r\nBut the method by which they win is not predictable. A game will take unexpected twists and turns, and while you probably know that they’ll come out on top in the end, you may wind up thinking at some point, ‘This looks really bad for Seirin.’ By the time the last buzzer sounds, having seen them struggle like hell, you would feel that they truly did deserve their victory, that they did not just pull a victory from their asses in the name of ‘friendship’ because the physical and mental struggles were so well depicted. While Kuroko no Basuke did throw logic out the window and made its own, there is a certain flow to their victories that follow logic to that extent. Forgive my poor explanation, but that’s all I can say on this particular matter.\\n\\n\r\nThree: there’s… fanservice? Kuroko no Basuke is by no means chock full of it, but during those few instances, they don’t hold back, both on the male and female side. If you despise fanservice, then this anime may not be so great for you.\\n\\n\r\nThe plot has excellent pacing with endings that make you want to pull your hair out. Humor is a strong point with this one, and the show never tries too hard to be funny which is good. Their moments are well timed and contributed to my enjoyment quite a bit. In terms of plot, the show is definitely well off. \\n\\n\r\nThe art has certainly ramped up quite a bit from the first season, both in the drawing of its characters and the animation... oh, the animation. It's nothing to laugh at. In the first season, the animation, most particularly in the beginning, was on that fine line between average and just plain bad. While it did have its moments (one being Aomine's ridiculous play) for the most part it wasn't anything to brag about. It did its job, but, for lack of any other way to say it, it was average. The SECOND season, however, had little or nothing to complain about. If you've seen the first season, the second you see the second season's OP... you know this series will be one hell of a ride. Just those few short minutes will tell you how far the show has come in terms of animation and art. The characters appear slightly older (which isn't unexpected) and art also a bit cleaner and brighter, well worthy of 2013/14. If you are a person who watches anime for attractive characters, then you will not be disappointed. Of course, there is and always will be those moments where the video stops to buffer or you happen to pause at a particularly awkward moment and the character was drawn so terribly in that one frame that it's enough to make you want to face palm. Very rarely do I notice these awkward moments while the video is running, however, and when I do it's never for more than a few seconds and not nearly enough to take my enjoyment away from it or make me complain. \\n\\n\r\nSound for the second season was another plus in my book. As far as I know, all the characters of season one retained their VA's into season two, and I have no qualms with the new additions. Kagami's English is still laughably bad, but whether you consider that a pro or con, I'll leave to you. Soundtrack, while not as good as the first season's, does have its redeeming pieces and never worked against the story. However, they have gotten repetitive to the point where I've NOTICED that tracks were being used more than a few times, and as this was never a problem for me in the first season, this could be called a negative. The openings and endings, however... were excellent, There's no other way to put it. While the actual sound tracks weren't as good as in season one, the openings and endings I believe to have exceeded the first's overall quality. I've come to like each and every one of them, which is unusual because no matter how short a series there would always be a few I didn't have particular love for. But, all of them were excellent. Though the first OP and the second ED (sung by Kuroko, mind you) are my personal favorites, I've fallen for every single one of them. \\n\\n\r\nAs mentioned before, the characters are where the show excels. Ever changing and growing, if there's a single character you dislike, there will be at least ten you love. Ranging from a small, quiet and unnoticeable boy (gee I wonder who that is) to an eight feet tall lazy ass freshman of a colossal titan on the court, each and every one of the characters has their own memorable quirk that will make impossible to forget. These guys WILL use their pasts to jerk feels from you, whether you like it or not. They have their weaknesses, their strengths, and the way they interact with each other is pure gold. Truly, they are high school boys. They may fight, they may argue, and they may beat each other senseless, but they come through in the end. I have zero complaints as far as their appearance and designs (you could literally tell who's who just by looking at their hair) and their personalities complimented their skills on the court quite well. Unfortunately, I do have SOME complaints in terms of the characters, and while they weren't enough to keep me from loving this show, I do believe they're worth mentioning. \\n\\n\r\nMost certainly, I was overjoyed that some characters who were in the last season had a chance to show who they really were. A good amount of characters were explored, an amazing amount of characters developed... but a lot of characters were also left neglected. The girls, though I hate to say it, were used for little more than fanservice. Sure, Momoi dragged Aomine's ass to see a game and Riko trained the boys, and though I wouldn't say they weren't portrayed as a significant part of the plot, they didn't get nearly as much development as they should have. Seirin's coach, despite training them to the level where they had advanced to the finals of the Interhigh with nothing but freshmen, and being a freshman and a GIRL herself, had her past explored very little. But, a tad more of her personality is revealed so the whole season wasn't just for naught. However, I can't say the same applied to Touo's manager, who also seems under appreciated. A few more females wander their way into the second season, and while logically they did have MAJOR roles in terms of impact on the characters, their situation in terms of screen time and development aren't any better than those of our previous women. Other under appreciated characters includes the other freshmen on the team, who literally got NOTHING during the second season, though they trained just as hard as the others. These characters should have definitely been given more attention, and it is upsetting that they didn't get more than they did. Regardless, it wasn't enough just yet to keep from watching the show, and I do believe the other characters were developed to the point where this isn't a large problem as for a 25 episode series, the sheer amount of development was already amazing. \\n\\n\r\nMy enjoyment? This may have already been obvious, but I enjoyed this series like no other. Sure, some series may have had me laughing a bit more, crying a bit more, and thoroughly ENGAGED a bit more, but what made Kuroko no Basuke special for me was the careful and vast amounts of all three. The anime is very balanced in every aspect and will not fail to get you hyped. Having already rewatched the first season as well as the majority of the specials, I wouldn't hesitate for a second to do the same for this season. Even on the last episode, I was grinning like an idiot yet incredibly sad when it ended. I love this series from the bottom of my heart and would love to get this out to as many people as possible. If someone I knew wished to give anime a try, I would gladly direct their attention to this wonderful series, because it had nearly every positive characteristic the world of anime has to offer. \\n\\n\r\nBut, as I've also hinted, Kuroko no Basuke is not a perfect series. It has its flaws, and while there are few in my opinion, these flaws will break the show for some people. Again, if you hate shounen, do not watch this. If you’re looking for “realistic” basketball, do not watch this. If women with F-cup breasts are enough to ruin a show for you, do not watch this. If people with ridiculously bright colored hair turn you off, then for the love of God, please do not watch this.\\n\\n\r\nHowever, if you’re someone like me who’s willing to dive into any anime, regardless of how crazy it looks and how impossible it is, just for the thrill and enjoyment of it, then please, do watch this. Because from Kuroko no Basuke, thrill, enjoyment, and a HECKLOAD of feels… will come.\\n",
            "date": "2014-03-30T07:50:00+00:00",
            "helpful_count": 93,
            "mal_id": 137881,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2743841.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tanngerine",
                "username": "tanngerine"
            },
            "url": "https://myanimelist.net/reviews.php?id=137881"
        },
        {
            "content": "I have watched the 1st Season of Kuroko no Basket, it was enjoyable as characters were building up on the series and Seirin team is still raising up. Overall, I have enjoyed the 1st season even though some episodes seemed boring.\r\nNow for the 2nd season, I it was fair overall until the show reached the match between Seirin High and Tou team. To make long story short, the match took too many episodes (even though this was expected in a sports anime), but what I did not like is the power-up (Saiyan) style part of the play, when players were waking up and powering allsuddenly. You might think this was a part of a strategy used while playing in the match, but in fact it was a lame act to add some Shounen style to a sports anime.\\n\\n\r\nIf you want to watch a real basketball anime (even though it is not a new one), I would recommend watching Slam Dunk.",
            "date": "2014-03-08T10:40:00+00:00",
            "helpful_count": 82,
            "mal_id": 135057,
            "reviewer": {
                "episodes_seen": 17,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3495859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lelouchu",
                "username": "Lelouchu"
            },
            "url": "https://myanimelist.net/reviews.php?id=135057"
        },
        {
            "content": "Kuroko no Basket is actually one of the most exciting sports anime I've watched so far, indeed, some people may say it like \"damn those characters can play fcking godly!\" for most kiseki no sedai players, but that's what makes the show more interesting right?\r\nThere's a little spoiler, so read at your own risk.\r\nStory: 7/10\r\nThe story of the season two is actually a continuation from the last episode of season 1, which is the winter cup tournament, I know that some of the games actually takes us to watch for 2-3 episodes long, some of them are fun to watch and some of themare not. I actually really like for how all the game for each tournament goes on the story but my only main problem is that it is kinda funny to see that Seirin always wins by one point ahead their opponent, I know, there are times that they actually lack abilities to beat the other teams, but they always ended up being the winner. It actually also makes me hate to say this but, just to make Seirin win the game, Kagami's bein' to overpowered and feels like godly himself. That's why I hate Seirin so much.\\n\\n\r\nAnimation: 9/10\\n\\n\r\nI can't say much about the animation and the flow of every character in the series, it is almost perfect, not like some robotic things the other anime have.\\n\\n\r\nSound: 8/10\\n\r\nhttps://www.youtube.com/watch?v=qcF4Bjr-kIk\\n\\n\r\nI have too much to discuss about the sound of the anime, but first, let me just say this that THE ANIME'S FIRST OPENING OR THE OTHER SELF IS JUST AMAZING!! I prefer the first one than the second one. Okay time for the anime's sound..\\n\\n\r\nThere's actually nothing wrong with Kuroko no Basuke's 2nd season sound, in fact it is actually quite clear. Except for the english thing Kagami and Himuro spoke, I can barely understand it, in fact it's obvious that I will not understand their english if there's no subs. /sobssobs\\n\\n\r\nCharacter: 9/10\\n\\n\r\nOH YES THIS. It actually made me laughed when I realized that only the Kiseki no Sedai, along with Momoi Satsuki and Taiga have these amazing hair colors lmao.\\n\\n\r\n*coughs* Okay excuse me for that, but the character illustrations are so far good. Every character is unique, and for every character they have different styles of gaming and such.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nThanks to Kagami and Himuro's english, I actually enjoyed the anime lol jk. But the anime is really exciting as it is, you really don't know who will win the game. Unless you know about the power of one point ahead of Seirin. As I said, every character has their own styles of playing, which it makes it even more exciting.\\n\\n\r\nOverall: 8/10\\n\\n\r\nCan't say much for now, read it all above and you'll know why. But I definitely recommend this anime if you love sports genre. Lovely art and amazing opening and ending songs.",
            "date": "2014-07-28T23:23:00+00:00",
            "helpful_count": 74,
            "mal_id": 154187,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/331917.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ginkei",
                "username": "ginkei"
            },
            "url": "https://myanimelist.net/reviews.php?id=154187"
        },
        {
            "content": "Sports have always been a popular topic for debate. Every game is different that shows new elements and surprises. Some of these include plays that will be memorable for years while other includes players that makes in impact in the business. In order to make an impact in basketball, one must have the passion and desire to not only win but play for everyone including themselves. The fundamental concept is that sports should also be played not just for competition but also to develop one’s own character. In Kuroko no Basket 2, we witness characters in a different light as they step up to thefield and deliver basketball plays like never before. It’s more than just about winning a game but to earn the respect of everyone they hope for.\\n\\n\r\nTaking off from season 1, Kuroko no Basket: Second Season is the direct sequel of season 1. It chronicles the lives of two basketball players, Kuroko Tetsuya and Kagami Taiga as part of a team from Seirin High as they take on opponents that tests the limits of their abilities. Among these opponents include the infamous “Generation of Miracles”, famed players from a previous generations known for their prestigious talent and skills that strikes fear into anyone’s mind. Kuroko is known as a former member of this prestigious team by the nickname “Phantom Man”, for his ability to remain undetected on the field. On the other hand, we have Kagami Taiga, a man born with integrity and mind to aim for the top. Together, there is hope for them to become a legend themselves.\\n\\n\r\nBecoming a legend is easier said than done. Throughout the second season, there are many obstacles and challenges that tests our players in ways like never before. It stretches beyond just physically but also on mental levels as opponents they face are willing to do anything, and I mean absolutely anything to win a game. It becomes not just a burden but a fact of unprofessional-like behavior that aims to take down Taiga and Kuroko’s dreams. \\n\\n\r\nDreams aren’t easy to achieve of course. Season 1 presented the struggles of what’s it is like to be a basketball player on the field. Season 2 brings that struggle to a new level as the players compete in the highly competitive “Winter Cup”. As a tournament, many other players becomes part of the game as in the form of walls. It’s difficult for Seirin to overcome these walls because of various circumstances. Among these walls also includes members of the Generation of Miracles including Aomine, Midorima, and Murasakibara. Their playing style is unique among other players that are well known even in the current generation. Despite this, there’s a sense of strength that draws the audience in watching Seirin take them in the Winter Cup. This is because the way this show characterize their style by not telling but showing. The show not only have that but is also known for both its successions of slow moving and rapid movements during nearly every play. Almost every intense play is coordinated to a very fine detail of degree that analyzes itself with dialogues and reactions. Whether they come off as being narrative or in the open, every play gets down straight to the point and presents it as what’s there. It doesn’t hide any facts or negate the way characters play with their style. Kuroko no Basket 2 defines its style as every character plays in their own way that makes them unique, dynamic, and in ways we can come to appreciate.\\n\\n\r\nWhile the series focuses more on competition, there are also room for flashbacks as we get to see how and why players became who they are today. Among these include supporting characters Hyuga and Kiyoshi as part of Seirin’s team. What makes the sequel stands out in this way is its explication of supporting characters. In other words, nearly every player on the main team gets a spotlight that reflects on their ambitions. We don’t just get to see how main characters always hogging the spotlight but also other teammates make their stand and achieve their own dreams. This is a similar case with season 1 that focuses a bit more on back-stories. Perhaps one main drawback is the lack of exploration focused on Kuroko. While we do know a bit more about him, the guy is still a mystery known to many by the name “Phantom Man”. Season 2 doesn’t explore his character any better and viewers may feel a bit lost in the dark. \\n\\n\r\nAnd speaking of dark in a different manner, Kuroko no Basket 2 also debuts the final member of the Generation of Miracle known to many as Seijuro Akashi. He is the captain that led his team to three consecutive victories and is known by his philosophy of ‘Since I always win, I'm always right.” Really though? When you play with that sense of goal in mind, it kills the fun out of a game. To make matters worse for Seirin, Akashi displays fierce integrity and wants absolute authority over those who he encounters. His first meeting with Kagami demonstrates a dangerous situation that catches the latter off guard. Intimidating is just one word to describe his character but in the tournament meets so much more with his dangerous nature. Unfortunately, this season only focuses a minimal amount of time on his background story. The reason might relate to its adaptation as the manga is far ahead of the anime. Likewise, the story itself of season 2 also seems to move slowly with dragged out dialogues and plays. Some games seems to be repetitive, predictable, and often seems to be forceful in terms of execution.\\n\\n\r\nThe artwork of Kuroko no Basket lives up to its standards. The main characters and Generation of Miracles are categorized as being prominent in the scenes so their designs stands out more. In particular, Akashi’s character design gives him a menacing presence that shows why he is the captain of his team. Other characters also displays an impressive stance on the field that are credible. Even female characters such as Momoi and Riko are presented with integrity rather than as a cheerleader in the background. The action of Kuroko no Basket also remains intense as ever as the camera captures the style of each play. On the other hand, backgrounds are hardly noticeable and some characters’ expressions can be described as vigorous yet redundant. There are also some occasional fan service although is credible but can get distracting.\\n\\n\r\nSoundtrack wise, KnK goes beyond the expectations with its OST. It captures the mood of each game regardless which teams are playing. The momentum is always kept in pace with the way characters move while coordinating with their style of play. The OP and ED songs demonstrates the principles of its characters with their intensity. All characters’ voice acting also fits with their roles that displays their personalities. Whether their voice mannerism is intimidating, honorable, or commanding, it makes sense with their characters. Needless to say, energy level is all time high during climatic scenes and thanks to the soundtrack, it doesn’t waste a second in delivering just that.\\n\\n\r\nI wouldn’t this sequel of KnB as the next big thing but it suddenly made an impact as a sports theme anime. While it neglects some realism with players’ playing styles, it makes it up with its back stories and momentum. There are the morals and principles in playing the game that doesn’t focus exclusively just on basketball. Instead, it also relates to the characters and how they came to be as they are in present day. On the other hand, the Generation of Miracles is a refreshment to the series that presents an atmosphere of competitiveness. Sports are about competitions and you’re in the right place for that. Even more so, Kuroko no Basket 2 sets its bar high to the point as a series of more than just a game. \\n",
            "date": "2014-06-04T23:35:00+00:00",
            "helpful_count": 53,
            "mal_id": 145909,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=145909"
        },
        {
            "content": "Kuroko no Basket (Kuroko's Basketball) is without a doubt, the most popular sports anime and this is the second installment in the anime series, Kuroko no Basket Second Season.\r\nThe second season of Kuroko no Basket starts off from where it left in the first season : The Inter High School Competition is over and our favorite Basketball team, Seirin is preparing for the upcoming Winter Cup, which has become the biggest Interschool Basket ball competition in the country. It covers the preliminaries and the first few rounds of the Winter Cup, a national level Basketball tournament. \r\nStory - 7/10\r\nThe story of this season is thealmost identical to the first one : Seirin High Basketball teams enters a tournament with hopes of winning it and going as far as it could, there's some training in between and some comedy mixed in.\\n\r\nIt's pretty simple but simple doesn't mean it's bad. It's just a sports anime so you can't expect it to have a story which is too deep.\\n\\n\r\nHoweover, it's very predictable. Seirin wins it's matches at the last moment through some miracle pulled off by Kagami and by a very small margin. Why is it always Kagami?\\n\r\nSeirin just makes unbelievable comebacks towards the end of the games and somehow manages to overcome the odds. Well, this can happen sometimes but it gets old and idiotic when it happens all the time.\\n\\n\r\nArt - 8/10\\n\r\nThe art in the series is extremely good, with the matches animated to give us the full thrill and enjoyment of it. Having said that, there are a few characters whose facial design are too alike. For eg : Kagami and Akashi. \\n\r\nBut overall, the art and animation is great and I don't think I can complaint about it.\\n\\n\r\nSound : 8.5/10\\n\r\nI didn't pay much attention to the openings or endings but they were certainly good. The best thing about the sound was the voice acting which was really perfect. I would say that the voice acting is one of the best features of the show.\\n\r\nThe soundtrack is also brilliant with a few of them letting us experience the complete feel of the matches.\\n\\n\r\nCharacters : 5/10\\n\r\nNow, what can i say about the characters? I really have a mixed opinion on them since I loved the interactions of these characters off the field, when they were in a match, the power displayed by them is simply unrealistic, which has led me to give Kuroko no Basket a score on the lower side.\\n\\n\r\nKuroko, apparently our main protagonist(yes, Kagami is not the main protagonist) is a calm and cool character as you must know after watching the first season. He doesn't change much as far as his character goes, but he doesn't get better much better at basketball either here, and that's the major reason why I came to dislike Kuroko no Basket 2nd season. He's an excellent character but I can't say the same thing for him as a player now.\\n\r\nHe was supposed to be the sixth member of the Generation of Miracles and all this season, we've been shown how weak and powerless he is without anyone else helping him out. In the first season, I could understand this but even now, he isn't developing? What's the meaning of that. \\n\r\nDon't get me wrong, Kuroko is an awesome character with a great personality. In fact, I love him but I hate the fact that he's been shafted aside almost all of the time. I even like that he's been shown to be different than other player and how his style is so unique, but again, the little development he gets feels like nothing compared to what Kagami get; it's so infuriating. It's not like he didn't want to become the best player, he even admitted to Kagami that he was using him and in truth, Kuroko himself wanted to become the best player in Japan so there was no reason for the author to hold him back.\\n\r\nHonestly, Kuroko felt like he was a supporting character and not the main protagonist of the show and I was really gutted because of that fact.\\n\\n\\n\r\nOn the other hand, Kagami who is the secondary protagonist steals all the spotlight and it feels as if, this anime is KAGAMI NO BASKET 2nd season and not Kuroko no Basket 2nd Season. There is character development, no doubt but he grows too fast and overtakes everyone.\\n\\n\r\nThe other characters, both new and old, also got their fair share of development but in the end, the focal point and the main focus of Kuroko no Basket 2nd Season always remained Kagami instead of Kuroko.\\n\\n\r\nPros :\\n\\n\r\n1. Excellent animation and the matches are stunning to say the least.\\n\r\n2. Keeps you interested more often than not. ( As long as you are watching this show as a neutral and don't support Kuroko in the way I did).\\n\\n\r\nCons :\\n\\n\r\n1. COMPLETELY UNREALISTIC\\n\r\nI mean come on, at least keep it believable. While those power ups were thrilling to watch, for someone like me, who likes his shows to feel realistic, Kuroko no Basket 2nd Season stretched the limit far too much for my liking. \\n\r\nThis season brings in a new power up for Kagami named The ZONE. Well, I say they brought this power up for him is because even though Aomine used it too, Kagami used it multiple times to get out of sticky situations\\n\r\nI watched this show for Basketball, not for those ridiculous transformations that we so often see in tens of shounen anime every year. It is quite exhilarating to watch but I felt they took it too far by making some of the players do unbelievable things that real basketball players can only dream of.\\n\r\nThe author could have at least tried to keep it a little believable. Like he could've exaggerated but not too much. There should have been a limit. Almost all of GoM's abilities are unrealistic and so are most of Kagami's abilities. Kuroko's misdirection and vanishing drive can be understood that he misdirects his opponent's gaze and escapes in that second but Misdirection overflow, no matter how awesome it might be, is impossible to achieve. How can Kuroko misdirect someone's gaze who's not even close to looking at him and how can the others have the same effect that Kuroko gained after so much training.\\n\r\nAs I said, I am not against exaggerating a little bit but there has to be a limit. \\n\\n\r\n2. Lack of focus on Kuroko.\\n\r\nWhy the hell are you trying to make another Naruto here? The focus given to Kagami is just like the focus given to Sasuke in Naruto and Shippuden. Kuroko hardly stars in matches. Yeah we know he's a shadow but why does the author need to shove it down our throat that Kuroko IS USELESS ALONE AND NEEDS SUPPORT.\\n\\n\r\nI am not against team play, in fact, I really like watching the co-ordinations of players with one another but as I said, the problem arose when they overpowered Kagami. Just think about it : Kagami is been playing basketball for since he was a child and in all those years, he became a decent player(like he was in episode 1). And suddenly, in a matter of months, he then became so strong that he was not just competing with players from the Generation of Miracles, but also beating them at their own game. Yea, we know he was motivated and determined but those things don't put you on par with players superior to you. His power ups were just stupid.\\n\\n\r\nWhen watching Seirin's matches, it was like all the other players of the team were combining their strengths to win and Kagami was able to all other things on his own. \\n\\n\r\n3. Pacing.\\n\r\nThe season is simply too slow. A match of 40 minutes takes around 80 minutes while we are watching. Did I mention that only two Winter Cup games of Seirin took place in the entire season?\\n\\n\r\n4. Lack of a subplot \\n\r\nNow, this isn't as big a deal as the others but it's still a problem. I really would have liked if they would've developed the relationship between Kuroko and Satsuki. Satsuki declares that she's Kuroko's girlfriend but she doesn't even care about him even after he's lost and is down, she doesn't even call him. Then why was she introduced as his girlfriend in the first place?\\n\\n\\n\r\nEnjoyment : 5/10\\n\\n\r\nFor me, I like to see the main characters in action but Kuroko is so overshadowed by others, especially Kagami, it's pathetic. I seriously would've enjoyed the series more if the central focus of the series was Kuroko and not Kagami, which really bugged me. \\n\r\nAnd I finished Kuroko no Basket first season in one day and the same with the second season. So, you can see how much I wanted things to develop for Kuroko.\\n\\n\r\nI am really surprised no one else complains about how less Kuroko is developed and how others hog the screentime he deserved. He was such a great character and only if he would've been shown to get better(at a rate at least half to what Kagami grew), in my opinion, this could've been a lot better.\\n\\n\r\nOverall : 6/10\\n\r\nI feel like I am doing it a favor by giving it even a score of 6. Really, it could've been an amazing anime only if focused on Kuroko more. The first season was similar but I let it slide since it was just like an introduction but I think, I am done with the series. I doubt I would be able to continue unless I hear that Kuroko is really developing his basketball.\\n\r\nThe setting and premise of the series was so good that I feel sad that I won't be able to continue it, but I just can't take more of that Kagami power up bullshit.\\n\\n\r\nThe thing is, halfway into this season, I was getting bored, not because the episodes were boring but because I wanted Kuroko to get better but due to Kagami growing at a staggering rate, the little development Kuroko got in basketball through his new techniques felt like nothing. It was like Kuroko didn't get better at all.\\n\r\nThis series is good, no question, but I believe it had the potential to become a real masterpiece IF THE FOCUS WAS ON KUROKO. \\n\\n\r\nAs for would I recommend it to you or not, I am conflicted here. I can't say it's a bad anime because it isn't, it's just that I like my protagonists to grow overtime(and even though Kuroko did grow, the problem was that the pace at which Kagami grows is just ridiculous) and want to see them develop not some sidekick.\\n\\n\\n\\n\\n",
            "date": "2015-07-07T05:20:00+00:00",
            "helpful_count": 37,
            "mal_id": 192624,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435439.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inferno792",
                "username": "Inferno792"
            },
            "url": "https://myanimelist.net/reviews.php?id=192624"
        },
        {
            "content": "Kuroko no Basket Season 2\r\nThe first season of Kuroko no Basket was good, but this season definitely stepped its game up. The main focus of this season is the games, and I'm pretty sure a game is going on in every single episode. This isn't a bad thing though, because the games are insanely intense.\r\nStory: 7/10\r\nThe story for this show is a typical one, wanting to become the best basketball players/team but it still has a very good execution. Kuroko no Basket 2 takes its time on each game so the story isn't rushed at all. I'm pretty sure only two games happened this season.But that might be a little too slow for a sports show. Obviously it's better for a show to be kept at a nice pace than rushed, but there definitely could have been a third game in this season. Still, the story itself is good, and I couldn't help but enjoy watching it.\\n\\n\r\nArt: 8/10\\n\r\nThe art is very detailed in this show. You can see the exhaustion of each of the players during the game such as the sweat and trembling legs, which lets you know how hard they're trying. Even each of the characters have a design unique to itself, which is definitely a good thing. The only problem I still have with this show is the shadowing, but that's just my personal opinion and it doesn't bother me much.\\n\\n\r\nSound: 8/10\\n\r\nThe sound in this second season is a lot better than the first. Both the opening and the ending were good songs, and I don't think i skipped it once. During the games, they integrated the music very well and it made the games even more fun to watch. The music is very well done.\\n\\n\r\nCharacter: 8/10\\n\r\nThe characters are very well made in this show, because each character has something unique in them that the next character won't have. Both Kuroko and Kagami are a great duo for the main characters, and their interactions are very entertaining. The opposing teams had interesting characters too, which made their games very intense.\\n\\n\r\nEnjoyment: 10/10\\n\r\nAlthough there are some things I didn't mention before that I don't like about this show (mainly the godlike super powers), it was still unbelievably fun to watch. There are cliffhangers after almost every episode which got me wanting to watch more and more. This show is fantastic in terms of enjoyment.\\n\\n\r\nOverall: 8/10\\n\r\nKuroko no Basket 2nd Season is a very fun show overall, and even though this show got me mad at certain points, I was still wanting to watch more. Kuroko no Basket 2 is a promising sequel that will be very enjoyable if you liked the first season.",
            "date": "2014-03-29T14:59:00+00:00",
            "helpful_count": 28,
            "mal_id": 137761,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2780297.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Takkyon",
                "username": "Takkyon"
            },
            "url": "https://myanimelist.net/reviews.php?id=137761"
        },
        {
            "content": "Kuroko no Basket season 2 will not disappoint you in any way. It is as good as season 1 and in some aspects one may claim that it is better.\r\nThe story picks up exactly where the previous season left us off. It does not have any weird gaps or any tiresome flashbacks. In essence you dive right into the story the moment you press play and that is something very good. It continues with the same pace as the first season and though it may seem to pick up speed at certain points let me assure you that it does not. It allows the viewerto feel the tension, joy, sorrow, anxiety, anger etc of the characters in order to cheer and/or hate them. More importantly it does not have any plotholes. Of course there are some things left unanswered during season 2 but that is only natural since it seems the series will go to season 3 as well.\\n\\n\r\nArt wise you can expect the same high quality animation you got during the first season. Of course this does not mean that there are now differences between the first and the second season. I am no expert but I get the impression that the characters faces and their facial expressions have improved quite a bit. Other than that the art is pretty much the same.\\n\\n\r\nThe soundtrack like in the first season was not spectacular but I have to admit that it was quite enjoyable overall. Yes there were cases where I was not particularly interested in the background music but there where also cases that I was simply astonished by the music. \\n\\n\r\nCharacter development improved greatly from the first season. Actually improve may not be quite accurate it was just the fact that it revealed a great deal more for numerous characters both main and support. Each character is driven by a completely different set of beliefs and experiences towards different goals. The character development led me to understand them all and in the majority of cases like them as well since I could clearly understand their personalities and their thought process.\\n\\n\r\nThe overall enjoyment of this season, for me at least, is through the roof since I was extremely anxious about the story development since the first season. In other words I was so hooked with the series that I forced myself to watch it only when I had an abundance of time so that I may binge watch it and enjoy it with no breaks, intermissions or pesky things like work.\\n\\n\r\nOverall I think that this is a must see series and season. Whatever your tastes and preferences may be Kuroko no Basket is an amazing series that deserves our time.",
            "date": "2014-05-04T13:52:00+00:00",
            "helpful_count": 22,
            "mal_id": 142329,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/549351.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/partali",
                "username": "partali"
            },
            "url": "https://myanimelist.net/reviews.php?id=142329"
        },
        {
            "content": "I like the story of an underdog team trying to win, but its been done so many times in sports anime. [8/10] \r\nArt is as it should be in this generation so I would expect no less. [8/10]\r\nI loved the sound of the ball when the players hit a swish and the sound of the squeaking shoe  because it is very satisfying and really reminds me of being on the court myself. [9/10]\r\nCharacter development wasn't as good as the first season because I felt like the 5 legendary players aren't talked about as much as in the first season, but I haven't not finishedthe anime yet so [6/10]\\n\\n\r\nAs I've already said I'm a basketball player so I felt everything was too unreal, like Midorima's three pointers and Kuroko's drive, I mean has the creator even played basketball. when you play defence you should watch you guard's waist to see which way they're going so therefore Kuroko's Drive is impossible. I understand this is an anime they have to make it cool but Slam Dunk looked cool and was more realistic. How does a bunch of high schoolers play for 25 min shifts [4/10] too unrealistic for me.\\n\\n\\n\r\nI would NOT recommend anybody who likes real basketball to watch this since it's more of a \"who has a better power\" show. This only my opinion so don't hate on me if I made you upset. Overall [4/10]",
            "date": "2014-07-23T20:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 153457,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3934481.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Chronologically",
                "username": "Chronologically"
            },
            "url": "https://myanimelist.net/reviews.php?id=153457"
        },
        {
            "content": "Kuroko no Basket Season 2 continued right where Season 1 left off, and in fact, the entire story got even better. The basketball matches became even more exciting with the addition of \"the zone\" and there was more basketball action instead of character development/chatting. But there were even more characters to enjoy watching. Kuroko no Basket Season 2 was all in all so much fun!\r\n(SPOILER IF YOU HAVEN'T SEEN THE FIRST SEASON) \r\nStory: After the Seirin's crushing loss to Tōō in the interhigh tournament, the players are training harder than ever to compete in the Winter Cup Tournament. With Kiyoshi retiring after the winter cupdue to injury reasons, and Kuroko and Kagami's final chance to prove themselves over the Generation of Miracle players/teams, the stakes are higher than ever before. Is willpower and teamwork enough to overcome the obstacles that await Seirin high at the Winter Cup? The only word to describe the entire plot is: EXCITING. The first season incorporated school-life, off the court-life and practice alongside the basketball matches, but the second season focuses primarily (almost solely) on the basketball matches. The basketball matches are more exciting and epic than ever before! I was jumping around, laughing, smiling, cheering and even crying (at the end) while watching all the stuff that goes down before/during/after each match. \\n\\n\r\nArt: Wow, was it just me or did the art get even better than season 1? The \"Zone\" in which only 3 players have been revealed can get into allows the player to exceed the limit of energy that a person's body can exercise and go crazy was a nice addition to the games, but also the artwork portrayal of it. It looked like electricity in their eyes, that was really cool to see! The basketball games were portrayed wondrously, perfection.\\n\\n\r\nSound: I actually loved, like LOVED both openings and the ending for Kuroko no Basket's 2nd season. They added more music in during the basketball matches that certainly added more tension and excitement to each game. When the teammates on the bench shouted, \"Defense, Defense\" the entire game felt so realistic, even when obviously the stuff that happens on the court is so unrealistic. The sound in the anime goes *Swish* \\n\\n\r\nCharacter: More characters are introduced in Season 2, for example Tatsuya Himuro, Kagami's \"brother\" figure, and Atsushi Murasakibara, the center of the Generation of Miracles. There's even more character development, such as Kagami/Himuro's past, , Aomine's true character, and Kuroko's tweek in game-style (he learns something new that's amazing!). There were additions of more strong female characters who added comedy relief and tension to the entire story. Just like Season 1, Season 2 succeeds in creating highly enjoyable and likable characters. Oh and Akashi finally shows up, yay! \\n\\n\r\nEnjoyment: My enjoyment level in watching an anime or sport has never been so high. When Kagami was facing Aomine and Murasakibara in the Zone, it had to be one of the most exiting moments I've ever seen in anime. I was literally jumping around screaming \"GUUOOOO KAGAMI!!\" \"BLOOCK HIMM AOMINE!!\". And Kuroko... I loved him! I love all the characters, I love the story, I'm starting to love basketball, and I LOVE KUROKO NO BASKETBALL. ♥♥♥!!!",
            "date": "2014-11-14T22:08:00+00:00",
            "helpful_count": 14,
            "mal_id": 168637,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4166901.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Lydiia",
                "username": "Lydiia"
            },
            "url": "https://myanimelist.net/reviews.php?id=168637"
        },
        {
            "content": "******this is a spoiler free******\r\nFirst thing first. I love this anime but i hate it as well . \r\nI did not read the manga of this series .\r\nSeason 1 and 2 are more or less the same\r\nStory:4/10\r\nCliche plots in my opinion. Because Seirin is gonna win the winter cup and beat akashi ... since this title of these whole series is call \" kuroko no basket\" and not \"akashi no basket\" . This means that the main character this kuroko and not the GOMs simply means that kuroko is gonna win with the flow of the cliche plots. But it makes you wanna watch forsome reasons.\\n\\n\r\nArt:6/10\\n\r\nBasically fine nothing wrong except for 1 which i really wanna slap the shit of it. which is the shadow where the characters have especially under their neck . Since season i've noticed it in fact from the very start . I was wonder what shit is that , we normal people don't have and how in the hell they got it .... it's really funny and ridiculous if you think properly.\\n\\n\r\nSound: 5/10\\n\r\nNothing wrong or bad which i can complaint or say . I only like the OP \" the other self \" .\\n\\n\r\nCharacter:7/10 ( biased ) \\n\r\nI really like the characters for exmaple Aomine and Kise and Akashi . Reason for liking aomine is he's very badass and i just simply like it and really don't understand why he lost to kuroko and kagami. As for Kise i like this blone hair and his pretty face he is very hot . As for Akashi i like his intimidating personality this just make me feels he's the king of the GOM where all the miracles are . But i juz simply hate the existence of kagami and kuroko to spoil the whole series .... I understand why many fan girls are going crazy for kuroko in my eyes he is only acting cute and make me wanna puke every episode . \\n\\n\r\nEnjoyment:6/10\\n\r\nI really did enjoy this whole anime when i am watching every episode i was screaming like mad hahaha even in 3 or 4 am .... ( i finish this in 2 days in fact 1 day because i start at near midnight cos if i round off it'll only be 1 day ) And  once again i did not give a 8 or 9 in this section is because of kuroko since he is the main character of course he is gonna get lots of showing time which make my mood go down. \\n\\n\r\nOverall : 6/10 \\n\r\nThis anime can be far way better if kuroko and kagami isn't here i know that this is a biased statement but this is just my opinion.If Seirin wins the winter cup im gonna give the whole 3 season a score of 1.\\n\\n\r\n I highly recommend you ( potential viewer ) to watch this because putting aside the bias things this anime is very good . And im glad that i waited 6 months for this season 2 to air finish then start watching .",
            "date": "2014-06-14T22:09:00+00:00",
            "helpful_count": 13,
            "mal_id": 147045,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3275659.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AnimeLoverAAA",
                "username": "AnimeLoverAAA"
            },
            "url": "https://myanimelist.net/reviews.php?id=147045"
        },
        {
            "content": "This is one of, if not, the best shounen sports anime I’ve ever seen. Sports anime that are based around American sports, can often fall into the category of being comically poor representations of the sport they’re portraying. KuroBasu has already established itself as being a show that, while dramatized, still offers an informed view of how basketball actually works. The 2nd season of the show continues to build on a strong foundation of the first season, adds compelling dimensions to the characters, and an ever increasing intensity in the games.\r\nKuroko no Basuke is bound to be compared to the classic series “Slam Dunk,” but,for my money, this show has been a big step up from that series. The action is great. The plot is simple enough to not get in the way of the action by making things feel poorly paced, ridiculous or unbelievable. The characters are interesting and diverse. The strategy within the games adds a great layer to the already impressive action. All in all, it’s got a lot to offer for shounen fans, sports anime fans and basketball fans alike.",
            "date": "2014-07-07T04:29:00+00:00",
            "helpful_count": 10,
            "mal_id": 150817,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3169925.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PTR2013",
                "username": "PTR2013"
            },
            "url": "https://myanimelist.net/reviews.php?id=150817"
        },
        {
            "content": "I enjoyed watching KNB season 1, but season 2 was a great disappointment.\r\nStory: 5/10\r\nThis is the continuation of KNB season 1. In season 1 they showed us Kuroko's unique way of playing basket ball. It was so interesting and amazing. The thing about GoM is also very interesting and really cool.\r\nBut in season 2, they made it look as if Kagami is the main protagonist and not Kuroko. It became more about Kagami and how great he is, that he could even surpass the GoM even without Kuroko.  Kagami always level up in almost every match. Instead of focusing on Kuroko's unique way ofplaying Basketball, they focused on Kagami and made Kuroko unneeded.  It became Kagami no basket instead of Kuroko's\\n\\n\r\nArt: 8/10\\n\r\nThe art is good especially during their matches.\\n\r\nAlthough sometimes I feel like their nose are missing.\\n\\n\r\nSound: 7/10\\n\r\nThe opening and ending songs are just okay. \\n\r\nThe sound effect is good.\\n\\n\r\nCharacters: 8/10\\n\r\nThey main characters are still the same.\\n\r\nThe GoM are still as interesting as ever, that's why it was disappointing that they lose easily.\\n\r\nThere were some new characters but I find them cheesy.\\n\\n\r\nOverall: 6/10\\n\r\nKNB season 1 is really good but this one is a big disappointment.\\n\r\nThey focused too much on Kagami even though he's annoying and made Kuroko looked pitiful.",
            "date": "2015-11-20T16:52:00+00:00",
            "helpful_count": 10,
            "mal_id": 203812,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4992636.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MTKN9068",
                "username": "MTKN9068"
            },
            "url": "https://myanimelist.net/reviews.php?id=203812"
        },
        {
            "content": "Kuroko no Basket is one of the shows that one can't criticize easily ,it was  very interesting . i really enjoyed the exciting moments throughout the anime \r\nStory: 9\r\nthe story has progressed since first season with the appearance  of the rest of the generation of miracles and it was progressing with a relatively fast pace .\r\nArt: 9\r\nThe Art was beautiful. I give credits to the studio to be able to bring the full potential of the manga . it was very fitting for the story and had a constant level throughout the whole series\r\nSound: 9\r\nthe sound track was amazing . it makes youreally get in the mood and feel the excitment of the matches . the voice actors did great job \\n\\n\r\nCharacter: 8\\n\\n\r\ni fell in love with kuroko's character he was one of my favourite protagonists . every character has its unique way . i think  if there were any flaws it will be the sometimes unexplained strange bahaviour of some characters like akashi.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nthis is one of the best sports anime ever",
            "date": "2014-10-10T06:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 164315,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3554241.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Elsyaad",
                "username": "Elsyaad"
            },
            "url": "https://myanimelist.net/reviews.php?id=164315"
        },
        {
            "content": "Kuroko no Basuke 2nd season, I'll be writing this review with the idea that you've seen the 1st season.\r\nKnb 2 is much better than the 1st season, mostly due to the fact that it has much more competitive matches and more of the Generation of Miracles are shown with respect to the first season. Other than that, another generation of legendary basketball players, known as the Uncrowned Kings, is introduces in this season thereby raising the stakes and level of game in the matches.\r\nStory 9/10:\r\nSeiren High enters the winter cup where they face the Generation of Miracle for a much bigger title. The Uncrowned Kingsalso make an appearance as opponents similar to the GoM and seiren also has to face them in order to proceed in the championship. Old friends are introduces and secrets of some side characters are revealed. As always, there is a lot to expect from the sequel and it is very interesting.\\n\\n\r\nArt 8/10:\\n\r\nI loved the high octane game in the matches versus the Generation of Miracles. New abilities are shown spectacularly and the animation and graphics quality is good. Nothing changes in the art department from the prequel but the new characters are pretty well designed.\\n\\n\r\nSound 8/10:\\n\r\nIt's opening and ending themes were better than the first season's. Enjoyable to watch and listen to but not so much enjoyable to watch/listen everytime. \\n\\n\r\nCharacter 9/10:\\n\r\nThe GoM characters are further defined and any misunderstandings about their behaviour is removed here. Their personality makes quite a change after facing losses and due to Kuroko. New characters introduced are pretty decent and the past of some important new characters is described as well as of a few main characters. Kagami's character is more explained in this sequel and he makes a drastic improvement in his game personality which becomes clearly visible. His past is also shown in the sequel. Only one GoM member is left to be explained and 2 of the Uncrowned Kings are shown in this sequel.\\n\\n\r\nEnjoyment 10/10:\\n\r\nThis sequel was very very enjoyable. New abilities and unbelievable match ups make you want to watch it non stop. The games themselves intensify to an extent to keep you glued to your seat. The new abilities leave you astounded and give you goosebumps. The ever changing flow of the games keeps you guessing about the winner. All in all, this is a very enjoyable sequel. Apart from the games, some comedy is always there, in our out of the game. Practice sessions, some days off are amusing to watch.\\n\\n\r\nOverall, I loved this sequel and you will too if you enjoyed the prequel. New abilities, epic match ups and new characters are all it takes to make this sequel an amazing success to such an awesome series.",
            "date": "2015-01-29T05:59:00+00:00",
            "helpful_count": 8,
            "mal_id": 179177,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017315.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AbsarNaeem",
                "username": "AbsarNaeem"
            },
            "url": "https://myanimelist.net/reviews.php?id=179177"
        },
        {
            "content": "This season.........THIS FREAKING SEASON. Wow I enjoyed the first season but this season was just amazing. Let's start with what we already know, Kuroko no basket is a sport shounen anime that has to do with basketball. This season left off right where season 1 left off with Kuroko and the rest of the Seirin basketball team entering the winter cup. That one statement alone is the foundation for much of this season's plot. In the transition between seasons the characters have grown and improved a lot for this big tournament after a blow out loss. So what did I think? Well I have tosay Kuroko no basket is one of the most exciting and addicting anime I have ever seen. Every episode you just want to see more and more. The voice acting was very solid though some of the English they attempted was a little awkward and broken. The animation was just beautiful especially when the characters are in the zone, the aesthetics just look great. Overall the characters I proved this season and I mentioned in my season 1 review that I had high expectations for them.....and MY GOD they didn't disappoint. The story was very good overall despite it having some shounen cliches present. But yeah the amount if plot development p,action, and excitement is more than enough to keep any fan of kuroko no basket satisfied. \\n\r\n  In conclusion Kuroko no Basket Season 2 was AMAZING; from the visuals to the art, the plot, the characters, and some kickass music. So I have no problem with giving this season a 10 and I'm so excited to watch season 3.",
            "date": "2015-11-21T13:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 203886,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4931947.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/711nono",
                "username": "711nono"
            },
            "url": "https://myanimelist.net/reviews.php?id=203886"
        },
        {
            "content": "I never thought I would like Kuroko no Basket. I am a lazy teenage girl, sport just isn't my thing, and yet here I am completely hooked on this anime that revolves around sport - I've found myself rewatching matches over and over and I went as far as to read the whole manga in a day because I couldn't wait for the next episodes to come out. Everything about this series adds up.\r\nStory (10/10)\r\nFor an anime as simple as a basketball team trying to win their way through the ranks, Kuroko no Basket incorporates amazing back stories on each of the characters, with lotsof flashbacks shown throughout the series - but it's not the annoying type of flashbacks that would come in the middle of a battle, these flashbacks are very well placed in the middle of each basketball match, simultaneously giving us a break from the action while building anticipation for the next match. The back stories give us the information needed about characters to sympathize with them even during the climaxes of battle. \\n\r\nWhen it comes to the actual basketball matches, nothing is lacking. It's true that each character is totally overpowered, but because of that during the games there is twists and turns, even total backflips on what the outcome is going to be. It makes normal basketball look boring.\\n\\n\r\nCharacters (10/10)\\n\r\nThe characters were the highlight of KnB for me. If the story is good, the characters are outstanding.\\n\r\nLike I said before - most of the characters have back stories, which makes it easy to sympathize with them during the heat of battle or even off the court, but the best thing about the characters is that each and every one of them have a different, three dimensional personality. \\n\r\nWhile this can be said for most anime, I think its shown very strongly in this series - there isn't a boring character in there, it's almost crazy how different and interesting each one is, but at the same time I find myself legitimately believing that these characters could be people in the real world. The silly one liners or short conversations put in for comic relief sound like things I could actually picture my peers saying, plus the fact that its implied that teammates hang out outside of practice makes KnB seem realistic in the way that they capture high school teenagers. It gives a feel that not many other anime give.\\n\\n\r\nArt (10/10)\\n\r\nKnBs art is great. I feel like the characters are designed amazingly, and each persons appearance fits their personality. \\n\r\nThe action scenes are done so well I find myself unable to take my eyes off the screen as I watch fluid exchanges between characters with different colours and angles used to convey more feeling of suspense during the intense battle scenes.\\n\r\nThe only criticism I would have is that during the start of the first season, occasionally characters faces would look weird if shown from a certain angle, but they fixed that up during the second season.\\n\\n\r\nSound (8/10)\\n\r\nI don't usually pay attention to sound in anime, and while sometimes I don't skip intros its usually to watch the animation at the start/end, not for the sound, so I'm not quite fit to review this, but something I have picked up on is the music they use when the games begin to get fierce.\\n\r\nThe music is used to build suspense, and it does it very well. I find myself entranced in the complete badassness of it all, and while the action scenes are already great the music definitely adds to it.\\n\r\nOther than that, sound effects are used well, it sounds exactly like it should on a basketball court - feet moving, balls bouncing, cheers from the crowd. The sound was done how it should be done.\\n\\n\r\nEnjoyment (10/10)\\n\r\nKuroko no Basuke has me entranced in this crazy world of teenage basketball stars and crazy characters. It's a personal favourite. It gets your blood boiling and after you've watched an episode you feel as if you can't go another minute without watching another. I would definitely recommend it, if you don't mind being obsessed.\\n\\n\r\n-Just a side note; this is the first review I've written, so my apologies if I've left anything important out xxx",
            "date": "2014-04-02T06:39:00+00:00",
            "helpful_count": 7,
            "mal_id": 138307,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3670833.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/saikea",
                "username": "saikea"
            },
            "url": "https://myanimelist.net/reviews.php?id=138307"
        },
        {
            "content": "Kuroko no Basket\r\nReview By: John Fragglepuss Evans\r\nKuroko no Basket combines basketball with anime in such a good way. The basics of basketball are there, but they are combined with the action and drama that anime utilizes so well. The dunks are intense, the passes are intense and they use beams of light to show just how amazing the passes truly are. Kuroko and Kagami remind me of the old NBA combo of John Stockton and Karl Malone, one with finesse and the other with raw power. In true sports anime fashion, the matches are all important and all last several episodes while the drama andintensity unfold.\\n\\n\r\nThe first season was new and hilarious, but it starts to get old when the second season is more of the same.\\n\\n\r\nYou might enjoy this if: You are a sports anime veteran or even if you are a sports anime rookie.\\n\\n\r\nYou might not like it if: Over dramatized motions and slow-motion sweat is too much for you.\\n\\n\r\nNote to the Viewer: Be prepared to get sucked into the story and watch a season in a day.",
            "date": "2015-04-20T20:14:00+00:00",
            "helpful_count": 7,
            "mal_id": 186108,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4571079.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Fragglepuss",
                "username": "Fragglepuss"
            },
            "url": "https://myanimelist.net/reviews.php?id=186108"
        },
        {
            "content": "If you haven't watch the series yet, see my first season review instead. I also won't repeat on what I said on the first season review.\r\nhttp://myanimelist.net/reviews.php?id=192244\r\nThe second season of Kuroko no Basket is a huge improvement since the first seasons. There are more surprises and thrills on the second season than the first one. The second season shows Seirin getting back up after that loss on the previous season. How they really developed the Team Seirin so far is great. We can really see their struggles on how are they going to get back up.\r\nThe animation also has it's plus because there are more greatanimated moments on this season than the first one like \"The Zone\" and I thought it was a great job from Production I.G.\\n\\n\r\nOverall, still great and it still maintains it's thrill in basketball except, it's this season is better.\\n\\n\r\nScore: 9/10",
            "date": "2015-07-04T01:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 192247,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4435225.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/FurankuSan",
                "username": "FurankuSan"
            },
            "url": "https://myanimelist.net/reviews.php?id=192247"
        },
        {
            "content": "So, I feel like I have a lot to say about this season of Kuroko no Basket. The first thing is to praise this anime on how brilliant it is at storytelling and suspense. Even more so than the first season, this season hit those points perfectly. I said this in my previous review, but Kuroko no Basket wasn't remarkable to me initially. It doesn't deserve anything less than 10 points, but it also isn't astounding. However, this season may have changed my views on that.\r\nAs I mentioned, the building of suspense is one of the few things this anime truly shines with, and it'ssomething that I appreciate. It's very good at skewing your expectations. For example, during most of the games that Serin plays, there is an immaculate push and pull that is seen. In other words, each game begins by making the audience feel like Serin will have a fighting chance. Throughout the rest of the game, that chance will be broken and will reemerge again and again, and by the end of it, you will have no idea who will win or who will lose. Neither option will be surprising, but because the suspense is built up so well, you will feel just as dejected or just as joyful as the characters do when they lose or win respectively. This push and pull technique is used often in storytelling, but I personally don't see it used as convincingly as it's used in Kuroko no Basket. \\n\\n\r\nAnother thing this anime is exceptional at is character work and development. Each time a character, namely Kuroko and Kagami, decides to get stronger, there will be a clear motive as to why they do so. Besides that fact, it isn't an unrealistic development. This anime doesn't raise it's characters up to a point so high that they can defy all logic previously set by the storyline. Bleach, for example, is an anime that harbored some unrealistic development of it's main character, Ichigo. It was entertaining, but knowing that someone is going to win no matter what can get boring very quickly. In Kuroko no Basket, the character's development doesn't always mean assured victory, and that's refreshing.\\n\\n\r\nThe one negative I have about this season (and it's sort of cosmetic) is the fact that the new moves that the characters develop will have names to them. For example, Kuroko's Ignite Pass. They sound cool initially, but it isn't realistic. Even if the only ones who've heard the move's name is Serin's Coach and Kuroko, during a game, everyone will comment on it using the name. It is a little irksome, but as I said, it's just a cosmetic issue. I understand that it's used for effect and not for realism, and it doesn't change my enjoyment of the anime at all.\\n\\n\r\nHopefully this review helped some of you decide if this season or this anime is worth watching. To me, it's top quality at every moment. I suggest you give it a go.",
            "date": "2018-08-17T11:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 286705,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=286705"
        }
    ],
    [
        {
            "content": "please dont judge my english , thank you - \r\nto the story :6/10 - nothing spectacular but solid , its \"shounen\" and comes along with the typical stereotype things with the \"power ups\" and other things that makes it hard to take some things serious or even enjoyable , i guess to much \"shounen\" for me . the staging is fine and the progress of characters is also nothing spectaculat and fits to the stereotype things of shounen , YES i dont forgot that its a sport shounen series but the shounen part is more overwhelming .... which wasnt that big in the 1st season\r\ntothe art :8/10 - the animation are great and enjoyable , to much shounen and based for the targeted audience for me but you can overlook it \\n\\n\r\nto the sound: 7/10 - its good and fits to the most parts well enough , but like the most shows overdramatising sometime\\n\\n\r\nto the character: 6/10 - you could guess that im not a fan of these typical shounen characters but its okay , they fit and you got for everyone someone they can like or hate and identify with themself ..... but character without any marks or something to hate about ? there is no antihero or someone who question about something. the progress of the characters are fine\\n\\n\r\nto the enjoyment: 6.5/10 (i guess a small spoiler?) - the parts of this show where they get confront with themes like \"talent\" and \"hard work\" are great and makes it enjoyable and goes further then \"just\" being a sport show and animation eyegasm which makes it quite enjoyable for me - i know its a shounen show so why should i hate on that part when i know what comes along with it but its not a rule to go FULL shounen and take the bad aspects of it..... but i can kinda overlook it\\n\\n\r\nOverall : 6.5/10 - the animation and the themes are rescuing the series to not get called an eyegasm for young people with immature content - the staging and the progress of the series are quite fine so overall you can watch it if can overlook sometimes the shounen sides of it .... \\n\\n\r\nwhy do i \"hate\" over the shounen part ? does the purple hair guy got a jetpack ?\\n\r\nfrom where did they got the inspiration for the names  of their skills ? okay he can fake so fast , hes good yea ? lel he stole the other guy skill and everybody knew whats going on , just filling screentime...... for my taste the shounen part could be better included as it has be done..\\n\\n\r\nThank you",
            "date": "2014-03-29T20:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 137827,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/maybeanoob",
                "username": "maybeanoob"
            },
            "url": "https://myanimelist.net/reviews.php?id=137827"
        },
        {
            "content": "This season went by faster than the first I must say. \r\nStory 8/10\r\nThe story continues with a different type of tune where you learn more about the characters pasts. Kiyoshi is introduced formally and we got to see how Seirin came to be. You get insight into Kagami's past too along with others. This meant the games were longer, the moments in between were also but they had a lot of story. In my opinion even though this wasn't as hyped as season 1 in terms of play, this allowed us to see beyond the basketball into the psyche of our characters. \r\nSoundtrack 8/10\r\nThe OPand ED continued to be great especially the second OP. \\n\\n\r\nArt 7/10\\n\r\nI definitely noticed a decrease in quality. And I truly believed they could have done more to make animation a lot more satisfying. It is a shounen at the end of the day and you only have to watch the second OP to understand how far they could have taken the art and animation of the players actions on the court. \\n\\n\r\nCharacter 8/10\\n\r\nI ended up liking Aomine a lot more this time round. Kiyoshi also proved himself worthy as the founder of Seirin and I understood why Hyuga is such a great captain. On the other hand I didn't like what Akashi did to Kagami because it felt like producers did it to give him a sense of danger. Very pointless. Yousen on the other hand was a revelation during the final game as his personality changed with an unexpected ending. Overall the new characters and the new insights into familiar characters was very good. \\n\\n\r\nEnjoyment 8/10\\n\r\nI didn't enjoy it as much as the first season but I still binge watched it even faster than the previous. This season was important for fleshing out the characters and adding more to the story which may have been a blessing in disguise as too much action could have left the series with less steam to finish with. Now I've started season 3 I'm hoping for a good ending to all of this.",
            "date": "2016-08-19T07:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 227115,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5172188.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/abovetheveil",
                "username": "abovetheveil"
            },
            "url": "https://myanimelist.net/reviews.php?id=227115"
        },
        {
            "content": "This is based on my opinions and my experiences.\r\nMay contain spoiler!\r\nSo first thing i wanna say that this sequel is like another episode from kuroko no basuke series, like episode 1 to episode 2. For me, which i watch it \"marathon\" or as fast as i can to complete this anime, i really enjoyed this \"thing\" or \"feature\" that studio gave, but i don't know if i watch it with some delay between release date from the season 1 to season 2.\r\nThe story is similar to season 1 so i don't really want to review it again, but there are some thing that in theseason 1 they are'nt in there, yeah the special effect and the super name for the super skill, for me i am not really enjoyed this super effect, that makes the series is more unrealistic than before. I knew that the creator want to make the development for the main characther and the others is paid off but its just meh. More thing, there is much more trash talk between player in season 2, i don't really think this good, but yeah if the trashtalk is not in there, the show is will be so boring xD.\\n\\n\r\nThe art is looks more cooler than before, the special effect is looks great and the 3D is improving. Love it.\\n\\n\r\nThe character is very good, they spawning more of villain(?) or OP character which it's make the way more harder than before, so the main character is need more skill to defeat the OP character.",
            "date": "2017-05-26T15:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 248585,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/sandywonka",
                "username": "sandywonka"
            },
            "url": "https://myanimelist.net/reviews.php?id=248585"
        },
        {
            "content": "Kuroko No Basket Season 1 2 3\r\nThe story focuses on students who have passion on playing basketball. Different skills will be displayed, along with different belief because of the talent they have. Among those students, five stand out and was called Generations of Miracles. They are the prodigies in basketball on their place, and was scattered on different school after they graduated. One student, respected by the five members, entered a newly created school and is destined to meet another guy whom will help him to make the five prodigies realize that the way of their basketball is wrong. The series will show different plays,struggles to improve, and how the team with the combination of two students win the battle they prepared to take. \\n\\n\r\nKuroko No Basket Anime Review\\n\r\nBy: Tadatoshi Fujimaki\\n\r\nApril 15, 2019\\n\\n\r\nOverall: 10/10\\n\\n\r\nPlot: 10\\n\\n\r\nSports Anime genre have only one path to take, tournaments. Participating individually or by teaming up, it is the most common plot that exist. While this is not a unique one, it will be the author's capability how he manage to capture the interest of the viewer and excite them. This series focuses on students who love playing basketball. At first, I am really not interested on watching this anime. It is kind of absurd to think of a basketball story with extraordinary skills. But after trying it out, it made me realize that the plot of the story is great. I love the simplicity of it. The main reason of why the series moves forward and how it affects every branches of the story. Unrealistic as it may seem, the lesson is still there. The creator successfully stress out the core value when playing basketball. What also made me hook on this series is the directness of every plays all of the basketball teams have. Each play only last for an average of 5 to 6 episodes. Flashbacks are there but its only on a really minimum basis. You can enjoy watching all of the plays without so much cliffhanging and annoying side stories of the characters. \\n\\n\r\nCharacters: 10\\n\\n\r\nIt is already a known that almost all of the characters on this series are super cool. It is the reason why most of the girl watched it, I think. Aside from that fact, the development of the characters can totally be seen along the story. The changes and realization they made make them more of a human. Though not skillfully speaking. Since there are so many characters, giving all of them the spotlight is hard. And that's whats amazing. The creator successfully introduce a past where most of the characters belong. That way, it won't be hard tackling each of the characters past and it gives the story more time in other scenarios that needs to be displayed. I love how the story never depend on the back story of the characters so much that it will take too much time to explain it. \\n\\n\r\nSound and Animation: 10\\n\\n\r\nPerfect. My phone is full of Kises' picture. Yes, every character is so handsome but it is not only this. The animation of the story is really great. Parts where the characters show dribbling, passing, shooting or even guarding their opponents is really detailed. I love how they show the movements of the characters playing on the court, as well as their expression depending on the feeling they have. Should I also mention the voices? Yes, theirs are really cool and perfectly matches the looks of the characters.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nI am not really a fan of basketball. I do not hate it, but I do not also like it. This is the first anime basketball which got me hooked. Due to so much enjoyment watching it, I've finished it in a more faster time than the other series I tried. Every episode will make you want more, more plays, more actions on the court, more characters to encounter with. It is really exciting, and fun to watch. \\n\\n\r\nEnding: 10\\n\\n\r\nThis is the best route to take for an ending on this series. The main goal of Kuroko has been met after winning the nationals with his team. But no, the story did not really move forward just because they had to win. It is because he had to bring back his loss previously. He had to bring back all of the people precious to him and he did. Fixing things that is broken and making them realize the most important thing when doing the thing they love. I am content with the ending of this series. It is simple, yet it will made you realize something important.",
            "date": "2019-04-19T01:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 306640,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6349777.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Castinate",
                "username": "Castinate"
            },
            "url": "https://myanimelist.net/reviews.php?id=306640"
        },
        {
            "content": "Basketball is a sport that gives you an incredibly rush of energy, so its only fair that an anime based on it gives you a similar experience.\r\nWhen I watched the first season of Kuroko no Basket and I saw how overpowered some of the characters were, I didn't know how they would manage to top that, this season doesn't take long in showing that. A warning for potential spoilers below.\r\nJust before I start writing this review, can we all agree the Zone is like a cheat code? It seriously amps up how good characters can be immensely and makes some almost unstoppable.\r\nStory 9/10 : \r\nOna whole the story is done very well, its interesting, fast paced, and gives a rush of energy like you would when playing basketball. \\n\r\nA criticism I have heard of this show is how unrealistic it is. While I completely agree its unrealistic as none of these players would most likely exist in real life (barring the Steph Curry shoot from anywhere character) , it isn't supposed to be realistic. Anime is escapism for some, we can pick apart a show for its unrealism, but then we would be sat here criticizing 99% of things ever created in this form of media.\\n\\n\r\nArt 7/10 :\\n\\n\r\nThe art isn't something I will comment on too much. The animation is free flowing and ok for the most part, especially in the serious moments on the basketball court but otherwise not much else to say.\\n\\n\r\nSound 10/10:\\n\\n\r\nIf you check out Kuroko no Basket's 2nd Season MAL page you will notice the  Shounen tag on it. And boy oh boy does that shine through with its epic music at tense times that can get you seriously revved up. It reminds me of when I used to watch Dragonball Z as a kid and Goku would transform to Super Saiyan 3 with epic music in the background.\\n\r\nThe 2nd ending to this season is up there as one of the best in all of anime, I highly recommend even if you don't like basketball or you hate Kuroko, to check it out. Its seriously incredible.\\n\\n\r\nCharacter 8/10 :\\n\\n\r\nSo finally in season 2 we have met all of the Generation of Miracles as we meet Murasakibara the Gigantic Center with insane strength and Akashi, the leader of them all. We meet Himuro, a childhood friend of Kagami who is on the same team as Murasakibara as well.\\n\r\nIf you watched the first season you should be familiar with majority of other characters with exception to the final 2 Generation of Miracles introduced along with their teams. Overall, i think the characters are really strong and done well, they have interesting concepts and I was interested to find out more about them.\\n\\n\r\nEnjoyment 10/10 :\\n\\n\r\nNot much else needs to be said about how much I enjoyed this show, it was interesting, fun, gives a rush of energy and excitement with epic moments, awesome powers and great music.\\n\\n\r\nOverall 9/10 : \\n\\n\r\nIf you enjoyed season 1, I highly recommend checking out season 2! Basketball is a great sport and while this isn't realistic, it does a good job in show the excitement and fun you get from playing the sport!",
            "date": "2016-06-15T04:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 220802,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5101979.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/RychesShadows",
                "username": "RychesShadows"
            },
            "url": "https://myanimelist.net/reviews.php?id=220802"
        },
        {
            "content": "READ THE REVIEW ONLY IF YOU HAVE SEEN ALL 25 EPISODES\r\n             ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nkuroko no basket season had something which real nba players do in a real game leaving behind some flashy stuff, which i even agree is needed to spice up a sports anime else its better to see NBA games on TV...but kuroko no basket season 2 is something which even aliens will resent to even think about, forget nba  hall of fame players...kuroko no basket s01 had gr8 crossovers, behind the board basket, nutmeg passes,knee breaking movements, pitch perfect 3 pointers, superb passes ; but i dont know wat thought lead to the mangaka to do dis level of insanity wid knb s02, was he serious? or was he on joints? even gr8 magician HOODINI cant even escape from the closed sealed iron boxes thrown into deep sea like kuroko does against shutoku and touou clubs.\\n\\n\r\nNOW lets dive into the summary of this magical basketball which even aliens will afraid to attempt or dream of even...\\n\\n\r\nAfter the defeat in the inter high, seirin high team members pledge to get sronger and to be a formidable force to show that they will not face the similar consequences in the winter cup. here we will see the return of the uncrowned king member kiyoshi teppe who formed the seirin high basketball team. s02 also foccuses on the odds kiyoshi went through to build the basketball team and how the team fares in different competitions. kuroko and kagami meanwhile try harder to support their senpais who are looking forward for a revenge.\\n\\n\r\nNOW lets discuss the good aspects and bad aspects of the ANIME...\\n\\n\\n\r\n                                           GOOD ASPECTS\\n\r\n                                            ~~~~~~~~~\\n\r\n1> gr8 op and ed soundtracks. [ u will love all the tracks]\\n\r\n2> spine chilling ost to support the epic moments and events.\\n\r\n3> kagami taiga vs aomine daiki [ dis saves the anime to some extent]\\n\r\n4> new generation of prodigy memebers akashi seijuro and murasakibara..murasakibara will entertain u for sure with his gr8 blocks.\\n\\n\\n\r\n                                              BAD ASPECTS\\n\r\n                                              ~~~~~~~~~\\n\r\n1> Misdirection overflow, this concept just blows out reality from the world...means even god will be shocked to see WTF i is...\\n\r\n2> though murasakibara had gud aspects and blocks were tr8 to watch, the ending of the match was dissapointment...why would mangaka make a lazy fellow who has no interest in basketball and make the ending look so boring?\\n\r\n3>all seirin players were disapearing as if dey r gaseous state of matter, was dis anime kuroko's basketball or kuroko's magicball i couldnt understand at all...\\n\r\n4> started with yelling and screeching and ended wid dat dat only... too much frustrating as dose dint allow me to see wat the players were doing on the court even..\\n\\n\r\nThis anime was a serious let down after seeing S01 to which i gave 8 points ... this anime isnt even a 5 star one, just bcz of aomine daiki's badass character and aomine vs kagami and some skills from murasakibara i gave the anime a 5 star rating... COMPLETE LET DOWN AND DISGUSTING ANIME!!!\\n\r\ni just had to pinch myself throughout to make me sure i exist on earth and not on saturn or jupiter where gravity ceases to exist. Guys if possible just fast forward just to see kagami vs aomine and seirin vs yosen...\\n\\n",
            "date": "2015-12-28T08:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 207091,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4985668.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TricksterTokuchi",
                "username": "TricksterTokuchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=207091"
        },
        {
            "content": "I love this show. It gets me pumped up no matter what.  But I just cannot agree with the direction it insists on going. I love the show, but I hate the two main characters. I hate Kuroko and I hate Kagami. I love Kise, I hate Aomine. I love Midorima and hate Murasakibara. \r\nI love characters who put their blood and sweat and battle it out in a long drawn battle. Inspiring themselves when they are down, forcing themselves to never give up and charge on. Kuroko no basket has many characters like these who I really love. Kise, Midorima, Hyuga and myfavorite character of this season Kiyoshi Teppei. \\n\\n\r\nI hate that the show's essential message is that naturally born gifted people are better than those who work hard and bleed and sweat for their dreams. Essentially Kagami who was built as a solid protag in the first season and was shown as a guy who never gives up, well they made him special. He is chosen, he is part of a select few who can awaken and go into the ZONE. You remember that cool guy Aomine from the first season. The guy who trained so hard he was bored, well he is awesome coz he can go into the ZONE. The season ends in the same dull, uninspired way when Kagami beats his \"brother\" Himuro by going into the ZONE. Nevermind that Himuro worked his ass off to achieve his dreams. Oh and he couldn't do it on his own, he had to rely on the worst character in the anime Murasakibara to achieve his dreams. \\n\\n\r\nThis should have been Kiyoshi Teppei's story, not Kuroko. To all those saying Kuroko is like Teppei, er nope. Kuroko a guy who has never played shoot before, mastered shoot in like 1 week. Wouldn't be surprised if they give him ZONE next season. \\n\\n\r\nGreat first season, extremely disappointing second season saved only by Hyuga and Kiyoshi. God damn, make Kiyoshi the main character already.",
            "date": "2016-05-17T08:47:00+00:00",
            "helpful_count": 2,
            "mal_id": 218762,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5313412.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 6,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ndsempai",
                "username": "ndsempai"
            },
            "url": "https://myanimelist.net/reviews.php?id=218762"
        }
    ]
]