[
    [
        {
            "content": "What it's really about:\r\nA big-chested clumsy knight gets involved with a demon problem, as well as handsome blacksmith and his mysterious past.\r\nThe Good:\r\n- Excellent production value\r\n- The relationship between the blacksmith and the knight is cute\r\n- The episodes that don't directly further the plot are still very interesting\r\n- The setting has an intriguing history\r\nThe Bad:\r\n- The knight can be viewed by many as \"annoying.\"\r\n- Those expecting a Lord of the Rings experience will be sorely disappointed.\r\nConclusion:\r\nI think the reason this anime got so many below average reviews is because of the reviewers' preconceptions of what the anime should have been.  If you can manageto dispel any preconceived notions you have about this anime, then you're in for a very nice treat.  Just enjoy it for what it is.",
            "date": "2009-12-20T21:57:00+00:00",
            "helpful_count": 249,
            "mal_id": 21571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bjtdevera",
                "username": "bjtdevera"
            },
            "url": "https://myanimelist.net/reviews.php?id=21571"
        },
        {
            "content": "I find this anime pretty interesting, it's rare to find animes where the main protagonist is not almost an \"all-mighty-god\" who kicks everyone's butt in less than a second, this makes the anime more interesting to me due to the fact that I want to see that character's progression.",
            "date": "2009-11-18T00:11:00+00:00",
            "helpful_count": 127,
            "mal_id": 20650,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kyousho",
                "username": "Kyousho"
            },
            "url": "https://myanimelist.net/reviews.php?id=20650"
        },
        {
            "content": "This is a very laughably bad show.  Probably the most enjoyment I get from this show is pointing out everything that is just outright terrible about it. The production looks alright, with decent enough music, sounds, and artwork, but after that the quality of everything else goes down the drain.\r\nFor starters, the main character is simply awful.  Cecily Campbell is perhaps one of the weakest protagonists I have ever seen in anime.  She's clumsy and useless at doing anything without the help of other characters, and largely demonstrates very weak initiative throughout series as up til now.\r\nThe show largely focuses on sexjokes to inspire comedy value.  These often involve Cecily being sexually harassed or victimized through various means. Not only does this not make the protagonist look any better, it's very stupid and overdone to the point of becoming stale.\\n\\n\r\nThe plot for the large part does not show any more hope either. Very little is done to develop character relationships aside from the multitude of sex jokes, and what little that may resemble a backstory or plot development is often overshadowed by the huge amount of fanservice that is stuffed into this show.\\n\\n\r\nFight scenes in this show are pretty unspectacular, largely due to Cecily looking extremely incompetent and clumsy during most of them. Luke Ainsworth, one of the supporting characters admittedly does get some cool points for apparently being the so-called Sacred Blacksmith, and an expert swordsman to go with that. The same pattern of him constantly rescuing Cecily from her periods of sucking in combat is pretty darn lame however, not to mention Cecily's reliance on a Demon Sword rather than her own powers to be able to do anything in combat.\\n\\n\r\nAs I've stated, the only reason why I even bother watching this show is just to make fun of how awful it is. If for some reason you can overlook the fact the main character sucks (probably literally too, but this isn't an adult rated anime), and you don't get tired of constant jokes about how Cecily's breasts are huge, you might find something worthwhile in this show.  It's only twelve episodes anyway, which isn't too unreasonable to endure.",
            "date": "2009-11-15T23:20:00+00:00",
            "helpful_count": 98,
            "mal_id": 20593,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=20593"
        },
        {
            "content": "The Sacred Blacksmith is a really mixed bag.  This could have been good, with the underlying story being highly interesting.  The whole excecution of the story is unfortunately, horrific.\r\nThe flaws in the storyline mainly lie with the protagonist.  Cecily as the main lead has shown growth but this is unfortunately obscured by her annoying personality.  The way her \"talk\" sequences were done was extremely off-putting, and her jarring voice made things even worse.  This links to the lack of a logical flow to the storyline whenever it involves Cecily.  One evening, she's in a life-threatening battle, the next dayshe's smiling at her potential killers (twice...same people, same arc!).  Another example is excessive, irrelevant chatter during battles.  It's as if her speaking has a \"freeze\" effect on the enemy (yea right!).\\n\\n\r\nThe supporting main characters, Luke, Lisa and Aria were highly pleasurable and fun, each having rather interesting backstories as well as a good source of laughter.  They fulfill their respective roles excellently.\\n\\n\r\nThe art was average-good, with the use of an eye-pleasing palette.  Afterall, I started watching after seeing the nice art at the Animesuki season preview.  The girls were either cute or hot, depending on age!  The monsters looked ugly but aren't monsters supposed to be ugly anyway?  The animation sequences during battles were very well done.  It's a shame the battles had to be rushed in a short, 12-episode series.\\n\\n\r\nThe BGM is very good and it is a pity because of the lacklustre storytelling.  This situation is reminicent of Tsubasa Chronicles season 1 where the music was awesome, but too lively for a poorly executed and slow story.  The OP seems to have split people but I felt the beat and tone was a good fit.  The ED is just awfully cute, and expresses Lisa as a character very well.\\n\\n\r\nOverall, I enjoyed the story because it had such potential, as well as the interesting and likeable supporting characters which kept me watching this rather mediocre series.  That said, the lack of logical flow *points at Cecily* is a serious killjoy.  People have asked me what I was watching during Autumn 2009.  While I gave an honest answer (SnB was the only show I was following!), I have told every one of them to avoid.",
            "date": "2009-12-20T15:44:00+00:00",
            "helpful_count": 74,
            "mal_id": 21558,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91327.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/X10A_Freedom",
                "username": "X10A_Freedom"
            },
            "url": "https://myanimelist.net/reviews.php?id=21558"
        },
        {
            "content": "Fantasy is all about adventure. It’s about going outside of your comfort zone, seeing a new place and a new facet of yourself, and being changed by the time you return home. Anime like that is filled with believable cause and effect. And then there’s The Sacred Blacksmith.\r\nThe series opens with Cecily Cambell, a newly trained knight charged with the protection of the Third Independent Trade City. She is an excitable girl, stubborn, and full of bravado. She wishes to help people, but has little actual competence. The broken sword of her family is as much a symbol of her own need to be temperedas anything. Towards those ends she pursues the services of Luke Ainsworth, a standoffish blacksmith with little patience for Cecily’s immaturity. Joining them are Lisa -- Luke’s pint-sized and spunky assistant -- and a woman with a mysterious and tragic past named Aria. \\n\\n\r\nDark events soon push them together as tenuous companions. Some figure in the shadows is collecting Demon Swords, powerful remnants from the great war that ended forty years ago. The City is threatened and Cecily and Luke have their own reasons to stand against it.\\n\\n\r\nThe setting and plot sound clichéd because they are. This is well-trodden ground. The first few episodes promise to offset that imbalance with the characters, but sadly that’s where things start falling apart.  As our protagonists quickly find themselves thrown headlong into one problem after another, their relationships become secondary. Instead of friendships blossoming from shared duress, they just seem to ‘bond’ because they shared the same scenes.\\n\\n\r\nPart of the problem is in Cecily’s characterization, which puts light on the deeper issue of Sacred Blacksmith’s incorrect focus.\\n\\n\r\nTwo of my favorite moments are when Cecily realizes that her desires and willpower are not enough to become the best she can be and then, later, when she uses that deficiency to overcome a seemingly insurmountable object. That was when the story shined and I thought “yes! -this- is what this show is supposed to be.” Cecily is our protagonist in all her inept glory. Watching her stumble towards being a skilled knight is where the show -should- be focused, how each tiny victory and tiny defeat magnifies her growth.\\n\\n\r\nAdmittedly, there are times when Cecily sheds her armor and shows some vulnerabilities in a realistic light, but usually she merely sheds her armor so someone can joke about how wonderfully large her breasts are. I like running gags as much as anyone, but Sacred Blacksmith never really earns the right to do so. They would be complementary features in a series less problem-ridden; instead they merely draw attention to themselves and make it difficult for a reviewer to be objective and not single them out for one whole paragraph. It gets to be a little bothersome when they just pop up out of nowhere. \\n\\n\r\nAnd, no, that wasn’t a boob joke.\\n\\n\r\nIt isn’t that the foundation here is weak, but that it’s uneven. There are some really exciting and insightful moments and yet they are surrounded by plodding uninteresting plot and cloying melodrama. It sometimes feels like a writer du jour was invited on board each week to pen the script. The story is disjointed, populated with mini-arcs that hardly elucidate the main arc at all. Challenges seem incidental. Character development unearned. And then everyone dresses up like a maid.\\n\\n\r\nIf that last sentence seemed to come out of nowhere and confused the hell out of you, it was supposed to. That’s exactly how I felt.\\n\\n\r\nThe most irksome problem is pacing. The main story arc only gets underway late in the series, ending up rushed. Halfway through the series our cast of characters effectively doubles, but we have no time to get to know them beyond their two-dimensionally flat personalities. Worst of all, two battles are halted in their tracks while our heroes take a break to lollygag. Oh, I mean, “work slowly at making a weapon to continue the fight after all the scene’s original tension has been obliterated”. It felt more concise to say lollygag, though.\\n\\n\r\nAside from that specific editing choice, the battles are actually engaging. In fact, my greatest praise is what weaponry gets used. For all the adherence to the conventions of the swords-and-sorcery genre, there are some uncommon armaments here. I can’t describe enough how visually refreshing I found this, to see different weapons and fighting styles. Like all the other good bits in the show this too doesn’t last long, but it helps break up the “This is a fantasy; we need more swords!” mentality that plagues the genre.\\n\\n\r\nOverall, the art and animation is of consistently high quality. The city is a vibrant place. Manglobe’s attention to detail in creating a living, breathing setting is laudable and effective (something I personally found lacking in their earlier work, Ergo Proxy). There’s an idyllic peace in the city when all hell isn’t breaking loose and a gritty immediacy when it does. That the city is built at the foot of a mountain covered with an ominous and never-moving cloud is a fantastic addition. The characters too are well-designed and have outfits that are intriguing albeit sometimes impractical. If only they were as cool as they look.\\n\\n\r\nI couldn’t help thinking back to last season as I watched this. CANAAN showed how to put together a compelling ensemble cast, while Spice and Wolf II showed how to dramatically weave the complexities of a relationship about two protagonists. Both lessons are lost on Sacred Blacksmith. There is neither a group dynamic nor a fully realized pairing. The one great friendship we do have between Cecily and Aria gets lost in the shuffle of events and hardly has the emphasis it deserves.\\n\\n\r\nWhat disappoints me most is what Sacred Blacksmith fails to do. It fails to do anything exciting with fantasy. It fails to test its characters’ resolve with any meaningful challenges or anguish. It presents so much magic… yet fails to capture any wonder. Once we understand more of Aria’s nature, for instance, a wild world of possibilities opens up. How does her nature impact the way she interacts with the city she lives in? The people she calls friends? Her own inner turmoil? Instead, her character development seems to have the same tedious trajectory that everyone else has: at least one episode devoted to mental struggles, a resolution easily attained, and a sanguine outlook the rest of the time.\\n\\n\r\nThe music is a good analogy for the show as a whole. The OP starts strong, is rather catchy, reasonably dynamic technically speaking. The score of the series is standard fare medieval fantasy (recorders, lutes, tambourines, and the like) and other more traditional orchestrated pieces that are apt, but not spellbinding. Finally, the ED is the most randomly bright and unbelievably saccharine thing you have ever heard. While I freely admit my personality isn’t morning glories and sunshine, this outro is so distinctly misplaced and just one more example of Sacred Blacksmith’s disjointed elements.\\n\\n\r\nSo who is this anime for? More forgiving viewers, I imagine. The series isn’t high art and let’s face it: it’s not trying to be. It doesn’t want to be a humble, little fantastical tale, but a brief little epic about a lot of different things. About companions trying to help each other, faltering romance, sociopolitical intrigue, freaky monsters, black villains, sleeping horrors. By including too much its scattershot attention span shows, but if you can overlook that and the other systemic problems, want a light-hearted romp with a peppering of drama, or happen to be a fantasy junkie, you might have fun with this.\\n\\n\r\nIf there is a second season I can only hope they strip away the extraneous parts, peel back the deeper layers, and leave what remains proudly exposed and naked for all to behold.\\n\\n\r\nAnd, yeah, that was kind of a boob joke.",
            "date": "2009-12-19T20:47:00+00:00",
            "helpful_count": 28,
            "mal_id": 21540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197495.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Spookt",
                "username": "Spookt"
            },
            "url": "https://myanimelist.net/reviews.php?id=21540"
        },
        {
            "content": "First thing is what I think of this anime on a whole. Your first impressions are this is going to be a big disappointment. Sure! it may not be the best but it's enjoyable. There wasn't any surprises, nothing new but it was enjoyable. Don't judge it by the first episode. It really gets better.\r\nStory(6-fair)\r\nCecily Cambell becomes a knight and she is totally useless. She's all talk. She is saved by Luke Ainsworth and begs him to make a katana like his. And so their relationship begins. The story was like a Déjà vu (literally!!) But it shines! It makes you laugh, sometimes cry andfeel the feelings of the characters in the story. It wasn't repetitive nor boring. Sometimes the fillers and disappointing. There is only one filler episode but in each episode there is a part that has nothing to do with the actual plot. Either it is at the beginning or the end. Even so, it's no boring or unbearable.\\n\\n\r\nArt(7-good)\\n\r\nthe art was exactly like K-ON's sometimes I thought Cecily looked like Yui just in a red version(LOL). I'm very picky about my art. It has to be up-to-date and such. But the animation flaws my eyes just don't see I don't know if there aren't or if there are. But the fights, when the swords are swung and the colors it's really catchy.\\n\\n\r\nSound(4-Decent)\\n\r\nThe theme song matched the anime but it wasn't special in particular. The ending son was very catchy. Also, the background music, which sometimes I don't notice is good and it goes with the whole flow of the anime and it's set date.\\n\\n\r\nCharacter(10-Outstanding)\\n\r\nI liked Cecily's character. She's useless but she understands others feeling and her feelings are genuine. She isn't one of those big mouth girls who cant do anything or the crappy type of girl she's a strong willed character that I like.\\n\r\nNot only Cecily but all the character's have their share in the spot light, their time to shine. You can feel the feelings of all the main characters.\\n\\n\r\nEnjoyment(7-Good)\\n\r\nAs I said it is really enjoyable even without much action.\\n\\n\r\nOverall(7-Good)\\n\r\nJust watch the anime!!!\\n",
            "date": "2010-05-28T09:16:00+00:00",
            "helpful_count": 27,
            "mal_id": 26525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/305532.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lali97",
                "username": "lali97"
            },
            "url": "https://myanimelist.net/reviews.php?id=26525"
        },
        {
            "content": "Seiken no Blacksmith is anime that sounds very good when you look the descriptions. It says that there will be an adventure, but doesn't says that the adventure will be so boring.\r\nStory - 3/10\r\nFantasy world with demons, demon swords and some mysterious people. Sounds very nice, but the way that the story develops it's everything but nice. The demons are the usual, the sword too, not to mention the main antagonist - \"the man in black\"... and this is not the worst. The main characters are also the usual strong boy and weak knight, the only \"new\" it's that the knight it's a female character.The development of the story it's boring and predictive, and the end it's in my personal top 3 of worst ends.\\n\r\nArt - 7/10\\n\r\nThis is may be the best part of this anime. The characters are drawn very well, and are easy to remember their appearances. I don't really like the hairdo of Luke and this funny \"armor\" of Cecilly, which seems to be there only to make the viewer lough. The special effects are the best part of the art - lighting, the spells, and my personal favorite - when Luke forges swords.\\n\r\nSound - 6/10\\n\r\nThis is good too. The opening and ending are nice songs, although I wouldn't listen to them (not my music). The seyuus are good too, although they are nothing memorable. Background music it's there, but doesn't make any impression, so it's good.\\n\r\nCharacters - 3/10\\n\r\nCompared to the story characters are good, but in fact they are just stupid and boring. Female knight with big breasts and funny armor, who looks like catches sword for first time in first episode and it's yelling \"mamoru desu\"(I'll protect...) all over, and over, and over again. Male blacksmith, who is kind of bad-ass, but later very emotional and deep character with good feelings. Female demon sword complaining about how bad destiny she have, and how she want's to live peaceful life. Those are the good, and the bad are even worse. Some \"man in black\" who at the end reveals to be kind of absolutely non mysterious guy and kind of well known bad guy. Even the secondary characters are cliche after cliche.\\n\r\nEnjoyment - 4/10\\n\r\nIf this was my first anime, may be I would think it was good, but it's not and everything in it it's well known and I've seen it numerous times before. If it wasn't the good art and the studio I would never end this, and now I kind of regret i did it.\\n\r\nOverall - 5/10\\n\r\nThis is one of the worst animes I ever watched, and the worst thing it's that it's made by Manglobe, studio with animes like Samurai Champloo and Ergo Proxy in it's catalog. Really, don't waste your time with this, just go out and bang your head against some wall... it will be less painful.\\n\\n\r\nPS.\\n\r\nSorry if there are some mistakes, but English it's not my mother language :)",
            "date": "2010-02-12T16:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 23186,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/110087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/soregashi",
                "username": "soregashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=23186"
        },
        {
            "content": "After watching all of these reviews I decided to make my own.\r\nEvery review here says that is the worst anime ever. \r\nThat is not true, I liked this show.\r\nI dont have to see a great epic quest with intergalactic battles with sound from mozart and picasso himself drawing the hole thing, to enjoy it.\r\nWell sure it lacks many part to become a great anime, but still.\r\nIf you just wanna relax, and see a naive cute \"knight\" doing mindless s**t WATCH IT.\r\nDont make hater reviews stop you from seeing a show you might enjoy.",
            "date": "2011-02-09T01:45:00+00:00",
            "helpful_count": 12,
            "mal_id": 34376,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/370328.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/aishiteruu",
                "username": "aishiteruu"
            },
            "url": "https://myanimelist.net/reviews.php?id=34376"
        },
        {
            "content": "Guard, Save, Belive. No, you didn't just misread that. These are in fact the words etched into the stone of Chester Cambell's grave; spelling errors and all. I guess he must've been a little dyslexic. After he passed away from a serious illness, his daughter and only child Cecily was left with the responsibility of becoming head of the Cambell House, which has long been a prestigious representative of the Independent Trade Cities of Housman. Having now succeeded her father, Cecily enlisted as a third generation knight to uphold the tradition and respect of the family name. However, she is inexperienced and clumsy, and oftenhas to rely on intimidation using her title as a knight to hide her weaknesses. Eventually, this strategy ran out of luck, and when her combat skills finally had to be put to the test, Cecily was defeated and her family's precious sword shattered. Now she must seek out the blacksmith Luke Ainsworth to forge her a new sword, which consequently thrusts her into an unexpected chain of events that threatens her life and involves her in a dangerous plot. Between this and the fact that no one can take her seriously because of her huge breasts, it's needless to say that Cecily has plenty of stress on her hands.\\n\\n\r\nYes, you'll find that there's no shortage of fanservice here. In fact, it's pretty much the running gag of the entire series that everyone pokes fun at Cecily's chest. This is further explored by convenient costume malfunctions and shameless bathing scenes. Thankfully all the pandering is at least tasteful enough that it never interrupts the flow of the story. The writing carries enough wit to know when sexual humor is appropriate.\\n\\n\r\nAt a glance, much of Sacred Blacksmith's story is standard procedure for an average fantasy anime. It has all the elements one would expect; knights, magic, demon swords, and giant mythical creatures are abundant. It even comes complete with an angsty tsundere romance. Where the series falls short in originality though, it makes up for this in its near-flawless execution. All of the main characters are rich with distinct personalities and deep backstories that are revealed steadily as the plot unfolds. The story progression also strikes a perfect balance between comedy, drama, and action; constantly keeping the viewer engaged with these three elements while the pacing never stutters or moves too quickly. Even episodes that could potentially be considered filler don't really feel like it, as they serve up plenty of character development to excuse them. Although at its core the plot is fairly familiar and straightforward, Sacred Blacksmith is not without some of its own twists on the genre either. It mixes a strangely light-hearted tone to the story with very dark and mature medieval themes, and while demon swords may sound conventional for the setting, their ability to transform into rather unassuming humans with more nuanced intentions is quite unconventional. Though it may seem like this odd mixture wouldn't blend well at first, the series somehow manages to make it all mesh together nicely.\\n\\n\r\nIt's worth noting that Sacred Blacksmith's narrative is heavily character-centric to such a degree that traditional fantasy tropes one would expect to see in its setting are often absent or take a back seat to character development. This may be off-putting for some coming into it expecting to see a Tolkien-esque expansive epic, which is unfortunate because the series does otherwise tell a very good story for what it is, but it often gets a bad wrap from critics who may be judging it based on something that it was never aiming to be. Sacred Blacksmith takes its time to flesh out its characters and doesn't invest much in the adventurous side of fantasy or exploring its world. Although it's clear that there is still a rich history behind it from the brief glimpses we are occasionally given, nonetheless this is not the story's focus.\\n\\n\r\nThe series' character-driven plot does often work to its advantage though, because where Sacred Blacksmith truly shines is in its ability to masterfully craft a cast of characters whose interactions make them instantly likable and constantly engrossing; never leaving the audience with a dull moment. Cecily's unwavering dedication to helping others is interesting to see being put to the test as her inability to defend others frequently conflicts with her convictions. Aria's mysterious past as the demon sword of wind hides behind the veil of her lovable friendliness, making you eager to find out more about her history and motivations. Even the most seemingly loathsome characters can become hard not to sympathize with as more of their histories and backgrounds are uncovered. It is commonplace that conflicts arise between them purely because of of how sharply contrasting and vibrant their personalities are. Luke's cold and dismissive attitude perpetually clashes with Cecily's stubborn determination, which makes for some particularly entertaining dialogue. The script is often written rather heavy-handed, but it helps establish the strong characterizations of the protagonists. Still, Cecily's melodramatic monologues can occasionally overstay their welcome.\\n\\n\r\nThe production values of Sacred Blacksmith's art and animation are nothing short of superb as well. Character designs are thoroughly detailed depicting even the subtleties of Luke's fake eye, and animation is consistently smooth and fluid. Couple this with its epic orchestral soundtrack and solid voice acting that fits the characters and effectively brings them to life, Sacred Blacksmith satisfies in nearly every aspect of its design. All of this is accompanied with quality intro and ending segments set to some J-pop tunes. The ending in particular has a rather catchy and cute arrangement, which is further enhanced by the associated artwork with it that really shows off the impressive designs of the characters. In fact, it's possibly my personal favorite ending piece just because it's so adorable and the music and visuals play off each other so well. The intro on the other hand has a decidedly more standard song choice that isn't quite as interesting, but it more than makes up for this with a good mixture of action scenes and beautiful perspective shots of the characters. Sufficed to say, this is one of those rare cases where I found myself watching both the intro and ending for every episode because they were simply that enjoyable.\\n\\n\r\nWith everything right that Sacred Blacksmith has going for it however, it's difficult to take notice of any of its major flaws--until it ends. Just as soon as it feels like the journey is only beginning, it is abruptly cut off. This unfortunately is Sacred Blacksmith's greatest shortcoming. By the time the series come to its conclusion, many major plotlines and ambiguities in the story have yet to be fully fleshed out. It's clear judging by the finale that there was still much more of the story to tell, but for one reason or another there appears to be no sequel coming in the foreseeable future. As of the writing of this review, you will need to consort the manga that the series is based on if you wish to delve deeper into its story. Despite this, it's not enough to break Sacred Blacksmith's strong momentum from start to finish. Even with these problems, the anime still manages to deliver as satisfying a resolution as can be reasonably expected while leaving the plot open for continuation. With its colorful cast of characters, high production values, and engaging narrative that has its own twists on the genre, Sacred Blacksmith is sure to entertain many fans of fantasy anime.",
            "date": "2013-01-05T21:12:00+00:00",
            "helpful_count": 11,
            "mal_id": 82816,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1722807.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OmegaSiets",
                "username": "OmegaSiets"
            },
            "url": "https://myanimelist.net/reviews.php?id=82816"
        },
        {
            "content": "I felt compelled to rewrite this review as the previous one I wrote seemed to lack alot of substance.\r\nThis story seems to have taken place in a land resembling 15th century England, France, or some other Western-European country.  From what I watched, I found this anime great in many aspects because of one of the main songs (not themed) that helped create the atmosphere of the simple yet very interesting storyline concerning the Empire's General wanting to recreate a catastrophe to gain dominance using what they call the Devil's Contract.  The devil's contract seemed to use some sort of enchantment to create ademon from a human heart.  The main villain is blamed for the death of the father of the 2nd main character, Luke Ainsworth, resulting in his will to seal away the main antagonist, Valbanill.  The main protagonist is a clumsy knight recruit following her father's footsteps.  She wants to live the glory that her father once lived defending the nation against the onslaught of Valbanill's demonspawn.  As these demons are spawned, so are the weapons of focus -  the demon swords.  There are several demon swords, and few of them even were granted the forms of normal humans who have their own stories, personalities, and ambitions.  What I found odd yet intriguing about this story is the background of Luke Ainsworth's assistant, Lisa.  This story also involves a merging of the knowledge of molded swords and folded swords such as the katana, which is the preferred weapon of Luke.  Luke is the believed Sacred Blacksmith who is ultimately the catalyst of stopping Valbanill's wishes of purging the world in to hell as it was once before purged 44 years before this story takes place.  How you assume Luke is that Sacred Blacksmith is the use of prayer contracts to create powerful elemental (ethereal) katanas only capable of 3 successful slashes.  Some negative aspects of this production involve silly and unnecessary insertions of fan service surrounding the main protagonist, Cecily Campbell.  This production is however shorter than most only planned to span half a season and for it's short-lived airtime I personally felt it was worth watching.  The story being great and all however may be bumped by the slow progression of the first few episodes.  Overall, this anime deserves a 9 overall.  Happy watching to all those interested!!!",
            "date": "2009-12-10T20:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 21263,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/268345.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Onslaught2k3",
                "username": "Onslaught2k3"
            },
            "url": "https://myanimelist.net/reviews.php?id=21263"
        },
        {
            "content": "The Sacred Blacksmith is a decent anime that I really enjoyed; partially due to a load of crap I happen to be watching, and also I had really low expectations of this show. When I heard of that this series is gonna get animated, I went ahead and read a few chapters of the manga and frankly, the story isn't anything impressive. Any many other similar works becomes worse when animated so yeah... that is what I've expected out of this series.\r\nNow, I don't remember the studio Manglobe nor remember if I've watched any series from that studio, but it turns out that Manglobe doesa damn fine job with it. Even if the manga wasn't good material, I'm glad they stuck with the pacing of the story instead of going inventive, which usually sucked. The colours are brilliant and the animation are crisp; and for once, the action scenes are actually pretty good. I don't know how a series like this got that kind of budget but hey, I'm not complaining.\\n\\n\r\nI didn't think much of the story but I really love the characters, even Cecily, who I thought was irritating in the beginning for being really useless, but her really cool action scenes towards the end made up for it. The ending of the story feels like one of those last minute addition to create a finale (I don't know because I didn't get that far in the manga), and though the main villain is a pretty crappy character the ending ain't too shabby.\\n\\n\r\nA fairly nice series to watch if you're a fan of medieval settings, like me.\\n\\n\r\nPlot/Concept: Fairly Good\\n\r\nStory Style: Great!\\n\r\nAudio/Visual: Great!\\n\r\nValue: 7",
            "date": "2010-11-02T09:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 31778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22253.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/du5k",
                "username": "du5k"
            },
            "url": "https://myanimelist.net/reviews.php?id=31778"
        },
        {
            "content": "Overall, the show is not as bad as it seems at start. Yes, it starts off pretty slow and not all that interesting, but around episode 7 it picks up the paste. I was just about to drop this anime last night, until I decided to watch the new episodes. Witch by the way caught me off guard. The story line seems to get more and more interesting as the episodes go on. And NO, its not based on Cecily's breast like the guy above me says. Its pretty good and the fighting scenes are awesome and attract me a lot, and it has potential.Check it out and don't give up on it so quick. \\n\\n",
            "date": "2009-12-16T20:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 21437,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/108705.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JaeTheAnimeGuy",
                "username": "JaeTheAnimeGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=21437"
        },
        {
            "content": "Not going to go into the details, as it will ruin it for you, but wanted to voice my opinion. I really enjoyed watch blacksmith, it is one of the recent animes i have enjoyed watching, as all other new animes are made just to show bras and panties so \"pervs\" would atleast watch them, and that makes their t.v rating go up even though they have no base story, or a really shitty one. But blacksmith isn't one of those animes, it isn't ecchi at all, theres comedy, and a bit of romance, but its mostly an action based-slice of life anime, with considerablestrong story. One of the best things about this anime is that art. It is very colorful, and one of the best \"new\" animations i've seen. In the end its your choice to follow all the negative reviews under mines, or give it a chance. I say GO FOR IT! its awesome!",
            "date": "2009-12-20T12:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 21555,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/deathgame3",
                "username": "deathgame3"
            },
            "url": "https://myanimelist.net/reviews.php?id=21555"
        },
        {
            "content": "When you think of blacksmiths, you think of large, strong men who make swords, horseshoes and other appliances for a medieval world. What you normally don’t see is a kid doing all this with a smaller kid as an apprentice. That’s what happens when you watch this one. \r\nThe characters seem not fleshed out enough, and we barely see a back story to any of them except Luke and even that happens a little to late in the game. By that time, the characters felt a bit stale, and hard to relate to. In a 12 episode show, they shouldn’t be dinking around like theydo, mostly bringing up jokes about Cecily’s breasts and her strange breastplate that seems to be way to close to her to not of been molded on her breasts. And what’s with her mother even bugging her about it? Really? It’s not enough that the whole town talks about her breasts but her mother too? I’m not fond of how this show seems to move a bit too slow this show gets, but once it gets to the point, it is pretty good, and then it ends... Really, they spend more time talking then fighting and nothing really gets said.\\n\\n\r\nIt seems that everything leans up to the climax but many of the things are lost in the first part. For instance, the only time I find out that that Luke has a fake eye is to the second to the last episode. If it was a big thing with the story then it should be said earlier in the story along with Luke’s story. I feel like I only got half the story through the show and I wish there was much more to help me see the lines. It just screams second season to and from what I know of, there isn’t one. \\n\\n\r\nThe artwork is pretty nice though some of the characters look familiar to other shows. Little Luke reminds me of Sora from Kingdom Hearts and I can pick out little things hear and there that felt like rip offs. And don’t get me started on the creepy monsters that attack. It plays out mostly like a monster of the week style though the story makes it hard to watch them out of order. The comical parts in the art seem forced in whenever we have a serious point and trust me, that happen way to much for this show. I wish they chose a side, ether comical artwork with comical plot, or serious artwork with serious plot.\\n\\n\r\nThe voice acting is pretty good but I am a little put off by one or two of them. Lisa isn’t that great a voice, making me sigh at the high pitched sound from her mouth. Some side characters really need deferent voices because sometime it makes them feel way too important then they should be.",
            "date": "2012-08-10T13:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 69347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=69347"
        },
        {
            "content": "I was actually looking forward to Sacred Blacksmith it seemed to have many elements I like in anime. The story centres around Cecily a female Knight who not particularly good at being a Knight. She is saved from certain death one day by Luke (the sacred blacksmith) who has the ability to forge magical Katana swords in the heat of battle. \r\nLets get one thing out of the way first, the English dub is awful. Cecily’s voice grated on me so much I switched straight to subtitles. Most of the voice cast sound like they have just walked off the set of high school musical.Avoid the dub.\\n\\n\r\nThe story itself centres around a town which Cecily protect and the rising demon hordes that are causing trouble around the town. Luke is often called upon to save Cecily as she so inept and then like a sulky teenager disappears back off to his workshop with his apprentice Lisa.\\n\\n\r\nThis is only a short series so you expect it to stick to the main story which centres around the revival of a demon god and how people are entering into demon contracts effectively turning themselves into demons. It doesn’t. Instead we get the ridiculous Charlotte Frobisher story arc as well as an entire episode dedicated to shopping (seriously). We then have supporting characters like Aria who is a demon sword who can also take human form (seriously). This is never fully explained so you just have to go with it.\\n\\n\r\nThe character designs are good but nothing amazing and the battle scenes are pretty average as well. The show also suffers from the –I’m going to do a speech so all fighting stops problem. Enemies also seem happy to let Luke forge his Katana mid battle. \\n\\n\r\nCecily as a character is quite shouty and annoying while Luke spends much of his time sulking and trying to avoid Cecily.  Its only in the last four episodes do we get some character and story progression.  We find out why Luke has a face like a slapped arse and also see Cecily progress from being useless to reasonably competent as a knight.\\n\\n\r\nThe series has some decent ideas like the forging of magical swords but they are poorly executed. The story is not particularly original, couple this with some rather annoying main characters, the series pushes the boundaries of your patience.  There is some mild nudity which seems a bit out of place and the constant referencing of Cecily’s ample chest wears thin after the first episode. The animation quality is fairly fluid and sound is ok with a very cheesy closing song which sticks in your head.\\n\\n\r\nIt’s difficult to recommend Sacred Blacksmith if it wasn’t for the final four episodes this series would have been a total waste of time. The series also doesn’t have a conclusive ending and you feel there is much more of the story left to tell which makes it all the more puzzling why so much time was wasted with side stories at the start of the series. It’s unlikely we will see a second season but based on the first this is no great loss.\\n",
            "date": "2015-03-18T07:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 182611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477713.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Crashmatt",
                "username": "Crashmatt"
            },
            "url": "https://myanimelist.net/reviews.php?id=182611"
        },
        {
            "content": "First of all, I have to say that this anime reminds me of a series that my younger sister used to watch called \"winx club\".\r\nIn the beginning it all looked nice and cool but after two episodes that becomes really bad and more \"slice of life\".\r\nNo action at all, the fights are bad, and most of them are just talking.\r\nThere is no storyline almost at all, I've watched an episode, and another, and another, waiting for something to happen, but it is yet to come.\r\nIt is set in a world where there are demons and magic swords and these, there isn't \"good\" and \"bad\" whofight each other, it's just people who meet the main character and stay for some episodes and then go.\\n\r\nThe main character, Cecily is an annoying person who is weak and always lecture about boring things.\\n\r\nLuke, is boring as well, he doesn't care about anything but his goal.\\n\r\nThere's a major issue in this anime- the nudity which comes out of the blue.\\n\r\nIt looks like the creators had no idea what to do now so let's just put nudity! Her armor got shattered so of course! We'll see her breasts. The girls are ALWAYS talking about boobs and Oh God, why?\\n\r\nIt's pretty much pathetic.\\n\r\nAnother issue is the design of Luke,  he looks like a mashed up potato,  and there's a serious matter about his left eye.\\n\r\nThe soundtrack is just....  bad, I've seen many animes which you can't ignore the soundtrack, but not this one.\\n\\n\r\nBottom line: Not recommended, I gave it 6 because I can't \"admit\" I've seen such a bad anime like this, it can be for little girls who don't care to see some nudity.",
            "date": "2015-05-14T05:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 187809,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262007.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/dadnaya",
                "username": "dadnaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=187809"
        },
        {
            "content": "When I started on this anime, I kind of regretted watching it because I felt bored at the first episode, but, since I've been looking for an anime that has a strong male character, I decided to watch on and I'm glad I did.\r\nStory - The story is very poor or rather, like most animes, rushed. The series is more about the main character's daily life and interaction with other characters of the series rather than the main character itself. They focused too much on the main characters that the story was neglected and at the end, it was rushed to complete the series. Ifthere were just one more episode, I believe that the anime could've ended on a nicer note.\\n\\n\r\nArt - Like most of the anime that are currently being released, character designs and animations for them are pretty good. I particularly liked the designs of the houses like they were in medival times. Other than that, nothing much to say here.\\n\\n\r\nSound - The only music worth mentioning is the opening and ending songs. Other than that, I have no impression of any noticable music really. Which is also one of the main flaws of the series. Although fights need not necessarily require music, it does add to the flavour and feel of the situation at hand.\\n\\n\r\nCharacter - Character development is fantastic. The main character does grow over time and slowly gets people to acknowledge her, though of course it's not like she was ostracized, bullied or looked down upon by the community in the first place, just that she wants to prove a point and she did. The only flaw is that we don't get to actually see the character become strong since everything was rather rushed towards the end.\\n\\n\r\nEnjoyment/Overall - Aside from the flaws I mentioned,  I rather enjoyed this series and I do hope that a season 2 will be made. I think that the series will do very well in season 2 should there be one.",
            "date": "2010-12-11T07:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 32658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kireas",
                "username": "Kireas"
            },
            "url": "https://myanimelist.net/reviews.php?id=32658"
        },
        {
            "content": "I watched this anime because I saw it on netflix, I was bored, and the cover caught my eye. Thus, I went into this series not only unaware of what it was, but with no expectations either way. \r\nAs I said, though, I watched the first episode on Netflix (which has only dubbed anime) and enjoyed it well enough; I liked the character designs, the voice acting was alright for a dub (except Lisa whom I wanted to throttle after 3 lines) and it seemed like it could develop into a decent story, so I decided to continue. However, fate intervened, and I was unableto get to netflix the next time I wanted to watch, so I looked it up online and found the original--and OH GEEZ was it good comparatively. Especially the voice acting:\\n\\n\r\nSound: 10 AMAZING\\n\\n\r\nWhen the obnoxious girl from the English dub was replaced by Toyosaki Aki going to the original after one episode, I nearly exploded with joy (she is my personal favorite Japanese voice actress). Besides that, Luke was now voiced by Okamoto, Nobuhiko (whom I recognized, having just finished watching To aru Majutsu no Index). So I will not deny that my love for the voicing and music are indeed partially due to the sub-par dub counterparts I was originally exposed to. Even so, the voice acting is incredibly strong in this series, from the entire cast. The theme song took a few episodes to grow on me, but it certainly did, and it is now one of my favorite anime themes. Toyosaki Aki singing the ending theme won me over after the first 3 lines.\\n\\n\r\nStory: 7 Good\\n\\n\r\nThe story does fall into a few stereotypes and uses a few stock characters, but they're not too distracting and the rest of the story has some interesting ideas to it. The idea of the object/not-quite human character struggling with questions of their existence is nothing new (Data from star trek, even Hatsune Miku in the song \"The Disappearance of Hatsune Miku\" explore similar issues) but the story offers enough of a twist on this admittedly cliche but interesting plot point to make it acceptable. \\n\\n\r\nArt: 7 Good\\n\\n\r\nNot too much to say here, the art wasn't super amazing but it was by no means bad, and each of the characters were distinct and memorable.\\n\\n\r\nCharacter: 9 Great\\n\\n\r\nThis mixes with what I said about the story--which is partly because most of the story is exploring the characters and their pasts. All of the protagonists, and even some of the minor characters, are developed surprisingly well and enjoyably, especially Lisa. (I won't go into detail there to avoid spoilers)\\n\\n\r\nEnjoyment: 8 Very Good\\n\\n\r\nThis would have been a 9. It was almost a 10 actually, until the end. I won't give away WHY but the ending was....infuriating. I found out why later--the series, like many anime, is based off a light novel series, and of course the anime finished before the books did, and so the anime writers had to slap together an ending. There are some times where this is successful, at least to a point, but this NOT one of them. Little is resolved, the final battle is frankly STUPID and the ending left me sitting there saying \"what, THAT''S HOW IT ENDS?!?!?!\" I still enjoyed the rest of the series, but such an awful ending could not let me leave it with a perfect score.\\n\\n\r\nOverall: 7 \\n\\n\r\nDespite the atrocious ending, this anime is still more than worthwhile I think. I thoroughly enjoyed following the growth of the characters, and as I said, the amazing voice acting. Though there is little hope, as this wasn't the most popular anime, I do wish they would make another season to give it a respectable ending, but nonetheless I do not regret seeing this anime, and still would recommend it to anyone.\\n",
            "date": "2012-04-02T21:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 57757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1032547.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eriias",
                "username": "Eriias"
            },
            "url": "https://myanimelist.net/reviews.php?id=57757"
        },
        {
            "content": "There is so much wrong with this series it is hard to remember it all.  From reading the short description on Netflix I concluded that this would be an adventurous series with the possibility of a good plot.  I was wrong…very wrong.  I’m going to try to tell you why NOT to watch this series and keep it short at the same time.\r\nI am not sure what the plot is or if it ever existed at all.  The plot is supposed to be continuous from episode to episode but, it is impossible to tell how the plot reached the current pointfrom the previous.  It seems like somebody wrote a series of short random events modified and arranged them into a short story board putting forth as little effort as possible.\\n\\n\r\nCharacter development is a far more serious problem than the plot itself.  Characters make leaps and bounds forwards in one episode then might regress twice as fast back in the following episode.  Or you wonder where the characters came to a certain conclusion and can only conclude that it was in between the episodes when there was a massive plot jump.  This makes it even harder to understand or relate to the main character.  The character all seem to be drawn the same as well and then modified.  Copy and paste is not working in their favor.  (I was wondering if this was just me but then I saw it in somebody else’s review as well.)\\n\\n\r\nTheme; tits.  I’m sure this is the theme…every episode seems to finish off talking about Cecily Cambell’s breast size.  One episode has entire dinner scene talking about Cecily’s boobs… as well as a pool scene and many others.  Boobs are actually shown in this series which does nothing to enhance the show.  It is a poor and failure of an attempt at comic relief.\\n\\n\r\nDialogue is horrible and when it is not horrible it is so absurdly cheese it is intolerable.  Music enhances anything and everything that is cheesy and is vastly overused.  The animations are possibly the only redeeming fact about Seiken no Blacksmith.  \\n\\n\r\nIf you still want to watch this series after reading this review be my guest, but I do not recommend a 4/10 rated series to anybody.  Somebody wanted to make some fast easy cash off developing this series and, therefore put no real time into it.  \\n",
            "date": "2011-06-20T22:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 38104,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/492110.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/bcornett24",
                "username": "bcornett24"
            },
            "url": "https://myanimelist.net/reviews.php?id=38104"
        },
        {
            "content": "This is a review of the DVD version of \"Sacred Blacksmith\" (Seiken no Blacksmith) released by Funimation in 2011. It was viewed with English voice overs.\r\n\"Sacred Blacksmith\" falls into the category of fantasy action adventure with some minor elements of comedy.\r\nParental Advisory:\r\nThe age rating is listed as 17+.  However, this is absurdly high - the show's content does not merit this high of an age rating.   Two or three of the episodes include some very brief scenes with female topless nudity.  There is combat violence in several episodes, but it isn't overly graphic.   As a result, this show wouldlikely be suitable for teens 13 and up.\\n\\n\r\nStory: 7/10\\n\r\nThe show is comprised of 12 episodes.  During the episodes, several characters are introduced including the main protagonist Cecily, the blacksmith Luke, his assistant Lisa, and a few others from the city.  Along the way, the world's history is revealed bit by bit.  Without giving away too many spoilers, there was a previous war involving a demon and the repercussions of that are still being felt.  Some of the main characters are directly related to the events of that war.\\n\\n\r\nMuch of it is fairly typical for a fantasy story, but there were a few interesting elements introduced related to the blacksmith and how he is able to magically craft weapons with his assistant.  Some of the ultra-powerful demon swords can also take human form which is explored in a few episodes, but is never fully explained.\\n\\n\r\nNear the middle of the series, a new set of characters are introduced almost out of the blue.  At one moment they a supposed to enemies, and then suddenly they are allies, and the sudden shift doesn't make much sense.  A few episodes later, they are whisked away.  The few plot developments and pieces of information that are introduced by these characters could have easily been provided in other ways, and leaving these characters out of the series entirely would have led to a stronger series, and provided more time to focus on some of the other characters.\\n\\n\r\nThe series ends on a cliffhanger, which seems to indicate that a 2nd series was planned.  However, I have found information about this, or when it might be released.\\n\\n\r\nCharacters: 5/10\\n\r\nVisually, many of characters in \"Sacred Blacksmith\" are more normal in size and appearance compared to those in other modern anime titles.  Most of the females are especially demure, and the males aren't overly muscular.\\n\\n\r\nThe main character, Cecily Cambell is an overly inept knight.  She is a very weak character to serve as the main protagonist, and this is a drag throughout the entire show.  Through the series, some other characters make jokes the size of her bosom, but these fail to be humorous, partly because her breasts aren't really that big, at least not compared to characters in other modern anime.  Her breasts are shown briefly in a couple of episodes in an apparent attempt at humor, but the scenes barely register on the funniness meter, and could have been left out.\\n\\n\r\nLuke, the blacksmith, and his assistant, Lisa, are more intriguing characters.  Some of the key plot developments relate to these characters.  I would have liked to have seen them involved in more scenes instead of Cecily.\\n\\n\r\nThe main antagonist seems overly cliché.  He's presented as a mysterious figure in a black cloak, before his real identity is uncovered.  However, it was really obvious from the beginning who it was for those paying attention.  The lack of originality of this character is a bit of let-down, as are his motives.\\n\\n\r\nOther characters are introduced such as guards and key members of the city government, but they don't get much screen time.  Rounding out the characters are a couple of living weapons one of which gets a fair bit of screen time, but not enough to fully explain their background.\\n\\n\r\nArt / Animation: 7/10\\n\r\nThe animation in \"Sacred Blacksmith\" was good overall, but not spectacular.  It seemed to use a lot of recycled art through the series.  For example, scenes of the city show an ominous, yet never-changing volcano apparently spewing a large ash cloud over the city.  This erupting volcano is never mentioned or explained.  I liked the blacksmith's magic weapon forging scene, but that too was essentially recycled a few times with few or no changes in later episodes.\\n\\n\r\nSome of the character designs are a bit basic but nice, and thankfully they were not as over-the-top as some characters found in other modern anime.  The outfits evoked a fantasy atmosphere, and their style had a simple elegance.  I found Aria's outfit to be quite lovely and rather fitting for her wind-nature.\\n\\n\r\nA few of the combat scenes were enjoyable to watch, and they seemed to capture elements of the action rather well.\\n\\n\r\nSound / Voice: 7/10\\n\r\nThe soundtrack and background music used an orchestral piece which was quite good.  Other sound effects, such as during the combat scenes, were fine.  The English voice acting seemed ok.\\n\\n\r\nEnjoyment: 4/10\\n\r\nWhile I enjoyed parts of this show, it really wasn't that enjoyable to watch it.  At times, it seemed like the story could be quite good, and it had the potential to set things up for a serious fantasy adventure, but then it would shift gears and try to inject comedic elements that didn't really work.  A big part of that problem is due to the main character Cecily - her ineptness more or less forces her to be used as comedy relief for many of her scenes.  It's like trying to inject a character from “Slayers” into “Record of Lodoss War” - the results are predictably bad.\\n\\n\r\nFinal Verdict: 6/10 \\n\r\nI really wanted to like this show.  It had a cool fantasy setting with a very interesting backstory, some enjoyable combat scenes, and a few characters that were intriguing like the blacksmith.  However, the unimaginative villain, the sudden introduction of extra characters, and the focus on Cecily end up derailing this story, never allowing it to climb out of mediocrity.\\n",
            "date": "2016-01-07T09:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 207968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2534445.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kalendraf",
                "username": "Kalendraf"
            },
            "url": "https://myanimelist.net/reviews.php?id=207968"
        }
    ],
    [
        {
            "content": "What it's really about:\r\nA big-chested clumsy knight gets involved with a demon problem, as well as handsome blacksmith and his mysterious past.\r\nThe Good:\r\n- Excellent production value\r\n- The relationship between the blacksmith and the knight is cute\r\n- The episodes that don't directly further the plot are still very interesting\r\n- The setting has an intriguing history\r\nThe Bad:\r\n- The knight can be viewed by many as \"annoying.\"\r\n- Those expecting a Lord of the Rings experience will be sorely disappointed.\r\nConclusion:\r\nI think the reason this anime got so many below average reviews is because of the reviewers' preconceptions of what the anime should have been.  If you can manageto dispel any preconceived notions you have about this anime, then you're in for a very nice treat.  Just enjoy it for what it is.",
            "date": "2009-12-20T21:57:00+00:00",
            "helpful_count": 249,
            "mal_id": 21571,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/bjtdevera",
                "username": "bjtdevera"
            },
            "url": "https://myanimelist.net/reviews.php?id=21571"
        },
        {
            "content": "I find this anime pretty interesting, it's rare to find animes where the main protagonist is not almost an \"all-mighty-god\" who kicks everyone's butt in less than a second, this makes the anime more interesting to me due to the fact that I want to see that character's progression.",
            "date": "2009-11-18T00:11:00+00:00",
            "helpful_count": 127,
            "mal_id": 20650,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kyousho",
                "username": "Kyousho"
            },
            "url": "https://myanimelist.net/reviews.php?id=20650"
        },
        {
            "content": "This is a very laughably bad show.  Probably the most enjoyment I get from this show is pointing out everything that is just outright terrible about it. The production looks alright, with decent enough music, sounds, and artwork, but after that the quality of everything else goes down the drain.\r\nFor starters, the main character is simply awful.  Cecily Campbell is perhaps one of the weakest protagonists I have ever seen in anime.  She's clumsy and useless at doing anything without the help of other characters, and largely demonstrates very weak initiative throughout series as up til now.\r\nThe show largely focuses on sexjokes to inspire comedy value.  These often involve Cecily being sexually harassed or victimized through various means. Not only does this not make the protagonist look any better, it's very stupid and overdone to the point of becoming stale.\\n\\n\r\nThe plot for the large part does not show any more hope either. Very little is done to develop character relationships aside from the multitude of sex jokes, and what little that may resemble a backstory or plot development is often overshadowed by the huge amount of fanservice that is stuffed into this show.\\n\\n\r\nFight scenes in this show are pretty unspectacular, largely due to Cecily looking extremely incompetent and clumsy during most of them. Luke Ainsworth, one of the supporting characters admittedly does get some cool points for apparently being the so-called Sacred Blacksmith, and an expert swordsman to go with that. The same pattern of him constantly rescuing Cecily from her periods of sucking in combat is pretty darn lame however, not to mention Cecily's reliance on a Demon Sword rather than her own powers to be able to do anything in combat.\\n\\n\r\nAs I've stated, the only reason why I even bother watching this show is just to make fun of how awful it is. If for some reason you can overlook the fact the main character sucks (probably literally too, but this isn't an adult rated anime), and you don't get tired of constant jokes about how Cecily's breasts are huge, you might find something worthwhile in this show.  It's only twelve episodes anyway, which isn't too unreasonable to endure.",
            "date": "2009-11-15T23:20:00+00:00",
            "helpful_count": 98,
            "mal_id": 20593,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=20593"
        },
        {
            "content": "The Sacred Blacksmith is a really mixed bag.  This could have been good, with the underlying story being highly interesting.  The whole excecution of the story is unfortunately, horrific.\r\nThe flaws in the storyline mainly lie with the protagonist.  Cecily as the main lead has shown growth but this is unfortunately obscured by her annoying personality.  The way her \"talk\" sequences were done was extremely off-putting, and her jarring voice made things even worse.  This links to the lack of a logical flow to the storyline whenever it involves Cecily.  One evening, she's in a life-threatening battle, the next dayshe's smiling at her potential killers (twice...same people, same arc!).  Another example is excessive, irrelevant chatter during battles.  It's as if her speaking has a \"freeze\" effect on the enemy (yea right!).\\n\\n\r\nThe supporting main characters, Luke, Lisa and Aria were highly pleasurable and fun, each having rather interesting backstories as well as a good source of laughter.  They fulfill their respective roles excellently.\\n\\n\r\nThe art was average-good, with the use of an eye-pleasing palette.  Afterall, I started watching after seeing the nice art at the Animesuki season preview.  The girls were either cute or hot, depending on age!  The monsters looked ugly but aren't monsters supposed to be ugly anyway?  The animation sequences during battles were very well done.  It's a shame the battles had to be rushed in a short, 12-episode series.\\n\\n\r\nThe BGM is very good and it is a pity because of the lacklustre storytelling.  This situation is reminicent of Tsubasa Chronicles season 1 where the music was awesome, but too lively for a poorly executed and slow story.  The OP seems to have split people but I felt the beat and tone was a good fit.  The ED is just awfully cute, and expresses Lisa as a character very well.\\n\\n\r\nOverall, I enjoyed the story because it had such potential, as well as the interesting and likeable supporting characters which kept me watching this rather mediocre series.  That said, the lack of logical flow *points at Cecily* is a serious killjoy.  People have asked me what I was watching during Autumn 2009.  While I gave an honest answer (SnB was the only show I was following!), I have told every one of them to avoid.",
            "date": "2009-12-20T15:44:00+00:00",
            "helpful_count": 74,
            "mal_id": 21558,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/91327.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/X10A_Freedom",
                "username": "X10A_Freedom"
            },
            "url": "https://myanimelist.net/reviews.php?id=21558"
        },
        {
            "content": "Fantasy is all about adventure. It’s about going outside of your comfort zone, seeing a new place and a new facet of yourself, and being changed by the time you return home. Anime like that is filled with believable cause and effect. And then there’s The Sacred Blacksmith.\r\nThe series opens with Cecily Cambell, a newly trained knight charged with the protection of the Third Independent Trade City. She is an excitable girl, stubborn, and full of bravado. She wishes to help people, but has little actual competence. The broken sword of her family is as much a symbol of her own need to be temperedas anything. Towards those ends she pursues the services of Luke Ainsworth, a standoffish blacksmith with little patience for Cecily’s immaturity. Joining them are Lisa -- Luke’s pint-sized and spunky assistant -- and a woman with a mysterious and tragic past named Aria. \\n\\n\r\nDark events soon push them together as tenuous companions. Some figure in the shadows is collecting Demon Swords, powerful remnants from the great war that ended forty years ago. The City is threatened and Cecily and Luke have their own reasons to stand against it.\\n\\n\r\nThe setting and plot sound clichéd because they are. This is well-trodden ground. The first few episodes promise to offset that imbalance with the characters, but sadly that’s where things start falling apart.  As our protagonists quickly find themselves thrown headlong into one problem after another, their relationships become secondary. Instead of friendships blossoming from shared duress, they just seem to ‘bond’ because they shared the same scenes.\\n\\n\r\nPart of the problem is in Cecily’s characterization, which puts light on the deeper issue of Sacred Blacksmith’s incorrect focus.\\n\\n\r\nTwo of my favorite moments are when Cecily realizes that her desires and willpower are not enough to become the best she can be and then, later, when she uses that deficiency to overcome a seemingly insurmountable object. That was when the story shined and I thought “yes! -this- is what this show is supposed to be.” Cecily is our protagonist in all her inept glory. Watching her stumble towards being a skilled knight is where the show -should- be focused, how each tiny victory and tiny defeat magnifies her growth.\\n\\n\r\nAdmittedly, there are times when Cecily sheds her armor and shows some vulnerabilities in a realistic light, but usually she merely sheds her armor so someone can joke about how wonderfully large her breasts are. I like running gags as much as anyone, but Sacred Blacksmith never really earns the right to do so. They would be complementary features in a series less problem-ridden; instead they merely draw attention to themselves and make it difficult for a reviewer to be objective and not single them out for one whole paragraph. It gets to be a little bothersome when they just pop up out of nowhere. \\n\\n\r\nAnd, no, that wasn’t a boob joke.\\n\\n\r\nIt isn’t that the foundation here is weak, but that it’s uneven. There are some really exciting and insightful moments and yet they are surrounded by plodding uninteresting plot and cloying melodrama. It sometimes feels like a writer du jour was invited on board each week to pen the script. The story is disjointed, populated with mini-arcs that hardly elucidate the main arc at all. Challenges seem incidental. Character development unearned. And then everyone dresses up like a maid.\\n\\n\r\nIf that last sentence seemed to come out of nowhere and confused the hell out of you, it was supposed to. That’s exactly how I felt.\\n\\n\r\nThe most irksome problem is pacing. The main story arc only gets underway late in the series, ending up rushed. Halfway through the series our cast of characters effectively doubles, but we have no time to get to know them beyond their two-dimensionally flat personalities. Worst of all, two battles are halted in their tracks while our heroes take a break to lollygag. Oh, I mean, “work slowly at making a weapon to continue the fight after all the scene’s original tension has been obliterated”. It felt more concise to say lollygag, though.\\n\\n\r\nAside from that specific editing choice, the battles are actually engaging. In fact, my greatest praise is what weaponry gets used. For all the adherence to the conventions of the swords-and-sorcery genre, there are some uncommon armaments here. I can’t describe enough how visually refreshing I found this, to see different weapons and fighting styles. Like all the other good bits in the show this too doesn’t last long, but it helps break up the “This is a fantasy; we need more swords!” mentality that plagues the genre.\\n\\n\r\nOverall, the art and animation is of consistently high quality. The city is a vibrant place. Manglobe’s attention to detail in creating a living, breathing setting is laudable and effective (something I personally found lacking in their earlier work, Ergo Proxy). There’s an idyllic peace in the city when all hell isn’t breaking loose and a gritty immediacy when it does. That the city is built at the foot of a mountain covered with an ominous and never-moving cloud is a fantastic addition. The characters too are well-designed and have outfits that are intriguing albeit sometimes impractical. If only they were as cool as they look.\\n\\n\r\nI couldn’t help thinking back to last season as I watched this. CANAAN showed how to put together a compelling ensemble cast, while Spice and Wolf II showed how to dramatically weave the complexities of a relationship about two protagonists. Both lessons are lost on Sacred Blacksmith. There is neither a group dynamic nor a fully realized pairing. The one great friendship we do have between Cecily and Aria gets lost in the shuffle of events and hardly has the emphasis it deserves.\\n\\n\r\nWhat disappoints me most is what Sacred Blacksmith fails to do. It fails to do anything exciting with fantasy. It fails to test its characters’ resolve with any meaningful challenges or anguish. It presents so much magic… yet fails to capture any wonder. Once we understand more of Aria’s nature, for instance, a wild world of possibilities opens up. How does her nature impact the way she interacts with the city she lives in? The people she calls friends? Her own inner turmoil? Instead, her character development seems to have the same tedious trajectory that everyone else has: at least one episode devoted to mental struggles, a resolution easily attained, and a sanguine outlook the rest of the time.\\n\\n\r\nThe music is a good analogy for the show as a whole. The OP starts strong, is rather catchy, reasonably dynamic technically speaking. The score of the series is standard fare medieval fantasy (recorders, lutes, tambourines, and the like) and other more traditional orchestrated pieces that are apt, but not spellbinding. Finally, the ED is the most randomly bright and unbelievably saccharine thing you have ever heard. While I freely admit my personality isn’t morning glories and sunshine, this outro is so distinctly misplaced and just one more example of Sacred Blacksmith’s disjointed elements.\\n\\n\r\nSo who is this anime for? More forgiving viewers, I imagine. The series isn’t high art and let’s face it: it’s not trying to be. It doesn’t want to be a humble, little fantastical tale, but a brief little epic about a lot of different things. About companions trying to help each other, faltering romance, sociopolitical intrigue, freaky monsters, black villains, sleeping horrors. By including too much its scattershot attention span shows, but if you can overlook that and the other systemic problems, want a light-hearted romp with a peppering of drama, or happen to be a fantasy junkie, you might have fun with this.\\n\\n\r\nIf there is a second season I can only hope they strip away the extraneous parts, peel back the deeper layers, and leave what remains proudly exposed and naked for all to behold.\\n\\n\r\nAnd, yeah, that was kind of a boob joke.",
            "date": "2009-12-19T20:47:00+00:00",
            "helpful_count": 28,
            "mal_id": 21540,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/197495.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Spookt",
                "username": "Spookt"
            },
            "url": "https://myanimelist.net/reviews.php?id=21540"
        },
        {
            "content": "First thing is what I think of this anime on a whole. Your first impressions are this is going to be a big disappointment. Sure! it may not be the best but it's enjoyable. There wasn't any surprises, nothing new but it was enjoyable. Don't judge it by the first episode. It really gets better.\r\nStory(6-fair)\r\nCecily Cambell becomes a knight and she is totally useless. She's all talk. She is saved by Luke Ainsworth and begs him to make a katana like his. And so their relationship begins. The story was like a Déjà vu (literally!!) But it shines! It makes you laugh, sometimes cry andfeel the feelings of the characters in the story. It wasn't repetitive nor boring. Sometimes the fillers and disappointing. There is only one filler episode but in each episode there is a part that has nothing to do with the actual plot. Either it is at the beginning or the end. Even so, it's no boring or unbearable.\\n\\n\r\nArt(7-good)\\n\r\nthe art was exactly like K-ON's sometimes I thought Cecily looked like Yui just in a red version(LOL). I'm very picky about my art. It has to be up-to-date and such. But the animation flaws my eyes just don't see I don't know if there aren't or if there are. But the fights, when the swords are swung and the colors it's really catchy.\\n\\n\r\nSound(4-Decent)\\n\r\nThe theme song matched the anime but it wasn't special in particular. The ending son was very catchy. Also, the background music, which sometimes I don't notice is good and it goes with the whole flow of the anime and it's set date.\\n\\n\r\nCharacter(10-Outstanding)\\n\r\nI liked Cecily's character. She's useless but she understands others feeling and her feelings are genuine. She isn't one of those big mouth girls who cant do anything or the crappy type of girl she's a strong willed character that I like.\\n\r\nNot only Cecily but all the character's have their share in the spot light, their time to shine. You can feel the feelings of all the main characters.\\n\\n\r\nEnjoyment(7-Good)\\n\r\nAs I said it is really enjoyable even without much action.\\n\\n\r\nOverall(7-Good)\\n\r\nJust watch the anime!!!\\n",
            "date": "2010-05-28T09:16:00+00:00",
            "helpful_count": 27,
            "mal_id": 26525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/305532.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lali97",
                "username": "lali97"
            },
            "url": "https://myanimelist.net/reviews.php?id=26525"
        },
        {
            "content": "Seiken no Blacksmith is anime that sounds very good when you look the descriptions. It says that there will be an adventure, but doesn't says that the adventure will be so boring.\r\nStory - 3/10\r\nFantasy world with demons, demon swords and some mysterious people. Sounds very nice, but the way that the story develops it's everything but nice. The demons are the usual, the sword too, not to mention the main antagonist - \"the man in black\"... and this is not the worst. The main characters are also the usual strong boy and weak knight, the only \"new\" it's that the knight it's a female character.The development of the story it's boring and predictive, and the end it's in my personal top 3 of worst ends.\\n\r\nArt - 7/10\\n\r\nThis is may be the best part of this anime. The characters are drawn very well, and are easy to remember their appearances. I don't really like the hairdo of Luke and this funny \"armor\" of Cecilly, which seems to be there only to make the viewer lough. The special effects are the best part of the art - lighting, the spells, and my personal favorite - when Luke forges swords.\\n\r\nSound - 6/10\\n\r\nThis is good too. The opening and ending are nice songs, although I wouldn't listen to them (not my music). The seyuus are good too, although they are nothing memorable. Background music it's there, but doesn't make any impression, so it's good.\\n\r\nCharacters - 3/10\\n\r\nCompared to the story characters are good, but in fact they are just stupid and boring. Female knight with big breasts and funny armor, who looks like catches sword for first time in first episode and it's yelling \"mamoru desu\"(I'll protect...) all over, and over, and over again. Male blacksmith, who is kind of bad-ass, but later very emotional and deep character with good feelings. Female demon sword complaining about how bad destiny she have, and how she want's to live peaceful life. Those are the good, and the bad are even worse. Some \"man in black\" who at the end reveals to be kind of absolutely non mysterious guy and kind of well known bad guy. Even the secondary characters are cliche after cliche.\\n\r\nEnjoyment - 4/10\\n\r\nIf this was my first anime, may be I would think it was good, but it's not and everything in it it's well known and I've seen it numerous times before. If it wasn't the good art and the studio I would never end this, and now I kind of regret i did it.\\n\r\nOverall - 5/10\\n\r\nThis is one of the worst animes I ever watched, and the worst thing it's that it's made by Manglobe, studio with animes like Samurai Champloo and Ergo Proxy in it's catalog. Really, don't waste your time with this, just go out and bang your head against some wall... it will be less painful.\\n\\n\r\nPS.\\n\r\nSorry if there are some mistakes, but English it's not my mother language :)",
            "date": "2010-02-12T16:37:00+00:00",
            "helpful_count": 17,
            "mal_id": 23186,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/110087.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/soregashi",
                "username": "soregashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=23186"
        },
        {
            "content": "After watching all of these reviews I decided to make my own.\r\nEvery review here says that is the worst anime ever. \r\nThat is not true, I liked this show.\r\nI dont have to see a great epic quest with intergalactic battles with sound from mozart and picasso himself drawing the hole thing, to enjoy it.\r\nWell sure it lacks many part to become a great anime, but still.\r\nIf you just wanna relax, and see a naive cute \"knight\" doing mindless s**t WATCH IT.\r\nDont make hater reviews stop you from seeing a show you might enjoy.",
            "date": "2011-02-09T01:45:00+00:00",
            "helpful_count": 12,
            "mal_id": 34376,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/370328.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/aishiteruu",
                "username": "aishiteruu"
            },
            "url": "https://myanimelist.net/reviews.php?id=34376"
        },
        {
            "content": "Guard, Save, Belive. No, you didn't just misread that. These are in fact the words etched into the stone of Chester Cambell's grave; spelling errors and all. I guess he must've been a little dyslexic. After he passed away from a serious illness, his daughter and only child Cecily was left with the responsibility of becoming head of the Cambell House, which has long been a prestigious representative of the Independent Trade Cities of Housman. Having now succeeded her father, Cecily enlisted as a third generation knight to uphold the tradition and respect of the family name. However, she is inexperienced and clumsy, and oftenhas to rely on intimidation using her title as a knight to hide her weaknesses. Eventually, this strategy ran out of luck, and when her combat skills finally had to be put to the test, Cecily was defeated and her family's precious sword shattered. Now she must seek out the blacksmith Luke Ainsworth to forge her a new sword, which consequently thrusts her into an unexpected chain of events that threatens her life and involves her in a dangerous plot. Between this and the fact that no one can take her seriously because of her huge breasts, it's needless to say that Cecily has plenty of stress on her hands.\\n\\n\r\nYes, you'll find that there's no shortage of fanservice here. In fact, it's pretty much the running gag of the entire series that everyone pokes fun at Cecily's chest. This is further explored by convenient costume malfunctions and shameless bathing scenes. Thankfully all the pandering is at least tasteful enough that it never interrupts the flow of the story. The writing carries enough wit to know when sexual humor is appropriate.\\n\\n\r\nAt a glance, much of Sacred Blacksmith's story is standard procedure for an average fantasy anime. It has all the elements one would expect; knights, magic, demon swords, and giant mythical creatures are abundant. It even comes complete with an angsty tsundere romance. Where the series falls short in originality though, it makes up for this in its near-flawless execution. All of the main characters are rich with distinct personalities and deep backstories that are revealed steadily as the plot unfolds. The story progression also strikes a perfect balance between comedy, drama, and action; constantly keeping the viewer engaged with these three elements while the pacing never stutters or moves too quickly. Even episodes that could potentially be considered filler don't really feel like it, as they serve up plenty of character development to excuse them. Although at its core the plot is fairly familiar and straightforward, Sacred Blacksmith is not without some of its own twists on the genre either. It mixes a strangely light-hearted tone to the story with very dark and mature medieval themes, and while demon swords may sound conventional for the setting, their ability to transform into rather unassuming humans with more nuanced intentions is quite unconventional. Though it may seem like this odd mixture wouldn't blend well at first, the series somehow manages to make it all mesh together nicely.\\n\\n\r\nIt's worth noting that Sacred Blacksmith's narrative is heavily character-centric to such a degree that traditional fantasy tropes one would expect to see in its setting are often absent or take a back seat to character development. This may be off-putting for some coming into it expecting to see a Tolkien-esque expansive epic, which is unfortunate because the series does otherwise tell a very good story for what it is, but it often gets a bad wrap from critics who may be judging it based on something that it was never aiming to be. Sacred Blacksmith takes its time to flesh out its characters and doesn't invest much in the adventurous side of fantasy or exploring its world. Although it's clear that there is still a rich history behind it from the brief glimpses we are occasionally given, nonetheless this is not the story's focus.\\n\\n\r\nThe series' character-driven plot does often work to its advantage though, because where Sacred Blacksmith truly shines is in its ability to masterfully craft a cast of characters whose interactions make them instantly likable and constantly engrossing; never leaving the audience with a dull moment. Cecily's unwavering dedication to helping others is interesting to see being put to the test as her inability to defend others frequently conflicts with her convictions. Aria's mysterious past as the demon sword of wind hides behind the veil of her lovable friendliness, making you eager to find out more about her history and motivations. Even the most seemingly loathsome characters can become hard not to sympathize with as more of their histories and backgrounds are uncovered. It is commonplace that conflicts arise between them purely because of of how sharply contrasting and vibrant their personalities are. Luke's cold and dismissive attitude perpetually clashes with Cecily's stubborn determination, which makes for some particularly entertaining dialogue. The script is often written rather heavy-handed, but it helps establish the strong characterizations of the protagonists. Still, Cecily's melodramatic monologues can occasionally overstay their welcome.\\n\\n\r\nThe production values of Sacred Blacksmith's art and animation are nothing short of superb as well. Character designs are thoroughly detailed depicting even the subtleties of Luke's fake eye, and animation is consistently smooth and fluid. Couple this with its epic orchestral soundtrack and solid voice acting that fits the characters and effectively brings them to life, Sacred Blacksmith satisfies in nearly every aspect of its design. All of this is accompanied with quality intro and ending segments set to some J-pop tunes. The ending in particular has a rather catchy and cute arrangement, which is further enhanced by the associated artwork with it that really shows off the impressive designs of the characters. In fact, it's possibly my personal favorite ending piece just because it's so adorable and the music and visuals play off each other so well. The intro on the other hand has a decidedly more standard song choice that isn't quite as interesting, but it more than makes up for this with a good mixture of action scenes and beautiful perspective shots of the characters. Sufficed to say, this is one of those rare cases where I found myself watching both the intro and ending for every episode because they were simply that enjoyable.\\n\\n\r\nWith everything right that Sacred Blacksmith has going for it however, it's difficult to take notice of any of its major flaws--until it ends. Just as soon as it feels like the journey is only beginning, it is abruptly cut off. This unfortunately is Sacred Blacksmith's greatest shortcoming. By the time the series come to its conclusion, many major plotlines and ambiguities in the story have yet to be fully fleshed out. It's clear judging by the finale that there was still much more of the story to tell, but for one reason or another there appears to be no sequel coming in the foreseeable future. As of the writing of this review, you will need to consort the manga that the series is based on if you wish to delve deeper into its story. Despite this, it's not enough to break Sacred Blacksmith's strong momentum from start to finish. Even with these problems, the anime still manages to deliver as satisfying a resolution as can be reasonably expected while leaving the plot open for continuation. With its colorful cast of characters, high production values, and engaging narrative that has its own twists on the genre, Sacred Blacksmith is sure to entertain many fans of fantasy anime.",
            "date": "2013-01-05T21:12:00+00:00",
            "helpful_count": 11,
            "mal_id": 82816,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1722807.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OmegaSiets",
                "username": "OmegaSiets"
            },
            "url": "https://myanimelist.net/reviews.php?id=82816"
        },
        {
            "content": "I felt compelled to rewrite this review as the previous one I wrote seemed to lack alot of substance.\r\nThis story seems to have taken place in a land resembling 15th century England, France, or some other Western-European country.  From what I watched, I found this anime great in many aspects because of one of the main songs (not themed) that helped create the atmosphere of the simple yet very interesting storyline concerning the Empire's General wanting to recreate a catastrophe to gain dominance using what they call the Devil's Contract.  The devil's contract seemed to use some sort of enchantment to create ademon from a human heart.  The main villain is blamed for the death of the father of the 2nd main character, Luke Ainsworth, resulting in his will to seal away the main antagonist, Valbanill.  The main protagonist is a clumsy knight recruit following her father's footsteps.  She wants to live the glory that her father once lived defending the nation against the onslaught of Valbanill's demonspawn.  As these demons are spawned, so are the weapons of focus -  the demon swords.  There are several demon swords, and few of them even were granted the forms of normal humans who have their own stories, personalities, and ambitions.  What I found odd yet intriguing about this story is the background of Luke Ainsworth's assistant, Lisa.  This story also involves a merging of the knowledge of molded swords and folded swords such as the katana, which is the preferred weapon of Luke.  Luke is the believed Sacred Blacksmith who is ultimately the catalyst of stopping Valbanill's wishes of purging the world in to hell as it was once before purged 44 years before this story takes place.  How you assume Luke is that Sacred Blacksmith is the use of prayer contracts to create powerful elemental (ethereal) katanas only capable of 3 successful slashes.  Some negative aspects of this production involve silly and unnecessary insertions of fan service surrounding the main protagonist, Cecily Campbell.  This production is however shorter than most only planned to span half a season and for it's short-lived airtime I personally felt it was worth watching.  The story being great and all however may be bumped by the slow progression of the first few episodes.  Overall, this anime deserves a 9 overall.  Happy watching to all those interested!!!",
            "date": "2009-12-10T20:50:00+00:00",
            "helpful_count": 10,
            "mal_id": 21263,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/268345.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Onslaught2k3",
                "username": "Onslaught2k3"
            },
            "url": "https://myanimelist.net/reviews.php?id=21263"
        },
        {
            "content": "The Sacred Blacksmith is a decent anime that I really enjoyed; partially due to a load of crap I happen to be watching, and also I had really low expectations of this show. When I heard of that this series is gonna get animated, I went ahead and read a few chapters of the manga and frankly, the story isn't anything impressive. Any many other similar works becomes worse when animated so yeah... that is what I've expected out of this series.\r\nNow, I don't remember the studio Manglobe nor remember if I've watched any series from that studio, but it turns out that Manglobe doesa damn fine job with it. Even if the manga wasn't good material, I'm glad they stuck with the pacing of the story instead of going inventive, which usually sucked. The colours are brilliant and the animation are crisp; and for once, the action scenes are actually pretty good. I don't know how a series like this got that kind of budget but hey, I'm not complaining.\\n\\n\r\nI didn't think much of the story but I really love the characters, even Cecily, who I thought was irritating in the beginning for being really useless, but her really cool action scenes towards the end made up for it. The ending of the story feels like one of those last minute addition to create a finale (I don't know because I didn't get that far in the manga), and though the main villain is a pretty crappy character the ending ain't too shabby.\\n\\n\r\nA fairly nice series to watch if you're a fan of medieval settings, like me.\\n\\n\r\nPlot/Concept: Fairly Good\\n\r\nStory Style: Great!\\n\r\nAudio/Visual: Great!\\n\r\nValue: 7",
            "date": "2010-11-02T09:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 31778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22253.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/du5k",
                "username": "du5k"
            },
            "url": "https://myanimelist.net/reviews.php?id=31778"
        },
        {
            "content": "Overall, the show is not as bad as it seems at start. Yes, it starts off pretty slow and not all that interesting, but around episode 7 it picks up the paste. I was just about to drop this anime last night, until I decided to watch the new episodes. Witch by the way caught me off guard. The story line seems to get more and more interesting as the episodes go on. And NO, its not based on Cecily's breast like the guy above me says. Its pretty good and the fighting scenes are awesome and attract me a lot, and it has potential.Check it out and don't give up on it so quick. \\n\\n",
            "date": "2009-12-16T20:36:00+00:00",
            "helpful_count": 7,
            "mal_id": 21437,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/108705.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/JaeTheAnimeGuy",
                "username": "JaeTheAnimeGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=21437"
        },
        {
            "content": "Not going to go into the details, as it will ruin it for you, but wanted to voice my opinion. I really enjoyed watch blacksmith, it is one of the recent animes i have enjoyed watching, as all other new animes are made just to show bras and panties so \"pervs\" would atleast watch them, and that makes their t.v rating go up even though they have no base story, or a really shitty one. But blacksmith isn't one of those animes, it isn't ecchi at all, theres comedy, and a bit of romance, but its mostly an action based-slice of life anime, with considerablestrong story. One of the best things about this anime is that art. It is very colorful, and one of the best \"new\" animations i've seen. In the end its your choice to follow all the negative reviews under mines, or give it a chance. I say GO FOR IT! its awesome!",
            "date": "2009-12-20T12:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 21555,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/deathgame3",
                "username": "deathgame3"
            },
            "url": "https://myanimelist.net/reviews.php?id=21555"
        },
        {
            "content": "When you think of blacksmiths, you think of large, strong men who make swords, horseshoes and other appliances for a medieval world. What you normally don’t see is a kid doing all this with a smaller kid as an apprentice. That’s what happens when you watch this one. \r\nThe characters seem not fleshed out enough, and we barely see a back story to any of them except Luke and even that happens a little to late in the game. By that time, the characters felt a bit stale, and hard to relate to. In a 12 episode show, they shouldn’t be dinking around like theydo, mostly bringing up jokes about Cecily’s breasts and her strange breastplate that seems to be way to close to her to not of been molded on her breasts. And what’s with her mother even bugging her about it? Really? It’s not enough that the whole town talks about her breasts but her mother too? I’m not fond of how this show seems to move a bit too slow this show gets, but once it gets to the point, it is pretty good, and then it ends... Really, they spend more time talking then fighting and nothing really gets said.\\n\\n\r\nIt seems that everything leans up to the climax but many of the things are lost in the first part. For instance, the only time I find out that that Luke has a fake eye is to the second to the last episode. If it was a big thing with the story then it should be said earlier in the story along with Luke’s story. I feel like I only got half the story through the show and I wish there was much more to help me see the lines. It just screams second season to and from what I know of, there isn’t one. \\n\\n\r\nThe artwork is pretty nice though some of the characters look familiar to other shows. Little Luke reminds me of Sora from Kingdom Hearts and I can pick out little things hear and there that felt like rip offs. And don’t get me started on the creepy monsters that attack. It plays out mostly like a monster of the week style though the story makes it hard to watch them out of order. The comical parts in the art seem forced in whenever we have a serious point and trust me, that happen way to much for this show. I wish they chose a side, ether comical artwork with comical plot, or serious artwork with serious plot.\\n\\n\r\nThe voice acting is pretty good but I am a little put off by one or two of them. Lisa isn’t that great a voice, making me sigh at the high pitched sound from her mouth. Some side characters really need deferent voices because sometime it makes them feel way too important then they should be.",
            "date": "2012-08-10T13:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 69347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=69347"
        },
        {
            "content": "I was actually looking forward to Sacred Blacksmith it seemed to have many elements I like in anime. The story centres around Cecily a female Knight who not particularly good at being a Knight. She is saved from certain death one day by Luke (the sacred blacksmith) who has the ability to forge magical Katana swords in the heat of battle. \r\nLets get one thing out of the way first, the English dub is awful. Cecily’s voice grated on me so much I switched straight to subtitles. Most of the voice cast sound like they have just walked off the set of high school musical.Avoid the dub.\\n\\n\r\nThe story itself centres around a town which Cecily protect and the rising demon hordes that are causing trouble around the town. Luke is often called upon to save Cecily as she so inept and then like a sulky teenager disappears back off to his workshop with his apprentice Lisa.\\n\\n\r\nThis is only a short series so you expect it to stick to the main story which centres around the revival of a demon god and how people are entering into demon contracts effectively turning themselves into demons. It doesn’t. Instead we get the ridiculous Charlotte Frobisher story arc as well as an entire episode dedicated to shopping (seriously). We then have supporting characters like Aria who is a demon sword who can also take human form (seriously). This is never fully explained so you just have to go with it.\\n\\n\r\nThe character designs are good but nothing amazing and the battle scenes are pretty average as well. The show also suffers from the –I’m going to do a speech so all fighting stops problem. Enemies also seem happy to let Luke forge his Katana mid battle. \\n\\n\r\nCecily as a character is quite shouty and annoying while Luke spends much of his time sulking and trying to avoid Cecily.  Its only in the last four episodes do we get some character and story progression.  We find out why Luke has a face like a slapped arse and also see Cecily progress from being useless to reasonably competent as a knight.\\n\\n\r\nThe series has some decent ideas like the forging of magical swords but they are poorly executed. The story is not particularly original, couple this with some rather annoying main characters, the series pushes the boundaries of your patience.  There is some mild nudity which seems a bit out of place and the constant referencing of Cecily’s ample chest wears thin after the first episode. The animation quality is fairly fluid and sound is ok with a very cheesy closing song which sticks in your head.\\n\\n\r\nIt’s difficult to recommend Sacred Blacksmith if it wasn’t for the final four episodes this series would have been a total waste of time. The series also doesn’t have a conclusive ending and you feel there is much more of the story left to tell which makes it all the more puzzling why so much time was wasted with side stories at the start of the series. It’s unlikely we will see a second season but based on the first this is no great loss.\\n",
            "date": "2015-03-18T07:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 182611,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477713.jpg",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 3,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Crashmatt",
                "username": "Crashmatt"
            },
            "url": "https://myanimelist.net/reviews.php?id=182611"
        },
        {
            "content": "First of all, I have to say that this anime reminds me of a series that my younger sister used to watch called \"winx club\".\r\nIn the beginning it all looked nice and cool but after two episodes that becomes really bad and more \"slice of life\".\r\nNo action at all, the fights are bad, and most of them are just talking.\r\nThere is no storyline almost at all, I've watched an episode, and another, and another, waiting for something to happen, but it is yet to come.\r\nIt is set in a world where there are demons and magic swords and these, there isn't \"good\" and \"bad\" whofight each other, it's just people who meet the main character and stay for some episodes and then go.\\n\r\nThe main character, Cecily is an annoying person who is weak and always lecture about boring things.\\n\r\nLuke, is boring as well, he doesn't care about anything but his goal.\\n\r\nThere's a major issue in this anime- the nudity which comes out of the blue.\\n\r\nIt looks like the creators had no idea what to do now so let's just put nudity! Her armor got shattered so of course! We'll see her breasts. The girls are ALWAYS talking about boobs and Oh God, why?\\n\r\nIt's pretty much pathetic.\\n\r\nAnother issue is the design of Luke,  he looks like a mashed up potato,  and there's a serious matter about his left eye.\\n\r\nThe soundtrack is just....  bad, I've seen many animes which you can't ignore the soundtrack, but not this one.\\n\\n\r\nBottom line: Not recommended, I gave it 6 because I can't \"admit\" I've seen such a bad anime like this, it can be for little girls who don't care to see some nudity.",
            "date": "2015-05-14T05:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 187809,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3262007.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/dadnaya",
                "username": "dadnaya"
            },
            "url": "https://myanimelist.net/reviews.php?id=187809"
        },
        {
            "content": "When I started on this anime, I kind of regretted watching it because I felt bored at the first episode, but, since I've been looking for an anime that has a strong male character, I decided to watch on and I'm glad I did.\r\nStory - The story is very poor or rather, like most animes, rushed. The series is more about the main character's daily life and interaction with other characters of the series rather than the main character itself. They focused too much on the main characters that the story was neglected and at the end, it was rushed to complete the series. Ifthere were just one more episode, I believe that the anime could've ended on a nicer note.\\n\\n\r\nArt - Like most of the anime that are currently being released, character designs and animations for them are pretty good. I particularly liked the designs of the houses like they were in medival times. Other than that, nothing much to say here.\\n\\n\r\nSound - The only music worth mentioning is the opening and ending songs. Other than that, I have no impression of any noticable music really. Which is also one of the main flaws of the series. Although fights need not necessarily require music, it does add to the flavour and feel of the situation at hand.\\n\\n\r\nCharacter - Character development is fantastic. The main character does grow over time and slowly gets people to acknowledge her, though of course it's not like she was ostracized, bullied or looked down upon by the community in the first place, just that she wants to prove a point and she did. The only flaw is that we don't get to actually see the character become strong since everything was rather rushed towards the end.\\n\\n\r\nEnjoyment/Overall - Aside from the flaws I mentioned,  I rather enjoyed this series and I do hope that a season 2 will be made. I think that the series will do very well in season 2 should there be one.",
            "date": "2010-12-11T07:39:00+00:00",
            "helpful_count": 5,
            "mal_id": 32658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kireas",
                "username": "Kireas"
            },
            "url": "https://myanimelist.net/reviews.php?id=32658"
        },
        {
            "content": "I watched this anime because I saw it on netflix, I was bored, and the cover caught my eye. Thus, I went into this series not only unaware of what it was, but with no expectations either way. \r\nAs I said, though, I watched the first episode on Netflix (which has only dubbed anime) and enjoyed it well enough; I liked the character designs, the voice acting was alright for a dub (except Lisa whom I wanted to throttle after 3 lines) and it seemed like it could develop into a decent story, so I decided to continue. However, fate intervened, and I was unableto get to netflix the next time I wanted to watch, so I looked it up online and found the original--and OH GEEZ was it good comparatively. Especially the voice acting:\\n\\n\r\nSound: 10 AMAZING\\n\\n\r\nWhen the obnoxious girl from the English dub was replaced by Toyosaki Aki going to the original after one episode, I nearly exploded with joy (she is my personal favorite Japanese voice actress). Besides that, Luke was now voiced by Okamoto, Nobuhiko (whom I recognized, having just finished watching To aru Majutsu no Index). So I will not deny that my love for the voicing and music are indeed partially due to the sub-par dub counterparts I was originally exposed to. Even so, the voice acting is incredibly strong in this series, from the entire cast. The theme song took a few episodes to grow on me, but it certainly did, and it is now one of my favorite anime themes. Toyosaki Aki singing the ending theme won me over after the first 3 lines.\\n\\n\r\nStory: 7 Good\\n\\n\r\nThe story does fall into a few stereotypes and uses a few stock characters, but they're not too distracting and the rest of the story has some interesting ideas to it. The idea of the object/not-quite human character struggling with questions of their existence is nothing new (Data from star trek, even Hatsune Miku in the song \"The Disappearance of Hatsune Miku\" explore similar issues) but the story offers enough of a twist on this admittedly cliche but interesting plot point to make it acceptable. \\n\\n\r\nArt: 7 Good\\n\\n\r\nNot too much to say here, the art wasn't super amazing but it was by no means bad, and each of the characters were distinct and memorable.\\n\\n\r\nCharacter: 9 Great\\n\\n\r\nThis mixes with what I said about the story--which is partly because most of the story is exploring the characters and their pasts. All of the protagonists, and even some of the minor characters, are developed surprisingly well and enjoyably, especially Lisa. (I won't go into detail there to avoid spoilers)\\n\\n\r\nEnjoyment: 8 Very Good\\n\\n\r\nThis would have been a 9. It was almost a 10 actually, until the end. I won't give away WHY but the ending was....infuriating. I found out why later--the series, like many anime, is based off a light novel series, and of course the anime finished before the books did, and so the anime writers had to slap together an ending. There are some times where this is successful, at least to a point, but this NOT one of them. Little is resolved, the final battle is frankly STUPID and the ending left me sitting there saying \"what, THAT''S HOW IT ENDS?!?!?!\" I still enjoyed the rest of the series, but such an awful ending could not let me leave it with a perfect score.\\n\\n\r\nOverall: 7 \\n\\n\r\nDespite the atrocious ending, this anime is still more than worthwhile I think. I thoroughly enjoyed following the growth of the characters, and as I said, the amazing voice acting. Though there is little hope, as this wasn't the most popular anime, I do wish they would make another season to give it a respectable ending, but nonetheless I do not regret seeing this anime, and still would recommend it to anyone.\\n",
            "date": "2012-04-02T21:25:00+00:00",
            "helpful_count": 5,
            "mal_id": 57757,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1032547.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eriias",
                "username": "Eriias"
            },
            "url": "https://myanimelist.net/reviews.php?id=57757"
        },
        {
            "content": "There is so much wrong with this series it is hard to remember it all.  From reading the short description on Netflix I concluded that this would be an adventurous series with the possibility of a good plot.  I was wrong…very wrong.  I’m going to try to tell you why NOT to watch this series and keep it short at the same time.\r\nI am not sure what the plot is or if it ever existed at all.  The plot is supposed to be continuous from episode to episode but, it is impossible to tell how the plot reached the current pointfrom the previous.  It seems like somebody wrote a series of short random events modified and arranged them into a short story board putting forth as little effort as possible.\\n\\n\r\nCharacter development is a far more serious problem than the plot itself.  Characters make leaps and bounds forwards in one episode then might regress twice as fast back in the following episode.  Or you wonder where the characters came to a certain conclusion and can only conclude that it was in between the episodes when there was a massive plot jump.  This makes it even harder to understand or relate to the main character.  The character all seem to be drawn the same as well and then modified.  Copy and paste is not working in their favor.  (I was wondering if this was just me but then I saw it in somebody else’s review as well.)\\n\\n\r\nTheme; tits.  I’m sure this is the theme…every episode seems to finish off talking about Cecily Cambell’s breast size.  One episode has entire dinner scene talking about Cecily’s boobs… as well as a pool scene and many others.  Boobs are actually shown in this series which does nothing to enhance the show.  It is a poor and failure of an attempt at comic relief.\\n\\n\r\nDialogue is horrible and when it is not horrible it is so absurdly cheese it is intolerable.  Music enhances anything and everything that is cheesy and is vastly overused.  The animations are possibly the only redeeming fact about Seiken no Blacksmith.  \\n\\n\r\nIf you still want to watch this series after reading this review be my guest, but I do not recommend a 4/10 rated series to anybody.  Somebody wanted to make some fast easy cash off developing this series and, therefore put no real time into it.  \\n",
            "date": "2011-06-20T22:21:00+00:00",
            "helpful_count": 5,
            "mal_id": 38104,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/492110.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/bcornett24",
                "username": "bcornett24"
            },
            "url": "https://myanimelist.net/reviews.php?id=38104"
        },
        {
            "content": "This is a review of the DVD version of \"Sacred Blacksmith\" (Seiken no Blacksmith) released by Funimation in 2011. It was viewed with English voice overs.\r\n\"Sacred Blacksmith\" falls into the category of fantasy action adventure with some minor elements of comedy.\r\nParental Advisory:\r\nThe age rating is listed as 17+.  However, this is absurdly high - the show's content does not merit this high of an age rating.   Two or three of the episodes include some very brief scenes with female topless nudity.  There is combat violence in several episodes, but it isn't overly graphic.   As a result, this show wouldlikely be suitable for teens 13 and up.\\n\\n\r\nStory: 7/10\\n\r\nThe show is comprised of 12 episodes.  During the episodes, several characters are introduced including the main protagonist Cecily, the blacksmith Luke, his assistant Lisa, and a few others from the city.  Along the way, the world's history is revealed bit by bit.  Without giving away too many spoilers, there was a previous war involving a demon and the repercussions of that are still being felt.  Some of the main characters are directly related to the events of that war.\\n\\n\r\nMuch of it is fairly typical for a fantasy story, but there were a few interesting elements introduced related to the blacksmith and how he is able to magically craft weapons with his assistant.  Some of the ultra-powerful demon swords can also take human form which is explored in a few episodes, but is never fully explained.\\n\\n\r\nNear the middle of the series, a new set of characters are introduced almost out of the blue.  At one moment they a supposed to enemies, and then suddenly they are allies, and the sudden shift doesn't make much sense.  A few episodes later, they are whisked away.  The few plot developments and pieces of information that are introduced by these characters could have easily been provided in other ways, and leaving these characters out of the series entirely would have led to a stronger series, and provided more time to focus on some of the other characters.\\n\\n\r\nThe series ends on a cliffhanger, which seems to indicate that a 2nd series was planned.  However, I have found information about this, or when it might be released.\\n\\n\r\nCharacters: 5/10\\n\r\nVisually, many of characters in \"Sacred Blacksmith\" are more normal in size and appearance compared to those in other modern anime titles.  Most of the females are especially demure, and the males aren't overly muscular.\\n\\n\r\nThe main character, Cecily Cambell is an overly inept knight.  She is a very weak character to serve as the main protagonist, and this is a drag throughout the entire show.  Through the series, some other characters make jokes the size of her bosom, but these fail to be humorous, partly because her breasts aren't really that big, at least not compared to characters in other modern anime.  Her breasts are shown briefly in a couple of episodes in an apparent attempt at humor, but the scenes barely register on the funniness meter, and could have been left out.\\n\\n\r\nLuke, the blacksmith, and his assistant, Lisa, are more intriguing characters.  Some of the key plot developments relate to these characters.  I would have liked to have seen them involved in more scenes instead of Cecily.\\n\\n\r\nThe main antagonist seems overly cliché.  He's presented as a mysterious figure in a black cloak, before his real identity is uncovered.  However, it was really obvious from the beginning who it was for those paying attention.  The lack of originality of this character is a bit of let-down, as are his motives.\\n\\n\r\nOther characters are introduced such as guards and key members of the city government, but they don't get much screen time.  Rounding out the characters are a couple of living weapons one of which gets a fair bit of screen time, but not enough to fully explain their background.\\n\\n\r\nArt / Animation: 7/10\\n\r\nThe animation in \"Sacred Blacksmith\" was good overall, but not spectacular.  It seemed to use a lot of recycled art through the series.  For example, scenes of the city show an ominous, yet never-changing volcano apparently spewing a large ash cloud over the city.  This erupting volcano is never mentioned or explained.  I liked the blacksmith's magic weapon forging scene, but that too was essentially recycled a few times with few or no changes in later episodes.\\n\\n\r\nSome of the character designs are a bit basic but nice, and thankfully they were not as over-the-top as some characters found in other modern anime.  The outfits evoked a fantasy atmosphere, and their style had a simple elegance.  I found Aria's outfit to be quite lovely and rather fitting for her wind-nature.\\n\\n\r\nA few of the combat scenes were enjoyable to watch, and they seemed to capture elements of the action rather well.\\n\\n\r\nSound / Voice: 7/10\\n\r\nThe soundtrack and background music used an orchestral piece which was quite good.  Other sound effects, such as during the combat scenes, were fine.  The English voice acting seemed ok.\\n\\n\r\nEnjoyment: 4/10\\n\r\nWhile I enjoyed parts of this show, it really wasn't that enjoyable to watch it.  At times, it seemed like the story could be quite good, and it had the potential to set things up for a serious fantasy adventure, but then it would shift gears and try to inject comedic elements that didn't really work.  A big part of that problem is due to the main character Cecily - her ineptness more or less forces her to be used as comedy relief for many of her scenes.  It's like trying to inject a character from “Slayers” into “Record of Lodoss War” - the results are predictably bad.\\n\\n\r\nFinal Verdict: 6/10 \\n\r\nI really wanted to like this show.  It had a cool fantasy setting with a very interesting backstory, some enjoyable combat scenes, and a few characters that were intriguing like the blacksmith.  However, the unimaginative villain, the sudden introduction of extra characters, and the focus on Cecily end up derailing this story, never allowing it to climb out of mediocrity.\\n",
            "date": "2016-01-07T09:26:00+00:00",
            "helpful_count": 4,
            "mal_id": 207968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2534445.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kalendraf",
                "username": "Kalendraf"
            },
            "url": "https://myanimelist.net/reviews.php?id=207968"
        }
    ],
    [
        {
            "content": "\"Sacred Blacksmith\" is a point above \"the middle of the road.\"  The story could've been better if it's removed of the focus on tities and the \"hate to love you\" relationship between Cecily and Luke.  I still want for a male lead who's able to avoid getting punched around for \"otaku lulz.\"  Or atleast retaliate physically.  Like Rance, or Seto from \"Juuden-chan.\"\r\nAtleast Cecily didn't come off as another \"invincible chick.\"  She was literally BEGGING Luke to make a katana for her.  She had her faults, but that emphasized her strengths; and she made a good character overall.\r\nAtleast Luke didn'tcome off as a total jerk.  Because, you know.  That's what \"people who are still suffering from their past mistakes\" are called nowadays.  (And the people who call them that are the REAL jerks.)  AHEM.  Luke is another overall good character; powerful, harsh yet kind.  I'd wish he WOULD kick Cecily's butt just to knock her down a peg.\\n\\n\r\nAtleast Lisa, Aria, on down proved to be good character; some of them with great backstories.  What's up with Siegfried and his \"Shounen Jump Boss Syndrome?\"  The only character that REALLY needs something like a BPKO (belly punch knock-out) is Fio, the Campbell family maid.\\n\\n\r\nHonestly, I believe one of the only \"good\" anime worth having / supporting / buying is \"Heroic Age.\"  The characters herein don't make me wanna punch them in their face, the plotline doesn't make you wanna wish that the storyboaders and writers get smacked in their faces, and it's a breath of fresh air from all the pandering to the loser otaku...\\n\\n\r\n(CAN a \"good\" anime be done where the (supporting) male lead isn't a wussy punching bag AND panty shots can be shown from an upskirt angle?  No licensor in the US wants to touch \"Juuden-chan.\"  \"Dokuro-chan\" and \"Working,\" but not \"Juuden-chan.\")\\n\\n\r\nOh well...  There's always adult anime.  And anime like \"Sacred Blacksmith...\"  My recommendation is that you look beyond animation (and \"boobie chestplates) to find the true spirit within.  Because pretty soon you'll need to ask a title like this is worth keeping around.",
            "date": "2011-02-05T23:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 34289,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=34289"
        },
        {
            "content": "One day while walking around Best Buy I saw this DVD, and since I make it a point never to leave there without an anime DVD I decided, why the hell not? I have to admit with this anime I was not expecting much n my god...even with no expectation I was disappointed! \r\nOk well let me explain, this anime suffers from three main problems. And two of these I see occur in most short anime series. \r\nFirst it's about a clumsy knight (Who seriously need to invest in a bra, n whose animators need to actually decide what size and shape her breasts actuallyare.) named Cecily Cambell and her quest to get a new sword from a blacksmith named Luke. All the while she must protect a demon sword that can take human form named Aria. There is also a god-like demon that is tied into Luke's past that Cecily tried to unravel. \\n\\n\r\nNo this! ...I love this! While this does not make it the anime of the century is does get very interesting, the characters could use a bit more development, but I love this. What happend to Luke? Why are his swords so amazing? (yes, that's what she said, hardy har) What is the secret behind Aria? And there are so many things that come up in the anime that are amazing that can be expanded upon.....until.....we run into the first problem with our anime....\\n\\n\r\nThere are side plots and filler episodes that go nowhere and do nothing for the show and are rather quite boring...we have our obligatory shopping episode. Then a side plot come the hell out of nowhere where some illegitimate princess shows up and tries to prove who she is, but her father won't listen and why!? Just why!? Why do we care? Why are you here?What does this have to do with demons and swords!? Nothing! It serves no purpose and is just boring!\\n\\n\r\nThen our second problem, and Hell Girl suffered from the same thing...the main story doesn't come in until like the last four episodes! Only then do we find out about Luke's past! Only then do we find out what our villain's motivation (or lack there of) was! And normally I wouldn't mind this...if the rest of the anime wasn't useless filler! There are bits of interesting plot sprinkled throughout only held together by boring subplots only to get slammed with the heavy stuff at the end.\\n\\n\r\nAnd finally our last problem though one that I guess could be excused, but nothing is explained! not the original novel and manga (both I have not yet read) are still going. So yes some animes such as Deadman Wonderland, if the original material is not yet completed, rather then just going off on filler (like there wasn't enough in this series already) they will just end and go then continue with another season once they have more material to go on. But at least Deadman left things off ominously, this....it just ends! Not even leaving you room to think what might happen next. \\n\\n\r\nThe manga or novel might be worth a look at if they just stick to the main story, this anime however, it won't hurt you to just pass on to the next.",
            "date": "2012-11-04T16:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 76685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SakuraRosaPetals",
                "username": "SakuraRosaPetals"
            },
            "url": "https://myanimelist.net/reviews.php?id=76685"
        },
        {
            "content": "The current score for this anime is harsh (6.99). This was one series that deserved to be stretched to double the amount of episodes it has. Sure, the series was rushed but it has more character development than any other long anime series I've seen. Although short, they showed a lot of character development in the main characters (Particularly Luke Ainsworth). I admit that I am a fanboy when it comes to Medieval setting and Holy references. But many modern day anime lack what this anime has. Jealousy is a very common factor in modern day anime and I saw no hint of jealousy here.Seiken no Blacksmith is one of those series where I've had a ton of enjoyment and will always by one of the best Medieval sword themed anime I've seen.",
            "date": "2012-08-15T10:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 69837,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/539525.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Flashflame00",
                "username": "Flashflame00"
            },
            "url": "https://myanimelist.net/reviews.php?id=69837"
        },
        {
            "content": "Negatives: \r\n- Annoying Female knight that acts like every fucking weak protagonist from many different anime, but at certain time, they somehow became so strong that they surpass others.\r\n- The unnecessary nudity/fanservice (eventhough in kissanime this anime hasn't been categorized as ecchi at all) kinda destroy my experience for me. It mean, the fanservice is definitely better than Love Ru darkness, but man, it doesn't really fit this kind of genre anime. \r\n- The pacing of the story, or the plot line is pretty slow. Many things tend to be digress into the build up of relation, learning about their world, seeing cute interaction betweencharacters (although, since i find the female protagonist annoying, it kinda ruins it for me), and doing things that digress from moving the plot forward.\\n\\n\r\n- Despite being an anime with genre like Action, Adventure, Fantasy anime. There seems to be alot of slice of life stuff going on here. And that's not what i came for. The Male protagonist is pretty badass. That's an enough reason for me to watch the entire of the first episode, but later on i eventually got bored. Although the action scene is pretty fun to watch. There seem to be more slice of life rather than what the genre have initially stated.\\n\\n\r\n- It's just a hypocrisy when a knight didn't want to protect its kingdom and its people that supported those kingdom that the knight were served to defend in the first place. So the Female protagonist is pretty annoying when it comes to killing someone, or to use whatever is in her capability to use on human life like hers. One word, \"Naive\".\\n\\n\r\n- I personally feels like the entire enjoyment of the show is solely on seeing our male protagonist fight, because that's when we get to see some badass fight scene. And btw, why the fuck does the enchant \"kill good\" at the very end of turning themselves into a sword after being seen to be in their human form? (as in the magic sword). It's just so random, and makes no sense.\\n\\n\r\nPositives:\\n\r\n- If you like the character in the show, then you will enjoy the large amount of time of character's interaction that digress from moving the plot forward. I mean take slice of life anime for example. This anime is kinda like that.\\n\\n\r\n- The Male protagonist is fucking badass. His personality is pretty strong/cool, and deft with many combat like skills. \\n\\n",
            "date": "2016-08-27T14:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 227734,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1481449.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Apdo1",
                "username": "Apdo1"
            },
            "url": "https://myanimelist.net/reviews.php?id=227734"
        },
        {
            "content": "Opinion, all reviews are simply opinion and with that in mind ill continue. Most of the reviews on this anime are against it, i guess my opinion is different since i liked it, not loved it but i liked it.\r\n Plot: \r\n The plot is original i assure you and though its not a strong one it does satisfy the watcher. Theres not much to say on the plot, it focased more on the building of the characters than the enemy at hand but it didnt make it bad in any way. \r\n Art: The art was good, it was clear and descriptive andyet still easy to watch.\\n\r\n Sound: \\n\r\n The sound was average, not bad at all. \\n\r\n Characters:\\n\r\n The main character were what the anime's episodes focased on, you may be thinking duh but what i mean is the anime made most of the episodes about their growth and development and bits of their past. The main enemies were not very main at all, although they were meant to have a place in the plot they didnt. They had maybe 3 or 4 episodes about them in general and didnt really tell us what happened to them afterwards. \\n\r\n Overall:\\n\r\n The plot was not what it was supposed to be but it was fine although i would have liked to see more about the antagonists and less of the protagonists. Overall it was a very watchable show and i would re watch it and also suggest it.",
            "date": "2010-12-04T03:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 32493,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307438.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Lamyisme",
                "username": "Lamyisme"
            },
            "url": "https://myanimelist.net/reviews.php?id=32493"
        },
        {
            "content": "The Sacred Blacksmith is a short series, only twelve (12) episodes which was a bit reminiscent of an RPG game albeit an incomplete one. A production of FUNimation Entertainment, this series could have been much, much better than it was. \r\nSTORY 3/10\r\nThe story takes place in the Independent Trade Cities of Housman, where we meet the main character Cecily Cambell, a young, obnoxious, naïve girl who has decided to become a knight and continue her father’s bloodline even though she has no type of skills or talent. She is entrusted with protecting the demon sword of the village and has a virulent relationship with LukeAinsworth, the blacksmith. Together they must also protect the city from the threat of Valbanill.\\n\\n\r\nART 8/10\\n\r\nThe artwork in this anime was lucid and colourful. The setting and the characters were reminiscent of an RPG game. Because of the different blend of colours, it made watching the anime easy on the eyes but dull on the brains due to lack of story progression. Nevertheless, the art was a positive highlight of the series.\\n\\n\r\nSOUND 5/10\\n\r\nThe musical scores in the anime were pretty mediocre and the woman’s voice in the opening piece gravitated towards the annoying side especially towards the end of the tune. The ending song was pretty cute, even the images were adorable. In this area, there was nothing that made it stand out.\\n\\n\r\nCHARACTER 4/10\\n\r\nThe characters in this anime were typical of most animes, the annoying girl, the apathetic guy, the cute whiny child and the whimsical girl. None of these characters grow or display any change from the beginning of the series until the end and this was largely as a result of there being no real progression with regard to the story and hence the characters were unable to display any sort of transformation.\\n\\n\r\nENJOYMENT 3/10\\n\r\nThe first episode displayed some promise but as the series progressed, the action and story development was limited to the first three episodes. Other characters entered into the mix that did nothing in advancing the plot but only served to kill a couple of episodes. The series lacked depth, a really good story and proper character development as well as proper closure.\\n\\n\r\nOVERALL 3/10\\n\r\nThis series did not have much going for it, only the brilliant artwork. The story was lost before it was ever found and the characters did not progress either. This series would have worked if they had stuck to the original story which they had started with in the first episode but they went off track by introducing other characters whose presence did not serve any vital purpose in the anime. If you are looking for light entertainment with little or no type of brain activity, then this anime is for you but I would personally not recommend that you waste time with this one even though the animation is pretty nifty and the first episode provides the genjitsu for you to continue watching on further.\\n",
            "date": "2011-06-08T07:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 37673,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89329.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Tydus",
                "username": "Tydus"
            },
            "url": "https://myanimelist.net/reviews.php?id=37673"
        },
        {
            "content": "Man.. This show will be the death of me.\r\nFirst episode GREAT! set up the story well and showed some cool slicing and dicing.\r\nUnfortunately the show goes downhill from the first fight scene, looking back it feels as if half the season was filled with filler if each episode had a purpose and impacted the surroundings this would be a great little anime but nothing happens.\r\nI waited the entire show expecting the heroine to leave home and go adventuring yet to plot just stalls and stagnates with indeed new characters being added but i didn't feel as if this rejuvenated the program very well\r\nIn summery thefew fight scenes are really good, characters have good story's but with a weak overall story arc i would give this one a moderate rating as i believe a good story arc in a second season could make this a very good anime.",
            "date": "2012-12-27T09:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 81538,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/274921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Monkeycoder",
                "username": "Monkeycoder"
            },
            "url": "https://myanimelist.net/reviews.php?id=81538"
        },
        {
            "content": "As a whole, The Sacred Blacksmith is a mixed bag in its exploration of Cecily and Luke's ordeals surrounding the Demon Swords and the mysterious man causing troubles throughout the kingdom the two young heroes inhabit. The series essentially divides itself into arcs focused around various conflicts that Cecily and Luke encounter with a different situation pertaining to the two said scenarios. One of the show's biggest weaknesses proves to be the choice in which it follows its plot direction. The series has you believing at first that the plot would be focused around Cecily and Luke unraveling the schemes of the mysterious man untilit tosses in the element of the Demon Swords. This brings about the arc involving Charlotte which while a touching one to look into, it doesn't do anything in advancing the other critical plot development involving the mysterious man.\\n\\n\r\nAdding to these complications with the plot are some unexplored plot elements such as why some Demon Swords like Aria are able to take human form and preparations for the battle against the powerful demon being feared. Pacing also seemed fairly rushed towards the show's second half leading to unnatural developments with plotting and characters due to the lack of proper buildup on such elements such as the revelation of the mysterious man and improvements in Cecily's swordsmanship. In addition to these issues, I was getting quite turned off by the show's cheap attempt at getting humor off nods to Cecily's bust size. While fan service isn't rampant in Sacred Blacksmith, hearing the characters tease or mention Cecily's breasts did annoy me at points.\\n\\n\r\nWhat does work for the series are the character relationships and developments witnessed throughout Sacred Blacksmith. The series does a decent job in fleshing out prominent characters in regards to their backgrounds and their personal beliefs. The series also establishes character relationships that mesh well enough to have you care for the bonds that said characters have for one another such as Charlotte and her posse from their struggles for acceptance by Charlotte's kingdom and the unique wielder-weapon bond between Cecily and Demon Sword Aria. Visuals also look decent on the eyes sporting clean details and vivid colors in regards to scenery, as well as good-looking character designs like the attractive human form of Aria and the various demons that are slayed throughout the series. Animation often consists of static shots during battle scenes, but has its moments of great animation during sword fights involving major characters and the sword forging spell used by Lisa and Luke.\\n\\n\r\nThe Sacred Blacksmith is far from being the best anime one will come across due to its shoddy direction in plotting and rushed pacing in the show's second half that hamper developments and elements within the series. However, the character bonds and the individual developments of said characters do help alleviate these major flaws to a degree. While not being the most original title one will come across, The Sacred Blacksmith is worthwhile enough for a quick watch if you take interest in it.",
            "date": "2011-09-08T15:32:00+00:00",
            "helpful_count": 3,
            "mal_id": 42973,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=42973"
        },
        {
            "content": "This anime HAD SO MUCH POTENTIAL! The episodes up to episode 6 were really good! You know when an anime is good when you realise you're halfway through the series just like that! \r\nThe anime is in basic, a girl who wants to be a hero and a blacksmith who is rude. Now it sounds bland but honestly, the characters in the opening episodes were written well. Luke, the blacksmith slowly builds up his character and shows he cares. Lisa is that classic cute little girl who has that voice actor who you would swear is in EVERY anime ever, so just a run offthe mile character. But her story is entertaining and fun to watch, not the best written character but for the role she plays, just fine. Cecily is a busty and clueless character, but in a good way. She comes off as this want to be hero but slowly learns the meaning off a knight. She's well written but I think her back story could have been fleshed out.\\n\\n\r\nNow here comes the ending off the praise, the other characters. You know when an anime is bad when you can remember many of the main characters names. Honesty episode 7 and on wards is a total waste off time. New characters come in and for a whole two episodes, Luke doesn't appear. Now I'm all for new characters but they just turn up and they don't have any real back story. \\n\\n\r\nThe voice acting was meh, it sounded like it's one off those animes they made because off how popular the fantasy genre is but didn't give a crap about making it good like past fantasy animes such as Castlevania and Seraph of the End, both off those shows flesh out the characters and make you want to root for the heros and Hell, even the villains are good. The voice acting just seems like a B grade, the first episode has some voice acting which sound like something you'll get in a fan dub. \\n\\n\r\nThe artwork was meh as well, nothing fancy. Most anime's artwork is meh isn't it. I guess here and there you get some decent art work but this anime isn't a stand out. It's just your run off the mile fantasy harem ecchii anime (Yes you get to see Ceila's chest). I guess watch this if you're not looking for anything great, a good anime to legit waste your arvo. Got time to kill? This is the perfect anime. Don't expect to much, expect a bit off laughs and story telling but that's it. \\n\\n\r\nOverall 5/10\\n\r\nNot anything special but it's not half bad. Could be better.",
            "date": "2018-11-29T03:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 294911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4420215.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/KnightwingNC",
                "username": "KnightwingNC"
            },
            "url": "https://myanimelist.net/reviews.php?id=294911"
        },
        {
            "content": "This is pretty meh, not gonna lie. I was debating a 6 or a 7, but I decided a 7 because of some of the characters. The story itself is fairly generic, a clumsy, weak knight who needs someone to save her all the time. The main character, Cecily (don't worry she says who she is like before every fight I probably will never forget her name) grew on me at times. She started off annoyingly weak, but got stronger (?) (sometimes). She tended to kind of be in everyone's business, but she did it with good intentions, and I respect that. She has aninsane sense of justice, like maybe even Seryu levels. She's the kind of character that likes to talk during battles, which had my eyes rolling a few times. Although there was a lot about that anime that wasn't that great, there were some funny moments. There were a few cool fight scenes (if you cut out the conversation) and some of the characters were really enjoyable. Seiken no Katanakaji is pretty average, so if you watch it, keep that in mind, Don't go in it expecting the best because you'll be disappointed. However, you sometimes come to expect it with these types of animes that are 1 season with 12 episodes.",
            "date": "2018-07-23T18:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 284622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6428738.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BlipBloop",
                "username": "BlipBloop"
            },
            "url": "https://myanimelist.net/reviews.php?id=284622"
        },
        {
            "content": "War is Hell.  These words, famously spoken by Union soldier William Tecumseh Sherman during the American Civil War, have lived on ever since, and they’ve been used on many occasions to describe the bloodshed and rampant loss of life that can happen when nations engage each other in combat.  It’s probably one of the most apt metaphors ever constructed by man, but what if it were to obtain a literal definition as well?  What if there was a war that actually involved the forces of hell, with actual demons fighting both against and alongside the human race?  This is exactly whathappened in the Vaalbinill war, a conflict where mankind used a powerful magic to turn human sacrifices into powerful demonically-possessed swords called...  Well, Demon swords.  To do this, a human on the verge of death must read the death song that every person has hidden inside them, which creates a contract for them to sign...  One that binds their souls to a magically enhanced sword...  Only a few of which can take human form afterwards.\\n\\n\r\nAlas, this war ended forty-four years ago, when the warring nations realized the damage these demon swords were causing, and reached a peace treaty to prevent the collateral damage from reaching a point of no return.  Now, in the present day, the stories of demons and sacrifice have faded into legend, and people are just trying to get by, with very few reminders of the conflict left to haunt them.  One of these, a demented homeless veteran of the war, is creating a scene in the middle of the marketplace when Cecily Campbell, a third generation knight who has vowed to protect the city and uphold justice in her late father’s name, is almost killed by this man before a quiet boy with a strange curved sword saves her from him.  Realizing his occupation as a blacksmith, Cecily becomes determined to convince him to make her a sword that’s just like his...  A katana, the sort of weapon from a faraway land, which she believes will aid her in her quest of heroism.  He refuses, but she’ll have to find a way to change his mind, as the past has rapidly began to catch up to their land, and Cecily’s courage will soon be needed more than ever before.\\n\\n\r\nSacred Blacksmith was produced by Media Factory, who, incidentally, are also directly related to MF Bunko J, the company who published it’s light novels.  Both companies are located under the umbrella of the Kadokawa Group, and from what I could tell from Media Factory’s Wikipedia page, they mostly do small jobs for other production companies, especially to Studio Gonzo and TMS.  Out of the titles I actually knew, I couldn’t find any anime credited to them that had their name listed as their primary producer, with the soul exception to this being 2009’s The Sacred Blacksmith, and if that’s indicative of the larger truth, then thank God, because this show looks a bit on the mediocre side.  Maybe that’s kind of mean of me, because I’ve definitely seen a lot worse looking anime than this over the years, but it’s kind of obvious that they had a small budget to work with, and it looks like they probably didn’t know how to handle such a hindrance in such a way that it wouldn’t be too noticeable.\\n\\n\r\nI don’t know what bothers me more...  How cheap this show looks, or how commonly cheap it looks, as it carries a lot of the same visual problems that an anime from the late 2000’s is likely to have.  It tries to juggle it’s budge responsibly, with minimal movement being featured whenever possible in order to save more money for action scenes, but those stationary scenes look lazy as hell, as characters freeze almost right into the background when they’re not talking or reacting to anything, and they often do so while just slightly off-model enough to create an uncanny valley sensation, and the action scenes aren’t great either.  They’re plagued by close-ups and zoom effects to make it look like you’re not just cutting from one stationary image to the other, and while this doesn’t always look too bad, especially if the villain of said scene is represented by some pretty decent CG animation, the amount of cut corners is telling.  Backgrounds can be nice and highly detailed, especially when taking place in the market, but that doesn’t save the characters inhabiting them from looking stiff and lifeless.\\n\\n\r\nIn terms of the visuals, the only thing about this show that really gives it any sense of identity is the design of the main character, Cecily Campbell, who almost seems like she was drawn to catch the eye, what with her striking shade of red hair and highly questionable knight’s armor that looks like it was specifically molded in such a way as to accentuate her breasts(we’ll get to that).  With the exception of the Demon Sword characters, who look like support characters taken from various Final Fantasy games, everyone else looks pretty generic, from the titular blacksmith, who’s only real memorable feature is the fact that his left eye is always shaded differently from his right eye(there’s a reason for it) to the villain, who...  And I realize this is a spoiler, but come on, who wouldn’t see this coming...  Is of course a sinister looking guy with long white hair.  This is an anime, damn it, and you should expect things like that by now.  The non-human villains look pretty good, especially the CG ones, but we don’t get very many of them.\\n\\n\r\nI didn’t really notice the music while watching the series, but I never had any complaints about it either, which I guess is a good thing.  The opening is your standard rock anthem, with Mayumi Goto belting out lyrics about virtue, triumph over evil and the struggle to do so, and while it’s pretty generic, it sounds nice.  Some of the show’s best and worst animation is showcased during the video, clumsily moving between stiff characters in the middle of breathtakingly beautiful backgrounds to characters awkwardly trying to move against said backgrounds.  A lot of the same could be said for the ending song, miracle happy day, which is also nice but generic.  I like how each song is meant to represent a different character, with the opening representing Cecily and the ending representing little Lisa, but the latter has the added benefit of also being the character’s actual voice actor.  As for the rest of the score, it was composed by Terashima Tamaya, and it’s pretty cool overall, especially the epic Kishi no Hokori.  The sound is appropriately medieval, with a lot of drums and wind instruments at play.\\n\\n\r\nWhile the music and animation may not be quite good enough to make an impression on you, the English dub is another story entirely.  Funimation did a fantastic job on this one, to the point that even at some of it’s worst moments, the quality of the acting can still get you through.  While these titles are by no means her first starring roles, it wasn’t until Strike Witches that she started to become a big name in the industry, and her role in The Sacred Blacksmith came right on the heels of that, and if anything, it proved that she could carry a series while moving away from more diminutive characters.  It combines her likeability, strength and sincerity in such a way that it feels almost like a precursor to some of her future roles, like Lucy in Fairy Tail, Asuna in Sword Art Online and Ilia in RWBY.  From what I’ve read, the character of Cecily was a really unpopular one in the original sub, with fans reacting negatively to her due to her big, grandiose talk and seeming inability to back it up, but Cherami’s performance does a lot to alleviate that issue and saves the character, even at her worst in the early episodes.\\n\\n\r\nI’m normally not a huge fan of Blake Shephard, but he does a pretty damn good job as the titular Blacksmith, Luke Ainsworth.  The character is supposed to be really cynical and blase, which Blake captures really well with his lack of intonation and devil-may-care attitude, adding in just enough hopeful or long-suffering vibes whenever necessary.  Monica Rial plays his assistant, a cheerful little girl character who’s generally happy-go-lucky and annoyingly obsessed with his love life, and while this may sound like the kind of role Monica normally gets typecast into...  And it is...  Her casting was NOT a frivolous decision, nor was it just-another-paycheck for her.  She does a lot with this character, and deserves praise for it.  Anastacia Munoz plays the demon sword Ilia, and she does a great job, but oh what the hell, I’m just glad to see her.  I’m a huge fan, and she doesn’t get enough work.  The rest of Funimation’s usual squad of regulars show up at some point or another, with some highlights including Alexis Tipton as a spurned princess, Brina Palencia as a tragic victim of fate, and Colleen Clinkenbeard and J Michael Tatum as probably the only choices that could have made the boring villains more interesting.\\n\\n\r\nAnd speaking of making things more interesting, that’s exactly the kind of task that Funimation had in front of them when they acquired this anime, which is probably why, when they announced the upcoming release, they were not the slightest bit coy about the fact that there’d be nudity in the release that wasn’t there in the original TV run.  I don’t know if that nudity was censored on TV or if Funi just edited it in, but whatever the case, it’s really telling that they went to such great lengths to advertise the presence of some unobscured boobs, although as many forum-dwellers noted back then, it was probably due to the lack of interest that people had for the title.  It’s true that nudity can be used well, and be an essential or at least acceptable part of a story, but in this case, it was very obviously being used as a crutch in order to help sales of the title, much like they wound up doing years later when they accidentally released the censored version of Sankarea; Undying love a few years later.\\n\\n\r\nNow, at first glance, if you’re coming in blind and just looking up the plot synopsis and descriptions of the series, it looks like you’d be in for something awesome.  It’s a show about knights and demons in a feudal setting, starring a cute and well-endowed female protagonist, and it deals with the introduction of katanas into a western society.  There’s a lot of potential there, and you could be excused for going in with some pretty high expectations, even to the point that you’d probably be willing to look past the sub-par animation quality.  The katana worship kind of suggests that there’d be some element of eastern influence creeping into the show’s western setting, or that Luke would have some kind of foreign background that could be explored, or hell, even the plot about the war that took place decades prior to the events of the series could have amounted to some kind of interesting intrigue.  What I’m saying here is that there was a lot of room for cool ideas, and while they may have possibly been exploited to some extent in the source material, they weren’t here.\\n\\n\r\nRight off the bat, this series shows signs of disappointment from pretty much all corners, from the bullshit about swords cutting through other swords to the fact that anything cool about the art of blacksmithing would be largely glossed over in favor of magical weapon creation.  The plot and setting are extremely derivative and offer nothing new or unique to stand out against the thousands of feudal-type anime out there, and the villain is about as boring as you can get.  I don’t even remember what his plan was, and I seriously didn’t care about any scenes dealing with the effects of said plan.  It takes a special kind of failure to make small demons popping out of peoples’ mouths boring, but that’s where we are here, and the main characters aren’t much better.  Cecily and Luke are trapped in a will-they-won’t-they dynamic that never goes anywhere, not that you’d WANT it to, you just want it to go literally anywhere else so you don’t have to listen to their inane bickering and cliched nonsense.\\n\\n\r\nPart of this is of course Cecily herself, who appears to be some kind of joke character, preaching idealistic virtues like justice and compassion, self-sacrifice and heroism, all while proving herself to be ridiculously incompetent, having to be saved at every turn and not being taken seriously by just about anyone.  She kind of reminds me of the protagonist of Now and Then, Here and There, but taken completely out of context to her own detriment.  Her relationship with Luke is full of pure cringe, as she plays the rough, brutish tsundere to his asexual jerk, flashing boob and berating him for accidentally seeing it, blushing and fervently denying any feelings for him when called out, and most insulting of all, trying to weasel out of paying for the katana she wants him to make.  Cap all of this off with a little girl obsessed with playing matchmaker and pointing out how generously well-endowed Cecily is, you’ve got what looks on the surface to be a jumbled mess of bland, cliched elements that nobody was asking for all merged into one show.\\n\\n\r\nSo, is there anything in this show that makes it worth watching?  I think so, but this is the part where things are going to get a bit uncertain.  If there’s anything interesting about this series, then it’s not in the text, but in the subtext, or at least out of what I could read into it.  Now keep in mind that this is an entirely speculative interpretation of the material, so take it with a grain of salt, because there’s quite a bit to unload here.  I didn’t start to pick apart any kind of deeper meaning to this series until the character ilia was introduced(at which point the series does manage to get quite a bit better, assuming you were able to make it that far in the first place) but when I did, I started noticing some very specific subtext, from which I managed to work backwards and figure out the over-all theme of the story, and I’m actually quite confidant about this part of it(my interpretation gets a little shakier later on), where the main unifying idea of the Sacred blacksmith seems to be the importance of self-identity, especially when compared to the indentities placed upon you by others.\\n\\n\r\nThis idea is explored in some surprisingly diverse ways, with the most obvious being the storyline between Luke and Lisa, but that’s kinda of heavy with the spoilers, so I’d instead like to start off with Charlotte, a young girl who begins to make trouble for our heroes halfway through the series.  She declares that she’s a princess, the bastard daughter of the king, and demands her rightful place for the sake of her late mother.  She instead gets refused by her father, and at the end of her arc(mild spoiler alert) she instead abandons her royal lineage and defects to another nation.  This may sound like defeat, but think about what she was trying to do...  She was trying to fulfill the dreams of her mother and gain the approval of her father, but was either of those goals what she wanted?  What would avenging her deceased mother or proving herself to her father have done for her?  I mean, there’s obviously the idea of attaining wealth and status as royalty, but she doesn’t show any interest in that.  Instead, she dropped the Royal title from her name and started over on her own terms, choosing to define herself as an individual.\\n\\n\r\nThere’s also the demon swords, three of which can turn into humans...  Well, four, but we only spend any time with three of them...  And they all seem to fall into the same category, as characters who are burdened with the identities thrust upon them by their creators.  Even the chant that they use to change form explicitly states that their purpose is to slay God, which could be read in exactly that way.  While two of them are also heavily rooted in spoilers, I think we can talk about the first one, ilia, the demon sword who possesses the power of wind.  Ilia has been around since the great war, where she was born on the battlefield, and she’s been responsible for countless deaths, the lives of which were taken by her wielders as well as by people wanting to become her wielder, killing said wielder and taking their place.  She’s sick of being used as a tool of murder, which is why her life changes so drastically when she forges a partnership with the idealistic Cecily, who...  Oh dear, it’s time to start talking about her now.\\n\\n\r\nOkay, so, this is the part where it really becomes a stretch, so bear with me.  The idea of self-identity gets a lot more complicated with Cecily, as it also starts to creep into the territory of sexual identity and gender identity, yeah, it’s that kind of show.  Cecily is a character who’s trying really hard to find out where she belongs inbetween the masculine and feminine aspects of her personality.  Unlike Charlotte, who wants to become a princess for the sake of her mother, Cecily becomes a knight for the sake of her father, even though such an occupation is explicitly shown to be male-dominated, and she’s never taken seriously as a member of their ranks, facing both condescension and open resentment for trying to do what’s considered a man’s job.  I’d even go as far as to assume that her breast plate was molded specifically for the purpose of accentuating the shape of her bosom, as the military considers her more of a mascot or a PR stunt than an actual knight, and in all fairness, she doesn’t do much to prove them wrong.\\n\\n\r\nNow, I’m not the kind of person who sees a sword in a story and says “That’s a dick,” unless I’m making a joke about Bleach or something, but that old symbolism cliche does kind of fit in this case, when you consider just how unsuccessful Cecily is while trying to wield them in her attempts at doing what’s considered men’s work.  Either they break in her hands, or she flat-out refuses to kill, which is both suggestive of compassion which is a traditionally feminine trait, and on a more low-brow note, a sign of impotence.  Yes, I am also including the fact that she’s unable to get the main male character to ‘erect’ a sword for her in my analysis, and you’re welcome for that.  Keep in mind, though, she’s just as bad with feminine pursuits, as she’s uncomfortable with the idea of drawing attention to her looks, and she fails hard at performing house work, and she’s really awkward in any sort of feminine clothes, so it could be said that both masculine and feminine ideals are waiting just out of her grasp.\\n\\n\r\nHaving said all of that, she doesn’t start to grow as a character, to gain more confidence both socially and in battle, until she acquires a female partner who acts as a sword for her, and she’s finally able to perform successfully.  Granted, there’s no actual confession of love or confirmed affection between her and Ilia, but it’s still really easy to read their relationship as a romantic one, with some seriously Utena-esque subtext to back it up.  There are several lines of dialogue that seem to almost deliberately imply something deeper than friendship, although that could have just been Funimation rewriting things.  I don’t know how things between Luke and Cecily went in the source material, but it’s typically not my style to look into things like that, and Cecily really does seem to grow and develop as a person after her and Ilia form their partnership.  Granted, this doesn’t really go anywhere special, as Ilia’s insistence on Cecily continuing to pursue Luke does kind of echo the very Japanese idea of lesbianism being a teenage phase, but I’m just the interpreter, I didn’t write the damn show.\\n\\n\r\nSo, to summarize, The Sacred Blacksmith seems to insist that you can’t become a complete person until you come to terms with your own identity, and in order to do that, you shouldn’t live by other peoples’ standards, you shouldn’t live for the approval or fulfillment of your parents, you shouldn’t try to be more of a man, you shouldn’t try to be more of a woman, you shouldn’t try to live up to the role society has placed on you, and you shouldn’t live according to the rules of your creator...  You are you, and you shouldn’t lose sight of who you are and what you want.  And what if I’m just pulling all of this out of my ass?  What if I’m just reading too far into the material and seeing what I want to see?  Well, that’s incredibly likely, but it would be a damn shame, because that added depth is really the only thing this show has going for it.  On it’s own merits, The Sacred Blacksmith is just about the blandest thing you’ll ever see, with it’s only real saving grace being that it gets less boring about a third of the way through, so I’ll stick to my interpretation, thank you very much.\\n\\n\r\nSacred Blacksmith is available from Funimation, now as a part of the SAVE collection.  The original light novels are not available stateside, but the manga adaptation by Isao Miura are available from Seven Seas entertainment.  It also makes a very brief cameo in the anime Haganai.\\n\\n\r\nIn a general sense, I want to like everything I watch, or at the very least, I want it to be worth liking, and since there really isn’t anything outright awful about this particular title, the fact that I’m able to read something deeper into it helps me to appreciate it perhaps a bit more than it actually deserves.  It’s not one of the worst anime I’ve ever seen, not by far, but the fact that it’s not interestingly bad just adds to it’s lack of noteworthy qualities as part of the reason why I don’t think I’d ever recommend it to very many people.  I guess you might like it if you’re a hardcore fan of either the feudal setting or of Cherami Leigh as an actor, or hell, maybe if you’re going through some crisis of identity and need to watch something that might help you affirm your own self-image, and maybe you’ll see the same subtext and symbolism that I did.  Other than that, it’s not an outright bad anime, but it really doesn’t offer anything that you couldn’t find elsewhere in both bigger and better portions.  I give The Sacred Blacksmith a 5/10.",
            "date": "2018-07-12T15:51:00+00:00",
            "helpful_count": 1,
            "mal_id": 283838,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 3,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=283838"
        },
        {
            "content": "Overall this wasn't anything special for an anime and it was only really redeeming to watch thanks to the story in the last few episodes.\r\nEcchi:\r\nIf you're watching this for the mild nudity ecchi then you will be sorely disappointed. There were very few ecchi scenes and they only happened in the first half of the season. Other than those few scenes, there was no real fanservice, not even a single jiggle. On the opposite side, if you hate ecchi, then this tag shouldn't cause you any trouble other than the very few scenes of randomly showing breasts.\r\nStory:\r\nThe plot twists with the past were pretty decentand the politics in the matter made plenty of sense. The story was probably the best part of the show that actually made it enjoyable.\\n\\n\r\nArt:\\n\r\nThe combat animations seemed strange and wonky at times and didn't feel very natural. Combat was slow, short, and not too entertaining. At times the mouth movements were very chompy when talking (at least for the dub).\\n\\n\r\nSound:\\n\r\nThe volume levels were pretty bad especially in the first episode. Character voices don't stand over the background sounds or music making the characters harder to listen to. On the bright side there was one pretty decent song in the soundtrack that had an epic fantasy vibe.\\n\\n\r\nCharacter:\\n\r\nThe 2 major main characters got on my nerves more often than I'd liked throughout the story. They're both bratty, rude, and senseless towards each other. I never ended up liking Cecily but the blacksmith Luke did become more enjoyable after his backstory was revealed. Lily was adorable.\\n\\n\r\nEnjoyment:\\n\r\nI enjoyed this enough to keep myself occupied with my time. The story again is what kept it interesting and entertaining enough for me to warrant finishing the show.\\n\\n\r\nOverall:\\n\r\nIt's not a terrible anime by any means but it's just not anything special either.",
            "date": "2016-10-07T20:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 231293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4909676.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/trigger_death",
                "username": "trigger_death"
            },
            "url": "https://myanimelist.net/reviews.php?id=231293"
        },
        {
            "content": "\"I hope she dies\" That's the first thought I've ever had while watching this show and that's quite a red flag right there. You know what she said, first thing, listen to this. \"this is the third time, luke.\" He saved her 3 times! 3 fucking times and she's just laughing as if it's not disgraceful for a knight to be saved by a civilian 3 times! What a weak character. There's an anime I adore, World Trigger and one of the protagonist there is weak af, but in there it's handled properly. He doesn't smile like a moron when his weakness gets in theway of accomplishing things. He works and he takes his weakness seriously, he takes it into account and treats it severely because he knows people might die if he didn't. This bitch is all sappy about being saved 3 times in a row by a civilian after mouthing off and mouthing off that she's a knight. Disgusting. And that's just from the first scene! You know what's worst? It turns from trash to shit every episode!\\n\\n\r\nFrom the first episode alone you see what kind of idiot this girl is. In the first episode she breaks her sword, a blacksmith told her it's not a good idea to use it in battle even if repaired since it's an antique (forged with antiquated methods) but she's like (and obviously this stuck with me) oh I can't just use another, this is important to me. \\n\r\nWhat a moron, apparently the value of sentimentality outweighs the value of her fucking life. \\n\r\nAnd she's always shouting her name and rank, stop it! You have a low rank, just say you're a knight and stfu! Also, a family has monopoly over a mineral but the city is called \"Free Trade\" and she always says it, holy christ almighty jesus of the lord! So help me! How the hell did I get through this, I think I deserve a medal or something.\\n\\n\r\nHonestly this would've been at least sorta okay if not for that stupid protagonist that is more a quirk than a character. She's like a cancer cell that became a quirk that grew a body. This solidifies my views tho, if an anime shows you fan service consistently, it's most likely bad, IF it's a fan service anime, then great, if not tho, then you're in trouble. It's not even fan service, but when the protagonist, the foundation of a show is not shown respect, then you know that it's not going to be good. I gave it a shot, you shouldn't.\\n\\n\r\nIt's not worth watching, don't do what I did and gave this garbage a chance. I thought it would get better, it didn't, not til the bitter end.",
            "date": "2018-04-22T10:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 278722,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/nokinoks",
                "username": "nokinoks"
            },
            "url": "https://myanimelist.net/reviews.php?id=278722"
        },
        {
            "content": "First of all, if you are new to anime, don't listen to what I'm about to write. Just download it and you might actually enjoy it. However, for people who have watched anime for multiple years/decades, I simply cannot recommend this series to you.\r\nWhy? Because it's an amalgamate of every trite trope in the anime industry, set as generic fantasy. Nothing original really happens until the whole Lisa/Lisa thing (which is in the last 3 eps of the series), and no one EVER leaves town. There were times in which I liked the plucky, simpleminded, crusader-of-justice Cecily, but there were also times I couldn't standher hackneyed rants. Luke can easily be seen as the archetypal male tsundere character, so nothing much from him either. Anyway, this series is a waste of time if you're an anime veteran, but probably not if you're new to the scene.",
            "date": "2010-02-10T12:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 23118,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/wickedlame",
                "username": "wickedlame"
            },
            "url": "https://myanimelist.net/reviews.php?id=23118"
        },
        {
            "content": "I really love this show. At 12 episodes, I've been able to watch the entire series multiple times and enjoyed it each time. It is fairly lightweight, has a good pace, and has some fun characters. I like the soundtrack - particularly the opening theme and the music for the fight scenes. The dubbing is well timed and the dialog runs the range from serious to humorous to emotional. And then there's the pleasure of seeing bonds of friendship form between the characters and the hint of future romance.\r\nWhat first captured my attention was the character of Cecily Cambell, a teenage, rookie knight who startsout severely lacking in experience and confidence. On the plus side, she has an unyielding, noble heart, great courage, the drive to protect everyone, and compassion for human life. Qualities that I highly admire. She is frequently teased about her large, but not overly large, breasts and her flustered, embarrassed reactions add a charming element as well as provide a certain levity to the show (a little bit of fanservice). Some may dislike her for being initially weak but I find it makes her more real.\\n\\n\r\nPretty much immediately you find the blacksmith character, Luke Ainsworth, is a very taciturn fellow who shows a near complete lack of consideration and empathy for others. Not exactly endearing qualities but...stick with him and you'll find out why. It is going to take someone special, perhaps a particular strong-willed female knight, to draw him out. He is a master swordsman and somehow always seems to be around when Cecily needs him the most. Imagine that.\\n\\n\r\nYou aren't going to find a really deep plot or backstory here and the animation is fairly standard. Some criticisms noted in other reviews are definitely valid. It feels like there should have been more episodes between the 8th and 9th and thus the ending comes sooner than expected. Definitely prepped for a sequel.\\n\\n\r\nWhat I see is a fun little show with some sword play (katanas and demon swords), characters to admire and feel for, the very early stages of a budding romance usually manifest as verbal (and occasionally physical) sparring, and a lot of heart. It's perfect entertainment for me and that's why I gave it high marks.",
            "date": "2011-05-15T12:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 37008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/pabunt1",
                "username": "pabunt1"
            },
            "url": "https://myanimelist.net/reviews.php?id=37008"
        },
        {
            "content": "it's not as bad as the rating or in discussion forum\r\nthe story is interesting, balance between comedy,romance, and have emotional side too\r\nunfortunately 12 eps feels too short, the main story is progressing only in last four eps.\r\nthe art also average-good, i can see much room for improvement, especialy in enemies (the art of enemies like anime from 1990's)\r\ncharacter, rather defect in cecily, the armor is ridiculous (plate of chest follow the shape of breast), and the changes of her role is too fast (from zero to hero)\r\nenjoyment, at least i didn't yawn, it means didn't too boring or grandiose for me\r\nthe disappointing part: this animefrom 2009, i am sure it will end here, even  i hope there is sequel.the novel is difficult to find, still ongoing, the progress like to stop. the story has great potential, it feels too shame if it ends here",
            "date": "2013-03-17T10:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 90013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421158.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wingz00",
                "username": "wingz00"
            },
            "url": "https://myanimelist.net/reviews.php?id=90013"
        },
        {
            "content": "This would be my first review. Ill just skip to what I have personally experienced watching this show. Its kinda mediocre though the story's plot is great and all it wasn't really convened properly in the anime feels like every episode there was that dull moment to it. I was expecting more of like Full adventure action romance but i guess i expected too much of it. Has potential. though its best to just read the LN or Manga",
            "date": "2015-07-01T11:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 191924,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4596273.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/zurgboy00",
                "username": "zurgboy00"
            },
            "url": "https://myanimelist.net/reviews.php?id=191924"
        },
        {
            "content": "A red-haired tsundere who has a crush on her love interest but acts tsundere to him, the love interest is at best have is the strategist of the group, in a fantasy world with magical weapons, demons and or monsters appear and attack the main cast. What do mean this isn't Shakugan no Shana??????\r\nOk all joking aside, LA will say this as bluntly as possible......Seiken no Blacksmith is average at best.\r\nSeiken no Blacksmith is your typical medieval fantasy anime focusing on a fantasy world of magical swords, demon contracts and a knight who needs a new sword from a mysterious yet justifiably gloomy blacksmith...you wouldthink that LA said this statement, this anime would have been great!...it's...it's not. Why? well...let's get on with this shall we?\\n\\n\r\nIn terms of characters, well one of the biggest problem goes to our main characters, Luke Ainsworth voiced by Nobuhiko Okamoto the titular blacksmith and Cecily Cambell voiced by Ayumi Fujimura, Luke's problem isn't his character development as once his backstory and focus on during the current main plot gets, he becomes sympathetic at best and he becomes one of the more well-rounded developed character by the end of it. But the thing is when he isn't on screen or he is in focus, he's essentially the tsukommi to Cecily's boke or worst, he's just hardly in it when it doesn't revolve around him which is about half of the runtime!. Cecily Cambell is quite the opposite however as her main problem is that she's such a one-note character with hardly ANY character development (and when is involved in the plot, most of her development goes either to Lisa, Aria or Luke, not herself, it becomes a problem as we see this fantasy in HER eyes, but she's almost a blank slate aside from her strong sense to protect people but that's it)  and her constant running gag of her big breasts (yes it's one of THOSE anime gags) it becomes extremely grating for any sense of comedy from her though she is constantly jabbed at Luke, Cecily just reacts to everything and is filling in the \"tsundere archetype with the strong sense to protect everyone\" and nothing else. Bad things aside, the other two main characters Lisa voiced by Aki Toyosaki, an assistant to Luke and Aria voiced by Megumi Toyoguchi a magical wind sword gets their proper developments as well as having a point in the majority of the plotlines she's in if it is there's focus on her or not. Quite easily, Aria very quickly became LA's favourite character, due to her being a magical sword and having a likable personality in general. In terms of villains, we do get our \"usual crazy sword-wielding crazies\" here and there and their stock crazy because of the war kind of villains, however the black-cloaked man villain at the start of the anime is essentially the mastermind and this villain doesn't comes into focus until the final arc...so when it comes to villains, their either stock cliche (crazy or wanting revenge) or are more working in the background at best until they need to be there. Essentially it's not the main cast WANTS (besides Aria and Luke as he actually has an excuse due to his backstory) to move the plot forward, it's the villains and by extension the plot itself will move the plot forward, due to this it's more of a slow-moving narrative with the characters having almost no sense of urgency until it's too late and in that sense it brings up constant hints (through backstory as such) throughout the anime that makes it (nearly) predictable like signaling a bloody blaring SOS message later down the line. On speaking of slow-moving narrative...\\n\\n\r\nThe plot at worst is inconsistently unfocused, it has multiple plot points brought up at the start and at the same time it focuses on a new plot point be it from our demons or crazy sword-wielding madmen to our main cast involvement in the plot in general but when it comes to character development, is where the plot's strengths comes from. Although the world building is extremely slow, what slow information they talk about magical swords and the lore they give out is \"interesting\" to the plot at least and brings in that \"medieval fantasy\" it has...not so much \"adventure\" however as the main cast NEVER leaves their city. What's worse is that once a character called Charlotte E. Firobisher voiced by Kaori Fukuhara comes into focus, her \"development\" into the plot becomes almost filler to say the least as besides one-sentence info Charlotte says to Cecily at the end of her arc, her arc has no impact on the actual plot..thus filler...see what LA means by inconsistently unfocused?. GREAT character development when it does god damn focus on them (with Luke, Aria, Lisa and yeah even the mini-filler arc character Charlotte) but slow yet somewhat interesting world building, yet it has constant faffing about and slice of life comedy moments in between all this (and fine you can chalk this up as have a breather episode, but can LA just say that this anime only has 12 episodes...TOO much faffing about is nothing but wasting what little screentime you got Seiken no Blackmsith) when it could have gone into a more focused development on their main cast or it's world building. LA isn't saying devoid itself of comedy, as it can have comedy, it just can't be constant big breasts jokes and annoying character jabbing. Inconsistent. Unfocused as hell.\\n\\n\r\nIn terms of animation done by the defunct (as of writing this) Studio Manglobe and really this is one of their lesser works in terms of animation, it's decent enough this including the colorful medieval-like backgrounds and character designs, however LA says \"lesser works\" from them due to their rather lackluster battle animation, it's at best sword beam spamming occurs a lot and yes there are some swordplay but the majority leads into the sword beam spamming, LA isn't saying that the animation there is lackluster as the animation is great and at least consistent in this regard, it's more so, the \"flow of battle\" is sooo slow and relying on sword beam spamming too much. The animation from a character design to background however is just \"decent\", but nothing to harp on about.\\n\\n\r\nIn terms of voice acting, we have some really good casting from Nobuhiko Okamoto as Luke and Aki Toyosaki as Lisa and even Megumi Toyoguchi as Aria, -sigh- yes LA had a bit of a problem to Cecily and it's not as if Ayumi Fujimura did horrible in this role, it's just more like, there wasn't enough good material for her, LA KNOWS she can do better (See Misaki Ayuzawa from Kaichou wa Maid-sama!), but with what her tsundere stereotype Ayumi had to work with, LA can't blame Ayumi for this role. LA's favourite voice actor quite easily goes to Megumi Toyoguchi for obvious reasons.\\n\\n\r\nWhat the final 3 episodes went into what with Luke and Lisa FINALLY properly focusing on them, the final arc was where it's strengths comes in again however the major villain who's been in the shadows manipulating every other villain the main cast faced in question throughout the anime tucks his tail and runs away at the last minute...YUP it's a \"read the light novel\" ending...-sigh- LA was kinda expecting that. The ending sorta goes with a compromise with a great character development to Lisa and Luke that the anime desperately needed, but ended without a resolve...LA's feelings to the ending goes to predictably disappointed by this ending with \"some\" compromise.\\n\\n\r\nSeiken no Blacksmith is nothing but an average romp into a fantasy medieval world where it's just a lowly knight wanting a sword from a blacksmith and either him or the knight taking down the crazy red shirt/villain of the week. Seiken no Blacksmith has lots of wasted potential as the world building and magical swords are interesting when brought up, the characters that goes into focus becomes the more interesting characters once they do but it's brought down by that filler-character focused arc, constant faffing about and annoying running gags and hardly giving one of your main characters hardly ANY character development and being more as an active spectator than anything else and the \"read the light novel\" ending didn't help. There are MUCH better fantasy animes with magical swords under the same concept, Seiken no Blacksmith?...lacks in execution in many elements in which it's contemporaries and heck predecessors did better.",
            "date": "2016-12-06T15:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 235001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=235001"
        },
        {
            "content": "Seiken no Blacksmith (The Sacred Blacksmith) has a hit and miss ratio with viewers, you might hate it or love it. It took two episodes for me to enjoy, which is fair enough for most stories to introduce the beginning plot. \r\nThe story is a comedy/fantasy adventure. The artwork is quite refined, the background, the stills, and animation can compete with the current modern anime series.\r\nThe sound on my DVD can be watched in original Japanese or English Dub. I had no problem with either, although I prefered to watch in English as a personal preference.\r\nThe intro and ending theme music was catchy anime. Nothingout of the ordinary but catchy with nice Chibi styled animation to accompany the ending credits.\\n\\n\r\nThe story has its turns in enjoyment. It is well written, the script can be hilarious, if you have seen puni puni poemy, then this will be right up your alley, in the style of punchlines. The jokes are throughout the series, there to give light relief to the story and the characters.\\n\\n\r\nThe Story dips midway, but this is fine with me, because the animation was great and the jokes flowed. But this dip in the story does lead into the ending well, has a neat twist which is probably not impossible to guess, but seems it could have several possible endings, and I was happy with the result.\\n\\n\r\nOverall its fun, mature, and simple fantasy setting. \\n\\n\r\n-HOT\\n\r\ngreat animation and dubbing\\n\r\nconsistent full bodied light humoured story\\n\r\nnice theme music and battles \\n\\n\r\n-COLD\\n\r\nfantasy setting and monsters perhaps not intense but still pretty enjoyable\\n\r\nsome of the jokes could be regarded as sexist (depends who you are)",
            "date": "2012-03-15T07:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 56025,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1187975.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/star-debut",
                "username": "star-debut"
            },
            "url": "https://myanimelist.net/reviews.php?id=56025"
        },
        {
            "content": "I heard people badmouthing this anime saying it's no good in my opinion its actually great. The main character Cecili Cambell maybe a goof and most of the comedy areas are based mostly on her breasts she is an honorable knight. People shouldn't expect to much just because of the title. Even though it's highly unlikely it gets a second season I really hope it does it's actually a great Anime",
            "date": "2012-09-05T04:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 71615,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1495051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/kirito1452",
                "username": "kirito1452"
            },
            "url": "https://myanimelist.net/reviews.php?id=71615"
        }
    ],
    [
        {
            "content": "One of the worst animes that came out last year. The trailer and the build up were good, the promotion of the anime attracted alot of attention. None of the words that describe other animes really fit Seikon no Blacksmith. It had the chance and ability to become interesting and good, however the story was rushed and became frustrating as nothing was explained.",
            "date": "2010-04-27T04:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 25505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/260723.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tsuksumi",
                "username": "Tsuksumi"
            },
            "url": "https://myanimelist.net/reviews.php?id=25505"
        },
        {
            "content": "Often I hear reviews about this anime that make it out that make it seem like its not worth the time to watch it. However I feel like while its no masterpiece, its certainly a great anime that's worth a watch if you've got the time. The heroine seem to drag our hero on her adventure despite his protests. I found it amusing that when the heroine asked our hero for a sword he politely told her that if she doesn't have the money she can't have one. \r\nThe main thing that sets this anime apart from all the other anime out there is actuallythe thing that I have the biggest problem with, not to say that this isn't enjoyable its just that I feel like it is done a bit too much in the anime. \\n\r\nThe anime has a running theme that no sword is unbreakable, which is true, unlike what other anime's like Bleach would have you believe, a real sword requires careful cleaning and constant repair to maintain and it is not and unbreakable object. However this anime seems to sometimes take this idea too far, often resorting to it in what seems like every episode in order to make an action scene seem more intense. While I like the idea of an anime where the swords can break, the swords in this anime seem like they are made of hardened glass, and break just as easily. \\n\r\nThe ending is good, but leaves you wanting more not necessarily in a good way. to put in it in a metaphor so that I don't spoil anything, it's like they killed a lion but never entered the lion's den to kill the rest.\\n\r\nConfusing metaphors aside, I did enjoy the anime and feel like it was well worth the time I spent watching it, and while its definitely not on my top ten list, its most certainly an anime  I'll watch again sometime.",
            "date": "2013-09-20T08:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 113523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3174645.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Redd396",
                "username": "Redd396"
            },
            "url": "https://myanimelist.net/reviews.php?id=113523"
        },
        {
            "content": "Who doesn't like a good show that revolves around demons?   Demon Swords?  We've got it!  Demon Contracts?  You bet!  Big Demon dude that is the main enemy?  Of course!  Demon Swords that turn into girls?  Hell yeah!  Demon baddies?  Plenty.  \r\nYou get the main jist of the show yet?\r\n[Story]        [8]\r\n Roughly 44 years prior to the starting point of this anime a great war took place known as the Valbanill War... conveniently named after the instigator of the whole ordeal, the demon Valbanill.  Fast forwardhalf a century and you'll find Cecily Campbell.  Don't know her?  Well you will because she will feel obligated to tell you who she before every fight.  After Cecily breaks her family sword she heads off to find the Blacksmith, Luke Ainsworth.  From that point on is where the main story attempts to kick off.  If the story line lacks anything, its a main focal point... or a goal.  There is one of course but some events may throw you off to what it really is.... to defeat Valbanill.  The demon Valbanill is sealed within a mountain right next door to the city of Housman and the seal is on the brink of destruction, as is the entire country.  He must be either resealed or defeated with a Sacred Sword from the forge of the Sacred Blacksmith... a.k.a. Luke Ainsworth.\\n\\n\r\n[Characters]\\n\\n\r\nCecily Campbell:  She is a Knight of Housman, which she proudly announces before her battles.  Though quite dense at times, she is fiercely loyal to her friends and country and never backs down from a fight.  She also has a thing for Luke.\\n\\n\r\nLuke Ainsworth:  A cold young man with a past he can't let go.  He is the Sacred Blacksmith... or is to be anyway.  Though he displays a cold personality he does truly care about those important to him.  He forges katana's with his assistant Lisa.\\n\\n\r\nArya:  Arya is a demon sword of wind that can manifest herself in human form.  She becomes a very close friend to Cecily.  She was created during the Valbanill War.\\n\\n\r\nLisa:  Lisa is a young girl that lives with Luke and assists him in the forge among other things.  She is with Luke wherever he goes.  She bears the same name and face as the friend of Luke that died 3 years prior.\\n\\n\r\n[Overall]          [8]\\n\r\nThis is an anime that provides enjoyment on many fronts.  It has its weak points but they are overshadowed by the pro's of the show.  In any case, it'll keep you wanting to click on [Next Episode].\\n\\n",
            "date": "2012-07-24T22:02:00+00:00",
            "helpful_count": 0,
            "mal_id": 67639,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/313338.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DemonFangAlone",
                "username": "DemonFangAlone"
            },
            "url": "https://myanimelist.net/reviews.php?id=67639"
        }
    ]
]