[
    [
        {
            "content": "We all have times when we wish we were dead, although we don’t always mean it. \r\nWell, I present you Itoshiki Nozomu. He’s the world’s most pessimistic person and always carries around a rope when things turn badly (by the way, when you write his name horizontally, you will get Zetsubou – despair). Right in the first episode we see Itoshiki hanging himself in some cherry trees and his imminent death is only stopped by Fuura Kafuka, his unequal: the world’s most optimistic person. This is what sets things off and from here on in we will make a journey through current Japan’s society, throughthe eccentric students of this eccentric teacher.\\n\\n\r\nUsually when we talk about smart comedy what comes to mind is a Cambridge PhD that tells jokes that only Stephen Hawking and company can grasp. This series is really something because it is a smart comedy… that allows laughing. Zetsubou has a lot of serious subjects but you never see these treated like a soap opera. The problem is developed with a dark comedy that allows much more reflection about it. \\n\\n\r\nEach character is a takeoff of modern Japan’s problematic citizens: a hikikomori, a perfectionist, a gaijin that suffers prejudice, an addict of cell phones, a stalker, a fan of yaoi and cat ears, an illegal immigrant, a girl that enjoys putting  a stick in a dog’s ass (not sure if the last one is a general problem). The development of these characters may become compromised after the first half, conceding space to nonsense episodes, but this is natural coming from a comedy.\\n\\n\r\nUsually when we see an anime we already know what to expect from the funny parts, they’re virtually the same every time. Again, that’s not the case here. Expect the unexpected. A really unique, cynical, nonsensical comedy.  The color and the lighting is top quality. Also, get prepared to see a lot of cuts, abrupt changes of images, jokes been told on the blackboard or written on the screen. The dialogue is original and the animation is pretty creative and of high quality; moreover, there are a lot of alternative things.\\n\\n\r\nFor example, all the time you’ll see the picture of bald guy around, a Japanese Lex Luthor, that is funny exactly because there’s no purpose for that. There is an episode in which the characters are presented as paper dolls.  The first opening doesn’t even have any image, except that damn bald guy. The second one can mix up Buddhism with bondage (don’t ask me how). The ending is like a surrealistic thriller. It’s a pretty cult comedy by this point of view, because uses a lot of art and animation techniques that you thought you would only find in a more serious anime or in a museum.\\n\\n\r\nWe can call it a harem series when we think that every girl somehow ends up falling in love with the teacher and that the only male characters that have the minimum relevance are a bald guy (another one) and a boy that only read books the entire time.  There’s a lot of fanservice as well, but, one more time, the anime does that in a unique way. It’s almost like it is dissing the fanservice itself.\\n\\n\r\nThere are references to other anime like Lucky Star and Higurashi no Naku Koro ni (and Zetsubou is incredibly similar to Watanuki from XXX Holic).  Furthermore, the otaku world is shown in the traditional Comiket Market.\\n\\n\r\nThe first opening song, Hitotoshite Jiku ga Bureteiru, is performed by Kenji Ohtsuki, who some may remember from the ending of Welcome to NHK.  Now, instead of the galactic crazy baby, there is a song that keeps repeating bure, bure, bure (warped, warped, warped)… whatever.  What’s cool is that there is the participation of some of the voice actors like Nonaka Ai (here, Fuura Kafuka, but also known as Ibuki Fuko in Clannad After Story) and Inoue Marina (here she’s Kitsu Chiri; also made Eve Genoard in Baccano).\\n\\n\r\nIt may be a funny rock – you can’t hear Kenji sing without laughing - but is also a pretty good one, at least the song doesn’t get out of your head.  Most of the OST is performed by Hasegawa Tomoki on the piano, and the majority of the songs are somewhat dramatic, melancholic, romantic, what fits with the dark comedy of the series pretty well.\\n\\n\r\nWhen I finished the last episode I was so gloomy about it that I thought about doing bungee jumping from a two floors house with the rope around my neck cutting my wrists while falling after drinking caustic soda… but  then I discovered that there was a second season and a third coming up this July… there’s still hope… ;)\\n",
            "date": "2009-07-02T05:53:00+00:00",
            "helpful_count": 301,
            "mal_id": 16352,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/192413.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kurodayuchi",
                "username": "kurodayuchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=16352"
        },
        {
            "content": "Despair! I am in it.\r\nSTORY - Story? What story? This is a slice-of-life series and it is based entirely around hilarious character shenanigans, though if you ever see characters like this in your life, I'd be a little worried. Still, there are a few reoccurring themes revolving around anime and otaku snark and satire of Japanese lifestyle, culture, politics, media, literature, etc. They also frequently make fun of themselves, which is incredibly amusing. It's all amazingly well done and highly entertaining, I assure you. A bit of warning through, if you try and pause to read every single thing written in the background for scenes,you will turn 20 minute episodes into 40 minute episodes.",
            "date": "2008-06-05T22:58:00+00:00",
            "helpful_count": 198,
            "mal_id": 5268,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kiriska",
                "username": "kiriska"
            },
            "url": "https://myanimelist.net/reviews.php?id=5268"
        },
        {
            "content": "Normally I'd wait until I've seen all of a series before voicing my opinion, here I'm making an exception. Once in a while comes an anime that pushes all the right buttons for me; Sayonara Zetsubou Sensei does just that.\r\nIt starts with the music: more to my taste, a little harder than your usual cutsy jpop. I often find myself skipping past the opening songs, I hardly ever watch the ending credits and quickly move onto the next episode; here, the music with the animation creates an awesome visual I watch each and every time. I'm sure it's partially due to the style of theart, more manga-esque, more poster art than anime. This style continues throughout; you could say that compared to the rich backgrounds and detail of, let's say, Gendo Senki, Sayonara... can't even begin to compete. But you don't miss the detail, the simplicity and the style of drawing only makes it more graphic and more &quot;punchy&quot;.  \\n\\n\r\nThen there is the story and the characters; it's probably the wackiest bunch you'll ever likely to encounter, if you thought a teacher constantly on the brink of overwhelming despair is strange, you haven't met his students! Each takes a personality trait and blows it completely out of proportion. This is where the fun comes in; I love the self-referencing jokes parodying pop-culture both Japanese and American, the patterns that don't move when the character does, the photo cutouts, and the unexpected, over the top behaviour.\\n\\n\r\nSure, the series isn't perfect, but it gets damn close. All I can say is that I thoroughly enjoyed it and I'm looking forward to the last 5 episodes.",
            "date": "2007-10-06T05:15:00+00:00",
            "helpful_count": 99,
            "mal_id": 988,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6636.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dollie_mixtures",
                "username": "dollie_mixtures"
            },
            "url": "https://myanimelist.net/reviews.php?id=988"
        },
        {
            "content": "I'm in despair! This anime with such a plot that could have been expanded in so many directions has left me in despair! And so begins this disillusioning review of Sayonara Zetsubou Sensei.\r\nThe series is a comedy, blending dark humor with otaku references and some slapstick. It's a very eccentric blend of various comedic styles so it comes off as a novelty and wears off just as fast. The first few episodes are uproariously funny, but once the novelty of the setting wears off there's nowhere for the series to go. Keeping to an episodic structure, no one grows and nothing changes.  A goodcomedy will develop character relationships so it never runs out of tangents. Here it's Nozomu Itoshiki vs. his class. That's all you ever see. It's fun for a little while, but because it never goes anywhere, it gets old in a flash.\\n\\n\r\nAnimated by the (in)famous animation studio SHAFT and directed by creative madman Shinbo Akiyuki, Zetsubou's art takes all the requisite turns expected of it and a few new ones. The problem is it's all very hit-or-miss. Shinbo-san's affinity for blending 3-D objects in a 2-D world shines here, but other elements such as copypastas and the chalkboard gags just annoy, especially since they're only on screen for maybe a second or two and only serve to distract. While some of them are quite funny, the emphasis placed upon them is vague. Should we be looking at the chalkboard or listening to what's going on onscreen? This probably translates better for Japanese audiences, but an American audience relying on subtitles will be hurting to keep up.\\n\\n\r\nThe animation is often very smooth when it needs to be. It's a very unique style that doesn't reflect anything else done by the studio or the director before, which makes it pleasant to view. The only problem is really the character designs. They're either blatantly unique to the world or they just manage to blend in. I swear, I still can't tell Fujiyoshi and Hitou apart &gt;&lt;\\n\\n\r\nThe character designs were not the only problem I had with the cast though. Much of Zetsubou's potential was ultimately squandered in the character department. As Zetsubou is a character-driven comedy, much of the humor relies in the various dysfunctional personalities of teacher Nozomu Itoshiki and his class colliding on matters of society and personality disorders. This is illustrated by giving every main girl a specific and unique disorder and limiting the girls' personalities to only that disorder. It works wonderfully in the case of the sadistically OCD Chiri, but other characters like stalker Tsunetsuki and &quot;I'll sue you&quot; Kaere are less like characters and more like running gags. Thus it comes as no surprise that eventually the chemistry falls apart and one is left wondering if they even had a plan as of what to do with each girl after her disorder was revealed.\\n\\n\r\nThe accompanying music is decent. Noticeable at times, but often forgettable. The ED is pretty good, but it's the OP that's the real treat of the soundtrack.\\n\\n\r\nSayonara Zetsubou Sensei has been receiving rave reviews for the last year and in some ways I can see why. Its comedically nihilistic take on Japanese society, as well as it's inventive style bring fresh air to the myraid of other anime. But ultimately, what potential it starts with is squandered on one-dimensional characters and a repetitive plot.\\n\\n\r\nOverall, I give Sayonara Zetsubou Sensei a 7 out of 10.",
            "date": "2008-10-23T10:35:00+00:00",
            "helpful_count": 68,
            "mal_id": 8884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8731.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Splitter",
                "username": "Splitter"
            },
            "url": "https://myanimelist.net/reviews.php?id=8884"
        },
        {
            "content": "Sayonara Zetsubou Sensei is a Psychological, Slice of Life, Comedy about an extremely cynical teacher trying to spread his feelings and views of despair onto his students. Every episode is usually split up two as each part gives us incite into another one of the students, which means that every episode is different from the last. Seeing all the problems with Japanese culture laid out in front of you, just to make fun of it is not original however this anime is able to do it in such a unique way. With plenty of parodies and random moments, this anime is hard not to laughat. Another interesting thing about this anime series, is its &ldquo;out of the ordinary&rdquo; choice of censorship and how it makes fun of pointless fanservice. These are to sort of jokes anime fans would love to see nonetheless a lot of the jokes do get repetitive, which losses its affect in the latter episodes.\\n\\n\r\nWith every episode focusing on one or two of the teacher&rsquo;s students, this anime does a fantastic job in portraying each of the characters that show up on screen. With so many different psychological disorders and social issues to deal with, the characters never seem boring or clich&eacute;d in anyway. Itoshiki is the main character and he proves to be just that, with his odd mannerism and hilarious moments and even though some of his jokes get fairly repetitive, he still remains funny. \\n\\n\r\nThanks to SHAFT we have a pretty unique animation style. The animation for this anime is basically a mix between superb, shoddy and just plain weird. It is just too hard to go into detail and explain it because it has the same weird conceptual artistic style as this entire anime. The music is an odd contrast of sweet melodies and hard rock, which go well with this messed up anime and it&rsquo;s messed up main characters. Even the OP and ED themes are extremely catchy and you&rsquo;ll never feel like skipping theme.\\n\\n\r\nOverall is one of those Satire comedies that are made with the hardcore anime fans in mind. With so many hilarious jokes churned out, us viewers are bound to find some funny with the rest going straight over our heads. Even though this show gains a merit for being pretty unique, it does end up losing a bit of its appeal later on. So if you&rsquo;ve seen and enjoyed shows like &ldquo;Lucky Star&rdquo; and &ldquo;Welcome to the NHK&rdquo; then you are sure to enjoy this one.\\n\\n\r\n^_^",
            "date": "2007-12-27T06:46:00+00:00",
            "helpful_count": 53,
            "mal_id": 1718,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=1718"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nSayonara Zetsubou Sensei is a show about Nozomu Itoshiki, an extremely melodramatic man whose suicide is interrupted by Kafuka Fuura, a happy-go-lucky, perpetually optimistic girl. Itoshiki turns out to be a teacher, and when he goes to teach his class, it turns out that almost every single one of his students has severe mental problems as well.\r\nNow, the premise is already hilarious enough, and for the most part, the show delivers in terms of comedy and satire.\r\nHowever, the show is admittedly rather formulaic. Almost every episode follows more-or-less the same pattern: A problem/quirk regarding society is shown, Itoshiki rants about it, hisstudents give their point-of-view about it, and Kafuka talks about the positive aspects of said problem/quirk.\\n\\n\r\nThe first few episodes of the first season are dedicated mostly to introducing the characters as well as their associated running gag. Said running gag is as far as their personality goes.\\n\\n\r\nAs such, considering that in all subsequent episodes of the show, the same jokes get reused over and over regarding the characters, and the formula for each episode remains the same, the show gets rather boring for the remainder because they don't really do that much else. However, this only applies to season 1.\\n\\n\r\nIn seasons 2 and 3, possibly because they had already made every joke that could possibly have been made about the characters at this point, the show starts to get out of its comfort zone. We get to see the characters in different settings rather than the classroom/the school grounds, and some episodes even forgo the typical episode formula, which I felt was a welcome change. Despite some arguing that the show got stale at this point, I personally felt that seasons 2 and 3 were better than season 1.\\n\\n\r\nAll in all, I'd give season 1 a 6/10, and seasons 2 and 3 a 7/10. I recommend this show if you're looking for a quick laugh and some good satire.",
            "date": "2015-12-09T14:06:00+00:00",
            "helpful_count": 48,
            "mal_id": 205139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3941949.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/D-ohnuts",
                "username": "D-ohnuts"
            },
            "url": "https://myanimelist.net/reviews.php?id=205139"
        },
        {
            "content": "\"Sayonara Zetsubou Sensei\" is as insane and addictive as it is deeply unorthodox. The usage of: silhouetted characters, extremely polar opposites in terms of the two main characters, constant cuts to text, and a bald, glasses-wearing man for censorship are definitive proof of this. As soon as it starts it already flaunts its relentless and ridiculously funny sense of humor. A strange premise along with a non-traditional visual approach not only make it intriguing but refreshing as well.\r\n  The premise is blatantly and pleasurably off-kilter like everything else in this anime. An incredibly negative and pessimistic person, Itoshiki Nozomu, and an incredibly positive andoptimistic person, Fuura Kafuka, are the two main characters, and they meet each other as he attempts to commit suicide. They are outstandingly different but they must cope it because they are both part of the same school. Itoshiki is the homeroom teacher of Fuura's class and there he encounters a sea of strange students. Each of the students has a unique personality trait or activity that they heavily utilize; all are parodic and stereotypical in their basis and are solely used for the anime's grand satirical goal. Every episode focuses on Itoshiki's (aka Zetsubou Sensei which translates to Mr. Despair) crazy interactions with his students. These interactions hilariously result in either him trying to teach them his bleak lessons, or him being convinced that he is living in complete and utter despair due to one of their remarks or actions.\\n\\n\r\n  \"Sayonara Zetsubou Sensei\" uses satire in much of its comedy. Much of this derives from it darkly satirizing Japan and all the common people, groups, and events that it has in it. Characters that possess or partake in: suicidal thoughts, extreme isolation, domestic abuse, disturbing perfectionism, stalking, illegal immigration, non-conformist mentality, material worship, and severe identity disorder may be taboo topics for other anime but it's just a wonderful comedy playground for \"Sayonara Zetsubou Sensei\". Much of this said humor consists of social commentary, parody, or just outright references regarding Japanese culture, so the anime can be alienating. Viewers might want to do some light research, seriously read the TL notes, and at least get a basic understanding on how Japan works or who usually inhabits it. However, being very knowledgeable isn't necessarily a requirement to enjoy or be entertained by this anime. Even the viewers who aren't too knowledgeable can still witness the insanity and high energy that makes it feel so high-octane and exciting.\\n\\n\r\n  The art is colorful and flamboyantly atypical. Akiyuki Shinbo, the director, along with the anime's main production studio, Shaft, definitely show off their usual eclectic style here. Intriguing color changes and silhouettes run rampant in each episode. There is not much actual animation in \"Sayonara Zetsubou Sensei\", but it compensates with its interesting art style. There are different textures flying in and out in just about every frame. The fast and unusual fashion that it uses completely fits the insane antics and gags that constantly ensue throughout the anime.\\n\\n\r\n  The opening themes and ending themes used are great and are definitely adequate for the anime. \"Hito Toshite Jiku ga Bureteiru\" by Kenji Ohtsuki, featuring five of the female voice actresses, is the best particular song and is a delightfully catchy and maddening rock song; passionately pumping the crazy mood that the anime creates. The rest of the soundtrack that accompanies the anime is competent and conjures each of its desired emotions well.  \\n\\n\r\n  The entire run of this anime is an entertaining frenzy that deserves much appreciation for both its art and excellent ability to create laughter. Enthusiasts of absurd and black humor, as well as successful satire, should definitely give this anime a try. \"Sayonara Zetsubou Sensei\" is a deranged, neurotic, and enjoyable absurdist and satirical comedy that nonchalantly criticizes everything in its broad Japanese path without ever taking a single break. \\n\\n\r\nEight Durable, Stout, and 'Height-Helping' Pink Gabriel Trees out of Ten.",
            "date": "2013-07-19T03:58:00+00:00",
            "helpful_count": 47,
            "mal_id": 105947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332859.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/albinochocolate",
                "username": "albinochocolate"
            },
            "url": "https://myanimelist.net/reviews.php?id=105947"
        },
        {
            "content": "Depression is often times (well, always) a serious topic.  Suicide is almost a taboo in our modern society.  Along with these, there are a whole slew of social problems that we see around us.  These topics should always be handled delicately, because many people would be offended if they weren't.\r\n\"Sayonara, Zetsubou Sensei\" takes this sentiment with a grain of salt.  Our lead character, Itoshiki Nozomu, is a depressed, suicidal teacher who always views things in the most negative light.  His class, sadly enough, has more problems than he does; the students range from a hikkikomori to a balding boy wholiterally disappears from a lack of presence.  The show details Nozomu's attempts (mostly failed) to teach his class about life and society.\\n\\n\r\nStory:\\n\\n\r\nAs you can see above, this show does not have that much of an overarching story.  While some elements of an episode may be referenced in later episodes (often hilariously), the episodes all have contained stories.  This first season is primarily focused on introducing the characters.  The stories in the episodes feature elements of life, parts of Japanese culture, or Japanese phrases, taken to the logical extreme in a satirical manner.  I enjoyed this format quite a bit (though others might not; it depends), and gave it a 9.\\n\\n\r\nArt:\\n\\n\r\nBeing a show created by Shaft, \"Sayonara, Zetsubou Sensei\" features Akiyuki Shinbo's distinct animation style (there's even an episode in a later season that explains and deconstructs his style).  Now, Akiyuki Shinbo's usage of quick cuts to blocks of text and frequent color-replacing may not appeal to everyone, but it certainly does for me.  The artwork in this show is sometimes inconsistent (to create humor).  Also, Shinbo always likes to put random things into his shows, and this one is no different.  Every single shot with a blackboard in it probably has a shout-out or reference of some sort displayed on the blackboard.  He also likes to use the \"Sayonara, Zetsubou Sensei\" manga author's face (mostly as a censoring device, but also on the school's clock, and randomly inserted elsewhere), and he even appears as a character (voiced by himself).  This random style really appeals to me, which is why I gave it a 9.\\n\\n\r\nSound:\\n\\n\r\nHiroshi Kamiya does a great job voicing the character Itoshiki Nozomu, and is always a delight to listen to.  All of the other voice actors/actresses do marvelous jobs as well.  The soundtrack is not bad; it helps to set the mood and isn't annoying to listen to, but it does not have any outstanding tracks.  I give sound an 8.\\n\\n\r\nCharacter:\\n\\n\r\nAlmost all of the characters are interesting.  We have suicidal teacher Itoshiki Nozomu, positive girl Fuura Kafuka (pen name), and a ton of other characters with their own unique quirks...although they're almost never unique; they're either extreme versions of a stereotype, or a subverted version of a stereotype, but stereotypes nonetheless.  However, the charm of these characters is not in their depth (because they're all pretty shallow characters).  One of the best parts of this show is the interaction between the characters, and their dialogues.  Because these interactions, to me, were very entertaining, I give Character a 9.\\n\\n\r\nEnjoyment:\\n\\n\r\nI really enjoyed this show, it's satirical story and dialogues, its random art style and animation, and the voice actors/actresses performances.  I give Enjoyment a 10.\\n\\n\r\nOverall:\\n\\n\r\nI really enjoyed this show, but others might not.  For one, the themes and issues addressed in this show may be a little disconcerting for some.  Others might not like Shinbo's strange animation style.  The lack of a good story may also be a turn-off factor for people (I myself was a little disappointed that there was no good ending, even at the end of the third season).  I recommend that you watch an episode or two, because the first episodes give a pretty good idea of what's in store for future episodes.  You might love it like I did, or you may hate it to death, but in my opinion, it's a unique, quirky piece of art that should not be missed.\\n\\n\r\n9/10",
            "date": "2013-09-20T20:05:00+00:00",
            "helpful_count": 34,
            "mal_id": 113605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2867285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BlindPenguin",
                "username": "BlindPenguin"
            },
            "url": "https://myanimelist.net/reviews.php?id=113605"
        },
        {
            "content": "I can see why most people liked this anime, but it’s not my cup of tea.\r\nThe first few episodes made me laugh due to the absurdity and the character introductions. At episode 9 I really felt like dropping the series but in the end I do like the fact that I watched it all.\r\nArt (7/10): The art is very good at first, the surroundings were drawn in a way that I felt like it could be real. However other animations are also introduced, I liked some of them, I really disliked others. There’s also this bald guy popping up every now and then. I guessit’s supposed to be funny but I really can’t look at the guy’s face (though I have to admit I have a strong dislike for beards, being bald and having a beard makes my dislike even greater).\\n\\n\r\nEpisodes were often interfered by short little weird movies. Yes, I guess you could consider those funny, but they didn’t make me laugh. Actually they rather confused me.\\n\\n\r\nStory (-/10): absent.\\n\\n\r\nSound (8/10): The music did not fit my personal taste, but it did fit in the anime and it’s animation. So yes, the sound is good for the series it is used in. One of the things that did made me laugh (out loud) were the little happy sounds that seemed to accompany Kafuka Fuura. I only noticed those little happy sounds in the first few episodes though.\\n\\n\r\nCharacters (9/10): Characters are all introduced in an unique way. Their way of living brings along some complications, but that makes it interesting. I liked the characters of Kafuka and Maria, but Kafuka seems to lose her optimism as the episodes pass (similar to the loss of pessimism of Itoshiki) and Maria eventually scared me. But being able to say that means the characters are pretty well set up. Each of the characters is intriguing in its own way.\\n\\n\r\nEnjoyment (5/10): the anime did have a nice and unique style, but for me, personally, the absurdity didn’t manage to keep me interested. I believe that I am not “open-minded” enough to truly like this series. Also I am probably too simple-minded. The anime seems to be criticizing itself a lot, but instead of thinking of that as funny I totally agreed with the critique. I also would have liked the series more if it at least had a basic storyline.\\n\\n\r\nOverall score = 6 (However I’d give the first few episodes a 7)\\n\\n\r\nEven though I didn’t really enjoy the series, I do believe you should give it a chance. You might like it, you might not. You’ll never know for sure if you don’t watch!",
            "date": "2010-08-09T02:54:00+00:00",
            "helpful_count": 33,
            "mal_id": 29449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366018.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Alinhje",
                "username": "Alinhje"
            },
            "url": "https://myanimelist.net/reviews.php?id=29449"
        },
        {
            "content": "This anime starts off as a pretty straightforward humor/harem anime.  The episode is divided into two sections, and each section introduces a student who has a strange personality quirk, such as always being optimistic, or only communicating via text message.  This was okay to get to know the characters, but by the end of the second episode I was wondering if this was all the series was going to be.  Luckily, around episode 4 or 5, it broke out of that mold.\r\nIt still kept the two section format, but instead of simply introducing characters one per section, it would just place themin a situation.  My only real complaint is that there was little to no continuity between episodes.  Many of them could have been viewed in any order(except for the early ones introducing characters) without missing anything.  This put me off for the first half of the series, but by episode 7 or 8 the unique sense of humor this series has began to grow on me.\\n\\n\r\nYou'll find yourself reaching for the pause button fairly often, to stop and read the funny text written on the blackboard, on the wall, and other crazy places.  The writing often contains references to other anime and manga, or crazy off-the-wall statements that you can't help but burst out laughing at.  Even if, like me, you need to pay attention to dialogue the first time you watch an episode, you'll find yourself watching it a second time to make sure that you don't miss any of the hilarious text.  I believe that's what gives Sayonara Zetsubou Sensei its charm.\\n\\n\r\nI would reccomend you watch this if you like strange humor, but not if you're sensitive to humor around things like student-teacher lesbian suggestions, or a panty shot character.  Also, for a while in the middle of the series, the opening credits contained bondage pictures involving the students.  Don't be too put off by that though, as the majority of the humor in the series doesn't revolve around sex.  I'm not a huge fan of just for laughs anime, and I still enjoyed this.  I'll definitely be coming back for season 2.",
            "date": "2008-01-02T10:08:00+00:00",
            "helpful_count": 30,
            "mal_id": 1811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9174.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tigger89",
                "username": "tigger89"
            },
            "url": "https://myanimelist.net/reviews.php?id=1811"
        },
        {
            "content": "There's good anime, and then there's crap anime, this one being the latter. I went into this anime expecting something quick, enjoyable, and funny, seeing that all the previous reviews gave it high ratings and some of the similar recommendations included stuff like 'Welcome to the NHK' *which also involves subjects like the hikikomori and is meant to be comedy*. However, I quickly realized this anime would not be one of those fun watches.\r\nI forced myself through 5 episodes before I dropped it. The second I started watching this anime felt like my I.Q. dropped 10 points. \r\nSTORY: There is no story. Its completely pointless.Sure, its a slice of life, and a lot of these animes don't have a strong story... but this is just pure, annoying randomness. \\n\\n\r\nCHARACTER: Pathetic. An annoying lead an a bunch of cliche 'cutesy' anime girls trying to be funny, an attempt which fails miserably. \\n\\n\r\nENJOYMENT: 1. Pathetic. This is pure torture. \\n\\n\r\nOVERALL: I hated what I watched of it. It joins the ranks of annoying, pointless animes such as Lucky Star. Ugh. \\n",
            "date": "2009-01-24T18:56:00+00:00",
            "helpful_count": 29,
            "mal_id": 11812,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33917.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/amade0",
                "username": "amade0"
            },
            "url": "https://myanimelist.net/reviews.php?id=11812"
        },
        {
            "content": "\"Sayonara Zetsubou Sensei\" opens with a teenage girl happily walking in a small forest of cherry trees. Suddenly however she stumbles upon a horrifying sight - a young man hanging himself on one of the trees. Now that's SZS in a nutshell. I could easily end this review with those 2 sentences and it would still be a detailed and informative review. \r\nHowever, I think that even though SZS lacks a real story, it still deserves a decent and elongated review because, if it had a good background story - it would have been a masterpiece. SZS is a slice of life anime, so theissues presented here are not pulled out of someones' ass, they are real issues that people, nay, the entire world has to deal with. For example, every character in this anime is a visualisation of Japan's culture and problems. However, some characters are also presentations of other cultures like Kaere Kimura, a returnee with a split personality disorder. \\n\\n\r\nThe main character, Nozomu Itoshiki is a highschool teacher and he presents the traditional culture of Japan. He's a proper gentleman, he wears a hakama, reads and writes a lot of poetry (one of his favourite plays is \"The love suicides at sonezaki\") and consideres suicide to be the highest expression of love. After meeting a Hikikomori girl, he remarks on how beautiful she is and then writes her name down in his \"Perfect Suicide Partners\" book. At this point I imagine some of you might be going \"WTF\". However this is just the beginning, throughout the first season Itoshiki will attempt numerous suicides and will always be saved by one of the girls from his school. That always sends him into despair. In other words, while educated and proper, Itoshiki is a man waiting for an occasion to kill himself. He may be a representation of the high number of suicides in Japan (Japan has the 5th higest suicide rate in the world). \\n\\n\r\nWe have a character like Fuura Kafuka, who is overly optimistic, and considers Itoshiki's suicide attempts as his means of \"getting taller\" (I kid you not!). We have Harumi Fujiyoshi who is a yaoi fangirl and is always there to imagine a pairing of Itoshiki and... some other guy. Then we have Meru Otonashi, a super shy girl who communicates using mobile phones. While she is shy, she's also a very rude and harsh person, usually insulting everyone around her who happens to posses a mobile phone. There are dozens of more characters on the way, and to describe them all I'd need about a month. Therefore, I'll quickly sum them up - there's a girl who likes to pull animal tails, we have a girl who is a perfectionist, a girl who is an illegal immigrant, a girl who has a guilt complex, a girl who posts photoshoped images of herself on the internet and last but not least... a girl who likes to put sticks in dog's asses. Cute isn't it?\\n\\n\r\nWell, after watching the first 2 episodes I felt like hanging myself actually. Not because this series is bad but because it's painfuly true. And what I mean by that is that many of us try to think positively and we consider most things in this world to be beautiful. This series however proves that that's just a foolish stance in a world where nothing matters.  While many describe it as a satirical series that aims to lighten up the mood, it will do everything but that. It will most likely leave you clawing your own throat out (100 points if you can get the reference). \\n\\n\r\nNow that I've talked about the story and the characters, I will discuss the Sound and the Art style. The soundtrack is depressive, it's something that you'd expect to find in Higurashi or Princess Mononoke. It will grab your brain, spit on it and throw it into a fruit mixer. The feeling you get while listening to some of the tracks is profound, I'd go as far as to say that you'd feel equally depressed listening to Titanic's violin theme. But there are funny themes too (and funny sounds), it's just that depressive far outbalances happy. \\n\\n\r\nArt is is a bit confusing I have to admit. The scenes change very quickly and there are a lot of jokes written everywhere, but the transition is too quickly for anyone to be able to read them, so don't. Unless you want to spend 3 hours on each episode. As for quality - it's good considering the year SZS came out so I don't have any compliants, and to be honest I'm not much of a expert on art so I wouldn't complain anyway. \\n\\n\r\nFinaly enjoyment -\\n\\n\r\nWell, did I enjoy it? Yes. \\n\r\nAm I in a good mood? No.  \\n\r\nSimple as that.\\n\\n\r\nNow if you'll excuse me, I have to find a decent tree to hang myself on.",
            "date": "2011-06-17T07:11:00+00:00",
            "helpful_count": 23,
            "mal_id": 37971,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=37971"
        },
        {
            "content": "Sayonara Zetsubou Sensei is RANDOM, DENSE, COMPLEX, SIMPLE and over-all RIDICULOUS! [I mean it]\r\nI won't praise it all much and will state what you're going to find here.\r\nSZS is full of gags and random jokes. It includes long and short \"debates\" and discussions over a particular topic. The topic can be very interesting or very dumb, making some good points or useless talk. It's full of ups and downs and everywhere in between. It's all talk and no action. But smart talk.\r\nMany mention there is a lot of dark humour....but it's not that much. There are dark terms, light terms, silly terms, complex terms, sometimesecchi terms, Japanese terms, Non-Japanese terms and the list goes on. You will always find a term your familiar with, which makes it even more funny.\\n\r\nCharacters problems are always a hot topic of discussion. So in that sense it could be considered dark.\\n\\n\r\nHere's how it goes :\\n\r\nThere is no story to it. There is this high-school teacher who wears those yukata-thingies all the time. He is the most pessimistic person around and believes that he is always in despair. Picking up the most simplest things, the really complex ones and somestimes really dumb things in life, describing it in a negative manner and putting himself in despair. He despairs on his name as well (which will literally translate to Mr. Despair/Despair Sensei when written horizontally). Always trying to hang himself when he's in the mood.\\n\r\nBy his side are some very 'different' (weird) students of his class.\\n\\n\r\n[All the episodes are the same and not related to each other at all so you can see it in any order. All the seasons and special episodes are the same as well. Only Goku Sayonara Zetsubou Sensei has an actual 'story']\\n\\n\r\nCHARACTERS :\\n\r\nAre the most important part. It's full of colourful and not-so colourful characters. Each of them contributing to these discussions. They are the fun part, the humour, the despair. Most of them are girls, so it's sort of a harem (nothing like THAT)\\n\\n\r\nENJOYMENT :\\n\r\nWell kids won't enjoy or even understand the anime. If jokes made on talks interest you, you will like this. Perhaps you would like it alot or find it very boring. Thats up to every individual.\\n\r\nWhen I saw it first, I didn't even feel like completing half of the episode..but then I lingered back and saw it and really liked it. I think it's smart and rather funny. If you like a few episodes, you will like it all. Because all the episodes are the same.\\n\r\nThe Openings are great by the way. Kinda funky! (Sang by the voice actors themselves)\\n\r\nEnjoy in despair :)",
            "date": "2013-04-19T06:11:00+00:00",
            "helpful_count": 20,
            "mal_id": 94245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1313823.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheFlowingStream",
                "username": "TheFlowingStream"
            },
            "url": "https://myanimelist.net/reviews.php?id=94245"
        },
        {
            "content": "SAYONARA ZETSUBO SENSEI tells the story of a depressed teacher named Nozomu Itoshiki (whose name means \"beyond hope\" or \"despair\"), who leads a class of students who are just as mentally disordered as he is. There's a perfectionist schoolgirl who hacks at everything she deems imperfect, a mute girl who only spews abuse through her phone, a stalker fixated on her beloved teacher... and the most dangerous of them all, the cute but psychotic girl who sees everything in an optimistic but insane manner, which ultimately boomerangs on Itoshiki and almost always lands him in trouble.\r\nThis show has a simple enjoyable premise and some interestingcharacters, but beneath it lies the ultimate in Japanese satire. It hosts all the classic elements that make up a great satire: eccentric characters in absurd situations, which center on a commentary on some fault... and in this show, nearly everything gets held up for fault-finding. The show pokes fun of a vast variety of issues: the cast and the mental disorders they are named and based on (eg Nozomu Itoshiki), word puns (flipping switches in people), the social afflictions plaguing Japan (trolling), well-known films, and even itself on a few occasions.\\n\\n\r\nThe sparkling and biting wit is one of the best things about this show, and is wonderfully backed up by stellar animation, enchanting music and a wonderful voice cast. Hiroshi Kamiya is an instant hit as the titular Zetsubo-Sensei, who stumbles through situations with a wonderful range of despair and humor. He is expertly partnered with Ai Nonaka as Kafuka, the incredibly sweet but twisted schoolgirl who loves Mr Itoshiki and loves to make him miserable.\\n\\n\r\nThe show is not flawless, though. Much of the humor is based on Japanese culture (eg the name of Nozomu Itoshiki), and so it would be hard for anyone not familiar with Japanese culture to understand it, let alone laugh at it. Also at times, there is a sense that if this story took itself more seriously it would be better than how it has turned out. And around the show's third season, things start to feel worn and dull; it should be noted that at the time the studio was having production problems, but you could only do a fairly one- note satire comedy for so long (look at SOUTH PARK and the not- always- great changes it's had to go through in its long run).\\n\\n\r\nIf satire is your forte, then this show is for you. Even if it isn't, it's still got some great stories and characters to watch and enjoy... and it will leave you in despair at how good but unknown it is.",
            "date": "2015-06-09T09:21:00+00:00",
            "helpful_count": 14,
            "mal_id": 189931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647970.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Haneken2086",
                "username": "Haneken2086"
            },
            "url": "https://myanimelist.net/reviews.php?id=189931"
        },
        {
            "content": "Im sure there are lots of people who would enjoy an anime such as this and unfortunately I am not one of those people.\r\nThere are always people who feel like dying and would go so far as to write a note or go to the top of the building or prepare to hang themselves. These people usually aren't serious, those who are, are first of all cowards and stupid. They believe that it takes courage to die however, they are wrong... It takes courage to live.\r\nNow after sharing that with you let me say that this anime was rather boring for me. I king offorced myself wo watch two episodes a day just to finish it.\\n\\n\r\nFrom the first episode you can see this anime had a lot of potential but I don't think they used it properly. The whole thing is basically about a teacher trying to repeatedly find an excuse to kill himself and without serious intent.\\n\\n\r\nThey only thing that I found remotely funny would be \"IM IN DESPAIR\". This phrase is what got me into this anime in the first place.\\n\\n\r\nThere is no story mainly because it is a 'slice of life' anime.\\n\r\nThe art was good but for me it wasn't great.\\n\r\nThe voice actors are again descent but not great.\\n\r\nNozomu was the only character I liked.\\n\r\nI didn't really enjoy this anime all too much.\\n\\n\r\nIf you are a fun of comedy try this a recommend it however, if you hate soft, gentle comedy then avoid it. If you are someone who needs something strong to make you laugh then this is a no no. The comedy level here is rather weak. It's nowhere near compared to 'Gintama'.\\n\\n\r\nI hope you found this review helpful :)\\n\r\nFeedback greatly appreciated\\n\\n\r\nStory: 3/10\\n\r\nArt: 7/10\\n\r\nSound: 7/10\\n\r\nCharacter: 5/10\\n\r\nEnjoyment: 5/10\\n\r\nOverall: 5/10",
            "date": "2010-01-05T09:09:00+00:00",
            "helpful_count": 14,
            "mal_id": 22092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DMDetonator",
                "username": "DMDetonator"
            },
            "url": "https://myanimelist.net/reviews.php?id=22092"
        },
        {
            "content": "Well, I'm not a native speaker and this is my first review here. So please forgive me if I make any mistakes . ^¬^\r\n  Sayonara Zetsubou Sensei is by far the most interesting series I've seen in a while. It really brakes the whatever we may call \"normal anime patterns\" in a very original way. Starting with the story, which does not exist, not in a normal way. The following episode has nothing to do with the previous one. Sometimes, even the second part of the anime, doesn't seen to follow the first one, but every slice of the story can really getsyour attention, in addition to a lot of laughs.\\n\\n\r\n  The Sound and Art are not state-of-the-art, but they are very appropriate for the anime. You can feel the real atmosphere of the anime through the ED/OP songs. The art is impressive, the characters are very well-made and the scenery is awesome. Throughout the scenery you can see a lot of information, sometimes there are so many things that you have to pause in order to see them. Ok, you're not supposed to, but if you do this I can assure you'll get some extra laughs.\\n\\n\r\n  Characters are the critical point of this anime. Each character has a distinct peculiarity like, being a stalker, a suicidal person or having a personality disorder and a lot more characteristics that you might never see, in a funny way, on other animes .\\n\\n\r\n SZS is the kind of anime that makes you think about it in a real context of life. Only enjoyment awaits you. Watch it. x ]",
            "date": "2009-03-11T07:17:00+00:00",
            "helpful_count": 12,
            "mal_id": 13115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/121171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dellano",
                "username": "Dellano"
            },
            "url": "https://myanimelist.net/reviews.php?id=13115"
        },
        {
            "content": "Don't call me biased reviewer, I tends to be really cocky on series. This review might be find else where, since I can't just write different review all over again, in different forum. Remember, I only use same username for all the forum, (Goo4) so please don't freakin tell me that it is copied.\r\n-----\r\nZETSUBOU SHITA!! Everyone should have shouted this at least once in their life. But there is someone who has gone into extreme, and even tries to suicide himself for ridiculous reasons. \r\nThe anime, Sayonara Zetsubou Sensei (aka. SZS), is considered to be the most random anime in existence. You cannot predict howor when it will end. Story? What story? Discussing plot of this anime is meaningless. However, I can say, humours and word plays in this anime is just BRILLIANT. Kometa Kouji, who wrote the original manga, is fuckin genius. He tries to distort every single aspect of Japanese Society into something… ar… DESPAIR?\\n\\n\r\nSZS is fully consists of satirical comedies. Start with our Zetsubou Sensei, when we see him tries to hang himself for some foolish reasons like ‘my transportation card did not properly recognised’, we laugh at him. It’s not just humour, but satirical humour. It reveals how foolish killing one self is. This anime brilliantly has done those. \\n\\n\r\nSometimes, it shows floods of examples to support that satire. It usually appears with floods of texts and it might hurt your eyes. This could work as one boring factor for this anime if you don’t know much about the culture of Japan or others. BUT if you can understand those, you will enjoy it too. Also, there are a lot of bloods and fanservices in this anime. Hell, but they are all for good fun of randomness.\\n\\n\r\nArt is one aspect that will please your eyes. Simply beautiful. Although, the character design looks simplistic or inconsistent, SHAFT's uniqueness covered this negativeness brilliantly. First, there is bald guy called 'Maeda', flying all around during the episode. Also, if you are otakuistic enough, you will be able to find tons of references from other anime, manga or events. Hilarity. There are tons of vector style art shown. Slideshowtic monochromes with the texts are also the elements that entertains our vision. \\n\\n\r\nSound is similar to art. Lot of random signals are there, sometimes, totally irrelevant sounds such as scream of ‘monkey’ randomly comes out. It creates even funnier atmosphere throughout the whole anime. \\n\\n\r\nAlso, OP and ED. Very unique. OP animation for first three episode is… blank, or occasional freakin bald guy or copy and pasted articles. After third episode… op animation can be VERY DISTURBING for some people though it was very creative. Op was sung by Kenji Ohtsuki, who also did famous ending theme for Welcome to the NHK. Ending animation also shows how unique animation style that SHAFT has. I enjoyed a lot.\\n\\n\r\nAha, the most important aspect of this anime, CHARACTERS. They are all extreme cases of phenomenon found in Japanese society. Extreme case of negativity, extreme case of perfectionism, extreme case of Hikikomori, extreme case of yaoism, extreme case of spirit personality… etc etc… Very stereotypical characters, but when all of them is in group... INSANITY. All the characters are lovable and unique themselves. Truely inspirational.\\n\\n\r\nVoice acting; Superb. Kamiya Hiroshi's ‘Zetsubou Shita’ stings on our heart deeply. A lot of other voice actors/actresses are also great at their role.\\n\\n\r\nI enjoyed this anime a lot. But, I have to say that this is NOT an anime that everyone likes. A lot of incomprehensible will make this show boring for some. Also, having little knowledge about Japan will decrease the humour in this anime dramatically. There are few segments that even myself thought ‘bah, it’s pretty boring’. If you haven’t watched many animes, you will miss out most of the references and get annoyed. \\n\\n\r\nAlso, this anime got lots of rave reviews from other countries like China and Korea, for being ethnocentric. There are few moments that even myself (Korean) felt, 'WTF THAT'S NOT TRUE'. \\n\\n\r\nBut, whether it annoyed me or not, fuck it; enjoyment 10/10\\n\\n\r\nSo, to sum up, Sayonara Zetsubou Sensei is a rare kind of anime you can't miss. If you want anime, with filled with satirical gags with full of despair, here it is; this is an anime for you.\\n\\n\r\nHmm... so the last word;\\n\\n\r\n“絶望したっ!”",
            "date": "2009-11-27T02:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 20889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/225515.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ringoo4",
                "username": "ringoo4"
            },
            "url": "https://myanimelist.net/reviews.php?id=20889"
        },
        {
            "content": "Writing a review for the Zetsubou series, is like writing about MC Escher's stairs. The concept is cool, the art pulls you in, and every time you look at it, there's something new you didn't quite catch the first time.... But you have absolutely no idea why it was made, or what the hell is going on. Zetsubou is one hell of a wild ride, mixing so many thoughts and ideas you always knew about, but never questioned. It pushes boundaries, and creates an experience most viewers wont soon forget.\r\nNow, if your looking for a deep plot with involving characters and a decent conclusion, thenZetsubou is probably the last place you would want to look, mostly because the plot is non existent, or barely there. The entirety of the story is: A teacher, who has a bit of a suicidal tendency, does \"stuff\" with his class. And when I says stuff, thats what i mean. No episode is connected to another and in fact, most go through 2 - 3 stories over the course of the episode. Thus the point of Zetsubou, isn't so much to create a story telling experience, it is more of a show that addresses modern day problems and discusses what we do about them. Now, that may seem like a very broad range of topics to cover, but Zetsubou is more than up to the task, talking about some of the least thought about topics and throwing them out into broad daylight. This doesn't really count as a story or plot... but its definitely enjoyable and heartily worth watching for this aspect.\\n\\n\r\nAnother aspect to look at is the characters, which there are a lot of. Each character is fascinating in the fact that they all have one and only one trait about them. This trait is so prominent that it is usually easier to remember each member by that trait rather than their actual names. There's the perfect girl, happy girl, abusive internet girl, girl who loves cute tails, stalker girl, illegal immigrant girl, returnee girl who has a split personality etc etc etc. And of course you have despair sensei himself, Zetsubou, who all in all is a pretty similar character to his class in that he really only has one trait. His trait is... a want to commit suicide, but a fear of death you could say. Hes a very hypocritical character and very entertaining to watch. Now i haven't really said much about the characters aside from their one trait, and that's because the only real way TO review them is to state off their characteristic. Some could say that because of their singularity, they aren't exactly great characters, but the way that this story is told, the episodic nature of the series in general, makes these characters the perfect fit. You'll always pick out your favorites and give a little shout of joy every time its their turn to say the line. Overall, the cast is simple, yet very effective. \\n\\n\r\nWhere Zetsubou falls a bit short, is in its humor. Now don't get me wrong, this show has many many funny and random moments will have you flailing on the floor in fits of merriment at the sheer stupidity of it all. But the problem with it is, a lot of the jokes are based on a deep knowledge of the Japanese culture. Lots of puns with the different characters, or reference to Japanese traditions, that for the most part, will fly over the heads of a lot of people that aren't very well versed in Japanese culture. Now i can't blame the creators for this, I mean the show was obviously created for a Japanese audience and I wouldn't have it any other way. Just know that if you haven't lived in Japan, taken a Japanese culture course, or watched more anime than you have regular cartoons, then there will be quite a few jokes that will simply pass you by.   \\n\\n\r\nOverall Sayonara Zetsubou Sensei is an amazing show, full of inovative ideas, told in a simple way that will still surprise you at every corner. Its a show that won't drag you in deep and keep you locked in your seat for the entire season, but it will leave you thinking at the end, with a very satisfied feeling. A definite recommendation, and 5/5 Stars all around. This show will (not) leave you in despair.",
            "date": "2010-04-06T15:37:00+00:00",
            "helpful_count": 12,
            "mal_id": 24755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312392.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/leingodf8",
                "username": "leingodf8"
            },
            "url": "https://myanimelist.net/reviews.php?id=24755"
        },
        {
            "content": "Sayonara Zetsubo Sensei is about a depressed teacher who would like nothing more than to die, but whose attempts are usually foiled by his students, who all seem to have social quirks of their own. The series starts with Zetsubo trying to hang himself from a cherry tree when he is interrupted by a girl optimistic enough to be his polar opposite. After escaping a conversation with what he sees as an annoyingly bubbly person, he arrives at his classroom the next day and realizes the girl is one of his own students. Zetsubo's full name when written horizontally reads as \"despair\" and as theseries progresses it is shown the rest of the students similarly have names that are written puns on their personalities.\\n\\n\r\nI was a little annoyed at the art style used in the show at first as it comes off as really cheap (especially when you watch on a streaming website) patterns are paint-bucketed in instead of drawn (example: Zetsubo wears plaid kimonos often and the stripes align horizontally and vertically no matter what section of the garment they're on or how he moves). But it soon becomes apparent that the visual style is entirely deliberate as at various times lighting and atmospheric effects are employed, and with a quality video source you realize the linework is actually fairly well done. The music has a wonderful quirkiness about it that fits well with the show, with opening and closing songs that are odd but fun nonetheless.\\n\\n\r\nUnlike most animes I've seen Zetsubo is episodic and the story does not build upon the plot of the previous episode (except for new characters introduced).  It's primary shtick is spontaneity and the clashing of the various characters' personalities, along with some sketch comedy and monologues. Small jokes and random phrases are written on the blackboards through most of the classroom scenes, and the show uses cut scenes often. Unlike the cut scene jokes of Family Guy however, these cut scenes never have any real connection to the show itself generally, and are more thrown in to make the viewer go &quot;what was that about?&quot; The show was hilarious for the first six episodes or so but random craziness can only work for so long, and the laughs began to tapper off after that. More of a sketch comedy aspect was used towards the end. But I still recommended it if you want something entertaining and lighthearted.",
            "date": "2008-07-01T17:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 5958,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60494.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nx6",
                "username": "nx6"
            },
            "url": "https://myanimelist.net/reviews.php?id=5958"
        },
        {
            "content": "Ah, Sayonara Zetsubou Sensei! Before I begin, let me state that I watched this anime in two days while at a sleepover with some friends, which means some episodes were watched really late into the night/morning. This may have affected my perception of the anime to some degree due to severe sleepiness. Also, this sleepover happened about 6 weeks before I wrote this review, so I may not remember every little detail about what I am discussing. Forgive me. ^^&rsquo;\r\nStory- Sayonara Zetsubou Sensei&rsquo;s (SZS) story revolves around a group of schoolgirls (OK, there is one moderately important male student, but no one REALLY cares) andtheir suicidal teacher. Together the class and their teacher engage in everything from normal classroom conversations to stalking each other, to hibernating in their teacher&rsquo;s (Itoshiki-sensei) house for a night. Each student in the class has one dominant character trait and these traits are usually set up so that they make fun of or satirize some aspect of modern culture. For example, we have Kafuka Fuura, an overly optimistic girl who is so bent on looking on the bright side of things that she is completely blind to all the horrible things that may be happening around her. She embodies the popular notion that optimism is the best way to go through life, but this optimism made her so na&iuml;ve that she cannot even begin to comprehend the evils, sadness, or injustices in the world- including her own parents&rsquo; suicide. Another such student is Kiri Komori, a hikikomori (or shut-in) who has stayed inside and skipped school for so long that her skin actually glows white. She embodies the increasing number of young people in Japan who have become hikokomoris themselves and have thus isolated themselves from any form of human contact. Then, of course, we have Itoshiki-sensei himself. He is a man so pessimistic that he attempts to commit suicide on a regular basis. This is most likely not only satirizing middle-aged adults going through mid-life crises and such, but I also interpreted it as satirizing the increasingly popular &ldquo;emo&rdquo; movement in young people today which glorifies and romanticizes depression and angst (a disgusting way of life, if you ask me). As you can see, these characters have quite a bit of depth to them and the various situations they are thrown into are usually hilarious and funny to watch. However, these situations and stories are not always funny, most likely due to the content being lost in translation during the subtitling process. This makes for some fairly boring parts in the anime as well.\\n\\n\r\nArt- SZS is definitely unique and stylized. The artwork used in the anime makes use of more subdued colours that fit well for SZS&rsquo;s dark thematic overtones that serve as a basis for its comedic elements. A fair number of scenes in the anime were done in different styles of art, including scenes that made SZS look like an old silent film or some trippy video from the 80s. This range of artistic styles was both interesting and challenging to watch at the same time.\\n\\n\r\nSound- It has been too long since I&rsquo;ve seen SZS to properly comment on its sound. Nonetheless, there are two parts of the show that I clearly remember in terms of sound/music- the two opening/ending themes (Ito toshite Jiku ga Bureteiru and Zessei Bijin). I enjoyed both these songs for the way they integrated 1940&rsquo;s swing music with J-pop (Zessei Bijin) and for their fast-paced hardcore melody and instrumental track being juxtaposed against the voices of young Japanese schoolgirls who will take over the melody of the song every now and then. Both songs make for great listens and I will often have them blasting in the car when driving long distances. XD\\n\\n\r\nCharacters- I have already went to a good amount of depth with the characters in the &ldquo;Story&rdquo; portion of my review. Thus, in summary, the characters are interesting, diverse, and each play in an important part in representing various negative aspects of modern Japanese culture (even though they are taken to the extreme in the case of SZS). Awesome characters- too bad they don&rsquo;t develop much during the plot (not that it matters much in a comedy-esque anime).\\n\\n\r\nEnjoyment- SZS was a fun and enjoyable anime to watch, especially in a group of friends. It made all the funny scenes all the funnier to watch and then allowed us to take them further as we made up our own jokes based on the anime after watching it. Unfortunately, as I mentioned earlier, I was fighting sleep during the later episodes which made some of them seem too lengthy and stretched out in some cases. That combined with the fact that some of the scenes that were supposed to be funny just didn&rsquo;t strike a chord with me brought down this rating to a 6/10.\\n\\n\r\nOverall, this hilarious anime rooted in satire is definitely worth a watch. However, if you aren&rsquo;t laughing or at least smiling after the first few episodes, chances are that this anime is not for you: many of the later episodes are similar in tone and style. \\n\\n",
            "date": "2008-08-18T14:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 7266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/59662.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/UchihaItachi6660",
                "username": "UchihaItachi6660"
            },
            "url": "https://myanimelist.net/reviews.php?id=7266"
        }
    ],
    [
        {
            "content": "We all have times when we wish we were dead, although we don’t always mean it. \r\nWell, I present you Itoshiki Nozomu. He’s the world’s most pessimistic person and always carries around a rope when things turn badly (by the way, when you write his name horizontally, you will get Zetsubou – despair). Right in the first episode we see Itoshiki hanging himself in some cherry trees and his imminent death is only stopped by Fuura Kafuka, his unequal: the world’s most optimistic person. This is what sets things off and from here on in we will make a journey through current Japan’s society, throughthe eccentric students of this eccentric teacher.\\n\\n\r\nUsually when we talk about smart comedy what comes to mind is a Cambridge PhD that tells jokes that only Stephen Hawking and company can grasp. This series is really something because it is a smart comedy… that allows laughing. Zetsubou has a lot of serious subjects but you never see these treated like a soap opera. The problem is developed with a dark comedy that allows much more reflection about it. \\n\\n\r\nEach character is a takeoff of modern Japan’s problematic citizens: a hikikomori, a perfectionist, a gaijin that suffers prejudice, an addict of cell phones, a stalker, a fan of yaoi and cat ears, an illegal immigrant, a girl that enjoys putting  a stick in a dog’s ass (not sure if the last one is a general problem). The development of these characters may become compromised after the first half, conceding space to nonsense episodes, but this is natural coming from a comedy.\\n\\n\r\nUsually when we see an anime we already know what to expect from the funny parts, they’re virtually the same every time. Again, that’s not the case here. Expect the unexpected. A really unique, cynical, nonsensical comedy.  The color and the lighting is top quality. Also, get prepared to see a lot of cuts, abrupt changes of images, jokes been told on the blackboard or written on the screen. The dialogue is original and the animation is pretty creative and of high quality; moreover, there are a lot of alternative things.\\n\\n\r\nFor example, all the time you’ll see the picture of bald guy around, a Japanese Lex Luthor, that is funny exactly because there’s no purpose for that. There is an episode in which the characters are presented as paper dolls.  The first opening doesn’t even have any image, except that damn bald guy. The second one can mix up Buddhism with bondage (don’t ask me how). The ending is like a surrealistic thriller. It’s a pretty cult comedy by this point of view, because uses a lot of art and animation techniques that you thought you would only find in a more serious anime or in a museum.\\n\\n\r\nWe can call it a harem series when we think that every girl somehow ends up falling in love with the teacher and that the only male characters that have the minimum relevance are a bald guy (another one) and a boy that only read books the entire time.  There’s a lot of fanservice as well, but, one more time, the anime does that in a unique way. It’s almost like it is dissing the fanservice itself.\\n\\n\r\nThere are references to other anime like Lucky Star and Higurashi no Naku Koro ni (and Zetsubou is incredibly similar to Watanuki from XXX Holic).  Furthermore, the otaku world is shown in the traditional Comiket Market.\\n\\n\r\nThe first opening song, Hitotoshite Jiku ga Bureteiru, is performed by Kenji Ohtsuki, who some may remember from the ending of Welcome to NHK.  Now, instead of the galactic crazy baby, there is a song that keeps repeating bure, bure, bure (warped, warped, warped)… whatever.  What’s cool is that there is the participation of some of the voice actors like Nonaka Ai (here, Fuura Kafuka, but also known as Ibuki Fuko in Clannad After Story) and Inoue Marina (here she’s Kitsu Chiri; also made Eve Genoard in Baccano).\\n\\n\r\nIt may be a funny rock – you can’t hear Kenji sing without laughing - but is also a pretty good one, at least the song doesn’t get out of your head.  Most of the OST is performed by Hasegawa Tomoki on the piano, and the majority of the songs are somewhat dramatic, melancholic, romantic, what fits with the dark comedy of the series pretty well.\\n\\n\r\nWhen I finished the last episode I was so gloomy about it that I thought about doing bungee jumping from a two floors house with the rope around my neck cutting my wrists while falling after drinking caustic soda… but  then I discovered that there was a second season and a third coming up this July… there’s still hope… ;)\\n",
            "date": "2009-07-02T05:53:00+00:00",
            "helpful_count": 301,
            "mal_id": 16352,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/192413.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kurodayuchi",
                "username": "kurodayuchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=16352"
        },
        {
            "content": "Despair! I am in it.\r\nSTORY - Story? What story? This is a slice-of-life series and it is based entirely around hilarious character shenanigans, though if you ever see characters like this in your life, I'd be a little worried. Still, there are a few reoccurring themes revolving around anime and otaku snark and satire of Japanese lifestyle, culture, politics, media, literature, etc. They also frequently make fun of themselves, which is incredibly amusing. It's all amazingly well done and highly entertaining, I assure you. A bit of warning through, if you try and pause to read every single thing written in the background for scenes,you will turn 20 minute episodes into 40 minute episodes.",
            "date": "2008-06-05T22:58:00+00:00",
            "helpful_count": 198,
            "mal_id": 5268,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66273.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/kiriska",
                "username": "kiriska"
            },
            "url": "https://myanimelist.net/reviews.php?id=5268"
        },
        {
            "content": "Normally I'd wait until I've seen all of a series before voicing my opinion, here I'm making an exception. Once in a while comes an anime that pushes all the right buttons for me; Sayonara Zetsubou Sensei does just that.\r\nIt starts with the music: more to my taste, a little harder than your usual cutsy jpop. I often find myself skipping past the opening songs, I hardly ever watch the ending credits and quickly move onto the next episode; here, the music with the animation creates an awesome visual I watch each and every time. I'm sure it's partially due to the style of theart, more manga-esque, more poster art than anime. This style continues throughout; you could say that compared to the rich backgrounds and detail of, let's say, Gendo Senki, Sayonara... can't even begin to compete. But you don't miss the detail, the simplicity and the style of drawing only makes it more graphic and more &quot;punchy&quot;.  \\n\\n\r\nThen there is the story and the characters; it's probably the wackiest bunch you'll ever likely to encounter, if you thought a teacher constantly on the brink of overwhelming despair is strange, you haven't met his students! Each takes a personality trait and blows it completely out of proportion. This is where the fun comes in; I love the self-referencing jokes parodying pop-culture both Japanese and American, the patterns that don't move when the character does, the photo cutouts, and the unexpected, over the top behaviour.\\n\\n\r\nSure, the series isn't perfect, but it gets damn close. All I can say is that I thoroughly enjoyed it and I'm looking forward to the last 5 episodes.",
            "date": "2007-10-06T05:15:00+00:00",
            "helpful_count": 99,
            "mal_id": 988,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6636.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dollie_mixtures",
                "username": "dollie_mixtures"
            },
            "url": "https://myanimelist.net/reviews.php?id=988"
        },
        {
            "content": "I'm in despair! This anime with such a plot that could have been expanded in so many directions has left me in despair! And so begins this disillusioning review of Sayonara Zetsubou Sensei.\r\nThe series is a comedy, blending dark humor with otaku references and some slapstick. It's a very eccentric blend of various comedic styles so it comes off as a novelty and wears off just as fast. The first few episodes are uproariously funny, but once the novelty of the setting wears off there's nowhere for the series to go. Keeping to an episodic structure, no one grows and nothing changes.  A goodcomedy will develop character relationships so it never runs out of tangents. Here it's Nozomu Itoshiki vs. his class. That's all you ever see. It's fun for a little while, but because it never goes anywhere, it gets old in a flash.\\n\\n\r\nAnimated by the (in)famous animation studio SHAFT and directed by creative madman Shinbo Akiyuki, Zetsubou's art takes all the requisite turns expected of it and a few new ones. The problem is it's all very hit-or-miss. Shinbo-san's affinity for blending 3-D objects in a 2-D world shines here, but other elements such as copypastas and the chalkboard gags just annoy, especially since they're only on screen for maybe a second or two and only serve to distract. While some of them are quite funny, the emphasis placed upon them is vague. Should we be looking at the chalkboard or listening to what's going on onscreen? This probably translates better for Japanese audiences, but an American audience relying on subtitles will be hurting to keep up.\\n\\n\r\nThe animation is often very smooth when it needs to be. It's a very unique style that doesn't reflect anything else done by the studio or the director before, which makes it pleasant to view. The only problem is really the character designs. They're either blatantly unique to the world or they just manage to blend in. I swear, I still can't tell Fujiyoshi and Hitou apart &gt;&lt;\\n\\n\r\nThe character designs were not the only problem I had with the cast though. Much of Zetsubou's potential was ultimately squandered in the character department. As Zetsubou is a character-driven comedy, much of the humor relies in the various dysfunctional personalities of teacher Nozomu Itoshiki and his class colliding on matters of society and personality disorders. This is illustrated by giving every main girl a specific and unique disorder and limiting the girls' personalities to only that disorder. It works wonderfully in the case of the sadistically OCD Chiri, but other characters like stalker Tsunetsuki and &quot;I'll sue you&quot; Kaere are less like characters and more like running gags. Thus it comes as no surprise that eventually the chemistry falls apart and one is left wondering if they even had a plan as of what to do with each girl after her disorder was revealed.\\n\\n\r\nThe accompanying music is decent. Noticeable at times, but often forgettable. The ED is pretty good, but it's the OP that's the real treat of the soundtrack.\\n\\n\r\nSayonara Zetsubou Sensei has been receiving rave reviews for the last year and in some ways I can see why. Its comedically nihilistic take on Japanese society, as well as it's inventive style bring fresh air to the myraid of other anime. But ultimately, what potential it starts with is squandered on one-dimensional characters and a repetitive plot.\\n\\n\r\nOverall, I give Sayonara Zetsubou Sensei a 7 out of 10.",
            "date": "2008-10-23T10:35:00+00:00",
            "helpful_count": 68,
            "mal_id": 8884,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/8731.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Splitter",
                "username": "Splitter"
            },
            "url": "https://myanimelist.net/reviews.php?id=8884"
        },
        {
            "content": "Sayonara Zetsubou Sensei is a Psychological, Slice of Life, Comedy about an extremely cynical teacher trying to spread his feelings and views of despair onto his students. Every episode is usually split up two as each part gives us incite into another one of the students, which means that every episode is different from the last. Seeing all the problems with Japanese culture laid out in front of you, just to make fun of it is not original however this anime is able to do it in such a unique way. With plenty of parodies and random moments, this anime is hard not to laughat. Another interesting thing about this anime series, is its &ldquo;out of the ordinary&rdquo; choice of censorship and how it makes fun of pointless fanservice. These are to sort of jokes anime fans would love to see nonetheless a lot of the jokes do get repetitive, which losses its affect in the latter episodes.\\n\\n\r\nWith every episode focusing on one or two of the teacher&rsquo;s students, this anime does a fantastic job in portraying each of the characters that show up on screen. With so many different psychological disorders and social issues to deal with, the characters never seem boring or clich&eacute;d in anyway. Itoshiki is the main character and he proves to be just that, with his odd mannerism and hilarious moments and even though some of his jokes get fairly repetitive, he still remains funny. \\n\\n\r\nThanks to SHAFT we have a pretty unique animation style. The animation for this anime is basically a mix between superb, shoddy and just plain weird. It is just too hard to go into detail and explain it because it has the same weird conceptual artistic style as this entire anime. The music is an odd contrast of sweet melodies and hard rock, which go well with this messed up anime and it&rsquo;s messed up main characters. Even the OP and ED themes are extremely catchy and you&rsquo;ll never feel like skipping theme.\\n\\n\r\nOverall is one of those Satire comedies that are made with the hardcore anime fans in mind. With so many hilarious jokes churned out, us viewers are bound to find some funny with the rest going straight over our heads. Even though this show gains a merit for being pretty unique, it does end up losing a bit of its appeal later on. So if you&rsquo;ve seen and enjoyed shows like &ldquo;Lucky Star&rdquo; and &ldquo;Welcome to the NHK&rdquo; then you are sure to enjoy this one.\\n\\n\r\n^_^",
            "date": "2007-12-27T06:46:00+00:00",
            "helpful_count": 53,
            "mal_id": 1718,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/18456.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Master10K",
                "username": "Master10K"
            },
            "url": "https://myanimelist.net/reviews.php?id=1718"
        },
        {
            "content": "THIS REVIEW CONTAINS SPOILERS\r\nSayonara Zetsubou Sensei is a show about Nozomu Itoshiki, an extremely melodramatic man whose suicide is interrupted by Kafuka Fuura, a happy-go-lucky, perpetually optimistic girl. Itoshiki turns out to be a teacher, and when he goes to teach his class, it turns out that almost every single one of his students has severe mental problems as well.\r\nNow, the premise is already hilarious enough, and for the most part, the show delivers in terms of comedy and satire.\r\nHowever, the show is admittedly rather formulaic. Almost every episode follows more-or-less the same pattern: A problem/quirk regarding society is shown, Itoshiki rants about it, hisstudents give their point-of-view about it, and Kafuka talks about the positive aspects of said problem/quirk.\\n\\n\r\nThe first few episodes of the first season are dedicated mostly to introducing the characters as well as their associated running gag. Said running gag is as far as their personality goes.\\n\\n\r\nAs such, considering that in all subsequent episodes of the show, the same jokes get reused over and over regarding the characters, and the formula for each episode remains the same, the show gets rather boring for the remainder because they don't really do that much else. However, this only applies to season 1.\\n\\n\r\nIn seasons 2 and 3, possibly because they had already made every joke that could possibly have been made about the characters at this point, the show starts to get out of its comfort zone. We get to see the characters in different settings rather than the classroom/the school grounds, and some episodes even forgo the typical episode formula, which I felt was a welcome change. Despite some arguing that the show got stale at this point, I personally felt that seasons 2 and 3 were better than season 1.\\n\\n\r\nAll in all, I'd give season 1 a 6/10, and seasons 2 and 3 a 7/10. I recommend this show if you're looking for a quick laugh and some good satire.",
            "date": "2015-12-09T14:06:00+00:00",
            "helpful_count": 48,
            "mal_id": 205139,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3941949.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/D-ohnuts",
                "username": "D-ohnuts"
            },
            "url": "https://myanimelist.net/reviews.php?id=205139"
        },
        {
            "content": "\"Sayonara Zetsubou Sensei\" is as insane and addictive as it is deeply unorthodox. The usage of: silhouetted characters, extremely polar opposites in terms of the two main characters, constant cuts to text, and a bald, glasses-wearing man for censorship are definitive proof of this. As soon as it starts it already flaunts its relentless and ridiculously funny sense of humor. A strange premise along with a non-traditional visual approach not only make it intriguing but refreshing as well.\r\n  The premise is blatantly and pleasurably off-kilter like everything else in this anime. An incredibly negative and pessimistic person, Itoshiki Nozomu, and an incredibly positive andoptimistic person, Fuura Kafuka, are the two main characters, and they meet each other as he attempts to commit suicide. They are outstandingly different but they must cope it because they are both part of the same school. Itoshiki is the homeroom teacher of Fuura's class and there he encounters a sea of strange students. Each of the students has a unique personality trait or activity that they heavily utilize; all are parodic and stereotypical in their basis and are solely used for the anime's grand satirical goal. Every episode focuses on Itoshiki's (aka Zetsubou Sensei which translates to Mr. Despair) crazy interactions with his students. These interactions hilariously result in either him trying to teach them his bleak lessons, or him being convinced that he is living in complete and utter despair due to one of their remarks or actions.\\n\\n\r\n  \"Sayonara Zetsubou Sensei\" uses satire in much of its comedy. Much of this derives from it darkly satirizing Japan and all the common people, groups, and events that it has in it. Characters that possess or partake in: suicidal thoughts, extreme isolation, domestic abuse, disturbing perfectionism, stalking, illegal immigration, non-conformist mentality, material worship, and severe identity disorder may be taboo topics for other anime but it's just a wonderful comedy playground for \"Sayonara Zetsubou Sensei\". Much of this said humor consists of social commentary, parody, or just outright references regarding Japanese culture, so the anime can be alienating. Viewers might want to do some light research, seriously read the TL notes, and at least get a basic understanding on how Japan works or who usually inhabits it. However, being very knowledgeable isn't necessarily a requirement to enjoy or be entertained by this anime. Even the viewers who aren't too knowledgeable can still witness the insanity and high energy that makes it feel so high-octane and exciting.\\n\\n\r\n  The art is colorful and flamboyantly atypical. Akiyuki Shinbo, the director, along with the anime's main production studio, Shaft, definitely show off their usual eclectic style here. Intriguing color changes and silhouettes run rampant in each episode. There is not much actual animation in \"Sayonara Zetsubou Sensei\", but it compensates with its interesting art style. There are different textures flying in and out in just about every frame. The fast and unusual fashion that it uses completely fits the insane antics and gags that constantly ensue throughout the anime.\\n\\n\r\n  The opening themes and ending themes used are great and are definitely adequate for the anime. \"Hito Toshite Jiku ga Bureteiru\" by Kenji Ohtsuki, featuring five of the female voice actresses, is the best particular song and is a delightfully catchy and maddening rock song; passionately pumping the crazy mood that the anime creates. The rest of the soundtrack that accompanies the anime is competent and conjures each of its desired emotions well.  \\n\\n\r\n  The entire run of this anime is an entertaining frenzy that deserves much appreciation for both its art and excellent ability to create laughter. Enthusiasts of absurd and black humor, as well as successful satire, should definitely give this anime a try. \"Sayonara Zetsubou Sensei\" is a deranged, neurotic, and enjoyable absurdist and satirical comedy that nonchalantly criticizes everything in its broad Japanese path without ever taking a single break. \\n\\n\r\nEight Durable, Stout, and 'Height-Helping' Pink Gabriel Trees out of Ten.",
            "date": "2013-07-19T03:58:00+00:00",
            "helpful_count": 47,
            "mal_id": 105947,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332859.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/albinochocolate",
                "username": "albinochocolate"
            },
            "url": "https://myanimelist.net/reviews.php?id=105947"
        },
        {
            "content": "Depression is often times (well, always) a serious topic.  Suicide is almost a taboo in our modern society.  Along with these, there are a whole slew of social problems that we see around us.  These topics should always be handled delicately, because many people would be offended if they weren't.\r\n\"Sayonara, Zetsubou Sensei\" takes this sentiment with a grain of salt.  Our lead character, Itoshiki Nozomu, is a depressed, suicidal teacher who always views things in the most negative light.  His class, sadly enough, has more problems than he does; the students range from a hikkikomori to a balding boy wholiterally disappears from a lack of presence.  The show details Nozomu's attempts (mostly failed) to teach his class about life and society.\\n\\n\r\nStory:\\n\\n\r\nAs you can see above, this show does not have that much of an overarching story.  While some elements of an episode may be referenced in later episodes (often hilariously), the episodes all have contained stories.  This first season is primarily focused on introducing the characters.  The stories in the episodes feature elements of life, parts of Japanese culture, or Japanese phrases, taken to the logical extreme in a satirical manner.  I enjoyed this format quite a bit (though others might not; it depends), and gave it a 9.\\n\\n\r\nArt:\\n\\n\r\nBeing a show created by Shaft, \"Sayonara, Zetsubou Sensei\" features Akiyuki Shinbo's distinct animation style (there's even an episode in a later season that explains and deconstructs his style).  Now, Akiyuki Shinbo's usage of quick cuts to blocks of text and frequent color-replacing may not appeal to everyone, but it certainly does for me.  The artwork in this show is sometimes inconsistent (to create humor).  Also, Shinbo always likes to put random things into his shows, and this one is no different.  Every single shot with a blackboard in it probably has a shout-out or reference of some sort displayed on the blackboard.  He also likes to use the \"Sayonara, Zetsubou Sensei\" manga author's face (mostly as a censoring device, but also on the school's clock, and randomly inserted elsewhere), and he even appears as a character (voiced by himself).  This random style really appeals to me, which is why I gave it a 9.\\n\\n\r\nSound:\\n\\n\r\nHiroshi Kamiya does a great job voicing the character Itoshiki Nozomu, and is always a delight to listen to.  All of the other voice actors/actresses do marvelous jobs as well.  The soundtrack is not bad; it helps to set the mood and isn't annoying to listen to, but it does not have any outstanding tracks.  I give sound an 8.\\n\\n\r\nCharacter:\\n\\n\r\nAlmost all of the characters are interesting.  We have suicidal teacher Itoshiki Nozomu, positive girl Fuura Kafuka (pen name), and a ton of other characters with their own unique quirks...although they're almost never unique; they're either extreme versions of a stereotype, or a subverted version of a stereotype, but stereotypes nonetheless.  However, the charm of these characters is not in their depth (because they're all pretty shallow characters).  One of the best parts of this show is the interaction between the characters, and their dialogues.  Because these interactions, to me, were very entertaining, I give Character a 9.\\n\\n\r\nEnjoyment:\\n\\n\r\nI really enjoyed this show, it's satirical story and dialogues, its random art style and animation, and the voice actors/actresses performances.  I give Enjoyment a 10.\\n\\n\r\nOverall:\\n\\n\r\nI really enjoyed this show, but others might not.  For one, the themes and issues addressed in this show may be a little disconcerting for some.  Others might not like Shinbo's strange animation style.  The lack of a good story may also be a turn-off factor for people (I myself was a little disappointed that there was no good ending, even at the end of the third season).  I recommend that you watch an episode or two, because the first episodes give a pretty good idea of what's in store for future episodes.  You might love it like I did, or you may hate it to death, but in my opinion, it's a unique, quirky piece of art that should not be missed.\\n\\n\r\n9/10",
            "date": "2013-09-20T20:05:00+00:00",
            "helpful_count": 34,
            "mal_id": 113605,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2867285.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/BlindPenguin",
                "username": "BlindPenguin"
            },
            "url": "https://myanimelist.net/reviews.php?id=113605"
        },
        {
            "content": "I can see why most people liked this anime, but it’s not my cup of tea.\r\nThe first few episodes made me laugh due to the absurdity and the character introductions. At episode 9 I really felt like dropping the series but in the end I do like the fact that I watched it all.\r\nArt (7/10): The art is very good at first, the surroundings were drawn in a way that I felt like it could be real. However other animations are also introduced, I liked some of them, I really disliked others. There’s also this bald guy popping up every now and then. I guessit’s supposed to be funny but I really can’t look at the guy’s face (though I have to admit I have a strong dislike for beards, being bald and having a beard makes my dislike even greater).\\n\\n\r\nEpisodes were often interfered by short little weird movies. Yes, I guess you could consider those funny, but they didn’t make me laugh. Actually they rather confused me.\\n\\n\r\nStory (-/10): absent.\\n\\n\r\nSound (8/10): The music did not fit my personal taste, but it did fit in the anime and it’s animation. So yes, the sound is good for the series it is used in. One of the things that did made me laugh (out loud) were the little happy sounds that seemed to accompany Kafuka Fuura. I only noticed those little happy sounds in the first few episodes though.\\n\\n\r\nCharacters (9/10): Characters are all introduced in an unique way. Their way of living brings along some complications, but that makes it interesting. I liked the characters of Kafuka and Maria, but Kafuka seems to lose her optimism as the episodes pass (similar to the loss of pessimism of Itoshiki) and Maria eventually scared me. But being able to say that means the characters are pretty well set up. Each of the characters is intriguing in its own way.\\n\\n\r\nEnjoyment (5/10): the anime did have a nice and unique style, but for me, personally, the absurdity didn’t manage to keep me interested. I believe that I am not “open-minded” enough to truly like this series. Also I am probably too simple-minded. The anime seems to be criticizing itself a lot, but instead of thinking of that as funny I totally agreed with the critique. I also would have liked the series more if it at least had a basic storyline.\\n\\n\r\nOverall score = 6 (However I’d give the first few episodes a 7)\\n\\n\r\nEven though I didn’t really enjoy the series, I do believe you should give it a chance. You might like it, you might not. You’ll never know for sure if you don’t watch!",
            "date": "2010-08-09T02:54:00+00:00",
            "helpful_count": 33,
            "mal_id": 29449,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/366018.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Alinhje",
                "username": "Alinhje"
            },
            "url": "https://myanimelist.net/reviews.php?id=29449"
        },
        {
            "content": "This anime starts off as a pretty straightforward humor/harem anime.  The episode is divided into two sections, and each section introduces a student who has a strange personality quirk, such as always being optimistic, or only communicating via text message.  This was okay to get to know the characters, but by the end of the second episode I was wondering if this was all the series was going to be.  Luckily, around episode 4 or 5, it broke out of that mold.\r\nIt still kept the two section format, but instead of simply introducing characters one per section, it would just place themin a situation.  My only real complaint is that there was little to no continuity between episodes.  Many of them could have been viewed in any order(except for the early ones introducing characters) without missing anything.  This put me off for the first half of the series, but by episode 7 or 8 the unique sense of humor this series has began to grow on me.\\n\\n\r\nYou'll find yourself reaching for the pause button fairly often, to stop and read the funny text written on the blackboard, on the wall, and other crazy places.  The writing often contains references to other anime and manga, or crazy off-the-wall statements that you can't help but burst out laughing at.  Even if, like me, you need to pay attention to dialogue the first time you watch an episode, you'll find yourself watching it a second time to make sure that you don't miss any of the hilarious text.  I believe that's what gives Sayonara Zetsubou Sensei its charm.\\n\\n\r\nI would reccomend you watch this if you like strange humor, but not if you're sensitive to humor around things like student-teacher lesbian suggestions, or a panty shot character.  Also, for a while in the middle of the series, the opening credits contained bondage pictures involving the students.  Don't be too put off by that though, as the majority of the humor in the series doesn't revolve around sex.  I'm not a huge fan of just for laughs anime, and I still enjoyed this.  I'll definitely be coming back for season 2.",
            "date": "2008-01-02T10:08:00+00:00",
            "helpful_count": 30,
            "mal_id": 1811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/9174.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tigger89",
                "username": "tigger89"
            },
            "url": "https://myanimelist.net/reviews.php?id=1811"
        },
        {
            "content": "There's good anime, and then there's crap anime, this one being the latter. I went into this anime expecting something quick, enjoyable, and funny, seeing that all the previous reviews gave it high ratings and some of the similar recommendations included stuff like 'Welcome to the NHK' *which also involves subjects like the hikikomori and is meant to be comedy*. However, I quickly realized this anime would not be one of those fun watches.\r\nI forced myself through 5 episodes before I dropped it. The second I started watching this anime felt like my I.Q. dropped 10 points. \r\nSTORY: There is no story. Its completely pointless.Sure, its a slice of life, and a lot of these animes don't have a strong story... but this is just pure, annoying randomness. \\n\\n\r\nCHARACTER: Pathetic. An annoying lead an a bunch of cliche 'cutesy' anime girls trying to be funny, an attempt which fails miserably. \\n\\n\r\nENJOYMENT: 1. Pathetic. This is pure torture. \\n\\n\r\nOVERALL: I hated what I watched of it. It joins the ranks of annoying, pointless animes such as Lucky Star. Ugh. \\n",
            "date": "2009-01-24T18:56:00+00:00",
            "helpful_count": 29,
            "mal_id": 11812,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33917.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/amade0",
                "username": "amade0"
            },
            "url": "https://myanimelist.net/reviews.php?id=11812"
        },
        {
            "content": "\"Sayonara Zetsubou Sensei\" opens with a teenage girl happily walking in a small forest of cherry trees. Suddenly however she stumbles upon a horrifying sight - a young man hanging himself on one of the trees. Now that's SZS in a nutshell. I could easily end this review with those 2 sentences and it would still be a detailed and informative review. \r\nHowever, I think that even though SZS lacks a real story, it still deserves a decent and elongated review because, if it had a good background story - it would have been a masterpiece. SZS is a slice of life anime, so theissues presented here are not pulled out of someones' ass, they are real issues that people, nay, the entire world has to deal with. For example, every character in this anime is a visualisation of Japan's culture and problems. However, some characters are also presentations of other cultures like Kaere Kimura, a returnee with a split personality disorder. \\n\\n\r\nThe main character, Nozomu Itoshiki is a highschool teacher and he presents the traditional culture of Japan. He's a proper gentleman, he wears a hakama, reads and writes a lot of poetry (one of his favourite plays is \"The love suicides at sonezaki\") and consideres suicide to be the highest expression of love. After meeting a Hikikomori girl, he remarks on how beautiful she is and then writes her name down in his \"Perfect Suicide Partners\" book. At this point I imagine some of you might be going \"WTF\". However this is just the beginning, throughout the first season Itoshiki will attempt numerous suicides and will always be saved by one of the girls from his school. That always sends him into despair. In other words, while educated and proper, Itoshiki is a man waiting for an occasion to kill himself. He may be a representation of the high number of suicides in Japan (Japan has the 5th higest suicide rate in the world). \\n\\n\r\nWe have a character like Fuura Kafuka, who is overly optimistic, and considers Itoshiki's suicide attempts as his means of \"getting taller\" (I kid you not!). We have Harumi Fujiyoshi who is a yaoi fangirl and is always there to imagine a pairing of Itoshiki and... some other guy. Then we have Meru Otonashi, a super shy girl who communicates using mobile phones. While she is shy, she's also a very rude and harsh person, usually insulting everyone around her who happens to posses a mobile phone. There are dozens of more characters on the way, and to describe them all I'd need about a month. Therefore, I'll quickly sum them up - there's a girl who likes to pull animal tails, we have a girl who is a perfectionist, a girl who is an illegal immigrant, a girl who has a guilt complex, a girl who posts photoshoped images of herself on the internet and last but not least... a girl who likes to put sticks in dog's asses. Cute isn't it?\\n\\n\r\nWell, after watching the first 2 episodes I felt like hanging myself actually. Not because this series is bad but because it's painfuly true. And what I mean by that is that many of us try to think positively and we consider most things in this world to be beautiful. This series however proves that that's just a foolish stance in a world where nothing matters.  While many describe it as a satirical series that aims to lighten up the mood, it will do everything but that. It will most likely leave you clawing your own throat out (100 points if you can get the reference). \\n\\n\r\nNow that I've talked about the story and the characters, I will discuss the Sound and the Art style. The soundtrack is depressive, it's something that you'd expect to find in Higurashi or Princess Mononoke. It will grab your brain, spit on it and throw it into a fruit mixer. The feeling you get while listening to some of the tracks is profound, I'd go as far as to say that you'd feel equally depressed listening to Titanic's violin theme. But there are funny themes too (and funny sounds), it's just that depressive far outbalances happy. \\n\\n\r\nArt is is a bit confusing I have to admit. The scenes change very quickly and there are a lot of jokes written everywhere, but the transition is too quickly for anyone to be able to read them, so don't. Unless you want to spend 3 hours on each episode. As for quality - it's good considering the year SZS came out so I don't have any compliants, and to be honest I'm not much of a expert on art so I wouldn't complain anyway. \\n\\n\r\nFinaly enjoyment -\\n\\n\r\nWell, did I enjoy it? Yes. \\n\r\nAm I in a good mood? No.  \\n\r\nSimple as that.\\n\\n\r\nNow if you'll excuse me, I have to find a decent tree to hang myself on.",
            "date": "2011-06-17T07:11:00+00:00",
            "helpful_count": 23,
            "mal_id": 37971,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=37971"
        },
        {
            "content": "Sayonara Zetsubou Sensei is RANDOM, DENSE, COMPLEX, SIMPLE and over-all RIDICULOUS! [I mean it]\r\nI won't praise it all much and will state what you're going to find here.\r\nSZS is full of gags and random jokes. It includes long and short \"debates\" and discussions over a particular topic. The topic can be very interesting or very dumb, making some good points or useless talk. It's full of ups and downs and everywhere in between. It's all talk and no action. But smart talk.\r\nMany mention there is a lot of dark humour....but it's not that much. There are dark terms, light terms, silly terms, complex terms, sometimesecchi terms, Japanese terms, Non-Japanese terms and the list goes on. You will always find a term your familiar with, which makes it even more funny.\\n\r\nCharacters problems are always a hot topic of discussion. So in that sense it could be considered dark.\\n\\n\r\nHere's how it goes :\\n\r\nThere is no story to it. There is this high-school teacher who wears those yukata-thingies all the time. He is the most pessimistic person around and believes that he is always in despair. Picking up the most simplest things, the really complex ones and somestimes really dumb things in life, describing it in a negative manner and putting himself in despair. He despairs on his name as well (which will literally translate to Mr. Despair/Despair Sensei when written horizontally). Always trying to hang himself when he's in the mood.\\n\r\nBy his side are some very 'different' (weird) students of his class.\\n\\n\r\n[All the episodes are the same and not related to each other at all so you can see it in any order. All the seasons and special episodes are the same as well. Only Goku Sayonara Zetsubou Sensei has an actual 'story']\\n\\n\r\nCHARACTERS :\\n\r\nAre the most important part. It's full of colourful and not-so colourful characters. Each of them contributing to these discussions. They are the fun part, the humour, the despair. Most of them are girls, so it's sort of a harem (nothing like THAT)\\n\\n\r\nENJOYMENT :\\n\r\nWell kids won't enjoy or even understand the anime. If jokes made on talks interest you, you will like this. Perhaps you would like it alot or find it very boring. Thats up to every individual.\\n\r\nWhen I saw it first, I didn't even feel like completing half of the episode..but then I lingered back and saw it and really liked it. I think it's smart and rather funny. If you like a few episodes, you will like it all. Because all the episodes are the same.\\n\r\nThe Openings are great by the way. Kinda funky! (Sang by the voice actors themselves)\\n\r\nEnjoy in despair :)",
            "date": "2013-04-19T06:11:00+00:00",
            "helpful_count": 20,
            "mal_id": 94245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1313823.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheFlowingStream",
                "username": "TheFlowingStream"
            },
            "url": "https://myanimelist.net/reviews.php?id=94245"
        },
        {
            "content": "SAYONARA ZETSUBO SENSEI tells the story of a depressed teacher named Nozomu Itoshiki (whose name means \"beyond hope\" or \"despair\"), who leads a class of students who are just as mentally disordered as he is. There's a perfectionist schoolgirl who hacks at everything she deems imperfect, a mute girl who only spews abuse through her phone, a stalker fixated on her beloved teacher... and the most dangerous of them all, the cute but psychotic girl who sees everything in an optimistic but insane manner, which ultimately boomerangs on Itoshiki and almost always lands him in trouble.\r\nThis show has a simple enjoyable premise and some interestingcharacters, but beneath it lies the ultimate in Japanese satire. It hosts all the classic elements that make up a great satire: eccentric characters in absurd situations, which center on a commentary on some fault... and in this show, nearly everything gets held up for fault-finding. The show pokes fun of a vast variety of issues: the cast and the mental disorders they are named and based on (eg Nozomu Itoshiki), word puns (flipping switches in people), the social afflictions plaguing Japan (trolling), well-known films, and even itself on a few occasions.\\n\\n\r\nThe sparkling and biting wit is one of the best things about this show, and is wonderfully backed up by stellar animation, enchanting music and a wonderful voice cast. Hiroshi Kamiya is an instant hit as the titular Zetsubo-Sensei, who stumbles through situations with a wonderful range of despair and humor. He is expertly partnered with Ai Nonaka as Kafuka, the incredibly sweet but twisted schoolgirl who loves Mr Itoshiki and loves to make him miserable.\\n\\n\r\nThe show is not flawless, though. Much of the humor is based on Japanese culture (eg the name of Nozomu Itoshiki), and so it would be hard for anyone not familiar with Japanese culture to understand it, let alone laugh at it. Also at times, there is a sense that if this story took itself more seriously it would be better than how it has turned out. And around the show's third season, things start to feel worn and dull; it should be noted that at the time the studio was having production problems, but you could only do a fairly one- note satire comedy for so long (look at SOUTH PARK and the not- always- great changes it's had to go through in its long run).\\n\\n\r\nIf satire is your forte, then this show is for you. Even if it isn't, it's still got some great stories and characters to watch and enjoy... and it will leave you in despair at how good but unknown it is.",
            "date": "2015-06-09T09:21:00+00:00",
            "helpful_count": 14,
            "mal_id": 189931,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4647970.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Haneken2086",
                "username": "Haneken2086"
            },
            "url": "https://myanimelist.net/reviews.php?id=189931"
        },
        {
            "content": "Im sure there are lots of people who would enjoy an anime such as this and unfortunately I am not one of those people.\r\nThere are always people who feel like dying and would go so far as to write a note or go to the top of the building or prepare to hang themselves. These people usually aren't serious, those who are, are first of all cowards and stupid. They believe that it takes courage to die however, they are wrong... It takes courage to live.\r\nNow after sharing that with you let me say that this anime was rather boring for me. I king offorced myself wo watch two episodes a day just to finish it.\\n\\n\r\nFrom the first episode you can see this anime had a lot of potential but I don't think they used it properly. The whole thing is basically about a teacher trying to repeatedly find an excuse to kill himself and without serious intent.\\n\\n\r\nThey only thing that I found remotely funny would be \"IM IN DESPAIR\". This phrase is what got me into this anime in the first place.\\n\\n\r\nThere is no story mainly because it is a 'slice of life' anime.\\n\r\nThe art was good but for me it wasn't great.\\n\r\nThe voice actors are again descent but not great.\\n\r\nNozomu was the only character I liked.\\n\r\nI didn't really enjoy this anime all too much.\\n\\n\r\nIf you are a fun of comedy try this a recommend it however, if you hate soft, gentle comedy then avoid it. If you are someone who needs something strong to make you laugh then this is a no no. The comedy level here is rather weak. It's nowhere near compared to 'Gintama'.\\n\\n\r\nI hope you found this review helpful :)\\n\r\nFeedback greatly appreciated\\n\\n\r\nStory: 3/10\\n\r\nArt: 7/10\\n\r\nSound: 7/10\\n\r\nCharacter: 5/10\\n\r\nEnjoyment: 5/10\\n\r\nOverall: 5/10",
            "date": "2010-01-05T09:09:00+00:00",
            "helpful_count": 14,
            "mal_id": 22092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/DMDetonator",
                "username": "DMDetonator"
            },
            "url": "https://myanimelist.net/reviews.php?id=22092"
        },
        {
            "content": "Well, I'm not a native speaker and this is my first review here. So please forgive me if I make any mistakes . ^¬^\r\n  Sayonara Zetsubou Sensei is by far the most interesting series I've seen in a while. It really brakes the whatever we may call \"normal anime patterns\" in a very original way. Starting with the story, which does not exist, not in a normal way. The following episode has nothing to do with the previous one. Sometimes, even the second part of the anime, doesn't seen to follow the first one, but every slice of the story can really getsyour attention, in addition to a lot of laughs.\\n\\n\r\n  The Sound and Art are not state-of-the-art, but they are very appropriate for the anime. You can feel the real atmosphere of the anime through the ED/OP songs. The art is impressive, the characters are very well-made and the scenery is awesome. Throughout the scenery you can see a lot of information, sometimes there are so many things that you have to pause in order to see them. Ok, you're not supposed to, but if you do this I can assure you'll get some extra laughs.\\n\\n\r\n  Characters are the critical point of this anime. Each character has a distinct peculiarity like, being a stalker, a suicidal person or having a personality disorder and a lot more characteristics that you might never see, in a funny way, on other animes .\\n\\n\r\n SZS is the kind of anime that makes you think about it in a real context of life. Only enjoyment awaits you. Watch it. x ]",
            "date": "2009-03-11T07:17:00+00:00",
            "helpful_count": 12,
            "mal_id": 13115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/121171.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Dellano",
                "username": "Dellano"
            },
            "url": "https://myanimelist.net/reviews.php?id=13115"
        },
        {
            "content": "Don't call me biased reviewer, I tends to be really cocky on series. This review might be find else where, since I can't just write different review all over again, in different forum. Remember, I only use same username for all the forum, (Goo4) so please don't freakin tell me that it is copied.\r\n-----\r\nZETSUBOU SHITA!! Everyone should have shouted this at least once in their life. But there is someone who has gone into extreme, and even tries to suicide himself for ridiculous reasons. \r\nThe anime, Sayonara Zetsubou Sensei (aka. SZS), is considered to be the most random anime in existence. You cannot predict howor when it will end. Story? What story? Discussing plot of this anime is meaningless. However, I can say, humours and word plays in this anime is just BRILLIANT. Kometa Kouji, who wrote the original manga, is fuckin genius. He tries to distort every single aspect of Japanese Society into something… ar… DESPAIR?\\n\\n\r\nSZS is fully consists of satirical comedies. Start with our Zetsubou Sensei, when we see him tries to hang himself for some foolish reasons like ‘my transportation card did not properly recognised’, we laugh at him. It’s not just humour, but satirical humour. It reveals how foolish killing one self is. This anime brilliantly has done those. \\n\\n\r\nSometimes, it shows floods of examples to support that satire. It usually appears with floods of texts and it might hurt your eyes. This could work as one boring factor for this anime if you don’t know much about the culture of Japan or others. BUT if you can understand those, you will enjoy it too. Also, there are a lot of bloods and fanservices in this anime. Hell, but they are all for good fun of randomness.\\n\\n\r\nArt is one aspect that will please your eyes. Simply beautiful. Although, the character design looks simplistic or inconsistent, SHAFT's uniqueness covered this negativeness brilliantly. First, there is bald guy called 'Maeda', flying all around during the episode. Also, if you are otakuistic enough, you will be able to find tons of references from other anime, manga or events. Hilarity. There are tons of vector style art shown. Slideshowtic monochromes with the texts are also the elements that entertains our vision. \\n\\n\r\nSound is similar to art. Lot of random signals are there, sometimes, totally irrelevant sounds such as scream of ‘monkey’ randomly comes out. It creates even funnier atmosphere throughout the whole anime. \\n\\n\r\nAlso, OP and ED. Very unique. OP animation for first three episode is… blank, or occasional freakin bald guy or copy and pasted articles. After third episode… op animation can be VERY DISTURBING for some people though it was very creative. Op was sung by Kenji Ohtsuki, who also did famous ending theme for Welcome to the NHK. Ending animation also shows how unique animation style that SHAFT has. I enjoyed a lot.\\n\\n\r\nAha, the most important aspect of this anime, CHARACTERS. They are all extreme cases of phenomenon found in Japanese society. Extreme case of negativity, extreme case of perfectionism, extreme case of Hikikomori, extreme case of yaoism, extreme case of spirit personality… etc etc… Very stereotypical characters, but when all of them is in group... INSANITY. All the characters are lovable and unique themselves. Truely inspirational.\\n\\n\r\nVoice acting; Superb. Kamiya Hiroshi's ‘Zetsubou Shita’ stings on our heart deeply. A lot of other voice actors/actresses are also great at their role.\\n\\n\r\nI enjoyed this anime a lot. But, I have to say that this is NOT an anime that everyone likes. A lot of incomprehensible will make this show boring for some. Also, having little knowledge about Japan will decrease the humour in this anime dramatically. There are few segments that even myself thought ‘bah, it’s pretty boring’. If you haven’t watched many animes, you will miss out most of the references and get annoyed. \\n\\n\r\nAlso, this anime got lots of rave reviews from other countries like China and Korea, for being ethnocentric. There are few moments that even myself (Korean) felt, 'WTF THAT'S NOT TRUE'. \\n\\n\r\nBut, whether it annoyed me or not, fuck it; enjoyment 10/10\\n\\n\r\nSo, to sum up, Sayonara Zetsubou Sensei is a rare kind of anime you can't miss. If you want anime, with filled with satirical gags with full of despair, here it is; this is an anime for you.\\n\\n\r\nHmm... so the last word;\\n\\n\r\n“絶望したっ!”",
            "date": "2009-11-27T02:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 20889,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/225515.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ringoo4",
                "username": "ringoo4"
            },
            "url": "https://myanimelist.net/reviews.php?id=20889"
        },
        {
            "content": "Writing a review for the Zetsubou series, is like writing about MC Escher's stairs. The concept is cool, the art pulls you in, and every time you look at it, there's something new you didn't quite catch the first time.... But you have absolutely no idea why it was made, or what the hell is going on. Zetsubou is one hell of a wild ride, mixing so many thoughts and ideas you always knew about, but never questioned. It pushes boundaries, and creates an experience most viewers wont soon forget.\r\nNow, if your looking for a deep plot with involving characters and a decent conclusion, thenZetsubou is probably the last place you would want to look, mostly because the plot is non existent, or barely there. The entirety of the story is: A teacher, who has a bit of a suicidal tendency, does \"stuff\" with his class. And when I says stuff, thats what i mean. No episode is connected to another and in fact, most go through 2 - 3 stories over the course of the episode. Thus the point of Zetsubou, isn't so much to create a story telling experience, it is more of a show that addresses modern day problems and discusses what we do about them. Now, that may seem like a very broad range of topics to cover, but Zetsubou is more than up to the task, talking about some of the least thought about topics and throwing them out into broad daylight. This doesn't really count as a story or plot... but its definitely enjoyable and heartily worth watching for this aspect.\\n\\n\r\nAnother aspect to look at is the characters, which there are a lot of. Each character is fascinating in the fact that they all have one and only one trait about them. This trait is so prominent that it is usually easier to remember each member by that trait rather than their actual names. There's the perfect girl, happy girl, abusive internet girl, girl who loves cute tails, stalker girl, illegal immigrant girl, returnee girl who has a split personality etc etc etc. And of course you have despair sensei himself, Zetsubou, who all in all is a pretty similar character to his class in that he really only has one trait. His trait is... a want to commit suicide, but a fear of death you could say. Hes a very hypocritical character and very entertaining to watch. Now i haven't really said much about the characters aside from their one trait, and that's because the only real way TO review them is to state off their characteristic. Some could say that because of their singularity, they aren't exactly great characters, but the way that this story is told, the episodic nature of the series in general, makes these characters the perfect fit. You'll always pick out your favorites and give a little shout of joy every time its their turn to say the line. Overall, the cast is simple, yet very effective. \\n\\n\r\nWhere Zetsubou falls a bit short, is in its humor. Now don't get me wrong, this show has many many funny and random moments will have you flailing on the floor in fits of merriment at the sheer stupidity of it all. But the problem with it is, a lot of the jokes are based on a deep knowledge of the Japanese culture. Lots of puns with the different characters, or reference to Japanese traditions, that for the most part, will fly over the heads of a lot of people that aren't very well versed in Japanese culture. Now i can't blame the creators for this, I mean the show was obviously created for a Japanese audience and I wouldn't have it any other way. Just know that if you haven't lived in Japan, taken a Japanese culture course, or watched more anime than you have regular cartoons, then there will be quite a few jokes that will simply pass you by.   \\n\\n\r\nOverall Sayonara Zetsubou Sensei is an amazing show, full of inovative ideas, told in a simple way that will still surprise you at every corner. Its a show that won't drag you in deep and keep you locked in your seat for the entire season, but it will leave you thinking at the end, with a very satisfied feeling. A definite recommendation, and 5/5 Stars all around. This show will (not) leave you in despair.",
            "date": "2010-04-06T15:37:00+00:00",
            "helpful_count": 12,
            "mal_id": 24755,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/312392.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/leingodf8",
                "username": "leingodf8"
            },
            "url": "https://myanimelist.net/reviews.php?id=24755"
        },
        {
            "content": "Sayonara Zetsubo Sensei is about a depressed teacher who would like nothing more than to die, but whose attempts are usually foiled by his students, who all seem to have social quirks of their own. The series starts with Zetsubo trying to hang himself from a cherry tree when he is interrupted by a girl optimistic enough to be his polar opposite. After escaping a conversation with what he sees as an annoyingly bubbly person, he arrives at his classroom the next day and realizes the girl is one of his own students. Zetsubo's full name when written horizontally reads as \"despair\" and as theseries progresses it is shown the rest of the students similarly have names that are written puns on their personalities.\\n\\n\r\nI was a little annoyed at the art style used in the show at first as it comes off as really cheap (especially when you watch on a streaming website) patterns are paint-bucketed in instead of drawn (example: Zetsubo wears plaid kimonos often and the stripes align horizontally and vertically no matter what section of the garment they're on or how he moves). But it soon becomes apparent that the visual style is entirely deliberate as at various times lighting and atmospheric effects are employed, and with a quality video source you realize the linework is actually fairly well done. The music has a wonderful quirkiness about it that fits well with the show, with opening and closing songs that are odd but fun nonetheless.\\n\\n\r\nUnlike most animes I've seen Zetsubo is episodic and the story does not build upon the plot of the previous episode (except for new characters introduced).  It's primary shtick is spontaneity and the clashing of the various characters' personalities, along with some sketch comedy and monologues. Small jokes and random phrases are written on the blackboards through most of the classroom scenes, and the show uses cut scenes often. Unlike the cut scene jokes of Family Guy however, these cut scenes never have any real connection to the show itself generally, and are more thrown in to make the viewer go &quot;what was that about?&quot; The show was hilarious for the first six episodes or so but random craziness can only work for so long, and the laughs began to tapper off after that. More of a sketch comedy aspect was used towards the end. But I still recommended it if you want something entertaining and lighthearted.",
            "date": "2008-07-01T17:22:00+00:00",
            "helpful_count": 11,
            "mal_id": 5958,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60494.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/nx6",
                "username": "nx6"
            },
            "url": "https://myanimelist.net/reviews.php?id=5958"
        },
        {
            "content": "Ah, Sayonara Zetsubou Sensei! Before I begin, let me state that I watched this anime in two days while at a sleepover with some friends, which means some episodes were watched really late into the night/morning. This may have affected my perception of the anime to some degree due to severe sleepiness. Also, this sleepover happened about 6 weeks before I wrote this review, so I may not remember every little detail about what I am discussing. Forgive me. ^^&rsquo;\r\nStory- Sayonara Zetsubou Sensei&rsquo;s (SZS) story revolves around a group of schoolgirls (OK, there is one moderately important male student, but no one REALLY cares) andtheir suicidal teacher. Together the class and their teacher engage in everything from normal classroom conversations to stalking each other, to hibernating in their teacher&rsquo;s (Itoshiki-sensei) house for a night. Each student in the class has one dominant character trait and these traits are usually set up so that they make fun of or satirize some aspect of modern culture. For example, we have Kafuka Fuura, an overly optimistic girl who is so bent on looking on the bright side of things that she is completely blind to all the horrible things that may be happening around her. She embodies the popular notion that optimism is the best way to go through life, but this optimism made her so na&iuml;ve that she cannot even begin to comprehend the evils, sadness, or injustices in the world- including her own parents&rsquo; suicide. Another such student is Kiri Komori, a hikikomori (or shut-in) who has stayed inside and skipped school for so long that her skin actually glows white. She embodies the increasing number of young people in Japan who have become hikokomoris themselves and have thus isolated themselves from any form of human contact. Then, of course, we have Itoshiki-sensei himself. He is a man so pessimistic that he attempts to commit suicide on a regular basis. This is most likely not only satirizing middle-aged adults going through mid-life crises and such, but I also interpreted it as satirizing the increasingly popular &ldquo;emo&rdquo; movement in young people today which glorifies and romanticizes depression and angst (a disgusting way of life, if you ask me). As you can see, these characters have quite a bit of depth to them and the various situations they are thrown into are usually hilarious and funny to watch. However, these situations and stories are not always funny, most likely due to the content being lost in translation during the subtitling process. This makes for some fairly boring parts in the anime as well.\\n\\n\r\nArt- SZS is definitely unique and stylized. The artwork used in the anime makes use of more subdued colours that fit well for SZS&rsquo;s dark thematic overtones that serve as a basis for its comedic elements. A fair number of scenes in the anime were done in different styles of art, including scenes that made SZS look like an old silent film or some trippy video from the 80s. This range of artistic styles was both interesting and challenging to watch at the same time.\\n\\n\r\nSound- It has been too long since I&rsquo;ve seen SZS to properly comment on its sound. Nonetheless, there are two parts of the show that I clearly remember in terms of sound/music- the two opening/ending themes (Ito toshite Jiku ga Bureteiru and Zessei Bijin). I enjoyed both these songs for the way they integrated 1940&rsquo;s swing music with J-pop (Zessei Bijin) and for their fast-paced hardcore melody and instrumental track being juxtaposed against the voices of young Japanese schoolgirls who will take over the melody of the song every now and then. Both songs make for great listens and I will often have them blasting in the car when driving long distances. XD\\n\\n\r\nCharacters- I have already went to a good amount of depth with the characters in the &ldquo;Story&rdquo; portion of my review. Thus, in summary, the characters are interesting, diverse, and each play in an important part in representing various negative aspects of modern Japanese culture (even though they are taken to the extreme in the case of SZS). Awesome characters- too bad they don&rsquo;t develop much during the plot (not that it matters much in a comedy-esque anime).\\n\\n\r\nEnjoyment- SZS was a fun and enjoyable anime to watch, especially in a group of friends. It made all the funny scenes all the funnier to watch and then allowed us to take them further as we made up our own jokes based on the anime after watching it. Unfortunately, as I mentioned earlier, I was fighting sleep during the later episodes which made some of them seem too lengthy and stretched out in some cases. That combined with the fact that some of the scenes that were supposed to be funny just didn&rsquo;t strike a chord with me brought down this rating to a 6/10.\\n\\n\r\nOverall, this hilarious anime rooted in satire is definitely worth a watch. However, if you aren&rsquo;t laughing or at least smiling after the first few episodes, chances are that this anime is not for you: many of the later episodes are similar in tone and style. \\n\\n",
            "date": "2008-08-18T14:17:00+00:00",
            "helpful_count": 10,
            "mal_id": 7266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/59662.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/UchihaItachi6660",
                "username": "UchihaItachi6660"
            },
            "url": "https://myanimelist.net/reviews.php?id=7266"
        }
    ],
    [
        {
            "content": "One of several outstanding displays of the raw creative talent possessed by the individuals at Shaft, but irrecoverably marred by the all-too-common, subculturally sanctioned sickness on display by the creators. Shaft anime drives me absolutely bonkers because their work was and is some of the most unique and engrossing animation that I've ever seen, but it's so often wasted on indulging the petty whims of the creators, which can range from boring and rapidly dated non sequiturs from internet culture to the revolting but widely tolerated pedophilia typical in otaku culture. SZS will take you on marvelous journeys replete with interesting samples from the historyof Japanese visual culture and mind-bending travels to the edges of abstraction which are beautiful and never lose their representational power, but then if you have a remaining ounce of moral sense it will rip you right out of it when it turns out to be a setup for one or more jokes that center on sexualizing one of the female students, and you've probably already turned the show off when you realize that the opening credits for much of the series is just a grotesque reel of the female protagonists in bondage. The music, the excellent art, the style rife with gorgeous anarchonisms, and even the central conceit of a suicidally depressed teacher and a class full of madcap students, all of this should work so well together, but ultimately, like so many other products of otaku culture, the virtuoso displays of skill disappear down the drain of predatory otaku self-indulgence.",
            "date": "2017-05-29T20:15:00+00:00",
            "helpful_count": 5,
            "mal_id": 248846,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6277832.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/totalbodyworkout",
                "username": "totalbodyworkout"
            },
            "url": "https://myanimelist.net/reviews.php?id=248846"
        },
        {
            "content": "This is a compilation review from the HTWA!\r\n\"whenever i hear sayonara zetsubou sensei i instantly think ZETSUBOU SHITA and randomness! they always present probable ideas which transforms into crazy ideas in the end because of exaggeration. and it's these crazy ideas that makes SZS fun to watch. add to that an overly pessimistic teacher, an overly optimistic student and a bunch of other interesting characters and you got one fun, crazy show!\" - icemachine\r\n\"he Sayonara Zetsubou Sensei series are like marmite. You'll either love it or hate it. I fall under the former category, which is a definitely a good thing lol. Each character ispretty interesting in their own different way, and the interactions between these characters and the nonsensensical situations they encounter is what makes it so good, in my opinion.\\n\\n\r\nSadly though, I started losing interest after Zoku sayonara Zetsubou Sensei, as the show starts to become repetitive and somewhat predictable, and also beacuse I'm the type of person who DOES demand at least some shred of a plotline. I guess it can't be helped though, there's only so much a gag manga can do in terms of plot progression.\\n\\n\r\nI'd place the SZS series, as a whole, at a 9. I really think Goku SZS brought the series down overall.\" - xRush\\n\\n\r\n\"I love the characters. The randomness, not much. It's probablymost definitely one of those series I constantly had to pause every few seconds or so to keep up with the subs. Too. Much. Text. O_O And because of that I do not think it's good for them beginners. Nonetheless I find the jokes witty and humorous. Oh, and the soundtrack. The music especially the OPs and EDs of its seasons are what I like best. Perfectly suit the anime and give off a kinda creepy vibe. IIRC, my score for this is probably a 7.\" - Wetpantsu\\n\\n\r\nHope you have found this review useful!",
            "date": "2010-05-03T14:40:00+00:00",
            "helpful_count": 9,
            "mal_id": 25698,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/142613.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/HowToWatchAnime",
                "username": "HowToWatchAnime"
            },
            "url": "https://myanimelist.net/reviews.php?id=25698"
        },
        {
            "content": "Story: 1/10\r\nThere is no story.\r\nArt: 6/10\r\nPretty ordinary, but I did like it's contrasting colour-scheme and character design. Not bad.\r\nSound: 3/10\r\nNothing special, the voice actors worked with what they had I suppose. They did their job well. The music was terrible and unbefitting of situations, as if the creator were purposely making a mockery of it's own soundtrack. Eh, it was kind of funny for the first few episodes guys, but you can stop now. I know this anime is a joke.\r\nCharacters: 3/10\r\nThere was no development, you never really found anything out about them. As for Zetsubo himself, he's the only character you gain any realinsight into, but it's not nearly enough to paint a proper picture of a man. The only thing of interest here is obviously his tendancy to think the worst of every situation, and his quickness to try and end his own life.\\n\\n\r\nEnjoyment: 6/10\\n\r\nPretty enjoyable to watch, it has a charm in it's dialogue unbeknowst to a lot of other anime. The energetic teens coupled with the melancholic tones of their sensei makes for an interesting backdrop to an overall dull experience. Plus there's a few honest laughs in there, and the fan-service is sure to keep males with a thing for schoolgirls at least half-interested in the going-ons.\\n\\n\r\nOverall: 5/10\\n\r\nThe tale of the dissatsified teen is one I feel has been told too much, and make no mistake, that's what Sayonara Zetsubo Sensei is. Under it's guise of sensei/ pupil monotony, lies an even less meaningful status quo, a simplistic harem of day to day nonsense mixed with the melancholy of a late bloomer. Yes, for all it's praise, and the breaking of the fourth wall by making fun of itself every two minutes, all this anime amounts to is a silly harem full of nonsensical garbage. Although having a quaint charm in it's dialogue, overall the anime itself felt like nothing special, something I'd seen before. Something you take a look at, and think, \"haha, that is how some people are these days\" then shake your head and move on. But maybe, I was missing something? The only reason I kept watching after the first episode was to find out more about the characters, because they are, apparently, what makes this anime... I was disappointed. It's absurd to say character development is even existent in this series. Each episode is literally dedicated to one character a piece, out of this class' band of misfits, and yet, I still failed to learn anything of worth about a single one of them? They weren't characters at all, they were designed to be character stereotypes, and each episode was another writers' handful of pet-peeves they had concerning each one, sprinkled in with some typical slice-of-life humour and panty-shots of course. It left me wondering, how could people I know have eaten this hipster shit up like a giant bag of frosted dickcakes, and then gone back for more each week with the stains of their pevious shame still adorning their neckbeards? But then I realised I had answered my own question.\\n\\n\r\nI'll leave it there because that's pretty much all I have to say about Sayonara Zetsubo Sensei, and I think it's quite apt to leave on my main point. It contains nothing of consequence. Absolutely nothing. For all it's 'contraversial' nature and 'quirky' characters, it will leave you wanting. Wanting something of substance, not another dick-flavoured cupcake.\\n\\n\r\nYou'll like it if you enjoy the slice-of-life genre avidly, if you don't really watch much of that, then you'll hate it. You'll hate it more than cupcakes that taste like dick.",
            "date": "2016-01-22T19:17:00+00:00",
            "helpful_count": 9,
            "mal_id": 209153,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/beverkeb",
                "username": "beverkeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=209153"
        },
        {
            "content": "Here's an anime to simply enjoy. Sayonara Zetsubou Sensei separates itself from other comedy series, with its lack of solid plot, interesting characters and new stories to tell every episode.\r\nDon't get it wrong, its lack of plot is very refreshing, different from the usual. For once, there are no cliffhangers, no twists, no complex character development. The only thing to forward is the next episode. You may know what's coming up next, but how the characters will deliver it, or deal with the topic is something to look out for. \r\nFor me what made the series interesting is the characters, each with their unique personalities.How random can they get with a hikikomori, an animal lover, a schizophrenic, a stalker, and an illegal immigrant? There is only one normal person in the whole series and being normal also makes her stand out. I know, I sound crazy by just talking about that, so you can just imagine how crazier the series is. Also, the personalities correspond to their names. \\n\\n\r\nAnother thing to comment on is the animation and the sound. The characters are well-drawn and are brightly colored. The OP and ED songs are very catchy. I appreciate the work done on the backgrounds as they very highly detailed and perfectly match the quality of the characters. The OP and ED also change every now and then, also with very detailed themes. Well done.\\n\\n\r\nWith a whole class (plus some other people) with different characters to uncover, 12 episodes is not enough to contain the craziness. Watch out for other installments of this series, which are still of the same quality and level as this one.",
            "date": "2009-01-05T03:08:00+00:00",
            "helpful_count": 9,
            "mal_id": 11121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/116627.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/tg-jade",
                "username": "tg-jade"
            },
            "url": "https://myanimelist.net/reviews.php?id=11121"
        },
        {
            "content": "1st Impression:\r\nhuh , depressing anime ..? do not want. Hmm? the op song trying to show a message of..?\r\nSelling point(s):\r\nDark humour, randomness including bizzare cut scenes, fanservices.\r\nReason of liking the anime:\r\nHonestly, the anime doesnt have solid storyline , but they have it well done with the randomness and ways of expressing the dark humor regarding the current society, throughout the interaction of the sensei with his selected a few problematic students. The art itself isnt as flashy as other anime, it's simple, but yet leaves quite a strong impression . I dare to say it's a mind f*ck anime :P .  Fanservice..for the 1sttime , it doesnt get annoying, it does have a lot , but it only shown in a short time, which hardly get people to hate or skip them.  Overall, it's quite a refreshing anime  for its definition of 'comedy'.\\n\\n\r\nWhat I Dislike:\\n\r\nThe pace of the anime might be too fast sometimes , which requires you to pause the video to see it clearly.\\n\\n\r\nAdvice(s):\\n\\n\r\n1) Age 17+, Not for people who hates randomness, twisted and sick anime.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2008-01-12T19:21:00+00:00",
            "helpful_count": 8,
            "mal_id": 1962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19740.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Dj_Frog",
                "username": "Dj_Frog"
            },
            "url": "https://myanimelist.net/reviews.php?id=1962"
        },
        {
            "content": "\"I'm in despair!\" so said Itoshiki Nozomu (Mr. despair).\r\nTo begin with, the anime have no story. Evey episode have his own story. \r\nItoshiki is a teacher in highschool. He is the class teacher of a class full of girls (there are some boys though..) and every girl have her own wierd habits. \r\nItoshiki is getting despair from things that usually make one lough. he is teaching his students that life not promising and only lead to despair. On the contrary, Kafuka Fuura, one of his students, who always sees everything in the most optemistic way, showing him that life not so bad.\r\nin every episode Itoshikigetting depressed and so on.\\n\r\nI LOVE this anime and especially it's music.",
            "date": "2010-07-27T03:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 28976,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/345827.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/oasismii",
                "username": "oasismii"
            },
            "url": "https://myanimelist.net/reviews.php?id=28976"
        },
        {
            "content": "Sayonara Zetsubou Sensei - 9/10\r\nI really really want to give this show an 8/10 because that's what it really deserves, but because i love the op song and the soundtrack in general so i'll keep it a 9.\r\nSo, SZS's main cast consists of Itoshiki Sensei and 12 schoolgirls and one teacher. All the characters have some kind of mental issue or problem/characteristic which is the main source of humor in this show. For example the Hikikimori girl who never talks and whenever Itoshiki sees her, he just walks off, Kafuka who is overly postivie and childish (she said her Father was trying to become higherusing a rope and a tree, just like Itoshiki when he was trying to hang himself), or maybe the Stalker girl Mayoi who is pretty much in every scene just staring at Itoshiki and sitting under his desk and such. Those problems are exploited to different situations and are mocked to no end, maybe taking a stereotype character isn't exactly the most creative way but the way SZS makes use of it truly allows for some funny situations.\\n\r\nOne thing i must say as a warning, half the humor comes in writing on the boards, just text slides and more, just what you'd expect from SHAFT, but here it's to a whole new level, aswell as considering the show's relatively low budget, which actually suits it very well and makes it feel less serious.\\n\r\nAlso some humor (especially last episode) mocks Japan and to understand it you have to have some understanding of Japanese culture and Japanese people's mindset, also one of the girls is a typical \"gajin\" so if you're offended by Nips taking a piss at way a typical foreigner girl acts (to be precise like a whore and a source of pantyshots who starts sueing everyone when she gets the chance) and there's even a joke about \"fanservice for Russian otaku\" with her being blonde and blue-eyed, so if you're offended by this show, go fuck yourself and watch some mediocre comedy like Oreimo or something.\\n\r\nThere isn't really much to this show if you don't like the characters, or take them seriously. The art reminds me that of FLCL, thus lack of 3DCG and complicated backgrounds, but since this is comedy there's not much animation and more text and dialogue, but if you watch SHAFT's adaptions like Monogatari then you're used to that anyway.\\n\r\nAlso this show isn't a harem, really, it has a female cast because.... no real reason as far as i could tell, aside from making it more fun to watch?\\n\r\nI guess the first half of the show is much better, since it dedicates a character an episode, but the latter half really just reuses the same jokes in different context and creates some character unrelated comedy which still works well.\\n\r\nI really hope there's more in the 2nd season, because just repeating the same thing won't exactly work out.",
            "date": "2015-03-28T17:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 183800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4042687.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DanteMustDie8907",
                "username": "DanteMustDie8907"
            },
            "url": "https://myanimelist.net/reviews.php?id=183800"
        },
        {
            "content": "this is one of best anime series that i can think of.this anime is very different from most of anime and its about how zetsubou sensei is DESPAIR about his life and students are making action or comment about it.the character has many different personality and each student is very funny and i laughed every episode.most of the time, story is not related to next story so its like each episode is one little season.if you're thinking about watch or not, you should watch it because this could the best comedy anime you can find.",
            "date": "2010-06-08T21:39:00+00:00",
            "helpful_count": 6,
            "mal_id": 26944,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/327107.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/NekoAppleX",
                "username": "NekoAppleX"
            },
            "url": "https://myanimelist.net/reviews.php?id=26944"
        },
        {
            "content": "Zetsuboshita! People giving reviews on the internet not knowig what they do, has given me despair(zetsubou)!!!\r\nSayonara Zetsubou Sensei deserves a proper review. All these guys below me didn't do a proper job. because you can't rate Zetsubuou-Sensei as a normal anime.\r\nIf you do, you give it a 6 or maybe a 7. It has no story at all, only introductions and the episodes always have one theme they go about.\r\nThere is no fights, no love story, no ecchi and the lolli they could have done isn't touched at all.\r\nAll the 7 remaining points might be given for the animations, because they are art in it'sfinest way. All with that japanese sense for calmness and perfection and so many drawing styles. It has infinite.\\n\r\nBut Sayonara Zetsubou Sensei has one thing above them all.\\n\\n\r\n\"Vegeta, what does the scouter say about this shows humour rating?\"\\n\r\n\"It's over NINETHOOOOOOOOUSAAAAAAAAAAAND!!!\"\\n\\n\r\nSayonara makes fun of society and the people living in.\\n\r\nImagine a classroom with a suicidal teacher so pissed by every inch of humanity that he tries suicide 90% of the time.\\n\r\nBut the pupils in the class are all girls, and all stereotypes. There is one girl so normal and so happy it hurts. There is a girl showing her panties all the time while sueing everybody who looks and many many more. Together they explore japanese culture and modern life, while trying to keep their teacher from dying.\\n\\n\r\nThe show is firework of gags, running and one-timers.\\n\r\nIt is a finger into societys face screaming:\\n\r\n\"Look how stupid and ignorant you are!\"\\n\\n\r\nSayonara Zetsubou Sensei is a boldheaded old man with sunglasses turning his head where a normal show would have his censorship.\\n\r\nSayonara Zetsubou Sensei is the anime I would take on a lonely island with me.\\n\\n\r\nAnd in my 15 years of otakubeing I have never ever seen a subtitle translation so perfected. They translated each joke and every written thing and explained a lot of the japanese language gags to the western reader.\\n\\n\r\nThere are more seasons of SZS and they get crazier with each one.\\n\r\nGive your best and see how far you can climb on this ladder of insanity!",
            "date": "2015-12-17T05:57:00+00:00",
            "helpful_count": 6,
            "mal_id": 205758,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5055514.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zetsubou-kami",
                "username": "zetsubou-kami"
            },
            "url": "https://myanimelist.net/reviews.php?id=205758"
        },
        {
            "content": "“A pessimist sees the difficulty in every opportunity; an optimist sees the opportunity in every difficulty.” \r\n― Winston S. Churchill\r\nI find that quote to be a very fitting mindset to have while watching this series.\r\nSayonara Zetsubou Sensei is not your average gag/satirical anime. What should be dark is funny and even when we think the world is as dark as the bottom of the ocean, this series somehow manages to throw in a shred of light and bring about laughter in such dark topics.  \r\nTo be honest, I enjoyed this show because I am a pessimist my self much like the main character (wellnot to that extreme). Many of the dialogue or jokes within the series are actually social commentary. And if you are a big anime/manga fan and are decently informed about social issues, politics and current events and the like, this should be quite enjoyable for you. \\n\\n\r\nYes there are cheesy moments in the show but I never felt at any point that the creator of this show tried to take advantage of the audience by presenting cheap fan service shots or tried to forcibly invoke laughter. \\n\\n\r\nVisually, Sayonara Zetsubou Sensei is moderate at best. Not too many flashy colors, not to dull either, a good balance and I'd say the animation is definitely easy on the eyes. The artwork on the still frames are very vibrant and enjoyable too. \\n\\n\r\nThe audio is just awesome. The OP and ED  snippets are a little crazier than most of the animation in show but it really gets your attention. The voicing in this series isn't half bad either. I don't know too much about Japanese seiyuu but for the purposes of this show, they get the job more than done.\\n\\n\r\nTo wrap things up, this anime is a must watch if you really enjoy dark humor and satire. A little psychotic perhaps to spice things up, and definitely a little more psychological than the usual brainless cheap laugh inducing fan service laden gag anime. It is a must watch. \\n\r\nOverall experience and after thoughts: 9/10",
            "date": "2012-12-27T21:48:00+00:00",
            "helpful_count": 6,
            "mal_id": 81614,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/311961.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/InsaneAZN22",
                "username": "InsaneAZN22"
            },
            "url": "https://myanimelist.net/reviews.php?id=81614"
        },
        {
            "content": "First time I watched this. I thought it was pretty funny, but at the same time. Boring as hell since nothing was really happening.\r\nThis is something you would watch if you understand the humour and not looking for anything else than Comedy.\r\nI don't know why. But I tried to watch this, but I get tired and fall asleep. Sometimes its really funny, but most of the times. It's just regular jokes that's funny but you don't laugh at it. \r\nI think this is a Series you would enjoy much more watching with a friend.\r\nStory 7\r\nThe story is about the teacher (Nozomu Itoshiki) and all hisnegative aspects of life. Leading a class of students with a Girl (Kafuka Fuura) that's the complete opposite of him.\\n\r\nHe constantly tries to take his own life when he is in despair, but his students in his class always prevent him. He always tries to teach them his own personal aspects of life, leaving the students in desperation but then at the same time, proves him wrong.\\n\\n\r\nThe story itself its just him and his class. Some students are unique and kinda different in a weird way. Also his associate is always a shown in a perverted way.\\n\\n\r\nThe story was the only that kept me almost going asleep after seeing 1 episode. I wanted to see more but at the same time, i got bored since the story is not developing. What was developing was the relationships. More I will not say to spoil anything.\\n\r\n If you love the humour in this Series, you will love the Series. I think the humour is pretty funny, sometimes I literally had to pause the video until i stopped laughing. And sometimes, it was nothing special.\\n\r\nA very good comedy, only lacks a more deep story. But I'm sure this will be shown in the sequels.\\n\\n\r\nArt 8\\n\r\nThe art itself is simple but beautiful and well made. It kinda fits with the comedy feeling. At first, you could think this series will be bad since the art seems so plain and simple. But it's well done and much come in to play with the comedy. \\n\r\nIt is great, could have been better with a touch of more regular drawings.\\n\r\nI felt the hair on everyone was WAY to simple and almost everyone is blacked hair and the hair itself is not very creatively done. \\n\r\nIf you really cant get used to the art, it will effect your enjoyment experience. \\n\\n\r\nSound 10\\n\r\nMusic is amazing. The tracks fit perfectly in regard to what is happening. It's very creatively done and fit so well. It's indescribable. The Teacher is also voiced by Kamiya Hiroshi which is a great voice actor whom I love a lot. He also voices the main male character in Angel Beats and Arakawa Under the Bridge. 2 Excellent series worth watching and recommended if you seen his one.\\n\\n\r\nCharacter 9\\n\r\nI love the Teacher. He is right and at the same time wrong. It's very funny how he never succeeds to take his own life. You wont find anyone like this one. He is indeed one of the weirdest characters ever. His characteristics are a masterpiece indeed. \\n\r\nHis students especially Kafuka Fuura are all students with unique characteristics. Both good and bad attributes that makes the teacher go mad or just accepts it. And they all just get more and more involved.\\n\r\nWhat I love about them all is the conflicts they have between each other.\\n\\n\r\nEnjoyment 9\\n\r\nI give this series a 9 when I actually felt like giving it 6 or 7.\\n\r\nReason is, this is a very good and funny series. What held me back was that I felt like the story didn't go anywhere, it felt like it was fillers though it wasn't.\\n\r\nI liked it a lot, but I fell asleep which was annoying. But this series deserves a high number on Enjoyment.\\n\\n\r\nOverall 8\\n\r\nThis is a very good Comedy series. If you are just looking for several good laughs and sometimes maybe hard laughs. Watch this series. I recommend watching the sequels as I feel like the story will develop more. This is just the start \"getting to know the characters\". It's very funny and well made.",
            "date": "2011-02-11T17:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 34425,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/400203.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Cornholio77",
                "username": "Cornholio77"
            },
            "url": "https://myanimelist.net/reviews.php?id=34425"
        },
        {
            "content": "The show is really depressing, but funny as well. I guess you could say this is a show about laughing at other people's pains. Almost everyone seems to have problems in this. I guess you could say that it’s like Ren and Stimpy, Ugly American, and Moral Oral all rolled up in one. If you don’t like those shows, then you probably might not like this because even if it’s not really disgusting, it is rather dumb for funs sake. The whole show pretty much is like a long conversation with the branches into other ideas and such, and mostly feels like it's actually critiquingthe Japanese government and culture. They love to play into the mind of the characters so it does get a bit odd and not always in the realistic fashion.\\n\\n\r\nThe characters and everything are really a whole play on words, their names meaning pretty much there personalities in Japanese. This does get lost to people who do not know any Japanese and how it’s written. For instance, when you write down Nozomu Itoshiki’s name western style, it becomes the word “zetsubou”, meaning “Despair” hence the name of the show. It goes on with Rin Itoshiki, his younger sister, who when written horizontally becomes “zetsurin” (“unequaled”), Mikoto Itoshiki, his brother, who resembles “zetsumei” (“Death”), and Chiri Kitsu, one of his students, whose name is created from the word “Kitchiri” (“Precisely”) shown when she tries to make everything equal, and also has the kanji for “senrigan” (“Clairvoyance”) and she does show she has psychic principles. The same is done with almost every character although I will not put all of them here because there is a lot. There is no short to characters in this and it’s sometimes hard to keep all of them straight but it seems most of his female students fall in love with him at least in one point.\\n\\n\r\nThe show has a lot of the same feelings as Welcome to the NHK, being very abstract and out of control though the animation is rather dark. Many times, I had trouble seeing something because it was so dark. The feel is that of a film being played along with the way the characters are dressed and some of the items around, it makes the show feel older than it is. The only times it really is bright is around Kafuka Fuura, probably to show how optimistic she is all the time but pretty much everything else is either washed out of has a layer of sepia tone layered over. All around the place, there are strange little writings on the walls and in the background that spout little nonsense that means nothing to the actually story line and every time the camera turns back to them, they are different. It’s a interesting little piece. There is a lot of fan service, especially for the American girl and a very strange guy who shows up everywhere in the most random places. It’s normally just a little circle with some guys face in the center and it could be in the background or covering something up. It’s not an anime face but a photo that is placed there which is just really on.\\n\\n\r\nThe music is rather odd, and I guess fits with the show though it’s kind of hard to talk about it. I really want to see this dubbed because it's really hard to read all the subs and look for the little tidbits that are in it.\\n",
            "date": "2012-06-28T16:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 64675,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1286603.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/angelsreview",
                "username": "angelsreview"
            },
            "url": "https://myanimelist.net/reviews.php?id=64675"
        },
        {
            "content": "Do you like animes with action, heart wrenching stories, and drama? Well, you're in the wrong place. Sayonara Zetsubou Sensei has none of that. However, that didn't stop this anime from instantly becoming one of my favorites.\r\nSayonara Zetsubou Sensei starts off with a young girl, Fuura, who is walking to school, only to be stopped by seeing Nozomu Itoshiki, her teacher she finds out later, hanging himself on one of the cherry blossom trees. Fuura saves Itoshiki by yanking him and snapping the rope from the tree. Next thing you know, Itoshiki is telling Fuura, \"Are you crazy?! What if I had died!?\" And thecraziness continues on from there.\\n\\n\r\nThe story basically is low mainly because... well, there really isn't one. Most of SZS is basically a teacher and his students talking about several things (more like flaws) in Japanese culture and society. It may be hard for someone who doesn't know a lot about the Japanese culture, politics, etc, to get all everything that happens in SZS. However, even if you don't know much about Japan, you'll still be laughing at some of the crazy antics going on in Sayonara Zetsubou Sensei.\\n\\n\r\nThe art I found was something different. I feel like I haven't seen an art style like this before, which is why I'm giving it a 10. It's something different, and the art style is very cute, not heavily detailed, and just very clean. Plus, some of the silly faces drawn in this make me laugh so hard.\\n\\n\r\nSound is not something I excel in noticing. I loved the voice actors though, and I feel they did an AMAZING job with the characters.\\n\\n\r\nCharacters now. Even though they don't develop at ALL, SZS has some very unique characters, all of which seem to have something wrong with them. Itoshiki is constantly in despair and tries to commit suicide every three minutes, all of which are terrible failures. What makes it even worse for him is that even his name spelled horizontally in Kanji even spells out 'despair'. Fuura is practically the opposite of Itoshiki. Even when Itoshiki is hanging himself, Fuura looks at it as making himself taller. Chiri, another one of Itoshiki's students, is practically the female Death the Kid. No wait, scratch that, Chiri is more OCD than Death the Kid. Her hair is perfectly parted, her socks are always up, even her sleep schedule is perfect. See what I mean with all the characters having something wrong with them?\\n\\n\r\nOverall, I loved Sayonara Zetsubou Sensei. I think people that are fans of Hetalia might call this a bit similar with the undeveloping characters and the lack of storyline. However, this is not at all similar. It's very different actually. Watch it and you'll see it's different~",
            "date": "2012-08-27T05:51:00+00:00",
            "helpful_count": 5,
            "mal_id": 70965,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/542429.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/leowatch",
                "username": "leowatch"
            },
            "url": "https://myanimelist.net/reviews.php?id=70965"
        },
        {
            "content": "This review generally relates to the whole Sayonara Zetsubou Sensei franchise since all seasons are extremely similar in their nature.\r\nSayonara Zetsubou Sensei (or SZS), a show based on satirical manga by Kumeta Kouji, has the right to be called one of the most unique and mentionable representatives of \"black comedy\" genre in anime. It involves different types of humour and has a very atypical execution. Basically there's no deep meaning and phylosophical subtext in Sayonara Zetsubou Sensei, but it doesn't feel empty or pointless. Due to its great satirical content the show even might cause you to change your mind about some things in yourlife you never paid much attention to. \\n\\n\r\nStory  (6)\\n\r\nBasically SZS is an episodic sketch comedy, so don't expect to find there any linear storyline - only few minor changes might be noticed throughout episodes. But that doesn't mean this show is boring or too repetitive. All the characters get through a plenty of miscellaneous situations, and setting changes drastically from episode to episode ranging from slice-of-life stories to weird surreal tales. \\n\\n\r\nArt (6)\\n\r\nIn terms of art SZS follows the original manga, so artwork is very sketchy and atypical for anime. Outlines and colouring are kinda rough, and the show is relatively poorly animated, mostly being static. Overall the art might look quite unappealing. However, hard to disagree the show has very unique visual style with its own recognizable features which helps to feel the originality of the show. Furthermore, sometimes visual style changes completely, parodying anime of 80's, famous paintings and so on. Spectacular!\\n\\n\r\nCharacters (9)\\n\r\nAfter gradual introduction of all characters it appears that they are quite numerous, and none of them (except the lead character, Itoshiki Nozomu aka Mr. Despair) is more important for the show than others. Everyone has peculiar manners, behaviour, catch phrases; each character seems very different, but altogether they make up an unexplainable harmony which creates a solid groundwork for jokes and keeps you attached to the cast. The most mentionable character and the main source of dark satiric humour is Zetsubou Sensei himself, or Itoshiki Nozomu. He's a 100% pessimist constantly complaining about flaws of modern society and often attempting suicide, but failing at that every time. I guess there's no need to say how atypical and hilarious he is.\\n\\n\r\nSound (8)\\n\r\nAll of the music is written by Hasegawa Tomoki known for composing background soundtracks for anime show Nana. OST for SZS is very memorable and just beautiful. The only reproach here - a plenty of tracks sound overly dramatic and don't actually fit comical nature of the show. Voicing is done well with no apparent flaws. Every characters' voice fits his/her nature excellently, hard to imagine something more suitable.\\n\\n\r\nEnjoyment (9)\\n\r\nThe primary goal of the show it to entertain the viewer and make him laugh. And this is where SZS truly succeeds. \\n\r\nSo, do you like cultural references? Dark humour? Or social satire? Subtle intellectual humour, maybe? In any of these cases, SZS has something to offer. The show features numerous parodies and mockery, dark satire, intellectual jokes and even self-irony (which I personally consider one the best types of humour). Yet you'd better keep in mind that SZS is not a brainless comedy that can be easily understood by anyone on  instant. SZS makes you analyze information, read a lot of on-screen text and follow quite fluent dialogues - therefore marathoning it most likely wouldn't be a great idea.  SZS can be fully understood only in case you're familiar with  notable examples of both western and japanese culture, and furthermore you'd better have some anime watching experience and (desirably) basic knowledge of Japanese. Otherwise don't be surprised if the anime looks like a random nonsense for you. \\n\\n\r\nOverall\\n\r\nPut in short, here are strong and weak points of the show.\\n\r\nPros:\\n\r\n+ diverse humour\\n\r\n+ lots of parodies and cultural references\\n\r\n+ likeable characters \\n\r\n+ unique visual style\\n\r\n+ great music, sound and voicing\\n\\n\r\nCons:\\n\r\n- unappealing animation\\n\r\n- lack of storyline and any development\\n\r\n- fanservice and harem elements (though both of them are ironic)\\n\r\n- requires basic knowledge of japanese culture and decent anime watching experience\\n\r\n- quite difficult to get drawn into\\n\\n\r\nConsidering all its flaws and trying to judge objectively, this show deserves a score of 7 (good). However, that doesn't mean SZS is just \"good\" if you love dark humour, cultural references and unusual execution. In that case Sayonara Zetsubou Sensei might easily become one of the most amusing, memorable and complex comedies you've ever encountered. \\n\\n\r\nAre you ready to be thrown into DESPAIR?",
            "date": "2014-05-27T14:10:00+00:00",
            "helpful_count": 5,
            "mal_id": 144741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/427654.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Inevitabilis",
                "username": "Inevitabilis"
            },
            "url": "https://myanimelist.net/reviews.php?id=144741"
        },
        {
            "content": "Take one terminally depressed, suicidal adult. Make him the teacher of a class full of psychologically disturbed students, each one of them embodying a mental disorder or extreme character archetype. Add to the mix a great helping of dark humour and social insights, and it can easily be said that Sayonara Zetsubou Sensei is a must see for anyone itching for a comedy series with a side of philosophy and satire.\r\nThere is no plot to follow, characters don’t develop beyond their stereotypes, and often time’s logic is completely thrown out the window. However, it still manages to be the smartest comedy-anime I’ve ever seen. Theideas being given are interesting, and deal with basic truths about society and human behavior. It’s not afraid to delve in taboo subjects either, ranging from jokes about shut-ins, stalkers, drug users, and suicide. Not even the audience is off limits, with some of the jokes taking pot-shots on anime fans and the overly moe-fanatical anime industry. After a while, the basic formula of the show becomes apparent, and it usually it goes like this: One concept is brought forth, built upon, played with by the various wacked out students, and becomes more and more ridiculous. However, with the myriad of unique topics being presented, the comedy remains to feel fresh. Most of the humor is quite universal, although there are jokes that will go over most American viewer’s heads, with jokes and about Japanese celebrities, kanji puns, or Japanese politics. Thankfully these Japan-centric jokes are never the focus of the punchlines, so viewers shouldn’t feel out of place.\\n\\n\\n\r\nAs for the characters, although their personalities are paper-thin archetypes, all of them are incredibly enjoyable. Each character adds a lot to the parodies and jokes because of their own different, messed up perspectives. Needless to say, there’s barely any character development (with the exception of one particular student who’s hinted at being quite darker than what she seems…), however most viewers will find their favorite instantly based upon their own individual tendencies. Itoshiki Nozomu (or Mr. Despair) is by far the star of the show, whose suicidal antics and cynical views remain the focus of most of the episodes. One would think that so much negativety would become grating, but the show manages to pull it off quite well. There aren’t many series where the lead character extends an offer to another to commit suicide with him, and have it come off as being endearing rather than evil.\\n\r\nPhotobucket\\n\\n\r\nAs for the animation, for the most part it’s pretty simplistic, although there are some scenes that are incredibly well animated. What really makes this series feel different are the rapidly varying art styles and angles, which keeps the viewer very much visually stimulated. There’s also a hell of a lot of comedic detail packed into the backgrounds, with the numerous random quips written on the blackboards, or lists of despairs which Nozomu is currently fretting about.\\n\r\nPhotobucket\\n\\n\r\nAll in all, Sayonara Zetsubou Sensei is a very funny comedy series which shouldn’t be missed by anyone who likes dark humor, as well as people who want a smart comedy packed with both philosophy and satire. With most anime comedies either being redundant “slice of life” shows or moe-centric “watching cute girls do cute things”, Sayonara Zetsubou Sensei is a welcome reprieve. \\n\\n\r\nFor more reviews on anime, music, and everything inbetween, please visit http://everythingfornobody.blogspot.com/",
            "date": "2010-11-06T12:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 31862,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/160513.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mc2akapantless",
                "username": "mc2akapantless"
            },
            "url": "https://myanimelist.net/reviews.php?id=31862"
        },
        {
            "content": "ZETSUBOUSHITA!!!!!!!!!!!!!! \r\n^ One of the. Most. Epic. Anime. Lines. EVER!!!!!!!!\r\nSlapstick comedy. \r\nItoshiki Sensei is one of those people who seem to be screwed where ever they go. His life revolves around Despair. Even his name, when both kanji's of his name are put closely together, they spell. ZETSUBOU!\r\nNo matter what, everything is negative in his eyes. Yet oddly, he meets a girl one day (Kafuka-chan~ *coughs* Fake name *coughs*) She found him trying to kill himself one day (he was trying to hang himself). He got out of his noose and talked with her. \"What did you think I was doing?\" \r\nHer response was :\"Trying to get taller. My parents tried to do that as well.\" \\n\\n\r\nAs you can see. He meets his complete opposite. He thinks only in negatives, she's always positive. He returns to his daily life as a teacher...And guess whose in his class!!!! Yes, she is in it. But wait...What's wrong with this class...Everyone is weird....\\n\\n\r\nSo join Zetsubou Sensei in his journey of Despair, along with his students. \\n\r\nYou'll laugh, love the opening and ending songs. And maybe...You will experience. ZETSUBOU!!!\\n\\n\r\n10000000 out of 10\\n\\n\r\nWatch it. It's hard to follow the puns/jokes/etc sometimes, but it's mostly impossible for everyone to follow along with all the jokes, since they are just out there XD.\\n\\n\r\nSo enjoy a great show my friends. \\n\\n\r\nhuh?...You're not going to watch it??\\n\\n\r\nZETSUBOUSHITA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "2012-01-11T22:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 51589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1096637.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Zetsubou_Matt",
                "username": "Zetsubou_Matt"
            },
            "url": "https://myanimelist.net/reviews.php?id=51589"
        },
        {
            "content": "This anime is about a depressed teacher and a bunch of girls who like him because of depression(i know its messed up but thats bacially why they like him).\r\nStory: well as you have heard this is like lucky star and well it has no story what so ever but has very good humor and it flows pretty nicely.\r\nArt: i like the art very... different you'll know what i mean when you watch it\r\nand the OP is subliminal message overdrive. You'll start seeing faces on your wall...\r\nSound: hmm the sounds nice i mean you can hear everything perfectly and the voices arent muddled up\r\nCharcter:well my fav.charcter never really appears that offen but when she does its really funny well for me at least. the charcters are very good. they each have their own background and such.\\n\\n\r\nEnjoyment:very enjoyable as long as you not a person looking for a story in a comedy. if you like random then you'll love this.",
            "date": "2009-01-24T22:20:00+00:00",
            "helpful_count": 5,
            "mal_id": 11816,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/134619.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/weimingden",
                "username": "weimingden"
            },
            "url": "https://myanimelist.net/reviews.php?id=11816"
        },
        {
            "content": "Sayonara Zetsubou Sensei is a dark comedy anime about a pessimistic, suicidal high-school teacher who teaches a bunch of mentally broken girls about how horrible and negative the world is. One student has serve O.C.D., another one is a hikikomori, one has a guilt complex, and one is an extreme optimist, who sincerely believes that there's literally nothing in the world that is negative; she's the polar opposite of Zetsubou-Sensei. Nozomu Itoshiki is the Zetsubou-Sensei. If you put the first two characters of his name too close together, his name says, \"Zetsubou,\" which means, \"Despair.\"\r\nEpisode formula:\r\n1.) Zetsubou-Sensei conveys a statement about a negative aspect ofsociety, and on some occasions, the world.\\n\\n\r\n2.) He then gives examples to further prove his point. Most of the time, the show uses metaphorical commentary to get it through the viewer.\\n\\n\r\n3.) His students come out of nowhere, and give their opinion on the subject.\\n\\n\r\n4.) Kafuka Fuura (The extremely optimistic student I mentioned) counters said statement that Zetsubou-Sensei said, and mentions the positive side of the subject.\\n\\n\r\n5.) All of this is going on while the show makes cultural references (Specifically Japanese references), on rare occasions, foreign culture, anime, manga, video games, and even classical literature.\\n\\n\r\nSeason one in probably the weakest of the three seasons. Season one focuses more on introducing characters. Most of the appeal is the wacky yet dark humor the series has, and season one doesn't go to the extreme like the other two seasons do. As a whole, the entire series is amazing and hilarious, depending on your sense of humor. \\n",
            "date": "2017-12-18T15:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 265523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6814102.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Neimaj",
                "username": "Neimaj"
            },
            "url": "https://myanimelist.net/reviews.php?id=265523"
        },
        {
            "content": "I LOVE SAYONARA, ZETSUBOU-SENSEI!\r\nFirst of all, even though it takes the smallest situations in the most dramatic way possible, it's very humorous. I think with the support of all the interesting characters the story flows very well. What I also like is that the story doesn't just stick to one plot. I think for this anime that would be bad. \r\nSecond, I love all of the charaters and their voices! They match perfectly. I am a big Kamiya Hiroshi fan so when I first heard Itoshiki Nozomu I was hugging everything around me very tightly. I think the voice actor of Maria is excellent too.\\n\\n\r\nThird, I absolutely love all of the references it makes. For example, when taking a tour of Harumi Fujiyoshi, there were 00 references everywhere. They even had some members of Vocaloid come in!\\n\\n\r\nOverall, if you're looking for obscure humor I highly recommend this. It's hilarious and it teaches you a thing or two about society... and despair.",
            "date": "2010-01-23T12:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 22634,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/286203.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jiznugget_x",
                "username": "jiznugget_x"
            },
            "url": "https://myanimelist.net/reviews.php?id=22634"
        },
        {
            "content": "Watching this series felt like I had found a diamond in the rough. It was hard as hell to find a live torrent of this in .mkv and decent resolution but my effort was well worth it.\r\nThis show is a breath of fresh air if you have been watching a lot of the more popular animes such as myself. Now what to say about this?\r\nI guess the best way to describe what to expect is this, the humorous events that occur are really only half of this show, the other half is actually watching it. I have never seen an anime that requires so muchattention visually. I found myself constantly pausing to try to catch stuff that was happening in the backround, or written on papers/blackboards/signs, ect... Its not really NECESSARY but if your OCD like me you will want to know.\\n\\n\r\nThis is a really well crafted anime, which means that everything just sort of fits together perfectly, and that mixed with its witty and fresh humor, and artistic direction make this anime one I endorse as a must see!\\n\\n\r\nall that being said...\\n\r\n...WRITING THIS REVIEW HAS LEFT ME IN DISPAIR!\\n\r\nthere are sure to be people who don't find this review helpful, soon users from all over the internet will be watching this show and left disappointed because they think I over-hyped it. My name will become synonymous with bad anime! [gets noose]....",
            "date": "2010-03-07T22:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 23800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/292833.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dreiak",
                "username": "dreiak"
            },
            "url": "https://myanimelist.net/reviews.php?id=23800"
        }
    ],
    [
        {
            "content": "This will be a challenge since this is definitely the most ORIGINAL anime I have ever seen. It is hard to describe. Watching it is truly a unique experience. I screamed a lot while watching it out of hilarity and fear. This combination of feelings is delightfully painful and awkward. \r\nThe story is not cut and dry - it's random and not really about a plot as much as it is about well, randomness. There are tons of interludes and filler parts that will confuse you but are creative and enjoyable. Sometimes they're scary just because they're invasive to what your mind predicts.\r\nTONS of culturereferences. They can be funny even if you don't get them because they're presented in such an odd way.\\n\r\nIt's almost a parody anime because you can tell it knows it's random and it knows it's poking fun.  \\n\\n\r\nI really loved the art - it was truly original. At times it was beautiful, at times just interesting, and even disturbing but in a good way. I think some may be lost at the unpredictability of it but if it interests you at all, you won't be disappointed.\\n\r\nThe people in charge of the anime sure love to have cameos. Prepare for that, as it is a very common occurrence.\\n\\n\r\nThe music was also interesting. It's funny in an awkward way, like \"What is this?\" and it's great because it fits the whole series.\\n\\n\r\nThe characters are amazing. Itoshiki-sensei is very true to himself and so hilariously tragic, it's easy to like him but it can be hard to decide whether or not you actually feel sorry for him. The issues the characters face are relatable but also outrageous - exaggerated, if you will. The flaws of the characters can be shocking but are also not too foreign.\\n\r\nSimply put, it makes one realize that they themselves are also a creep of some sort.\\n\\n\r\nThere's lots of fanservice - male-targeted. This bothered me a little bit, but it doesn't take away from the story.\\n\\n\r\nOverall, I'd describe it as a satirical crackfest that's one of a kind and truly enjoyable for those open to it. I recommend it to almost anyone.",
            "date": "2009-06-27T17:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 16198,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/35324.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/miyukiss",
                "username": "miyukiss"
            },
            "url": "https://myanimelist.net/reviews.php?id=16198"
        },
        {
            "content": "Yes the characters are one note and defined by their \"gimmicks\", that is the joke, and I for one think it works very well. \r\nSayonara Zetsubou Sensei is a parody anime. What it is parodying is the average harem, for instance Da Capo or Absolute Duo. For the record, I hate absolute duo. Why? Because I see it as the most average of average harems. There is nothing unique. This is exactly why Sayonara Zetsubou Sensei is so hilarious to me. Take Julie from AD, for instance. She is the token kuudere character. We don't know much about her other than that she is akuudere and she comes from some place in the north. We also know what her boobs look like because fanservice is more important than character development...? Oh dear. Then, let's take Kafuka from SZS. She is hilariously cheerful. Her only personality trait is that she is cheerful. It works because Zetsubou Sensei is so depressed. The two extremes work remarkably well! For instance, in episode one, he is trying to hang himself. Kafuka comes along and decides that he is simply trying to make himself taller. Just like her father did on frequent occasions.\\n\\n\r\nNuff said.\\n",
            "date": "2016-08-30T14:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 227958,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5661769.jpg",
                "scores": {
                    "animation": 4,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BOBTHEMAN",
                "username": "BOBTHEMAN"
            },
            "url": "https://myanimelist.net/reviews.php?id=227958"
        },
        {
            "content": "Definitely not what I expected while watching. More sexual...visualizations(?) then anticipated originally. Over all I think I can say I liked this. There's a lot of social criticism not only of basic things like politics and economics, but they even go so far as to make fun of things like Yaoi/Yuri and the anime and manga industries. The story doesn't revolve quite as much around Sensei as I thought it would, and there were certain episodes that were rather pointless (though I guess in essence the whole anime was really pointless) such as the arranged marriage episode. \r\nOther then that, I would recommend this animeonly to people with quirky, twisted senses of humor and don't mind a little visualized girl on girl action from time to time. Awesome first opening theme.",
            "date": "2009-05-28T01:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 15340,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/66068.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kigeko",
                "username": "Kigeko"
            },
            "url": "https://myanimelist.net/reviews.php?id=15340"
        },
        {
            "content": "Sayonara Zetsubou Sensei (or So Long, Mr. Despair) is a comedic anime about a depressed high school teacher done by SHAFT and directed by Akiyuki Shinbo. I generally don't like comedy anime because they're usually either moe or spastic Excel Saga-type shows. Zetsubou Sensei is different though because most of the humor comes from the show being so strange. They constantly cut to random scenes that are there only to act as gags, experimental animation styles are used at times, and nonsensical sections are interjected for no reason at all. The anime is soo weird and so rooted in Japanese culture that it will neverget licensed. It's all been fansubbed so far, so you can watch this odd series subbed. You could also check out the manga, but without the voice acting and decent character designs, much of the weirdness and humor has been removed.",
            "date": "2009-12-13T15:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 21353,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/269219.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tuskus",
                "username": "Tuskus"
            },
            "url": "https://myanimelist.net/reviews.php?id=21353"
        },
        {
            "content": "Kafuka Fuura a cheerful and happy girl who always looks on the positives of life is an average high school girl who happens to be on her way to school. On her travels she finds and man attempting to hang himself.\r\nAfter seemingly stopping the attention seeking teacher that sets in motion the chain of unrelated events and the daily life of our absurdest teacher Zetsubo Sensei.\r\nI loved watching Welcome to the NHK which was had elements of serious elements of social and mental defects. Such as depression, shut-in's, suicide cults and more. I like it when shows add in elements of serious issuesof society and make it into something light hearted. I was hoping this show would be the same... well let’s explore that.\\n\\n\\n\\n\r\nStory:\\n\\n\\n\\n\r\nNow i wouldn't necessarily say that this series has an overarching story. Essentially the series is just showing us the wacky and random events in the daily life of a depressed teacher and his students. That’s not necessarily a bad thing and since it is a comedy it relies more on its strong characters and comedic moments which are there to see. However the jokes used in Zetsubo Sensei can be hit or miss. Some episodes you can get a good laugh and other times it can be meh. The show does re-use some jokes and i does get repetitive. This series also tends to have sexual references without making it obvious such as a teacher bathing with her student and pleasure through pain or S&M.\\n\\n\\n\\n\r\nArt:\\n\\n\\n\\n\r\nThe art is very strange and fascinating. The character designs are very 2D. There are moments when the animation is very nice to look at because of the unusual sight. The opening is also a strange and creepy thing to watch, but its so different that I couldn't skip it for the life of me. Another thing that had me thinking was that in each episode it had a picture of what i presumed to be the creator's face. It was strange but i didn't mind.\\n\\n\\n\\n\r\nSound:\\n\\n\\n\\n\r\nTo be perfectly honest I didn't really notice the soundtrack for most parts. I may have to have another listen to the soundtrack. The opening was really good and the closing had a spooky can of theme. All in all it’s ok.\\n\\n\\n\\n\r\nCharacters:\\n\\n\r\nWe follow what i assume to be our protagonist Nozomu Itoshiki a depressed teacher who just can't to seem to see anything in a positive light. His character never really develops as we still see the same old teacher refusing to change hos beliefs and ideals. He isn't exactly a great teacher or role model as he is constantly berating his students and diminishes their hopes and dreams with the iron fist of reality. \\n\\n\r\nThe only other character who plays equally as big role is Kafuka Fu'ura. She is the happy and super positive heroine of the series. She stops Nozomu from killing himself and then proceeds to befriend him. The relationship between the two seems non-existent but the two do show a mutual interest in each other and seeing as this is only the first season who knows what else could happen. \\n\\n\r\nFinal Verdict:\\n\\n\r\nWhile i can praise the show for being something quite different and a series aimed more at my tastes Sayonara Zetsubo Sensei is an above average show that can be a hit or miss. As for its humour it can also be a hit or miss. The series will feel longer than it should if it drags out and repeats it dark jokes. Overall i give this show a 7 out of 10 and a recommendation to at least try the first three episodes. If its not for you then you'll know straight off the bat \\n\\n\r\nThanks for reading guys. Any comments are welcome and until then. Have a nice day!   \\n",
            "date": "2014-09-01T12:31:00+00:00",
            "helpful_count": 2,
            "mal_id": 158775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2322793.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Honest_Senpai",
                "username": "Honest_Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=158775"
        }
    ]
]