[
    [
        {
            "content": "Now, I should mention first that I have not played the Tales of the Abyss video game on which this anime is based.  Despite that, I found it a great series to watch, with excellent characters and character development, brilliantly animated scenes, spectacular artwork, and a well-paced excellent story.\r\nThe story starts out slowly, but each character gives the viewer an immediate impression when introduced and one quickly develops feelings towards him or her, whether good or bad.  Each character is developed to the fullest extent, with detailed backstories, distinct personalities, personal motivation and conflicts, and excellent designs.  You can truly feel theconflicts they experience, and the depth they get into is truly spectacular.  The antagonists are as well-developed as the protagonists, and since their development is on the same level, when conflict does arise, it’s felt much more forcefully since you don’t know which side has more willpower to win the ensuring battles.  The development is especially strong for Luke, and just seeing him undergo his transformation throughout the series is breathtaking.  Also, all the characters just mesh in with each other extremely well, and the chemistry amongst everyone is well-done, again, both protagonists, secondary characters, and antagonists.\\n\\n\r\nThe animation, like the characters, is wonderful, with fluid movements and flashy attacks.  Pair that up with colorful drawings and excellent backgrounds and scenes, and scenes exceed my expectations.  It even gives the .hack series a run for the money in this aspect.  The pacing helps get the animation and drawings noticed, since there are moments where it’s slow enough to admire the drawings and detail work woven into the scenes, but it’s not too slow so that you get bored and drift off.  There is enough action mixed into each mission to keep the pace up, plus good dialogue amongst the characters.\\n\\n\r\nUnfortunately, there is a flaw in the dialogue in that the vocabulary often used is difficult to comprehend, and many references are made to these words.  Explanations are given for the vocabulary and what the world is like, but having not played the games is a bit disadvantageous, since the explanations are long and require pausing, rewatching, and analysis before one understands it.  What’s offered in the anime is just a fast-placed blurb and a quick picture where you have about 5 seconds to absorb all the information.  Thus, without pausing, it limits the viewer’s degree of plot comprehension.  I’m sure those who have played the games will be able to enjoy and understand the series without pausing and thinking for this kind of comprehension.\\n\\n\r\nDespite having to take a little more time to understand some of the terminology in Tales of the Abyss, I do think the series is well worth the time.  Even if you haven’t played the games, the series is very enjoyable.  Great characters, good plotline, fantastic drawings and animations await those who watch Tales.",
            "date": "2009-07-18T22:28:00+00:00",
            "helpful_count": 121,
            "mal_id": 16932,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58587.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Goldeneyeuro",
                "username": "Goldeneyeuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=16932"
        },
        {
            "content": "Tales of the Abyss was originally developed by Namco for the Playstation 2 and released on the 10th anniversary of the “Tales” series. The anime first aired 3. Of October 2008 and it’s the fourth installment of the “Tales” series to be adapted into an anime. I liked the game a lot and thought I should review the anime for the users on MAL. \r\nIn the review below I’ve tried to include an objective opinion of both the fan treats and possible faults that a game adaption poses to viewers, who haven’t played the game. To this end a section called “Compared to the game”can be found later on in the review.\\n\\n\r\nStory\\n\r\nTales of the Abyss’ storyline has a balanced amount of both good and bad points. The main storyline is interesting, but is highly dependent on long tiring explanations of terms like “fonons”, “Yulia’s score” and “fomicry”. However the main story moves along at a fairly good pace even if a few explanations are needed along the way.\\n\r\nAlso the short stories about the characters’ relationships and pasts are very good. They bring a fresh perspective once in a while and makes sure the viewer isn’t left totally clueless about the characters’ former lives. Especially the slight romances make the story appear more appealing.\\n\r\nThe most alarming point of the anime’s story is the sudden leaps in time and progression. A few times during the show an episode ends on a cliffhanger only to skip the situation, and leave the viewer wondering what happened in between the two episodes.\\n\r\nThese sorts of skips are continuously used throughout the show and might irritate even the most die hard fans of the game.\\n\r\nDespite the tiring explanations and unresolved cliffhangers Tales of the Abyss presents a fairly enjoyable story with a lot of powerful action and appealing side stories.\\n\\n\r\nCharacters\\n\r\nThe protagonist of Tales of the Abyss is primarily Luke von Fabre. However the rest of the protagonists play essential roles regarding both the main storyline and the immense character development of Luke.\\n\r\nOne of the best elements of this particular anime is the character development that all the main characters go through. The development of each character is carefully included in the storyline and none of it seems forced or out of place. This makes for a cast of very likeable characters and a pleasant watch.\\n\r\nEven so a few of the major developments happens in a very short amount of time and a few characters loose some of their distinctive and humoristic character traits. This is a very small fault but it’s still bound to upset some viewers, even if the characters actually seem more likeable after the development.\\n\r\nAltogether the anime presents the characters in a good way and the character development is smooth and nicely included in the main storyline or some of the previously mentioned short side stories.\\n\\n\r\nAnimation\\n\r\nThe category in which Tales of the Abyss performs the best is animation.\\n\r\nThe high quality of character models and scenery is constant through all 26 episodes, and it doesn’t seem like Sunrise and Bandai Visual made any noticeable or irritating mishaps.\\n\r\nThe production team should especially be credited for the fast paced swordfights which are all breathtaking and surprisingly fluid in motion.\\n\r\nAlso a select few scenery shots seem particularly well made; for example the shots of the capitals: “Baticul” and “Grand Chokmah” seen from bird’s eyes view.\\n\r\nThe character models are all highly detailed, very distinctive and recognizable. This is certainly a positive aspect during the high paced fighting where some viewers might have confused one character for another, had the characters been more alike.\\n\r\nThe only slightly infuriating thing about the characters might be the cast of “good” characters, who seem a bit neutral compared to the “evil” characters. The evil “God-generals” simply seem to be more unique and interesting in design. Animation wise some of these characters definitely deserved more screen time.  However, despite the critique, the good characters shouldn’t be called boring or uninteresting.\\n\r\nThe show also contains a high amount of well placed CG and the CG objects don’t seem out of place. Some of the computer generated spell graphics are a bit extravagant. However this isn’t really a flaw since the same graphics and spells were used in the original console game.\\n\r\nAll in all the show should be particularly credited for the high quality of animation which the production team at Sunrise and Bandai Visual is responsible for. \\n\\n\r\nSound\\n\r\nThe music of the show didn’t impress me much. The background music used during the actual episodes is neither spectacular nor bad. The music helps set the mood but I personally didn’t notice the music much throughout the episodes.\\n\r\nI did like the opener “Karma” by Bump of Chicken but just listening to the song without the animated intro makes it loose some of its charm. Especially because a lot of the emotions expressed in the song is complimented by the opening sequences. Nevertheless “Karma” is worth recommending to any fans of J-rock (myself not particularly being one of them though). The ED \"Bouken Suisei\" by Kurumi Enomoto, like the background music, was okay but nothing out of the ordinary.\\n\r\nThe voice actors did a decent/good job portraying the emotions of the characters and it’s always a treat for the fans of the game, when the original voice actors also do the voices of the anime. However the voices of Luke fon Fabre and Mieu did irritate me a tad at first but getting used to both voices doesn’t take long.\\n\\n\r\nCompared to the game\\n\r\nBeing an adaption of a RPG game, it’s inevitable that the show doesn’t contain some obvious game-based faults, one of them being the unexplainable fast-travel from one location to another. \\n\r\nIf the viewer hasn’t played the original game or equivalent, the jumping could seem weird and confusing, since no information about the trips is given. Also the spells, abilities and tech terms (see Story) might be confusing if the viewer has no knowledge of the game. The use of the original spells is simply a treat for the fans without any real meaning to the individual watching Tales of the Abyss by chance.\\n\r\nThe last big fault is the dramatic change in tempo during episodes. The action is definitely one of the best things about this anime, but the high paced action makes the story progressing conversation seem boring at times.\\n\r\nYet even with the obvious fault, the production team did a good job adapting the game into a fairly enjoyable anime adventure which should please fans of the “Tales” series.\\n\\n\r\nFinal Thoughts\\n\r\nTales of the Abyss isn’t a masterpiece but probably never had the potential either. Yet it’s still a fairly good series with a balanced amount of good and bad elements. The story is complicated and some of the leaps in time are awfully confusing, but the characters are likeable, the character development is interesting and the animation is great. The fluid movements during action scenes would without a doubt be pleasing to every anime action fan out there.\\n\r\nFor the fans of the original game this is a must see, while other potential viewers should be aware that some parts of the anime is included purely as treats for fans of the game.\\n\r\nTales of the Abyss is good but nothing spectacular. If you’re a fan of the “Tales” series or an adventure/action fan this show is worth checking out.\\n",
            "date": "2009-04-29T12:51:00+00:00",
            "helpful_count": 112,
            "mal_id": 14618,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143008.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Takarian",
                "username": "Takarian"
            },
            "url": "https://myanimelist.net/reviews.php?id=14618"
        },
        {
            "content": "I've never played the game but the anime is unbearable except maybe the animation which is at most decent. I really should've dropped it after ep8, like what I usually do for all the other bad animes. I thought it was going to improve later on because of all the \"Luke is going to change you have to watch this\" crap from the game fans. Let me start with the most annoying part which is all the characters seem to have acquired the ability to teleport. One minute they are in City A then the next minute they are City B, and they keep doingthis in every single episode. Now this wouldn't be too bad if they didn't give every city the same look and design, which leads to my next point,\\n\\n\r\nwho was in charge of the worldsetting?\\n\\n\r\nI watched 18 episodes and I still don't understand a thing about how this world functions. I might not the smartest guy in the world but my recollection is that the only time they actually attempted to explain the world is at the beginning of the first episode during which they said something about tune and musci and all that. After that it's all jargons. The consequence is that I have no idea what the group is doing in any of their missions, for example why did Akzeriuth sink when Luke started resonating in front of that shrine, and for that matter, what is that shrine? I know I probably can figure everything out by reading every single line for twenty times but if I do that why would I want to watch animes in the first place then?\\n\\n\r\nSo basically I gave up on the plot later on in the show. Unfortunately the character are not so interesting either, including Luke. Ok he changed, so what? Character change has nothing to do with how well developed this guy is. Basically he changed from a spoiled brat to a good guy, big deal. The rest of the cast are just boring. The only purpose they serve in this anime is to say the lines and introduce new missions so that the plot can move forward. What I don't get is even the battles are boring. And we are talking about Sunrise here which is one of the most funded, if not the most, studio in Japan. Even Bleach the animation has more exciting battles that ToA. I think the main problem is that the game is a big success so they think they can make a good anime out of it by just borrowing everything from the game without putting any efforts in. It just doesn't work that way.\\n\\n\r\nReally a waste of time, don't watch it.\\n",
            "date": "2009-02-20T07:49:00+00:00",
            "helpful_count": 52,
            "mal_id": 12579,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33389.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/az_0k",
                "username": "az_0k"
            },
            "url": "https://myanimelist.net/reviews.php?id=12579"
        },
        {
            "content": "Overall, this anime would fit the bill as \"mediocre\". False hope, plus the excellent experiences with the Tales of xxx franchise (e.g. Tales of Phantasia fan-translations on SNES and PlayStation) kept me interested... but the operative word was \"false\". \r\nI won't summarize the story, or explain why it was \"dreadful\" for me. Rather, I'll tell you why I hate this: there was potential for greatness, but from the very beginning, major details ruined it. \r\nAnnoying characters, huge plot holes, directing which seemed to not take itself seriously, personalities which are easily interchangeable, and no sense of \"suspended disbelief\".\r\nNothing in this anime was worth the timeit took to make it. Somewhere, early in the design process, a competent director and editor were misplaced with writers who previously only wrote fanfics and a commitee who designed the storyboards. \\n\\n\r\nAs as result, even with competent animation and enthusiastic efforts by the music and character design staff, the end result is much less than the sum of its parts. \\n\\n\r\nPlease give me back the nearly 13 hours of my life that I wasted on this!\\n",
            "date": "2009-06-29T14:57:00+00:00",
            "helpful_count": 29,
            "mal_id": 16258,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156353.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/D5",
                "username": "D5"
            },
            "url": "https://myanimelist.net/reviews.php?id=16258"
        },
        {
            "content": "\"I'm not living for anyone else. There's no meaning in living. When I sensed my own death, I wanted to live. I know now. That's all I needed.\"\r\nBeing an adaptation of a video game, ToA has to balance between two things:\r\n1: It has to remain true and accurate to the source material for the diehard fans who are watching it for the label, while also\r\n2: Keeping the storytelling format interesting to the viewers who've never played the game.\r\nAnd I feel this anime has managed a balance between the two that you rarely see in any kind of adaptation. I give my feedback on the twopoints separately below, in order.\\n\\n\r\nIf you want to know how well it adapts the story:\\n\r\nTales of the Abyss runs a story very much similar to what the game-players will remember while leaving out only the most minor of details, things that in hindsight even a die-hard fan would admit the story could do without.\\n\\n\r\n For example, instead of using the scene where Engeve's villagers discuss the food thieves, the anime moves right from when Luke takes the apple without paying to being brought to the village chief, a smooth and clean transition that cuts out runtime it didn't really need. This even at times adds some realism; no slowly-sinking town so you can leave for three days to get the Albiore, it's sinking NOW and the Albiore just swooped in to save the day.\\n\\n\r\nBest of all, while it cuts out the unnecessary portions, it adds some scenes the game could have benefited from: backstories that were originally only dialogue get actual flashbacks depicted. \\n\\n\r\nIf you want to know about the story itself:\\n\r\nThe story centers around Luke fon Fabre, the spoiled, sheltered son of a noble who knows nothing of life outside the villa and is basically designed so that you'll hate him out of the gate. He's soon taken far away from his known universe into the outside world when Mystearica Grants (usually just called Tear) breaks into the manor to kill Van, Luke's swordfighting instructor. Feeling responsible for them being teleported away, she vows to get him home. This is where Luke's long journey of character development begins, as he has to learn of even the most basic of real-world concepts, initially not even understanding the concept of money.\\n\\n\r\nAs much as Luke develops, the story still manages to give plenty of screen time to the other five playable characters of the game, and let them develop sufficiently as well. Nothing is iced over, even traits that are initially portrayed as comical are of large importance to their characters. Guy's afraid of women? That stems from a deep trauma we later learn about. Anise is obsessed with money? She's got people around her who always need it. Their pasts and their connections to the villains are well fleshed-out. Only one villain out of many is your generic, power-hungry fool, and he was ultimately a pawn. The rest all have deeper motives for doing what they do, and you may even mourn the deaths of some of them.\\n\\n\r\nThis tale is centered around several varied but important themes such as being outside of the world you've known, defiance of what's claimed to be inevitable, prejudice based on the uncontrollable being unjustified, living with a sin that can never be forgiven, finding a reason for life, and why everyone deserves to live. If someone has lost their way to despair, they would likely feel a kindred spirit in Luke and find an answer through this powerful Tale.",
            "date": "2013-09-13T03:53:00+00:00",
            "helpful_count": 28,
            "mal_id": 112757,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2562145.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Megamean09",
                "username": "Megamean09"
            },
            "url": "https://myanimelist.net/reviews.php?id=112757"
        },
        {
            "content": "As this review should be about the Anime and not about the Game (which I have not played), I could not avoid rating it with 10. I completed watching it about 1 week ago and I never quite got it out of my mind. And it really is the first time, I cannot stop thinking about an ordinary Anime. The music is good, the Animation very neat, the story complex but that is far from enough for earning a 10. However, this Anime has at least 3 very good points that make it outstanding. \r\nFirst of all: the characters. This is the first and onlyAnime I know with a real anti-hero. In the first episodes I was frustrated by Lukes childish behavior. I almost wanted to punch him several times or even hoped, he would just leave the Anime. I have never been so dissatisfied with a hero and that is, in fact, an amazing feeling. I don’t have to say that his changes were incredible. On the contrary, one thing I found really disturbing is that the characters never changed their clothes (and also that they traveled in one episode to 20 different places without a clue how they did it this fast).The other people were really sophisticated characters with interesting histories. There was not one you could not like.\\n\\n\r\nSecondly: the bad guys. Often the bad guys are those frightening and purely evil monsters, that just love to bring about death and destruction. There are still far too many Animes in this black-and-white-style. In the “Tales of the Abyss” I found not one, so called, bad guy, whose reasons I could not understand in some weird or humanly way. It even took me some time to realize, who the real boss of the villains was. I also do not think that the boss fights were too short, as many have mentioned. In fact, I am no fan of long fights with loads of bizarre attacks, when you just wait forever for the story to continue. Due to the shortness of the fights, they were sometimes even more surprising. \\n\\n\r\nLast but not least: the story telling. Tales of the Abyss does not belong to those stories, where the viewer gets to know everything right in the beginning and is wondering for the rest of the series, when those stupid characters find out themselves. The most naive person with the least knowledge is Luke and the viewer has just as much knowledge. As Luke gets to know and understand things, so does the viewer. When I started watching Abyss I did so, because it looked nice. I had no idea how complex and compelling the thing would get. I sometimes thought, the whole story was a great riddle with so many seemingly unimportant details in the beginning turning out to be an important clue. I did not think it was rushed, though, unless you watched it half asleep. There was probably no avoiding the happy ending (“saving the planet”), but I was still curious till the end who would survive, as it is that kind of Anime, where everybody could just end up dead. I watched all the last 10 episodes at one go.\\n\\n\r\nConcludingly, Tales of the Abyss may deserve an “8 - Very Good” or “9 - Great” (which is still a high score) compared to the Game, where there are probably many more side stories and more information. Yet, even the Anime left me enthralled and there was no way not to give it a 10.",
            "date": "2009-12-23T16:16:00+00:00",
            "helpful_count": 16,
            "mal_id": 21654,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271710.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/namidaful",
                "username": "namidaful"
            },
            "url": "https://myanimelist.net/reviews.php?id=21654"
        },
        {
            "content": "Laohoam- I was a bit skeptical when starting this anime, mainly because the main character was a douche.  After the plot started to develop it became more and more enjoyable.  Also the fact that this was based off an RPG makes it a bit more enjoyable for me because you can see some RPG characteristics in it.  Overall I recommend watching it the beginning is a little rough but give it some time it is worth it.        \r\nTadgh: This anime is also a video game. There are several times when that is noticeable, but ifyou know that going in, it's not a big deal. Otherwise it is excellent. You meet and learn about every character, the art and movement was smooth an excellent, the story had several twists and kept me on the edge of my seat. There is some contention among our group as to the ending, but I  think it was perfect. If you like well developed characters, this is for you.\\n\\n\r\nDr. R. Dash:  So this anime is my cup of tea! I love Video games that are similar to the story line and Tales have many many games and when we all first started watching this we all got the idea well we kinda wanna play this game but now I'm not sure, well I WANT TO PLAY it! I loved the selection of characters the back story the friendship the family the whole 9 yards. I would recommend this anime to people who understand and love RPG's. I will re-watch this and seek out other Tales, games and manga or anime in the future.\\n\\n\r\nRasanaph- In the beginning I was doubtful even pessimistic on how this anime would develop, but I must say it greatly improved and I quite enjoyed it. Character development was amazing and I think I even developed a crush for Tear. There are a few loop holes in the story and even a few things that lack in detail. Don't get hung up on them and enjoy.",
            "date": "2015-05-17T20:12:00+00:00",
            "helpful_count": 8,
            "mal_id": 188095,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Groupanimenight",
                "username": "Groupanimenight"
            },
            "url": "https://myanimelist.net/reviews.php?id=188095"
        },
        {
            "content": "First i will mention that this series is not my favorite nor my least favorite in anyway and ill give you the reasons through this review i hope i can help you =)..\r\n~Story~\r\n I rather enjoyed the story but was disapointed with the ending and i will try to tell you why without giving anything away. I found that the ending was a bad one because through the series the story built up alot of relationships and then when you get to the end its like the author just kind wrote it really quick and dropped it so i found that abit boring and dullbut the start was very good i enjoyed it alot and i also enjoyed the plot line and well once again i dont wanna give away anything but its a very interesting story that makes you think about how you should live your life.\\n\r\n~characters~\\n\r\n I found the main male protagonist a very frusterating character because he only cared for himself and no one else and he never thought any of his actions through which ended up causeing not only him but millions of people problems and loss and he never apologized outright for the things he did that destroyed countless others lives so i found that rather hard to deal with but the other characters were very good and different and the author did a great job with the others.\\n\r\n~overall~\\n\r\n I enjoyed the series to a point before the characters and plot start to fall apart and then it just becomes a mediocre series but mabey that was what the author wanted im not sure. I suggest this anime to people who like deathnote because personally both are very frusterating plots with selfish characters who learn nothing. Thanks and hope you enjoy Tales of the Abyss!\\n\r\n -Lamy",
            "date": "2010-04-14T22:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 25087,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307438.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lamyisme",
                "username": "Lamyisme"
            },
            "url": "https://myanimelist.net/reviews.php?id=25087"
        },
        {
            "content": "As someone who had played the original game long before watching the anime, I say the adaptation is rather bad. Indeed the plot did not go under any major changes, no important events present in the game was removed while some scenes not shown in the games are not bad(some are anime-original, while some are taken from official anthology). What is terrible is how battles are carried out. The anime took the word 'random battle encounter' in the game too literally, it is a 'battle encounter' and the event, along with the feeling it gives is 'random'. In the game you would not really careif all animals and monsters in the area would suddenly join forces with its natural predator or prey to prioritize killing you and your party for exactly zero reason since in game you would want to fight a great variations of enemies and not just 1 or 2 kinds per stage anyway. But out of game mechanics when this logic is placed into anime format, it is too random, weak, and pretty much just a waste of screen time just to show some fancy moves they are capable of in the original game. The boss battles are even worse, not only that bosses with supposedly 50,000+ HP would be reduced into dying within 2-4 blows, the human bosses present near to zero strength or tension in the battle. Boss battle against human characters consisted of elongated speech while they just parry, guard or dodge against each other's strikes and nobody takes any hit, and when the conversation reach peak the party would just decide to pull off some lame tricks(sleep inducing, bitchslap, or simple arrow shots) and the boss will fall just like that. It seem like the bosses are incredibly weak, and the party always had the option to kill them pretty much easily right from the second the battle start but they just wanna wait until the long talk end before they think the bosses should have been put out for good. Then there's go the 50,000+ HP within seconds and the tension it gives? None. The characters struggling in the heat of the battle are just the guys doing all the parrying and dodging, and there's just someone who get to stand there doing the talk until the time came that they became bored of talking, which is when the lame trick happen.\\n\\n\r\nAs for story as a fan of Tales series who have played many other games Namco gave me, Abyss is among those that have mediocre score for story. How Luke changed didn't make him any much likable to me, actually his development leap is done too quick(both in game and anime), changing from one person to a totally different one doesn't happen in 5 minutes. How Luke manage to act all goody-goody without slipping out his former douche self for a single second made me feel unreal. I prefer him to \"try\" becoming good, struggling with his speeches and how to react in different situation, and gradually become better and better, not just perfectly have the instant soul change he did.\\n\\n\r\nFurther on Luke, I did not quite enjoy Tear's romantic development towards him either, because similarly to Luke, it happen pretty much too sudden. Tear was introduced as a stubborn girl that have the body and mind of a 20-22 years old woman even when she is still 16, she was depicted as taking her duty seriously and will not hesitate to kill someone in self-defense. Her relationship with Luke started out terrible with her being unable to cope with his endless immaturity, but then suddenly show signs that she had developed some feelings for him as soon as he cut his hair, even before seeing the results that 'could he really changed or not?' So what happen to that mature tsuntsun girl we had earlier, is cutting hair all it take to turn her dere? That could've been better\\n\\n\r\nThe other characters I am too lazy to describe them all but I liked Jade the most of the entire cast, he's a mature leader figure that will often time make childish jokes and hold some grand sarcasm in his arsenal(it's sad that he isn't the leader of the party). However, his sarcasm, which is his biggest appeal, was toned down for some odd reason within the anime, which  is alittle disappointing. (His ability to troll people was demonstrated to greater extent in the game and several preorder CDs for other Tales game which he did show up as the commentator)\\n\\n\r\nThe art of the anime was good, though some choices of camera viewpoint could have been better. The music, though was somewhat disappointing, I would have not mind and even encourage them to use the original BGMs that were in the game, the OST the original game offers are fitting enough to each scene(though the battles in the anime might not be able to meet up with the battle BGMs the game used). I have no further comments on the voicing because all roles are directly reprised from the original game so they already knew how hey should portray each character.",
            "date": "2011-09-07T21:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 42949,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shemyaza",
                "username": "Shemyaza"
            },
            "url": "https://myanimelist.net/reviews.php?id=42949"
        },
        {
            "content": "I want to make a brief review of this anime as to not spoil others\r\nPlot: The main plot is mediocre but it has some twist that separate it from others. The ending is not the best but it is executed well.\r\nArt: The art is good, that's the only thing I won't deny. The characters are not unique in appearance but at least they're not hurting my eyes.\r\nSound: The worst. There are times when I literally mute it. The MC's voice is annoying, really. He literally does nothing but SCREAM, SCREAM and SCREAM. The voice actors don't seem to understand their roles as well. Not onlythe MC but also his friends as well.\\n\\n\r\nCharacters: Poor and inconsistent. The characters would change at times but they would revert back over and over and over again. It's really bad. The MC is annoying as fuck, not because he's childish but because almost the entire series, he's shouting and shouting and shouting. I understand he's still a child since he's only 7 years old but still... Gosh, I'm cringing. His friends are pretty awful as well, they left him when he needed them most. I understand their sentiments but it's not like the MC is all to blame. Some of them know that he's 7 years old and pretty much ignorant of the world but they don't fill he's ignorance and ignore his will to learn. They all know that he doesn't understand anything but all of them did not bother to explain. Then, how do you expect  him to make logical decisions? Gosh... it's really annoying. To add salt to the injury, after all that, it seemed like nothing happened. Their words contradict their actions.\\n\\n\r\nEnjoyment: I almost dropped this anime but I don't because I promised to myself that when I start a series I have to see it through the end. If not for that, I would have probably dropped it. At the start of 14th episode, I even needed to play it at 1.3x just so I could finish the series. Gosh, this anime has zero re-watch value.\\n\\n\r\nAll in all, this is anime is bad and pretty much overrated.\\n\\n",
            "date": "2017-04-02T10:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 244367,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5928004.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 1,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ElohimCrimson",
                "username": "ElohimCrimson"
            },
            "url": "https://myanimelist.net/reviews.php?id=244367"
        },
        {
            "content": "There are times when you watch TV. (Well, you're bound to get sick of using the desktop PC, right?) It's during these moments when you suddenly watch TV commercials of some shows that are \"coming soon.\" The trailer got you because it showed pretty cool fight scenes and flashy awesome spellcasting. Then, it says that it's a rendition of a PS2 game. It doesn't faze you, and you watch it anyway.\r\nTales of the Abyss, hereby shortened to TA for convenience, was introduced to me this way. I never played the game (I was more of the handheld fanatic, really), but I wanted to see itanyway. I've always been interested with battles and cool spellcasting (Fullmetal Alchemist-esque shows), so it wasn't really a problem for me.\\n\\n\r\nAnd I am proud to say that I didn't regret shoving this series off. It's earned its place as one of the best shows I've ever watched. TA proves to be a great viewing experience, and here's why.\\n\\n\r\nTA is great for two things: pacing and character. I'll tackle pacing first.\\n\\n\r\nAs you may well know, TA is an animé rendition of a PS2 RPG. And, if you're a gamer, you know that RPGs are notorious (or famous in a good sense) for their extensive storylines. And when you have an extensive storyline, you need detail--and lots of it. The storyboard directors of TA must have had a hard time compressing the whole story in 26 episodes, and I assume they must have shortened some parts and omitted others. But overall, TA as an animé doesn't give off a sense of being cut off; in fact, it's paced quite nicely. Sure, parts have been trimmed here and there, but the flow remains constant.\\n\\n\r\nThe second part is character. I included this because I really liked the character of Luke Fon Fabre (the main character). People might call this cliché, but I appreciated his development from being an arrogant prick to the savior of the world. His emotions drive him and the series forward. With each episode, you witness him changing slowly with the watchful (and caring) eye of Tear Grants. The story of these two people aren't so bad either, but I'll leave it for you to figure out once you watch the series.\\n\\n\r\nArt isn't bad either, as I mentioned the beautiful spellcasting and the awesome battles. It's clean, and well-done. Sound isn't so bad, either. Being based on an RPG, you're really going to get good sounds (or at least good renditions of them). The BGMs fit the scenes very well, in my opinion. I especially liked the opening and ending themes, too. Big thanks to BUMP OF CHICKEN and Kurumi Enomoto.\\n\\n\r\nOverall, Tales of the Abyss is a great watch. You're really taken on an adventure about saving the world and yourself; you get to witness the change of one person for the better, and how he ultimately uses his change for the betterment of the world. This definitely belongs to my \"best shows ever\" list.\\n\\n",
            "date": "2012-01-04T06:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 50921,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/570331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/deoxys101",
                "username": "deoxys101"
            },
            "url": "https://myanimelist.net/reviews.php?id=50921"
        },
        {
            "content": "It isn't too extremily painful to watch, but I found the plot very complicated, and what worsened this is the story went very fast. I found myself rewatching the eppisodes to understand what was going on. Furthermore, it seems like they tried to make the characters look deep (having a complicated past that not anyone could realate to. But it's actually better if you can relate to it at least A LITTLE bit.) but they weren't.They made the characters overly deep, witch reversed the whole process, making them seem childish. I didn't get very far because of this. If you're looking for something more intense,deeper,or easier to understand, I would soon rather pick pokemon.",
            "date": "2010-02-07T17:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 23046,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/215129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/erisabesu_kuro",
                "username": "erisabesu_kuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=23046"
        },
        {
            "content": "This is the first review I've ever done, and I felt like this anime needed my opinion on it so let's go.\r\nI HATE anime based off of existing games. There are about two or three that have ever really impressed me and even then the scores are low. This one joined the list of ones that I've liked, and I like it a lot.\r\nLet me first say here that I quite literally had to look up the main character's information because if he wasn't going to change from what kind of character he was at first I would not watch it. As it were thefirst couple of episodes were long and a bit painful but in my opinion worth it. Sadly though his shitty clothing choices last the whole anime.\\n\r\nThis show would have certainly benefited from being about 5 or so more episodes long to do more world building but at the same time things weren't to hard to understand. The fights are well done, the animation in pretty much every part is gorgeous, and characters grow like they should.\\n\r\nI have never played the game so I have no idea if it is anywhere near to accurate, but from an anime point alone it stands pretty darn well. I enjoyed it and I saw it getting some flack for being to hard to understand/confusing/stupid/boring but I disagree. This definitely filled my fix for an action fantasy with a dash of mystery and I can honestly say I was pretty sad when it ended.\\n\r\nAll in all, good anime, loaded with information and world to explore, and great story.",
            "date": "2016-02-22T01:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 211454,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5180204.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HatoVariant",
                "username": "HatoVariant"
            },
            "url": "https://myanimelist.net/reviews.php?id=211454"
        },
        {
            "content": "This is just my general interpretation of how I understood the anime. \r\nTales of the Abyss\r\nT.V Series: 26 Episodes\r\nAnime Director: Kenji Kodama\r\nPlot:\r\nTales of the abyss is a fairy tale set in a magical world governed by Fonstones, otherwise known as the “Score”.  The plot of the series mainly focuses on the “Score” and how our heroines contend with seemingly impossible obstacles to prevent its alteration. In order to achieve this and maintain the order of the “Score”, they must face off against foes that they once looked up to as family. The task is not easily realized, as matters of the heart arise tochallenge their course of action. Despite the heart aching challenges that stand poised to thwart their progression, our heroines were able to find solace in the bond they share with one another, as they continue their quest of salvation. With self-determination of an iron will, our heroines march on with resolute courage to ensure the survival of the world they love.\\n\\n\r\nCharacters:\\n\r\nFon Fabre, Luke\\n\r\nVoiced by: Suzuki, Chihiro (Japanese)\\n\\n\r\nHeroes are more often than not, bred of courage, wisdom and compassion, but those were traits that Luke profoundly lacked at the start of the series. Being imprisoned for almost the entire duration of his childhood, due to a kidnapping incident, Luke grew up not knowing much about the world around him. As the story progresses, our hero finds his true calling in life. His journey of discovery and salvation would negate all of his self-demeaning characteristics, and impart upon him the traits of a true champion.\\n\\n\r\nAsh\\n\r\nVoiced by: Suzuki Chihiro (Japanese)\\n\\n\r\nReality forces us to grow up both physically and emotionally, and in Ash’s case this was certainly no different. In the series he’s portrayed as character full of heart and pride. As one of the six God generals, Ash originally supported the idea of overthrowing the “Score,” but after numerous encounters with our heroes, he changes his mind and assists them in their quest. \\n\\n\r\nCurtiss, Jade\\n\r\nVoiced by: Koyasu, Takehito (Japanese)\\n\\n\r\nJade, also known as Jade the Necromancer is a very knowledgeable and mysterious individual. He is considered the originator of the fomicry art. During his adolescent stage, Jade experienced some horrific events that would later result in his peculiar behaviors in the show.  Having a military background only excelled Jade’s decision making and profoundly developed his ever present self-awareness. \\n\\n\r\nIon\\n\r\nVoiced by: Kobayashi, Yumiko (Japanese)\\n\\n\r\nAs the leader of the Order of Lorelei, Ion was kind and open minded. His ability to read the fonstones immensely helped our heroines in their quest. He remained humble and courteous until his demise. As he was nearing his death, as a final act of good will, he used his last remaining power to extract the miasma that threatened the life of Tear.\\n\\n\r\nGrants, Tear\\n\r\nVoiced by: Yukana (Japanese)\\n\\n\r\nA courageous and an extraordinary person full of compassion and love. She is the descendent of Yulia and the blood relative to Van in the series. In the series she aids Luke and the rest of the ensemble to help defeat her beloved brother. She is strong willed and kindness is her strongest strength. She’s constantly consoling Luke whenever things don’t go his way. One of her notable traits is the series of hymns she sings and utilizes as battle tools.  \\n\\n\r\nCecil, Guy\\n\r\nVoiced by: Matsumoto, Yasunori (Japanese)\\n\\n\r\nGuy, originally a descendent of royal blood, but due to certain circumstances, he found himself working as a servant in the Fabre’s mansion. He is Luke’s best friend in the series. As a friend, Guy saw it his responsibility to guide and be there for Luke when things were at their bleakest point.  Guy has a wonderful persona, but when it comes to women, that persona quickly gets erased and turns into a phobia. \\n\\n\r\nLuzu Kimlasca Lanvaldear, Natalia\\n\r\nVoiced by: Neya, Michiko (Japanese)\\n\\n\r\nNatalia is the princess of Kimlasca, and Luke’s fiancée in the series. As a princess, she lived up to the title, and as a fiancée she has been nothing but wonderful.  She is very supportive of Luke, and her determination to help him never once wavered. In the course of the series, Natalia’s resolve was tested countless times, but she never allowed herself to succumb to the evil that threatened her and her companions. \\n\\n\r\nTatlin, Anise\\n\r\nVoiced by:  Momoi, Haruko (Japanese)\\n\\n\r\nAnise is a peppy and cheerful girl, but her intentions always tend to misguide others. In the series, she acts as shelter that fends off all harm that is likely to befall master Ion. She also helps out Luke and the rest of the gang in their quest, but for a different reason. Some of her distinct traits that are rather perceptible in the series are her deceitful ways and, her passionate love for money. \\n\\n\r\nGrants, Van\\n\r\nVoiced by: Nakata Jouji (Japanese)\\n\\n\r\nVan is the commandant of the Order of Lorelei. He commands the six Gog generals, and he is also Luke and Ash’s mentor in the series. After the destruction of his birth land, Van has made it his mission to overthrow the “Score” that predicted the eradication of his home land. To achieve this, he joined the ranks of Lorelei in order to amass a strong following that is loyal and willing. His resolve to achieve his objective never changed, and he thwarted anyone that dared to stand in his way.\\n\\n\\n\r\nSummation:\\n\r\n       Tales of the Abyss manages to sustain the elements of the premise, without severally hampering its growth.  By doing so, it maintained its charm devoid of ever leaving the viewer feeling discontented.  The series pretty much narrators itself throughout the entire process, so the likely hood of any confusion on the viewer’s part is minimal. As a fantasy genre, the series didn’t portray that element to its fullest; rather, it was rarely present much of the entire storytelling. Where the series does succeed is in the manner by which the story was represented: Succinct and fast paced, thus allowing the viewer to experience every aspect of the show with straightforwardness. \\n\\n\\n\r\nTheme:\\n\r\n      The overall theme of the show was never hidden from the viewer; rather it was present from the opening ceremony of the show. It depicts with simplicity, without throwing unnecessary weight on the script, the dire message of great change and salvation. This was evident throughout the process of the storyline, as Luke continuously confronted spectacles that questioned his existence. The general message of the series is humble and sincere, something that the viewer will profoundly come to acknowledge as the story arrives at its conclusion. \\n\\n\r\nMedia Related: \\n\r\n  The animation sequence was superbly executed. Visually the series was amazing, and that was reinforced by the beautifully realized world where the story takes place. The character design was appropriate and delightfully complemented the overall fantasy element of the show.\\n\\n\r\nThe style of the series was well constructed to help transmit the over all message of progression. The fight scenes were rather brief, but potent enough to distinguish the style of the show. The creation within the world itself was well detailed and conspicuously presented. Though the visual style of the show was fully realized, the musical aspect of it was rarely touched. Suffice to say, these minor gaffes are hardly ever noticed, as the overwhelming substance of the storytelling easily removes these protracted shadows.\\n\\n\r\nJJ\\n",
            "date": "2010-02-19T21:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 23359,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147157.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JustJuice",
                "username": "JustJuice"
            },
            "url": "https://myanimelist.net/reviews.php?id=23359"
        },
        {
            "content": "What a crap, the story consist of plot-holes, and plot twists, almost every episode someone changes side, or revealed that they were on the other side all along or some other terrible secret, then everyone acts the same as ever in the next episode. There is one guy who helps the enemy, but the main cast lets him escape, then next time he spies on the but, the 'smart glasses guy' says it's not a problem, then a the next episode, said guy brings the bad guys on them, resulting in others dying, then a few episides later said guy heps the main cast.\r\nWhile thestarting point and the end point of the story is clear, the inbetween is murky at best. Enemies survive clearly fatal hits for the sake of plot, the main group has the ability to teleport,  only shown travelling when there is some interaction during, otherwise they can travel as much as half a continent from one scene to the next.\\n\r\nGenerally it feels like some episodes had material for 2-3 other episodes, while there are some episodes that are just a waste of time, thus the pacing is all over the place.\\n\\n\r\nThe art and sound are good, but these are about the only things the show got right, though there are some inconsistencies like size differences and \"interesting\" design choices, but I suspect the had to follow already existing designes. The voice acting is mostly good, the annoying character has annoying VA, which I wouldn't really put as a negative.\\n\\n\r\nThe characters are bad, lots of side characters get introduced who barely show up laters and doesn't really serve any purpose. The main cast seems forced, most of the things they do are for advancing the plot even at the cost of not staying in character. As already mentioned everyone has some dark secret, which doesn't really seem to impact relations, as already mentioned.\\n\\n\r\nIt's not enjoyable at all, I've only finished it to see where it would end up, but should have dropped 4 episodes in. The combat is boring, mostly consisting of talking while hacking at each others sword, then when it's time to finish the someone from the main cast defeats/kills the opponent in one hit, there is no casting time or the like, so they could have done so from the start which ruins an suspension. Wounds, even lethal doesn't seem to matter, only if the plot requires the characters death.\\n\\n\r\nOverall it's really bad, you are better off reading the plot somewhere. While it does have interesting concepts it fails to integrate them into the story, there really isn't anything specialy, except the unusually high number of turncoats, it's generic magic/fantasy hero saves the world, and bad at that.",
            "date": "2018-07-09T11:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 283545,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4525838.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/deathabarbar",
                "username": "deathabarbar"
            },
            "url": "https://myanimelist.net/reviews.php?id=283545"
        },
        {
            "content": "Tales of the abyss was based off of a game of the same name. I haven't played the game before, so I will not be able to tell you whether or not it followed the original storyline, or how different the graphics are, but only the overall enjoyability of it.\r\nIt is an exciting adventure that really pulls you in. The main character, Luke Fon Fabre goes through an epic journey where he learns what it means to depend on others and have all others depend on him. And as cliche as it may sound, he learns what it truly means to be alive.\r\nThe story wasinteresting because everything fits together in the end. Things that we thought we knew and understood in the beginning turn out other than expected. The overall journey and the characters' evolution was enjoyable. This is not to say that the story was perfect. There were plot holes, and the entire belief system and the politics of the world was kind of hard to follow. Also, they would sometimes pull things like abilities out of thin air.\\n\r\nThe art was amazing. The backgrounds looked very precise and high quality. The characters were easy to look at and all held their unique appearances. There were some really flashy colorful fight scenes and things like that.\\n\r\nSome of the characters were over the top, a few of them having characteristics added in for slapstick humor that they would sprinkle in the drama so it wouldn't be too heavy. For example, there was a character who was literally afraid of women. Characters kind of seemed 2d at first, but then you start to see their pasts and see them grow and change as the show goes on. They start feeling very real and you start getting kind of attached. Luke who was arrogant, spoiled, ignorant, and sometimes unknowingly cruel changes after he made one grave mistake. That is when the anime becomes fulfilling to watch.\\n\\n\r\nPersonally, I enjoyed it even though it was not a genre I usually watch. I'd especially recommend it to people who like adventure type anime. Action too.",
            "date": "2011-07-18T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 39409,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468066.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CueTheMusic",
                "username": "CueTheMusic"
            },
            "url": "https://myanimelist.net/reviews.php?id=39409"
        },
        {
            "content": "even though i haven't finished this series, i don't even plan to. i stopped after episode 4 because i found that the story is really confusing...it explains the world they are in unclearly. i also find the main character,luke, very dumb and frustrating because he's very spoiled and selfish, but i do understand that he is spoiled since he's been locked up for most of his life. i just cant stand to watch his stupid actions along with a confusing plot that doesn't lead anywhere. -_- thank god i stopped.",
            "date": "2010-10-12T15:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 31301,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328320.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LaLaLuffyx3",
                "username": "LaLaLuffyx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=31301"
        },
        {
            "content": "It's an adaption of a famous  game  in PS2,  so you have to already have played the game if you really wish to enjoy and understand this game.   The producers  of this kind  of adaption has a  difficut  job of compacting  a story into  just 24 episodes and still has to retain the original story.\r\nIt's not that  the anime  is not presented  in chronical  order   it s mostly about personal taste.   So  sorry for this this scatching review. \r\nSound 7\r\n I don't know the titleof the opening song, but it is very cathy Koko ni iru yo\\n\r\nArt 7\\n\r\nIt's detailed , with flashy colour. The characters and  the monsters  look exactly like they are in the game . I knew another  adaptation whose  art really suck.\\n\r\nCharacter 3\\n\r\nI gave the score  of 3. in part because i didn't play the game  which means i missed the opportunities to know the character, but  i still think  it's the producer job  to make viewer understand and know the characters  eventhough they never played the game.\\n\\n\r\nAnother part is because   they character arenot complex enough, they don't have  the aura mystery that makes viever wonder  who is she/ he.  \\n\r\n They also don't  have  something in them that will surprise viewers. the ability to  led viewers into believing  what they are which actually they are not.  \\n\\n",
            "date": "2012-02-04T05:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 53187,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/979975.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rondoblend",
                "username": "rondoblend"
            },
            "url": "https://myanimelist.net/reviews.php?id=53187"
        },
        {
            "content": "After reviewing the Symphonia OVA’s and the Vesperia movie I’ve finally arrived at the only full length Tales adaptations (apart from the one from WAY back in the day; I'm not going to review that). “So, how did it go?”, “Is it any better than the other adaptations?”, “IT’S STILL NOT AS GOOD AS THE GAME!” I hear you cry. Well shut up and let me tell you!\r\nThe Short Version:\r\n(+)There’s blood; I always think this is a good thing.\r\n(+)Characters actually grow and change instead of remaining static.\r\n(-)It takes too long for the show to kick into gear.\r\n(-)The MC is downright unbearable for half the show.\r\n(-)Thewriting has plot holes; yeah it’s that bad.\\n\\n\r\nThe Story (6/10): Being a JRPG adaptation, the show starts out pretty simple but then kicks itself into gear to a grander scale and just becomes generally better. With the start of the story you have a lad who is unsatisfied with his life at home when a certain event takes places he’s suddenly transported to the opposite side of the ‘world’ and is now trying to make his way back. The story then evolves into preventing a war for happening between the two major powers in the show, and then even later into something much bigger that a war between to powers. I have one problem with the story, because I haven’t played the game some of the stuff included in this adaptation didn’t make sense to me. “That’s just because you haven’t played the game.” You’d probably say. Well I shouldn’t need to play the game because no matter how good the source material is. If the adaptation can’t stand by itself to deliver the same experience as the source material then the adaptation has failed.\\n\\n\r\nThe Characters (7/10): This being a JRPG adaptation there’s a fair bit of characters to remember in the sense of who’s tied to who and for what reason, but they’re aren’t so many that it makes the show feel blotted in any way, the main characters take up most of the screen time with the occasional side characters in order to provide some necessary plot development, helping out the main party when needed. In this sense it’s just like a JRPG. Now to do what I normally do and run through the main characters really quick.\\n\\n\r\nLuke Fon Fabre: A fucking coward and a spoilt shit until he grows a pair; then he becomes tolerable.\\n\\n\r\nJade Curtiss: A colonel and the one with the most badass nickname.\\n\\n\r\nTear Grants: One time assassin and main love interest.\\n\\n\r\nAsch: Someone I feel sorry for and has the lushest red locks ever (for a lad).\\n\\n\r\nGuy Cecil: Servant to Luke and gynophobe\\n\\n\r\nNatalia Luzu Kimlasca Lanvaldear: Bethored to Luke and….. That’s really the only trait she has.\\n\\n\r\nAnise Tatlin: Hyperactive and Puppet-master.\\n\\n\r\nIon: The one with the voice that annoys me and is more of a plot device than a character.\\n\\n\r\nThis is very much a slow burn type of show when it comes to the characters, because as it goes on the characters change and some of their secrets are revealed, and the MC is a LOT more likeable past the halfway point. For the romance element that this show has, the relationship in question is really quiet baffling in the beginning but then you get past the magical mid-way point and you actually start believing.\\n\\n\r\nThe Art & Sound (7/10) & (6/10) : If you ever seen a Tales adaptation or an OP from the games you know what you’re in for. The animations for the most part are fine and there’re no real points that are unbearable. A side note that I always like to see in any anime that involves even a little bit of action is if there’s a bit of blood. Not to the point to where you think there’s an entire blood bank stored inside of them, and there’s not so little that a massive gash across the chest is more akin to a pin prick. The character designs, as a whole, are really quite good I felt. The only person who I felt didn’t really have a unique design was Guy because he was designed the same way as the civilians were. But my favourite design would be Asch’s; his red and black cloak just radiates the word BADASS. A quick word of warning to the intolerant, there is CGI in this anime but it isn’t as bad as say…… Kill la kill. (Or anything made by GONZO).I don’t really pay attention to CG so it didn’t bother me too much, but if you’re not a fan of 3D rendering, some scenes aren’t going to sit well with you.\\n\\n\r\nThe sound is all round pretty solid, nothing in the OST was ground-breaking or great. It was good. Average. Par. Stan- okay I’ll shut up. The voice acting was also done to standard no outstanding performances from the cast, but there was one characters voice that annoyed me to no end.\\n\\n\r\nWhat did you think of this show?\\n\\n\r\nWell I’m not buying the show, nor am I buying the game.\\n\\n\r\nWould you recommend this show?\\n\\n\r\nIf you’re a fan of the game, or just the series in general, go right ahead. Otherwise you’re not really missing out on anything if you don’t watch this.",
            "date": "2015-09-28T21:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 200031,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=200031"
        }
    ],
    [
        {
            "content": "Now, I should mention first that I have not played the Tales of the Abyss video game on which this anime is based.  Despite that, I found it a great series to watch, with excellent characters and character development, brilliantly animated scenes, spectacular artwork, and a well-paced excellent story.\r\nThe story starts out slowly, but each character gives the viewer an immediate impression when introduced and one quickly develops feelings towards him or her, whether good or bad.  Each character is developed to the fullest extent, with detailed backstories, distinct personalities, personal motivation and conflicts, and excellent designs.  You can truly feel theconflicts they experience, and the depth they get into is truly spectacular.  The antagonists are as well-developed as the protagonists, and since their development is on the same level, when conflict does arise, it’s felt much more forcefully since you don’t know which side has more willpower to win the ensuring battles.  The development is especially strong for Luke, and just seeing him undergo his transformation throughout the series is breathtaking.  Also, all the characters just mesh in with each other extremely well, and the chemistry amongst everyone is well-done, again, both protagonists, secondary characters, and antagonists.\\n\\n\r\nThe animation, like the characters, is wonderful, with fluid movements and flashy attacks.  Pair that up with colorful drawings and excellent backgrounds and scenes, and scenes exceed my expectations.  It even gives the .hack series a run for the money in this aspect.  The pacing helps get the animation and drawings noticed, since there are moments where it’s slow enough to admire the drawings and detail work woven into the scenes, but it’s not too slow so that you get bored and drift off.  There is enough action mixed into each mission to keep the pace up, plus good dialogue amongst the characters.\\n\\n\r\nUnfortunately, there is a flaw in the dialogue in that the vocabulary often used is difficult to comprehend, and many references are made to these words.  Explanations are given for the vocabulary and what the world is like, but having not played the games is a bit disadvantageous, since the explanations are long and require pausing, rewatching, and analysis before one understands it.  What’s offered in the anime is just a fast-placed blurb and a quick picture where you have about 5 seconds to absorb all the information.  Thus, without pausing, it limits the viewer’s degree of plot comprehension.  I’m sure those who have played the games will be able to enjoy and understand the series without pausing and thinking for this kind of comprehension.\\n\\n\r\nDespite having to take a little more time to understand some of the terminology in Tales of the Abyss, I do think the series is well worth the time.  Even if you haven’t played the games, the series is very enjoyable.  Great characters, good plotline, fantastic drawings and animations await those who watch Tales.",
            "date": "2009-07-18T22:28:00+00:00",
            "helpful_count": 121,
            "mal_id": 16932,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/58587.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Goldeneyeuro",
                "username": "Goldeneyeuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=16932"
        },
        {
            "content": "Tales of the Abyss was originally developed by Namco for the Playstation 2 and released on the 10th anniversary of the “Tales” series. The anime first aired 3. Of October 2008 and it’s the fourth installment of the “Tales” series to be adapted into an anime. I liked the game a lot and thought I should review the anime for the users on MAL. \r\nIn the review below I’ve tried to include an objective opinion of both the fan treats and possible faults that a game adaption poses to viewers, who haven’t played the game. To this end a section called “Compared to the game”can be found later on in the review.\\n\\n\r\nStory\\n\r\nTales of the Abyss’ storyline has a balanced amount of both good and bad points. The main storyline is interesting, but is highly dependent on long tiring explanations of terms like “fonons”, “Yulia’s score” and “fomicry”. However the main story moves along at a fairly good pace even if a few explanations are needed along the way.\\n\r\nAlso the short stories about the characters’ relationships and pasts are very good. They bring a fresh perspective once in a while and makes sure the viewer isn’t left totally clueless about the characters’ former lives. Especially the slight romances make the story appear more appealing.\\n\r\nThe most alarming point of the anime’s story is the sudden leaps in time and progression. A few times during the show an episode ends on a cliffhanger only to skip the situation, and leave the viewer wondering what happened in between the two episodes.\\n\r\nThese sorts of skips are continuously used throughout the show and might irritate even the most die hard fans of the game.\\n\r\nDespite the tiring explanations and unresolved cliffhangers Tales of the Abyss presents a fairly enjoyable story with a lot of powerful action and appealing side stories.\\n\\n\r\nCharacters\\n\r\nThe protagonist of Tales of the Abyss is primarily Luke von Fabre. However the rest of the protagonists play essential roles regarding both the main storyline and the immense character development of Luke.\\n\r\nOne of the best elements of this particular anime is the character development that all the main characters go through. The development of each character is carefully included in the storyline and none of it seems forced or out of place. This makes for a cast of very likeable characters and a pleasant watch.\\n\r\nEven so a few of the major developments happens in a very short amount of time and a few characters loose some of their distinctive and humoristic character traits. This is a very small fault but it’s still bound to upset some viewers, even if the characters actually seem more likeable after the development.\\n\r\nAltogether the anime presents the characters in a good way and the character development is smooth and nicely included in the main storyline or some of the previously mentioned short side stories.\\n\\n\r\nAnimation\\n\r\nThe category in which Tales of the Abyss performs the best is animation.\\n\r\nThe high quality of character models and scenery is constant through all 26 episodes, and it doesn’t seem like Sunrise and Bandai Visual made any noticeable or irritating mishaps.\\n\r\nThe production team should especially be credited for the fast paced swordfights which are all breathtaking and surprisingly fluid in motion.\\n\r\nAlso a select few scenery shots seem particularly well made; for example the shots of the capitals: “Baticul” and “Grand Chokmah” seen from bird’s eyes view.\\n\r\nThe character models are all highly detailed, very distinctive and recognizable. This is certainly a positive aspect during the high paced fighting where some viewers might have confused one character for another, had the characters been more alike.\\n\r\nThe only slightly infuriating thing about the characters might be the cast of “good” characters, who seem a bit neutral compared to the “evil” characters. The evil “God-generals” simply seem to be more unique and interesting in design. Animation wise some of these characters definitely deserved more screen time.  However, despite the critique, the good characters shouldn’t be called boring or uninteresting.\\n\r\nThe show also contains a high amount of well placed CG and the CG objects don’t seem out of place. Some of the computer generated spell graphics are a bit extravagant. However this isn’t really a flaw since the same graphics and spells were used in the original console game.\\n\r\nAll in all the show should be particularly credited for the high quality of animation which the production team at Sunrise and Bandai Visual is responsible for. \\n\\n\r\nSound\\n\r\nThe music of the show didn’t impress me much. The background music used during the actual episodes is neither spectacular nor bad. The music helps set the mood but I personally didn’t notice the music much throughout the episodes.\\n\r\nI did like the opener “Karma” by Bump of Chicken but just listening to the song without the animated intro makes it loose some of its charm. Especially because a lot of the emotions expressed in the song is complimented by the opening sequences. Nevertheless “Karma” is worth recommending to any fans of J-rock (myself not particularly being one of them though). The ED \"Bouken Suisei\" by Kurumi Enomoto, like the background music, was okay but nothing out of the ordinary.\\n\r\nThe voice actors did a decent/good job portraying the emotions of the characters and it’s always a treat for the fans of the game, when the original voice actors also do the voices of the anime. However the voices of Luke fon Fabre and Mieu did irritate me a tad at first but getting used to both voices doesn’t take long.\\n\\n\r\nCompared to the game\\n\r\nBeing an adaption of a RPG game, it’s inevitable that the show doesn’t contain some obvious game-based faults, one of them being the unexplainable fast-travel from one location to another. \\n\r\nIf the viewer hasn’t played the original game or equivalent, the jumping could seem weird and confusing, since no information about the trips is given. Also the spells, abilities and tech terms (see Story) might be confusing if the viewer has no knowledge of the game. The use of the original spells is simply a treat for the fans without any real meaning to the individual watching Tales of the Abyss by chance.\\n\r\nThe last big fault is the dramatic change in tempo during episodes. The action is definitely one of the best things about this anime, but the high paced action makes the story progressing conversation seem boring at times.\\n\r\nYet even with the obvious fault, the production team did a good job adapting the game into a fairly enjoyable anime adventure which should please fans of the “Tales” series.\\n\\n\r\nFinal Thoughts\\n\r\nTales of the Abyss isn’t a masterpiece but probably never had the potential either. Yet it’s still a fairly good series with a balanced amount of good and bad elements. The story is complicated and some of the leaps in time are awfully confusing, but the characters are likeable, the character development is interesting and the animation is great. The fluid movements during action scenes would without a doubt be pleasing to every anime action fan out there.\\n\r\nFor the fans of the original game this is a must see, while other potential viewers should be aware that some parts of the anime is included purely as treats for fans of the game.\\n\r\nTales of the Abyss is good but nothing spectacular. If you’re a fan of the “Tales” series or an adventure/action fan this show is worth checking out.\\n",
            "date": "2009-04-29T12:51:00+00:00",
            "helpful_count": 112,
            "mal_id": 14618,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143008.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Takarian",
                "username": "Takarian"
            },
            "url": "https://myanimelist.net/reviews.php?id=14618"
        },
        {
            "content": "I've never played the game but the anime is unbearable except maybe the animation which is at most decent. I really should've dropped it after ep8, like what I usually do for all the other bad animes. I thought it was going to improve later on because of all the \"Luke is going to change you have to watch this\" crap from the game fans. Let me start with the most annoying part which is all the characters seem to have acquired the ability to teleport. One minute they are in City A then the next minute they are City B, and they keep doingthis in every single episode. Now this wouldn't be too bad if they didn't give every city the same look and design, which leads to my next point,\\n\\n\r\nwho was in charge of the worldsetting?\\n\\n\r\nI watched 18 episodes and I still don't understand a thing about how this world functions. I might not the smartest guy in the world but my recollection is that the only time they actually attempted to explain the world is at the beginning of the first episode during which they said something about tune and musci and all that. After that it's all jargons. The consequence is that I have no idea what the group is doing in any of their missions, for example why did Akzeriuth sink when Luke started resonating in front of that shrine, and for that matter, what is that shrine? I know I probably can figure everything out by reading every single line for twenty times but if I do that why would I want to watch animes in the first place then?\\n\\n\r\nSo basically I gave up on the plot later on in the show. Unfortunately the character are not so interesting either, including Luke. Ok he changed, so what? Character change has nothing to do with how well developed this guy is. Basically he changed from a spoiled brat to a good guy, big deal. The rest of the cast are just boring. The only purpose they serve in this anime is to say the lines and introduce new missions so that the plot can move forward. What I don't get is even the battles are boring. And we are talking about Sunrise here which is one of the most funded, if not the most, studio in Japan. Even Bleach the animation has more exciting battles that ToA. I think the main problem is that the game is a big success so they think they can make a good anime out of it by just borrowing everything from the game without putting any efforts in. It just doesn't work that way.\\n\\n\r\nReally a waste of time, don't watch it.\\n",
            "date": "2009-02-20T07:49:00+00:00",
            "helpful_count": 52,
            "mal_id": 12579,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/33389.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/az_0k",
                "username": "az_0k"
            },
            "url": "https://myanimelist.net/reviews.php?id=12579"
        },
        {
            "content": "Overall, this anime would fit the bill as \"mediocre\". False hope, plus the excellent experiences with the Tales of xxx franchise (e.g. Tales of Phantasia fan-translations on SNES and PlayStation) kept me interested... but the operative word was \"false\". \r\nI won't summarize the story, or explain why it was \"dreadful\" for me. Rather, I'll tell you why I hate this: there was potential for greatness, but from the very beginning, major details ruined it. \r\nAnnoying characters, huge plot holes, directing which seemed to not take itself seriously, personalities which are easily interchangeable, and no sense of \"suspended disbelief\".\r\nNothing in this anime was worth the timeit took to make it. Somewhere, early in the design process, a competent director and editor were misplaced with writers who previously only wrote fanfics and a commitee who designed the storyboards. \\n\\n\r\nAs as result, even with competent animation and enthusiastic efforts by the music and character design staff, the end result is much less than the sum of its parts. \\n\\n\r\nPlease give me back the nearly 13 hours of my life that I wasted on this!\\n",
            "date": "2009-06-29T14:57:00+00:00",
            "helpful_count": 29,
            "mal_id": 16258,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/156353.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/D5",
                "username": "D5"
            },
            "url": "https://myanimelist.net/reviews.php?id=16258"
        },
        {
            "content": "\"I'm not living for anyone else. There's no meaning in living. When I sensed my own death, I wanted to live. I know now. That's all I needed.\"\r\nBeing an adaptation of a video game, ToA has to balance between two things:\r\n1: It has to remain true and accurate to the source material for the diehard fans who are watching it for the label, while also\r\n2: Keeping the storytelling format interesting to the viewers who've never played the game.\r\nAnd I feel this anime has managed a balance between the two that you rarely see in any kind of adaptation. I give my feedback on the twopoints separately below, in order.\\n\\n\r\nIf you want to know how well it adapts the story:\\n\r\nTales of the Abyss runs a story very much similar to what the game-players will remember while leaving out only the most minor of details, things that in hindsight even a die-hard fan would admit the story could do without.\\n\\n\r\n For example, instead of using the scene where Engeve's villagers discuss the food thieves, the anime moves right from when Luke takes the apple without paying to being brought to the village chief, a smooth and clean transition that cuts out runtime it didn't really need. This even at times adds some realism; no slowly-sinking town so you can leave for three days to get the Albiore, it's sinking NOW and the Albiore just swooped in to save the day.\\n\\n\r\nBest of all, while it cuts out the unnecessary portions, it adds some scenes the game could have benefited from: backstories that were originally only dialogue get actual flashbacks depicted. \\n\\n\r\nIf you want to know about the story itself:\\n\r\nThe story centers around Luke fon Fabre, the spoiled, sheltered son of a noble who knows nothing of life outside the villa and is basically designed so that you'll hate him out of the gate. He's soon taken far away from his known universe into the outside world when Mystearica Grants (usually just called Tear) breaks into the manor to kill Van, Luke's swordfighting instructor. Feeling responsible for them being teleported away, she vows to get him home. This is where Luke's long journey of character development begins, as he has to learn of even the most basic of real-world concepts, initially not even understanding the concept of money.\\n\\n\r\nAs much as Luke develops, the story still manages to give plenty of screen time to the other five playable characters of the game, and let them develop sufficiently as well. Nothing is iced over, even traits that are initially portrayed as comical are of large importance to their characters. Guy's afraid of women? That stems from a deep trauma we later learn about. Anise is obsessed with money? She's got people around her who always need it. Their pasts and their connections to the villains are well fleshed-out. Only one villain out of many is your generic, power-hungry fool, and he was ultimately a pawn. The rest all have deeper motives for doing what they do, and you may even mourn the deaths of some of them.\\n\\n\r\nThis tale is centered around several varied but important themes such as being outside of the world you've known, defiance of what's claimed to be inevitable, prejudice based on the uncontrollable being unjustified, living with a sin that can never be forgiven, finding a reason for life, and why everyone deserves to live. If someone has lost their way to despair, they would likely feel a kindred spirit in Luke and find an answer through this powerful Tale.",
            "date": "2013-09-13T03:53:00+00:00",
            "helpful_count": 28,
            "mal_id": 112757,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2562145.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Megamean09",
                "username": "Megamean09"
            },
            "url": "https://myanimelist.net/reviews.php?id=112757"
        },
        {
            "content": "As this review should be about the Anime and not about the Game (which I have not played), I could not avoid rating it with 10. I completed watching it about 1 week ago and I never quite got it out of my mind. And it really is the first time, I cannot stop thinking about an ordinary Anime. The music is good, the Animation very neat, the story complex but that is far from enough for earning a 10. However, this Anime has at least 3 very good points that make it outstanding. \r\nFirst of all: the characters. This is the first and onlyAnime I know with a real anti-hero. In the first episodes I was frustrated by Lukes childish behavior. I almost wanted to punch him several times or even hoped, he would just leave the Anime. I have never been so dissatisfied with a hero and that is, in fact, an amazing feeling. I don’t have to say that his changes were incredible. On the contrary, one thing I found really disturbing is that the characters never changed their clothes (and also that they traveled in one episode to 20 different places without a clue how they did it this fast).The other people were really sophisticated characters with interesting histories. There was not one you could not like.\\n\\n\r\nSecondly: the bad guys. Often the bad guys are those frightening and purely evil monsters, that just love to bring about death and destruction. There are still far too many Animes in this black-and-white-style. In the “Tales of the Abyss” I found not one, so called, bad guy, whose reasons I could not understand in some weird or humanly way. It even took me some time to realize, who the real boss of the villains was. I also do not think that the boss fights were too short, as many have mentioned. In fact, I am no fan of long fights with loads of bizarre attacks, when you just wait forever for the story to continue. Due to the shortness of the fights, they were sometimes even more surprising. \\n\\n\r\nLast but not least: the story telling. Tales of the Abyss does not belong to those stories, where the viewer gets to know everything right in the beginning and is wondering for the rest of the series, when those stupid characters find out themselves. The most naive person with the least knowledge is Luke and the viewer has just as much knowledge. As Luke gets to know and understand things, so does the viewer. When I started watching Abyss I did so, because it looked nice. I had no idea how complex and compelling the thing would get. I sometimes thought, the whole story was a great riddle with so many seemingly unimportant details in the beginning turning out to be an important clue. I did not think it was rushed, though, unless you watched it half asleep. There was probably no avoiding the happy ending (“saving the planet”), but I was still curious till the end who would survive, as it is that kind of Anime, where everybody could just end up dead. I watched all the last 10 episodes at one go.\\n\\n\r\nConcludingly, Tales of the Abyss may deserve an “8 - Very Good” or “9 - Great” (which is still a high score) compared to the Game, where there are probably many more side stories and more information. Yet, even the Anime left me enthralled and there was no way not to give it a 10.",
            "date": "2009-12-23T16:16:00+00:00",
            "helpful_count": 16,
            "mal_id": 21654,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/271710.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/namidaful",
                "username": "namidaful"
            },
            "url": "https://myanimelist.net/reviews.php?id=21654"
        },
        {
            "content": "Laohoam- I was a bit skeptical when starting this anime, mainly because the main character was a douche.  After the plot started to develop it became more and more enjoyable.  Also the fact that this was based off an RPG makes it a bit more enjoyable for me because you can see some RPG characteristics in it.  Overall I recommend watching it the beginning is a little rough but give it some time it is worth it.        \r\nTadgh: This anime is also a video game. There are several times when that is noticeable, but ifyou know that going in, it's not a big deal. Otherwise it is excellent. You meet and learn about every character, the art and movement was smooth an excellent, the story had several twists and kept me on the edge of my seat. There is some contention among our group as to the ending, but I  think it was perfect. If you like well developed characters, this is for you.\\n\\n\r\nDr. R. Dash:  So this anime is my cup of tea! I love Video games that are similar to the story line and Tales have many many games and when we all first started watching this we all got the idea well we kinda wanna play this game but now I'm not sure, well I WANT TO PLAY it! I loved the selection of characters the back story the friendship the family the whole 9 yards. I would recommend this anime to people who understand and love RPG's. I will re-watch this and seek out other Tales, games and manga or anime in the future.\\n\\n\r\nRasanaph- In the beginning I was doubtful even pessimistic on how this anime would develop, but I must say it greatly improved and I quite enjoyed it. Character development was amazing and I think I even developed a crush for Tear. There are a few loop holes in the story and even a few things that lack in detail. Don't get hung up on them and enjoy.",
            "date": "2015-05-17T20:12:00+00:00",
            "helpful_count": 8,
            "mal_id": 188095,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Groupanimenight",
                "username": "Groupanimenight"
            },
            "url": "https://myanimelist.net/reviews.php?id=188095"
        },
        {
            "content": "First i will mention that this series is not my favorite nor my least favorite in anyway and ill give you the reasons through this review i hope i can help you =)..\r\n~Story~\r\n I rather enjoyed the story but was disapointed with the ending and i will try to tell you why without giving anything away. I found that the ending was a bad one because through the series the story built up alot of relationships and then when you get to the end its like the author just kind wrote it really quick and dropped it so i found that abit boring and dullbut the start was very good i enjoyed it alot and i also enjoyed the plot line and well once again i dont wanna give away anything but its a very interesting story that makes you think about how you should live your life.\\n\r\n~characters~\\n\r\n I found the main male protagonist a very frusterating character because he only cared for himself and no one else and he never thought any of his actions through which ended up causeing not only him but millions of people problems and loss and he never apologized outright for the things he did that destroyed countless others lives so i found that rather hard to deal with but the other characters were very good and different and the author did a great job with the others.\\n\r\n~overall~\\n\r\n I enjoyed the series to a point before the characters and plot start to fall apart and then it just becomes a mediocre series but mabey that was what the author wanted im not sure. I suggest this anime to people who like deathnote because personally both are very frusterating plots with selfish characters who learn nothing. Thanks and hope you enjoy Tales of the Abyss!\\n\r\n -Lamy",
            "date": "2010-04-14T22:38:00+00:00",
            "helpful_count": 7,
            "mal_id": 25087,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/307438.jpg",
                "scores": {
                    "animation": 9,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Lamyisme",
                "username": "Lamyisme"
            },
            "url": "https://myanimelist.net/reviews.php?id=25087"
        },
        {
            "content": "As someone who had played the original game long before watching the anime, I say the adaptation is rather bad. Indeed the plot did not go under any major changes, no important events present in the game was removed while some scenes not shown in the games are not bad(some are anime-original, while some are taken from official anthology). What is terrible is how battles are carried out. The anime took the word 'random battle encounter' in the game too literally, it is a 'battle encounter' and the event, along with the feeling it gives is 'random'. In the game you would not really careif all animals and monsters in the area would suddenly join forces with its natural predator or prey to prioritize killing you and your party for exactly zero reason since in game you would want to fight a great variations of enemies and not just 1 or 2 kinds per stage anyway. But out of game mechanics when this logic is placed into anime format, it is too random, weak, and pretty much just a waste of screen time just to show some fancy moves they are capable of in the original game. The boss battles are even worse, not only that bosses with supposedly 50,000+ HP would be reduced into dying within 2-4 blows, the human bosses present near to zero strength or tension in the battle. Boss battle against human characters consisted of elongated speech while they just parry, guard or dodge against each other's strikes and nobody takes any hit, and when the conversation reach peak the party would just decide to pull off some lame tricks(sleep inducing, bitchslap, or simple arrow shots) and the boss will fall just like that. It seem like the bosses are incredibly weak, and the party always had the option to kill them pretty much easily right from the second the battle start but they just wanna wait until the long talk end before they think the bosses should have been put out for good. Then there's go the 50,000+ HP within seconds and the tension it gives? None. The characters struggling in the heat of the battle are just the guys doing all the parrying and dodging, and there's just someone who get to stand there doing the talk until the time came that they became bored of talking, which is when the lame trick happen.\\n\\n\r\nAs for story as a fan of Tales series who have played many other games Namco gave me, Abyss is among those that have mediocre score for story. How Luke changed didn't make him any much likable to me, actually his development leap is done too quick(both in game and anime), changing from one person to a totally different one doesn't happen in 5 minutes. How Luke manage to act all goody-goody without slipping out his former douche self for a single second made me feel unreal. I prefer him to \"try\" becoming good, struggling with his speeches and how to react in different situation, and gradually become better and better, not just perfectly have the instant soul change he did.\\n\\n\r\nFurther on Luke, I did not quite enjoy Tear's romantic development towards him either, because similarly to Luke, it happen pretty much too sudden. Tear was introduced as a stubborn girl that have the body and mind of a 20-22 years old woman even when she is still 16, she was depicted as taking her duty seriously and will not hesitate to kill someone in self-defense. Her relationship with Luke started out terrible with her being unable to cope with his endless immaturity, but then suddenly show signs that she had developed some feelings for him as soon as he cut his hair, even before seeing the results that 'could he really changed or not?' So what happen to that mature tsuntsun girl we had earlier, is cutting hair all it take to turn her dere? That could've been better\\n\\n\r\nThe other characters I am too lazy to describe them all but I liked Jade the most of the entire cast, he's a mature leader figure that will often time make childish jokes and hold some grand sarcasm in his arsenal(it's sad that he isn't the leader of the party). However, his sarcasm, which is his biggest appeal, was toned down for some odd reason within the anime, which  is alittle disappointing. (His ability to troll people was demonstrated to greater extent in the game and several preorder CDs for other Tales game which he did show up as the commentator)\\n\\n\r\nThe art of the anime was good, though some choices of camera viewpoint could have been better. The music, though was somewhat disappointing, I would have not mind and even encourage them to use the original BGMs that were in the game, the OST the original game offers are fitting enough to each scene(though the battles in the anime might not be able to meet up with the battle BGMs the game used). I have no further comments on the voicing because all roles are directly reprised from the original game so they already knew how hey should portray each character.",
            "date": "2011-09-07T21:52:00+00:00",
            "helpful_count": 7,
            "mal_id": 42949,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shemyaza",
                "username": "Shemyaza"
            },
            "url": "https://myanimelist.net/reviews.php?id=42949"
        },
        {
            "content": "I want to make a brief review of this anime as to not spoil others\r\nPlot: The main plot is mediocre but it has some twist that separate it from others. The ending is not the best but it is executed well.\r\nArt: The art is good, that's the only thing I won't deny. The characters are not unique in appearance but at least they're not hurting my eyes.\r\nSound: The worst. There are times when I literally mute it. The MC's voice is annoying, really. He literally does nothing but SCREAM, SCREAM and SCREAM. The voice actors don't seem to understand their roles as well. Not onlythe MC but also his friends as well.\\n\\n\r\nCharacters: Poor and inconsistent. The characters would change at times but they would revert back over and over and over again. It's really bad. The MC is annoying as fuck, not because he's childish but because almost the entire series, he's shouting and shouting and shouting. I understand he's still a child since he's only 7 years old but still... Gosh, I'm cringing. His friends are pretty awful as well, they left him when he needed them most. I understand their sentiments but it's not like the MC is all to blame. Some of them know that he's 7 years old and pretty much ignorant of the world but they don't fill he's ignorance and ignore his will to learn. They all know that he doesn't understand anything but all of them did not bother to explain. Then, how do you expect  him to make logical decisions? Gosh... it's really annoying. To add salt to the injury, after all that, it seemed like nothing happened. Their words contradict their actions.\\n\\n\r\nEnjoyment: I almost dropped this anime but I don't because I promised to myself that when I start a series I have to see it through the end. If not for that, I would have probably dropped it. At the start of 14th episode, I even needed to play it at 1.3x just so I could finish the series. Gosh, this anime has zero re-watch value.\\n\\n\r\nAll in all, this is anime is bad and pretty much overrated.\\n\\n",
            "date": "2017-04-02T10:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 244367,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5928004.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 1,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ElohimCrimson",
                "username": "ElohimCrimson"
            },
            "url": "https://myanimelist.net/reviews.php?id=244367"
        },
        {
            "content": "There are times when you watch TV. (Well, you're bound to get sick of using the desktop PC, right?) It's during these moments when you suddenly watch TV commercials of some shows that are \"coming soon.\" The trailer got you because it showed pretty cool fight scenes and flashy awesome spellcasting. Then, it says that it's a rendition of a PS2 game. It doesn't faze you, and you watch it anyway.\r\nTales of the Abyss, hereby shortened to TA for convenience, was introduced to me this way. I never played the game (I was more of the handheld fanatic, really), but I wanted to see itanyway. I've always been interested with battles and cool spellcasting (Fullmetal Alchemist-esque shows), so it wasn't really a problem for me.\\n\\n\r\nAnd I am proud to say that I didn't regret shoving this series off. It's earned its place as one of the best shows I've ever watched. TA proves to be a great viewing experience, and here's why.\\n\\n\r\nTA is great for two things: pacing and character. I'll tackle pacing first.\\n\\n\r\nAs you may well know, TA is an animé rendition of a PS2 RPG. And, if you're a gamer, you know that RPGs are notorious (or famous in a good sense) for their extensive storylines. And when you have an extensive storyline, you need detail--and lots of it. The storyboard directors of TA must have had a hard time compressing the whole story in 26 episodes, and I assume they must have shortened some parts and omitted others. But overall, TA as an animé doesn't give off a sense of being cut off; in fact, it's paced quite nicely. Sure, parts have been trimmed here and there, but the flow remains constant.\\n\\n\r\nThe second part is character. I included this because I really liked the character of Luke Fon Fabre (the main character). People might call this cliché, but I appreciated his development from being an arrogant prick to the savior of the world. His emotions drive him and the series forward. With each episode, you witness him changing slowly with the watchful (and caring) eye of Tear Grants. The story of these two people aren't so bad either, but I'll leave it for you to figure out once you watch the series.\\n\\n\r\nArt isn't bad either, as I mentioned the beautiful spellcasting and the awesome battles. It's clean, and well-done. Sound isn't so bad, either. Being based on an RPG, you're really going to get good sounds (or at least good renditions of them). The BGMs fit the scenes very well, in my opinion. I especially liked the opening and ending themes, too. Big thanks to BUMP OF CHICKEN and Kurumi Enomoto.\\n\\n\r\nOverall, Tales of the Abyss is a great watch. You're really taken on an adventure about saving the world and yourself; you get to witness the change of one person for the better, and how he ultimately uses his change for the betterment of the world. This definitely belongs to my \"best shows ever\" list.\\n\\n",
            "date": "2012-01-04T06:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 50921,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/570331.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/deoxys101",
                "username": "deoxys101"
            },
            "url": "https://myanimelist.net/reviews.php?id=50921"
        },
        {
            "content": "It isn't too extremily painful to watch, but I found the plot very complicated, and what worsened this is the story went very fast. I found myself rewatching the eppisodes to understand what was going on. Furthermore, it seems like they tried to make the characters look deep (having a complicated past that not anyone could realate to. But it's actually better if you can relate to it at least A LITTLE bit.) but they weren't.They made the characters overly deep, witch reversed the whole process, making them seem childish. I didn't get very far because of this. If you're looking for something more intense,deeper,or easier to understand, I would soon rather pick pokemon.",
            "date": "2010-02-07T17:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 23046,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/215129.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/erisabesu_kuro",
                "username": "erisabesu_kuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=23046"
        },
        {
            "content": "This is the first review I've ever done, and I felt like this anime needed my opinion on it so let's go.\r\nI HATE anime based off of existing games. There are about two or three that have ever really impressed me and even then the scores are low. This one joined the list of ones that I've liked, and I like it a lot.\r\nLet me first say here that I quite literally had to look up the main character's information because if he wasn't going to change from what kind of character he was at first I would not watch it. As it were thefirst couple of episodes were long and a bit painful but in my opinion worth it. Sadly though his shitty clothing choices last the whole anime.\\n\r\nThis show would have certainly benefited from being about 5 or so more episodes long to do more world building but at the same time things weren't to hard to understand. The fights are well done, the animation in pretty much every part is gorgeous, and characters grow like they should.\\n\r\nI have never played the game so I have no idea if it is anywhere near to accurate, but from an anime point alone it stands pretty darn well. I enjoyed it and I saw it getting some flack for being to hard to understand/confusing/stupid/boring but I disagree. This definitely filled my fix for an action fantasy with a dash of mystery and I can honestly say I was pretty sad when it ended.\\n\r\nAll in all, good anime, loaded with information and world to explore, and great story.",
            "date": "2016-02-22T01:23:00+00:00",
            "helpful_count": 4,
            "mal_id": 211454,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5180204.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/HatoVariant",
                "username": "HatoVariant"
            },
            "url": "https://myanimelist.net/reviews.php?id=211454"
        },
        {
            "content": "This is just my general interpretation of how I understood the anime. \r\nTales of the Abyss\r\nT.V Series: 26 Episodes\r\nAnime Director: Kenji Kodama\r\nPlot:\r\nTales of the abyss is a fairy tale set in a magical world governed by Fonstones, otherwise known as the “Score”.  The plot of the series mainly focuses on the “Score” and how our heroines contend with seemingly impossible obstacles to prevent its alteration. In order to achieve this and maintain the order of the “Score”, they must face off against foes that they once looked up to as family. The task is not easily realized, as matters of the heart arise tochallenge their course of action. Despite the heart aching challenges that stand poised to thwart their progression, our heroines were able to find solace in the bond they share with one another, as they continue their quest of salvation. With self-determination of an iron will, our heroines march on with resolute courage to ensure the survival of the world they love.\\n\\n\r\nCharacters:\\n\r\nFon Fabre, Luke\\n\r\nVoiced by: Suzuki, Chihiro (Japanese)\\n\\n\r\nHeroes are more often than not, bred of courage, wisdom and compassion, but those were traits that Luke profoundly lacked at the start of the series. Being imprisoned for almost the entire duration of his childhood, due to a kidnapping incident, Luke grew up not knowing much about the world around him. As the story progresses, our hero finds his true calling in life. His journey of discovery and salvation would negate all of his self-demeaning characteristics, and impart upon him the traits of a true champion.\\n\\n\r\nAsh\\n\r\nVoiced by: Suzuki Chihiro (Japanese)\\n\\n\r\nReality forces us to grow up both physically and emotionally, and in Ash’s case this was certainly no different. In the series he’s portrayed as character full of heart and pride. As one of the six God generals, Ash originally supported the idea of overthrowing the “Score,” but after numerous encounters with our heroes, he changes his mind and assists them in their quest. \\n\\n\r\nCurtiss, Jade\\n\r\nVoiced by: Koyasu, Takehito (Japanese)\\n\\n\r\nJade, also known as Jade the Necromancer is a very knowledgeable and mysterious individual. He is considered the originator of the fomicry art. During his adolescent stage, Jade experienced some horrific events that would later result in his peculiar behaviors in the show.  Having a military background only excelled Jade’s decision making and profoundly developed his ever present self-awareness. \\n\\n\r\nIon\\n\r\nVoiced by: Kobayashi, Yumiko (Japanese)\\n\\n\r\nAs the leader of the Order of Lorelei, Ion was kind and open minded. His ability to read the fonstones immensely helped our heroines in their quest. He remained humble and courteous until his demise. As he was nearing his death, as a final act of good will, he used his last remaining power to extract the miasma that threatened the life of Tear.\\n\\n\r\nGrants, Tear\\n\r\nVoiced by: Yukana (Japanese)\\n\\n\r\nA courageous and an extraordinary person full of compassion and love. She is the descendent of Yulia and the blood relative to Van in the series. In the series she aids Luke and the rest of the ensemble to help defeat her beloved brother. She is strong willed and kindness is her strongest strength. She’s constantly consoling Luke whenever things don’t go his way. One of her notable traits is the series of hymns she sings and utilizes as battle tools.  \\n\\n\r\nCecil, Guy\\n\r\nVoiced by: Matsumoto, Yasunori (Japanese)\\n\\n\r\nGuy, originally a descendent of royal blood, but due to certain circumstances, he found himself working as a servant in the Fabre’s mansion. He is Luke’s best friend in the series. As a friend, Guy saw it his responsibility to guide and be there for Luke when things were at their bleakest point.  Guy has a wonderful persona, but when it comes to women, that persona quickly gets erased and turns into a phobia. \\n\\n\r\nLuzu Kimlasca Lanvaldear, Natalia\\n\r\nVoiced by: Neya, Michiko (Japanese)\\n\\n\r\nNatalia is the princess of Kimlasca, and Luke’s fiancée in the series. As a princess, she lived up to the title, and as a fiancée she has been nothing but wonderful.  She is very supportive of Luke, and her determination to help him never once wavered. In the course of the series, Natalia’s resolve was tested countless times, but she never allowed herself to succumb to the evil that threatened her and her companions. \\n\\n\r\nTatlin, Anise\\n\r\nVoiced by:  Momoi, Haruko (Japanese)\\n\\n\r\nAnise is a peppy and cheerful girl, but her intentions always tend to misguide others. In the series, she acts as shelter that fends off all harm that is likely to befall master Ion. She also helps out Luke and the rest of the gang in their quest, but for a different reason. Some of her distinct traits that are rather perceptible in the series are her deceitful ways and, her passionate love for money. \\n\\n\r\nGrants, Van\\n\r\nVoiced by: Nakata Jouji (Japanese)\\n\\n\r\nVan is the commandant of the Order of Lorelei. He commands the six Gog generals, and he is also Luke and Ash’s mentor in the series. After the destruction of his birth land, Van has made it his mission to overthrow the “Score” that predicted the eradication of his home land. To achieve this, he joined the ranks of Lorelei in order to amass a strong following that is loyal and willing. His resolve to achieve his objective never changed, and he thwarted anyone that dared to stand in his way.\\n\\n\\n\r\nSummation:\\n\r\n       Tales of the Abyss manages to sustain the elements of the premise, without severally hampering its growth.  By doing so, it maintained its charm devoid of ever leaving the viewer feeling discontented.  The series pretty much narrators itself throughout the entire process, so the likely hood of any confusion on the viewer’s part is minimal. As a fantasy genre, the series didn’t portray that element to its fullest; rather, it was rarely present much of the entire storytelling. Where the series does succeed is in the manner by which the story was represented: Succinct and fast paced, thus allowing the viewer to experience every aspect of the show with straightforwardness. \\n\\n\\n\r\nTheme:\\n\r\n      The overall theme of the show was never hidden from the viewer; rather it was present from the opening ceremony of the show. It depicts with simplicity, without throwing unnecessary weight on the script, the dire message of great change and salvation. This was evident throughout the process of the storyline, as Luke continuously confronted spectacles that questioned his existence. The general message of the series is humble and sincere, something that the viewer will profoundly come to acknowledge as the story arrives at its conclusion. \\n\\n\r\nMedia Related: \\n\r\n  The animation sequence was superbly executed. Visually the series was amazing, and that was reinforced by the beautifully realized world where the story takes place. The character design was appropriate and delightfully complemented the overall fantasy element of the show.\\n\\n\r\nThe style of the series was well constructed to help transmit the over all message of progression. The fight scenes were rather brief, but potent enough to distinguish the style of the show. The creation within the world itself was well detailed and conspicuously presented. Though the visual style of the show was fully realized, the musical aspect of it was rarely touched. Suffice to say, these minor gaffes are hardly ever noticed, as the overwhelming substance of the storytelling easily removes these protracted shadows.\\n\\n\r\nJJ\\n",
            "date": "2010-02-19T21:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 23359,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/147157.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JustJuice",
                "username": "JustJuice"
            },
            "url": "https://myanimelist.net/reviews.php?id=23359"
        },
        {
            "content": "What a crap, the story consist of plot-holes, and plot twists, almost every episode someone changes side, or revealed that they were on the other side all along or some other terrible secret, then everyone acts the same as ever in the next episode. There is one guy who helps the enemy, but the main cast lets him escape, then next time he spies on the but, the 'smart glasses guy' says it's not a problem, then a the next episode, said guy brings the bad guys on them, resulting in others dying, then a few episides later said guy heps the main cast.\r\nWhile thestarting point and the end point of the story is clear, the inbetween is murky at best. Enemies survive clearly fatal hits for the sake of plot, the main group has the ability to teleport,  only shown travelling when there is some interaction during, otherwise they can travel as much as half a continent from one scene to the next.\\n\r\nGenerally it feels like some episodes had material for 2-3 other episodes, while there are some episodes that are just a waste of time, thus the pacing is all over the place.\\n\\n\r\nThe art and sound are good, but these are about the only things the show got right, though there are some inconsistencies like size differences and \"interesting\" design choices, but I suspect the had to follow already existing designes. The voice acting is mostly good, the annoying character has annoying VA, which I wouldn't really put as a negative.\\n\\n\r\nThe characters are bad, lots of side characters get introduced who barely show up laters and doesn't really serve any purpose. The main cast seems forced, most of the things they do are for advancing the plot even at the cost of not staying in character. As already mentioned everyone has some dark secret, which doesn't really seem to impact relations, as already mentioned.\\n\\n\r\nIt's not enjoyable at all, I've only finished it to see where it would end up, but should have dropped 4 episodes in. The combat is boring, mostly consisting of talking while hacking at each others sword, then when it's time to finish the someone from the main cast defeats/kills the opponent in one hit, there is no casting time or the like, so they could have done so from the start which ruins an suspension. Wounds, even lethal doesn't seem to matter, only if the plot requires the characters death.\\n\\n\r\nOverall it's really bad, you are better off reading the plot somewhere. While it does have interesting concepts it fails to integrate them into the story, there really isn't anything specialy, except the unusually high number of turncoats, it's generic magic/fantasy hero saves the world, and bad at that.",
            "date": "2018-07-09T11:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 283545,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4525838.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/deathabarbar",
                "username": "deathabarbar"
            },
            "url": "https://myanimelist.net/reviews.php?id=283545"
        },
        {
            "content": "Tales of the abyss was based off of a game of the same name. I haven't played the game before, so I will not be able to tell you whether or not it followed the original storyline, or how different the graphics are, but only the overall enjoyability of it.\r\nIt is an exciting adventure that really pulls you in. The main character, Luke Fon Fabre goes through an epic journey where he learns what it means to depend on others and have all others depend on him. And as cliche as it may sound, he learns what it truly means to be alive.\r\nThe story wasinteresting because everything fits together in the end. Things that we thought we knew and understood in the beginning turn out other than expected. The overall journey and the characters' evolution was enjoyable. This is not to say that the story was perfect. There were plot holes, and the entire belief system and the politics of the world was kind of hard to follow. Also, they would sometimes pull things like abilities out of thin air.\\n\r\nThe art was amazing. The backgrounds looked very precise and high quality. The characters were easy to look at and all held their unique appearances. There were some really flashy colorful fight scenes and things like that.\\n\r\nSome of the characters were over the top, a few of them having characteristics added in for slapstick humor that they would sprinkle in the drama so it wouldn't be too heavy. For example, there was a character who was literally afraid of women. Characters kind of seemed 2d at first, but then you start to see their pasts and see them grow and change as the show goes on. They start feeling very real and you start getting kind of attached. Luke who was arrogant, spoiled, ignorant, and sometimes unknowingly cruel changes after he made one grave mistake. That is when the anime becomes fulfilling to watch.\\n\\n\r\nPersonally, I enjoyed it even though it was not a genre I usually watch. I'd especially recommend it to people who like adventure type anime. Action too.",
            "date": "2011-07-18T01:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 39409,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/468066.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CueTheMusic",
                "username": "CueTheMusic"
            },
            "url": "https://myanimelist.net/reviews.php?id=39409"
        },
        {
            "content": "even though i haven't finished this series, i don't even plan to. i stopped after episode 4 because i found that the story is really confusing...it explains the world they are in unclearly. i also find the main character,luke, very dumb and frustrating because he's very spoiled and selfish, but i do understand that he is spoiled since he's been locked up for most of his life. i just cant stand to watch his stupid actions along with a confusing plot that doesn't lead anywhere. -_- thank god i stopped.",
            "date": "2010-10-12T15:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 31301,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/328320.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LaLaLuffyx3",
                "username": "LaLaLuffyx3"
            },
            "url": "https://myanimelist.net/reviews.php?id=31301"
        },
        {
            "content": "It's an adaption of a famous  game  in PS2,  so you have to already have played the game if you really wish to enjoy and understand this game.   The producers  of this kind  of adaption has a  difficut  job of compacting  a story into  just 24 episodes and still has to retain the original story.\r\nIt's not that  the anime  is not presented  in chronical  order   it s mostly about personal taste.   So  sorry for this this scatching review. \r\nSound 7\r\n I don't know the titleof the opening song, but it is very cathy Koko ni iru yo\\n\r\nArt 7\\n\r\nIt's detailed , with flashy colour. The characters and  the monsters  look exactly like they are in the game . I knew another  adaptation whose  art really suck.\\n\r\nCharacter 3\\n\r\nI gave the score  of 3. in part because i didn't play the game  which means i missed the opportunities to know the character, but  i still think  it's the producer job  to make viewer understand and know the characters  eventhough they never played the game.\\n\\n\r\nAnother part is because   they character arenot complex enough, they don't have  the aura mystery that makes viever wonder  who is she/ he.  \\n\r\n They also don't  have  something in them that will surprise viewers. the ability to  led viewers into believing  what they are which actually they are not.  \\n\\n",
            "date": "2012-02-04T05:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 53187,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/979975.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/rondoblend",
                "username": "rondoblend"
            },
            "url": "https://myanimelist.net/reviews.php?id=53187"
        },
        {
            "content": "After reviewing the Symphonia OVA’s and the Vesperia movie I’ve finally arrived at the only full length Tales adaptations (apart from the one from WAY back in the day; I'm not going to review that). “So, how did it go?”, “Is it any better than the other adaptations?”, “IT’S STILL NOT AS GOOD AS THE GAME!” I hear you cry. Well shut up and let me tell you!\r\nThe Short Version:\r\n(+)There’s blood; I always think this is a good thing.\r\n(+)Characters actually grow and change instead of remaining static.\r\n(-)It takes too long for the show to kick into gear.\r\n(-)The MC is downright unbearable for half the show.\r\n(-)Thewriting has plot holes; yeah it’s that bad.\\n\\n\r\nThe Story (6/10): Being a JRPG adaptation, the show starts out pretty simple but then kicks itself into gear to a grander scale and just becomes generally better. With the start of the story you have a lad who is unsatisfied with his life at home when a certain event takes places he’s suddenly transported to the opposite side of the ‘world’ and is now trying to make his way back. The story then evolves into preventing a war for happening between the two major powers in the show, and then even later into something much bigger that a war between to powers. I have one problem with the story, because I haven’t played the game some of the stuff included in this adaptation didn’t make sense to me. “That’s just because you haven’t played the game.” You’d probably say. Well I shouldn’t need to play the game because no matter how good the source material is. If the adaptation can’t stand by itself to deliver the same experience as the source material then the adaptation has failed.\\n\\n\r\nThe Characters (7/10): This being a JRPG adaptation there’s a fair bit of characters to remember in the sense of who’s tied to who and for what reason, but they’re aren’t so many that it makes the show feel blotted in any way, the main characters take up most of the screen time with the occasional side characters in order to provide some necessary plot development, helping out the main party when needed. In this sense it’s just like a JRPG. Now to do what I normally do and run through the main characters really quick.\\n\\n\r\nLuke Fon Fabre: A fucking coward and a spoilt shit until he grows a pair; then he becomes tolerable.\\n\\n\r\nJade Curtiss: A colonel and the one with the most badass nickname.\\n\\n\r\nTear Grants: One time assassin and main love interest.\\n\\n\r\nAsch: Someone I feel sorry for and has the lushest red locks ever (for a lad).\\n\\n\r\nGuy Cecil: Servant to Luke and gynophobe\\n\\n\r\nNatalia Luzu Kimlasca Lanvaldear: Bethored to Luke and….. That’s really the only trait she has.\\n\\n\r\nAnise Tatlin: Hyperactive and Puppet-master.\\n\\n\r\nIon: The one with the voice that annoys me and is more of a plot device than a character.\\n\\n\r\nThis is very much a slow burn type of show when it comes to the characters, because as it goes on the characters change and some of their secrets are revealed, and the MC is a LOT more likeable past the halfway point. For the romance element that this show has, the relationship in question is really quiet baffling in the beginning but then you get past the magical mid-way point and you actually start believing.\\n\\n\r\nThe Art & Sound (7/10) & (6/10) : If you ever seen a Tales adaptation or an OP from the games you know what you’re in for. The animations for the most part are fine and there’re no real points that are unbearable. A side note that I always like to see in any anime that involves even a little bit of action is if there’s a bit of blood. Not to the point to where you think there’s an entire blood bank stored inside of them, and there’s not so little that a massive gash across the chest is more akin to a pin prick. The character designs, as a whole, are really quite good I felt. The only person who I felt didn’t really have a unique design was Guy because he was designed the same way as the civilians were. But my favourite design would be Asch’s; his red and black cloak just radiates the word BADASS. A quick word of warning to the intolerant, there is CGI in this anime but it isn’t as bad as say…… Kill la kill. (Or anything made by GONZO).I don’t really pay attention to CG so it didn’t bother me too much, but if you’re not a fan of 3D rendering, some scenes aren’t going to sit well with you.\\n\\n\r\nThe sound is all round pretty solid, nothing in the OST was ground-breaking or great. It was good. Average. Par. Stan- okay I’ll shut up. The voice acting was also done to standard no outstanding performances from the cast, but there was one characters voice that annoyed me to no end.\\n\\n\r\nWhat did you think of this show?\\n\\n\r\nWell I’m not buying the show, nor am I buying the game.\\n\\n\r\nWould you recommend this show?\\n\\n\r\nIf you’re a fan of the game, or just the series in general, go right ahead. Otherwise you’re not really missing out on anything if you don’t watch this.",
            "date": "2015-09-28T21:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 200031,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=200031"
        }
    ]
]