[
    [
        {
            "content": "This show hands down one of the godtier series in the history of anime. When it comes to drama, Shouwa Genroku Rakugo Shinjuu as a whole is insanely topnotch / masterpiece. Not being biased here, I mean the show is just that good, flawless + with insane direction and editing by Studio Deen.\r\nStory 10/10 Simple and boring you might say but the narration of the series is topnotch, with thoughtful editing + with masterful direction, the show just climbed up the rankings easily, surpassing its 1st season. Overall flawless storyline. It is just that good and you might know the show had those insane plottwiston the 2nd half of the series :)\\n\\n\r\nArt 9/10 Nothing special when it comes to frame by frame animation but when it comes to cinematography the show just stands out. With good camera angles and with very realism type of editing, the show proved that animation is not only just the key to make a topnotch quality series.\\n\\n\r\nSound 10/10 Hell yes, from the shounen type of opening from both seasons to the one of the emotional endings i've seen. The 2nd Ending just hits you so hard with its mellow type of sound and then partnered with a very stimulating visuals that helps both art and sound to be one of the selling point of the series.\\n\\n\r\nCharacters 10/10 Oh boy, did just everybody got all their fokin character development? From Sukeroku to Yakumo upto Yotaro and Konatsu and even Shinnosuke. I mean every characters are well fleshed out with great interactions with the help of the great voice actors of the series. It is insanely overwhelming to watch.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nOverall 10/10\\n\\n\r\nOne of masterpieces of modern anime. Studio Deen is just so good at making this one. Surpassing the 1st season and even the Manga. Shouwa Genroku Rakugo Shinjuu is a flawless - godtier - topnotch - moving - stellar - \" m a s t e r p i e c e \" on drama genre. \"Never\" anything came closely to this series from all Anime of 2016 and Anime of Winter 2017\\n\\n",
            "date": "2017-03-24T05:44:00+00:00",
            "helpful_count": 139,
            "mal_id": 243351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5819797.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/riorangel21",
                "username": "riorangel21"
            },
            "url": "https://myanimelist.net/reviews.php?id=243351"
        },
        {
            "content": "When something moves you to tears, it's daunting to explain why. How can I possibly put into words how much of an emotional impact a single piece of media had on me? All I can do is try and hope that you decide to give it a chance.\r\nPS When Yotaro performed \"Shibahama\" in episode 8 that shit got my ass crying real hard.\r\nThe best part of this show is the story. It’s complex without being confusing and is always interesting. I was never bored while watching. If you combine both seasons into one story, I think the structure of an introduction to the present, backstory,then jump back to present to continue the story and see how the events from the past have changed the present and continue to affect characters really made the show what it is. And then a beauty of this show is that the conclusion to this story is the conclusion to Yakumo’s story. Very satisfying and appropriate to how I think the show should’ve ended. The combination of all of these decisions that change the tone and flow of the story make it something to behold.\\n\\n\r\n(START SPOILERS)\\n\\n\r\nIt wasn’t perfect though. One of the main problems I had with this series was that the story focused too much on the past. I think that while this focus on the past demonstrated Yakumo’s inability to move on well, there comes a point where it becomes frustrating to watch the same decisions being made for the same reasons over and over. We all know that Sukeroku and Miyokichi’s death affected Yakumo’s life forever after, but sometimes his obsession over it in the most trivial of situations seemed unrealistic and just overemphasized. I very much liked the scenes of hallucination that put Yakumo in the hospital both times, and his journey in the afterlife and reuniting with the two, but the day-to-day trauma he’s experiencing 20+ years after their death seems just a bit overdone.\\n\\n\r\nI had a sort of crisis while watching the show due to the nature of episode 7’s reveal that the ending Yakumo told to us in the first season was a lie and that Konatsu was partly responsible for her parents’ deaths. I was shook when I found this out due to the profound effect the original ending had on me. I was more than a bit disappointed initially, but after much reflection on how this changes Yakumo’s character and his relationship to Kontasu, I decided that I also think this was a great plot twist that adds to the story. I still like the original better because it was more tragic, but I think that’s the point and I just fell for a story trap. Oh well.\\n\\n\r\n(END SPOILERS)\\n\\n\r\nAnother part of the first season I found to be refreshing and captivating was Yakumo and Miyokichi’s relationship. Usually in romance anime, relationships are either lovey-dovey or they’re both unbelievably awkward around each other. Rakugo makes their relationship compelling, mature, and quiet, yet ever-present. I loved the handling of this aspect of the show. This kind of continued with this season. The same dynamic was kept in place, but Yotaro was just a more loud character who wears his emotions on his sleeve, so it’s natural that it would be different, but I’d say of the 2, I prefer the former. \\n\\n\r\nThis also brings me to my only other main complaint of the show. In the first season, I just liked the characters more. Not necessarily how they’re written, I love the aspects of them all, but my views are best demonstrated in the Rakugo they perform. Sukeroku’s was informal, fast, yet strong and clear, while Yakumo’s is dignified, deliberate, and refined. To me, Yotaro’s personality and his Rakugo seemed loud, a bit goofy, and sometimes unpleasant to listen to. This was only rarely, but I sometimes would just wish he would stop talking. That being said, Kontasu is one of my favorite characters in the show and I thought old Yakumo is just as good as young Yakumo. Also, the story of Yotaro’s past interfering with his career was a good conflict of the show.\\n\\n\r\nRakugo is a show about art, so it’s only natural that its art direction be some of the best I’ve ever seen. Perfectly set the mood in every scene, managed to blend traditional traditions in a modern world in a clean, appealing way. My desktop background is even a screenshot I took from the show, that’s how impressed I was. On a similar note, I am continuously impressed with the OP and EDs in this show. They’re perfectly reflective of the show. I feel like the video itself for the OP in the second season reveals a lot about the plot, so if you’re trying to go in blind, consider skipping watching the OP.\\n\\n\r\nOverall, I can’t recommend this series enough. If you think you will like the show, I can guarantee that you will. I’m not here to tell you that this is a perfect show (it’s not), and I’m also not here to tell you that if you don’t enjoy it you have shit taste and there’s something wrong with you, but I can say this: In my opinion, Rakugo is the best series to come out in the last couple of years and it will be one of those “hidden classics” 5-10 years into the future, due to how under-the-radar it was, yet how profoundly excellent it is.\\n\\n\r\nThank you for reading my review! Feel free to leave any kind of feedback on my profile if you feel the need to, I appreciate everything.\\n",
            "date": "2017-03-24T00:43:00+00:00",
            "helpful_count": 66,
            "mal_id": 243336,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4167293.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/0207xander",
                "username": "0207xander"
            },
            "url": "https://myanimelist.net/reviews.php?id=243336"
        },
        {
            "content": "Nostalgia is a powerful thing. Happiness is essential, for when death comes, we want to look back fondly at our lives. It's only natural, really. It's only natural that we feel this way, and it's only natural that this is the conclusion to such a wonderful work of art. With that sentimental tangent, back on track, though expect that to be the tone of this review. Death, or rather, actually dying and no longer being able to experience anything for all of eternity is something that legitimately frightens me, and it has since childhood. Leaving a legacy that you won't see, possibly not even knowingwhat kind of legacy you leave or if you leave one at all. All of this has toiled in my mind for quite some time now, and this second season really sparked that back into my psyche, for better and for worse. Since, it's been a struggle to keep myself from getting horrified by the unknown of it all, since it was inevitable that this would be a recurring thought in my head. Then again, it might've started before then; I'm not sure. All I know is that I am glad to have been alive to see this masterpiece.\\n\\n\r\n*This review assumes that you have seen both seasons of Showa Genroku Rakugo Shinjuu. If that is not the case, leave, watch both seasons (or if you've seen season 1, continue on), and head right back. I will spoil both seasons for the bulk of this review*\\n\\n\r\nShowa Genroku Rakugo Shinjuu is an impeccable tale about two young men’s careers and how their ways of dealing with their passions for their beloved art form affected the lives of themselves and others. It serves as a prequel to the events of this season, and are filled with such foreshadowing through the symbolic Rakugo performances that their effects can still be felt in this second season, but I'll get there. \\n\\n\r\nThe sequel, Sukeroku Futatabi-hen, is a masterful tale of an apprentice surpassing his master while not only trying to not only carry the art in which he promised and now is challenged to protect, but also learning even more of just what happened before while his master comes to terms with everything, from his past to his legacy. Well, that's only at the start, since there are new things added in each episode that make each one vibrant, dramatic, and thrilling. The follow-up to the undisputed best anime of 2016, is every bit as rich as its predecessor and then some. With that said, let’s alter my usual segue, and jump right in, shall we?\\n\\n\r\nWe begin with this hilarious meta performance by Yotarou, aka the 3rd Generation Sukeroku, telling us that it has been a year since the last season and that he had been putting his head to his feet in anticipation of telling us the second season’s events since the beginning of the Spring 2016 anime season, which is gold. Not to mention how the directing encapsulates his disorientation from that whole wait. With this, we begin the series on a hilarious, upbeat, and creative note, which is fitting for this masterpiece.\\n\\n\r\nThe anime wastes no time in revealing the symbolism behind Yakumo frequently telling the story “Shinigami” in season 2, as we learn that Yakumo insists on haunt Rakugo die with him, saying this directly to Yotarou, effectively challenging him to fulfill the promise he made to him 10 years ago about keeping the art alive even after the master’s death, hence what I just alluded to literally 2 paragraphs ago.\\n\\n\r\nAfter a delightful and magnificent first episode, the second episode really delves into showing how the media is a bunch of snakes that will use Yotarou’s past against him, especially Amaken, the fucking prick. We get to see how certain upstart audience members will insult Yotarou and anyone who likes his work, sort of like an accidental allegory for an elitist punk that mocks us for liking a show we genuinely like. We get to see just how badly this affects him as he makes his first bombing performance, and everything really crumbles for him. At the same time, Eisuke (who met up with him in episode 1 and piqued his interest about Sukeroku) talks with Yakumo, wanting to know everything about the past of Rakugo, the masters, and, even Miyokichi for some reason.\\n\\n\r\nHer name comes up a lot, and it disturbs Yakumo and especially Konatsu, for we know what she did in season 1 and how Konatsu felt about her; her awful, love-deprived mother. Miyokichi’s negative impact is lasting, which is akin to how in real life, someone can leave a negative impact on so many people’s lives even after he/she is gone, to the point of using that person as negative comparison and contrast. Not only that but, as I said, the whole gang thing becomes notably relevant as well at around the same time.\\n\\n\r\nEach episode brings something crazy and new to the table, which is not what I expected. I mean, this show brings a lot of originality to the table, but I didn't expect it to start delving into some of the stuff it did with each new episode adding a new subject to the pile that relates to the characters’ personal lives. From the yakuza stuff, to Miyokichi, to a time skip where we get to see the new Shinnosuke that was born from Konatsu, to the lovely performance Konatsu gives to and with the kindergarteners, and even more amounts of great moments and revelations, this show never gets old. It's a treat to see just what amazing new thing will pop up, much like opening a bunch of presents on Christmas or your birthday.\\n\\n\r\nWhile, yes, the amount of time skips is potentially bothersome, even to me, the show never dwells at all on these time skips and it just wants us to have a reasonable gage on them, particularly with the second one, as they later spell out the first one. It's not like the time skipped was even necessary or something that would really flesh out the characters or develop either the characters or the plot. It would be nice to know more or if they resolved the gang issue from episodes 2 and 3 thoroughly, but they would merely be interfering with things if that were heavily included. Some people will complain about the lack of symbolism or foreshadowing behind the Rakugo performances this time around, but that's because the ones in season 1 were meant to do what season 1 was all about: foreshadowing, since it is effectively a prequel to the present day story, with season 2 being that story that is really about bringing everything from the past to light and to a close, which is why this doesn't bother me much.\\n\\n\r\nThe Inokori performance that was hyped up for episodes 3, 4, and 5, was entertaining like the rest of them, but ultimately, the crux of episode 6 was how the final moment of episode 5 jacked up his health, part of that moment involved him seeing a hallucination of Miyokichi before being part of a hallucination of Sukeroku shoving him down for unknown reasons in a room full of candles. This leads into the fact that he hasn't truly forgotten about either of the two, and it also leads into the big truth: Yakumo lied to us. Not only to us but to Konatsu and Yotarou. \\n\\n\r\nSpecifically, he lied about the circumstances of Moyokichi’s and Sukeroku’s deaths, or, as they are known by real name, Yurie and Shin. In reality, due to an emotional outburst, Yurie stabbed Shin and panicked, but the wound wasn't horrible. Konatsu came into the room and thought Bon (Yakumo) did it but Yurie told her that she was the one who did it, only for her to hit Yurie and push her out of the room in an emotional outburst which prompted Shin to reach out to save her only to die with her. Since then, he let it seem as if he did it in an act of permanent guilt, especially since her memories contorted around the fabricated idea that he was the one who did it. This moment was insane, not just due to it being a harsh and dramatic circumstance happening so fast, as life tends to do with moments like this, but mainly because it showed that part from season 1, from Yakumo’s story to be a lie, which was an interesting and epic thing to do.\\n\\n\r\nOne failed suicide attempt later, and Yakumo gets to see Yotarou perform one of his old colleague, Sukeroku’s most famous works, and after his daughter is so moved and the finally gets the chance to perform, the gang boss, Kido Isao is arrested and Yakumo gives a performance surprisingly relatable to him. Then, after being disappointed by Yota’s performance, he does Shinigami, only to see Sukeroku and nearly die in a fire; a truly harrowing and tense scene, in no small thanks to the directing. With the sheer impact of that flame, we eventually get more news: Konatsu is pregnant once again. After that, we learn even more of what Yakumo did for her, and after a nice performance by Yota and some unnecessarily adorable backup by Shinnosuke, it seems like Yakumo is finally dead.\\n\\n\r\nThe afterlife is very interesting there. It's a more vibrant and more poetic version than real life, and is a truly lively take on the afterlife, though nothing can beat the “Land of the Remembered” from Book of Life. It's a beautiful thing to see our trio reunite, and even more precious to not only see our two original leads perform Rakugo once again, but to do it with Konatsu and Shinnosuke by their side for a bit. Sure, this raises questions, but we, like Yakumo, can't really be allowed to truly understand this afterlife. It's also a shame that Matsuda died as well, but at least he sees his master off in a beautiful river in a breathtaking ending sequence that leads to a golden new frontier that is just...heavenly…\\n\\n\r\nThe finale is one of the most peaceful, loving, and nostalgic finales in existence. We get to see Shinnosuke and the new child Koyuki, and they're pretty nice, and do really take after their role-models, Yakumo and Yotarou respectively. It's nostalgic to see how everyone we are left with to care about has aged, and the Rakugo performances of Shinnosuke and Yotarou are really nice, with the added bonus of Yotarou going what Yakumo went through earlier in the season with seeing someone he cares about being the Shinigami. The final scene really sells the nostalgia everyone has at this point and made me both nostalgic and teary-eyed. \\n\\n\r\nYou never know what to expect with this show, and it's rare that we can say that in a positive manner. It's told impeccably, and it keeps things exciting with rest new twists and turns around every corner. Honestly, the finale was perfect, and the road leading up to it was beyond stellar.\\n\\n\r\nYotarou is the same as ever, even with the 10-year gap between the beginning of season one and the beginning of this season, but he has still grown in terms of a performer and a student. Still brash, outlandish, loud, goofy, and earnest, this loveable fool, and, just like with some of his audience members, he will always be Yotaro to me. Plus, he makes a great dad and a really good partner to Konatsu, like in episode 4 when he got her to perform in front of her son and his class, or when in episode 7, he still decided to shield her from the truth about the Sukeroku death incident despite it taking an emotional toll over him and the fact that he now knows the truth. He’s a real treat to get to listen to, even when he becomes old.\\n\\n\r\nBon, our old master from the beginning of the series and our interesting young lad from the entirety of season 1, is still as strict, stingy, and as much of an ass as before, but with more of a reluctant tendency to just let his two younger ones (Konatsu and Yotarou). After all, he’s gonna die soon, not them, they still have full lives to live. It's also interesting that he actually wanted Konatsu to kill him all this time like she said she would, but it not only disappointed that she hadn't but is not disappointed that the only reason she keeps him alive now is that her baby likes his rakugo. Worst of all, he doesn't enjoy doing it anymore, as it relates to his guilt of Sukeroku’s death, which we learn wasn't even his fault. He continues to lie about the situation to make himself as guilty to Konatsu as possible, since, as I stated in my season 1 review, he feels genuinely horrible about this whole thing, and all of this affected his art and his view on everything. Putting everything into perspective with the ultimate twist, which I have to commend this show for, since I hate the Unreliable Narrator, yet this show used that in order to allow us to have a thrilling prequel that sets up such context for the truth of it. \\n\\n\r\nKonatsu is as stubborn, angry, and hot-headed as ever, even after knowing the truth about everything and finally raising a kid. Even still, she is still very likable and a worthwhile partner for Yotarou. Still, there is a good reason, since she’s been that way pretty much all her life, starting from the moment she effectively killed her mother and contorted the memories of that event to Yotarou comforting her. It's pretty tragic, honestly, since she really hasn't grown out of that angry, overly emotional, and vengeful state, at least until motherhood in which she is still somber, but at least she mellows out in old age.\\n\\n\r\nEven other characters like Matsuda, Eisuke, Mangetsu, and Yotarou’s former boss, who play mostly minor roles here with one exception (all 4 of which also played minor roles previously, like Eisuke being that one man that was rejected by Yakumo near the end of season 1) remain or become really fun and likeable, and that's a treat in its own right. The only exception is the intentionally awful cunt known as Amaken, a total SOB who actively ruins Yotarou’s gig by rubbing his past in his face and acting like an asshole during Yotarou’s performance.\\n\\n\r\nOther more minor characters like Kido Isao and the geisha from season 1 are still rather good people, like, for example, the boss man (Kido) himself being charismatic and understanding, fascinated by rakugo, and not afraid to stand up for women, as shown when he throws Yotarou into rocky water for making Konatsu nervous for him due to his impudence, or remind us that he is still the boss and that he exerts massive authority. I also like Shinnosuke, the grandson of Sukeroku (who was also named Shin) for being such an adorable kid who happens to be a really nice boy, making me want him to grow up to be an amazing lad, as odd as it sounds given that he is merely an anime character. Turns out, both he and Koyuki were great as teenagers as well, and their dynamic is fun.\\n\\n\r\nHonestly, as cheesy as it is for me to feel this easy about characters in fiction, I really feel like I know the whole family of these guys as a friend who somehow got to see everything they went through that really contributed to this story. I don't think any anime has been able to do that for me, and I'm sure many of you feel the same way. It's damn impressive for an anime to be capable of doing such a thing, and I adore this anime for it.\\n\\n\r\nStudio DEEN is not known for having high-quality art. Rather it is known for the CGI Dragon, and the way it mishandled the Fate series. Even still, the art here is as impressive as ever, with great backgrounds and lively Rakugo performances to boot. Plus, if you thought the directing in season 1 was phenomenal, prepare to have your mind blown by the amazing moments of shot composition, lighting, and framing that shine amongst the best moments of season 1 and then some. Even with the occasional moments of bad CGI or the lack of notable fluidity overall, are unable to really bog down this series too much for its phenomenal directing and great art. Director Hidetoshi Namura did an excellent job with both seasons, and he deserves said credit as the animation director, and Studio DEEN deserves major credit for their work here.\\n\\n\r\nThe anime wastes no time showing us some new songs for the overall OST, which is admirable, as a sequel should always bring in some new music to mingle with the old. Each track is as lively as ever and there are even more great jazz compositions to spare. They are, once again, placed incredibly in the perfect scenes, such as the song for the final moment of episode 1.\\n\\n\r\nThe OP, “Imawa no Shinigami” by Megumi Hayashibara is both chilling and emotional, and with some of the best directing an OP can have, to the point that even the name carries meaning about one of the integral plot points of the show: Shinigami. Even outside of the masterful directing which is worth it's own video by someone who can break it down in perfect detail, it is still a wonderful song to listen to, starting off in a very chilling and somber tune with clocks ticking before Yakumo walks and then falls off a cliff, then it ramping up in an emotional flurry of him falling, to a slow emotional and chilling buildup from when he and Yotarou meet again and he purposely sinks back in and we see the death bell chime and a giant record-player stitching between different records of the different points of Miyokichi’s life, all the way to a true emotional payoff of everyone being there for him, including Sukeroku, who opens him up and brings the OP to a close, with the light already being out…\\n\\n\r\nThe ED, “Hikobayuru” by Kana Shibue is also a very nice and relaxing jazz piece that takes us on a magical journey. We get to see many amazing landscapes and environments within the whimsical ED, and it's honestly a treat. While it is certainly not as amazing as the OP, it is still nice to listen to, and it even beats the first season’s OP much in the same vein as with the OPs.\\n\\n\r\nNo matter what, Rakugo has never had an episode that didn't make me feel at least engaged and thoroughly entertained, with this season being no exception. The Rakugo performances, namely the ones played in full, are still quite a fun time, and I loved each episode. The scene in episode 1 with the duet of Yotarou and the geisha, the opening scene in episode 4 with Shin reciting Jugemu while walking, and the performance Konatsu gave with and in front of both Shin and the rest of the kindergarteners in episode 4, are some of the most endearing moments I've ever seen in an anime, with the latter moment also being one of the most heartwarming, thanks in no small part to the brilliant directing that really played up all of the emotions we were meant to be feeling. The stellar directing wowed me constantly, and the drama felt earned and properly done. I rarely found anything that even remotely made me not have a big grin on my face, which is a rarity, even among my favorites.\\n\\n\r\nI know that I’ve basically been gushing this whole time and have provided only the most minor of criticisms, but it’s because it was so damn good that I hardly found much wrong with it. Besides, the finale and penultimate episodes were just magical and full of wonder and nostalgia. I can't believe I have to get nostalgic as a teenager of all things, but hey, this anime is that powerful. Imagine when I watch this as an older man; suddenly I will cry my eyes out at the relatability. But that's a long, long time away from now. With that, onward to the conclusion of our journey, as we celebrate this final, glamorous performance.\\n\\n\r\nIt seems almost ludicrous that this anime would be my first 10. It's crazy to think that this will only get better as I get older. This anime is a wonderful and poignant masterpiece and a lovely conclusion to one of the best anime of the new century. Art is the perfect way to describe this show, as it really explores and encapsulates both the effects and emotions of art. Nonetheless, it has come to a glorious end, and like the characters at the end of the series, we can look back fondly at all that happened here. Honestly, it's a pity that I've basically run out of things to say and that there are people who can and will do this show more justice than I ever could, for this wonderful work of art deserves more attention than it has gotten, and all of the praise it can get. Well, with that said, I bid you adieu.",
            "date": "2017-03-24T16:51:00+00:00",
            "helpful_count": 59,
            "mal_id": 243419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=243419"
        },
        {
            "content": "Coming off the highly acclaimed and one of the best anime of 2016, Shouwa Genroku Rakugo Shinjuu, comes it's second season and it's... I don't really know to describe how good this is, but that's just how good it is..If that makes sense. It's light, It's beautiful, It's haunting, It's deep, It's dramatic. It's one of the most masterfully made anime there is. \r\nOne of the things this show does so well is that it presents itself in the form a Rakugo. It's leisurely paced but the genuine and detailed storytelling and flawless performances combined with just the necessary amount of soundtrack certainly makes itseem so. This anime is not just a love letter to the art form and it's celebrated history but also serves as a medium to revitalize the art form for it's future and introduce it to new audiences from different places and cultures. I read an article about this show, the writer brings up something about western audiences asking a Rakugoka to perform classics from this anime. It's goes to show no matter how unpopular this is in the mainstream, it has made quite a significant Impact.\\n\\n\r\nAnother thing this anime does very well is that it brings out the cinematic elements of an anime that one would normally take for granted, such as Screenplay, Dialogue, Cinematography, Editing, Performances, Direction and makes it stand out incredibly well. The screenplay and dialogue especially are unbeatable, whoever wrote these scripts deserves a fucking award. The Rakugo scenes are the part of the anime that really highlight these things. Giving us that theatrical experience and helping the audience understand the story being told. \\n\\n\r\nThe characters in the show are fantastic, they're brilliantly written and almost everyone plays a very important role in the storytelling. The anime mainly shows 3 different generation of characters. So yeah, there are a lot of different range of characters. It's interesting to see how they view Rakugo and the different approaches that they take. Yakumo for example wants to take Rakugo with him to the grave, Yotarou wants to continue Yakumo's legacy and continue the art of Rakugo, You would think Yakumo is wrong but he has some pretty valid points that made me go like, \"yeah bro, you know what? just take it with you\". Yakumo is my favorite character, He is probably  the MVP of the year honestly, It's very interesting how the flashback events of season 1 and the progression of time play a part in his character development. The relationships these characters have are very well written and how it all dramatically plays into effect is such a joy to watch. The character design is great too, it's very unique and appealing and there is a lot of detail in their actions that really tells who they are and gives them a real identity. I love it.\\n\\n\r\nComing to the animation and soundtrack, The animation is just amazing and consistent from start to finish. Hats off to the animators and also the production studio, studio Deen, they are restating themselves with this show. I haven't seen them do anything this good honestly, Great use of colors and like I mentioned before, there is a lot of detail and effort put into the characters and setting that I truly appreciate. \\n\\n\r\nThe soundtrack is refreshing. Very dramatic, theatrical and sometimes very unpredictable, A lot of times it's just traditional Japanese sounds. It's minimal and used only when necessary. It plays very well into the quiet atmosphere and genuine storytelling of this anime, making it seem like a Rakugo itself. \\n\\n\r\nOverall I really enjoyed this anime, it truly is one of the few shows that are near perfect in the way that it is executed and presented to you, There isn't any major flaw or anything, even things like leisurely pacing and the fact that some people might find that boring is something the anime embraces itself. It is true that this anime is not for everyone, People who usually are into the more energetic and fast paced genres might not enjoy this but I would still recommend it to you, cause this anime really is just THAT GOOD, If you're someone who is into the craft and enjoys some great storytelling, there is a really good chance you will be blown away and enjoy it as much as I did. \\n\\n\r\nI would give this anime a 9.5-10/10. I am extremely satisfied with what I got, Definitely a contender for Anime of the year and easily the anime of the current winter 2017 season. Highly recommend everyone to check this out!",
            "date": "2017-03-24T11:37:00+00:00",
            "helpful_count": 35,
            "mal_id": 243384,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tigermaskshinobi",
                "username": "tigermaskshinobi"
            },
            "url": "https://myanimelist.net/reviews.php?id=243384"
        },
        {
            "content": "The second season of Shouwa Genroku Rakugo Shinjuu cemented the series as an undeniable masterpiece for me is what I wish I would be saying right now. However the second season lost a lot of the aspects that made the first season of Rakugo great for me.\r\nIf you were to ask me what the first season was, I'd say that it was a story about the industry of rakugo and the life of two men that grew up together and were raised to work in that trade. If you were to ask me what the second season is, I'd say that it is about thestate of where the industry could be going, and concluding Yakumo's character arc. The way the series tries to present the state of rakugo and where it moves going forward is through Yotaro, a new character of whose sole purpose is to constantly reiterate that Rakugo is to be preserved, and Yakumo's reluctance for rakugo to be changed and not die with him. The problem here is that Yotaro gets focus only for the first few episodes, where he has to get inspiration and get over his bad reputation dug up by the media and convince his wife that he is a good father for her son and a good man for her. This gets resolved in about 2 episodes and afterwards all the focus on Yakumo. After these events, in all becomes about Yakumo and his deteriorating health. At this point is when this season of Rakugo simply becomes \"oh guys we love rakugo so much how can we improve rakugo is yakumo alright is rakugo alright\".  Every episode pretty much relies on delivering a Rakugo piece and knocking Yakumo down and then bringing him back down only to knock him down again and it repeats this cycle until this season reaches its end. \\n\\n\r\nIt is about 5-6 episodes of stagnation with the characters merely being in a cyclical state until the season reaches its end and things can happen in a way that feels final rather than repetitive. Two of the episodes don't really have any effect on the overarching plot but bring more flesh into the universe, two are about Yotaro as I have had said and the last two conclude the series. So we have about 2 episodes about the new generation of rakugo performers, about 6 episodes simply stagnating the story with events of the same nature told in a slightly different way, 2 episodes that while I actually considerably enjoyed far more than the other episodes because the details they brought in universe and the Rakugo in them, but I still consider them filler since they don't impact the plot moving forward, and the last 2 episodes that are wrapping things up. Frankly, to me it felt like it had no idea what it set out to do, other than present us with more rakugo, while not advancing the plot because the story planned itself to end with a certain event. It dragged on a couple of times, and for the most part it felt like a pointless continuation, due to the fact that it feels like it keeps bringing up more of the same. The mere existence of Yakumo as an unresolved character that got a lot of focus, even when his character would get fixed to be deteriorated again, brought no value to the story and by the time it ended, because I simply couldn't care less anymore. The episodes where he wasn't a much of a focus point in this season were my favorites, simply due to the fact that I didn't know what I would get and I had no expectations.\\n\\n\r\nQuite frankly, due to Yakumo's existence and Sukeroku's legacy, the characters hardly got anything besides blood ties and admiration to define them in universe for the most part. None of them really have real impact on the events but they are either related to Yakumo or enjoy Yakumo, which I guess the series thinks is reason enough to keep them around and relevant. I do find Yotaro acceptable as he is a reformed criminal who wants to have a positive outlook on life. But there are characters such as a writer that simply chooses to stick around because he wants to write new rakugo stories and he likes rakugo. That's his motivation and personality. He is constantly around and he at best brings exposition, at the worst he just makes his presence felt. What is the point of having a character who is like \"Rakugo is such a beautiful thing. It should be preserved and kept alive.\" who brings no real contribution to the events of the story? His personality is rakugo. His impact on the events is artificial and he feels like he is a device to present that things should progress.\\n\\n\r\nYou need to understand that I can't really contain my dissapointment when I complimented its first season for its really strong of storytelling, where it presented all the essential details and developed on its characters in a smart way, presented flaws and difficulites they went through, as well as their strengths. The events mattered because they were shaping Yakumo into the person he became, because of the certain point he got in life, but the events this time around don't really sway impact because this season is simply preparing Yakumo for the end, with every event in the story being like flowers on a gravestone. None of the events in the story seemed like they had any impact on the universe and there were no real difficulties the characters tackled, outside of Yotaro and Yakumo, who kept struggling repeatedly with the same things which made things repetitive. I couldn't care about the characters and the story was all in all a mess. There were still things I enjoyed like the rakugo stories told in these season were really entertaining, for the most part. I especially enjoyed the one told by Konatsu, Sukeroku's daughter, in front of her kid's classroom. But this second season was not at the same quality of the first season, as it seemed to have no direction for its entirety, thing that I would stayed felt the opposite way the last time around.\\n\\n\r\nTo conclude, the second season of Shouwa Genroku Rakugo Shinjuu took too much time to reach its conclusion and presented a lot of details that I couldn't find relevant to the overarching plot, and therefore lost my interest, due to too much foreshadowing and stating the direction it wanted to go to outright through a character of whose role was exactly that. While in the first season, I knew exactly where I was going and what to expect and I enjoyed it, in this season I disliked it, because the execution isn't as strong, because the events aren't as impactful due to them being repetitive by nature of not having lasting consequences on its characters or skipping directly to the desired result, the characters therefore don't feel as human due to that fact, as well as them not having any real difficulties in their lives to truly display any of their flaws or strengths, making a lot of them simply present, but irrelevant. There are rakugo pieces, but those mostly come to your discretion, as different stories impact people in different ways. I enjoyed most of them, but I can't and won't speak for everyone. If you're curious about how this season went on and I kind of turned you off, I will also note that this season doesn't really take away from the experience of the first season, unless you were really emotionally attached to the series. The first season still remains at the same level as it was, and I don't find it was a waste of time to find out how things in the universe of Rakugo have had concluded. But note, that it isn't gonna be what it used to be. It will just remember what it was.",
            "date": "2017-03-25T08:38:00+00:00",
            "helpful_count": 32,
            "mal_id": 243476,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047626.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ItIsIDio",
                "username": "ItIsIDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=243476"
        },
        {
            "content": "Not only is this show not up to par in comparison to it's predecessor, but simply wouldn't be worth your time or consideration without it's lineage. \r\nThe first season clearly demonstrated how every character is shaped into who they became by preceding events, and almost every element introduced has a crucial role in the plot; in contrast, the majority of this season's plot elements are introduced, then simply go nowhere. \r\nTake as an example, the desire to keep Rakugo traditional, versus the need to keep Rakugo alive through innovation. The first season heavily foreshadowed that this would be the main struggle of S2, and thefirst episode of S2 seemingly confirms this by introducing a character whose main goals are to write new Rakugo stories, and get Yotaro to tell these new stories. Of course Yakumo is opposed to this, and it seems that this push & pull between innovation & tradition may determine the fate of Rakugo's future.\\n\\n\r\nBut it doesn't. At no point does the plotline of new Rakugo stories actually go anywhere, besides the writer occasionally reminding the cast & audience that he's ostensibly here to push said conflict, but it also seems that writing new stories is completely unimportant to the survival of Rakugo.\\n\\n\r\nThis is far from the only violation in this manner. A mob boss is introduced, who has very little impact on the plot. Yotaro has a friend who appears multiple times throughout the show, only to have little to no impact on the plot. A shocking twist is revealed in Episode 7, which ends up having no impact on the plot whatsoever. \\n\\n\r\nUltimately the only plot lines that get resolved are 1. Does Rakugo survive and 2. How does Yakumo deal with his grief? These could have been good enough, but both elements are suddenly resolved in episodes 11 & 12, with the latter being resolved in one of the cheesiest manners possible. The majority of the season is just Yakumo almost dying, expressing regret at his past, and not really moving anywhere. Rinse, Wash, Repeat.\\n\\n\r\nYou can't just linger on what was good about last season for 12 more episodes and expect the product to be good. Not only are many of the Rakugo stories told this season just retellings of stories we heard in the first season, not only are the same conflicts carried over, but a decent chunk of one of the episodes is literally just playing footage of a Rakugo story from season 1.\\n\\n\r\nIn the OP, when Sukeroku lifts Yakumo's jacket, revealing nothing but bones inside, it clearly says that Yakumo is empty inside. Unfortunately, after having finished the show, I'd say it was a rather apt metaphor for the whole of season 2 as well.",
            "date": "2017-04-16T17:22:00+00:00",
            "helpful_count": 17,
            "mal_id": 245666,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5529175.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SuperSecretOtaku",
                "username": "SuperSecretOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=245666"
        },
        {
            "content": "I am going to take a risky side with this review: Shouwa Genroku Rakugo Shinjuu: Sukeroku Futabi-hen was disappointing. The atmosphere and the seriousness vibe was completely shakened by the new main character, which I thought was actually for the worse.\r\nStory 6/10 Compared to its 1st season, this series is just weak. You can't say comparing the two is invalid, this season very very much relies on the 1st season. My main issue comes from the weaker characters, who are actually not THAT weak. It's only when I remeber the first season is it when I just realize how hollow the 2nd season characters are.Many more characters show up, and their significance is shallow compared to the first season, making it feel bland.\\n\\n\r\nArt and Sound are both okay. Everything is mellow and sets up the atmosphere well, except when you have a loud af main character. I am far more interested in everyone else, especially Yakumo. \\n\\n\r\nCharacters 5/10 Did the anime feel good at the end, yeah the ending was fufilling. But I just thought that was too much said and not implied. I was the masterful technique that is subtly slowly dwindling as the series progressed, and this was very disappointing. Yakumo especially, even though he was great the first season. There was a serious lack of focus on specific characters, and this was much much needed because that is the core strength of this show. Why the hell do I have to care about shark tooth man or Sukeroku's former boss? The only reason why I am giving this a 5 as opposed to a lower score is that the twist towards the middle-end of the show was truly noteworthy and eye opening. \\n\\n\r\nEnjoyment 5/10- mostly disappointment\\n\\n\r\nOverall 10/10\\n\\n\r\nThe first season is god tier, but you can skip this series. There is sitll some value but do not expect the same show and the same depth.\\n",
            "date": "2018-02-22T10:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 272177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CrimsonNavy",
                "username": "CrimsonNavy"
            },
            "url": "https://myanimelist.net/reviews.php?id=272177"
        },
        {
            "content": "The first season of Shouwa Genroku Rakugo Shinjuu was personally my favorite anime of 2016. It was such a breath of fresh air for the slice-of-life genre with its traditional period drama setting that inevitably clashes with the modernization of society. Who would have thought that something like rakugo can hold such power when it comes to crafting mesmerizing narratives? Personally, I would’ve found it boring when I get to see a performance live. However, the show executes this art of storytelling so well that it never fails to catch my attention. The way it shows the perspective of the audience and the storyteller indiverse angles and its sudden frame changes is brilliantly done as it serves as a visual treat with its gestures in which it further enhances the rakugo experience. All of this carries into the second season, though the direction of the story starts to head towards a definitive conclusion.\\n\\n\r\nWhile the previous season deals with Yakumo’s past and how rakugo forever changed his life, the second season deals with him getting a closure from it. From the first season’s finale, we get a general idea of what to look forward to. Rakugo is in a state of decline just like his health, and he plans to take it along to his death. His haunting past that hinders him from really pushing rakugo to new heights. Unless he has comes to terms with what is troubling him, he can never really move forward and say that he has lived a satisfying life. However, there is an underlying resistance that says rakugo must live on particularly embodied by his apprentice Yotaro. Maybe there is a faint voice within Yakumo that supports this idea that he has grown to love rakugo enough to not let go of it and place his hopes unto the future generations. The second season explores on that, if rakugo will thrive into a new era dominated by technology. \\n\\n\r\nThe show attempts to preserve the art as something timeless, yet it also shows how it struggles being squeezed into the mainstream entertainment. Radio and television shows determine its popularity and Yotaro’s quirky and lively performance manages to put it in a state of relevance. But why is this important? Rakugo is often associated with descriptions like old and ancient, it will eventually die if only people stuck in the past are the only ones that care about it. There is a call to innovate the craft, but it cannot happen conveniently and instantaneously. Most stories told through rakugo are centuries old, occasionally altered to fit in within the era but it has been increasingly evident that mere alterations are not enough for it to convey a memorable and impactful story. Some stories can be alienating to a new audience, so there is a need to create new stories for the future.\\n\\n\r\nWith regards to a few minor complaints I have with the show, I feel like Yotaro hasn’t been fully fleshed out as a character. The story tries to represent him as the resurrection of Sukeroku and the fire that keeps rakugo alive, but we never really know him outside of rakugo aside from being a former yakuza member that served time in jail. What made him emotionally connect with Yakumo’s prison performance? Does he have any profound past experience that drives him to become a better person through rakugo? We’ve seen Yakumo’s past in the previous season do that, and it’s a shame Yotaro didn’t get the same treatment. Also, the ending is quite rushed. I’m happy that it does get the conclusion it deserves but it felt like it dropped out of nowhere and now everything is going to be fine. The previous episodes have been building up the conflict of the story but it’s kind of disappointing that it gets resolved in one swift move. I would talk more about it but I’ll leave it up to the viewer to have a personal interpretation of the ending.\\n\\n\r\nWhile I didn’t find myself more emotionally invested in comparison to the previous season, I still think it’s a great sequel. Animation-wise, it’s inferior as really bad animation frames pop up from time to time and the dialogue occasionally goes out of sync during rakugo performances. However the overall feel of the show complements with the previous season, as it tries to convey a message that there is still hope for something that is dying. Just like the current situation of the anime industry, it’s hard for something that has the heart to tell a memorable and refreshing story to survive amidst the oversaturation of mediocre shows. It gets axed if it doesn’t sell well regardless of its potential. Nothing is really certain and permanent. But still, we fans of the medium still cling to hope and get rewarded by gems like this show.  I really wish we get more kinds of stories as well-made as this in the future, but one can only dream. \\n",
            "date": "2017-03-31T23:49:00+00:00",
            "helpful_count": 11,
            "mal_id": 244207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/798635.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BlueKite",
                "username": "BlueKite"
            },
            "url": "https://myanimelist.net/reviews.php?id=244207"
        },
        {
            "content": "Holy shit this anime is a fucking masterpiece. I'm not trying to be a hypebeast right now when I say that this anime is truly superb. The characters are treated extremely well and given ample space and time to grow and develop, the plot it interesting and plays out effectively, and the storytelling combined with the soundtrack combine to suck you in episode after episode to care about performances of an esoteric art that most watchers won't know about at the beginning but will love by the end. Goddamn. I came into this show with high expectations after the first season (which I gave a9) and was still somehow completely blown away. Only issue I can really see is that the art wasn't as adventurous as it possibly could have been and the pacing sort of dragged in the middle of the season but by the end of the season each new episode had me giddy with excitement like a little kid waking up on Saturday to watch cartoons and eat sugary cereal. This show I believe characterizes the best of the slice of life and drama and is a wonderful ride for those patient enough to take it.",
            "date": "2017-03-24T14:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 243406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cerdaco",
                "username": "cerdaco"
            },
            "url": "https://myanimelist.net/reviews.php?id=243406"
        },
        {
            "content": "The first season of Shouwa Genroku Rakugo Shinjuu was the absolute best anime of Winter, 2016, and very possibly the best anime of that entire year. It was certainly the most moving, truly adult, drama I've seen in a long time. Appropriately enough, since rakugo is the art of storytelling, the first season took the form of a story within a story, telling an incredibly moving tale of a complicated friendship, tragic choices, and the repercussions of those actions for people living in the present day. It was haunting, memorable, and it's been a very, very long year waiting for the sequel.\r\nThe second season startswith a recap told in the form of a rakugo tale--this was an absolutely perfect, and perfectly logical, choice. You're immediately transported back into the space of the rakugo theater, and anticipating the next chapter of the big story ahead. This time, we're completely in the present day (or at least as much as is possible, as history and memory always informs the present for the characters in this drama), and instead of learning about rakugo's past, we get to see how it's faring in contemporary Japan. We also learn how, or whether, the main characters can move forward with their own lives. \\n\\n\r\nThe real joy of this show is to see how Yakumo (the perpetually stubborn, dissatisfied, depressed, and yet extraordinarily charismatic rakugo master), Konatsu (now a mother, and thankfully just as stubborn, prickly, passionate, and intelligent as always), and Yotarou (a newly-minted rakugo star, always playing the fool but clearly much smarter than he likes to appear) interact. There's absolutely no reason in the world for these three to be connected. From decades-long resentments to daily irritations, the only way to explain it is that they're a (very unconventional) family, and sometimes you don't get to choose those deep connections that bind you far more powerfully than you may ever realize. \\n\\n\r\nIn a very real way this is a terribly moving romance, one that ties three disparate personalities together in their love of rakugo and their fundamental love for one another. Yotarou’s centrality in this dynamic becomes a major theme over time, but the magic is in observing the intricate dance of recrimination, guilt, and reconciliation that defines Yakumo and Konatsu’s roles in this drama. If you aren’t reduced to tears when watching the final scenes of episode ten, then you’re far stronger than I am. It’s one of the most powerful and genuine moments in any creative form that I have ever experienced. \\n\\n\r\nThis show is written and directed exquisitely, giving time for characters to develop slowly, allowing conversations to unfold naturally, and always making room for silent spaces that are more overwhelming than traditional dramatic crescendos in almost all other series. One of the most beautiful and memorable moments is a very small scene in which Konatsu’s infant son interrupts Yakumo while he’s playing the shamisen, and in that encounter we learn much more about who Yakumo really is than most shows convey about a character in an entire episode of “big” revelations. Gestures, glances, and the smallest alteration of an expression are powerful in this drama, and the animation takes full advantage of the ways in which visual elements can encompass nuances that words cannot. As the episodes progress, keep close watch upon how Yakumo is drawn. The level of care given to his face and body is eloquent. The animators tell stories in every line.\\n\\n\r\nThe second season of Shouwa Genroku Rakugo Shinjuu may just be better than the first. After living with this story and its protagonists for a while, it's easy to appreciate the nuances of personality and dialogue that imbue almost every scene of this show with subtle emotional resonance. After the enormous revelations and emotional impact of season one, even small developments now take on new dimensions. Plus, this season is about the future. It's exciting to see what happens next. After falling in love with this story and its characters, I never wanted it to just remain in the past. I'm glad that we can look forward as well, even with the full awareness that progression through time, while it carries hope, also entails self-doubt, continued pain over past losses, and uncertainty as to whether what’s to come will necessarily result in happiness. \\n\\n\r\nThis show is a masterpiece of storytelling, as it should be. It knows that life doesn't often proceed by giant dramas and great occurrences. Life is the incremental accumulation of moments, and these sedimentary layers, overlapping across lived time, comprise each of our pasts. As every new memory, experience, or choice is added to that slowly forming bedrock, the character of the whole is forever changed. While we are a product of our past, the present continually shapes us into something new. It's captivating to see these layers form in Shouwa Genroku Rakugo Shinjuu, and it's joyful to see how life is always surprising, intoxicating, and forever a source of beautiful, shimmering stories.",
            "date": "2017-03-24T15:24:00+00:00",
            "helpful_count": 9,
            "mal_id": 243410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5016597.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/delta5",
                "username": "delta5"
            },
            "url": "https://myanimelist.net/reviews.php?id=243410"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nIt’s not every day that we get to witness history in the making.\r\nTake the first season of Shouwa Genroku Rakugo Shinjuu. As critics such as myself agree on, it is nothing short of phenomenal. The drama, the maturity, the writing, the execution. That first season redefined what anime as a medium is capable of. Greatness incarnate.\r\nSo, understandably, the sequel here, Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen, not only has the difficult job of concluding this tale but also maintaining that same level of excellence. The big question, then, is: did Rakugo Season 2 make history?\r\nSufficeit to say, it did.\\n\\n\r\nSTORY\\n\\n\r\nTaking place ten years after Bon’s personal recount on the origins of his life and the art of rakugo that guided him, Rakugo Season 2 instead looks to tell the tale on the ending of his life and where rakugo ultimately goes from here. With this mirrored approach, the series finds itself right where it wants to be: within a narrative rife with strength.\\n\\n\r\nNearly (if not every) episode has at least one downright major moment that grips the audience with its care and its purpose. In episode three, Yotaro berates the gangster boss as a declaration of his love for Konatsu and Shin. In episode five, Bon collapses on stage after witnessing Miyokichi in the surrounding smoke during his performance of “Hangon-ko” which in turn leads to Sukeroku finally (and briefly) speaking to him for the first time in his fever dream.\\n\\n\r\nBut no doubt two of the most incredible moments occur in episode seven and episode twelve. Episode seven features the amazing plot twist predicated by the entire first season and Bon’s perfect storytelling. Therein, the audience learns that he lied about the night of Miyokichi and Sukeroku’s deaths, forcing everyone to reevaluate this man and his character. Episode twelve does something similar. It drops the bombshell that possibly, maybe Shin is the biological son of Bon himself, wracking the audience with one last morsel to interpret.\\n\\n\r\nThese awesome moments occur again and again and again throughout the entire season. But Rakugo Season 2doesn’t just stick with series-defining scenes, though. True to form, it also focuses on the smaller details that make up the wonderful nuance in the presentation.\\n\\n\r\nFor example, the anime opens with a meta rakugo performance by Yotaro. With no other patrons in sight, he directly addresses the audience, recapping them on the events thus far. He goes so far as to joke how the one-year stretch between both seasons has had him bowed for so long that he can “hardly tell his head from his feet anymore” (with rotated perspectives for good measure).\\n\\n\r\nOr how in episode eleven the anime foregoes showcasing anything related to Bon’s real-world death (e.g., a funeral, the reaction of his loved ones). Instead, it focuses purely on his final, spiritual journey before he officially passes on. Sukeroku, even in the afterlife, asking to borrow money from Bon solidifies the show’s deliberate care.\\n\\n\r\nA new atmosphere also blankets across the ensuing plot. The feelings of subtle sadness and complete loneliness pop up time and again as Bon endures the outcomes of his decisions from many years ago. However, a twinge of hope persists. An optimism that the larger cast, the uplifting events, and the greater focus on Yotaro (especially in the first half) curate to a noticeable extent. This newfound mood aligns with the parallel structure of this season in conjunction with the previous one, once again marking the anime’s layered construction.\\n\\n\r\nNot to mention that the rakugo performances themselves return and roar with a vengeance. Just as with the first season, rakugo represents more than just an entertaining few minutes for the audience to get lost in right alongside those who paid to see the performers. Rather, the unique storytelling contributes to not only the events but also the characters involved.\\n\\n\r\nFor instance, Bon recites his signature “Shinigami” in episode nine which literally summons a demon who nearly kills him before his destined time. Or how, in episode six, Yotaro performs “Inokori”, an act that captures the very essence of his rakugo.\\n\\n\r\nSimultaneously, rakugo develops throughout the season. It becomes more progressive when Konatsu, a female in a male-dominated field, performs a wonderful rendition of “Jugemu” in episode four and, at the series’ end, becomes a regular performer herself. Eisuke writes new stories for Yotaro and the others as a way to start the next set of storied works. Its popularity dips and rises as the events and the characters play out.\\n\\n\r\nRakugo’s development hones in on one of the anime’s most important themes: time. Time is an ever-flowing stream that pushes everything forward whether willed or not. It can change ideas like rakugo itself. It can also change people like Miyokichi who tells Bon not to worry about his mistreatment of her in a “time heals all wounds” approach. For some entities, though, time has no influence. Yotaro remains Yotaro (both in the show and in this review) despite his couple of new names, and time cannot affect something like the past because, in the end, what’s done is done.\\n\\n\r\nThe multiple time skips then take on an even more integral role. For not only do they affect the progression of the plot but also they tie back in a meta sense to this very theme. The structure of this entire series wraps itself in time, too. Where the first season took place almost exclusively in the past, Rakugo Season 2 channels the present while heeding the future. Moreover, this season explores time as a concept such as when Yotaro speaks with the rakugo-theater proprietor in episode six about the accumulated history of that building.\\n\\n\r\nWith time every which way, Rakugo Season 2 channels its pristine writing skills.\\n\\n\r\nA full-circle narrative returns when Yotaro celebrates his new names at both the beginning and the end of the season.\\n\\n\r\nVarious callbacks, both in and out of the season, add extra layers. In season, episode eight has Yotaro perform “Shibahama” as an emotional reference to Sukeroku’s last in-life performance; out of season, episode nine has Bon perform “Tachikiri” at the prison as an unseen reference to how Yotaro himself first became interested in the art by watching his master (who at the time performed “Shinigami”) at that same prison.\\n\\n\r\nSmart foreshadowing of Bon’s death in one of the three initial promises he laid out for Yotaro demonstrates the show’s tight sequencing of events. The passionate dialogue between the cast likewise elevates the anime’s appeal.\\n\\n\r\nBefore Bon passes on, his final, heartfelt exchange with Sukeroku concludes their hand-centric leit motif. Where Bon originally slapped Sukeroku’s hand away upon their first meeting and (in his lie) had to unwillingly let go of it, they part ways one last time with a pinky promise. That the two will see each other again – someday, somewhere – beyond the ethereal plane.\\n\\n\r\nAltogether, this season’s story, like its predecessor, contains an astounding amount of execution. The amazing scenes, the involved rakugo performances, the themes, the intricate writing. Nothing short of excellence, indeed.\\n\\n\r\nART & ANIMATION\\n\\n\r\nRakugo Season 2 continues with the same impressive visuals as the first season.\\n\\n\r\nOnce again, the rakugo performances shine. On stage, Bon, Yotaro, and the other performers act out the parts of their stories with believable, subtle movements. Faces contort to match old friends or to display emotions befitting the events portrayed. And the camera shifts and rotates in such a way as to heighten the impact of their delivery. Best of all, these performances persist in how they interweave the real with the imaginary, like how Bon summons the spirit of Miyokichi who haunts him still.\\n\\n\r\nOutside of rakugo, the rest of the artistry does not let up. Locations regularly change to induce variety in the background art: a tree-filled, yellow-leaved park at a nearby hospital, the different rakugo stages setup across the city, the restaurants, villas, and buildings visited. Cinematography also plays a key role: close-up shots of the characters eyes for dramatic effect, framed perspectives provide aesthetic symmetry, strange angles allow fun, interesting setups. Lighting and coloring likewise maintain the anime’s mature mood through careful touches and balanced hues.\\n\\n\r\nLike the performances, however, some of the best scenes combine the realistic setting with the imaginative possibilities. For instance, in episode six, a stylistic set of depictions accompany Eisuke’s explanation of the three distinct rakugo “expressions” (as he calls it). Bon’s refined technique resounds and reverberates his shadow into existence. Sukeroku’s sincere, in-place approach phase shifts him towards himself. Yotaro’s purity removes him entirely from the picture and replaces him with characters painted seemingly centuries ago.\\n\\n\r\nSomething as simple as Yotaro going from watching the film of Sukeroku to being a member of the audience in that very same room on that very same night in the blink of an eye demonstrates Rakugo Season 2’s immense desire for flair. In similar fashion, this sense of simplicity applies to the characters’ designs. Bon’s whitened hair, Yotaro’s large build, and Konatsu’s reserved beauty create in them their own looks, but the small, subtle changes to their features over time leave the longest impression. Bon wrinkles with age and appears visibly weaker as the events take their toll on him. Yotaro gains a big belly and baggy eyes after sixteen more years pass by. Konatsu’s hair grows from short to medium to long in length over the entire season.\\n\\n\r\nAnd small details help to fill in the cracks. In one expert case, episode eight finds Yotaro repeating similar words to Bon as Sukeroku did before him. It instigates a swift flashback, but rather than putting Sukeroku in the frame, it leaves him out, showing instead a static shot of the some burning wood since that is all the audience needs to remember that time from the first season.\\n\\n\r\nTo be absolutely fair, the anime is not without error. Some of the way-in-the-back onlookers can sometimes seem as if they were hastily put together. And, in episode five, the animators accidentally and incorrectly colored Yotaro’s mouth instead of filling it with teeth to fit his toothy grin (indicated by the squiggly line therein). But these issues are nitpicky, and the anime does more than enough with its art and its animation everywhere else to make them inconsequential in the long run.\\n\\n\r\nCHARACTERS\\n\\n\r\nRakugo Season 2 includes several side characters. Matsuda, the kind, silent man who has seen everything from the sidelines. Eisuke, the knowledgeable outside source who has ties to both Bon (who turned him down when seeking apprenticeship in the first season) and Miyokichi (who he crushed on when he was a young boy). Mangetsu, the doctor who returns to rakugo with the Eastern, Tokyo style in tow. Shin, the child of Konatsu who the audience watches grow from a baby to a kid to a spitting image of the men who tailored his life from behind the scenes.\\n\\n\r\nMuch like the first season, however, three key characters helm the charge: Yotaro, Konatsu, and Bon. The laudable writing which guides their arcs reinforces the tremendous level of execution seen throughout the entire series.\\n\\n\r\nFor the first five episodes, Yotaro receives much of the attention. As Bon’s apprentice and a rising star in the rakugo world, Yotaro has a lot to live up to. And with Konatsu as his new wife and Shin has his new (step) son, he likewise must contend with his personal life, too.\\n\\n\r\nThankfully, he’s the perfect man for the job, for he is Bon’s and Konatsu’s rock. Yotaro firmly believes in Bon, his abilities, and his importance. He always respects his master, listening to his commands and sitting before him in a subservient manner. He even saves him from an untimely death at the hands of the Shinigami and the burning rakugo theater. And to Konatsu, Yotaro looks out for her with coats and words and happiness. He supports her as best he can and, in doing so, forms a close bond with their child, giving her a husband and him a father that they never knew they needed.\\n\\n\r\nConversely, Yotaro is, when compared to everyone else in the cast, the most emotional. He laughs and smiles with optimism when speaking of rakugo. He reacts with passion and embarrassment whenever Konatsu reciprocates his feelings in kind. He cries and cares during the truly jubilant and the truly depressing moments around him. He wears his heart on his sleeve, turning him into a very honest, very personable character.\\n\\n\r\nSo, as someone who is there for everyone and who gives to everyone, Yotaro’s pure expression of rakugo makes a lot of sense. As he phrases it in episode five, “I love rakugo, and I really love the characters who appear in rakugo. A lot more than I love myself.”\\n\\n\r\nBut that does not leave him immune from conflict of his own. Moreover, the theme on time finds itself here with Yotaro, too. He understands that taking on the Sukeroku name means upsetting diehard followers, and the gangster lifestyle he has since ditched clouds his mind as he contemplates what to do. So, he confronts these two pasts, working hard to learn about the fabled master and completing the coloring on the tattoo that adorns his back.\\n\\n\r\nKonatsu is a much more complicated character based solely on the fact that her relationships do not follow typical patterns. Having lost her parents early in her life, she never had the most stable of upbringings. She was raised by Bon, the man who (she believes) killed them, so she despises him with every fiber of her being. Then, having never experienced real love, she pushes back against Yotaro despite his sincere feelings.\\n\\n\r\nOver the course of the season, Konatsu breaks down the walls that she has put up around her. With Bon, she interacts with him across the emotional map. She grabs his arm at home while sleeping, and the two discuss how she still wants to kill him for what he has done but needs him alive for her son to hear his rakugo. She frets over him after his collapse, worrying over his health and calling him (verbatim) “pathetic” as they sit together on the park bench while smoking a cigarette. She pleads on the bridge for him to not go away like her parents before him.\\n\\n\r\nWith Yotaro, she slowly learns to love him in return. She appreciates his encouragement when he skips his after-party celebration and chases after her. She reveals her thoughts after his defiant stand against the gangster boss, commenting on holding hands (when she so desires). They embrace following her first ever rakugo performance. They remain in sync in the immediate aftermath of Bon’s collapse. She becomes his accompaniment, playing the shamisen at his own performances. She leans on him affectionately after a hard day’s work.\\n\\n\r\nFor both men, her relationships reach a wonderful apex that signify the development in her character. She thanks Bon for raising her and not abandoning her in a fantastic scene that goes down as their last interaction. And she conceives a child with Yotaro to consummate the love she now fully shares with him.\\n\\n\r\nLooking at Yotaro and Konatsu as individual characters, they hold an amazing parallel with Sukeroku and Miyokichi. The two halves are similar in that the men embody positivity and the women wrestle fiercely with their own feelings. The two halves are different in that Sukeroku leaves rakugo whereas Yotaro uplifts it while Miyokichi tears everyone apart whereas Konatsu brings everyone together.\\n\\n\r\nOther similarities and differences exist between them (marriage, character arcs), but this parallel ultimately influences the most important character of this season and the entire series: Bon.\\n\\n\r\nBon lost his best friend and his one true love to a “double suicide” in the first season. So, the audience finds Bon in a state of regret, resentment, and remorse at the beginning of the second. This negativity has followed his very being for much of his life – to the point that he solemnly wishes to take rakugo with him in death.\\n\\n\r\nYet Bon isn’t present to any significant extent in the first half of this second season. He tutors and converses and performs. But, generally speaking, Bon doesn’t have a major role. A wise decision on the anime’s part since it smartly works instead on setting up both Yotaro and Konatsu for their development and the eventual influence they have on him.\\n\\n\r\nCome the end of episode five, where Bon envisions Miyokichi and when Sukeroku attacks him, the focus shifts back to Bon as he encounters one of the lowest points in his life. He has lost the strength in his voice, so he gives up on rakugo and thus himself. Then, as he feels the inevitable decay of his body, he attempts to commit suicide, and later the “god of performance” nearly burns him alive.\\n\\n\r\nThankfully, Yotaro and Konatsu are there to support the man who has given them so much. In the second half of the season, their actions keep him going. Konatsu cares about and worries for him during his hospital visits. The two convince him to come back to rakugo. Yotaro saves him from the burning theater just in time.\\n\\n\r\nTheir kindness elicits the same from him. He respects Yotaro enough (“Inokori” or otherwise) to pass down Sukeroku’s fan (entrusted to Eisuke) to him, and he accepts Konatsu’s request of becoming his apprentice. Yet it’s his words during their heartfelt scene that resonate the most. As Konatsu cries in his arms and “can’t give a name to this feeling anymore,” Bon responds, “Such incomprehensible feelings are what humans are made of. Just like rakugo.”\\n\\n\r\nLike the ever-present theme on time, a theme on the human condition has persisted throughout this entire season. Yotaro, Konatsu, and Bon endure events that have them experiencing a myriad of emotions. They hide details from each other. They push beyond their differences and connect on intimate levels.\\n\\n\r\nThus, just as Bon says and what the show argues in a meta sense, that’s rakugo at its core. The performer recites the stories, and the audience follows along. But what rakugo does best – both the art and the anime itself – is explore the very nature of humanity. Be it a fisherman who finds a dirty bag filled with money, to the three key characters of this tale, they are more than just a set of fictitious characters. They are people.\\n\\n\r\nBut because Rakugo Season 2 is way too awesome, it doesn’t stop there with Bon. Instead, all of episode eleven sends him off in proper fashion. Now passed away, he has private moments with both Sukeroku and Miyokichi in which they reconcile with each other. Their words on not having everything go one’s way (how Bon couldn’t die with rakugo) and about not being able to live alone (how Bon eventually had a family and a circle of friends) echo that theme on human nature in as cathartic a manner as possible.\\n\\n\r\nAnd, as one last hurrah, Bon performs rakugo for the final time. Not anything dramatic or even his signature “Shinigami” but rather “Jugemu.” Because the performance isn’t for him – it’s for his two old, dear friends, their daughter who he raised, and their grandson who (eventually) takes after him all too well.\\n\\n\r\nSeeing the literal finale to his life and therefore his full character arc puts Bon in the Characters Hall of Fame. He was already one of the best in the medium after last season, but, after this season, the Eighth Generation Yakumo enters a league of his own.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nThe voice acting within Rakugo Season 2 delights the ears and rivals that of the previous season. Tomokazu Seki as Yotaro speaks with enthusiasm and passion as he works to support everyone and everything around him. Yuu Kobayashi as Konatsu uses a raspy voice that highlights her tomboy behavior, her short temper, and her hint of sexiness. And Akira Ishida as Bon ages his tone for the now older gentleman while still maintaining his sharp cadence.\\n\\n\r\nEach of their rakugo performances, like the first season, further demonstrates their VA capabilities in that they capture the audience with their impressive delivery. A somewhat unique opening track and an instrumental ending track also return.\\n\\n\r\nThe OP incorporates the ticking of a clock, whispered vocals, music cuts, soft sections, rousing sections, and wedding bells. Altogether, they create a beautiful, haunting, and interesting piece while keeping with its themes on time and the human condition.\\n\\n\r\nThe ED, in contrast, is simpler with its casual piano playing and backing trumpets, flutes, and drums. But such simplicity brings both a calming strength that carries it along and a sincere, thoughtful goodbye whenever the piece completes.\\n\\n\r\nAnd, in a similar trend, the original soundtrack brings back its dramatic compositions, its cultural additions, and its clever audio design, like when Yotaro’s radio rakugo performance of “Nozarashi” plays over the everyday life of the city and the tops of cherry-blossom trees.\\n\\n\r\nIn short, the music and the sound speak for themselves.\\n\\n\r\nENJOYMENT\\n\\n\r\nI am so happy that this sequel not only exists but also succeeded so spectacularly.\\n\\n\r\nPersonally speaking, I was caught off guard by the twist about Sukeroku and Miyokichi’s deaths. When I finished episode seven, I had to stop and mull over it while walking around my place saying, “What?!” My Thanksgiving holiday, try as it might, could not push it out of my mind.\\n\\n\r\nAlso, that real-father reveal then had me scrounging through comments from eight months ago. Peering through all the angles and reading about some of the extra material, I’m fine with either outcome. I like the poetic structure and the potential for even more feelings should it be Bon. But I also like the ambiguity behind it all. How it follows the “some things are best left unsaid” idea which in turn forces a meta discussion onto the audience as to whether Konatsu is really telling the truth. (I will say, though, that I’m a fan of Mangetsu being the father since it helps to explain his presence and removes the almost too crazy element.)\\n\\n\r\nI love the twist and the reveal, and I love everything else about this show, too. I love the romance between Yotaro and Konatsu. I love Bon’s incredible character arc. I love the rakugo performances. I love the symbolism in the visuals. I love the drama, the maturity, and the execution that it exudes.\\n\\n\r\nWhat more needs to be said? On its own, this story spans more than just seasons. It spans emotions. It spans interpretations. It spans generations. But, when combined with its first half, this complete tale about a complex man, the refined art of rakugo, and humanity borne from the heart creates an anime that climbs onto the stage to peer over the others. A true elite which, like the masters before it, ranks among the best of the best forevermore.\\n\\n\r\nAs Yotaro says in the final line of the series, “Something this good could never go away.” And you know what? After finishing it all, I could not agree more.\\n\\n\r\nShouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen concludes this stunning series with unbelievable finesse. The thorough story, the engaging artistic direction, the lifelike characters, the remarkable sound-related performances, and the sheer amount of entertaining aspects. “Greatness” does not do this anime justice; “a modern classic” instead fits it perfectly.\\n\\n\r\nEncore!\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, huge moments, nuanced details, a purposeful theme on time, and strong fundamental writing craft a stalwart narrative that send this series off in style\\n\\n\r\nArt & Animation: Great, flavorful visuals, clever cinematography, and developing character designs form an artistic direction that invites the audience at every turn\\n\\n\r\nCharacters: Great, Yotaro, Konatsu, and Bon explore a theme on the human condition as their personable, loving, and troubled arcs intertwine with both parallels and connections\\n\\n\r\nMusic & Sound: Great, wonderful VA performances guide a haunting OP, a sincere ED, a dramatic OST, and a set of smart audio design decisions\\n\\n\r\nEnjoyment: Great, a modern classic\\n\\n\r\nFinal Score: 10/10",
            "date": "2018-03-14T17:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 273833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=273833"
        },
        {
            "content": "This is the best freakin anime i've ever seen in my entire life. Writing this because it's so sad for me to say goodbye, cuz its the final episode next week. \r\nSo basically this anime were a masterpiece in its ss1 and continued to do what made it the best in ss2, technical wise. The music, the background music, the rakugo, the background art, the characters' emotions and psychology, and all other things. It fits the mood so well that normally it could hardly be told.  In ss1, the background music was absolutely the star, thanks to dramatic twists that the anime's plot gave.However, in this season, i think the hero role is shared between the music and the character's expression, especially the different faces of Konatsu and Yotaro. The story of the 2nd season is literally the 2nd Generation: The rakugo, as well as the main character role is shared inbetween a small community with Yotaro being the center, and Master Yakumo being the reason of all. \\n\r\nBasically all you'd do in ss2 is falling love with everybody after listening to their story and looking out for them, hoping for a happy ending.\\n",
            "date": "2017-03-17T21:34:00+00:00",
            "helpful_count": 8,
            "mal_id": 242831,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HitagiSenjou",
                "username": "HitagiSenjou"
            },
            "url": "https://myanimelist.net/reviews.php?id=242831"
        },
        {
            "content": "This isn't Rakugo, or at least this isn't the Rakugo that I knew. Descending Stories is weird and different. It constantly pushes a new idea for a show that worked so flawlessly. There's no way that I wouldn't doubt it. I was careful with approaching each new episode, gave it a chance after chance until I realized that I'm just being ridiculous and that it's exactly how it's supposed to be.\r\n*Spoilers included*\r\nIf you've watched the first season of this show, then you know what the entire idea for it was. A story told through the eyes of Yakumo Yuurakutei, the famous rakugo artist that losthis friend and lover in a terrible accident, leaving him with their daughter Konatsu. We saw him take on an apprentice: the ex-gang member and convict Yotarou. After a couple of years he gets a new title, keeps performing his rakugo despite not finding his own style, which was one of the main themes of the last season. With Konatsu now having a child and Yotarou becoming it's father, Yakumo getting older and older with each passing day, rakugo becoming more and more obscure, things are bound to get complicated So, where does the plot go from here?\\n\r\nThis is what I mean when I say that the second season feels weird. The plot takes an entirely different approach. Not only is the point of view scattered throughout multiple characters, Yakumo, Yotarou, Konatsu and a few other characters, which makes the flow of the scattered plot entirely different, not only does the ending suddenly becomes a mystery where as in the first season we knew it from the start, NOT ONLY does the show introduce new ideas and changes things that you would never think it could change, like concentrating less on the performances, but it's past themes go in completely new directions that are actually... happy. Happiness is a word that I'd never thought I mention with this series. It always felt like a Holy Grail that the characters could never reach, as their tragic and difficult lives as performers seemed like a never ending circle of pain and suffering. And yet here we are. Characters keeping a constant smile for more than an episode and a happy conclusion. When I think about it, it shouldn't be surprising. Rakugo itself is split into the dramatic and horror stories and the happy, comedic ones that ultimately end up nicely. The show has taken the inspiration from those stories numerous times before, and it's not different here I guess. What's really important though, is the fact that it works.\\n\\n\r\nDespite bumps and scratches, the show manages to create a cohesive plot, both in its structure and thematic analysis, as it concentrates on stuff like the ways rakugo influences the audience, why and when does it do that, how each person with their own way of living, at their own age and with their own past can see rakugo, what their view on its future and past is and more stuff like that. Just like the plot, the themes themselves become more grounded, especially with the inclusion of Konatsu's and Yotarou's child and them becoming a loving family.\\n\\n\r\nBut I'm saying everything is good and happy here, when it's definitely not. The themes of death, tragic love and the hard life of an artist performing an obscure genre of art are all back, yet in a different way, a much wider one. With Sukeroku and Miyokichi dead, a new space opened for some completely different views and ideologies to come into the spotlight. First, Yotarou, who ultimately decides that he doesn't need to have his own style of rakugo in the traditional way. He wants to become the people in the story, be a prop that is only there because he's good at performing, just so those people can come out through him and be themselves. I really like this idea, as it reminds me of my own way of seeing art. As long as it's performed well, who really cares what it is, who really cares if it's that guy or another that performs it, maybe it's even better when it feels like he's not even there. Let the work itself speak, not the one that performs or makes it. But that's a personal thing, as for how it affects the plot, well, this way of thinking ultimately leads to Yotarou coming up with a revolutionary idea that takes me back to another character: Konatsu. Let me step away for this for a while though.\\n\\n\r\nVery early in the show, a popular writer that's interested in rakugo is introduced to the audience. He becomes really invested in it when he gets to talk with Yotarou. Turns out, he was the kid that we saw asking Yakumo to let him be his apprentice in the first season. His life ultimately went into a different direction, but the inspiration that he got thanks to Rakugo, especially Yakumo's, never died out. This comes back to the theme of \"how does rakugo effect the audiences\", but it also allows Yotarou to start his own plan for the future of Rakugo. As a younger guy, he's open to new ideas, unlike his master. He starts performing on TV and on the radio, he asked him to create completely new rakugo works, but the most important thing that he comes up with is allowing women to perform, more specifically, Konatsu of course. She always loved it, performed at a very young age, never lost her strive and despite neglecting it, always wanted to come back. And this shows how different she and Yotarou are from the characters in the first season, how those people wanted to preserve Rakugo at all costs while they want to open it up to a new era. Again, this is a different idea, a weird one that I wasn't really open to myself at the start, but the way it's implemented, through the incredibly strong, charming and well directed character moments, like Konatsu's performance in front of the kids or Yotarou's strive really did sell me on this. It's as if this entire time rakugo was only held back by the old performers who we loved for so long, and it's only now that we realize it. It's a great theme that messed with my head a lot, the idea implemented by Yakumo in the first season that Rakugo should evolve through the performers or Yotarou's that it should evolve through the ways that humanity changes.\\n\\n\r\nAs such, humanity is also an important part of the series, at the larger scale but also at the smaller, more personal one. Technically, humanity also means the things that make us humane. This is mostly represented through the old and experienced Yakumo, as he gets closer and closer to his last breath. Around the middle of the series, during a family performance, he sees the ghost of Miyokichi and faints. This begins the journey through his past. Old regrets pile up, bad decisions come back to haunt him, and we soon learn the truth that was long hidden from everyone who heard the story of the first season through Yakumo's words. Turns out, Yakumo lied. He lied about Sukeroku's and Miyokichi's deaths. It wasn't an accident. It was a cold blooded murder followed by an accident. Miyokichi stabbed Sukeroku, and the young Konatsu pushed her off the railing as her lover jumped to her aid and fell down too. Konatsu pushed this moment out of her mind, which is quite a common thing, especially for children, so only two people knew about this tragedy: Yakumo and Matsuda. Yakumo decided to live with the burden that Konatsu placed on him, as she blamed him for the death of her father. Technically, this was a good decision, but at the same time it led to this insufferable amount of pain that he never let go of, and that culminates during the events of this season. This most likely happens because of Yakumo's new stance on rakugo, that being him wanting for it to die with him. He simply doesn't see any future, so what's the point of looking forward to it? This led to his mind being occupied by the past, and with his slowly, but surely incoming time of death and his voice getting worse only strengthens that belief. It's a natural thing to look at your past, especially when you grow old and start not being able to do the things you normally would, so you naturally reminisce of the times when you could.\\n\r\nBut death approaches, with each episode Yakumo's health only gets worse. Despite some rays of light coming through the dark clouds, the Eight Generation is about to die. This is where the biggest change takes place.\\n\\n\r\nThe author decided to portray death and the afterlife in a supernatural way. Yakumo not only sees Sukeroku and Miyokichi appear before him, but one of them turns out to be the Shinigami himself (which ironically is one of the stories Yakumo performs best). He tempts him, he wants him to die, but thankfully he fails and Yakumo gets to die a natural death sitting next to his family, not a dramatic one that shinigami considers \"worth of an artist\". After that, there's an entire episode that takes place in the afterlife. Yakumo meets Sukeroku and later Miyokichi, as he gets to explore this mysterious place. Now let me tell you, this episode is by far one of the most impressive things I've seen in any animated thing ever. Author received full creative freedom that wasn't bound by any rules at this point, and it worked out incredibly well. It's such an interesting thing, seeing his imagination coming through in the fullest. The afterlife in Descending Stories is quite the mysterious setting. It starts off on a  bridge that leads to a small, town-like area filled with shops that try to steal the money you got on you before you reach the gate to either hell or heaven, which also need money to get into. While in that realm, the characters are able to do several things, like change appearance to look like themselves at any age or materialize the image of their beloved. Turns out things also go to the afterlife, as a theatre that burns down in one of the episodes appears and many other famous rakugo performers get on stage just like they did during their time on Earth. People who are close to the ones that died can also get inside to transport them through the river between the town area and the gates. And while this is one hundred percent the author's image of what the afterlife looks like, which could as well feel off-putting to such a grounded series, it works because it's intriguing and incredibly off-putting, yet directed, paced and drawn out very well. Despite being such a big revelation, it feels like a classic moment from a legendary book, you know, like the dreams in \"Crime and Punishment\" and other similar symbolic things that suddenly change the flow of a story and later become things that are talked about for centuries.\\n\\n\r\nNow, where this review really started to get complicated to plan out about is the cast, but that's not necessarily because of the characterization or utilization. This time around it's much larger. While in season one we had four or five characters that really mattered, here we have seven or eight total. That's a huge deal, especially when this season is much shorter than the first, and so I had to pose myself a question: \"why?\". Why would the importance of side characters raise and the scale of their influence stay pretty much the same? Fortunately the answer came pretty quick and sorted out a few of the things I perceived as issues.\\n\\n\r\nThe reason why the cast is so large is of course the theme of influencing normal people through rakugo, that's for certain. But why make them take an active part in Yakumo's life, why make those exact characters important and why paint them in such specific lights? The gang boss, for example, is painted as a very good person despite being a criminal that has to do what he has to do. He becomes really entranced by Yakumo's rakugo and feels the need to see more of it, which after the accident proved to be a bit difficult. Well, for him in particular, it seems like the show wanted to put even more emphasis on art affecting criminals? But Yotarou is already a reformed criminal, so there has to be another reason. Well, he becomes an instigator for Yakumo's short return and him visiting jail once again. Ah, so there you go! Because he is in fact wealthy and influential, he is able to bring him back by gathering other people who also need him. Mix that with Yotarou's emotional response and the moment where he let go of his past which his presence strengthens even more, and you've got yourself a character, that while not being specifically needed, is a very important part of the way this show's structured and planned out.\\n\\n\r\nAnd this is the case for most of the other side character. Put them onto themes and ideas this show has to offer and you can in fact see their importance. Mangetsu showcases a new style of rakugo, as he comes back to it thanks to Yotarou later on, which also shows how Yotarou impacted people to also perform rakugo. Amaken shows how even \"haters\" and critics have to acknowledge Yota's greatness. Thanks to Eisuke, we see that rakugo inspires other forms of art and that Yakumo's performances had such a huge impact that he still remembers them, besides other things that he does throughout the story. All of this is showcased through character behavior, with a natural flow and development that could only be achieved thanks to the time skips that this series does utilize and several camera shots that transcribe how you should be looking at them at that point in time. How many other series do you know that represent the entire world, all the themes, technology and interactions between the main cast and the setting through just that, and does it good at the top of it all?\\n\\n\r\nMaking such symbolic characters realistic and grounded was a thing that really impressed me in the first season, and thankfully despite the increase in numbers, the cast of the second season still feels real. They're just like real people, tangled in their own affairs, with their daily lives, dedications and interactions. You see the gang boss only a bunch of times, but you do know exactly what you need about him, how he runs his business, how he treats his underlings. You learn that he visits certain places in his free time and attends Yakumo's performances, keeps in touch with him and is respected by a lot of people, most likely he's in friendly terms with a bunch of his fans as he can contact them and trusts them enough not to sell him out. He deliberately lets the police take him without resistance, because he doesn't want the other participants get hurt or to ruin his reputation.\\n\r\nI'm specifically talking about him, because he's one of the characters that get the least screen time. Despite that, you get all the information you need to create a sound, logical profile of a character that's technically a minor one. This proves that Rakugo is still as refined as it always was, the writers know exactly how to use their time. Perhaps some elements were put together a bit awkwardly, the gang boss' role surely could have been more effective or maybe more memorable if his scenes were placed differently, but small things like this are not what make or break the show, they don't interrupt the flow, they don't interfere with the thematic structure or characterization, they're just preferences that are created because there are rules inside each of our minds on how to do certain things, which is funny because one of the themes for this season is that those sort of rules are just that - a part of our taste and the process of judging an art piece that we start taking for granted - and they shouldn't obstruct anyone's creative process. I especially like this because I also believe that art should never be bound by rules. Let's get a bit back on track though.\\n\\n\r\nYotarou and Yakumo do a good job at being the show's main characters as well. You may think that it's a given that they do their role correctly, that the themes that they were assigned with as representatives work with their characterization and develop alongside them, but it isn't really. It's something that has to be mastered by a writer, told through not only words but directing and visual cues, music and sound effects, and that's where this show always shined. Well...\\n\\n\r\nDon't get me wrong, they still shine like the bright stars on a dark sky, especially when you put them next to other anime that aired in the same season, but I had this feeling that they were a bit less inspiring this time around. The directing wasn't as expressive, probably because there were fewer rakugo performances (the ones that were fully animated were still amazing though), the lighting was off at times (faces being completely covered by a shadow just to be lit up a bit in the next show, with the characters being in the same position) which before felt like a more stylistic and consistent decision, while here it felt awkward due to the setting, there was some CGI involved which saddens me greatly, the music which I always thought was the best part of the series was utilized less and sometimes, when some of the tracks from the first season played, they seemed off when I thought how much of a time gap there is between the seasons. While still being great, absolutely fantastic in fact, to me Rakugo's directing, usage of music and art style always felt like a holy grail of sorts, and it was sad seeing even the slightest of slip ups.\\n\\n\r\nWeirdness doesn't necessarily have to be a bad feeling, but one would assume that putting it with Shouwa Genroku Rakugo Shinjuu in one sentence will result in a negative sentence, but that's not really the case. Descending Stories was certainly a weird continuation of a story, with many new ideas to tackle, many new roads and characters to explore, and yet it kept a lot of the elements from the first season intact, not breaking any of the previously established themes despite tempering with them a lot. Once again, this is pretty funny. If you have seen the show you'll know that this feeling of weirdness, trying out new things yet wanting to keep the old ones together is also one of the show's main plot points. It almost feels like the authors struggled on purpose, like the production team wanted to implement Yotarou's vision itself into the show's execution, while keeping Yakumo's previous storytelling techniques from the first season. Best thing about it? It works, and it works really well. There's no real problem that I can point towards, no hook to grab onto even if I wanted to say something negative. This series still remains to be an exhibit of everything that modern anime are able to do and things that could be done in the future to improve even further. This show is revolutionary in its own right. Honestly, it always felt like it was, but this season cemented it as such. The afterlife scenes are a perfect example of that, pure artistic expression of an idea so imaginatively difficult and hard to craft that even attempting it deserves praise, but this show doesn't stop there. It takes every good idea it has and turns into exactly what it wants. This sort of strength, this sort of ambition, this chase after perfection is why I personally love Shouwa Genroku Rakugo Shinjuu.\\n\\n\r\nArt at its finest ladies and gentlemen, take it in, soak it all up and get inspired by it, create your own works whatever they are and make them even if they were already made better before. I'm just going to leave this little message at the end, because that's what I felt upon finishing this wonderful series. I'll miss you Rakugo, you were amazing the whole way through.\\n\\n\r\nAs always, this is purely my opinion. I highly encourage you to develop your own.",
            "date": "2017-06-10T16:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 249656,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=249656"
        },
        {
            "content": "I don’t like Shouwa Genroku Rakugo Shinju. Main reason being is that the main characters’ stupidity is what caused the conflicts within the show. Right off the bat, the main focus of both arcs, Yakumo, is so fickle-minded. Come to think of it, he’s the indirect cause of Miyokichi and Sukeroku death. Now I don’t know if what he and Sukeroku had was just bromance or if he actually had feelings for him. Or if he just wants to focus on doing rakugo. But if he just manned up and dumped Miyokichi, then she could’ve just moved on with her life. But nope, he justhad to be wishy-washy about it.\\n\\n\r\nSecond is Sukeroku. His laziness in the second arc was annoyingly stupid. I don’t know if it’s just a pride that he didn’t want to take work aside rakugo. But for him to just let his daughter do all the work is nothing I can empathize with. Miyoki, I can somewhat understand considering the culture she was raised in. She was raised in the idea of being a perfect housewife. Honestly she didn’t know better.\\n\\n\r\nThird is Konatsu. I don’t know if she’s just being tsundere, based on how she keeps threatening to kill Yakumo. But she still lives in his house, despite him constantly insulting her parents in front of her. And the ending? It was heavily implied, from her being very secretive about the father of her child, to the way Shinosuke behaves exactly like Yakumo, to Konatsu saying that she and Yakumo were like lovers. Shinosuke was their son. What is this, Usagi Drop 2.0?\\n\\n\r\nOn a positive note, I did like some of the rakugo themselves, like Jugemu, Shinigami and Nozarashi. I got to learn the basics of its history and evolution. But that’s really it. Most of the characters in this show are insufferable.",
            "date": "2018-01-14T09:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 268542,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5744150.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/maattthhhh",
                "username": "maattthhhh"
            },
            "url": "https://myanimelist.net/reviews.php?id=268542"
        },
        {
            "content": "Lets not mince words here; Descending Stories is a masterpiece. \r\nI cannot think of any other anime that has possessed such a quiet yet devastating power to move me to tears with every episode. Most impressively, it doesn't resort to cheap manipulation to move you. The fact that I cared so much about each and every one of these well rounded characters is the reason I was moved so deeply as I shared the various moments of joy and sadness.\r\nAnd make no mistake, there is an overwhelming sadness and melancholy that pervades DS. Yakumo carries the memory of Sukeroku and his wife Miyokichi with himlike a ball and chain (the cause of this sadness is obvious to anyone who witnessed the tragic events of the first season). The overwhelming guilt and sadness he feels is so evident in his every word and movement. This depression overwhelms him, so much so that he cannot show the love and affection he feels for his adopted daughter Konatsu, or his doting apprentice Yotaro. Yet there are those rare moments when the characters truly connect and feel moments of shared joy, and these moments are amazingly powerful. \\n\\n\r\nThere are moments from Descending Stories that I know will stay with me forever. Its a monumental achievement in animated storytelling.",
            "date": "2017-04-19T19:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 245874,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283210.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jzathejenius",
                "username": "jzathejenius"
            },
            "url": "https://myanimelist.net/reviews.php?id=245874"
        },
        {
            "content": "With second season finished, Shouwa Genroku easily turns into one of the best anime i've ever seen, it'll be too long to describe all the emotions that this story made me feel (and i'm not a good writer to do so).\r\nThis tale takes us to Japan in different times of history, portraiting each one from the pont of view of this art called Rakugo, and how it struggles to survive, and does survive, because after all, something that good could never go away.\r\n The greatest aspect of this anime is simply, that every part of it works so fine with everything else. You can relateto the characters, you can think of their intentions, of their actions and their feelings, and never fully know them, because they feel human, they feel like this mass of feels and contradictions who we are. \\n\\n\r\nFinally i can just say, this anime is amazing, and you should watch it.\\n\\n",
            "date": "2017-03-25T10:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 243490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4536317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rasetz",
                "username": "rasetz"
            },
            "url": "https://myanimelist.net/reviews.php?id=243490"
        },
        {
            "content": "Rakugo is a series about Beautiful Storytelling, and it is perhaps unsurprising that it turns out to be a Beautiful Story too. The flashy fantasy tropes are absent: this is a grounded, plausible narrative with a grand scope. It spans a lengthy time period - from the 1930's to the present - and deals with the serious questions and responsibilities of life in an artful style.\r\nEvery episode mixes together the grand narrative with careful depictions of rakugo performance itself, with a few of the classic rakugo stories recurring throughout different episodes, told by different characters in their own style. If that sounds a bit dull,don't be too dissuaded: the story prepares you so well for each performance that you aren't likely to feel bored. It uses these scenes not just to show a performance, but to build up context and character investment, and when it's not working on its characters, it builds up the world instead, depicting the various time periods with ruthless attention to detail. By the time you're done you'll feel a strong sense of the cultural shifts taking place over the years.\\n\\n\r\nA way to view the two seasons, without spoiling any major details, is that S1 shows the tragic ending suggested by the title - a propelling of events to a sad, inevitable conclusion, and S2 shows a restoration: an \"ending after the ending\", continuing forward in time as the main characters grow old, face mortality, and eventually pass on, while a new generation comes up and challenges their elders(not in an overtly anti-authoritarian sense, but \"we can try something different\" - stark, duty-bound tradition giving way to new ideas). The two ends of this story meet in the late 1970's, and the timeline jumps around from that point, linking together common themes, stories, and characters in various surprising configurations. \\n\\n\r\nThere are many layers to the story, and yet there's always something to pick up on, so you hardly ever feel confused despite the complexity. It's visually interesting, and the audio breathes in a lot of atmosphere. It's very easy to recommend this series.",
            "date": "2017-04-22T02:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 246030,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=246030"
        },
        {
            "content": "Shouwa Genroku Rakugo Shinjuu is the first anime that I have been passionate enough about to write a review on MAL. I am no good at reviewing things but here it is:\r\nI thought that the first season was excellent, and that the second season is even better. The animation in SGRS is wonderful. That was the first thing I came to love about this show. Then the character development - man. It's spectacular. Most of the first season is a flashback but it's so smooth and enjoyable that I nearly forgot about what was going on in the present, which is where the second seasonpicks up. The background of the first season plays a critical role in understanding the second season, so don't miss it! I wouldn't pay any regard to reviews written by people who didn't watch the first season and still wrote a review about the show. \\n\r\nThe music is top notch and it makes beautiful/emotional moments shine even more. The second season is where I got feels almost every episode, and I even teared up when I watched the 11th episode. Shouwa Genroku Rakugo Shinjuu is the first anime I've watched that has caused me to do that. \\n\r\nI think that this is probably the most well-made show I've ever watched. Please watch it! I recommend it to anyone and everyone. It is outstanding in every aspect.",
            "date": "2017-04-03T18:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 244546,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/T-CRISIS",
                "username": "T-CRISIS"
            },
            "url": "https://myanimelist.net/reviews.php?id=244546"
        },
        {
            "content": "If the first season of Shouwa Genroku Rakugo Shinjuu was a 10/10 for most then this season could be considered a 9/10 because personally I do believe that it is less consistent with its episodes and starts off slow, as I found myself starting and stopping the series a few times. However I certainly found that it payed off in the end.\r\nSTORY: 8\r\nWhile in the first season we focus solely on the story of our main character Bon, this season implied that we were then going to witness Yotaro's perspective mainly. Which the anime did, but it also explored a lot of the supporting castand that set up for Yotaro and everyone else particularly gave way to a slow start. In the beginning all of these sort of 'parts' we get are fluid but also feel disjointed from one another and the viewer might get confused as to where the direction of Rakugo is even headed. However, starting midway the storyline becomes clearer and resolved, and the previous episodes' setup becomes a very much needed foundation to finish not only the story solidly but the character's developments. \\n\\n\r\nART: 10\\n\r\nBreathtaking as always. The animation's dedication to expressive body language is phenomenal and should be for it's subject. In this season particularly we get some more artistic moments as we explore the mental states of our cast. We continue our subdued color palette that is very suited for its overall mellowed out dramatic tone and doesn't distract the viewer. And the anime is very consistent in quality overall. \\n\\n\r\nSOUND: 10\\n\r\nRakugo has an amazing voice actor cast with a lot of talent! This only shines more this season as we get to hear from a wide variety of characters besides Bon, who was as stunning as he was in the previous season, which include Yotaro, Konatsu, and some new introductions! The flexibility of these voices also shines in how they  portray and interpret Rakugo, and their age fluctuations. Working well as usual to a beautiful soundtrack of traditional Rakugo sounds, and our usual background music. \\n\\n\r\nCHARACTER: 9 \\n\r\nIn the beginning, Rakugo presents itself with a lot of its characters' flaws and as we go around the cast the story falls into a stagnant period compared to it's previous season of linear progression per episode. However, as they progress and learn, think and talk, they begin to connect to eachother and grow together. I don't know how to exactly put words to this phenomenon but this season doesn't resolve each character individually, rather they all come to blend together and finish at the same ending point. As interconnected as the relationships are in Rakugo, it seems to be fitting that their personal issues are not only theirs but shared by everyone, and thus needed to be supported to be solved by everyone. If anything I think you should realize that each and every character has their own role of importance, even if subtle, that makes up the whole of this series.\\n\\n\r\nENJOYMENT: 10\\n\r\nI definitely struggled with it in the beginning and it took a few times for it to garner my full attention. But it set itself up well enough to really drive itself in the last 3-4 episodes. And above all else, I was thoroughly satisfied with how it chose to end itself.\\n\\n\r\nOVERALL: 9\\n\r\nFor the sake of being honest with how this compares to it's previous season, it definitely is considered a little less due to causing some confusion. Nonetheless if you come in with expectations of how it was directed last season, I can see how some might be disappointed. Sukeroku Futatabi-hen might contain the same elements as the first season but how it arranges them is vastly different, its presentation of the storyline is different, and how it utilizes the role of rakugo as a motivator is different.",
            "date": "2017-04-01T13:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 244277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5472998.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xisue",
                "username": "xisue"
            },
            "url": "https://myanimelist.net/reviews.php?id=244277"
        },
        {
            "content": "Long Story Short: Art and Story are fantastic. you should have this on your to-watch list. \r\nPlease watch season 1 first! You'll enjoy season 2 whether or not you watch the first season but its better if you do. \r\nThis anime is truly enjoyable in many ways. From the very beginning you want  Yotaro to succeed  and save Rakugo, but this story is way more than that. You get to the characters lives from different angles. What you'll truly appreciate is seeing characters that are actually human in the ways they deal with grief, love, regret, and the struggle to achieve their dreams.\\n\\n\r\nIf you are an anime novice this might not be something you're ready for.  The lengthy yet truly enjoyable Rakugo monologues allow you to see a part of Japanese history so rarely depicted in anime. It is also an emotional rollercoaster you'll leave each episode wondering about the next and thinking about all the details of the ones before. You'll laugh when Yota laughs and feel all the feels when Yakumo reminisces.  If you are looking for an enjoyable, engrossing and amazing anime Shouwa Genroku Rakugo Shinjuu is the anime for you. \\n",
            "date": "2017-03-27T01:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 243654,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RedBiscuit16",
                "username": "RedBiscuit16"
            },
            "url": "https://myanimelist.net/reviews.php?id=243654"
        }
    ],
    [
        {
            "content": "This show hands down one of the godtier series in the history of anime. When it comes to drama, Shouwa Genroku Rakugo Shinjuu as a whole is insanely topnotch / masterpiece. Not being biased here, I mean the show is just that good, flawless + with insane direction and editing by Studio Deen.\r\nStory 10/10 Simple and boring you might say but the narration of the series is topnotch, with thoughtful editing + with masterful direction, the show just climbed up the rankings easily, surpassing its 1st season. Overall flawless storyline. It is just that good and you might know the show had those insane plottwiston the 2nd half of the series :)\\n\\n\r\nArt 9/10 Nothing special when it comes to frame by frame animation but when it comes to cinematography the show just stands out. With good camera angles and with very realism type of editing, the show proved that animation is not only just the key to make a topnotch quality series.\\n\\n\r\nSound 10/10 Hell yes, from the shounen type of opening from both seasons to the one of the emotional endings i've seen. The 2nd Ending just hits you so hard with its mellow type of sound and then partnered with a very stimulating visuals that helps both art and sound to be one of the selling point of the series.\\n\\n\r\nCharacters 10/10 Oh boy, did just everybody got all their fokin character development? From Sukeroku to Yakumo upto Yotaro and Konatsu and even Shinnosuke. I mean every characters are well fleshed out with great interactions with the help of the great voice actors of the series. It is insanely overwhelming to watch.\\n\\n\r\nEnjoyment 10/10\\n\\n\r\nOverall 10/10\\n\\n\r\nOne of masterpieces of modern anime. Studio Deen is just so good at making this one. Surpassing the 1st season and even the Manga. Shouwa Genroku Rakugo Shinjuu is a flawless - godtier - topnotch - moving - stellar - \" m a s t e r p i e c e \" on drama genre. \"Never\" anything came closely to this series from all Anime of 2016 and Anime of Winter 2017\\n\\n",
            "date": "2017-03-24T05:44:00+00:00",
            "helpful_count": 139,
            "mal_id": 243351,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5819797.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/riorangel21",
                "username": "riorangel21"
            },
            "url": "https://myanimelist.net/reviews.php?id=243351"
        },
        {
            "content": "When something moves you to tears, it's daunting to explain why. How can I possibly put into words how much of an emotional impact a single piece of media had on me? All I can do is try and hope that you decide to give it a chance.\r\nPS When Yotaro performed \"Shibahama\" in episode 8 that shit got my ass crying real hard.\r\nThe best part of this show is the story. It’s complex without being confusing and is always interesting. I was never bored while watching. If you combine both seasons into one story, I think the structure of an introduction to the present, backstory,then jump back to present to continue the story and see how the events from the past have changed the present and continue to affect characters really made the show what it is. And then a beauty of this show is that the conclusion to this story is the conclusion to Yakumo’s story. Very satisfying and appropriate to how I think the show should’ve ended. The combination of all of these decisions that change the tone and flow of the story make it something to behold.\\n\\n\r\n(START SPOILERS)\\n\\n\r\nIt wasn’t perfect though. One of the main problems I had with this series was that the story focused too much on the past. I think that while this focus on the past demonstrated Yakumo’s inability to move on well, there comes a point where it becomes frustrating to watch the same decisions being made for the same reasons over and over. We all know that Sukeroku and Miyokichi’s death affected Yakumo’s life forever after, but sometimes his obsession over it in the most trivial of situations seemed unrealistic and just overemphasized. I very much liked the scenes of hallucination that put Yakumo in the hospital both times, and his journey in the afterlife and reuniting with the two, but the day-to-day trauma he’s experiencing 20+ years after their death seems just a bit overdone.\\n\\n\r\nI had a sort of crisis while watching the show due to the nature of episode 7’s reveal that the ending Yakumo told to us in the first season was a lie and that Konatsu was partly responsible for her parents’ deaths. I was shook when I found this out due to the profound effect the original ending had on me. I was more than a bit disappointed initially, but after much reflection on how this changes Yakumo’s character and his relationship to Kontasu, I decided that I also think this was a great plot twist that adds to the story. I still like the original better because it was more tragic, but I think that’s the point and I just fell for a story trap. Oh well.\\n\\n\r\n(END SPOILERS)\\n\\n\r\nAnother part of the first season I found to be refreshing and captivating was Yakumo and Miyokichi’s relationship. Usually in romance anime, relationships are either lovey-dovey or they’re both unbelievably awkward around each other. Rakugo makes their relationship compelling, mature, and quiet, yet ever-present. I loved the handling of this aspect of the show. This kind of continued with this season. The same dynamic was kept in place, but Yotaro was just a more loud character who wears his emotions on his sleeve, so it’s natural that it would be different, but I’d say of the 2, I prefer the former. \\n\\n\r\nThis also brings me to my only other main complaint of the show. In the first season, I just liked the characters more. Not necessarily how they’re written, I love the aspects of them all, but my views are best demonstrated in the Rakugo they perform. Sukeroku’s was informal, fast, yet strong and clear, while Yakumo’s is dignified, deliberate, and refined. To me, Yotaro’s personality and his Rakugo seemed loud, a bit goofy, and sometimes unpleasant to listen to. This was only rarely, but I sometimes would just wish he would stop talking. That being said, Kontasu is one of my favorite characters in the show and I thought old Yakumo is just as good as young Yakumo. Also, the story of Yotaro’s past interfering with his career was a good conflict of the show.\\n\\n\r\nRakugo is a show about art, so it’s only natural that its art direction be some of the best I’ve ever seen. Perfectly set the mood in every scene, managed to blend traditional traditions in a modern world in a clean, appealing way. My desktop background is even a screenshot I took from the show, that’s how impressed I was. On a similar note, I am continuously impressed with the OP and EDs in this show. They’re perfectly reflective of the show. I feel like the video itself for the OP in the second season reveals a lot about the plot, so if you’re trying to go in blind, consider skipping watching the OP.\\n\\n\r\nOverall, I can’t recommend this series enough. If you think you will like the show, I can guarantee that you will. I’m not here to tell you that this is a perfect show (it’s not), and I’m also not here to tell you that if you don’t enjoy it you have shit taste and there’s something wrong with you, but I can say this: In my opinion, Rakugo is the best series to come out in the last couple of years and it will be one of those “hidden classics” 5-10 years into the future, due to how under-the-radar it was, yet how profoundly excellent it is.\\n\\n\r\nThank you for reading my review! Feel free to leave any kind of feedback on my profile if you feel the need to, I appreciate everything.\\n",
            "date": "2017-03-24T00:43:00+00:00",
            "helpful_count": 66,
            "mal_id": 243336,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4167293.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/0207xander",
                "username": "0207xander"
            },
            "url": "https://myanimelist.net/reviews.php?id=243336"
        },
        {
            "content": "Nostalgia is a powerful thing. Happiness is essential, for when death comes, we want to look back fondly at our lives. It's only natural, really. It's only natural that we feel this way, and it's only natural that this is the conclusion to such a wonderful work of art. With that sentimental tangent, back on track, though expect that to be the tone of this review. Death, or rather, actually dying and no longer being able to experience anything for all of eternity is something that legitimately frightens me, and it has since childhood. Leaving a legacy that you won't see, possibly not even knowingwhat kind of legacy you leave or if you leave one at all. All of this has toiled in my mind for quite some time now, and this second season really sparked that back into my psyche, for better and for worse. Since, it's been a struggle to keep myself from getting horrified by the unknown of it all, since it was inevitable that this would be a recurring thought in my head. Then again, it might've started before then; I'm not sure. All I know is that I am glad to have been alive to see this masterpiece.\\n\\n\r\n*This review assumes that you have seen both seasons of Showa Genroku Rakugo Shinjuu. If that is not the case, leave, watch both seasons (or if you've seen season 1, continue on), and head right back. I will spoil both seasons for the bulk of this review*\\n\\n\r\nShowa Genroku Rakugo Shinjuu is an impeccable tale about two young men’s careers and how their ways of dealing with their passions for their beloved art form affected the lives of themselves and others. It serves as a prequel to the events of this season, and are filled with such foreshadowing through the symbolic Rakugo performances that their effects can still be felt in this second season, but I'll get there. \\n\\n\r\nThe sequel, Sukeroku Futatabi-hen, is a masterful tale of an apprentice surpassing his master while not only trying to not only carry the art in which he promised and now is challenged to protect, but also learning even more of just what happened before while his master comes to terms with everything, from his past to his legacy. Well, that's only at the start, since there are new things added in each episode that make each one vibrant, dramatic, and thrilling. The follow-up to the undisputed best anime of 2016, is every bit as rich as its predecessor and then some. With that said, let’s alter my usual segue, and jump right in, shall we?\\n\\n\r\nWe begin with this hilarious meta performance by Yotarou, aka the 3rd Generation Sukeroku, telling us that it has been a year since the last season and that he had been putting his head to his feet in anticipation of telling us the second season’s events since the beginning of the Spring 2016 anime season, which is gold. Not to mention how the directing encapsulates his disorientation from that whole wait. With this, we begin the series on a hilarious, upbeat, and creative note, which is fitting for this masterpiece.\\n\\n\r\nThe anime wastes no time in revealing the symbolism behind Yakumo frequently telling the story “Shinigami” in season 2, as we learn that Yakumo insists on haunt Rakugo die with him, saying this directly to Yotarou, effectively challenging him to fulfill the promise he made to him 10 years ago about keeping the art alive even after the master’s death, hence what I just alluded to literally 2 paragraphs ago.\\n\\n\r\nAfter a delightful and magnificent first episode, the second episode really delves into showing how the media is a bunch of snakes that will use Yotarou’s past against him, especially Amaken, the fucking prick. We get to see how certain upstart audience members will insult Yotarou and anyone who likes his work, sort of like an accidental allegory for an elitist punk that mocks us for liking a show we genuinely like. We get to see just how badly this affects him as he makes his first bombing performance, and everything really crumbles for him. At the same time, Eisuke (who met up with him in episode 1 and piqued his interest about Sukeroku) talks with Yakumo, wanting to know everything about the past of Rakugo, the masters, and, even Miyokichi for some reason.\\n\\n\r\nHer name comes up a lot, and it disturbs Yakumo and especially Konatsu, for we know what she did in season 1 and how Konatsu felt about her; her awful, love-deprived mother. Miyokichi’s negative impact is lasting, which is akin to how in real life, someone can leave a negative impact on so many people’s lives even after he/she is gone, to the point of using that person as negative comparison and contrast. Not only that but, as I said, the whole gang thing becomes notably relevant as well at around the same time.\\n\\n\r\nEach episode brings something crazy and new to the table, which is not what I expected. I mean, this show brings a lot of originality to the table, but I didn't expect it to start delving into some of the stuff it did with each new episode adding a new subject to the pile that relates to the characters’ personal lives. From the yakuza stuff, to Miyokichi, to a time skip where we get to see the new Shinnosuke that was born from Konatsu, to the lovely performance Konatsu gives to and with the kindergarteners, and even more amounts of great moments and revelations, this show never gets old. It's a treat to see just what amazing new thing will pop up, much like opening a bunch of presents on Christmas or your birthday.\\n\\n\r\nWhile, yes, the amount of time skips is potentially bothersome, even to me, the show never dwells at all on these time skips and it just wants us to have a reasonable gage on them, particularly with the second one, as they later spell out the first one. It's not like the time skipped was even necessary or something that would really flesh out the characters or develop either the characters or the plot. It would be nice to know more or if they resolved the gang issue from episodes 2 and 3 thoroughly, but they would merely be interfering with things if that were heavily included. Some people will complain about the lack of symbolism or foreshadowing behind the Rakugo performances this time around, but that's because the ones in season 1 were meant to do what season 1 was all about: foreshadowing, since it is effectively a prequel to the present day story, with season 2 being that story that is really about bringing everything from the past to light and to a close, which is why this doesn't bother me much.\\n\\n\r\nThe Inokori performance that was hyped up for episodes 3, 4, and 5, was entertaining like the rest of them, but ultimately, the crux of episode 6 was how the final moment of episode 5 jacked up his health, part of that moment involved him seeing a hallucination of Miyokichi before being part of a hallucination of Sukeroku shoving him down for unknown reasons in a room full of candles. This leads into the fact that he hasn't truly forgotten about either of the two, and it also leads into the big truth: Yakumo lied to us. Not only to us but to Konatsu and Yotarou. \\n\\n\r\nSpecifically, he lied about the circumstances of Moyokichi’s and Sukeroku’s deaths, or, as they are known by real name, Yurie and Shin. In reality, due to an emotional outburst, Yurie stabbed Shin and panicked, but the wound wasn't horrible. Konatsu came into the room and thought Bon (Yakumo) did it but Yurie told her that she was the one who did it, only for her to hit Yurie and push her out of the room in an emotional outburst which prompted Shin to reach out to save her only to die with her. Since then, he let it seem as if he did it in an act of permanent guilt, especially since her memories contorted around the fabricated idea that he was the one who did it. This moment was insane, not just due to it being a harsh and dramatic circumstance happening so fast, as life tends to do with moments like this, but mainly because it showed that part from season 1, from Yakumo’s story to be a lie, which was an interesting and epic thing to do.\\n\\n\r\nOne failed suicide attempt later, and Yakumo gets to see Yotarou perform one of his old colleague, Sukeroku’s most famous works, and after his daughter is so moved and the finally gets the chance to perform, the gang boss, Kido Isao is arrested and Yakumo gives a performance surprisingly relatable to him. Then, after being disappointed by Yota’s performance, he does Shinigami, only to see Sukeroku and nearly die in a fire; a truly harrowing and tense scene, in no small thanks to the directing. With the sheer impact of that flame, we eventually get more news: Konatsu is pregnant once again. After that, we learn even more of what Yakumo did for her, and after a nice performance by Yota and some unnecessarily adorable backup by Shinnosuke, it seems like Yakumo is finally dead.\\n\\n\r\nThe afterlife is very interesting there. It's a more vibrant and more poetic version than real life, and is a truly lively take on the afterlife, though nothing can beat the “Land of the Remembered” from Book of Life. It's a beautiful thing to see our trio reunite, and even more precious to not only see our two original leads perform Rakugo once again, but to do it with Konatsu and Shinnosuke by their side for a bit. Sure, this raises questions, but we, like Yakumo, can't really be allowed to truly understand this afterlife. It's also a shame that Matsuda died as well, but at least he sees his master off in a beautiful river in a breathtaking ending sequence that leads to a golden new frontier that is just...heavenly…\\n\\n\r\nThe finale is one of the most peaceful, loving, and nostalgic finales in existence. We get to see Shinnosuke and the new child Koyuki, and they're pretty nice, and do really take after their role-models, Yakumo and Yotarou respectively. It's nostalgic to see how everyone we are left with to care about has aged, and the Rakugo performances of Shinnosuke and Yotarou are really nice, with the added bonus of Yotarou going what Yakumo went through earlier in the season with seeing someone he cares about being the Shinigami. The final scene really sells the nostalgia everyone has at this point and made me both nostalgic and teary-eyed. \\n\\n\r\nYou never know what to expect with this show, and it's rare that we can say that in a positive manner. It's told impeccably, and it keeps things exciting with rest new twists and turns around every corner. Honestly, the finale was perfect, and the road leading up to it was beyond stellar.\\n\\n\r\nYotarou is the same as ever, even with the 10-year gap between the beginning of season one and the beginning of this season, but he has still grown in terms of a performer and a student. Still brash, outlandish, loud, goofy, and earnest, this loveable fool, and, just like with some of his audience members, he will always be Yotaro to me. Plus, he makes a great dad and a really good partner to Konatsu, like in episode 4 when he got her to perform in front of her son and his class, or when in episode 7, he still decided to shield her from the truth about the Sukeroku death incident despite it taking an emotional toll over him and the fact that he now knows the truth. He’s a real treat to get to listen to, even when he becomes old.\\n\\n\r\nBon, our old master from the beginning of the series and our interesting young lad from the entirety of season 1, is still as strict, stingy, and as much of an ass as before, but with more of a reluctant tendency to just let his two younger ones (Konatsu and Yotarou). After all, he’s gonna die soon, not them, they still have full lives to live. It's also interesting that he actually wanted Konatsu to kill him all this time like she said she would, but it not only disappointed that she hadn't but is not disappointed that the only reason she keeps him alive now is that her baby likes his rakugo. Worst of all, he doesn't enjoy doing it anymore, as it relates to his guilt of Sukeroku’s death, which we learn wasn't even his fault. He continues to lie about the situation to make himself as guilty to Konatsu as possible, since, as I stated in my season 1 review, he feels genuinely horrible about this whole thing, and all of this affected his art and his view on everything. Putting everything into perspective with the ultimate twist, which I have to commend this show for, since I hate the Unreliable Narrator, yet this show used that in order to allow us to have a thrilling prequel that sets up such context for the truth of it. \\n\\n\r\nKonatsu is as stubborn, angry, and hot-headed as ever, even after knowing the truth about everything and finally raising a kid. Even still, she is still very likable and a worthwhile partner for Yotarou. Still, there is a good reason, since she’s been that way pretty much all her life, starting from the moment she effectively killed her mother and contorted the memories of that event to Yotarou comforting her. It's pretty tragic, honestly, since she really hasn't grown out of that angry, overly emotional, and vengeful state, at least until motherhood in which she is still somber, but at least she mellows out in old age.\\n\\n\r\nEven other characters like Matsuda, Eisuke, Mangetsu, and Yotarou’s former boss, who play mostly minor roles here with one exception (all 4 of which also played minor roles previously, like Eisuke being that one man that was rejected by Yakumo near the end of season 1) remain or become really fun and likeable, and that's a treat in its own right. The only exception is the intentionally awful cunt known as Amaken, a total SOB who actively ruins Yotarou’s gig by rubbing his past in his face and acting like an asshole during Yotarou’s performance.\\n\\n\r\nOther more minor characters like Kido Isao and the geisha from season 1 are still rather good people, like, for example, the boss man (Kido) himself being charismatic and understanding, fascinated by rakugo, and not afraid to stand up for women, as shown when he throws Yotarou into rocky water for making Konatsu nervous for him due to his impudence, or remind us that he is still the boss and that he exerts massive authority. I also like Shinnosuke, the grandson of Sukeroku (who was also named Shin) for being such an adorable kid who happens to be a really nice boy, making me want him to grow up to be an amazing lad, as odd as it sounds given that he is merely an anime character. Turns out, both he and Koyuki were great as teenagers as well, and their dynamic is fun.\\n\\n\r\nHonestly, as cheesy as it is for me to feel this easy about characters in fiction, I really feel like I know the whole family of these guys as a friend who somehow got to see everything they went through that really contributed to this story. I don't think any anime has been able to do that for me, and I'm sure many of you feel the same way. It's damn impressive for an anime to be capable of doing such a thing, and I adore this anime for it.\\n\\n\r\nStudio DEEN is not known for having high-quality art. Rather it is known for the CGI Dragon, and the way it mishandled the Fate series. Even still, the art here is as impressive as ever, with great backgrounds and lively Rakugo performances to boot. Plus, if you thought the directing in season 1 was phenomenal, prepare to have your mind blown by the amazing moments of shot composition, lighting, and framing that shine amongst the best moments of season 1 and then some. Even with the occasional moments of bad CGI or the lack of notable fluidity overall, are unable to really bog down this series too much for its phenomenal directing and great art. Director Hidetoshi Namura did an excellent job with both seasons, and he deserves said credit as the animation director, and Studio DEEN deserves major credit for their work here.\\n\\n\r\nThe anime wastes no time showing us some new songs for the overall OST, which is admirable, as a sequel should always bring in some new music to mingle with the old. Each track is as lively as ever and there are even more great jazz compositions to spare. They are, once again, placed incredibly in the perfect scenes, such as the song for the final moment of episode 1.\\n\\n\r\nThe OP, “Imawa no Shinigami” by Megumi Hayashibara is both chilling and emotional, and with some of the best directing an OP can have, to the point that even the name carries meaning about one of the integral plot points of the show: Shinigami. Even outside of the masterful directing which is worth it's own video by someone who can break it down in perfect detail, it is still a wonderful song to listen to, starting off in a very chilling and somber tune with clocks ticking before Yakumo walks and then falls off a cliff, then it ramping up in an emotional flurry of him falling, to a slow emotional and chilling buildup from when he and Yotarou meet again and he purposely sinks back in and we see the death bell chime and a giant record-player stitching between different records of the different points of Miyokichi’s life, all the way to a true emotional payoff of everyone being there for him, including Sukeroku, who opens him up and brings the OP to a close, with the light already being out…\\n\\n\r\nThe ED, “Hikobayuru” by Kana Shibue is also a very nice and relaxing jazz piece that takes us on a magical journey. We get to see many amazing landscapes and environments within the whimsical ED, and it's honestly a treat. While it is certainly not as amazing as the OP, it is still nice to listen to, and it even beats the first season’s OP much in the same vein as with the OPs.\\n\\n\r\nNo matter what, Rakugo has never had an episode that didn't make me feel at least engaged and thoroughly entertained, with this season being no exception. The Rakugo performances, namely the ones played in full, are still quite a fun time, and I loved each episode. The scene in episode 1 with the duet of Yotarou and the geisha, the opening scene in episode 4 with Shin reciting Jugemu while walking, and the performance Konatsu gave with and in front of both Shin and the rest of the kindergarteners in episode 4, are some of the most endearing moments I've ever seen in an anime, with the latter moment also being one of the most heartwarming, thanks in no small part to the brilliant directing that really played up all of the emotions we were meant to be feeling. The stellar directing wowed me constantly, and the drama felt earned and properly done. I rarely found anything that even remotely made me not have a big grin on my face, which is a rarity, even among my favorites.\\n\\n\r\nI know that I’ve basically been gushing this whole time and have provided only the most minor of criticisms, but it’s because it was so damn good that I hardly found much wrong with it. Besides, the finale and penultimate episodes were just magical and full of wonder and nostalgia. I can't believe I have to get nostalgic as a teenager of all things, but hey, this anime is that powerful. Imagine when I watch this as an older man; suddenly I will cry my eyes out at the relatability. But that's a long, long time away from now. With that, onward to the conclusion of our journey, as we celebrate this final, glamorous performance.\\n\\n\r\nIt seems almost ludicrous that this anime would be my first 10. It's crazy to think that this will only get better as I get older. This anime is a wonderful and poignant masterpiece and a lovely conclusion to one of the best anime of the new century. Art is the perfect way to describe this show, as it really explores and encapsulates both the effects and emotions of art. Nonetheless, it has come to a glorious end, and like the characters at the end of the series, we can look back fondly at all that happened here. Honestly, it's a pity that I've basically run out of things to say and that there are people who can and will do this show more justice than I ever could, for this wonderful work of art deserves more attention than it has gotten, and all of the praise it can get. Well, with that said, I bid you adieu.",
            "date": "2017-03-24T16:51:00+00:00",
            "helpful_count": 59,
            "mal_id": 243419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5322238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/CodeBlazeFate",
                "username": "CodeBlazeFate"
            },
            "url": "https://myanimelist.net/reviews.php?id=243419"
        },
        {
            "content": "Coming off the highly acclaimed and one of the best anime of 2016, Shouwa Genroku Rakugo Shinjuu, comes it's second season and it's... I don't really know to describe how good this is, but that's just how good it is..If that makes sense. It's light, It's beautiful, It's haunting, It's deep, It's dramatic. It's one of the most masterfully made anime there is. \r\nOne of the things this show does so well is that it presents itself in the form a Rakugo. It's leisurely paced but the genuine and detailed storytelling and flawless performances combined with just the necessary amount of soundtrack certainly makes itseem so. This anime is not just a love letter to the art form and it's celebrated history but also serves as a medium to revitalize the art form for it's future and introduce it to new audiences from different places and cultures. I read an article about this show, the writer brings up something about western audiences asking a Rakugoka to perform classics from this anime. It's goes to show no matter how unpopular this is in the mainstream, it has made quite a significant Impact.\\n\\n\r\nAnother thing this anime does very well is that it brings out the cinematic elements of an anime that one would normally take for granted, such as Screenplay, Dialogue, Cinematography, Editing, Performances, Direction and makes it stand out incredibly well. The screenplay and dialogue especially are unbeatable, whoever wrote these scripts deserves a fucking award. The Rakugo scenes are the part of the anime that really highlight these things. Giving us that theatrical experience and helping the audience understand the story being told. \\n\\n\r\nThe characters in the show are fantastic, they're brilliantly written and almost everyone plays a very important role in the storytelling. The anime mainly shows 3 different generation of characters. So yeah, there are a lot of different range of characters. It's interesting to see how they view Rakugo and the different approaches that they take. Yakumo for example wants to take Rakugo with him to the grave, Yotarou wants to continue Yakumo's legacy and continue the art of Rakugo, You would think Yakumo is wrong but he has some pretty valid points that made me go like, \"yeah bro, you know what? just take it with you\". Yakumo is my favorite character, He is probably  the MVP of the year honestly, It's very interesting how the flashback events of season 1 and the progression of time play a part in his character development. The relationships these characters have are very well written and how it all dramatically plays into effect is such a joy to watch. The character design is great too, it's very unique and appealing and there is a lot of detail in their actions that really tells who they are and gives them a real identity. I love it.\\n\\n\r\nComing to the animation and soundtrack, The animation is just amazing and consistent from start to finish. Hats off to the animators and also the production studio, studio Deen, they are restating themselves with this show. I haven't seen them do anything this good honestly, Great use of colors and like I mentioned before, there is a lot of detail and effort put into the characters and setting that I truly appreciate. \\n\\n\r\nThe soundtrack is refreshing. Very dramatic, theatrical and sometimes very unpredictable, A lot of times it's just traditional Japanese sounds. It's minimal and used only when necessary. It plays very well into the quiet atmosphere and genuine storytelling of this anime, making it seem like a Rakugo itself. \\n\\n\r\nOverall I really enjoyed this anime, it truly is one of the few shows that are near perfect in the way that it is executed and presented to you, There isn't any major flaw or anything, even things like leisurely pacing and the fact that some people might find that boring is something the anime embraces itself. It is true that this anime is not for everyone, People who usually are into the more energetic and fast paced genres might not enjoy this but I would still recommend it to you, cause this anime really is just THAT GOOD, If you're someone who is into the craft and enjoys some great storytelling, there is a really good chance you will be blown away and enjoy it as much as I did. \\n\\n\r\nI would give this anime a 9.5-10/10. I am extremely satisfied with what I got, Definitely a contender for Anime of the year and easily the anime of the current winter 2017 season. Highly recommend everyone to check this out!",
            "date": "2017-03-24T11:37:00+00:00",
            "helpful_count": 35,
            "mal_id": 243384,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007521.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/tigermaskshinobi",
                "username": "tigermaskshinobi"
            },
            "url": "https://myanimelist.net/reviews.php?id=243384"
        },
        {
            "content": "The second season of Shouwa Genroku Rakugo Shinjuu cemented the series as an undeniable masterpiece for me is what I wish I would be saying right now. However the second season lost a lot of the aspects that made the first season of Rakugo great for me.\r\nIf you were to ask me what the first season was, I'd say that it was a story about the industry of rakugo and the life of two men that grew up together and were raised to work in that trade. If you were to ask me what the second season is, I'd say that it is about thestate of where the industry could be going, and concluding Yakumo's character arc. The way the series tries to present the state of rakugo and where it moves going forward is through Yotaro, a new character of whose sole purpose is to constantly reiterate that Rakugo is to be preserved, and Yakumo's reluctance for rakugo to be changed and not die with him. The problem here is that Yotaro gets focus only for the first few episodes, where he has to get inspiration and get over his bad reputation dug up by the media and convince his wife that he is a good father for her son and a good man for her. This gets resolved in about 2 episodes and afterwards all the focus on Yakumo. After these events, in all becomes about Yakumo and his deteriorating health. At this point is when this season of Rakugo simply becomes \"oh guys we love rakugo so much how can we improve rakugo is yakumo alright is rakugo alright\".  Every episode pretty much relies on delivering a Rakugo piece and knocking Yakumo down and then bringing him back down only to knock him down again and it repeats this cycle until this season reaches its end. \\n\\n\r\nIt is about 5-6 episodes of stagnation with the characters merely being in a cyclical state until the season reaches its end and things can happen in a way that feels final rather than repetitive. Two of the episodes don't really have any effect on the overarching plot but bring more flesh into the universe, two are about Yotaro as I have had said and the last two conclude the series. So we have about 2 episodes about the new generation of rakugo performers, about 6 episodes simply stagnating the story with events of the same nature told in a slightly different way, 2 episodes that while I actually considerably enjoyed far more than the other episodes because the details they brought in universe and the Rakugo in them, but I still consider them filler since they don't impact the plot moving forward, and the last 2 episodes that are wrapping things up. Frankly, to me it felt like it had no idea what it set out to do, other than present us with more rakugo, while not advancing the plot because the story planned itself to end with a certain event. It dragged on a couple of times, and for the most part it felt like a pointless continuation, due to the fact that it feels like it keeps bringing up more of the same. The mere existence of Yakumo as an unresolved character that got a lot of focus, even when his character would get fixed to be deteriorated again, brought no value to the story and by the time it ended, because I simply couldn't care less anymore. The episodes where he wasn't a much of a focus point in this season were my favorites, simply due to the fact that I didn't know what I would get and I had no expectations.\\n\\n\r\nQuite frankly, due to Yakumo's existence and Sukeroku's legacy, the characters hardly got anything besides blood ties and admiration to define them in universe for the most part. None of them really have real impact on the events but they are either related to Yakumo or enjoy Yakumo, which I guess the series thinks is reason enough to keep them around and relevant. I do find Yotaro acceptable as he is a reformed criminal who wants to have a positive outlook on life. But there are characters such as a writer that simply chooses to stick around because he wants to write new rakugo stories and he likes rakugo. That's his motivation and personality. He is constantly around and he at best brings exposition, at the worst he just makes his presence felt. What is the point of having a character who is like \"Rakugo is such a beautiful thing. It should be preserved and kept alive.\" who brings no real contribution to the events of the story? His personality is rakugo. His impact on the events is artificial and he feels like he is a device to present that things should progress.\\n\\n\r\nYou need to understand that I can't really contain my dissapointment when I complimented its first season for its really strong of storytelling, where it presented all the essential details and developed on its characters in a smart way, presented flaws and difficulites they went through, as well as their strengths. The events mattered because they were shaping Yakumo into the person he became, because of the certain point he got in life, but the events this time around don't really sway impact because this season is simply preparing Yakumo for the end, with every event in the story being like flowers on a gravestone. None of the events in the story seemed like they had any impact on the universe and there were no real difficulties the characters tackled, outside of Yotaro and Yakumo, who kept struggling repeatedly with the same things which made things repetitive. I couldn't care about the characters and the story was all in all a mess. There were still things I enjoyed like the rakugo stories told in these season were really entertaining, for the most part. I especially enjoyed the one told by Konatsu, Sukeroku's daughter, in front of her kid's classroom. But this second season was not at the same quality of the first season, as it seemed to have no direction for its entirety, thing that I would stayed felt the opposite way the last time around.\\n\\n\r\nTo conclude, the second season of Shouwa Genroku Rakugo Shinjuu took too much time to reach its conclusion and presented a lot of details that I couldn't find relevant to the overarching plot, and therefore lost my interest, due to too much foreshadowing and stating the direction it wanted to go to outright through a character of whose role was exactly that. While in the first season, I knew exactly where I was going and what to expect and I enjoyed it, in this season I disliked it, because the execution isn't as strong, because the events aren't as impactful due to them being repetitive by nature of not having lasting consequences on its characters or skipping directly to the desired result, the characters therefore don't feel as human due to that fact, as well as them not having any real difficulties in their lives to truly display any of their flaws or strengths, making a lot of them simply present, but irrelevant. There are rakugo pieces, but those mostly come to your discretion, as different stories impact people in different ways. I enjoyed most of them, but I can't and won't speak for everyone. If you're curious about how this season went on and I kind of turned you off, I will also note that this season doesn't really take away from the experience of the first season, unless you were really emotionally attached to the series. The first season still remains at the same level as it was, and I don't find it was a waste of time to find out how things in the universe of Rakugo have had concluded. But note, that it isn't gonna be what it used to be. It will just remember what it was.",
            "date": "2017-03-25T08:38:00+00:00",
            "helpful_count": 32,
            "mal_id": 243476,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047626.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ItIsIDio",
                "username": "ItIsIDio"
            },
            "url": "https://myanimelist.net/reviews.php?id=243476"
        },
        {
            "content": "Not only is this show not up to par in comparison to it's predecessor, but simply wouldn't be worth your time or consideration without it's lineage. \r\nThe first season clearly demonstrated how every character is shaped into who they became by preceding events, and almost every element introduced has a crucial role in the plot; in contrast, the majority of this season's plot elements are introduced, then simply go nowhere. \r\nTake as an example, the desire to keep Rakugo traditional, versus the need to keep Rakugo alive through innovation. The first season heavily foreshadowed that this would be the main struggle of S2, and thefirst episode of S2 seemingly confirms this by introducing a character whose main goals are to write new Rakugo stories, and get Yotaro to tell these new stories. Of course Yakumo is opposed to this, and it seems that this push & pull between innovation & tradition may determine the fate of Rakugo's future.\\n\\n\r\nBut it doesn't. At no point does the plotline of new Rakugo stories actually go anywhere, besides the writer occasionally reminding the cast & audience that he's ostensibly here to push said conflict, but it also seems that writing new stories is completely unimportant to the survival of Rakugo.\\n\\n\r\nThis is far from the only violation in this manner. A mob boss is introduced, who has very little impact on the plot. Yotaro has a friend who appears multiple times throughout the show, only to have little to no impact on the plot. A shocking twist is revealed in Episode 7, which ends up having no impact on the plot whatsoever. \\n\\n\r\nUltimately the only plot lines that get resolved are 1. Does Rakugo survive and 2. How does Yakumo deal with his grief? These could have been good enough, but both elements are suddenly resolved in episodes 11 & 12, with the latter being resolved in one of the cheesiest manners possible. The majority of the season is just Yakumo almost dying, expressing regret at his past, and not really moving anywhere. Rinse, Wash, Repeat.\\n\\n\r\nYou can't just linger on what was good about last season for 12 more episodes and expect the product to be good. Not only are many of the Rakugo stories told this season just retellings of stories we heard in the first season, not only are the same conflicts carried over, but a decent chunk of one of the episodes is literally just playing footage of a Rakugo story from season 1.\\n\\n\r\nIn the OP, when Sukeroku lifts Yakumo's jacket, revealing nothing but bones inside, it clearly says that Yakumo is empty inside. Unfortunately, after having finished the show, I'd say it was a rather apt metaphor for the whole of season 2 as well.",
            "date": "2017-04-16T17:22:00+00:00",
            "helpful_count": 17,
            "mal_id": 245666,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5529175.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/SuperSecretOtaku",
                "username": "SuperSecretOtaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=245666"
        },
        {
            "content": "I am going to take a risky side with this review: Shouwa Genroku Rakugo Shinjuu: Sukeroku Futabi-hen was disappointing. The atmosphere and the seriousness vibe was completely shakened by the new main character, which I thought was actually for the worse.\r\nStory 6/10 Compared to its 1st season, this series is just weak. You can't say comparing the two is invalid, this season very very much relies on the 1st season. My main issue comes from the weaker characters, who are actually not THAT weak. It's only when I remeber the first season is it when I just realize how hollow the 2nd season characters are.Many more characters show up, and their significance is shallow compared to the first season, making it feel bland.\\n\\n\r\nArt and Sound are both okay. Everything is mellow and sets up the atmosphere well, except when you have a loud af main character. I am far more interested in everyone else, especially Yakumo. \\n\\n\r\nCharacters 5/10 Did the anime feel good at the end, yeah the ending was fufilling. But I just thought that was too much said and not implied. I was the masterful technique that is subtly slowly dwindling as the series progressed, and this was very disappointing. Yakumo especially, even though he was great the first season. There was a serious lack of focus on specific characters, and this was much much needed because that is the core strength of this show. Why the hell do I have to care about shark tooth man or Sukeroku's former boss? The only reason why I am giving this a 5 as opposed to a lower score is that the twist towards the middle-end of the show was truly noteworthy and eye opening. \\n\\n\r\nEnjoyment 5/10- mostly disappointment\\n\\n\r\nOverall 10/10\\n\\n\r\nThe first season is god tier, but you can skip this series. There is sitll some value but do not expect the same show and the same depth.\\n",
            "date": "2018-02-22T10:20:00+00:00",
            "helpful_count": 8,
            "mal_id": 272177,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CrimsonNavy",
                "username": "CrimsonNavy"
            },
            "url": "https://myanimelist.net/reviews.php?id=272177"
        },
        {
            "content": "The first season of Shouwa Genroku Rakugo Shinjuu was personally my favorite anime of 2016. It was such a breath of fresh air for the slice-of-life genre with its traditional period drama setting that inevitably clashes with the modernization of society. Who would have thought that something like rakugo can hold such power when it comes to crafting mesmerizing narratives? Personally, I would’ve found it boring when I get to see a performance live. However, the show executes this art of storytelling so well that it never fails to catch my attention. The way it shows the perspective of the audience and the storyteller indiverse angles and its sudden frame changes is brilliantly done as it serves as a visual treat with its gestures in which it further enhances the rakugo experience. All of this carries into the second season, though the direction of the story starts to head towards a definitive conclusion.\\n\\n\r\nWhile the previous season deals with Yakumo’s past and how rakugo forever changed his life, the second season deals with him getting a closure from it. From the first season’s finale, we get a general idea of what to look forward to. Rakugo is in a state of decline just like his health, and he plans to take it along to his death. His haunting past that hinders him from really pushing rakugo to new heights. Unless he has comes to terms with what is troubling him, he can never really move forward and say that he has lived a satisfying life. However, there is an underlying resistance that says rakugo must live on particularly embodied by his apprentice Yotaro. Maybe there is a faint voice within Yakumo that supports this idea that he has grown to love rakugo enough to not let go of it and place his hopes unto the future generations. The second season explores on that, if rakugo will thrive into a new era dominated by technology. \\n\\n\r\nThe show attempts to preserve the art as something timeless, yet it also shows how it struggles being squeezed into the mainstream entertainment. Radio and television shows determine its popularity and Yotaro’s quirky and lively performance manages to put it in a state of relevance. But why is this important? Rakugo is often associated with descriptions like old and ancient, it will eventually die if only people stuck in the past are the only ones that care about it. There is a call to innovate the craft, but it cannot happen conveniently and instantaneously. Most stories told through rakugo are centuries old, occasionally altered to fit in within the era but it has been increasingly evident that mere alterations are not enough for it to convey a memorable and impactful story. Some stories can be alienating to a new audience, so there is a need to create new stories for the future.\\n\\n\r\nWith regards to a few minor complaints I have with the show, I feel like Yotaro hasn’t been fully fleshed out as a character. The story tries to represent him as the resurrection of Sukeroku and the fire that keeps rakugo alive, but we never really know him outside of rakugo aside from being a former yakuza member that served time in jail. What made him emotionally connect with Yakumo’s prison performance? Does he have any profound past experience that drives him to become a better person through rakugo? We’ve seen Yakumo’s past in the previous season do that, and it’s a shame Yotaro didn’t get the same treatment. Also, the ending is quite rushed. I’m happy that it does get the conclusion it deserves but it felt like it dropped out of nowhere and now everything is going to be fine. The previous episodes have been building up the conflict of the story but it’s kind of disappointing that it gets resolved in one swift move. I would talk more about it but I’ll leave it up to the viewer to have a personal interpretation of the ending.\\n\\n\r\nWhile I didn’t find myself more emotionally invested in comparison to the previous season, I still think it’s a great sequel. Animation-wise, it’s inferior as really bad animation frames pop up from time to time and the dialogue occasionally goes out of sync during rakugo performances. However the overall feel of the show complements with the previous season, as it tries to convey a message that there is still hope for something that is dying. Just like the current situation of the anime industry, it’s hard for something that has the heart to tell a memorable and refreshing story to survive amidst the oversaturation of mediocre shows. It gets axed if it doesn’t sell well regardless of its potential. Nothing is really certain and permanent. But still, we fans of the medium still cling to hope and get rewarded by gems like this show.  I really wish we get more kinds of stories as well-made as this in the future, but one can only dream. \\n",
            "date": "2017-03-31T23:49:00+00:00",
            "helpful_count": 11,
            "mal_id": 244207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/798635.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BlueKite",
                "username": "BlueKite"
            },
            "url": "https://myanimelist.net/reviews.php?id=244207"
        },
        {
            "content": "Holy shit this anime is a fucking masterpiece. I'm not trying to be a hypebeast right now when I say that this anime is truly superb. The characters are treated extremely well and given ample space and time to grow and develop, the plot it interesting and plays out effectively, and the storytelling combined with the soundtrack combine to suck you in episode after episode to care about performances of an esoteric art that most watchers won't know about at the beginning but will love by the end. Goddamn. I came into this show with high expectations after the first season (which I gave a9) and was still somehow completely blown away. Only issue I can really see is that the art wasn't as adventurous as it possibly could have been and the pacing sort of dragged in the middle of the season but by the end of the season each new episode had me giddy with excitement like a little kid waking up on Saturday to watch cartoons and eat sugary cereal. This show I believe characterizes the best of the slice of life and drama and is a wonderful ride for those patient enough to take it.",
            "date": "2017-03-24T14:47:00+00:00",
            "helpful_count": 10,
            "mal_id": 243406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cerdaco",
                "username": "cerdaco"
            },
            "url": "https://myanimelist.net/reviews.php?id=243406"
        },
        {
            "content": "The first season of Shouwa Genroku Rakugo Shinjuu was the absolute best anime of Winter, 2016, and very possibly the best anime of that entire year. It was certainly the most moving, truly adult, drama I've seen in a long time. Appropriately enough, since rakugo is the art of storytelling, the first season took the form of a story within a story, telling an incredibly moving tale of a complicated friendship, tragic choices, and the repercussions of those actions for people living in the present day. It was haunting, memorable, and it's been a very, very long year waiting for the sequel.\r\nThe second season startswith a recap told in the form of a rakugo tale--this was an absolutely perfect, and perfectly logical, choice. You're immediately transported back into the space of the rakugo theater, and anticipating the next chapter of the big story ahead. This time, we're completely in the present day (or at least as much as is possible, as history and memory always informs the present for the characters in this drama), and instead of learning about rakugo's past, we get to see how it's faring in contemporary Japan. We also learn how, or whether, the main characters can move forward with their own lives. \\n\\n\r\nThe real joy of this show is to see how Yakumo (the perpetually stubborn, dissatisfied, depressed, and yet extraordinarily charismatic rakugo master), Konatsu (now a mother, and thankfully just as stubborn, prickly, passionate, and intelligent as always), and Yotarou (a newly-minted rakugo star, always playing the fool but clearly much smarter than he likes to appear) interact. There's absolutely no reason in the world for these three to be connected. From decades-long resentments to daily irritations, the only way to explain it is that they're a (very unconventional) family, and sometimes you don't get to choose those deep connections that bind you far more powerfully than you may ever realize. \\n\\n\r\nIn a very real way this is a terribly moving romance, one that ties three disparate personalities together in their love of rakugo and their fundamental love for one another. Yotarou’s centrality in this dynamic becomes a major theme over time, but the magic is in observing the intricate dance of recrimination, guilt, and reconciliation that defines Yakumo and Konatsu’s roles in this drama. If you aren’t reduced to tears when watching the final scenes of episode ten, then you’re far stronger than I am. It’s one of the most powerful and genuine moments in any creative form that I have ever experienced. \\n\\n\r\nThis show is written and directed exquisitely, giving time for characters to develop slowly, allowing conversations to unfold naturally, and always making room for silent spaces that are more overwhelming than traditional dramatic crescendos in almost all other series. One of the most beautiful and memorable moments is a very small scene in which Konatsu’s infant son interrupts Yakumo while he’s playing the shamisen, and in that encounter we learn much more about who Yakumo really is than most shows convey about a character in an entire episode of “big” revelations. Gestures, glances, and the smallest alteration of an expression are powerful in this drama, and the animation takes full advantage of the ways in which visual elements can encompass nuances that words cannot. As the episodes progress, keep close watch upon how Yakumo is drawn. The level of care given to his face and body is eloquent. The animators tell stories in every line.\\n\\n\r\nThe second season of Shouwa Genroku Rakugo Shinjuu may just be better than the first. After living with this story and its protagonists for a while, it's easy to appreciate the nuances of personality and dialogue that imbue almost every scene of this show with subtle emotional resonance. After the enormous revelations and emotional impact of season one, even small developments now take on new dimensions. Plus, this season is about the future. It's exciting to see what happens next. After falling in love with this story and its characters, I never wanted it to just remain in the past. I'm glad that we can look forward as well, even with the full awareness that progression through time, while it carries hope, also entails self-doubt, continued pain over past losses, and uncertainty as to whether what’s to come will necessarily result in happiness. \\n\\n\r\nThis show is a masterpiece of storytelling, as it should be. It knows that life doesn't often proceed by giant dramas and great occurrences. Life is the incremental accumulation of moments, and these sedimentary layers, overlapping across lived time, comprise each of our pasts. As every new memory, experience, or choice is added to that slowly forming bedrock, the character of the whole is forever changed. While we are a product of our past, the present continually shapes us into something new. It's captivating to see these layers form in Shouwa Genroku Rakugo Shinjuu, and it's joyful to see how life is always surprising, intoxicating, and forever a source of beautiful, shimmering stories.",
            "date": "2017-03-24T15:24:00+00:00",
            "helpful_count": 9,
            "mal_id": 243410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5016597.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/delta5",
                "username": "delta5"
            },
            "url": "https://myanimelist.net/reviews.php?id=243410"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nIt’s not every day that we get to witness history in the making.\r\nTake the first season of Shouwa Genroku Rakugo Shinjuu. As critics such as myself agree on, it is nothing short of phenomenal. The drama, the maturity, the writing, the execution. That first season redefined what anime as a medium is capable of. Greatness incarnate.\r\nSo, understandably, the sequel here, Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen, not only has the difficult job of concluding this tale but also maintaining that same level of excellence. The big question, then, is: did Rakugo Season 2 make history?\r\nSufficeit to say, it did.\\n\\n\r\nSTORY\\n\\n\r\nTaking place ten years after Bon’s personal recount on the origins of his life and the art of rakugo that guided him, Rakugo Season 2 instead looks to tell the tale on the ending of his life and where rakugo ultimately goes from here. With this mirrored approach, the series finds itself right where it wants to be: within a narrative rife with strength.\\n\\n\r\nNearly (if not every) episode has at least one downright major moment that grips the audience with its care and its purpose. In episode three, Yotaro berates the gangster boss as a declaration of his love for Konatsu and Shin. In episode five, Bon collapses on stage after witnessing Miyokichi in the surrounding smoke during his performance of “Hangon-ko” which in turn leads to Sukeroku finally (and briefly) speaking to him for the first time in his fever dream.\\n\\n\r\nBut no doubt two of the most incredible moments occur in episode seven and episode twelve. Episode seven features the amazing plot twist predicated by the entire first season and Bon’s perfect storytelling. Therein, the audience learns that he lied about the night of Miyokichi and Sukeroku’s deaths, forcing everyone to reevaluate this man and his character. Episode twelve does something similar. It drops the bombshell that possibly, maybe Shin is the biological son of Bon himself, wracking the audience with one last morsel to interpret.\\n\\n\r\nThese awesome moments occur again and again and again throughout the entire season. But Rakugo Season 2doesn’t just stick with series-defining scenes, though. True to form, it also focuses on the smaller details that make up the wonderful nuance in the presentation.\\n\\n\r\nFor example, the anime opens with a meta rakugo performance by Yotaro. With no other patrons in sight, he directly addresses the audience, recapping them on the events thus far. He goes so far as to joke how the one-year stretch between both seasons has had him bowed for so long that he can “hardly tell his head from his feet anymore” (with rotated perspectives for good measure).\\n\\n\r\nOr how in episode eleven the anime foregoes showcasing anything related to Bon’s real-world death (e.g., a funeral, the reaction of his loved ones). Instead, it focuses purely on his final, spiritual journey before he officially passes on. Sukeroku, even in the afterlife, asking to borrow money from Bon solidifies the show’s deliberate care.\\n\\n\r\nA new atmosphere also blankets across the ensuing plot. The feelings of subtle sadness and complete loneliness pop up time and again as Bon endures the outcomes of his decisions from many years ago. However, a twinge of hope persists. An optimism that the larger cast, the uplifting events, and the greater focus on Yotaro (especially in the first half) curate to a noticeable extent. This newfound mood aligns with the parallel structure of this season in conjunction with the previous one, once again marking the anime’s layered construction.\\n\\n\r\nNot to mention that the rakugo performances themselves return and roar with a vengeance. Just as with the first season, rakugo represents more than just an entertaining few minutes for the audience to get lost in right alongside those who paid to see the performers. Rather, the unique storytelling contributes to not only the events but also the characters involved.\\n\\n\r\nFor instance, Bon recites his signature “Shinigami” in episode nine which literally summons a demon who nearly kills him before his destined time. Or how, in episode six, Yotaro performs “Inokori”, an act that captures the very essence of his rakugo.\\n\\n\r\nSimultaneously, rakugo develops throughout the season. It becomes more progressive when Konatsu, a female in a male-dominated field, performs a wonderful rendition of “Jugemu” in episode four and, at the series’ end, becomes a regular performer herself. Eisuke writes new stories for Yotaro and the others as a way to start the next set of storied works. Its popularity dips and rises as the events and the characters play out.\\n\\n\r\nRakugo’s development hones in on one of the anime’s most important themes: time. Time is an ever-flowing stream that pushes everything forward whether willed or not. It can change ideas like rakugo itself. It can also change people like Miyokichi who tells Bon not to worry about his mistreatment of her in a “time heals all wounds” approach. For some entities, though, time has no influence. Yotaro remains Yotaro (both in the show and in this review) despite his couple of new names, and time cannot affect something like the past because, in the end, what’s done is done.\\n\\n\r\nThe multiple time skips then take on an even more integral role. For not only do they affect the progression of the plot but also they tie back in a meta sense to this very theme. The structure of this entire series wraps itself in time, too. Where the first season took place almost exclusively in the past, Rakugo Season 2 channels the present while heeding the future. Moreover, this season explores time as a concept such as when Yotaro speaks with the rakugo-theater proprietor in episode six about the accumulated history of that building.\\n\\n\r\nWith time every which way, Rakugo Season 2 channels its pristine writing skills.\\n\\n\r\nA full-circle narrative returns when Yotaro celebrates his new names at both the beginning and the end of the season.\\n\\n\r\nVarious callbacks, both in and out of the season, add extra layers. In season, episode eight has Yotaro perform “Shibahama” as an emotional reference to Sukeroku’s last in-life performance; out of season, episode nine has Bon perform “Tachikiri” at the prison as an unseen reference to how Yotaro himself first became interested in the art by watching his master (who at the time performed “Shinigami”) at that same prison.\\n\\n\r\nSmart foreshadowing of Bon’s death in one of the three initial promises he laid out for Yotaro demonstrates the show’s tight sequencing of events. The passionate dialogue between the cast likewise elevates the anime’s appeal.\\n\\n\r\nBefore Bon passes on, his final, heartfelt exchange with Sukeroku concludes their hand-centric leit motif. Where Bon originally slapped Sukeroku’s hand away upon their first meeting and (in his lie) had to unwillingly let go of it, they part ways one last time with a pinky promise. That the two will see each other again – someday, somewhere – beyond the ethereal plane.\\n\\n\r\nAltogether, this season’s story, like its predecessor, contains an astounding amount of execution. The amazing scenes, the involved rakugo performances, the themes, the intricate writing. Nothing short of excellence, indeed.\\n\\n\r\nART & ANIMATION\\n\\n\r\nRakugo Season 2 continues with the same impressive visuals as the first season.\\n\\n\r\nOnce again, the rakugo performances shine. On stage, Bon, Yotaro, and the other performers act out the parts of their stories with believable, subtle movements. Faces contort to match old friends or to display emotions befitting the events portrayed. And the camera shifts and rotates in such a way as to heighten the impact of their delivery. Best of all, these performances persist in how they interweave the real with the imaginary, like how Bon summons the spirit of Miyokichi who haunts him still.\\n\\n\r\nOutside of rakugo, the rest of the artistry does not let up. Locations regularly change to induce variety in the background art: a tree-filled, yellow-leaved park at a nearby hospital, the different rakugo stages setup across the city, the restaurants, villas, and buildings visited. Cinematography also plays a key role: close-up shots of the characters eyes for dramatic effect, framed perspectives provide aesthetic symmetry, strange angles allow fun, interesting setups. Lighting and coloring likewise maintain the anime’s mature mood through careful touches and balanced hues.\\n\\n\r\nLike the performances, however, some of the best scenes combine the realistic setting with the imaginative possibilities. For instance, in episode six, a stylistic set of depictions accompany Eisuke’s explanation of the three distinct rakugo “expressions” (as he calls it). Bon’s refined technique resounds and reverberates his shadow into existence. Sukeroku’s sincere, in-place approach phase shifts him towards himself. Yotaro’s purity removes him entirely from the picture and replaces him with characters painted seemingly centuries ago.\\n\\n\r\nSomething as simple as Yotaro going from watching the film of Sukeroku to being a member of the audience in that very same room on that very same night in the blink of an eye demonstrates Rakugo Season 2’s immense desire for flair. In similar fashion, this sense of simplicity applies to the characters’ designs. Bon’s whitened hair, Yotaro’s large build, and Konatsu’s reserved beauty create in them their own looks, but the small, subtle changes to their features over time leave the longest impression. Bon wrinkles with age and appears visibly weaker as the events take their toll on him. Yotaro gains a big belly and baggy eyes after sixteen more years pass by. Konatsu’s hair grows from short to medium to long in length over the entire season.\\n\\n\r\nAnd small details help to fill in the cracks. In one expert case, episode eight finds Yotaro repeating similar words to Bon as Sukeroku did before him. It instigates a swift flashback, but rather than putting Sukeroku in the frame, it leaves him out, showing instead a static shot of the some burning wood since that is all the audience needs to remember that time from the first season.\\n\\n\r\nTo be absolutely fair, the anime is not without error. Some of the way-in-the-back onlookers can sometimes seem as if they were hastily put together. And, in episode five, the animators accidentally and incorrectly colored Yotaro’s mouth instead of filling it with teeth to fit his toothy grin (indicated by the squiggly line therein). But these issues are nitpicky, and the anime does more than enough with its art and its animation everywhere else to make them inconsequential in the long run.\\n\\n\r\nCHARACTERS\\n\\n\r\nRakugo Season 2 includes several side characters. Matsuda, the kind, silent man who has seen everything from the sidelines. Eisuke, the knowledgeable outside source who has ties to both Bon (who turned him down when seeking apprenticeship in the first season) and Miyokichi (who he crushed on when he was a young boy). Mangetsu, the doctor who returns to rakugo with the Eastern, Tokyo style in tow. Shin, the child of Konatsu who the audience watches grow from a baby to a kid to a spitting image of the men who tailored his life from behind the scenes.\\n\\n\r\nMuch like the first season, however, three key characters helm the charge: Yotaro, Konatsu, and Bon. The laudable writing which guides their arcs reinforces the tremendous level of execution seen throughout the entire series.\\n\\n\r\nFor the first five episodes, Yotaro receives much of the attention. As Bon’s apprentice and a rising star in the rakugo world, Yotaro has a lot to live up to. And with Konatsu as his new wife and Shin has his new (step) son, he likewise must contend with his personal life, too.\\n\\n\r\nThankfully, he’s the perfect man for the job, for he is Bon’s and Konatsu’s rock. Yotaro firmly believes in Bon, his abilities, and his importance. He always respects his master, listening to his commands and sitting before him in a subservient manner. He even saves him from an untimely death at the hands of the Shinigami and the burning rakugo theater. And to Konatsu, Yotaro looks out for her with coats and words and happiness. He supports her as best he can and, in doing so, forms a close bond with their child, giving her a husband and him a father that they never knew they needed.\\n\\n\r\nConversely, Yotaro is, when compared to everyone else in the cast, the most emotional. He laughs and smiles with optimism when speaking of rakugo. He reacts with passion and embarrassment whenever Konatsu reciprocates his feelings in kind. He cries and cares during the truly jubilant and the truly depressing moments around him. He wears his heart on his sleeve, turning him into a very honest, very personable character.\\n\\n\r\nSo, as someone who is there for everyone and who gives to everyone, Yotaro’s pure expression of rakugo makes a lot of sense. As he phrases it in episode five, “I love rakugo, and I really love the characters who appear in rakugo. A lot more than I love myself.”\\n\\n\r\nBut that does not leave him immune from conflict of his own. Moreover, the theme on time finds itself here with Yotaro, too. He understands that taking on the Sukeroku name means upsetting diehard followers, and the gangster lifestyle he has since ditched clouds his mind as he contemplates what to do. So, he confronts these two pasts, working hard to learn about the fabled master and completing the coloring on the tattoo that adorns his back.\\n\\n\r\nKonatsu is a much more complicated character based solely on the fact that her relationships do not follow typical patterns. Having lost her parents early in her life, she never had the most stable of upbringings. She was raised by Bon, the man who (she believes) killed them, so she despises him with every fiber of her being. Then, having never experienced real love, she pushes back against Yotaro despite his sincere feelings.\\n\\n\r\nOver the course of the season, Konatsu breaks down the walls that she has put up around her. With Bon, she interacts with him across the emotional map. She grabs his arm at home while sleeping, and the two discuss how she still wants to kill him for what he has done but needs him alive for her son to hear his rakugo. She frets over him after his collapse, worrying over his health and calling him (verbatim) “pathetic” as they sit together on the park bench while smoking a cigarette. She pleads on the bridge for him to not go away like her parents before him.\\n\\n\r\nWith Yotaro, she slowly learns to love him in return. She appreciates his encouragement when he skips his after-party celebration and chases after her. She reveals her thoughts after his defiant stand against the gangster boss, commenting on holding hands (when she so desires). They embrace following her first ever rakugo performance. They remain in sync in the immediate aftermath of Bon’s collapse. She becomes his accompaniment, playing the shamisen at his own performances. She leans on him affectionately after a hard day’s work.\\n\\n\r\nFor both men, her relationships reach a wonderful apex that signify the development in her character. She thanks Bon for raising her and not abandoning her in a fantastic scene that goes down as their last interaction. And she conceives a child with Yotaro to consummate the love she now fully shares with him.\\n\\n\r\nLooking at Yotaro and Konatsu as individual characters, they hold an amazing parallel with Sukeroku and Miyokichi. The two halves are similar in that the men embody positivity and the women wrestle fiercely with their own feelings. The two halves are different in that Sukeroku leaves rakugo whereas Yotaro uplifts it while Miyokichi tears everyone apart whereas Konatsu brings everyone together.\\n\\n\r\nOther similarities and differences exist between them (marriage, character arcs), but this parallel ultimately influences the most important character of this season and the entire series: Bon.\\n\\n\r\nBon lost his best friend and his one true love to a “double suicide” in the first season. So, the audience finds Bon in a state of regret, resentment, and remorse at the beginning of the second. This negativity has followed his very being for much of his life – to the point that he solemnly wishes to take rakugo with him in death.\\n\\n\r\nYet Bon isn’t present to any significant extent in the first half of this second season. He tutors and converses and performs. But, generally speaking, Bon doesn’t have a major role. A wise decision on the anime’s part since it smartly works instead on setting up both Yotaro and Konatsu for their development and the eventual influence they have on him.\\n\\n\r\nCome the end of episode five, where Bon envisions Miyokichi and when Sukeroku attacks him, the focus shifts back to Bon as he encounters one of the lowest points in his life. He has lost the strength in his voice, so he gives up on rakugo and thus himself. Then, as he feels the inevitable decay of his body, he attempts to commit suicide, and later the “god of performance” nearly burns him alive.\\n\\n\r\nThankfully, Yotaro and Konatsu are there to support the man who has given them so much. In the second half of the season, their actions keep him going. Konatsu cares about and worries for him during his hospital visits. The two convince him to come back to rakugo. Yotaro saves him from the burning theater just in time.\\n\\n\r\nTheir kindness elicits the same from him. He respects Yotaro enough (“Inokori” or otherwise) to pass down Sukeroku’s fan (entrusted to Eisuke) to him, and he accepts Konatsu’s request of becoming his apprentice. Yet it’s his words during their heartfelt scene that resonate the most. As Konatsu cries in his arms and “can’t give a name to this feeling anymore,” Bon responds, “Such incomprehensible feelings are what humans are made of. Just like rakugo.”\\n\\n\r\nLike the ever-present theme on time, a theme on the human condition has persisted throughout this entire season. Yotaro, Konatsu, and Bon endure events that have them experiencing a myriad of emotions. They hide details from each other. They push beyond their differences and connect on intimate levels.\\n\\n\r\nThus, just as Bon says and what the show argues in a meta sense, that’s rakugo at its core. The performer recites the stories, and the audience follows along. But what rakugo does best – both the art and the anime itself – is explore the very nature of humanity. Be it a fisherman who finds a dirty bag filled with money, to the three key characters of this tale, they are more than just a set of fictitious characters. They are people.\\n\\n\r\nBut because Rakugo Season 2 is way too awesome, it doesn’t stop there with Bon. Instead, all of episode eleven sends him off in proper fashion. Now passed away, he has private moments with both Sukeroku and Miyokichi in which they reconcile with each other. Their words on not having everything go one’s way (how Bon couldn’t die with rakugo) and about not being able to live alone (how Bon eventually had a family and a circle of friends) echo that theme on human nature in as cathartic a manner as possible.\\n\\n\r\nAnd, as one last hurrah, Bon performs rakugo for the final time. Not anything dramatic or even his signature “Shinigami” but rather “Jugemu.” Because the performance isn’t for him – it’s for his two old, dear friends, their daughter who he raised, and their grandson who (eventually) takes after him all too well.\\n\\n\r\nSeeing the literal finale to his life and therefore his full character arc puts Bon in the Characters Hall of Fame. He was already one of the best in the medium after last season, but, after this season, the Eighth Generation Yakumo enters a league of his own.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nThe voice acting within Rakugo Season 2 delights the ears and rivals that of the previous season. Tomokazu Seki as Yotaro speaks with enthusiasm and passion as he works to support everyone and everything around him. Yuu Kobayashi as Konatsu uses a raspy voice that highlights her tomboy behavior, her short temper, and her hint of sexiness. And Akira Ishida as Bon ages his tone for the now older gentleman while still maintaining his sharp cadence.\\n\\n\r\nEach of their rakugo performances, like the first season, further demonstrates their VA capabilities in that they capture the audience with their impressive delivery. A somewhat unique opening track and an instrumental ending track also return.\\n\\n\r\nThe OP incorporates the ticking of a clock, whispered vocals, music cuts, soft sections, rousing sections, and wedding bells. Altogether, they create a beautiful, haunting, and interesting piece while keeping with its themes on time and the human condition.\\n\\n\r\nThe ED, in contrast, is simpler with its casual piano playing and backing trumpets, flutes, and drums. But such simplicity brings both a calming strength that carries it along and a sincere, thoughtful goodbye whenever the piece completes.\\n\\n\r\nAnd, in a similar trend, the original soundtrack brings back its dramatic compositions, its cultural additions, and its clever audio design, like when Yotaro’s radio rakugo performance of “Nozarashi” plays over the everyday life of the city and the tops of cherry-blossom trees.\\n\\n\r\nIn short, the music and the sound speak for themselves.\\n\\n\r\nENJOYMENT\\n\\n\r\nI am so happy that this sequel not only exists but also succeeded so spectacularly.\\n\\n\r\nPersonally speaking, I was caught off guard by the twist about Sukeroku and Miyokichi’s deaths. When I finished episode seven, I had to stop and mull over it while walking around my place saying, “What?!” My Thanksgiving holiday, try as it might, could not push it out of my mind.\\n\\n\r\nAlso, that real-father reveal then had me scrounging through comments from eight months ago. Peering through all the angles and reading about some of the extra material, I’m fine with either outcome. I like the poetic structure and the potential for even more feelings should it be Bon. But I also like the ambiguity behind it all. How it follows the “some things are best left unsaid” idea which in turn forces a meta discussion onto the audience as to whether Konatsu is really telling the truth. (I will say, though, that I’m a fan of Mangetsu being the father since it helps to explain his presence and removes the almost too crazy element.)\\n\\n\r\nI love the twist and the reveal, and I love everything else about this show, too. I love the romance between Yotaro and Konatsu. I love Bon’s incredible character arc. I love the rakugo performances. I love the symbolism in the visuals. I love the drama, the maturity, and the execution that it exudes.\\n\\n\r\nWhat more needs to be said? On its own, this story spans more than just seasons. It spans emotions. It spans interpretations. It spans generations. But, when combined with its first half, this complete tale about a complex man, the refined art of rakugo, and humanity borne from the heart creates an anime that climbs onto the stage to peer over the others. A true elite which, like the masters before it, ranks among the best of the best forevermore.\\n\\n\r\nAs Yotaro says in the final line of the series, “Something this good could never go away.” And you know what? After finishing it all, I could not agree more.\\n\\n\r\nShouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen concludes this stunning series with unbelievable finesse. The thorough story, the engaging artistic direction, the lifelike characters, the remarkable sound-related performances, and the sheer amount of entertaining aspects. “Greatness” does not do this anime justice; “a modern classic” instead fits it perfectly.\\n\\n\r\nEncore!\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Great, huge moments, nuanced details, a purposeful theme on time, and strong fundamental writing craft a stalwart narrative that send this series off in style\\n\\n\r\nArt & Animation: Great, flavorful visuals, clever cinematography, and developing character designs form an artistic direction that invites the audience at every turn\\n\\n\r\nCharacters: Great, Yotaro, Konatsu, and Bon explore a theme on the human condition as their personable, loving, and troubled arcs intertwine with both parallels and connections\\n\\n\r\nMusic & Sound: Great, wonderful VA performances guide a haunting OP, a sincere ED, a dramatic OST, and a set of smart audio design decisions\\n\\n\r\nEnjoyment: Great, a modern classic\\n\\n\r\nFinal Score: 10/10",
            "date": "2018-03-14T17:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 273833,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=273833"
        },
        {
            "content": "This is the best freakin anime i've ever seen in my entire life. Writing this because it's so sad for me to say goodbye, cuz its the final episode next week. \r\nSo basically this anime were a masterpiece in its ss1 and continued to do what made it the best in ss2, technical wise. The music, the background music, the rakugo, the background art, the characters' emotions and psychology, and all other things. It fits the mood so well that normally it could hardly be told.  In ss1, the background music was absolutely the star, thanks to dramatic twists that the anime's plot gave.However, in this season, i think the hero role is shared between the music and the character's expression, especially the different faces of Konatsu and Yotaro. The story of the 2nd season is literally the 2nd Generation: The rakugo, as well as the main character role is shared inbetween a small community with Yotaro being the center, and Master Yakumo being the reason of all. \\n\r\nBasically all you'd do in ss2 is falling love with everybody after listening to their story and looking out for them, hoping for a happy ending.\\n",
            "date": "2017-03-17T21:34:00+00:00",
            "helpful_count": 8,
            "mal_id": 242831,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/HitagiSenjou",
                "username": "HitagiSenjou"
            },
            "url": "https://myanimelist.net/reviews.php?id=242831"
        },
        {
            "content": "This isn't Rakugo, or at least this isn't the Rakugo that I knew. Descending Stories is weird and different. It constantly pushes a new idea for a show that worked so flawlessly. There's no way that I wouldn't doubt it. I was careful with approaching each new episode, gave it a chance after chance until I realized that I'm just being ridiculous and that it's exactly how it's supposed to be.\r\n*Spoilers included*\r\nIf you've watched the first season of this show, then you know what the entire idea for it was. A story told through the eyes of Yakumo Yuurakutei, the famous rakugo artist that losthis friend and lover in a terrible accident, leaving him with their daughter Konatsu. We saw him take on an apprentice: the ex-gang member and convict Yotarou. After a couple of years he gets a new title, keeps performing his rakugo despite not finding his own style, which was one of the main themes of the last season. With Konatsu now having a child and Yotarou becoming it's father, Yakumo getting older and older with each passing day, rakugo becoming more and more obscure, things are bound to get complicated So, where does the plot go from here?\\n\r\nThis is what I mean when I say that the second season feels weird. The plot takes an entirely different approach. Not only is the point of view scattered throughout multiple characters, Yakumo, Yotarou, Konatsu and a few other characters, which makes the flow of the scattered plot entirely different, not only does the ending suddenly becomes a mystery where as in the first season we knew it from the start, NOT ONLY does the show introduce new ideas and changes things that you would never think it could change, like concentrating less on the performances, but it's past themes go in completely new directions that are actually... happy. Happiness is a word that I'd never thought I mention with this series. It always felt like a Holy Grail that the characters could never reach, as their tragic and difficult lives as performers seemed like a never ending circle of pain and suffering. And yet here we are. Characters keeping a constant smile for more than an episode and a happy conclusion. When I think about it, it shouldn't be surprising. Rakugo itself is split into the dramatic and horror stories and the happy, comedic ones that ultimately end up nicely. The show has taken the inspiration from those stories numerous times before, and it's not different here I guess. What's really important though, is the fact that it works.\\n\\n\r\nDespite bumps and scratches, the show manages to create a cohesive plot, both in its structure and thematic analysis, as it concentrates on stuff like the ways rakugo influences the audience, why and when does it do that, how each person with their own way of living, at their own age and with their own past can see rakugo, what their view on its future and past is and more stuff like that. Just like the plot, the themes themselves become more grounded, especially with the inclusion of Konatsu's and Yotarou's child and them becoming a loving family.\\n\\n\r\nBut I'm saying everything is good and happy here, when it's definitely not. The themes of death, tragic love and the hard life of an artist performing an obscure genre of art are all back, yet in a different way, a much wider one. With Sukeroku and Miyokichi dead, a new space opened for some completely different views and ideologies to come into the spotlight. First, Yotarou, who ultimately decides that he doesn't need to have his own style of rakugo in the traditional way. He wants to become the people in the story, be a prop that is only there because he's good at performing, just so those people can come out through him and be themselves. I really like this idea, as it reminds me of my own way of seeing art. As long as it's performed well, who really cares what it is, who really cares if it's that guy or another that performs it, maybe it's even better when it feels like he's not even there. Let the work itself speak, not the one that performs or makes it. But that's a personal thing, as for how it affects the plot, well, this way of thinking ultimately leads to Yotarou coming up with a revolutionary idea that takes me back to another character: Konatsu. Let me step away for this for a while though.\\n\\n\r\nVery early in the show, a popular writer that's interested in rakugo is introduced to the audience. He becomes really invested in it when he gets to talk with Yotarou. Turns out, he was the kid that we saw asking Yakumo to let him be his apprentice in the first season. His life ultimately went into a different direction, but the inspiration that he got thanks to Rakugo, especially Yakumo's, never died out. This comes back to the theme of \"how does rakugo effect the audiences\", but it also allows Yotarou to start his own plan for the future of Rakugo. As a younger guy, he's open to new ideas, unlike his master. He starts performing on TV and on the radio, he asked him to create completely new rakugo works, but the most important thing that he comes up with is allowing women to perform, more specifically, Konatsu of course. She always loved it, performed at a very young age, never lost her strive and despite neglecting it, always wanted to come back. And this shows how different she and Yotarou are from the characters in the first season, how those people wanted to preserve Rakugo at all costs while they want to open it up to a new era. Again, this is a different idea, a weird one that I wasn't really open to myself at the start, but the way it's implemented, through the incredibly strong, charming and well directed character moments, like Konatsu's performance in front of the kids or Yotarou's strive really did sell me on this. It's as if this entire time rakugo was only held back by the old performers who we loved for so long, and it's only now that we realize it. It's a great theme that messed with my head a lot, the idea implemented by Yakumo in the first season that Rakugo should evolve through the performers or Yotarou's that it should evolve through the ways that humanity changes.\\n\\n\r\nAs such, humanity is also an important part of the series, at the larger scale but also at the smaller, more personal one. Technically, humanity also means the things that make us humane. This is mostly represented through the old and experienced Yakumo, as he gets closer and closer to his last breath. Around the middle of the series, during a family performance, he sees the ghost of Miyokichi and faints. This begins the journey through his past. Old regrets pile up, bad decisions come back to haunt him, and we soon learn the truth that was long hidden from everyone who heard the story of the first season through Yakumo's words. Turns out, Yakumo lied. He lied about Sukeroku's and Miyokichi's deaths. It wasn't an accident. It was a cold blooded murder followed by an accident. Miyokichi stabbed Sukeroku, and the young Konatsu pushed her off the railing as her lover jumped to her aid and fell down too. Konatsu pushed this moment out of her mind, which is quite a common thing, especially for children, so only two people knew about this tragedy: Yakumo and Matsuda. Yakumo decided to live with the burden that Konatsu placed on him, as she blamed him for the death of her father. Technically, this was a good decision, but at the same time it led to this insufferable amount of pain that he never let go of, and that culminates during the events of this season. This most likely happens because of Yakumo's new stance on rakugo, that being him wanting for it to die with him. He simply doesn't see any future, so what's the point of looking forward to it? This led to his mind being occupied by the past, and with his slowly, but surely incoming time of death and his voice getting worse only strengthens that belief. It's a natural thing to look at your past, especially when you grow old and start not being able to do the things you normally would, so you naturally reminisce of the times when you could.\\n\r\nBut death approaches, with each episode Yakumo's health only gets worse. Despite some rays of light coming through the dark clouds, the Eight Generation is about to die. This is where the biggest change takes place.\\n\\n\r\nThe author decided to portray death and the afterlife in a supernatural way. Yakumo not only sees Sukeroku and Miyokichi appear before him, but one of them turns out to be the Shinigami himself (which ironically is one of the stories Yakumo performs best). He tempts him, he wants him to die, but thankfully he fails and Yakumo gets to die a natural death sitting next to his family, not a dramatic one that shinigami considers \"worth of an artist\". After that, there's an entire episode that takes place in the afterlife. Yakumo meets Sukeroku and later Miyokichi, as he gets to explore this mysterious place. Now let me tell you, this episode is by far one of the most impressive things I've seen in any animated thing ever. Author received full creative freedom that wasn't bound by any rules at this point, and it worked out incredibly well. It's such an interesting thing, seeing his imagination coming through in the fullest. The afterlife in Descending Stories is quite the mysterious setting. It starts off on a  bridge that leads to a small, town-like area filled with shops that try to steal the money you got on you before you reach the gate to either hell or heaven, which also need money to get into. While in that realm, the characters are able to do several things, like change appearance to look like themselves at any age or materialize the image of their beloved. Turns out things also go to the afterlife, as a theatre that burns down in one of the episodes appears and many other famous rakugo performers get on stage just like they did during their time on Earth. People who are close to the ones that died can also get inside to transport them through the river between the town area and the gates. And while this is one hundred percent the author's image of what the afterlife looks like, which could as well feel off-putting to such a grounded series, it works because it's intriguing and incredibly off-putting, yet directed, paced and drawn out very well. Despite being such a big revelation, it feels like a classic moment from a legendary book, you know, like the dreams in \"Crime and Punishment\" and other similar symbolic things that suddenly change the flow of a story and later become things that are talked about for centuries.\\n\\n\r\nNow, where this review really started to get complicated to plan out about is the cast, but that's not necessarily because of the characterization or utilization. This time around it's much larger. While in season one we had four or five characters that really mattered, here we have seven or eight total. That's a huge deal, especially when this season is much shorter than the first, and so I had to pose myself a question: \"why?\". Why would the importance of side characters raise and the scale of their influence stay pretty much the same? Fortunately the answer came pretty quick and sorted out a few of the things I perceived as issues.\\n\\n\r\nThe reason why the cast is so large is of course the theme of influencing normal people through rakugo, that's for certain. But why make them take an active part in Yakumo's life, why make those exact characters important and why paint them in such specific lights? The gang boss, for example, is painted as a very good person despite being a criminal that has to do what he has to do. He becomes really entranced by Yakumo's rakugo and feels the need to see more of it, which after the accident proved to be a bit difficult. Well, for him in particular, it seems like the show wanted to put even more emphasis on art affecting criminals? But Yotarou is already a reformed criminal, so there has to be another reason. Well, he becomes an instigator for Yakumo's short return and him visiting jail once again. Ah, so there you go! Because he is in fact wealthy and influential, he is able to bring him back by gathering other people who also need him. Mix that with Yotarou's emotional response and the moment where he let go of his past which his presence strengthens even more, and you've got yourself a character, that while not being specifically needed, is a very important part of the way this show's structured and planned out.\\n\\n\r\nAnd this is the case for most of the other side character. Put them onto themes and ideas this show has to offer and you can in fact see their importance. Mangetsu showcases a new style of rakugo, as he comes back to it thanks to Yotarou later on, which also shows how Yotarou impacted people to also perform rakugo. Amaken shows how even \"haters\" and critics have to acknowledge Yota's greatness. Thanks to Eisuke, we see that rakugo inspires other forms of art and that Yakumo's performances had such a huge impact that he still remembers them, besides other things that he does throughout the story. All of this is showcased through character behavior, with a natural flow and development that could only be achieved thanks to the time skips that this series does utilize and several camera shots that transcribe how you should be looking at them at that point in time. How many other series do you know that represent the entire world, all the themes, technology and interactions between the main cast and the setting through just that, and does it good at the top of it all?\\n\\n\r\nMaking such symbolic characters realistic and grounded was a thing that really impressed me in the first season, and thankfully despite the increase in numbers, the cast of the second season still feels real. They're just like real people, tangled in their own affairs, with their daily lives, dedications and interactions. You see the gang boss only a bunch of times, but you do know exactly what you need about him, how he runs his business, how he treats his underlings. You learn that he visits certain places in his free time and attends Yakumo's performances, keeps in touch with him and is respected by a lot of people, most likely he's in friendly terms with a bunch of his fans as he can contact them and trusts them enough not to sell him out. He deliberately lets the police take him without resistance, because he doesn't want the other participants get hurt or to ruin his reputation.\\n\r\nI'm specifically talking about him, because he's one of the characters that get the least screen time. Despite that, you get all the information you need to create a sound, logical profile of a character that's technically a minor one. This proves that Rakugo is still as refined as it always was, the writers know exactly how to use their time. Perhaps some elements were put together a bit awkwardly, the gang boss' role surely could have been more effective or maybe more memorable if his scenes were placed differently, but small things like this are not what make or break the show, they don't interrupt the flow, they don't interfere with the thematic structure or characterization, they're just preferences that are created because there are rules inside each of our minds on how to do certain things, which is funny because one of the themes for this season is that those sort of rules are just that - a part of our taste and the process of judging an art piece that we start taking for granted - and they shouldn't obstruct anyone's creative process. I especially like this because I also believe that art should never be bound by rules. Let's get a bit back on track though.\\n\\n\r\nYotarou and Yakumo do a good job at being the show's main characters as well. You may think that it's a given that they do their role correctly, that the themes that they were assigned with as representatives work with their characterization and develop alongside them, but it isn't really. It's something that has to be mastered by a writer, told through not only words but directing and visual cues, music and sound effects, and that's where this show always shined. Well...\\n\\n\r\nDon't get me wrong, they still shine like the bright stars on a dark sky, especially when you put them next to other anime that aired in the same season, but I had this feeling that they were a bit less inspiring this time around. The directing wasn't as expressive, probably because there were fewer rakugo performances (the ones that were fully animated were still amazing though), the lighting was off at times (faces being completely covered by a shadow just to be lit up a bit in the next show, with the characters being in the same position) which before felt like a more stylistic and consistent decision, while here it felt awkward due to the setting, there was some CGI involved which saddens me greatly, the music which I always thought was the best part of the series was utilized less and sometimes, when some of the tracks from the first season played, they seemed off when I thought how much of a time gap there is between the seasons. While still being great, absolutely fantastic in fact, to me Rakugo's directing, usage of music and art style always felt like a holy grail of sorts, and it was sad seeing even the slightest of slip ups.\\n\\n\r\nWeirdness doesn't necessarily have to be a bad feeling, but one would assume that putting it with Shouwa Genroku Rakugo Shinjuu in one sentence will result in a negative sentence, but that's not really the case. Descending Stories was certainly a weird continuation of a story, with many new ideas to tackle, many new roads and characters to explore, and yet it kept a lot of the elements from the first season intact, not breaking any of the previously established themes despite tempering with them a lot. Once again, this is pretty funny. If you have seen the show you'll know that this feeling of weirdness, trying out new things yet wanting to keep the old ones together is also one of the show's main plot points. It almost feels like the authors struggled on purpose, like the production team wanted to implement Yotarou's vision itself into the show's execution, while keeping Yakumo's previous storytelling techniques from the first season. Best thing about it? It works, and it works really well. There's no real problem that I can point towards, no hook to grab onto even if I wanted to say something negative. This series still remains to be an exhibit of everything that modern anime are able to do and things that could be done in the future to improve even further. This show is revolutionary in its own right. Honestly, it always felt like it was, but this season cemented it as such. The afterlife scenes are a perfect example of that, pure artistic expression of an idea so imaginatively difficult and hard to craft that even attempting it deserves praise, but this show doesn't stop there. It takes every good idea it has and turns into exactly what it wants. This sort of strength, this sort of ambition, this chase after perfection is why I personally love Shouwa Genroku Rakugo Shinjuu.\\n\\n\r\nArt at its finest ladies and gentlemen, take it in, soak it all up and get inspired by it, create your own works whatever they are and make them even if they were already made better before. I'm just going to leave this little message at the end, because that's what I felt upon finishing this wonderful series. I'll miss you Rakugo, you were amazing the whole way through.\\n\\n\r\nAs always, this is purely my opinion. I highly encourage you to develop your own.",
            "date": "2017-06-10T16:19:00+00:00",
            "helpful_count": 7,
            "mal_id": 249656,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5603650.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Werty800",
                "username": "Werty800"
            },
            "url": "https://myanimelist.net/reviews.php?id=249656"
        },
        {
            "content": "I don’t like Shouwa Genroku Rakugo Shinju. Main reason being is that the main characters’ stupidity is what caused the conflicts within the show. Right off the bat, the main focus of both arcs, Yakumo, is so fickle-minded. Come to think of it, he’s the indirect cause of Miyokichi and Sukeroku death. Now I don’t know if what he and Sukeroku had was just bromance or if he actually had feelings for him. Or if he just wants to focus on doing rakugo. But if he just manned up and dumped Miyokichi, then she could’ve just moved on with her life. But nope, he justhad to be wishy-washy about it.\\n\\n\r\nSecond is Sukeroku. His laziness in the second arc was annoyingly stupid. I don’t know if it’s just a pride that he didn’t want to take work aside rakugo. But for him to just let his daughter do all the work is nothing I can empathize with. Miyoki, I can somewhat understand considering the culture she was raised in. She was raised in the idea of being a perfect housewife. Honestly she didn’t know better.\\n\\n\r\nThird is Konatsu. I don’t know if she’s just being tsundere, based on how she keeps threatening to kill Yakumo. But she still lives in his house, despite him constantly insulting her parents in front of her. And the ending? It was heavily implied, from her being very secretive about the father of her child, to the way Shinosuke behaves exactly like Yakumo, to Konatsu saying that she and Yakumo were like lovers. Shinosuke was their son. What is this, Usagi Drop 2.0?\\n\\n\r\nOn a positive note, I did like some of the rakugo themselves, like Jugemu, Shinigami and Nozarashi. I got to learn the basics of its history and evolution. But that’s really it. Most of the characters in this show are insufferable.",
            "date": "2018-01-14T09:32:00+00:00",
            "helpful_count": 5,
            "mal_id": 268542,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5744150.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/maattthhhh",
                "username": "maattthhhh"
            },
            "url": "https://myanimelist.net/reviews.php?id=268542"
        },
        {
            "content": "Lets not mince words here; Descending Stories is a masterpiece. \r\nI cannot think of any other anime that has possessed such a quiet yet devastating power to move me to tears with every episode. Most impressively, it doesn't resort to cheap manipulation to move you. The fact that I cared so much about each and every one of these well rounded characters is the reason I was moved so deeply as I shared the various moments of joy and sadness.\r\nAnd make no mistake, there is an overwhelming sadness and melancholy that pervades DS. Yakumo carries the memory of Sukeroku and his wife Miyokichi with himlike a ball and chain (the cause of this sadness is obvious to anyone who witnessed the tragic events of the first season). The overwhelming guilt and sadness he feels is so evident in his every word and movement. This depression overwhelms him, so much so that he cannot show the love and affection he feels for his adopted daughter Konatsu, or his doting apprentice Yotaro. Yet there are those rare moments when the characters truly connect and feel moments of shared joy, and these moments are amazingly powerful. \\n\\n\r\nThere are moments from Descending Stories that I know will stay with me forever. Its a monumental achievement in animated storytelling.",
            "date": "2017-04-19T19:50:00+00:00",
            "helpful_count": 6,
            "mal_id": 245874,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283210.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jzathejenius",
                "username": "jzathejenius"
            },
            "url": "https://myanimelist.net/reviews.php?id=245874"
        },
        {
            "content": "With second season finished, Shouwa Genroku easily turns into one of the best anime i've ever seen, it'll be too long to describe all the emotions that this story made me feel (and i'm not a good writer to do so).\r\nThis tale takes us to Japan in different times of history, portraiting each one from the pont of view of this art called Rakugo, and how it struggles to survive, and does survive, because after all, something that good could never go away.\r\n The greatest aspect of this anime is simply, that every part of it works so fine with everything else. You can relateto the characters, you can think of their intentions, of their actions and their feelings, and never fully know them, because they feel human, they feel like this mass of feels and contradictions who we are. \\n\\n\r\nFinally i can just say, this anime is amazing, and you should watch it.\\n\\n",
            "date": "2017-03-25T10:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 243490,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4536317.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/rasetz",
                "username": "rasetz"
            },
            "url": "https://myanimelist.net/reviews.php?id=243490"
        },
        {
            "content": "Rakugo is a series about Beautiful Storytelling, and it is perhaps unsurprising that it turns out to be a Beautiful Story too. The flashy fantasy tropes are absent: this is a grounded, plausible narrative with a grand scope. It spans a lengthy time period - from the 1930's to the present - and deals with the serious questions and responsibilities of life in an artful style.\r\nEvery episode mixes together the grand narrative with careful depictions of rakugo performance itself, with a few of the classic rakugo stories recurring throughout different episodes, told by different characters in their own style. If that sounds a bit dull,don't be too dissuaded: the story prepares you so well for each performance that you aren't likely to feel bored. It uses these scenes not just to show a performance, but to build up context and character investment, and when it's not working on its characters, it builds up the world instead, depicting the various time periods with ruthless attention to detail. By the time you're done you'll feel a strong sense of the cultural shifts taking place over the years.\\n\\n\r\nA way to view the two seasons, without spoiling any major details, is that S1 shows the tragic ending suggested by the title - a propelling of events to a sad, inevitable conclusion, and S2 shows a restoration: an \"ending after the ending\", continuing forward in time as the main characters grow old, face mortality, and eventually pass on, while a new generation comes up and challenges their elders(not in an overtly anti-authoritarian sense, but \"we can try something different\" - stark, duty-bound tradition giving way to new ideas). The two ends of this story meet in the late 1970's, and the timeline jumps around from that point, linking together common themes, stories, and characters in various surprising configurations. \\n\\n\r\nThere are many layers to the story, and yet there's always something to pick up on, so you hardly ever feel confused despite the complexity. It's visually interesting, and the audio breathes in a lot of atmosphere. It's very easy to recommend this series.",
            "date": "2017-04-22T02:55:00+00:00",
            "helpful_count": 4,
            "mal_id": 246030,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845194.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/triplefox",
                "username": "triplefox"
            },
            "url": "https://myanimelist.net/reviews.php?id=246030"
        },
        {
            "content": "Shouwa Genroku Rakugo Shinjuu is the first anime that I have been passionate enough about to write a review on MAL. I am no good at reviewing things but here it is:\r\nI thought that the first season was excellent, and that the second season is even better. The animation in SGRS is wonderful. That was the first thing I came to love about this show. Then the character development - man. It's spectacular. Most of the first season is a flashback but it's so smooth and enjoyable that I nearly forgot about what was going on in the present, which is where the second seasonpicks up. The background of the first season plays a critical role in understanding the second season, so don't miss it! I wouldn't pay any regard to reviews written by people who didn't watch the first season and still wrote a review about the show. \\n\r\nThe music is top notch and it makes beautiful/emotional moments shine even more. The second season is where I got feels almost every episode, and I even teared up when I watched the 11th episode. Shouwa Genroku Rakugo Shinjuu is the first anime I've watched that has caused me to do that. \\n\r\nI think that this is probably the most well-made show I've ever watched. Please watch it! I recommend it to anyone and everyone. It is outstanding in every aspect.",
            "date": "2017-04-03T18:44:00+00:00",
            "helpful_count": 4,
            "mal_id": 244546,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/T-CRISIS",
                "username": "T-CRISIS"
            },
            "url": "https://myanimelist.net/reviews.php?id=244546"
        },
        {
            "content": "If the first season of Shouwa Genroku Rakugo Shinjuu was a 10/10 for most then this season could be considered a 9/10 because personally I do believe that it is less consistent with its episodes and starts off slow, as I found myself starting and stopping the series a few times. However I certainly found that it payed off in the end.\r\nSTORY: 8\r\nWhile in the first season we focus solely on the story of our main character Bon, this season implied that we were then going to witness Yotaro's perspective mainly. Which the anime did, but it also explored a lot of the supporting castand that set up for Yotaro and everyone else particularly gave way to a slow start. In the beginning all of these sort of 'parts' we get are fluid but also feel disjointed from one another and the viewer might get confused as to where the direction of Rakugo is even headed. However, starting midway the storyline becomes clearer and resolved, and the previous episodes' setup becomes a very much needed foundation to finish not only the story solidly but the character's developments. \\n\\n\r\nART: 10\\n\r\nBreathtaking as always. The animation's dedication to expressive body language is phenomenal and should be for it's subject. In this season particularly we get some more artistic moments as we explore the mental states of our cast. We continue our subdued color palette that is very suited for its overall mellowed out dramatic tone and doesn't distract the viewer. And the anime is very consistent in quality overall. \\n\\n\r\nSOUND: 10\\n\r\nRakugo has an amazing voice actor cast with a lot of talent! This only shines more this season as we get to hear from a wide variety of characters besides Bon, who was as stunning as he was in the previous season, which include Yotaro, Konatsu, and some new introductions! The flexibility of these voices also shines in how they  portray and interpret Rakugo, and their age fluctuations. Working well as usual to a beautiful soundtrack of traditional Rakugo sounds, and our usual background music. \\n\\n\r\nCHARACTER: 9 \\n\r\nIn the beginning, Rakugo presents itself with a lot of its characters' flaws and as we go around the cast the story falls into a stagnant period compared to it's previous season of linear progression per episode. However, as they progress and learn, think and talk, they begin to connect to eachother and grow together. I don't know how to exactly put words to this phenomenon but this season doesn't resolve each character individually, rather they all come to blend together and finish at the same ending point. As interconnected as the relationships are in Rakugo, it seems to be fitting that their personal issues are not only theirs but shared by everyone, and thus needed to be supported to be solved by everyone. If anything I think you should realize that each and every character has their own role of importance, even if subtle, that makes up the whole of this series.\\n\\n\r\nENJOYMENT: 10\\n\r\nI definitely struggled with it in the beginning and it took a few times for it to garner my full attention. But it set itself up well enough to really drive itself in the last 3-4 episodes. And above all else, I was thoroughly satisfied with how it chose to end itself.\\n\\n\r\nOVERALL: 9\\n\r\nFor the sake of being honest with how this compares to it's previous season, it definitely is considered a little less due to causing some confusion. Nonetheless if you come in with expectations of how it was directed last season, I can see how some might be disappointed. Sukeroku Futatabi-hen might contain the same elements as the first season but how it arranges them is vastly different, its presentation of the storyline is different, and how it utilizes the role of rakugo as a motivator is different.",
            "date": "2017-04-01T13:56:00+00:00",
            "helpful_count": 4,
            "mal_id": 244277,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5472998.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xisue",
                "username": "xisue"
            },
            "url": "https://myanimelist.net/reviews.php?id=244277"
        },
        {
            "content": "Long Story Short: Art and Story are fantastic. you should have this on your to-watch list. \r\nPlease watch season 1 first! You'll enjoy season 2 whether or not you watch the first season but its better if you do. \r\nThis anime is truly enjoyable in many ways. From the very beginning you want  Yotaro to succeed  and save Rakugo, but this story is way more than that. You get to the characters lives from different angles. What you'll truly appreciate is seeing characters that are actually human in the ways they deal with grief, love, regret, and the struggle to achieve their dreams.\\n\\n\r\nIf you are an anime novice this might not be something you're ready for.  The lengthy yet truly enjoyable Rakugo monologues allow you to see a part of Japanese history so rarely depicted in anime. It is also an emotional rollercoaster you'll leave each episode wondering about the next and thinking about all the details of the ones before. You'll laugh when Yota laughs and feel all the feels when Yakumo reminisces.  If you are looking for an enjoyable, engrossing and amazing anime Shouwa Genroku Rakugo Shinjuu is the anime for you. \\n",
            "date": "2017-03-27T01:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 243654,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/RedBiscuit16",
                "username": "RedBiscuit16"
            },
            "url": "https://myanimelist.net/reviews.php?id=243654"
        }
    ],
    [
        {
            "content": "(Greetings from Portugal.)\r\nAnd so it ends, such a beautiful ending to a beautiful story. If you watched Shouwa Genroku Rakugo Shinkuu: Sukeroku Futatabi-hen, loving it's prequel, you'll also love the continuation.\r\nThis anime (with lovely animation, quite cinematic it fact) needs attention, it's premise and synopsis is not the most exciting thing you ever heard, but it's so well made! \r\nThe way this story is told and it's incredible characters compel the viewer to invest emotionally in the narrative (10/10 - must watch).\r\nYou will not be disappointed or frustrated with the end. I mean, I'll miss the show, I'll miss all the characters, but I'm pleasedwith the way it ended.\\n\\n\r\nSuch a poetic and emotional anime.",
            "date": "2017-03-26T10:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 243598,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5335519.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/pondipat",
                "username": "pondipat"
            },
            "url": "https://myanimelist.net/reviews.php?id=243598"
        },
        {
            "content": "BLACKCRTICCTGUY...FORNEVERWORLD...SOUALANIMATION...WESTERN OTAKU..ANIMEKINGDOM.. some anime reviewers there .I'm not overacting but you need to watch this\r\nFirst of all let me say I can't believe something like SAO is more popular than this, It's not that I'm being bias but this show is really something,  I got some reasons, It copuld be personal but still I really enjoyed it.\r\nStory\r\nThe Story is simple, Yotarou has now obtained the name Sukeroku and now he's   trying to search for his own Rakugo while dealing with his past and his present life, one thing that I like is that the story itself is not rushed, every episode isreally juicy as for the 24 minutes you thinks that It's somewhat short.\\n\\n\r\nOn top of that the theme of the story is really matured, which is Ironic because the heart of the story is Rakugo a type of commedic story telling if I'm correct.\\n\\n\r\nCharacters\\n\r\nWhat I like the most in this series is the characters, everyone is not perfect but that what's make them perfect, my personal favorite is Yota the MC,  don't let it distract you from his loud mouth and happy go lucky attitude for he is actually one of the most matured characters I've seen, the way he handles things especially for his family and his love for rakugo is really great, and him being sukerorku is really heartwarming, he went from a former prisoner to someone who gives people laughs.\\n\\n\r\nnow we got Yakumo, what makes me like this old man is how he deals with things, he thinks carefully before he acts, and yes he acts rude sometimes  but deep inside he's a really nice guy\\n\\n\r\namong the rest what I can say is they all have their fair share of screentimes, for instances Isao Kido the mafia boss he is a minor character so his screentime is fit for a minor character but at the same time his not just there.\\n\\n\r\nand true everyone has their secrets but I think it's a good way because I think ssying answers to the end isn't always the right thing to do to conclude an anime, it's like they all have dark past but they are ready to move on.\\n\\n\r\nand again the fact that they didn't rely on fan service to promote an anime makes me enjoy it even more.\\n\\n\r\nSound and Animation.\\n\r\nPerfection I guess..I love the combination of jazz and traditional music, It's pretty interesting, and really appriciate all the VA's here, especially Yotarou in episode 3, damn It's not easy to speak in fast paced.\\n\r\nThe Art is pretty special I love each and every desgin, my personal favorite is Higuchi\\n\\n\r\nEnjoyment and Overall\\n\r\nwhile It's true that It's not an anime for everyone I think you should all try this, It's something that Is not cliche, and you'll really learn a lot of life lessons here, \\n\\n\r\nalso this is the season 2 of the shouwa genroku rakugo series",
            "date": "2017-09-19T00:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 257994,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4949977.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MetalTsundere",
                "username": "MetalTsundere"
            },
            "url": "https://myanimelist.net/reviews.php?id=257994"
        },
        {
            "content": "The problem I had with the first season was that it left off without giving the viewer an emotionally complete ending. That ending is found here, in the second season. I've never seen an anime be so quiet, so genuinely full of emotion and art as this one. To go across a literal lifetime as this anime does, following the main character from childhood to very old age, and to keep the viewer emotionally involved the whole way is amazing. To do it about something that I, as an American, had never heard of up until this point?\r\nEven more amazing. There are no faeries ormagical girls or superpowers to be found here, and yet it stands out so much despite having none of the flair so many anime fall prey to. It tells a story, a simple story, but a damn good one. To anyone who hasn't seen it, why haven't you? \\n\\n\r\nThis is how you tell a story. This is how you develop characters. Simply put, this is human. And it's absolutely beautiful.",
            "date": "2017-09-16T18:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 257738,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3650909.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ixaix",
                "username": "Ixaix"
            },
            "url": "https://myanimelist.net/reviews.php?id=257738"
        },
        {
            "content": "I’ve been thinking for a while trying to decide why I didn’t like this season as much as the first. In the end, I think I just have the first season up on such a pedestal, this season could never hope to reach it. \r\nDon’t get me wrong, this season is good. I love SGRS, and I don’t think this season particularly declined in quality or anything. It’s just very different from season 1. One odd thing about it is that it feels like it covers more time, when in reality I believe season 1 actually did, considering it follows Bon from childhood to adulthood.Season 2 feels less focused, though. It follows around a larger cast of characters, and I think sometimes it gets scattered keeping track of everyone. \\n\\n\r\nI guess considering my love for season 1, it’s no surprise that episode 11 was far and away my favorite of season 2. No spoilers, but it’s really a treat to get to revisit some familiar faces and get some closure on certain issues. Not to mention it’s a gorgeous episode to look at. The final episode was…interesting. Certain things are suggested that made me uneasy, I think you can guess what I’m talking about if you’ve seen it. But it was also a nice closing episode to the show. \\n\\n\r\nSo I wouldn’t say this season was bad, or anything. Do I think it compares to season 1? Not at all. But it’s still SGRS. It’s still full of authentic-feeling drama, great three-dimensional characters, shocking but realistic plot twists, and an overall aura of being a cut above the rest. \\n",
            "date": "2017-03-28T12:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 243811,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1695247.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/playrough",
                "username": "playrough"
            },
            "url": "https://myanimelist.net/reviews.php?id=243811"
        },
        {
            "content": "This is the single best anime that I've seen, it's just the best. And I can't even believe that it is not ranked as top 10, because it should be there. \r\nThe Story is defiantly a 10 out of 10. And I can understand those who think that it is boring or it is slow or the Rakugo part is no fun or whatever, I know that this is not the show for everyone. But I can say that how detailed the story is, and how these little hints and foreshadowing are hidden here and there. For example, the singing part in Sukeroku's last Rakugoperformance in ep 11 season 2 also appeared in ep 1 season 1, sang by Konatsu. All these little things are what made this story a true appealing one, and as an Asian, I can really appreciate this whole thing about fading culture, and I am more than glad that people are actually doing something to try to get people back to the theater. \\n\\n\r\nThe Art is another certain Outstanding. Yes there are parts that the characters' faces went wrong or the face is not done \"Perfectly\" at every seconds. But dude, this is an anime, look how pathetic the art of Gintama has gotten, and you will come back and think that Shouwa really is the best. The details to the surrounding, and how they've used different shots and angles to show different emotions, it's actually done fairly good. They've also nailed some little things, like they've changed Yakumo's colts from blue to green and back to blue (black), as an sign of how his skills has been improved, and how he as a person has improved. So yeah, it's certainly outstanding, specially after watching Gintama……\\n\\n\r\nThe characters, OMG. They are the BEST. I've always loved male characters who are not that masculine, and Yakumo really made that femininity into something that's truly beautiful. And the voice actors are just amazing, they are the ones who really brought life to the characters. \\n\r\nIshida has always been my favorite voice actor, and he really nailed this character and all the rakugo pieces (he himself is a big fan of rakugo), and the different pronouns that he choose to use, like atashi instead of watashi, etc. It just made this much more believable and made my enjoy the season much more.\\n\\n\r\n10 and enjoyment and 10 and overall. I don't really cry watching or reading anything, not even when I was watching We Still Don't Know the Name of the Flower We Saw That Day, but this Shouwa got me. S2EP11 by itself worth 10 out of 10, and seeing how both Yakumo and Sukeroku got back to the age where they first met each other, and than grow old together, while Sukeroku stayed at his 30s, Yakumo turned back to that old man. It really is a heartbreaking way to review both seasons all at once, and ep 11 is the single best episode I've seen for many years. \\n\\n\r\nIf I have to pick out something that may not be that good, it'd be that they've cut some very important parts away due to time concern, which is defiantly understandable, but I would also like to see how they've presented it if there's time for maybe one or two more episodes. \\n\\n\r\nSo yeah, really good season, really glad I've watched it, and this is a animate that I would never forget.",
            "date": "2017-03-26T01:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 243562,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JoyaZZZZZZ",
                "username": "JoyaZZZZZZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=243562"
        },
        {
            "content": "Rec for my fellow pretentious humanities degrees hoes out there who say things like \"motif\" and think about the meaning of art and stuff: Showa Genroku Rakugo Shinjuu -- an anime about the traditional Japanese art of storytelling told thru the legacy and drama of one family. Beautifully captures the push and pull between tradition vs innovation, the clash between the classic artistocratic dignity inherent to the art form and its advancement into increasingly open and inclusive modern times. There's probably also an argument in there for a shogunate --> westernization metaphor.\r\nReally really well done considering all the action comes in the form of minimalistone-man performance acts. The director changes up the angles and fully utilizes the talents of the voice actors to evoke the captivating presence of these traditional storytellers. Characters are well-executed and adequately complex -- although they work best as vehicles for the show's themes. You'll see the same personality types crop up again and again with slightly different tweaks, each generation paying tribute to the last while also finding its individual flavor. It's a metaphor for the legacy of rakugo -- and, arguably, all art -- told through charismatic characters, their comings-of-age, friendships, romances, and baby mama drama.",
            "date": "2017-07-22T17:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 253509,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3409429.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/squaredspoon",
                "username": "squaredspoon"
            },
            "url": "https://myanimelist.net/reviews.php?id=253509"
        },
        {
            "content": "Shouwa Genroku Rakugo Shinjuu might be the comfiest anime I've seen in recent memory. Not because it falls into SoL or Iyashikei territory, it doesn't really. It's neat and cozy because of how personal it is. That might be one of the main qualities of this show, it's personal. You meet and get familiar them, their life, their troubles and triumphs. The scale and drama are appropriate. World isn't going to end, nobody's mind is spirling out of control but that makes it all the more grounded and relatable. \r\nArt: not much has changed since the first season. This show is showing what DEEN isreally capable of. Characters are animated in more than one way, a lot of attention is paid to movement, facial expressions and lipsyncing. While there's no insane animation here to boast aside from precisely one scene it's all extremely solid. You wont be seeing up and down beyond occasional rise ups from consistent good level the show stays at. What it doesn't have in extra frames it has in style. S2 is quite a bit more daring at times with use of animation, making some stories become the \"reality\" to depict the degree of immersion rakugoka are capable of. \\n\r\nCharacter designs are going through yet more alterations as we see another time skip. It's really cool to see just how much appearance changes with generational shifts. The common thread here is adherence to period authenticity so no pink drill hair or wearing minimum one pair of functionless belts on each limb. \\n\r\nBackgrounds as good as always. There are a few that are just filtered photos but otherwise love and effort is seen throughout. DEEN paid due attention to environments that are given as much character and life as humans. \\n\\n\r\nSound: no changes from season one. It's same stellar voice acting with plenty of nuance and mix of emotional, instrumental compositions alongside diagetic shamisen music accompanying live and radio performances. \\n\\n\r\nStory: SGRS2 is a worthwhile continuation of the story from the first season. Story about generations of artists, their ambitions and principles. As well a story about rakugo, people who love it, those who make it possible and its place in the life of people. That might come off a bit too grand though. While all of that is present I must remember that this is a personal story on a small scale so all of this is done is a subdued way that doesn't get much in the way of persobal drama but serves as background for them. \\n\r\nIt's incredible how such seemingly simple show can collect together so many themes. As stubborn Kikuhiko thinks he'll die together with the art he and his best friend worked to hard to refine, the next generation works hard to breathe in new life into rakugo, explore new styles, write new material or introduce female performers. It's very much a battle of tradition versus progress. Along side it is the theme of passing on be it life or art. Everything old eventually changes to stay relevant or withers to give way for something new. \\n\r\nMajor focus of the show however are characters. Every event and interactions feels like it has gradual effect and if you show two seasons back to back some of it becomes rather obvious. For example Konatsu, who used to be very opposed to the idea of doing rakugo due to tradition and convincing herself that it's not even worth trying, over time warms up the idea and eventually gives in to her passion, simultaneously becoming a more open and happier person. This show is full of changes like that and they flow carefully from the very start. \\n\\n\r\nFun factor: It's very fun, please watch it!",
            "date": "2017-06-22T08:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 250655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4063579.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Gundroog",
                "username": "Gundroog"
            },
            "url": "https://myanimelist.net/reviews.php?id=250655"
        },
        {
            "content": "This is my first review ever. I didn't think an anime would move me so much to the point of actually writing a review. This anime is truly a breath of fresh air and completely different from your cliche high school romance/shoujo/seinen animes. Josei doesn't even describe this anime. I'd say it's drama, psychological, historical, heartwarming, tragic, bittersweet, cute, and so much more! \r\nThis season continues to develop the already S1 story present. It develops so well providing better art, character development, closure, subtle hints of foreshadowing, emotion-provoking episodes that I couldn't get enough of. The pacing of this anime is just perfect. Not toorushed & not too slow. \\n\\n\r\nCharacters 10/10:\\n\r\nI became so heavily invested in the characters this season. I think I see old people as extremely adorable hence I enjoyed every moment of Kikuhiko. Some people seemed to be annoyed with Yota, but HE IS IRREPLACEABLE. I think because of him the story progressed and allowed the characters to change. He is literally the savior & I am so proud of what he does in the series. He is the reason Rakugo continues to evolve.\\n\\n\r\nEnjoyment 10/10:\\n\r\nThis was my first time being introduced to Rakugo. I thoroughly enjoyed every bit of it. The VA's do a phenomenal job in their roles and I couldn't ask for more. The studio team did an excellent job producing this anime. The flow of the anime, the OPs/EDs for both seasons, the blending of scenes, the music, the ambiguity, the closure, just everything is perfect. \\n\\n\r\nEveryone watch it. Be patient as this anime has a lot of life lessons you can take with you.  Story 10/10",
            "date": "2019-04-25T22:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 307161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7672008.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/namibozu",
                "username": "namibozu"
            },
            "url": "https://myanimelist.net/reviews.php?id=307161"
        },
        {
            "content": "I have mixed feelings with this one, the story is divided in two.\r\nThe first season starts in the present in the 60s to introduce the characters and the main plotline before going like ~40 years backward to a pre WWII Japan still anchored within its traditions where we follow the life of Bon and his bff Shin alias Kikuhiko and Sukeroku while they learn rakugo and love.\r\nIt's my favorite part but I was always wondering \"hey what's going on in the present?\".\r\nThen came the second season which covers the present with Yotarou in a more modern Japan with yakuza stories, a very different atmosphere andI was like \"Yotarou is dumb, I miss Sukeroku\".\\n\r\nSo here's the flaw, it was enjoyable... but not satisfying, it could have been better by interlacing present and past all along.\\n\r\nStill a good way to discover more of Japanese culture via rakugo.",
            "date": "2019-01-04T16:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 298067,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278039.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ganomed",
                "username": "ganomed"
            },
            "url": "https://myanimelist.net/reviews.php?id=298067"
        },
        {
            "content": "A large portion of anime is geared towards a young audience, a crowd that takes to flashy action scenes, big swords, and magical fantasy worlds. There is by no means anything wrong with this, but it makes trying to consume more mature media difficult and limits the appeal to older audiences, be they older teens or adults. Given these circumstances, anime of the ranks of Shouwa Genroku Rakugo Shinjuu are rare to find and treasured when they are discovered. Shows like these deal with complex themes and emotions that simply cannot be understood without a certain degree of either experience or knowledge. As such, it'sall the more disappointing when the ending of anime underestimates its audience and spoon-feeds it low-hanging fruit in the form of cheesy epilogues and random jumps into shounen-esque genres.\\n\\n\r\nI largely agree with most of the other reviews - Rakugo Shinjuu is an amazing anime. I wholeheartedly gave the first season a 10, and consider it among my favorite shows. The second season does everything the first season did well, EXCEPT, and this is where I strongly deviate from the norm, the ending. I'll skip complimenting character development, sound, animation, and the rest, because everyone seems to be more or less at a consensus that on the whole the series is fantastic. \\n\\n\r\nGiven that my main problem with the anime is its ending, it's hard for me to elaborate without giving some pretty major spoilers. I'll try, but excuse any excessive vaguery. The first ten episodes are great and deserve every ounce of praise that they receive. If the it had ended there everything would have been perfect. Conflicts would have been resolved, characters would have been sufficiently developed, and the viewer would be more than content with the direction of the show. The next two episodes, however, do two things that totally ruin the plot: the first introduces a fantasy element that had no place in the genre, and the second has an epilogue in a very \"where are they know?\" type fashion. \\n\\n\r\nSuch extensions of endings are common in shounen anime. Take two of the largest franchises in anime history: Naruto and Bleach. Naruto was easily 100 chapters longer than it had to be, purely for the sake of giving younger fans more of what they wanted: cool battles with new powers and enemies. Bleach had a great potential ending point with the Aizen arc, but it extended into two entirely new plotlines to make more money and milk the shounen machine. Obviously Rakugo Shinjuu's two episodes pale in comparison to the magnitude of those examples, but they serve the same purpose. \\n\\n\r\nI'm in the vein of viewers that believes the ending of an anime (or any story for that matter) is paramount to its quality, and unfortunately Rakugo Shinjuu falls into the \\n\r\ntrap of the anime industry, mandating sub-par endings that leave a sour taste in my mouth. I was legitimately angry when I watched episode 11 and 12, because up till then I was convinced that I was watching a masterpiece that would be my favorite of the year, if not all time. While I still greatly appreciate the mastery and beauty that was season one and the first 10 episodes of season two, the ending really blew it. Perhaps I'm being too harsh, but if anything, that's because of the high expectations the show set for itself. \\n",
            "date": "2017-12-17T22:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 265473,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5185988.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/arjunshreekumar",
                "username": "arjunshreekumar"
            },
            "url": "https://myanimelist.net/reviews.php?id=265473"
        },
        {
            "content": "The first season of this anime, for me, is incredible (my best anime of 2016).And now, here is the second, what is really good and will make me miss for a long time. It's just a masterpiece. Yeah, masterpiece. \r\n STORY: 10/10\r\nA slow, flawless storyline. Studio Deen just let us see a brilliant story. Someones said is boring and maybe too simple, but in my opinion, that simple things make me feels good. A lightly sad, but all so nice. That's why this series are pretty high on the board. Even the shocking plot twists in the second half makes their story better and makeviewers thinking a bit. Just watch it , it won't make you dissapointed at any piece of thing\\n\\n\r\nART: 9/10\\n\r\nNothing special, but for me it's just great.\\n\\n\r\nSOUND: 10/10\\n\r\nBoth opening and ending are really emotional. If the opening are showing a bit of sad and emptiness, the ending just make you feel comfortable. The best ending I have listened to from 2 years\\n\\n\r\nCHARACTER: 10/10\\n\r\nYeah, you will see how great is it at the characters developping.From Yakumo, Yotarou, Konatsu or even Shinnosuke and the mafia boss. Every character has their-own great interaction besides with their nice voice actors/actress. Slowly, it shows you each character personality and their relationship, but didn't make the whole story to become a confusing one. It's so good that just watch the characters developping is make you amazed\\n\\n\r\nENJOYMENT: 10/10\\n\\n\r\nOVERALL:10/10\\n\r\nRepeat one more time. this anime just a masterpiece, in anyway I could think about. This is probably my best anime of 2017 and one of the most, no , the best Drama/Josei anime ever. There will be a long time to have an anime reach this place in my heart\\n",
            "date": "2017-07-26T21:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 253909,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6421203.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Aki_Namikawa",
                "username": "Aki_Namikawa"
            },
            "url": "https://myanimelist.net/reviews.php?id=253909"
        },
        {
            "content": "I watched season 1 a month or so before season 2 started on a whim, I like to watch anime with mundane sounding premises because they are forced to not rely on their premise and instead have a great plot and great characters. I thought the original was really good (I gave it a 9) but I didn't really care about the parts that weren't flashbacks and didn't like Yotaro, however I was immediately in love with the \"piece\" known as \"Shinigami\". Season 2 has no less than 3 performances of \r\nShinigami, it sounds like it would get old but I found it extremely entertainingbecause unlike what people claim in Yuri On Ice I actually saw and heard the slight differences in the performances (yotaro performs it and his mentor performs it) and there was always plot relevance involving the performance.\\n\\n\r\nAs mentioned earlier I didn't like Yotaro in season 1 but in this season because of some events in the story I wound up liking him even though he's truly a Yotaro still.\\n\\n\r\nOverall if you liked the remaining characters from season 1 and you liked season 1 you'll probably like this even more.",
            "date": "2017-05-14T15:18:00+00:00",
            "helpful_count": 1,
            "mal_id": 247675,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Roshlev",
                "username": "Roshlev"
            },
            "url": "https://myanimelist.net/reviews.php?id=247675"
        },
        {
            "content": "STORY: Season two lets us continue where we have left off. Yakumo still has a death wish of wanting to die and letting rakugo to go down with him too. There is also a lot of improvement with Yotaru (now known as Sukerou). This season focuses a lot of the fate of Yakumo and Yotaru with the success of his career.\r\nCHARACTERS:\r\nYakumo: Guardian of Konatsu, Sensei of Yotaru, and well-known story-teller. He is a senior and part of the 7th generation. He is somewhat monotoned and is very strict.\r\nYotaru: Fun-loving, care-less storyteller. His rakugo skills are improving and is sweet and kind (especially to Konatsu). Formergang member has reformed into a story-teller who wants to inherit Sukeroku's name.\\n\\n\r\nOVERALL: With these two seasons, this is very profound -- with their rakugos and origins of their past. Seeing the Japanese culture in a different perspect with Rakugo is very interesting. Plus it has really influenced me to go check out the shows one day (if possible).",
            "date": "2017-04-18T21:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 245819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=245819"
        }
    ]
]