[
    [
        {
            "content": "Yozakura Quartet is an extremely odd show, and you'll be forgiven for scratching your head and wondering what the hell was going on come the end of the show.\r\nThe series began life as a manga by Suzuhito Yasuda that was published by Kodansha in Japan, and by Del Rey in the US. Prior to the manga, Suzuhito worked as the character designer on Kuwashima Yoshikazu's series Kamisama Kazoku, and Yozakura Quartet is his first solo work.\r\nThe anime was directed by Matsuo Kou (Kure-nai, Rozen Maiden, Red Garden, Dead Girls), and shows some of the trademarks of Matsuo's directorial skill.\r\nThe story is very similar to thatof Rosario + Vampire, in that a human boy is living in a town with Youkai (vampires, oni, etc,), however it differs from R+V in numerous ways, not the least of which is the fact that the human boy, Hizumi Akina, is not helpless, and actually has a position of authority within the town. Akina works on behalf of the town's elders as chief of the &quot;Youkai Life Consulation Office&quot; with Nanami Ao (a satori who has the ability to read minds), and Isone Kotoha (a hanyou, or half human-youkai). Together with Akina's childhood friend Yarisakura Hime, who is the &quot;mayor&quot; of the town and a descendant of a dragon, the four manage the everyday needs of the town, and work to protect it's residents from youkai who have gone out of control.\\n\\n\r\nThe big problem with this show is that, even though it had quite a lot of potential, the story jumps around far too much and nothing is ever really explained. Now, a show like Aria can get away with not explaining things, but a show like this needs some solid reasons for the actions of it's protagonists. The most the audience is given are hints though, which may lead you to believe that an explanation is forthcoming (prepare to be disappointed though). The main antagonist for example, Enjin, has taken over the body of Akina and Hime's best friend Gin, however there is very little explanation as to who Enjin is, or about why he chose Gin. Little is known about the friendship between Akina, Hime and Gin, even though this plays a direct role in confrontations with Enjin.\\n\\n\r\nThe animation for Yozakura Quartet is extremely well done. The animation is smooth, even during the fight scenes, and the CG that is in the show is oft times seamless and indistinguishable from the normal animation. The characters in Yozakura Quartet are reflective of the fact that Suzuhito worked on Kamisama Kazoku as the influence from that manga/anime is very clear, especially in the faces.\\n\\n\r\nThe sound is actually very impressive on the whole. Director Matsuo Kou has very clearly drawn on his experience with Kure-nai, as the VAs had recorded their lines prior to the show being animated. This means that conversations and arguments are often a lot more complex than other anime, and brings a sense of realism to the characters that is often missing. The effects are also of a very high standard, and can sometimes set the tone of a scene without the need for visuals. \\n\\n\r\nMy one gripe with the sound, and the reason I didn't give this section a higher score, is the fact that although the music was pretty decent on the whole, there was too much of it. There are many scenes in the show where the same track plays, almost to the point where it becomes annoying. This track is played during many dramatic or tense moments, and often ruins the mood of the scene as it doesn't really fit with the characters or actions/events.\\n\\n\r\nThe characters are fairly average on the whole. There are no original or excellent characters in this show, and many seem to fall into one stereotype or another. The one character who annoyed me the most was Akina, especially where Enjin is concerned. It was disappointing to see that there was little to no growth for almost all the characters, even Akina and Hime, and that Akina was the stereottypical male lead who can't make a decision on his own.\\n\\n\r\nThat said, the show is enjoyable to a certain degree. I enjoyed watching it for the most part, but not as much as I was hoping. Because of it's inability to stick to the point, and the wishy-washy nature of it's characters, I found this show somewhat disappointing. I have given it a good rating only on the basis of it's animation and sound (which would have been higher if the show hadn't played that damn song all the time).\\n\\n\r\nFans of Rosario + Vampire or Kure-nai may enjoy this show, but I wouldn't recommend this to anyone who wants a strong story with great characters.\\n\\n\r\nIt's truly a shame that a show with such potential should be let down in this way.",
            "date": "2009-01-07T13:48:00+00:00",
            "helpful_count": 177,
            "mal_id": 11220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=11220"
        },
        {
            "content": "There are few times when an avid anime fan goes into something expecting so much and gets so little in return. Yozakura Quartet happens to be one such example. Based on a much more highly acclaimed manga, the first episode starts off with all one could expect from a show that could deliver. Interesting, well-drawn characters centered around at least a moderately unique plotline. The music and sound quality are top notch and there are even early introductions to romance possibilities.\r\nHowever, as some stories tend to do, that&rsquo;s when the train leaves the tracks. Yozakura Quartet is about a group of young people (there are5 of them actually, and originally 6 so the title really makes no sense) who protect a town that harbors both humans and Youkai. An evil Youkai, who has possessed the body of the best friend of two of the members, is out to seek the destruction of the town and bring about an era of all-Youkai rule, essentially snuffing out humans.\\n\\n\r\nThe first few episodes start slowly and then immediately we&rsquo;re introduced to Enjin, the protagonist, who it turns out is far stronger than they. There&rsquo;s no real room for development or explanation of how they&rsquo;re related and it seemed to me that maybe this should have been a 24 episode series. But for some inexplicable reason, the story decides to stick with random fights throughout the rest of the series, leading to mindless, repetitious dialogue that we could have seen coming using &ldquo;fill-in-the-blanks.&rdquo; The heroes never grow in strength as the finale comes either, so the ending is an extreme example of dues ex machina, which is like a death warrant for any anime anyway. There are too many characters to fill the time slots, the relationships between the characters don&rsquo;t grow an inch and several of the plot lines are never resolved. \\n\\n\r\nThere were some good things. As said before, the music was excellent and the ladies were very nice to look at &ndash; they were anything but bland or clich&eacute;d. The villain and his sidekick were diabolical and deserved a better defeat. And the art really was stunning in several points of the anime.\\n\\n\r\nAll in all, though, this was an anime that was a disappointment far greater than a regular bad show, because it had potential and went nowhere.\\n",
            "date": "2008-12-23T16:00:00+00:00",
            "helpful_count": 75,
            "mal_id": 10600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85600.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mcjazzman32",
                "username": "mcjazzman32"
            },
            "url": "https://myanimelist.net/reviews.php?id=10600"
        },
        {
            "content": "I'm writing this review, in part, to respond to the other reviews. I felt strongly that the number ratings given do not correspond with what was said, and that they were unnecessarily gentle. This series is 4(Decent) at best. \r\nAs to the story, it had a lot of potential, but none of that was realized. It ended up jumping around to random battles and poorly scripted conversations that seemed to have something to do with a general movement of plot, but in actuality did not. Lots of things happen in the plot, but the plot parts are so disjointed that no real story emerges, atleast no story that can stand up beyond a vague general description of the overall arc. Very poor, indeed.\\n\\n\r\nThe art is nothing special, and it is not at all bad. The battles scenes are very average, with fighters swinging around weapons and throwing colored light balls, but the actual feel of legitimate combat is lacking. The character designs are, for the most part, interesting. If there had been actual character development, it would have been nice. \\n\\n\r\nThe most abysmal part of the show was the opening. From an artistic perspective, it sucked quite badly. It didn't match anything in the show, thematic, stylistically, and was overall incongruous and lacking in substance. Whoever made it definitely has a fetish for strangely colored shapes and Adobe Aftereffects.\\n\\n\r\nIt's unfortunately that the opening was so bad, as the song chosen for it was not. Furthermore, the sound design for the rest was very good. Nothing ground breaking, but the Foley was well done enough to give the situations occurring some sense of depth, and the background music supported well without intruding on the story. That said, the music did not elevate the viewer/listener at all, as it can sometimes in masterpieces(Gai Rei Zero being an excellent example), but it didn't do anything wrong, which was good enough. \\n\\n\r\nAs you can probably tell, I hated watching this show. The first three episodes were fine, and offered the possibility of great potential in the future. However, things went downhill from there, until they fell off a bloody cliff into the bottomless chasm (i.e. episode 8) of being a waste of time. By 10, I was watching it on fast foreword, just to finish. I think, however, the most frustrating thing about the show was that the story made no apologies or real consequences for stupid decisions on the part of the protagonists. I mean, literally handing the bad guys the chance at world destruction is a mistake in my book. Hopefully that's not too much of a spoiler, but since this is such a bad show anyway, I doubt it will ruin your lack of enjoyment anymore than just watching can.\\n\\n\r\nSo yea, there were a few good aspects, but that like pointing out that the figure head is nice on a ship with no rudder and giant gaping holes in the hull. If the car is a rust bucket, you don't rate it average just because the windshield was recently cleaned. So yeah, I agree with a lot of what the other reviewers said, but I disagree strongly with their number ratings.",
            "date": "2009-01-08T14:50:00+00:00",
            "helpful_count": 39,
            "mal_id": 11257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111616.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/daemonblade1229",
                "username": "daemonblade1229"
            },
            "url": "https://myanimelist.net/reviews.php?id=11257"
        },
        {
            "content": "Yozakura Quartet was only a twelve episode series. That's not a lot of episodes to go wrong with. A basic plot and story can easily be done in twelve episodes. Characters can be fleshed out in twelves episodes. Yozakura Quartet did not manage to do any of that.\r\nStory - 3\r\nThe first few episodes showed how much potential Yozakura Quartet had. They were interesting and hooked me instantly. The rest of the show continued to mock me as if saying I was a fool for having any hope in the plot. The characters made stupid decisions and many plot points never made sense or were poorlyexplained. Do not be tricked by the strong beginning.\\n\\n\r\nAnimation - 8\\n\\n\r\nThe animation was pretty good. The character designs were wonderfully done, and all the fight scenes were fun to watch, if taken out of context. The plot seriously hindered my enjoyment of the fights, unfortunately.\\n\\n\r\nSound - 7\\n\\n\r\nThe OP/ED themes were okay, the actual score was nothing special. I really didn't pay much attention to the score, which means at least it didn't bother me. The seiyū's on the other hand were too good for this show. The seiyū's for Chiaki Shinichi (Nodame Cantabile), Shinku (Rozen Maiden), Suigintou (Rozen Maiden), Sebastian Michaelis (Kuroshitsuji), Nagi (Kannagi), Yin (Darker than BLACK), and many more were wasted voicing dull, irritating characters.\\n\\n\r\nCharacter - 5\\n\\n\r\nThe characters started out okay, but slowly a serious case of bad characterization appeared. By the end of the show, I could only stand to watch around two or three characters. The rest made multiple stupid decisions and contradicted their behaviour from before.\\n\\n\r\nEnjoyment - 3\\n\\n\r\nPretty animation and nice sound will go nowhere if the story fails and you want to strangle to the main leads. The story was a giant letdown, but every week I hoped it would get better. But it didn't.\\n\\n\r\nOverall - 5\\n\\n\r\nSo much potential, so little results. Yozakura Quartet was mediocre to core. I didn't exactly hate it - I was disappointed by it. Please, don't waste your time with this anime when there are plenty of others (Kamisama Kazoku, for example, is by the same author and is so much better) that aren't such a letdown.",
            "date": "2009-02-22T13:56:00+00:00",
            "helpful_count": 22,
            "mal_id": 12660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/adamantine",
                "username": "adamantine"
            },
            "url": "https://myanimelist.net/reviews.php?id=12660"
        },
        {
            "content": "Hmmm...Where to begin? Well, Yozakura Quartet, I could say, falls to the so - so level for me.It's not very bad, but not very good neither. If you have free time, then try watching it, but if you're kinda busy and only goes for the must - type then, it's okay to skip it. You could live your life to the fullest even without seeing this. \r\nWell, I don't mean to bash the anime. I had some little pretty moments actually. hmm..little moments...hehe...I don't know. I like its concept of 'youkai', it always remind me of my Claymore days and Claire -chan..hehe..but anyways, it's kindacheesy. \\n\\n\r\nHowever, I don't think the story has been rushed. It actually has a nice flow for the 12 - episode type. Although I might say, great heroism and character improvement plus coolness factor are lacking in this one. For me, the characters are blah, although they are actually very likable. For example, the main charac, Akina, I am so rooting for him. I want to him to be the sole savior of the Sakurashin Town, and wishing him to be a super \"saiyan\" (read: super powers) later in the series, but apparently, he is just a typical human being who is just gifted with a curse which runs in his family,and can only do one thing...tantananannnnn...cleanse youkai. He was overshadowed by the next not-even-cool-but-I-like-her character..\\n\\n\r\n.. Hime. She so reminds of Yomi-onee-san from Ga Rei Zero. They are both long hair and beautiful. They are both skilled warriors. The thing that differentiates them is the oozing coolness factor of my greatest onee-san! Yeah boy!!Hime doesn't even have the slightest of it, well, I am so horrible bec. I am comparing the two which should not be the case since they are not of same situation..Well, whatever, don't mind me... Hime has the greatest role in saving her city but I didn't feel much of it that's why even though I like her, she won't make it to the cut.\\n\\n\r\nWith the other characters, let's say..hmmmm...passing marks for them.\\n\\n\r\nWith the OP & ED, passing also..but they do not make a recall to my ears..except for that particular BGM,,the one with the english lyrics? Hmm..I'm not sure..hehe..\\n\\n\r\nOverall, I think this anime would only be on my passing level although I do not regret seeing this. I believe, we have different tastes to choose the good and the bad. So it's for you, readers, to decide! (Hmmm...I would be so touched if anyone would just read this..hehe...)\\n\\n\\n\r\nFrom someone-who-already-moved on-to-a-new-anime-series,\\n\r\nMe\\n\\n\\n\r\n^_^\\n",
            "date": "2009-10-21T06:32:00+00:00",
            "helpful_count": 10,
            "mal_id": 19890,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119010.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/docalion",
                "username": "docalion"
            },
            "url": "https://myanimelist.net/reviews.php?id=19890"
        },
        {
            "content": "Yozakura Quartet is focused on a consultation office of demons and humans in a consultation office who exist to protect a town where demons and humans coexist against evil demonic threats, this series dealing with evil demon Enjun trying to unleash the evil demons that have been sealed by the group. Many of the episodes in the first half of the series serve to introduce the members of the consultation office, their backgrounds before the start of the series and their regular duties throughout the town. They are fleshed out enough where you could care for them as characters, but these episodes lack much inthe way of intrigue or tension beyond hints of Enjun's incoming arrival as they are mostly light-hearted and sort of follow a slice-of-life style plot.\\n\\n\r\nThe second half of the series is where things pick up in Yozakura's storytelling when Enjun makes his presence felt on the town and the effects of his actions effect the populace. An added twist to the developments come from a revelation where Enjun is possessing the body of someone close to several members of the consultation office that add some interesting tension into the series as these characters feel conflicted over how to approach the situation throughout much of the show's second half. While the storyline does go for a black-and-white moral approach, Enjun does get enough dimension to his character to show how manipulative his character can be with the body he possesses and the strong belief that he has for his actions in trying to free the demons that were sealed.\\n\\n\r\nEven with the solid second half though, Yozakura Quartet does have its issues. I questioned the point of the land gods' presence in this series as they couldn't do anything to assist the consultation group due to \"rules\" they had to follow and they didn't get much in the way of depth. Enjun's partner in his plans also lacks much in the way of dimension and depth beyond serving as major obstacle in the efforts of the consultation group to halt Enjun's plans and the series fails to explain how Enjun was freed from being sealed. Also, the ending for this felt a bit too anti-climatic considering how difficult it was for the group to deal with Enjun throughout of the course of the series beyond overcoming their hesitance at taking him down.\\n\\n\r\nThe visual presentation to this series is rather average with bright colors and solid, though rough, levels of detail implemented in the designs of characters and scenery, though nowhere as visually impressive as TV titles like Code Geass R2 and Ga-Rei: Zero that aired that year. Action scenes normally make use of reused frames and speed stripes as shortcuts, making them not so impressive despite the unique abilities that several characters in this series have.\\n\\n\r\nOverall, Yozakura Quartet is a somewhat solid series that does flesh out the members of the consultation agency enough where you know of their characters and backgrounds and has an engaging second half coming from the group's efforts to thwart Enjun's plans. However, the series does suffer in that it doesn't bother to flesh out some major aspects to its plot and the questionable relevance of some characters even being in the series. It's not a masterpiece by any means, but still worth a look if you're looking for something that can be quickly breezed through.",
            "date": "2013-08-25T08:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 111153,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=111153"
        },
        {
            "content": "There are anime which are loyal to their original source. And then there's this anime: Yozakura quartet. A show with so many potential and it all went down the drain. Let me explain why this show was such a waste of time.\r\nFirst, the plot. There are plot holes EVERYWHERE! From the first episode, we are only introduced to the city, not the characters. So from the first episode alone, I was left utterly confused. It just got worse as the episodes go on. There were literally plot holes in every scene, leaving me with nothing to work on. I loved the manga, but this adaptationjust killed me.\\n\\n\r\nDon't even get me started on the characters. It wasn't enough that they weren't introduced in the earlier episodes. No, they had to be downright useless! Instead of doing something that should've resolved the conflict, they only made it worse by not resolving it sooner! My hatred for the main characters only made me want to cheer for the bad guy.\\n\\n\r\nAnd worst of all, the BGM. It did not blend well with the atmosphere of the series. For a show which deals with japanese folklore, English songs aren't the best choice. And I'm very specific when it comes to music. This is possibly the worst BGM to be used for this series.\\n\\n\r\nTo sum it all up, it wasn't enjoyable. Not one bit. To be honest, I only watched it for the sake of finishing it. I absolutely do not recommend this adaptation to anyone. You'll just end up wasting your time. It sure wasted quarters of my time.",
            "date": "2016-07-16T03:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 224152,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=224152"
        },
        {
            "content": "After watching the 12 episodes of Yozakura Quartet I can say with full confidence that this anime was a huge disappointment and a waste of time.\r\nTo keep this as brief as possible the story itself was filled with many plot holes with no explanation given and no back story was hardly given to explain how the characters developed into who they are now. \r\nThe characters didn't stand out and just seemed to be bland with no unique character-trait that made them stand out or memorable.\r\nThe animation was pretty good for when it was animated and the music DURING the show was great and the soundswere not bad. However the opening and ending to the episodes didn't really match at all just overall was not good.\\n\\n\r\nThe main characters of this show also show to be naive in the extreme even given their position and how long they have been doing so. Many poor decisions were made with what seems to be very little punishment for the highly stupid decisions of the MCs and in the end leaves a bitter taste in the mouth as you walk away from it knowing that the show should have made an attempt at showing \"remorse\" their stupidity. \\n\\n\r\nOverall this show was a waste of time and I forced myself to watch half of it because it was so uninteresting.",
            "date": "2019-03-27T14:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 304505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/FrozYn",
                "username": "FrozYn"
            },
            "url": "https://myanimelist.net/reviews.php?id=304505"
        },
        {
            "content": "Now ill say it first, This anime is the type of anime that most adults may find boring and will hardly be enjoyed. \r\nThis anime is really lacking and it really needs a season 2 or more. I may sound negative but its true. But if your looking for a temporary enjoyment then this show is good for you. This is one of my favorite anime and that is due to complete Bias-ness. Personally I can't find anything special about the anime except that it contains one of my top coolest scenes. I will be biased and reasonable at the same time in this review.\r\nMy#1 reason why I like this anime is Akina. Akina at first look can be considered as a generic protagonist. But one thing that most people fail to notice is that Hime is the Main protagonist of the anime/ or atleast share the spot with Akina. You see the story may look like as it revolves with Akina in the anime but what is actually happening here is that everything about Akina also revolves around Hime, or you could almost say that Akina's story revolves around Hime. No not because Hime does the fighting but because Akina's development as a character from his childhood was basically for Hime. \\n\\n\r\nMy #2 reason for loving the anime so much is Hime ofcourse. Her character may seem annoying at first for some people. Well not for me because I don't judge characters after seeing 3 or four episodes. But Okay looking at Hime she can look irresponsible most of the times but really who is the first one to jump infront of a train when its about to hit the city. Its Hime ofcourse, she really pushes herself for other people and I find that attractive to a character. The other thing I absolutely liked about her is her relationship with Akina and how cute she is around him. Imagine a tomboyish lazy girl that blooms around her crush its too cute. \\n\\n\r\nThe other characters was really interesting too and how the story plays around them was somewhat enjoyable in my opinion.\\n\\n\r\nIn short this anime for me falls in my category as an Anime where you pay attention to the characters rather than the story. Its the type of anime where you won't enjoy and Like it if you don't have a favorite character that you wanna see more.  \\n\r\n(Bit of spoiler) The anime needs season 2 to be complete because it gets more interesting further in the manga and It gives more action than the anime",
            "date": "2018-09-19T12:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 289428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7348016.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LazyBoy-kun",
                "username": "LazyBoy-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=289428"
        },
        {
            "content": "I dint watch the anime in full... cause i drop it at episode 10... all i can say is... the story was really bad... i ended up complaining to my self... why am i torturing myself watching this anime.... \r\nThe character is soo cliche'... the main character??? Who?? Akina or Hime?? what is their relationship??? \r\nwho and how and why were the worker in the central are all school girls???\r\nthe never ending complaining from the villagers... and only cause trouble???\r\nThey keep saying \"Do your job!\" what is the job???\r\nThe first episode has a lot of preminiton for a good 12 episode anime... Which goes dowmthe hill after just 4 episode...\\n\\n\r\nFor once the villain seems very weak compare to Hime... But that battle scene was horribly written... \\n\\n\r\nin the end... im sorry for those who like this \"Show\" but... im not fisnishing this series completely.... not with that horrible writting...",
            "date": "2016-09-04T07:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 228265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5084688.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Thegret_Miew",
                "username": "Thegret_Miew"
            },
            "url": "https://myanimelist.net/reviews.php?id=228265"
        },
        {
            "content": "About 1% of adapations surpass their source material; this anime however, falls to the 99% that fail. Maybe if I had not read the original manga beforehand, I may have reviewed this more favorably, but alas that is not the case. I was mildly excited to find out that there was an anime of this series, but was apprehensive since most anime adaptations are mediocre. I decided to drop this series 75% through the first episode, cringing at the first 10 minutes where they basically spoon feed you plot elements that took several chapters to flesh out in the source material. Throughout the episode, moreand more liberties come to fruition, and the cherry on top was a certain undead youkai's sudden hatred for humans. My suggestion is that if you're new to the series, start off with the anime, then move on to the manga; or just start with the manga and skip the anime altogether.",
            "date": "2010-07-12T10:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 28305,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/263085.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/no51",
                "username": "no51"
            },
            "url": "https://myanimelist.net/reviews.php?id=28305"
        },
        {
            "content": "Alright first off, the story is just about how four members of Hiizumi's Everyday-life Consultation Office live. They live in a world full of you could say demons or monsters. Anyways the 4 members to protect their town from the bad demons and keep the good ones together in a healthy community.A very useful tactic Akina uses is a power where he uses \"tuning\" to rid of the bad youkai that cause chaos in the ir town, which helps some problems with the bad youkai.\r\nWhen You first start watching the anime it seems very interesting and you really want to watch more. Now the thingis when you watch more it starts to get very boring and leaves the person bored out of their mind. Mainly every episode does the same thing  they talk excessivley about sometimes very pointless or uninteresting, or running around trying to defeat a bad youkai. Also randomly out of know where you learn of this guy that everyone thinks is this guy named Gin, Now a thing I noticed is, why didn't they discuss this character earlier? They make it seem like you already know who this guy is and all of sudden its some sort of bad guy?The music is fairly decent in this anime. The opening is quite enjoyable to listen to and sort of catchy. Same for the ending.The characters seem to be quite bland and none of them seem like a character you would want to add to your favorites list. They are so much like typical characters. Either they're nice,friendly and cute or they are just the character thats always pissed and thinks they're better than everybody and it makes it quite boring.In general this anime lacked interest to me and you may only want to watch this if you absolutley have nothing to watch.",
            "date": "2010-06-15T19:56:00+00:00",
            "helpful_count": 0,
            "mal_id": 27200,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288882.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/UltySo",
                "username": "UltySo"
            },
            "url": "https://myanimelist.net/reviews.php?id=27200"
        }
    ],
    [
        {
            "content": "Yozakura Quartet is an extremely odd show, and you'll be forgiven for scratching your head and wondering what the hell was going on come the end of the show.\r\nThe series began life as a manga by Suzuhito Yasuda that was published by Kodansha in Japan, and by Del Rey in the US. Prior to the manga, Suzuhito worked as the character designer on Kuwashima Yoshikazu's series Kamisama Kazoku, and Yozakura Quartet is his first solo work.\r\nThe anime was directed by Matsuo Kou (Kure-nai, Rozen Maiden, Red Garden, Dead Girls), and shows some of the trademarks of Matsuo's directorial skill.\r\nThe story is very similar to thatof Rosario + Vampire, in that a human boy is living in a town with Youkai (vampires, oni, etc,), however it differs from R+V in numerous ways, not the least of which is the fact that the human boy, Hizumi Akina, is not helpless, and actually has a position of authority within the town. Akina works on behalf of the town's elders as chief of the &quot;Youkai Life Consulation Office&quot; with Nanami Ao (a satori who has the ability to read minds), and Isone Kotoha (a hanyou, or half human-youkai). Together with Akina's childhood friend Yarisakura Hime, who is the &quot;mayor&quot; of the town and a descendant of a dragon, the four manage the everyday needs of the town, and work to protect it's residents from youkai who have gone out of control.\\n\\n\r\nThe big problem with this show is that, even though it had quite a lot of potential, the story jumps around far too much and nothing is ever really explained. Now, a show like Aria can get away with not explaining things, but a show like this needs some solid reasons for the actions of it's protagonists. The most the audience is given are hints though, which may lead you to believe that an explanation is forthcoming (prepare to be disappointed though). The main antagonist for example, Enjin, has taken over the body of Akina and Hime's best friend Gin, however there is very little explanation as to who Enjin is, or about why he chose Gin. Little is known about the friendship between Akina, Hime and Gin, even though this plays a direct role in confrontations with Enjin.\\n\\n\r\nThe animation for Yozakura Quartet is extremely well done. The animation is smooth, even during the fight scenes, and the CG that is in the show is oft times seamless and indistinguishable from the normal animation. The characters in Yozakura Quartet are reflective of the fact that Suzuhito worked on Kamisama Kazoku as the influence from that manga/anime is very clear, especially in the faces.\\n\\n\r\nThe sound is actually very impressive on the whole. Director Matsuo Kou has very clearly drawn on his experience with Kure-nai, as the VAs had recorded their lines prior to the show being animated. This means that conversations and arguments are often a lot more complex than other anime, and brings a sense of realism to the characters that is often missing. The effects are also of a very high standard, and can sometimes set the tone of a scene without the need for visuals. \\n\\n\r\nMy one gripe with the sound, and the reason I didn't give this section a higher score, is the fact that although the music was pretty decent on the whole, there was too much of it. There are many scenes in the show where the same track plays, almost to the point where it becomes annoying. This track is played during many dramatic or tense moments, and often ruins the mood of the scene as it doesn't really fit with the characters or actions/events.\\n\\n\r\nThe characters are fairly average on the whole. There are no original or excellent characters in this show, and many seem to fall into one stereotype or another. The one character who annoyed me the most was Akina, especially where Enjin is concerned. It was disappointing to see that there was little to no growth for almost all the characters, even Akina and Hime, and that Akina was the stereottypical male lead who can't make a decision on his own.\\n\\n\r\nThat said, the show is enjoyable to a certain degree. I enjoyed watching it for the most part, but not as much as I was hoping. Because of it's inability to stick to the point, and the wishy-washy nature of it's characters, I found this show somewhat disappointing. I have given it a good rating only on the basis of it's animation and sound (which would have been higher if the show hadn't played that damn song all the time).\\n\\n\r\nFans of Rosario + Vampire or Kure-nai may enjoy this show, but I wouldn't recommend this to anyone who wants a strong story with great characters.\\n\\n\r\nIt's truly a shame that a show with such potential should be let down in this way.",
            "date": "2009-01-07T13:48:00+00:00",
            "helpful_count": 177,
            "mal_id": 11220,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19870.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Archaeon",
                "username": "Archaeon"
            },
            "url": "https://myanimelist.net/reviews.php?id=11220"
        },
        {
            "content": "There are few times when an avid anime fan goes into something expecting so much and gets so little in return. Yozakura Quartet happens to be one such example. Based on a much more highly acclaimed manga, the first episode starts off with all one could expect from a show that could deliver. Interesting, well-drawn characters centered around at least a moderately unique plotline. The music and sound quality are top notch and there are even early introductions to romance possibilities.\r\nHowever, as some stories tend to do, that&rsquo;s when the train leaves the tracks. Yozakura Quartet is about a group of young people (there are5 of them actually, and originally 6 so the title really makes no sense) who protect a town that harbors both humans and Youkai. An evil Youkai, who has possessed the body of the best friend of two of the members, is out to seek the destruction of the town and bring about an era of all-Youkai rule, essentially snuffing out humans.\\n\\n\r\nThe first few episodes start slowly and then immediately we&rsquo;re introduced to Enjin, the protagonist, who it turns out is far stronger than they. There&rsquo;s no real room for development or explanation of how they&rsquo;re related and it seemed to me that maybe this should have been a 24 episode series. But for some inexplicable reason, the story decides to stick with random fights throughout the rest of the series, leading to mindless, repetitious dialogue that we could have seen coming using &ldquo;fill-in-the-blanks.&rdquo; The heroes never grow in strength as the finale comes either, so the ending is an extreme example of dues ex machina, which is like a death warrant for any anime anyway. There are too many characters to fill the time slots, the relationships between the characters don&rsquo;t grow an inch and several of the plot lines are never resolved. \\n\\n\r\nThere were some good things. As said before, the music was excellent and the ladies were very nice to look at &ndash; they were anything but bland or clich&eacute;d. The villain and his sidekick were diabolical and deserved a better defeat. And the art really was stunning in several points of the anime.\\n\\n\r\nAll in all, though, this was an anime that was a disappointment far greater than a regular bad show, because it had potential and went nowhere.\\n",
            "date": "2008-12-23T16:00:00+00:00",
            "helpful_count": 75,
            "mal_id": 10600,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85600.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/mcjazzman32",
                "username": "mcjazzman32"
            },
            "url": "https://myanimelist.net/reviews.php?id=10600"
        },
        {
            "content": "I'm writing this review, in part, to respond to the other reviews. I felt strongly that the number ratings given do not correspond with what was said, and that they were unnecessarily gentle. This series is 4(Decent) at best. \r\nAs to the story, it had a lot of potential, but none of that was realized. It ended up jumping around to random battles and poorly scripted conversations that seemed to have something to do with a general movement of plot, but in actuality did not. Lots of things happen in the plot, but the plot parts are so disjointed that no real story emerges, atleast no story that can stand up beyond a vague general description of the overall arc. Very poor, indeed.\\n\\n\r\nThe art is nothing special, and it is not at all bad. The battles scenes are very average, with fighters swinging around weapons and throwing colored light balls, but the actual feel of legitimate combat is lacking. The character designs are, for the most part, interesting. If there had been actual character development, it would have been nice. \\n\\n\r\nThe most abysmal part of the show was the opening. From an artistic perspective, it sucked quite badly. It didn't match anything in the show, thematic, stylistically, and was overall incongruous and lacking in substance. Whoever made it definitely has a fetish for strangely colored shapes and Adobe Aftereffects.\\n\\n\r\nIt's unfortunately that the opening was so bad, as the song chosen for it was not. Furthermore, the sound design for the rest was very good. Nothing ground breaking, but the Foley was well done enough to give the situations occurring some sense of depth, and the background music supported well without intruding on the story. That said, the music did not elevate the viewer/listener at all, as it can sometimes in masterpieces(Gai Rei Zero being an excellent example), but it didn't do anything wrong, which was good enough. \\n\\n\r\nAs you can probably tell, I hated watching this show. The first three episodes were fine, and offered the possibility of great potential in the future. However, things went downhill from there, until they fell off a bloody cliff into the bottomless chasm (i.e. episode 8) of being a waste of time. By 10, I was watching it on fast foreword, just to finish. I think, however, the most frustrating thing about the show was that the story made no apologies or real consequences for stupid decisions on the part of the protagonists. I mean, literally handing the bad guys the chance at world destruction is a mistake in my book. Hopefully that's not too much of a spoiler, but since this is such a bad show anyway, I doubt it will ruin your lack of enjoyment anymore than just watching can.\\n\\n\r\nSo yea, there were a few good aspects, but that like pointing out that the figure head is nice on a ship with no rudder and giant gaping holes in the hull. If the car is a rust bucket, you don't rate it average just because the windshield was recently cleaned. So yeah, I agree with a lot of what the other reviewers said, but I disagree strongly with their number ratings.",
            "date": "2009-01-08T14:50:00+00:00",
            "helpful_count": 39,
            "mal_id": 11257,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/111616.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/daemonblade1229",
                "username": "daemonblade1229"
            },
            "url": "https://myanimelist.net/reviews.php?id=11257"
        },
        {
            "content": "Yozakura Quartet was only a twelve episode series. That's not a lot of episodes to go wrong with. A basic plot and story can easily be done in twelve episodes. Characters can be fleshed out in twelves episodes. Yozakura Quartet did not manage to do any of that.\r\nStory - 3\r\nThe first few episodes showed how much potential Yozakura Quartet had. They were interesting and hooked me instantly. The rest of the show continued to mock me as if saying I was a fool for having any hope in the plot. The characters made stupid decisions and many plot points never made sense or were poorlyexplained. Do not be tricked by the strong beginning.\\n\\n\r\nAnimation - 8\\n\\n\r\nThe animation was pretty good. The character designs were wonderfully done, and all the fight scenes were fun to watch, if taken out of context. The plot seriously hindered my enjoyment of the fights, unfortunately.\\n\\n\r\nSound - 7\\n\\n\r\nThe OP/ED themes were okay, the actual score was nothing special. I really didn't pay much attention to the score, which means at least it didn't bother me. The seiyū's on the other hand were too good for this show. The seiyū's for Chiaki Shinichi (Nodame Cantabile), Shinku (Rozen Maiden), Suigintou (Rozen Maiden), Sebastian Michaelis (Kuroshitsuji), Nagi (Kannagi), Yin (Darker than BLACK), and many more were wasted voicing dull, irritating characters.\\n\\n\r\nCharacter - 5\\n\\n\r\nThe characters started out okay, but slowly a serious case of bad characterization appeared. By the end of the show, I could only stand to watch around two or three characters. The rest made multiple stupid decisions and contradicted their behaviour from before.\\n\\n\r\nEnjoyment - 3\\n\\n\r\nPretty animation and nice sound will go nowhere if the story fails and you want to strangle to the main leads. The story was a giant letdown, but every week I hoped it would get better. But it didn't.\\n\\n\r\nOverall - 5\\n\\n\r\nSo much potential, so little results. Yozakura Quartet was mediocre to core. I didn't exactly hate it - I was disappointed by it. Please, don't waste your time with this anime when there are plenty of others (Kamisama Kazoku, for example, is by the same author and is so much better) that aren't such a letdown.",
            "date": "2009-02-22T13:56:00+00:00",
            "helpful_count": 22,
            "mal_id": 12660,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/77526.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/adamantine",
                "username": "adamantine"
            },
            "url": "https://myanimelist.net/reviews.php?id=12660"
        },
        {
            "content": "Hmmm...Where to begin? Well, Yozakura Quartet, I could say, falls to the so - so level for me.It's not very bad, but not very good neither. If you have free time, then try watching it, but if you're kinda busy and only goes for the must - type then, it's okay to skip it. You could live your life to the fullest even without seeing this. \r\nWell, I don't mean to bash the anime. I had some little pretty moments actually. hmm..little moments...hehe...I don't know. I like its concept of 'youkai', it always remind me of my Claymore days and Claire -chan..hehe..but anyways, it's kindacheesy. \\n\\n\r\nHowever, I don't think the story has been rushed. It actually has a nice flow for the 12 - episode type. Although I might say, great heroism and character improvement plus coolness factor are lacking in this one. For me, the characters are blah, although they are actually very likable. For example, the main charac, Akina, I am so rooting for him. I want to him to be the sole savior of the Sakurashin Town, and wishing him to be a super \"saiyan\" (read: super powers) later in the series, but apparently, he is just a typical human being who is just gifted with a curse which runs in his family,and can only do one thing...tantananannnnn...cleanse youkai. He was overshadowed by the next not-even-cool-but-I-like-her character..\\n\\n\r\n.. Hime. She so reminds of Yomi-onee-san from Ga Rei Zero. They are both long hair and beautiful. They are both skilled warriors. The thing that differentiates them is the oozing coolness factor of my greatest onee-san! Yeah boy!!Hime doesn't even have the slightest of it, well, I am so horrible bec. I am comparing the two which should not be the case since they are not of same situation..Well, whatever, don't mind me... Hime has the greatest role in saving her city but I didn't feel much of it that's why even though I like her, she won't make it to the cut.\\n\\n\r\nWith the other characters, let's say..hmmmm...passing marks for them.\\n\\n\r\nWith the OP & ED, passing also..but they do not make a recall to my ears..except for that particular BGM,,the one with the english lyrics? Hmm..I'm not sure..hehe..\\n\\n\r\nOverall, I think this anime would only be on my passing level although I do not regret seeing this. I believe, we have different tastes to choose the good and the bad. So it's for you, readers, to decide! (Hmmm...I would be so touched if anyone would just read this..hehe...)\\n\\n\\n\r\nFrom someone-who-already-moved on-to-a-new-anime-series,\\n\r\nMe\\n\\n\\n\r\n^_^\\n",
            "date": "2009-10-21T06:32:00+00:00",
            "helpful_count": 10,
            "mal_id": 19890,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119010.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/docalion",
                "username": "docalion"
            },
            "url": "https://myanimelist.net/reviews.php?id=19890"
        },
        {
            "content": "Yozakura Quartet is focused on a consultation office of demons and humans in a consultation office who exist to protect a town where demons and humans coexist against evil demonic threats, this series dealing with evil demon Enjun trying to unleash the evil demons that have been sealed by the group. Many of the episodes in the first half of the series serve to introduce the members of the consultation office, their backgrounds before the start of the series and their regular duties throughout the town. They are fleshed out enough where you could care for them as characters, but these episodes lack much inthe way of intrigue or tension beyond hints of Enjun's incoming arrival as they are mostly light-hearted and sort of follow a slice-of-life style plot.\\n\\n\r\nThe second half of the series is where things pick up in Yozakura's storytelling when Enjun makes his presence felt on the town and the effects of his actions effect the populace. An added twist to the developments come from a revelation where Enjun is possessing the body of someone close to several members of the consultation office that add some interesting tension into the series as these characters feel conflicted over how to approach the situation throughout much of the show's second half. While the storyline does go for a black-and-white moral approach, Enjun does get enough dimension to his character to show how manipulative his character can be with the body he possesses and the strong belief that he has for his actions in trying to free the demons that were sealed.\\n\\n\r\nEven with the solid second half though, Yozakura Quartet does have its issues. I questioned the point of the land gods' presence in this series as they couldn't do anything to assist the consultation group due to \"rules\" they had to follow and they didn't get much in the way of depth. Enjun's partner in his plans also lacks much in the way of dimension and depth beyond serving as major obstacle in the efforts of the consultation group to halt Enjun's plans and the series fails to explain how Enjun was freed from being sealed. Also, the ending for this felt a bit too anti-climatic considering how difficult it was for the group to deal with Enjun throughout of the course of the series beyond overcoming their hesitance at taking him down.\\n\\n\r\nThe visual presentation to this series is rather average with bright colors and solid, though rough, levels of detail implemented in the designs of characters and scenery, though nowhere as visually impressive as TV titles like Code Geass R2 and Ga-Rei: Zero that aired that year. Action scenes normally make use of reused frames and speed stripes as shortcuts, making them not so impressive despite the unique abilities that several characters in this series have.\\n\\n\r\nOverall, Yozakura Quartet is a somewhat solid series that does flesh out the members of the consultation agency enough where you know of their characters and backgrounds and has an engaging second half coming from the group's efforts to thwart Enjun's plans. However, the series does suffer in that it doesn't bother to flesh out some major aspects to its plot and the questionable relevance of some characters even being in the series. It's not a masterpiece by any means, but still worth a look if you're looking for something that can be quickly breezed through.",
            "date": "2013-08-25T08:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 111153,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/97213.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ggultra2764",
                "username": "ggultra2764"
            },
            "url": "https://myanimelist.net/reviews.php?id=111153"
        },
        {
            "content": "There are anime which are loyal to their original source. And then there's this anime: Yozakura quartet. A show with so many potential and it all went down the drain. Let me explain why this show was such a waste of time.\r\nFirst, the plot. There are plot holes EVERYWHERE! From the first episode, we are only introduced to the city, not the characters. So from the first episode alone, I was left utterly confused. It just got worse as the episodes go on. There were literally plot holes in every scene, leaving me with nothing to work on. I loved the manga, but this adaptationjust killed me.\\n\\n\r\nDon't even get me started on the characters. It wasn't enough that they weren't introduced in the earlier episodes. No, they had to be downright useless! Instead of doing something that should've resolved the conflict, they only made it worse by not resolving it sooner! My hatred for the main characters only made me want to cheer for the bad guy.\\n\\n\r\nAnd worst of all, the BGM. It did not blend well with the atmosphere of the series. For a show which deals with japanese folklore, English songs aren't the best choice. And I'm very specific when it comes to music. This is possibly the worst BGM to be used for this series.\\n\\n\r\nTo sum it all up, it wasn't enjoyable. Not one bit. To be honest, I only watched it for the sake of finishing it. I absolutely do not recommend this adaptation to anyone. You'll just end up wasting your time. It sure wasted quarters of my time.",
            "date": "2016-07-16T03:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 224152,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3994747.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Vaenny",
                "username": "Vaenny"
            },
            "url": "https://myanimelist.net/reviews.php?id=224152"
        },
        {
            "content": "After watching the 12 episodes of Yozakura Quartet I can say with full confidence that this anime was a huge disappointment and a waste of time.\r\nTo keep this as brief as possible the story itself was filled with many plot holes with no explanation given and no back story was hardly given to explain how the characters developed into who they are now. \r\nThe characters didn't stand out and just seemed to be bland with no unique character-trait that made them stand out or memorable.\r\nThe animation was pretty good for when it was animated and the music DURING the show was great and the soundswere not bad. However the opening and ending to the episodes didn't really match at all just overall was not good.\\n\\n\r\nThe main characters of this show also show to be naive in the extreme even given their position and how long they have been doing so. Many poor decisions were made with what seems to be very little punishment for the highly stupid decisions of the MCs and in the end leaves a bitter taste in the mouth as you walk away from it knowing that the show should have made an attempt at showing \"remorse\" their stupidity. \\n\\n\r\nOverall this show was a waste of time and I forced myself to watch half of it because it was so uninteresting.",
            "date": "2019-03-27T14:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 304505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/FrozYn",
                "username": "FrozYn"
            },
            "url": "https://myanimelist.net/reviews.php?id=304505"
        },
        {
            "content": "Now ill say it first, This anime is the type of anime that most adults may find boring and will hardly be enjoyed. \r\nThis anime is really lacking and it really needs a season 2 or more. I may sound negative but its true. But if your looking for a temporary enjoyment then this show is good for you. This is one of my favorite anime and that is due to complete Bias-ness. Personally I can't find anything special about the anime except that it contains one of my top coolest scenes. I will be biased and reasonable at the same time in this review.\r\nMy#1 reason why I like this anime is Akina. Akina at first look can be considered as a generic protagonist. But one thing that most people fail to notice is that Hime is the Main protagonist of the anime/ or atleast share the spot with Akina. You see the story may look like as it revolves with Akina in the anime but what is actually happening here is that everything about Akina also revolves around Hime, or you could almost say that Akina's story revolves around Hime. No not because Hime does the fighting but because Akina's development as a character from his childhood was basically for Hime. \\n\\n\r\nMy #2 reason for loving the anime so much is Hime ofcourse. Her character may seem annoying at first for some people. Well not for me because I don't judge characters after seeing 3 or four episodes. But Okay looking at Hime she can look irresponsible most of the times but really who is the first one to jump infront of a train when its about to hit the city. Its Hime ofcourse, she really pushes herself for other people and I find that attractive to a character. The other thing I absolutely liked about her is her relationship with Akina and how cute she is around him. Imagine a tomboyish lazy girl that blooms around her crush its too cute. \\n\\n\r\nThe other characters was really interesting too and how the story plays around them was somewhat enjoyable in my opinion.\\n\\n\r\nIn short this anime for me falls in my category as an Anime where you pay attention to the characters rather than the story. Its the type of anime where you won't enjoy and Like it if you don't have a favorite character that you wanna see more.  \\n\r\n(Bit of spoiler) The anime needs season 2 to be complete because it gets more interesting further in the manga and It gives more action than the anime",
            "date": "2018-09-19T12:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 289428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7348016.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LazyBoy-kun",
                "username": "LazyBoy-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=289428"
        },
        {
            "content": "I dint watch the anime in full... cause i drop it at episode 10... all i can say is... the story was really bad... i ended up complaining to my self... why am i torturing myself watching this anime.... \r\nThe character is soo cliche'... the main character??? Who?? Akina or Hime?? what is their relationship??? \r\nwho and how and why were the worker in the central are all school girls???\r\nthe never ending complaining from the villagers... and only cause trouble???\r\nThey keep saying \"Do your job!\" what is the job???\r\nThe first episode has a lot of preminiton for a good 12 episode anime... Which goes dowmthe hill after just 4 episode...\\n\\n\r\nFor once the villain seems very weak compare to Hime... But that battle scene was horribly written... \\n\\n\r\nin the end... im sorry for those who like this \"Show\" but... im not fisnishing this series completely.... not with that horrible writting...",
            "date": "2016-09-04T07:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 228265,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5084688.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 10,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Thegret_Miew",
                "username": "Thegret_Miew"
            },
            "url": "https://myanimelist.net/reviews.php?id=228265"
        },
        {
            "content": "About 1% of adapations surpass their source material; this anime however, falls to the 99% that fail. Maybe if I had not read the original manga beforehand, I may have reviewed this more favorably, but alas that is not the case. I was mildly excited to find out that there was an anime of this series, but was apprehensive since most anime adaptations are mediocre. I decided to drop this series 75% through the first episode, cringing at the first 10 minutes where they basically spoon feed you plot elements that took several chapters to flesh out in the source material. Throughout the episode, moreand more liberties come to fruition, and the cherry on top was a certain undead youkai's sudden hatred for humans. My suggestion is that if you're new to the series, start off with the anime, then move on to the manga; or just start with the manga and skip the anime altogether.",
            "date": "2010-07-12T10:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 28305,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/263085.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/no51",
                "username": "no51"
            },
            "url": "https://myanimelist.net/reviews.php?id=28305"
        },
        {
            "content": "Alright first off, the story is just about how four members of Hiizumi's Everyday-life Consultation Office live. They live in a world full of you could say demons or monsters. Anyways the 4 members to protect their town from the bad demons and keep the good ones together in a healthy community.A very useful tactic Akina uses is a power where he uses \"tuning\" to rid of the bad youkai that cause chaos in the ir town, which helps some problems with the bad youkai.\r\nWhen You first start watching the anime it seems very interesting and you really want to watch more. Now the thingis when you watch more it starts to get very boring and leaves the person bored out of their mind. Mainly every episode does the same thing  they talk excessivley about sometimes very pointless or uninteresting, or running around trying to defeat a bad youkai. Also randomly out of know where you learn of this guy that everyone thinks is this guy named Gin, Now a thing I noticed is, why didn't they discuss this character earlier? They make it seem like you already know who this guy is and all of sudden its some sort of bad guy?The music is fairly decent in this anime. The opening is quite enjoyable to listen to and sort of catchy. Same for the ending.The characters seem to be quite bland and none of them seem like a character you would want to add to your favorites list. They are so much like typical characters. Either they're nice,friendly and cute or they are just the character thats always pissed and thinks they're better than everybody and it makes it quite boring.In general this anime lacked interest to me and you may only want to watch this if you absolutley have nothing to watch.",
            "date": "2010-06-15T19:56:00+00:00",
            "helpful_count": 0,
            "mal_id": 27200,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/288882.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/UltySo",
                "username": "UltySo"
            },
            "url": "https://myanimelist.net/reviews.php?id=27200"
        }
    ]
]