[
    [
        {
            "content": "\"A series with splendid animation and soundtrack but poor storyline.\"\r\nMany many things have happened in the first season which was loosely based on the manga original, so logically we are expecting the storyline of Capu2 to continue from where season one left off. In fact, many many things do happen in Rosario + Vampire Capu2. They include the very exciting and daring (in the sense that they are pissing off the fans) censored fan service, more censored fan service, and still more annoying censored fan service. In terms of actual Rosario + Vampire story coverage, Capu2 literally got close to none with a few minorexceptions.\\n\\n\r\nStory:\\n\r\nSimilar to the previous season, Capu2 is also considered episodic (each episode is one mini standalone story). The \"monster of the week\" which received numerous criticism also returned though this time most of the \"monsters\" do not have much of an evil intention thus making most battles seem even more ridiculous (pointless) than before.\\n\\n\r\nUnlike the first season which still semi followed the story from the manga, Capu2 is almost purely fillers as evident in episode 6. To wrap it up, Gonzo pretty much taken out all the actions in the story and replaced them with censored fan service (how can it be called fan service if they are censored with a bear?). Obviously fillers unrelated to the actual story tend to make fans unhappy, but from another perspective it can be rather refreshing at times because even manga readers wouldn't know what might come next! \\n\\n\r\nAnimation:\\n\r\nUpon watching this anime, perhaps the first thing you'll notice is the supreme animation quality. Whether you are new to this series, or a fan from the manga original, the artwork in the anime is without a doubt impressive. It should be added that the animation quality throughout the series is very consistent, which certainly means a lot for a show intended for fan servicing. \\n\\n\r\nSound:\\n\r\nWhen compared to the first season, the OP and ED are certainly at the same level in terms of quality, thanks to our beloved Nana. It is plain evident that the OP and ED clips no longer relates to the story (unlike season 1's OP and ED which give hints to certain aspects of the plot), which is actually a good thing for this season since the production crew never had any intention of following the story anyhow. So a good OP and ED that matches their theme (ie. fanservice) would do the trick. \\n\\n\r\nGive Nana Mizuki tons and tons of credit for her amazing job well done for performing the OP and ED as well as being the CV for Moka. As stated in my Rosario + Vampire review, Nana has an amazing ability to sing thus allowing her to win the “Best Musical Performance” award in the first Seiyu Awards.\\n\\n\r\nCharacter:\\n\r\nI was quite surprised when writing this review that there were hardly any character development in this season. Not only are the characters' hidden abilities STILL have yet to be included in the anime, but nothing really changed from the first season's ending (as expected from a filler series). Season one definitely did a better job in this department.\\n\\n\r\nEnjoyment + Final Thought:\\n\r\nThe heavy censorship really made the show very not enjoyable for me. If you want to watch the series uncensored, you'll have to wait for the DVD release. Overall, Rosario + Vampire Capu2 served its purpose as a filler and \"fanservice\" series.  Having strong animation quality and great sound track makes up for the lack of story and pretty poor character developments. I recommend this series for people who like good quality animation but if you want story development, you'll be best to skip this.\\n\\n\r\n*Note* The review is based on the broadcast episodes (ie. TV), the DVDs have no impact on the review.",
            "date": "2008-12-25T11:13:00+00:00",
            "helpful_count": 162,
            "mal_id": 10623,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=10623"
        },
        {
            "content": "The Short Review for the Reader without much time:\r\nStory (3/10): What story?! Well, there was a storyline for the first and last two episodes of this anime, and then 9 episodes of filler. 9 EPISODES OF FILLER IN A 13 EPISODE ANIME. Is this anime so inconsistent that it can't even stick to the plot for over two consecutive episodes?! Hence the low score.\r\nArt (8/10): The art is the best thing about this anime, is is fluid, clean, detailed, and rich in color.\r\nSound (6/10): The music matches the anime pretty well, ecchi all the way. It's the video with the music that is...interesting.\r\nCharacters (6/10): Thecharacters all have flat personalities: they all love the guy, and they are all...lets just say &quot;brave&quot; in public.\\n\r\nEnjoyment (6/10): Eh. Some new developments that were quite interesting. Mostly mumbo jumbo.\\n\r\nOverall: (5/10)",
            "date": "2009-01-19T18:40:00+00:00",
            "helpful_count": 106,
            "mal_id": 11700,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78816.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dr_Jan_Itor",
                "username": "Dr_Jan_Itor"
            },
            "url": "https://myanimelist.net/reviews.php?id=11700"
        },
        {
            "content": "I'd like to set record straight and give you an honest review. The series, as a whole, first and second season are based, rather LIGHTLY, on the Manga of the same name. Keep that in mind.\r\nRosario+Vampire is a show that FEEDS off of fan service, harem stereotypes, and it's own unique sense of humor within it's story. Don't expect anything more than that. Take this anime as it is and you have a pretty decent show to watch and pass the time by.\r\nStory: 6\r\nThe story isn't like the manga. Not even anime adaptations are anything like the \"book\" it seems. Rosario+Vampire's story is chopped upinto pieces for the most part, and each episode is it's own slice of life for Tsukune and the gang. Repetition...often. Less than the first season though. Only in the last few episodes does a real epic story that runs smoothly begin to come together. Lots of fan service, lots of laughs because of how the harem is put together etc. don't expect much more and enjoy it for what it is.\\n\\n\r\nArt: 8\\n\r\nGonzo, as usual has done a fantastic job animating the show. It's very smooth, and nice to look at (no I'm not talking about the fan service). I've seen better, but Gonzo does a good job at keeping it consistently decent.\\n\\n\r\nSound: 8 \\n\r\nLike I said, Harem, Ecchi, whatever you want to call it, the soundtrack to this show fits it very well. The ever now famous \"Churu Churu Paya Paya,\" is a masterpiece score for some scenes in this anime, along with other songs that really pull the show together and make it's comedy valid. Add that up with amazing OP and ED songs for BOTH seasons by Nana Mizuki, and you have yourself a good anime soundtrack.\\n\\n\r\nCharacter:6\\n\r\nYou have Tsukune, the wimpy lead with a huge heart, you have your moe in Moka, you have your...Tsundere?...I suppose in Inner Moka. Kurumu is your typical flirt, Mizore is the all out stalker, Yukari is your loli, add in some adult themes and BAM generic anime harem right? WRONG. Though I rate it low for extreme lack of character development, the characters take on their own personas for the anime. BECAUSE it's set in a unique monster environment, each character has certain special traits about them. Given they are emphasized more on in the manga, but the anime at least gives you the basics. I can't say I've seen many other ecchis with a Vampire, Succubus, Snow-Woman, and Witchling all after one guy. Tsukune however stands out among the bunch, though he seems like a below average student with good intentions, there's more to him. He genuinely cares for the others, all as friends, and wants to be able to protect them. This is shown frequently in the series that though he is powerless, he's willing to fight, no matter what the cost. Which does lead to some interesting situations.\\n\\n\r\nEnjoyment: 9\\n\r\nI laughed...I laughed. It IS enjoyable for what it is. A harem anime with your typical stereotypes played on well, with your BIG twist of them being monsters, and Tsukune being human. Decent bit of action to sate that hunger, and watching Tsukune progress ever so slightly as a character was cool. Don't come expecting anything more than laughs, fan service, and a few decent romantic/admirable scenes. \\n\\n\r\nOverall: 7\\n\r\nGood anime. Not the best, not terrible. They advertised as an ecchi, they sold an ecchi to the public. You view it as anything else and you'll hate it....but then that'd be your own fault. If you need to pass some time by, and you like the genre, give it a look. One of the best harem animes in a while, here's hoping for a 3rd season with more story and character development than we've seen!",
            "date": "2012-08-31T00:08:00+00:00",
            "helpful_count": 49,
            "mal_id": 71233,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1313375.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AkihisaYoshii",
                "username": "AkihisaYoshii"
            },
            "url": "https://myanimelist.net/reviews.php?id=71233"
        },
        {
            "content": "Well, so it’s come down to this… “Rosario + Vampire” is an anime show directed by Takayuki Inagaki about, uh, well, gratuitous panty shots and full-blown harem mayhem. The story is straight-forward enough to actually make sense too: Tsukune Aono is your typical high school protagonist who plays the nice guy role way too well. One day, while heading to his mysterious new high school in the middle of what appears to be a dead forest/graveyard, he is run over on a bicycle by Moka Akashiya, a classmate of his. Immediately, these two seem to hit it off, until Tsukune discovers that Moka is actuallya vampire and the high school he’s attending consists of nightmarish monsters. Eventually, Tsukune is forced to keep his human identity a secret for fear of his own life, while also attracting the attention of a group of girls all lining up to have sex with him, typical of your harem/ecchi show.\\n\\n\r\nI just want to make this known: “Rosario + Vampire” is a terrible show. In fact, so terrible that I actually found myself really enjoying it at times. There seems to be a very basic formula to each episode too: Tsukune, being the dumbass he is, manages to get involved in some life-threatening conflict with a dangerous student or teacher, and Moka is forced to change into her “badass” vampire form to save the day while the narrator, being a bat with the most annoying voice in anime history, inexplicably totals up the running time each battle took… for reasons I have yet to know… It’s formulaic, yes, but that doesn’t mean I didn’t have a ton of fun with it. There’s a cheesy undertone throughout that makes it oddly entertaining, and while the nudity is flaunted around this show like clothing is illegal, it adds a kind of quirky vibe to the characters themselves. I shouldn’t go too into detail with the other characters apart from our two protagonists because, well, they’re cardboard cut-outs from other harem anime and are too uninspired to really give a damn.\\n\\n\r\nHowever, “Rosario + Vampire” has a secret power: it is so facepalm-worthy, that at a point, your brain adjusts to the crude, dry humor and eventually you find yourself laughing a lot. The comedy in this show is hilarious when it wants to be, especially an episode when Tsukune is followed home by the stalking group of girls over summer break, and is introduced to their mother, who witnesses them in *ahem* compromising situations that leads her to believe her son is a sex fiend. It’s actually one of the funniest episodes I’ve watched since that exam episode in “Angel Beats!”. I feel like I shouldn’t dismiss the strengths of the show either, because the last few episodes of the first season are legitimately great, as well as a bulk of episodes in the second season.\\n\\n\r\nAs much as I enjoyed most of it, there’s just also too much wrong with “Rosario + Vampire” to fully recommend it. While it does have it’s fair share of comedic genius and suspenseful moments, these are too rare in the show to really call it a saving grace. The chemistry between the “so inoffensive, it hurts” Tsukune and “Lucy from Elfen Lied 2.0” Moka is actually pretty good too, and provides an ongoing gag that never gets tired. But overall, it’s decent fun at best. If you just want to take a break from a serious anime, switch off your brain and let this soak in. Otherwise, watch “Love Hina” if you want great harem…",
            "date": "2013-09-18T09:32:00+00:00",
            "helpful_count": 42,
            "mal_id": 113307,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3150425.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/blazeMX",
                "username": "blazeMX"
            },
            "url": "https://myanimelist.net/reviews.php?id=113307"
        },
        {
            "content": "Let me first explain each score that i gave:\r\nStory : 8\r\n -It's good to know that Moka has sisters in her family. not only 1 but over 3 of them plus Moka which adds up to 4. That simply means, more harem!(i hope)\r\nArt : 9\r\n -I don't have to say it but all the characters(girls) look great! i mean, not in a  perverted way but in a bishoujo type of way. They never stop to amuse us with there art. i mean, look at shirayuki's and kurumu's mothers!\r\nSound : 10\r\n -You guys gotta admit, the op kills! Discotheque is one of few songs thatare made with a theme which isn't new(disco theme) to the 21st century with such a cool beat! not to mention the part in Ep3 where Mizori and Kurumu had a song battle during music class. And also their BGmusic is really something!\\n\r\nCharacter : 9\\n\r\n -Talk about Kokoa's twisted love, that really is quite cute. Not to mention the saying, &quot;Like Mother, Like Daughter.&quot; Look at Shirayuki's mom. she was stalking Tsukune behind the table! \\n\r\nEnjoyment : 9\\n\r\n -From the previuos scores i gave, there is no need for me to explain why i gave this score.\\n\r\nOverall : 9\\n\r\n -Such a great combination of characters into one anime. I hope to see more sequels to come after this.",
            "date": "2008-11-04T02:17:00+00:00",
            "helpful_count": 24,
            "mal_id": 9227,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99282.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/huhahu68",
                "username": "huhahu68"
            },
            "url": "https://myanimelist.net/reviews.php?id=9227"
        },
        {
            "content": "Many people didn't like the fact the story didn't follow the manga, and didn't have much of a point. There were quite a few episodes of random nothing-ness that had really nothing to do with the plot, but they still had their comedy/romance aspects that kept you watching.\r\nStory 6/10\r\nThe story wasn't really that developed in either of the seasons, I wish they would have gotten a bit more in depth with Tsukune and his new vampire powers. It was still a hilarious storyline, I didn't mind all that much\r\nArt 9/10\r\nI really liked the art style in this anime. The characters looked nicely drawn and symmetrical.\\n\\n\r\nSound 8/10\\n\r\nThe sound effects were pretty nice, I didn't expect much from them since it was going to be a comedy/harem type deal. However, the english voice acting was spot-on. You can't go wrong with good ol' Haberkorn as a main :D The song in the second season was pretty beastly, I dug the bass line in the disco song very much. \\n\\n\r\nCharacter 8/10\\n\r\nThe characters were all pretty likable and had different traits. Specially the girls HUEHUE. \\n\\n\r\nEnjoyment 9/10\\n\r\nI really liked watching this anime even though there were a bunch of random episodes. These types of anime don't exactly need a good story-line to be likable, but it would help.\\n\\n\r\nOverall 9/10\\n\r\nThis was a really good 2 season anime. Even though a lot of people dissed it because of the story-line not matching the manga and all that, I still liked the comedy/harem aspect of it.\\n\\n\r\nThanks for reading this review! first of many to come C:",
            "date": "2014-02-21T05:27:00+00:00",
            "helpful_count": 19,
            "mal_id": 133343,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3535449.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scragleton",
                "username": "Scragleton"
            },
            "url": "https://myanimelist.net/reviews.php?id=133343"
        },
        {
            "content": "When I heard this series was going to Capu2 I almost cried with happiness. The story follows a very cliche harem/ecchi plot, which is a guy surrounded by girls in a magical world, and each one of them dig him.\r\nFrom there, you can already understand what's going to happen. For the first season, it's tiny sub-stories with a dramatic ending. BUT the thing is that the humor in this story totally makes up for the lack of serious plot. And for you ecchi lovers..well there's only two things that we are pleased with and this show has it and you know what I mean.\r\nOverall I'monly giving a rating to the first season, which is an 8/10. As for the second season, I have high expectations and so far they have been fulfilled.",
            "date": "2009-04-01T20:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 13759,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13759"
        },
        {
            "content": "Story: \r\nOk now let me tell you this the story isn't bad sometimes it does go a nice route but other is just random stuff. Well it's a harem, so can you really complain?\r\nArt:\r\nAmazing the art style is really great and the animation is extremely good. Those character designs tho... MIZORE FOR THE WIN!!!\r\nSound:\r\nThe sounds are happy and joyful, they don't get annoying if they are re-used. \r\nThe voice acting is okay... But damn the English dubbed is amazing i don't like watching anime in eng dub but this anime FREAKING nails it!!\r\nCharacter:\r\nHmm most of them can get really annoying *cough* THE SUCCUBUS. Oh! Can'tforget about the loli witch... Mizore is easily the most calmed and less annoying and Moka, i like her Original form with white or silver hair IN MY OPINION.\\n\\n\r\nEnjoyment:\\n\r\nI just kept watching this anime in my bed in excitement i don't know why it's just so funny and cool. The boobs and stuff don't really bother me or interest me, i just like the comedy and the action or most likely the stupid stuff that happens \\n\\n\r\nOverall: \\n\r\nAmazing anime... Would recommend IF you're looking for a fun anime.\\n\r\nWouldn't recommend if you don't like the sexual scenes.",
            "date": "2015-04-10T20:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 185344,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4549938.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Raffkakashi",
                "username": "Raffkakashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185344"
        },
        {
            "content": "Well god the story is this: A guy who is really not cool at all, has three hot chicks and a little girl lovin him. And he only likes one. He goes through random situations at a monster school.\r\nI feel like its all filler, really.\r\nAnd its an ecchi anime, itll have seens with ecchi. Then random they will start censoring things. You DO NOT censor anything in an ecchi anime unless its like hentai but not if its upskirt. Especially when they are hot sexy chicks.\r\nNo YOU DONT DO THAT!\r\nThe character is actually very good, the thing that ruins it is the main guy, hesreally not developed and doesnt have a unique personality at all.\\n\r\nMy enjoyment is not that high, cause i dont know where they are going with this.\\n\\n\r\nReally watch the first season. And save this at a time where you dont want to watch an anime where itll make you start having high expectation. Act like this is a Naruto filler except not as retarded and pointless!\\n\\n\r\nThanks for reading!",
            "date": "2008-12-15T18:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 10414,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83382.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/FRESHShaZaM",
                "username": "FRESHShaZaM"
            },
            "url": "https://myanimelist.net/reviews.php?id=10414"
        },
        {
            "content": "Story? Who cares? You're watching this for the fanservice, and as a harem, you should be pleased with 13 episodes of 99%, \"Tsukune, Tsukune, take me.\" That's basically what it is; and it's implied ****SPOILERS**** that he and Moka (pink-haired) get together. \r\n****POSSIBLE SPOILERS FROM HERE ON IN****\r\nIt's funny, actually. I think there's only ONE kiss the entire second season between Tsukune and any of his four girl \"suitors,\" and it's not even Moka, I want to say it's Mazore (sp). \r\nAnyway, getting a little sidetracked there... you will enjoy this season if, like me, you enjoy fanservice and enjoy receiving a healthy dosage everyepisode. If I just described your tastes, come on in, enjoy the ride.\\n\\n\r\nStory: N/A\\n\r\nI won't rate something that's not present. Don't take it negatively, the season did what it had intended to do and did it surprisingly well.\\n\\n\r\nArt: 8\\n\r\nR + V has always had solid artwork/animation. However, this would be a 10 if they had kept the animation standards up to what they were churning out in the beginning of R + V, season 1. I mean, take a look at the opening credits: that's some dang good animation.\\n\\n\r\nSound: 7\\n\r\nAbove average.\\n\\n\r\nCharacter: 9\\n\r\nWith fanservice comes character development. Better than the first season for sure.\\n\\n\r\nEnjoyment: 8\\n\r\nLiked it more than the first, but that's really because of my taste in anime. I haven't read the manga, but I'm sure I'd have more negative things to say if I had. In hindsight, I would've liked to have seen a Moka x Tsukune kiss sometime during the series. Basically, it would've made the 13 eps. completely worth it.\\n\\n\r\nOverall: 8\\n\r\nHey, if you liked the first season, but you  just wanna feel giddy about relationship business, this one's for you.",
            "date": "2009-10-15T23:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 19717,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=19717"
        },
        {
            "content": "I watched rosario+vampire capu 2 expecting something even more badass than the original show, and found that it was basically the same. There was still a bunch of meaningless fanserve (which I am all for) and it was still a harem which almost guarantees that nothing of deep import will happen.\r\nOnce again, the story follows tsukune; a complete pussy who seems to attract all the women, and moka the vampire whos into him. Also there the succubus, ice woman, witch, and this season brings us a brand new vampire. The new vampire is moka's sister kokua, and she is the first female character not tojoin tsukune's entourage... FINALLY! \\n\r\nAlso brought back from the original show is the stand alone episodes with a few conjoining at the end, but as ive said before this is how the manga was too so I will forgive it. However, while i'm on the topic of of the story; many people will expect a continuation from where the last season left off in the manga. This is not the case, in fact very little has anything to do with the manga itself at this point and now it is just a continuation of the first season instead of the manga.Now they are even tossing in filler episodes, I dont see why when they have so much manga to work with but whatever, I can and have forgiven them for some of the episodes that were really good, but some of the episodes in capu 2 just suck terribly so be on the watch for that. Another thing is that tsukune still doesn't use his vampire powers to open a can of whoop-ass on anybody this season either, so that kinda disapointed me.\\n\r\nAs before, the fights can be measured in a matter of seconds, and it would almost make more sense to cut em entirely but, what do I know. Also, in capu 2 you are about as likely to find the characters having a friggin sing-off than anything else, so hopefully you can get past the lameness of these situations or you will not survive this show.\\n\r\nOnce again the art is great just like the 1st season, and the characters are still a dynamic bunch, even if they havnt changed at all since season one. There was also a pretty good soundtrack for this show. I enjoyed watching capu 2 as a fan of the original manga and the 1st season, but maybe it can be said that you will enjoy this more if youve never read the manga... maybe. Still in all, I liked it, it was good stuff.",
            "date": "2013-01-25T12:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 84803,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=84803"
        },
        {
            "content": "well there is not much to say about this anime ... if you have already seen the first season, but for those who haven't seen first season I strongly recommend watching season 1 :], and if possible just skim through the manga so that you see what's coming.\r\nSTORY:\r\nthe story starts pretty random like the last season, a little too similar to you average slice of life comedy but i believe it should pickup like the manga. hopefully. \r\nART: \r\nthe art is very good, but so far those little bats censoring the partial nudity are getting annoying, not that i am a hentai or anything butsometimes a little partial nudity is good. \\n\\n\r\nSOUND: \\n\r\nthe sound is ok... the opening song is good but the video for it is better. but i think this anime is missing the little &quot;lalalalala   lalala lala &quot; from the first season lol. \\n\\n\r\nCHARACTER:\\n\\n\r\nthe characters are the same ones from the firs season except for moka's little sister that dwells arround trying to fight moka, but in my opinion Mizore-chan it still the best :] \\n\\n\r\nENJOYMENT: \\n\\n\r\ni give enjoyment a 10 because this anime is very easy to &quot;fall for&quot; The characters are lovely and very lively which makes the series very fun and easy to watch.",
            "date": "2008-11-25T09:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 9835,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89159.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sphiroth",
                "username": "Sphiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=9835"
        },
        {
            "content": "In honesty I didn't think this was a good show, I felt like each episode had the same guidelines as the others. The characters personality was the same as any other harem/ecchi and to be honest the story is not thought out very well. Also, why do they stare at each other for so long, the amount of time they stare at each other is probably more than 2 good fight scenes WHY WOULD YOU FILL THE TIME LIKE THAT. I found some scenes funny and different but they seriously need to change it up a bit.",
            "date": "2015-08-24T23:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 196978,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ElvenHighKing",
                "username": "ElvenHighKing"
            },
            "url": "https://myanimelist.net/reviews.php?id=196978"
        },
        {
            "content": "Story (5/10) - This series is loosely based off of events of the previous Manga, and aside from that, there really isn't much improvement in terms of story, whether you read the Manga or not.\r\nArt (7/10) - Same as the previous adaption, nice and colorful.\r\nSound (6/10) - An improvement over the original. The visuals accompanying the songs of the Intro and Outro are one of the positives of this show.\r\nCharacter (6/10) - More or less the same as before, just shifting to different characters.\r\nEnjoyment (6/10) - I watched this out of curiosity after finishing the first season. It wasn't bad, but it wasn't really animprovement either. \\n\\n\r\nOverall (6/10) - This wasn't the best Anime, not by a long shot. It was an improvement over the previous season though, but not by much. Fingers crossed that the ending Manga will make up for it.\\n\\n",
            "date": "2017-12-05T23:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 264618,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=264618"
        },
        {
            "content": "To be fair, this is not the worst manga-to-anime transitions i've ever seen but I could have expected better. Unlike the action manga series, this mainly focuses on more of a romantic-comedy ecchi base. Mainly to my dissapointment, is that it doesn't quite follow the manga story whatsoever. But overall it's okay but not so much exciting to watch. I would rather stick with the manga series.",
            "date": "2010-05-17T13:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 26146,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326936.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeCheeze",
                "username": "AnimeCheeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=26146"
        },
        {
            "content": "While I did like this there is many, MANY plot holes and story elements they do not touch on or start to, but forget totally about it...the major one being the main character, Tsukune.\r\nIf you want this to make any sense, make sure to watch Rosario + Vampire before this one.\r\nWARNING: SPOILERS\r\nI was happy with how the first one ended; Tsukune was able to stay at the school because he was changed into a vampire and in the first 5 mins of the first episode on this one; his mom makes a comment about him not drinking raw water. This alone shows she knows; Despitethis however, through the rest of the series he shows no increase in ability and is referred to more or less as a human by the rest of the group and of course, for the rest of the series he still is unable to really fight. Why does this bother me so much? simple: they left out a huge plot point of development for the character.\\n\\n\r\nHe has already accepted the school is full of monsters and already accepted the girls defending him; however if they focused more on the fact that he is now a vampire rather than tossing in random episodes which, while funny provide no character or story build then the series would have been majorly better.",
            "date": "2012-03-16T17:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 56119,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FateStCloud",
                "username": "FateStCloud"
            },
            "url": "https://myanimelist.net/reviews.php?id=56119"
        },
        {
            "content": "After enjoying the first R+ V , I picked this up with high hopes that it would continue to be as good, and it did an alright job of maintaining the standard. Having not read the manga I can't comment on how true to it it was, but the plot was again the basic harem plot and a continuation from the first series with an added character in Moka's sister, Kokoa. Overall, the plot wasn't as good as the first, a lot of the stories didn't seem to lead anywhere new, whereas in the first season the episodes felt like they were all leading somewhere.\r\nTheartwork is still the same gonzo team that did the first and is still the same fantastic quality we have come to expect from them, the sound I'm marking down slightly on the first episode, mainly due to the overuse of irritating catch phrases, which seemed to appear just to disrupt the storyline in most places, still the same voice acters/esses are involved so the sound isn't changed from the first season. \\n\\n\r\nThe characters are all the same bunch from the first season with the additions of Kokoa and appearances from the mothers of the group, Ruby also appears a lot more in this season. This might have been OK, but a lot of the scripting for the newer characters made them annoying to watch, Kokoa especially was grinding my gears towards the end of it, and character development on Ruby was non existant, I was however glad that they did answer a few of my questions from the first season with Moka, all in all the characters were still fun to watch (Kokoa and Ruby aside).\\n\\n\r\nI did enjoy the series, and its a very easy one to watch, it just suffers from the sequal hangover like so many anime titles seem to in that it just doesn't live upto its predecessor. Not to say that this doesn't give it a good go of it, definately worth a watch if you've been watching the first season, and for anyone new, watch the first season first!",
            "date": "2009-08-04T13:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 17466,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GeneralCox",
                "username": "GeneralCox"
            },
            "url": "https://myanimelist.net/reviews.php?id=17466"
        },
        {
            "content": "Okay ummm, this wont be any in depth review...But in my opinion this was an incredibly painful series. This along with the first season played out in the same event format every time...(and i mean always)...the first 8-9 eps consist of Aono getting into trouble, tearing the rosary off Moka's chest....then as a result Moka saves the entire group...Now i understand this is a comedy but I think the variety of storyline in each episode made it such a drainer to sit through. Okay now in the last 2-3 eps of both seasons, its like they finally decide they want to be serious and havea storyline.....and for once they decide 'Hey, maybe we will let Aono do one cool thing before we revert him back to his damsel in distress useless self'. \\n\\n\r\nNow dont misunderstand, if they were going for this comedy without a plotline then its fine....But the fact they try to introduce something serious in the last moments of both seasons, makes me frustrated as too why I watched the first 9 useless episodes....Soooo yeah this is a pretty fresh review so I guess in contains some resentment over the forever repeating plotline of this show...But there u have it...\"Rosario + Vampire\" in a nutshell. \\n\\n\r\n(Over Rating a 7, cause im giving it the benefit of the doubt, as possibly the fact that its a comedy excuses it from have a varied plotline in each episode -.- )",
            "date": "2014-11-07T14:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 167767,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4113711.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RasenRum",
                "username": "RasenRum"
            },
            "url": "https://myanimelist.net/reviews.php?id=167767"
        },
        {
            "content": "This show has made me feel so many different emotions over the few months i've been watching it, and i honestly think this is my favorite Harem/Romance/Action anime there is....\r\nAnyways, starting with this story....The story continues from the first season, which was also really good. You have a lot of family drama here, as Moka's sister tries desperately to get her \"real\" big sister back, and on top of that, have many \"little\" stories here and there that doesn't really fit the main story line.... But again, being a Harem anime, there's a lot of what you would expect from that genre in this anime.But that doesn't, in my opinion, make this any less-good. For the story overall, it's pretty solid, but could use more STORY, if you know what i mean.\\n\\n\r\nI LOVE the artstyle for this anime, it's what i think about when i think of anime, and personally it's what brings me back to this series. But, not much else to say, it's all really nice \"looking\", heh, if you get me.\\n\\n\r\nSound is good, OP get's stuck in your head, but it's not that bad so i wouldn't worry. The English Dub, for both seasons is really good, and all the characters voices fits with them. Great job here.\\n\\n\r\nSo, being a harem anime you wouldn't expect there to be that many memorable characters, or even any character development at all. But this anime, like High School DXD, has really memorable characters, and personally they're some of my favorites. This anime really brings out very distinct personalities and feelings from each character, specially how a succubus DOESN'T use her powers to get Tsukune under her control, but yet, tries the \"old fashion\" style...and i like that. Like i said before, there are times when this anime does go way overboard with the fanservice, but deep down, this anime has very good character development, and memorable characters...\\n\\n\r\nMy overall enjoyment is just perfect. I LOVE this series and will rewatch it many times to come. But i am sad how this series doesn't have another season, i feel like they could renew this series and finish the fight between the four girls, i really wanna see who Tsukune picks, but i think it's pretty obvious. OVERALL, i love this series, and i personally think if you haven't seen it, you need to watch. \\n",
            "date": "2016-08-31T19:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 228030,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=228030"
        },
        {
            "content": "I found this season to be better from the last one. Season 1 of R+V was so bad, I had to consume alcohol to finish watching it. It was just a mess of a harem anime. \r\nIt seems however, that the creators of Season 2 agreed with me, and decided to create a second season to parody the first. Parodying your own series with your own series, a very bold move. \r\nThe series kept the harem in a form of stasis, with catfights erupting here and there even though the main guy is clearly into the vampire chick above and beyond the other girls. Thecharacters were dumb, and fought, and the story was all over the place but it seemed like every character in it, when they weren't at the center of the episode, knew just how bad this show was and expressed the sentiment. The Succubus being the one to least give a damn about criticizing the show. \\n\\n\r\nMAJOR SPOILER* \\n\r\n------------------------------\\n\\n\r\nHowever, I'm going to give the season some credit on the final episode. It started to move from a silly parody into hitting at the heart of all harem animes. \\n\\n\r\nBoth Real Moka and The Succubus Kurumu actually came across as being genuinely hurt by Tsukune's feigned indecisiveness. Real Moka tried to maintain the relationship and attraction between her and Tsukune, but it just wasn't good enough for him because she wasn't the ditz. The character did seem genuinely sad as he just runs off leaving her to stand alone. \\n\\n\r\nAdditionally, in the final two episodes,  Kurumu lays it all out there as to why she likes him and how she's been with him from the start. She even gets he's not going to pick her and expresses being upset that he never even looked back at her as heads into the castle. \\n\\n\r\nI felt these scenes to be somewhat sad, and indicative of the result of a harem anime. Someone(s) is going to end up heart. I'm glad they briefly touched on this before resetting the status quo. Both of these two had somewhat genuine reasons as to why he should care/be with them. Yet he chooses the stereotype instead. \\n\\n\r\nThe witch girl ultimately admits to basically being down for a polygamous threesome with Tsukune and Moka, so I don't buy her romance,  and the Ice Girl, maybe because I missed something, didn't seem to be genuinely in to him so much as she wanted to be into some guy. \\n\\n\r\nEnd of SPOILER* \\n\r\n---------------------------\\n\\n\r\nthe final episodes which, combined with the series being self aware and parodying itself, bumped this show a point above its predecessor. \\n\\n\r\nIf the show took itself a bit more seriously in the second series, with a focus on tying up loose ends, it could have at least earned a hard 6 out of 10. A break up of Tsukune's harem, and the character split from episode 11 (you'll know when you see it) would have done wonders. It could have turned into a slight critique of a harem instead of a parody, which given the stereotypical and often blind behavior of the characters, would have served the series well and could have still resulted in a happy ending. \\n",
            "date": "2016-07-04T01:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 223060,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4498911.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/walshc25",
                "username": "walshc25"
            },
            "url": "https://myanimelist.net/reviews.php?id=223060"
        }
    ],
    [
        {
            "content": "\"A series with splendid animation and soundtrack but poor storyline.\"\r\nMany many things have happened in the first season which was loosely based on the manga original, so logically we are expecting the storyline of Capu2 to continue from where season one left off. In fact, many many things do happen in Rosario + Vampire Capu2. They include the very exciting and daring (in the sense that they are pissing off the fans) censored fan service, more censored fan service, and still more annoying censored fan service. In terms of actual Rosario + Vampire story coverage, Capu2 literally got close to none with a few minorexceptions.\\n\\n\r\nStory:\\n\r\nSimilar to the previous season, Capu2 is also considered episodic (each episode is one mini standalone story). The \"monster of the week\" which received numerous criticism also returned though this time most of the \"monsters\" do not have much of an evil intention thus making most battles seem even more ridiculous (pointless) than before.\\n\\n\r\nUnlike the first season which still semi followed the story from the manga, Capu2 is almost purely fillers as evident in episode 6. To wrap it up, Gonzo pretty much taken out all the actions in the story and replaced them with censored fan service (how can it be called fan service if they are censored with a bear?). Obviously fillers unrelated to the actual story tend to make fans unhappy, but from another perspective it can be rather refreshing at times because even manga readers wouldn't know what might come next! \\n\\n\r\nAnimation:\\n\r\nUpon watching this anime, perhaps the first thing you'll notice is the supreme animation quality. Whether you are new to this series, or a fan from the manga original, the artwork in the anime is without a doubt impressive. It should be added that the animation quality throughout the series is very consistent, which certainly means a lot for a show intended for fan servicing. \\n\\n\r\nSound:\\n\r\nWhen compared to the first season, the OP and ED are certainly at the same level in terms of quality, thanks to our beloved Nana. It is plain evident that the OP and ED clips no longer relates to the story (unlike season 1's OP and ED which give hints to certain aspects of the plot), which is actually a good thing for this season since the production crew never had any intention of following the story anyhow. So a good OP and ED that matches their theme (ie. fanservice) would do the trick. \\n\\n\r\nGive Nana Mizuki tons and tons of credit for her amazing job well done for performing the OP and ED as well as being the CV for Moka. As stated in my Rosario + Vampire review, Nana has an amazing ability to sing thus allowing her to win the “Best Musical Performance” award in the first Seiyu Awards.\\n\\n\r\nCharacter:\\n\r\nI was quite surprised when writing this review that there were hardly any character development in this season. Not only are the characters' hidden abilities STILL have yet to be included in the anime, but nothing really changed from the first season's ending (as expected from a filler series). Season one definitely did a better job in this department.\\n\\n\r\nEnjoyment + Final Thought:\\n\r\nThe heavy censorship really made the show very not enjoyable for me. If you want to watch the series uncensored, you'll have to wait for the DVD release. Overall, Rosario + Vampire Capu2 served its purpose as a filler and \"fanservice\" series.  Having strong animation quality and great sound track makes up for the lack of story and pretty poor character developments. I recommend this series for people who like good quality animation but if you want story development, you'll be best to skip this.\\n\\n\r\n*Note* The review is based on the broadcast episodes (ie. TV), the DVDs have no impact on the review.",
            "date": "2008-12-25T11:13:00+00:00",
            "helpful_count": 162,
            "mal_id": 10623,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/45603.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KaminaKai",
                "username": "KaminaKai"
            },
            "url": "https://myanimelist.net/reviews.php?id=10623"
        },
        {
            "content": "The Short Review for the Reader without much time:\r\nStory (3/10): What story?! Well, there was a storyline for the first and last two episodes of this anime, and then 9 episodes of filler. 9 EPISODES OF FILLER IN A 13 EPISODE ANIME. Is this anime so inconsistent that it can't even stick to the plot for over two consecutive episodes?! Hence the low score.\r\nArt (8/10): The art is the best thing about this anime, is is fluid, clean, detailed, and rich in color.\r\nSound (6/10): The music matches the anime pretty well, ecchi all the way. It's the video with the music that is...interesting.\r\nCharacters (6/10): Thecharacters all have flat personalities: they all love the guy, and they are all...lets just say &quot;brave&quot; in public.\\n\r\nEnjoyment (6/10): Eh. Some new developments that were quite interesting. Mostly mumbo jumbo.\\n\r\nOverall: (5/10)",
            "date": "2009-01-19T18:40:00+00:00",
            "helpful_count": 106,
            "mal_id": 11700,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78816.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Dr_Jan_Itor",
                "username": "Dr_Jan_Itor"
            },
            "url": "https://myanimelist.net/reviews.php?id=11700"
        },
        {
            "content": "I'd like to set record straight and give you an honest review. The series, as a whole, first and second season are based, rather LIGHTLY, on the Manga of the same name. Keep that in mind.\r\nRosario+Vampire is a show that FEEDS off of fan service, harem stereotypes, and it's own unique sense of humor within it's story. Don't expect anything more than that. Take this anime as it is and you have a pretty decent show to watch and pass the time by.\r\nStory: 6\r\nThe story isn't like the manga. Not even anime adaptations are anything like the \"book\" it seems. Rosario+Vampire's story is chopped upinto pieces for the most part, and each episode is it's own slice of life for Tsukune and the gang. Repetition...often. Less than the first season though. Only in the last few episodes does a real epic story that runs smoothly begin to come together. Lots of fan service, lots of laughs because of how the harem is put together etc. don't expect much more and enjoy it for what it is.\\n\\n\r\nArt: 8\\n\r\nGonzo, as usual has done a fantastic job animating the show. It's very smooth, and nice to look at (no I'm not talking about the fan service). I've seen better, but Gonzo does a good job at keeping it consistently decent.\\n\\n\r\nSound: 8 \\n\r\nLike I said, Harem, Ecchi, whatever you want to call it, the soundtrack to this show fits it very well. The ever now famous \"Churu Churu Paya Paya,\" is a masterpiece score for some scenes in this anime, along with other songs that really pull the show together and make it's comedy valid. Add that up with amazing OP and ED songs for BOTH seasons by Nana Mizuki, and you have yourself a good anime soundtrack.\\n\\n\r\nCharacter:6\\n\r\nYou have Tsukune, the wimpy lead with a huge heart, you have your moe in Moka, you have your...Tsundere?...I suppose in Inner Moka. Kurumu is your typical flirt, Mizore is the all out stalker, Yukari is your loli, add in some adult themes and BAM generic anime harem right? WRONG. Though I rate it low for extreme lack of character development, the characters take on their own personas for the anime. BECAUSE it's set in a unique monster environment, each character has certain special traits about them. Given they are emphasized more on in the manga, but the anime at least gives you the basics. I can't say I've seen many other ecchis with a Vampire, Succubus, Snow-Woman, and Witchling all after one guy. Tsukune however stands out among the bunch, though he seems like a below average student with good intentions, there's more to him. He genuinely cares for the others, all as friends, and wants to be able to protect them. This is shown frequently in the series that though he is powerless, he's willing to fight, no matter what the cost. Which does lead to some interesting situations.\\n\\n\r\nEnjoyment: 9\\n\r\nI laughed...I laughed. It IS enjoyable for what it is. A harem anime with your typical stereotypes played on well, with your BIG twist of them being monsters, and Tsukune being human. Decent bit of action to sate that hunger, and watching Tsukune progress ever so slightly as a character was cool. Don't come expecting anything more than laughs, fan service, and a few decent romantic/admirable scenes. \\n\\n\r\nOverall: 7\\n\r\nGood anime. Not the best, not terrible. They advertised as an ecchi, they sold an ecchi to the public. You view it as anything else and you'll hate it....but then that'd be your own fault. If you need to pass some time by, and you like the genre, give it a look. One of the best harem animes in a while, here's hoping for a 3rd season with more story and character development than we've seen!",
            "date": "2012-08-31T00:08:00+00:00",
            "helpful_count": 49,
            "mal_id": 71233,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1313375.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AkihisaYoshii",
                "username": "AkihisaYoshii"
            },
            "url": "https://myanimelist.net/reviews.php?id=71233"
        },
        {
            "content": "Well, so it’s come down to this… “Rosario + Vampire” is an anime show directed by Takayuki Inagaki about, uh, well, gratuitous panty shots and full-blown harem mayhem. The story is straight-forward enough to actually make sense too: Tsukune Aono is your typical high school protagonist who plays the nice guy role way too well. One day, while heading to his mysterious new high school in the middle of what appears to be a dead forest/graveyard, he is run over on a bicycle by Moka Akashiya, a classmate of his. Immediately, these two seem to hit it off, until Tsukune discovers that Moka is actuallya vampire and the high school he’s attending consists of nightmarish monsters. Eventually, Tsukune is forced to keep his human identity a secret for fear of his own life, while also attracting the attention of a group of girls all lining up to have sex with him, typical of your harem/ecchi show.\\n\\n\r\nI just want to make this known: “Rosario + Vampire” is a terrible show. In fact, so terrible that I actually found myself really enjoying it at times. There seems to be a very basic formula to each episode too: Tsukune, being the dumbass he is, manages to get involved in some life-threatening conflict with a dangerous student or teacher, and Moka is forced to change into her “badass” vampire form to save the day while the narrator, being a bat with the most annoying voice in anime history, inexplicably totals up the running time each battle took… for reasons I have yet to know… It’s formulaic, yes, but that doesn’t mean I didn’t have a ton of fun with it. There’s a cheesy undertone throughout that makes it oddly entertaining, and while the nudity is flaunted around this show like clothing is illegal, it adds a kind of quirky vibe to the characters themselves. I shouldn’t go too into detail with the other characters apart from our two protagonists because, well, they’re cardboard cut-outs from other harem anime and are too uninspired to really give a damn.\\n\\n\r\nHowever, “Rosario + Vampire” has a secret power: it is so facepalm-worthy, that at a point, your brain adjusts to the crude, dry humor and eventually you find yourself laughing a lot. The comedy in this show is hilarious when it wants to be, especially an episode when Tsukune is followed home by the stalking group of girls over summer break, and is introduced to their mother, who witnesses them in *ahem* compromising situations that leads her to believe her son is a sex fiend. It’s actually one of the funniest episodes I’ve watched since that exam episode in “Angel Beats!”. I feel like I shouldn’t dismiss the strengths of the show either, because the last few episodes of the first season are legitimately great, as well as a bulk of episodes in the second season.\\n\\n\r\nAs much as I enjoyed most of it, there’s just also too much wrong with “Rosario + Vampire” to fully recommend it. While it does have it’s fair share of comedic genius and suspenseful moments, these are too rare in the show to really call it a saving grace. The chemistry between the “so inoffensive, it hurts” Tsukune and “Lucy from Elfen Lied 2.0” Moka is actually pretty good too, and provides an ongoing gag that never gets tired. But overall, it’s decent fun at best. If you just want to take a break from a serious anime, switch off your brain and let this soak in. Otherwise, watch “Love Hina” if you want great harem…",
            "date": "2013-09-18T09:32:00+00:00",
            "helpful_count": 42,
            "mal_id": 113307,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3150425.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/blazeMX",
                "username": "blazeMX"
            },
            "url": "https://myanimelist.net/reviews.php?id=113307"
        },
        {
            "content": "Let me first explain each score that i gave:\r\nStory : 8\r\n -It's good to know that Moka has sisters in her family. not only 1 but over 3 of them plus Moka which adds up to 4. That simply means, more harem!(i hope)\r\nArt : 9\r\n -I don't have to say it but all the characters(girls) look great! i mean, not in a  perverted way but in a bishoujo type of way. They never stop to amuse us with there art. i mean, look at shirayuki's and kurumu's mothers!\r\nSound : 10\r\n -You guys gotta admit, the op kills! Discotheque is one of few songs thatare made with a theme which isn't new(disco theme) to the 21st century with such a cool beat! not to mention the part in Ep3 where Mizori and Kurumu had a song battle during music class. And also their BGmusic is really something!\\n\r\nCharacter : 9\\n\r\n -Talk about Kokoa's twisted love, that really is quite cute. Not to mention the saying, &quot;Like Mother, Like Daughter.&quot; Look at Shirayuki's mom. she was stalking Tsukune behind the table! \\n\r\nEnjoyment : 9\\n\r\n -From the previuos scores i gave, there is no need for me to explain why i gave this score.\\n\r\nOverall : 9\\n\r\n -Such a great combination of characters into one anime. I hope to see more sequels to come after this.",
            "date": "2008-11-04T02:17:00+00:00",
            "helpful_count": 24,
            "mal_id": 9227,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/99282.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/huhahu68",
                "username": "huhahu68"
            },
            "url": "https://myanimelist.net/reviews.php?id=9227"
        },
        {
            "content": "Many people didn't like the fact the story didn't follow the manga, and didn't have much of a point. There were quite a few episodes of random nothing-ness that had really nothing to do with the plot, but they still had their comedy/romance aspects that kept you watching.\r\nStory 6/10\r\nThe story wasn't really that developed in either of the seasons, I wish they would have gotten a bit more in depth with Tsukune and his new vampire powers. It was still a hilarious storyline, I didn't mind all that much\r\nArt 9/10\r\nI really liked the art style in this anime. The characters looked nicely drawn and symmetrical.\\n\\n\r\nSound 8/10\\n\r\nThe sound effects were pretty nice, I didn't expect much from them since it was going to be a comedy/harem type deal. However, the english voice acting was spot-on. You can't go wrong with good ol' Haberkorn as a main :D The song in the second season was pretty beastly, I dug the bass line in the disco song very much. \\n\\n\r\nCharacter 8/10\\n\r\nThe characters were all pretty likable and had different traits. Specially the girls HUEHUE. \\n\\n\r\nEnjoyment 9/10\\n\r\nI really liked watching this anime even though there were a bunch of random episodes. These types of anime don't exactly need a good story-line to be likable, but it would help.\\n\\n\r\nOverall 9/10\\n\r\nThis was a really good 2 season anime. Even though a lot of people dissed it because of the story-line not matching the manga and all that, I still liked the comedy/harem aspect of it.\\n\\n\r\nThanks for reading this review! first of many to come C:",
            "date": "2014-02-21T05:27:00+00:00",
            "helpful_count": 19,
            "mal_id": 133343,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3535449.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Scragleton",
                "username": "Scragleton"
            },
            "url": "https://myanimelist.net/reviews.php?id=133343"
        },
        {
            "content": "When I heard this series was going to Capu2 I almost cried with happiness. The story follows a very cliche harem/ecchi plot, which is a guy surrounded by girls in a magical world, and each one of them dig him.\r\nFrom there, you can already understand what's going to happen. For the first season, it's tiny sub-stories with a dramatic ending. BUT the thing is that the humor in this story totally makes up for the lack of serious plot. And for you ecchi lovers..well there's only two things that we are pleased with and this show has it and you know what I mean.\r\nOverall I'monly giving a rating to the first season, which is an 8/10. As for the second season, I have high expectations and so far they have been fulfilled.",
            "date": "2009-04-01T20:21:00+00:00",
            "helpful_count": 12,
            "mal_id": 13759,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13759"
        },
        {
            "content": "Story: \r\nOk now let me tell you this the story isn't bad sometimes it does go a nice route but other is just random stuff. Well it's a harem, so can you really complain?\r\nArt:\r\nAmazing the art style is really great and the animation is extremely good. Those character designs tho... MIZORE FOR THE WIN!!!\r\nSound:\r\nThe sounds are happy and joyful, they don't get annoying if they are re-used. \r\nThe voice acting is okay... But damn the English dubbed is amazing i don't like watching anime in eng dub but this anime FREAKING nails it!!\r\nCharacter:\r\nHmm most of them can get really annoying *cough* THE SUCCUBUS. Oh! Can'tforget about the loli witch... Mizore is easily the most calmed and less annoying and Moka, i like her Original form with white or silver hair IN MY OPINION.\\n\\n\r\nEnjoyment:\\n\r\nI just kept watching this anime in my bed in excitement i don't know why it's just so funny and cool. The boobs and stuff don't really bother me or interest me, i just like the comedy and the action or most likely the stupid stuff that happens \\n\\n\r\nOverall: \\n\r\nAmazing anime... Would recommend IF you're looking for a fun anime.\\n\r\nWouldn't recommend if you don't like the sexual scenes.",
            "date": "2015-04-10T20:16:00+00:00",
            "helpful_count": 6,
            "mal_id": 185344,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4549938.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Raffkakashi",
                "username": "Raffkakashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185344"
        },
        {
            "content": "Well god the story is this: A guy who is really not cool at all, has three hot chicks and a little girl lovin him. And he only likes one. He goes through random situations at a monster school.\r\nI feel like its all filler, really.\r\nAnd its an ecchi anime, itll have seens with ecchi. Then random they will start censoring things. You DO NOT censor anything in an ecchi anime unless its like hentai but not if its upskirt. Especially when they are hot sexy chicks.\r\nNo YOU DONT DO THAT!\r\nThe character is actually very good, the thing that ruins it is the main guy, hesreally not developed and doesnt have a unique personality at all.\\n\r\nMy enjoyment is not that high, cause i dont know where they are going with this.\\n\\n\r\nReally watch the first season. And save this at a time where you dont want to watch an anime where itll make you start having high expectation. Act like this is a Naruto filler except not as retarded and pointless!\\n\\n\r\nThanks for reading!",
            "date": "2008-12-15T18:18:00+00:00",
            "helpful_count": 6,
            "mal_id": 10414,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83382.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/FRESHShaZaM",
                "username": "FRESHShaZaM"
            },
            "url": "https://myanimelist.net/reviews.php?id=10414"
        },
        {
            "content": "Story? Who cares? You're watching this for the fanservice, and as a harem, you should be pleased with 13 episodes of 99%, \"Tsukune, Tsukune, take me.\" That's basically what it is; and it's implied ****SPOILERS**** that he and Moka (pink-haired) get together. \r\n****POSSIBLE SPOILERS FROM HERE ON IN****\r\nIt's funny, actually. I think there's only ONE kiss the entire second season between Tsukune and any of his four girl \"suitors,\" and it's not even Moka, I want to say it's Mazore (sp). \r\nAnyway, getting a little sidetracked there... you will enjoy this season if, like me, you enjoy fanservice and enjoy receiving a healthy dosage everyepisode. If I just described your tastes, come on in, enjoy the ride.\\n\\n\r\nStory: N/A\\n\r\nI won't rate something that's not present. Don't take it negatively, the season did what it had intended to do and did it surprisingly well.\\n\\n\r\nArt: 8\\n\r\nR + V has always had solid artwork/animation. However, this would be a 10 if they had kept the animation standards up to what they were churning out in the beginning of R + V, season 1. I mean, take a look at the opening credits: that's some dang good animation.\\n\\n\r\nSound: 7\\n\r\nAbove average.\\n\\n\r\nCharacter: 9\\n\r\nWith fanservice comes character development. Better than the first season for sure.\\n\\n\r\nEnjoyment: 8\\n\r\nLiked it more than the first, but that's really because of my taste in anime. I haven't read the manga, but I'm sure I'd have more negative things to say if I had. In hindsight, I would've liked to have seen a Moka x Tsukune kiss sometime during the series. Basically, it would've made the 13 eps. completely worth it.\\n\\n\r\nOverall: 8\\n\r\nHey, if you liked the first season, but you  just wanna feel giddy about relationship business, this one's for you.",
            "date": "2009-10-15T23:55:00+00:00",
            "helpful_count": 6,
            "mal_id": 19717,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/243290.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Saintly",
                "username": "Saintly"
            },
            "url": "https://myanimelist.net/reviews.php?id=19717"
        },
        {
            "content": "I watched rosario+vampire capu 2 expecting something even more badass than the original show, and found that it was basically the same. There was still a bunch of meaningless fanserve (which I am all for) and it was still a harem which almost guarantees that nothing of deep import will happen.\r\nOnce again, the story follows tsukune; a complete pussy who seems to attract all the women, and moka the vampire whos into him. Also there the succubus, ice woman, witch, and this season brings us a brand new vampire. The new vampire is moka's sister kokua, and she is the first female character not tojoin tsukune's entourage... FINALLY! \\n\r\nAlso brought back from the original show is the stand alone episodes with a few conjoining at the end, but as ive said before this is how the manga was too so I will forgive it. However, while i'm on the topic of of the story; many people will expect a continuation from where the last season left off in the manga. This is not the case, in fact very little has anything to do with the manga itself at this point and now it is just a continuation of the first season instead of the manga.Now they are even tossing in filler episodes, I dont see why when they have so much manga to work with but whatever, I can and have forgiven them for some of the episodes that were really good, but some of the episodes in capu 2 just suck terribly so be on the watch for that. Another thing is that tsukune still doesn't use his vampire powers to open a can of whoop-ass on anybody this season either, so that kinda disapointed me.\\n\r\nAs before, the fights can be measured in a matter of seconds, and it would almost make more sense to cut em entirely but, what do I know. Also, in capu 2 you are about as likely to find the characters having a friggin sing-off than anything else, so hopefully you can get past the lameness of these situations or you will not survive this show.\\n\r\nOnce again the art is great just like the 1st season, and the characters are still a dynamic bunch, even if they havnt changed at all since season one. There was also a pretty good soundtrack for this show. I enjoyed watching capu 2 as a fan of the original manga and the 1st season, but maybe it can be said that you will enjoy this more if youve never read the manga... maybe. Still in all, I liked it, it was good stuff.",
            "date": "2013-01-25T12:12:00+00:00",
            "helpful_count": 6,
            "mal_id": 84803,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=84803"
        },
        {
            "content": "well there is not much to say about this anime ... if you have already seen the first season, but for those who haven't seen first season I strongly recommend watching season 1 :], and if possible just skim through the manga so that you see what's coming.\r\nSTORY:\r\nthe story starts pretty random like the last season, a little too similar to you average slice of life comedy but i believe it should pickup like the manga. hopefully. \r\nART: \r\nthe art is very good, but so far those little bats censoring the partial nudity are getting annoying, not that i am a hentai or anything butsometimes a little partial nudity is good. \\n\\n\r\nSOUND: \\n\r\nthe sound is ok... the opening song is good but the video for it is better. but i think this anime is missing the little &quot;lalalalala   lalala lala &quot; from the first season lol. \\n\\n\r\nCHARACTER:\\n\\n\r\nthe characters are the same ones from the firs season except for moka's little sister that dwells arround trying to fight moka, but in my opinion Mizore-chan it still the best :] \\n\\n\r\nENJOYMENT: \\n\\n\r\ni give enjoyment a 10 because this anime is very easy to &quot;fall for&quot; The characters are lovely and very lively which makes the series very fun and easy to watch.",
            "date": "2008-11-25T09:22:00+00:00",
            "helpful_count": 5,
            "mal_id": 9835,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/89159.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sphiroth",
                "username": "Sphiroth"
            },
            "url": "https://myanimelist.net/reviews.php?id=9835"
        },
        {
            "content": "In honesty I didn't think this was a good show, I felt like each episode had the same guidelines as the others. The characters personality was the same as any other harem/ecchi and to be honest the story is not thought out very well. Also, why do they stare at each other for so long, the amount of time they stare at each other is probably more than 2 good fight scenes WHY WOULD YOU FILL THE TIME LIKE THAT. I found some scenes funny and different but they seriously need to change it up a bit.",
            "date": "2015-08-24T23:41:00+00:00",
            "helpful_count": 5,
            "mal_id": 196978,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ElvenHighKing",
                "username": "ElvenHighKing"
            },
            "url": "https://myanimelist.net/reviews.php?id=196978"
        },
        {
            "content": "Story (5/10) - This series is loosely based off of events of the previous Manga, and aside from that, there really isn't much improvement in terms of story, whether you read the Manga or not.\r\nArt (7/10) - Same as the previous adaption, nice and colorful.\r\nSound (6/10) - An improvement over the original. The visuals accompanying the songs of the Intro and Outro are one of the positives of this show.\r\nCharacter (6/10) - More or less the same as before, just shifting to different characters.\r\nEnjoyment (6/10) - I watched this out of curiosity after finishing the first season. It wasn't bad, but it wasn't really animprovement either. \\n\\n\r\nOverall (6/10) - This wasn't the best Anime, not by a long shot. It was an improvement over the previous season though, but not by much. Fingers crossed that the ending Manga will make up for it.\\n\\n",
            "date": "2017-12-05T23:41:00+00:00",
            "helpful_count": 2,
            "mal_id": 264618,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=264618"
        },
        {
            "content": "To be fair, this is not the worst manga-to-anime transitions i've ever seen but I could have expected better. Unlike the action manga series, this mainly focuses on more of a romantic-comedy ecchi base. Mainly to my dissapointment, is that it doesn't quite follow the manga story whatsoever. But overall it's okay but not so much exciting to watch. I would rather stick with the manga series.",
            "date": "2010-05-17T13:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 26146,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/326936.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AnimeCheeze",
                "username": "AnimeCheeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=26146"
        },
        {
            "content": "While I did like this there is many, MANY plot holes and story elements they do not touch on or start to, but forget totally about it...the major one being the main character, Tsukune.\r\nIf you want this to make any sense, make sure to watch Rosario + Vampire before this one.\r\nWARNING: SPOILERS\r\nI was happy with how the first one ended; Tsukune was able to stay at the school because he was changed into a vampire and in the first 5 mins of the first episode on this one; his mom makes a comment about him not drinking raw water. This alone shows she knows; Despitethis however, through the rest of the series he shows no increase in ability and is referred to more or less as a human by the rest of the group and of course, for the rest of the series he still is unable to really fight. Why does this bother me so much? simple: they left out a huge plot point of development for the character.\\n\\n\r\nHe has already accepted the school is full of monsters and already accepted the girls defending him; however if they focused more on the fact that he is now a vampire rather than tossing in random episodes which, while funny provide no character or story build then the series would have been majorly better.",
            "date": "2012-03-16T17:48:00+00:00",
            "helpful_count": 4,
            "mal_id": 56119,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/FateStCloud",
                "username": "FateStCloud"
            },
            "url": "https://myanimelist.net/reviews.php?id=56119"
        },
        {
            "content": "After enjoying the first R+ V , I picked this up with high hopes that it would continue to be as good, and it did an alright job of maintaining the standard. Having not read the manga I can't comment on how true to it it was, but the plot was again the basic harem plot and a continuation from the first series with an added character in Moka's sister, Kokoa. Overall, the plot wasn't as good as the first, a lot of the stories didn't seem to lead anywhere new, whereas in the first season the episodes felt like they were all leading somewhere.\r\nTheartwork is still the same gonzo team that did the first and is still the same fantastic quality we have come to expect from them, the sound I'm marking down slightly on the first episode, mainly due to the overuse of irritating catch phrases, which seemed to appear just to disrupt the storyline in most places, still the same voice acters/esses are involved so the sound isn't changed from the first season. \\n\\n\r\nThe characters are all the same bunch from the first season with the additions of Kokoa and appearances from the mothers of the group, Ruby also appears a lot more in this season. This might have been OK, but a lot of the scripting for the newer characters made them annoying to watch, Kokoa especially was grinding my gears towards the end of it, and character development on Ruby was non existant, I was however glad that they did answer a few of my questions from the first season with Moka, all in all the characters were still fun to watch (Kokoa and Ruby aside).\\n\\n\r\nI did enjoy the series, and its a very easy one to watch, it just suffers from the sequal hangover like so many anime titles seem to in that it just doesn't live upto its predecessor. Not to say that this doesn't give it a good go of it, definately worth a watch if you've been watching the first season, and for anyone new, watch the first season first!",
            "date": "2009-08-04T13:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 17466,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GeneralCox",
                "username": "GeneralCox"
            },
            "url": "https://myanimelist.net/reviews.php?id=17466"
        },
        {
            "content": "Okay ummm, this wont be any in depth review...But in my opinion this was an incredibly painful series. This along with the first season played out in the same event format every time...(and i mean always)...the first 8-9 eps consist of Aono getting into trouble, tearing the rosary off Moka's chest....then as a result Moka saves the entire group...Now i understand this is a comedy but I think the variety of storyline in each episode made it such a drainer to sit through. Okay now in the last 2-3 eps of both seasons, its like they finally decide they want to be serious and havea storyline.....and for once they decide 'Hey, maybe we will let Aono do one cool thing before we revert him back to his damsel in distress useless self'. \\n\\n\r\nNow dont misunderstand, if they were going for this comedy without a plotline then its fine....But the fact they try to introduce something serious in the last moments of both seasons, makes me frustrated as too why I watched the first 9 useless episodes....Soooo yeah this is a pretty fresh review so I guess in contains some resentment over the forever repeating plotline of this show...But there u have it...\"Rosario + Vampire\" in a nutshell. \\n\\n\r\n(Over Rating a 7, cause im giving it the benefit of the doubt, as possibly the fact that its a comedy excuses it from have a varied plotline in each episode -.- )",
            "date": "2014-11-07T14:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 167767,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4113711.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RasenRum",
                "username": "RasenRum"
            },
            "url": "https://myanimelist.net/reviews.php?id=167767"
        },
        {
            "content": "This show has made me feel so many different emotions over the few months i've been watching it, and i honestly think this is my favorite Harem/Romance/Action anime there is....\r\nAnyways, starting with this story....The story continues from the first season, which was also really good. You have a lot of family drama here, as Moka's sister tries desperately to get her \"real\" big sister back, and on top of that, have many \"little\" stories here and there that doesn't really fit the main story line.... But again, being a Harem anime, there's a lot of what you would expect from that genre in this anime.But that doesn't, in my opinion, make this any less-good. For the story overall, it's pretty solid, but could use more STORY, if you know what i mean.\\n\\n\r\nI LOVE the artstyle for this anime, it's what i think about when i think of anime, and personally it's what brings me back to this series. But, not much else to say, it's all really nice \"looking\", heh, if you get me.\\n\\n\r\nSound is good, OP get's stuck in your head, but it's not that bad so i wouldn't worry. The English Dub, for both seasons is really good, and all the characters voices fits with them. Great job here.\\n\\n\r\nSo, being a harem anime you wouldn't expect there to be that many memorable characters, or even any character development at all. But this anime, like High School DXD, has really memorable characters, and personally they're some of my favorites. This anime really brings out very distinct personalities and feelings from each character, specially how a succubus DOESN'T use her powers to get Tsukune under her control, but yet, tries the \"old fashion\" style...and i like that. Like i said before, there are times when this anime does go way overboard with the fanservice, but deep down, this anime has very good character development, and memorable characters...\\n\\n\r\nMy overall enjoyment is just perfect. I LOVE this series and will rewatch it many times to come. But i am sad how this series doesn't have another season, i feel like they could renew this series and finish the fight between the four girls, i really wanna see who Tsukune picks, but i think it's pretty obvious. OVERALL, i love this series, and i personally think if you haven't seen it, you need to watch. \\n",
            "date": "2016-08-31T19:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 228030,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=228030"
        },
        {
            "content": "I found this season to be better from the last one. Season 1 of R+V was so bad, I had to consume alcohol to finish watching it. It was just a mess of a harem anime. \r\nIt seems however, that the creators of Season 2 agreed with me, and decided to create a second season to parody the first. Parodying your own series with your own series, a very bold move. \r\nThe series kept the harem in a form of stasis, with catfights erupting here and there even though the main guy is clearly into the vampire chick above and beyond the other girls. Thecharacters were dumb, and fought, and the story was all over the place but it seemed like every character in it, when they weren't at the center of the episode, knew just how bad this show was and expressed the sentiment. The Succubus being the one to least give a damn about criticizing the show. \\n\\n\r\nMAJOR SPOILER* \\n\r\n------------------------------\\n\\n\r\nHowever, I'm going to give the season some credit on the final episode. It started to move from a silly parody into hitting at the heart of all harem animes. \\n\\n\r\nBoth Real Moka and The Succubus Kurumu actually came across as being genuinely hurt by Tsukune's feigned indecisiveness. Real Moka tried to maintain the relationship and attraction between her and Tsukune, but it just wasn't good enough for him because she wasn't the ditz. The character did seem genuinely sad as he just runs off leaving her to stand alone. \\n\\n\r\nAdditionally, in the final two episodes,  Kurumu lays it all out there as to why she likes him and how she's been with him from the start. She even gets he's not going to pick her and expresses being upset that he never even looked back at her as heads into the castle. \\n\\n\r\nI felt these scenes to be somewhat sad, and indicative of the result of a harem anime. Someone(s) is going to end up heart. I'm glad they briefly touched on this before resetting the status quo. Both of these two had somewhat genuine reasons as to why he should care/be with them. Yet he chooses the stereotype instead. \\n\\n\r\nThe witch girl ultimately admits to basically being down for a polygamous threesome with Tsukune and Moka, so I don't buy her romance,  and the Ice Girl, maybe because I missed something, didn't seem to be genuinely in to him so much as she wanted to be into some guy. \\n\\n\r\nEnd of SPOILER* \\n\r\n---------------------------\\n\\n\r\nthe final episodes which, combined with the series being self aware and parodying itself, bumped this show a point above its predecessor. \\n\\n\r\nIf the show took itself a bit more seriously in the second series, with a focus on tying up loose ends, it could have at least earned a hard 6 out of 10. A break up of Tsukune's harem, and the character split from episode 11 (you'll know when you see it) would have done wonders. It could have turned into a slight critique of a harem instead of a parody, which given the stereotypical and often blind behavior of the characters, would have served the series well and could have still resulted in a happy ending. \\n",
            "date": "2016-07-04T01:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 223060,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4498911.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/walshc25",
                "username": "walshc25"
            },
            "url": "https://myanimelist.net/reviews.php?id=223060"
        }
    ],
    [
        {
            "content": "Rosario + Vampire was the first anime show I have watched other than Pokemon 10 years ago. As far as the story line is concerned, I found the concept unique and it was an enjoyable series to watch. The story line is taken lightly and not as serious as Death Note or Code Geass, but overall it has its perks. The synopsis of Rosario + Vampire is that Tsukune Aono has failed to get into High School but due to a mix-up is sent off to a school for monsters. He there meets a girl named Moka Akashiya and they quickly become friends. Despite hisnewly found friendship, he still has to worry about the \"no humans\" policy that would lead to an execution if he were ever caught. The art in this series is spectacular and honestly one of the bests out there. When compared to other series, this one takes the win for best art next to High School DxD in my opinion. It is a laughable series that is enjoyable to watch. It may not be for everyone seeing how it is still an ecchi. This series, however, has light sexual messages, which for some people is great. For the others (perverts), there is not much to see so maybe stick to DxD. Even though this series does not have the best story line, I still enjoyed it and recommend it.",
            "date": "2016-06-09T19:13:00+00:00",
            "helpful_count": 3,
            "mal_id": 220388,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5396053.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LelReaper",
                "username": "LelReaper"
            },
            "url": "https://myanimelist.net/reviews.php?id=220388"
        },
        {
            "content": "Story [4]: Yes the story is poor. It doesn't really have much of a plot, HOWEVER, for this show's genre, it is decent\r\nArt [8]: Pretty top notch, enjoyed the visuals quite a bit.\r\nSound [9]: not really sure the sound could get much better than it already is.\r\nCharacter [10]: yes, I rated the Character category ten, and for good reason, the characters supply everything a Harem anime needs. There is even some character development, which rarely happens in Harem style anime\r\nEnjoyment [9]: I have never read the manga (the only manga I have gotten really into is Beck) so i cant say whether it is better,like many others are saying. I Enjoyed this, what else could i say?\\n\\n\r\nOverall [7]: Despite it's story flaws, I would recommend this series to any fan of Harem type anime (although you should watch the first season before this) \\n\\n\r\nCapu-Chu!",
            "date": "2011-09-01T16:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 42541,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/461614.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/thefunnyzach",
                "username": "thefunnyzach"
            },
            "url": "https://myanimelist.net/reviews.php?id=42541"
        },
        {
            "content": "* This is my first time writing a review, so if you think i need to improve or something. Please don't hesitate to tell me *\r\nSo just by reading this review, im pretty sure that you have watched Rosario+Vampire 1 already, for obvious reasons. Therefore, you probably know a brief idea about the anime already. So im just gonna get started on what i like/dislike about this anime.\r\nI have to say that the storyline of this anime is better than the first one however when i think about it.. it is kinda the same. Being a \" inner-moka fan\" i definitely liked this one betterthan the first season because there are more scenes of the inner moka,and i also got to know more about her in this season. It was also really interesting and entertaining meeting new characters such as the girls parents and family. Also how these girls resemble their parents is just fun to watch, especially when they get into fights and all that. \\n\\n\r\nMoving on to the Art, if u have watched the 1st season you will know that the art is amazing. The characters are all well drawn and the artist ( or whoever you call them) uses amazing colors in the anime which draws your attention and gives you a \"WOW\" feeling. For example when it is snowing.. the colors that they use is so amazing. It makes me want to be there and see it in real life ( i dont know if its weird to say this, its a magical feeling).\\n\\n\r\nMy favorite thing about this anime, is the soundtrack. Nana Mizuki has done such an awesome job with the song she sang.. i just love it! The director puts in songs at the right moment, not just randomly which is good. Anyway all the songs in this anime is just catchy and i ll promise you that you will find yourself downloading the soundtrack when u first listen to it.\\n\\n\r\nThe Characters are interesting, and im just kinda disappointed that they didnt show more of Kururumu or the others girls. And in my opinion the outer moka is sometimes to annoying. Some scenes that annoy the crap out of me it when Tsukune and Moka just have those random scenes where they stare at each other. And i also feel that some characters should have more scenes then some but alwells. Another thing that annoys me is when Moka's rosario gets taken off her and there's always this guy explaining what happens to moka when it gets taken off her. I understand why they would tell the audiences for the first time seeing and so, but telling us what was happening to her everytime Tsukune took the rosario off her whenever there was a fighting scene? was just too much.\\n\\n\r\nIn the end, i give it a 7/10 it wasn't a masterpiece however it wasn't bad. I just felt that they rushed the ending.. and they they shouldve made the storyline abit longer and give audiences some more intense fighting scenes ( but i have to say that fighting scenes in the first season is much more better than the 2nd season). So lets hope that they'll make another season that will be much better!!\\n\\n\\n",
            "date": "2012-01-22T20:37:00+00:00",
            "helpful_count": 3,
            "mal_id": 52359,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1103877.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/candylaful",
                "username": "candylaful"
            },
            "url": "https://myanimelist.net/reviews.php?id=52359"
        },
        {
            "content": "Let me explain this will be my first review.. I felt I should write a little review on it because I didnt find an of the others to be very positive nor helpfully informative enough. I hope I do my best!\r\nLet me first explain the style of this is Comedic High School Ecchi.. The only thing I found somewhat annoying between this and season 1 was the censored fanservice.. but at times I also found it sort of funny. I think if you enjoyed the first season.. Watching the second season is a must.\r\nI.. unlike some of the other reviewers found alot of character development..Therewere episodes that were almost entirely based upon one of the central characters..The girls are still charming and beautiful in their own ways.. Moka, Yukari, Kurumu, and even the gorgeous Ruby..still have infectious personalities.. that are hard to resist..and the addition of Kokoa makes things interesting..\\n\\n\r\nThe story for the second season is good.. and it follows the first seasons basic concept of a guy trying to deal with being thrown into a strange school.. and making new friends.. with strange circumstances.. I know at times it doesnt follow a basic \"flow\" and the storyline changes.. but I never found any of the episodes to be boring.. they all contained the same comedic happenings as the first season..\\n\\n\r\nThe animation is great.. as expected... and the opening song gives you a feeling of the fun and laughs that will follow in the episode..and I think fits well..\\n\\n\r\nI hope this helped anyone not being able to decide on watching the second season or not.. I definately suggest it.. I gave this an overall 8.. for its genre it was not a disappointment.",
            "date": "2010-02-18T07:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 23323,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/295985.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/anime_n00b",
                "username": "anime_n00b"
            },
            "url": "https://myanimelist.net/reviews.php?id=23323"
        },
        {
            "content": "Story: 5\r\nNot as good as the previous season, or the manga in that matter. Every so often, there will be an episode I thought was good, but most of the series was pretty bland.\r\nArt: 9\r\nI like the artwork a lot. The characters were drawn beautifully, and the scenery was fairly well drawn.\r\nSound: 7\r\nI like the voice actors and actresses for the characters, but the only problem is that it's one of those animes where you need to turn the volume up because some scenes are too hard to hear, and then need to turn it down when it get's too loud.\r\nCharacter: 8\r\nThe characters are allunique in their own way, although there are 1 or 2 characters that you seem to see a lot of in these types of animes.\\n\\n\r\nEnjoyment: 7\\n\\n\r\nI like the series, it's just that I wanted the story to focus on one major plot, but instead it was a bunch of random stories.\\n\\n\r\nOverall: 7\\n\\n\r\nNot as good as the previous season, like I said before, but it was fun to watch if you've wanted to continue from Season 1 for a while.",
            "date": "2012-08-26T12:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 70899,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1478729.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Caleb_Marvell",
                "username": "Caleb_Marvell"
            },
            "url": "https://myanimelist.net/reviews.php?id=70899"
        },
        {
            "content": "This was the best season of the series! I love this anime it is my favorite! I want there to be a Capu3! If you also want Capu3 then sign this petition for Capu3!\r\nhttp://www.gopetition.com/petitions/rosario-vampire-capu3.html",
            "date": "2012-06-20T17:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 63947,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1355979.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/ilovehetalia",
                "username": "ilovehetalia"
            },
            "url": "https://myanimelist.net/reviews.php?id=63947"
        },
        {
            "content": "One thing to say about this season - OP song. It was amazing! The music in this season alone was enough to bump this anime up a notch in my book from the previous season. But I also moved it up because of its ability to improve on developing the characters while still maintaining what was working in the first season. \r\nWhile I admit, the repetitive pining the female protagonists partake in over Tsukune started getting a little annoying, it was still entertaining enough for me to not really care all that much.\r\nOn top of this, reviewers pointed out how plot development was lacking andlimited to the first episode and last 2 episodes, but I felt the season was entertaining enough to again over look what was missing. But to expand on the plot development, it did start to actually get really interesting which led to another fault - it ended here! It could have definitely gone further with additional seasons easily. I really look forward to any additional seasons they might make.\\n\\n\r\nIn the end, I enjoyed this series quite a bit and it prompted me to pick up the manga right away in hopes of developing the plot and characters further.",
            "date": "2012-06-10T14:18:00+00:00",
            "helpful_count": 3,
            "mal_id": 63113,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1324431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akaelda",
                "username": "Akaelda"
            },
            "url": "https://myanimelist.net/reviews.php?id=63113"
        },
        {
            "content": "Awesome series, love the plot even though it strays pretty far from the plot of the manga. Capu2's animation got really good, I mean look at the opening alone... so good, very well done!",
            "date": "2013-02-19T08:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 87223,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1064527.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Partymachin3",
                "username": "Partymachin3"
            },
            "url": "https://myanimelist.net/reviews.php?id=87223"
        },
        {
            "content": "Rosario Vampire Capu2 is the second season of the Rosario Vampire anime. I did like this anime like the first season. Its a enjoyable anime. Well,its kinda fucking messed up and all,but it isn't terrible. It is full of ecchi,humor,and action,but it is full of strange episodes like(minor spoiler). The witch girl turning into a adult, Mokas little sister touching all over her etc. It isn't any better then the first season, but its still pretty good.\r\nStoryline7/10-NO SPOLERS. Tsukune is back in Yokai academy, home to monsters. Moka, the pink haired girl in love with Tsukune is back,along with Kurumu, Mizore,Ruby, the witch girl,and Moka'slittle sister.(shes a new character). Everyone does the same thing all over again. It is enjoyable,but its the same as the first season. Well,sort of,but you will find out :). Its good,but not amazing.\\n\\n\r\nCharacter7/10-The characters are good. Mizore is still the coolest character.(she really is cool. Like freezing. LOL). I like Moka's inner part of herself. Mostly because of her badass appearance. Most of the characters  are enjoyable,but that witch girl is so annoying,and Moka's little sister isn't any better. Mizore's mother and Kurumu's mother are so strange. Character development is lacking,which is also why its only a 7. The characers are good, but ive seen better.\\n\\n\r\nSoundtrack6/10-Rosario Vampire has a fair sound track. Well,its noting amazin. The new opening theme song isn't that good in my opinon.(unlike the other one in the first season). THe music is okay,but I guess its enjoyable. \\n\\n\r\nArt8/10-I love the art. Its so colorful and bright its just amazing. The characters look okay and all. There is nothing wrong with the art. Its great. Not perfect,but I still REALLY liked it. Just as good as the first season.\\n\\n\r\nEnjoyment7/10-Yeah,I enjoyed this anime. ECCHI animes were never good,but this one isn't to  bad. I enjoyed it quite a bit. Much more then I thought, because most ecchi anime are shit.\\n\\n\r\nOverall7/10-Its good. Not my favortive, but still good. Rosario Vampire Capu2 isn't anything like a masterpiece, and t doesn't in prove anything over the first season,but its okay to watch. It isn't a anime I recommend,because it isn't that good as other series, but for ecchi fans,enjoy.",
            "date": "2016-01-01T13:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 207475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4925811.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DarkRaven804",
                "username": "DarkRaven804"
            },
            "url": "https://myanimelist.net/reviews.php?id=207475"
        },
        {
            "content": "This is a direct sequel to the first season, and is very similar in many ways. However, overall I'd have to say that for the most part it's a good amount better. The loop is often the same, in that there's some sort of issue, they're all in trouble, Tsukune removes the Rosario, Moka defeats said trouble, and they all move on. However, instead of focusing on Tsukune for the most part as was usually the case in the first season, here the focus is generally on other characters. The build up also feels like it matters a lot more than the conclusion with thefinal scene of Moka destroying enemies being not as important, even occurring in the background at times, and when it was the focus it felt like it deserved to be. This allows to show off the other characters a lot more, and though there wasn't that much in the way of character or relationship development for the most part, what was there felt pretty solid, and furthermore it adds more variety and prevents the show from getting repetitive, which combined with the fact that the show is primarily focused on comedy and being amusing over the actual plot, it works quite well. This is the case for most of the show, and hence I think most of the season is a pretty solid improvement over the first season.\\n\\n\r\nThis falls apart however at the end, where things get pretty epic, but things also get kind of strange. The finale for this season finally has Tsukune taking a more proactive and impactful role in the plot, and finally actually getting into a real fight. However, his motivation for doing so felt completely off, in that he simply felt selfish. That combined with the fact that most of the show had him seem pretty clearly going for Moka, but the ending has him being indecisive at the end, makes him being the villain of the episode actually feel right in a way, but that in itself doesn't feel right either. One of the main reasons it felt strange was that it further developed inner Moka, and showed she had range to her personality, wanting to belong and such, but it also gave a reason for her being sealed in the first place that was pretty dumb. Hence, it felt difficult to be completely all right with Tsukune simply sealing her away again for the other Moka, especially as inner Moka was there first, and really it doesn't seem any more justifiable than what Kokoa wanted. Hence, I feel very conflicted about the entire relationship. This was an area that I think the show should have probably avoided entirely, because though they probably didn't intend the viewer to think that much about it, they got pretty close to it, and it really doesn't fit the tone of the show at all. Hence, it was an incredibly strange note to end on. I will admit though that the song and accompanying footage at the end was pretty great.\\n\\n\r\nThe soundtrack I quite liked just like the previous season. The OP was really good and the ED was good. There was a lot of insert song usage as before, but as before usage was only decent. The art, designs, and style were good as before. The animation was improved and was mostly pretty good, with this time not having as many noticeable cheap shots. The action got a bit better but still wasn't worth much. The comedy was still solid.\\n\\n\r\nA major improvement over the first season for the most part, though with a really awkward finale.\\n\\n\r\n8/10",
            "date": "2018-09-20T18:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 289536,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/304345.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/hexashadow13",
                "username": "hexashadow13"
            },
            "url": "https://myanimelist.net/reviews.php?id=289536"
        },
        {
            "content": "This is a show for your slightly perverted Otaku if you can manage to find an uncencored one. Aside from little story and mainly being just one of those shows that jump around and you won't miss anything. it's good for the occasional laugh or when you just need something to pass the time, But if you want a good in-depth plot to follow then look else where because you won't find it here.",
            "date": "2010-08-31T18:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 30126,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/377478.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JinMasuko",
                "username": "JinMasuko"
            },
            "url": "https://myanimelist.net/reviews.php?id=30126"
        },
        {
            "content": "Story (7) The story of Rosario to Vampire Capu2 follows on a year after the first season. The newspaper club members are returning for their second year. What follows is a season which builds on the core characters as well as the progression of Tsukune and Moka's relationship. The story varies which each episode, much like the first season, while having a main arc (the main arc in the first season was more to do with Tsukune attending a high school for monsters and introducing characters, while this season focuses more on those characters as well as Tsukune and Moka). The story in the individualepisodes for me was generally good, although certain episodes I feel had a weaker story than others, especially in relation to the main arc.\\n\\n\r\nAnimation (8) The animation is much like the first season, though the characters seem to be a bit more active in their movement and poses. The greatest difference between the two seeasons animation wise is the opening sequence, with the dancing at times proving hypnotic.\\n\\n\r\nSound (9) The sound is relatively the same. Sound is rarely bad in anime in my opinion (unless it is a particuraly bad dub, which Rosario to Vampire Capu2 thankfully isn't)\\n\\n\r\nCharacters (9) The main cast from the original are joined by a few newcomers, all of which are good characters that fit into the world. Certain episodes focus more on certain characters, and it is in these episodes that the show really shines for me. The fleshing out of characters and the simple fact that the spotlight is not constantly on Moka (something I didn't really like from the first season) is refreshing and adds a certain endearing quality to the season. The only part that lets this category down is the bits where the series reverts to the formula of simply having all the female Newspaper Club members fight over Tsukune.\\n\\n\r\nOverall (8) Overall, this series is really good. For fans of the first season, Capu2 simply builds on the foundation, bringing new ideas and new scenarios. For people who weren't too keen on the first season because of the Harem elements, Capu2 DOES keep those elements, but tries to explore the characters more as best it can. A must-watch series, a 'save for a rainy day' series for everybody else.",
            "date": "2015-12-20T05:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 206101,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4436380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Konte",
                "username": "Konte"
            },
            "url": "https://myanimelist.net/reviews.php?id=206101"
        },
        {
            "content": "Rosario + Vampire (capu2) If you liked the first series then I am sure you will also like this one as it follows the human Tsukune as he starts his second year in a school full of monsters, the girls are still well drawn and cute even when they show their monster shapes of snowwoman, succubus, vampire and witch and we have Moka’s sister arrive to cause trouble, all in all a nice fighting- romantic- funny- anime, the episode when all the girls turn up at Tsukune’s human home is very good, as are the times we meet the parents but the downside of thesecond series is that the episodes are a bit disjointed and does not flow as well as the first series plus the bats and bears popping up all over the screen to hide pantie shots are only funny the first time, but as I said if you liked the first series then even with these faults I am sure you will like Capu2",
            "date": "2010-04-23T12:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 25364,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/262105.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/chocolatemanga",
                "username": "chocolatemanga"
            },
            "url": "https://myanimelist.net/reviews.php?id=25364"
        },
        {
            "content": "In the end Rosario to Vampire was a really enjoyable experience.\r\nThis anime is not without its faults. Censorship is strong, which really reduces all of the injected fanservice. The fanservice art is also quite \"half-assed\". If you watch this anime, you need to look for the value in how adorable their romance is. This series contains tons of relationship and character development disguised as fillers. A common critic of this series states that the story is poor but a lot of it is actually relationship content and exploration of the characters. However, I think they could have done this while placing emphasis on a moremeaningful plot. This anime also overly sexualizes a child which is in poor taste for me. \\n\\n\r\nAll that aside, Rosario really shines in some areas. The music fits the mood of the series perfectly and it's quite adorable when the characters have musical performances where they sing songs about their love. The romance that developed is very cute and compelling. There are multiple moments that will have you rolling over laughing as well. All in all, this anime could best be described as cute and cuddly, sprinkled with decent fanservice.",
            "date": "2016-10-10T21:23:00+00:00",
            "helpful_count": 1,
            "mal_id": 231558,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5742500.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GodBlessDXD",
                "username": "GodBlessDXD"
            },
            "url": "https://myanimelist.net/reviews.php?id=231558"
        },
        {
            "content": "Honestly the main reason I am disappointed in thud anime is the extreme lack of development of the MC or any kind of stable plot.  I'm a fan of the manga series were the MC goes from the wuss hiding behind his harem of super powered beauty's, to a badass who's cranked it up to level 11 and leading the battle. Overall the art was the one redeeming feature but the fan service completely over shadowed any real plot development.  If your the type to read the manga as well as watch the anime, I would differently skip the anime for this series;but if you must watch it, get it over with first before you move on to the manga.  Otherwise you will face a large amount of disappointment.",
            "date": "2014-04-03T22:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 138565,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3134829.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Qman127",
                "username": "Qman127"
            },
            "url": "https://myanimelist.net/reviews.php?id=138565"
        },
        {
            "content": "Story- There was no real story that went along with the whole season. Basically, each episode had its own theme (or it was pure fan service in one episode). The only thing that could be considered a developing story was the last two episodes.\r\nArt- Nothing out of the ordinary. It didn't break any boundaries with its art but it did a good job of doing what it always does.\r\nSound- Again, nothing pops out to amaze the viewer but it doesn't hurt the anime either. The sound is there just to make it less awkward than pure silence.\r\nCharacter- The characters were bland. Only one character developsin the whole anime. All the other characters stay the same and just keep rolling that way.\\n\r\nEnjoyment- Some of the episodes it felt like a job rolling through but others made the who ride worth it. The beginning and end of the whole season was great but the middle was basically trying to find things to fill it in.\\n\r\nOverall- It was a good anime. I don't regret watching it. It could have done far better if it would have tried to and if it would have given something better to hold on to mid season.",
            "date": "2009-01-11T19:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 11378,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/36150.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SparksOfLogic",
                "username": "SparksOfLogic"
            },
            "url": "https://myanimelist.net/reviews.php?id=11378"
        },
        {
            "content": "Actually I really CAN'T believe that they released the second season without finishing the manga.\r\nSeason two still focuses on Tsukune but what is more observed during the last episode was his vampiric side(which looks less hot but in the manga was hotter).\r\nOverall the replay value is bad and the plot needs to be rearranged",
            "date": "2009-08-17T08:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 17838,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/222275.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SoumaK",
                "username": "SoumaK"
            },
            "url": "https://myanimelist.net/reviews.php?id=17838"
        },
        {
            "content": "Capu 2...\r\nAh yes, the sequel season to Rosario + Vampire. This one had a bit more fan-service than the first series, but, in my opinion, was not really bothersome. I also noticed that there seems to be some more character development with Inner Moka as well, which, even tho this season was slightly lacking than the first, made it better to watch. Overall, I gave this one an 8/10 as well, tho it did lack a little than the first, but in the end, it was still pretty good and as always, it was a fun ride to watch ^_^.",
            "date": "2011-04-30T04:27:00+00:00",
            "helpful_count": 1,
            "mal_id": 36610,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/480618.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SirRazael",
                "username": "SirRazael"
            },
            "url": "https://myanimelist.net/reviews.php?id=36610"
        },
        {
            "content": "Well im back these 3 days i was watching this anime and To LOVE-Ru and other animes so this is my review.\r\nAfter 3 days watching anime i wanted to review them and man i realy liked this anime and the first seasin too,now i realy want to see season 3 but its a low chance of that happening.\r\nStory,i give it an 8 i liked it but i was more intrested in the first season.But still i like it.\r\nArt,i give it an 9 as usual its nicly done same for the first season but it kinda looked better then the first season.\r\nSound,a 8 from me themusic vas ok not the best choice but the voices are nice and the environment is sounding realy good.\\n\\n\r\nCharacter,a 9 i liked the characters in the first season and the new characters are okey,the look of the caracters is realy good same goes for theyr individual  storys.\\n\\n\r\nEnjoyment,a solid 9 this anime made me laugh a lot of times and how much times she drank his blood i dont know how he didnt die but i enjoyed it\\n\\n\r\nOverall,a solid 9 i dont know why this season didnt went so well probably with the fillers like there were 6 to 7 ep that are with the main story driven out of 12 but still i realy liked it personaly.Hope to see season 3 in this or next year.\\n\\n\r\nSorry if i had some typos stupid keyboard.Thanks for reading and comment.",
            "date": "2014-01-26T08:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 130343,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3476755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/MrEpicMichael",
                "username": "MrEpicMichael"
            },
            "url": "https://myanimelist.net/reviews.php?id=130343"
        },
        {
            "content": "Once again, most of the stuff that I covered in my review of the first season applies here, but this time I have to say that the story was a bit more detailed (thankfully). The opening is also a true opening from the get go this time. Unlike in the first season, where the first few episodes had a half-assed opening put together for it.\r\nThis time there's another vampire that appears, who reveals herself to be Moka's sister, Kokoa. Kokoa is constantly trying to get Moka to revert back to her original self, causing all sorts of problems for the cast. So as you cantell, there are some more comical situations.\\n\\n\r\nDuring this season the character growth is done quite a bit faster, and Tsukune gets a chance to actually be the one doing the saving (it's about time).\\n\\n\r\nAll in all, this season of Rosario + Vampire I believe to be a bit better than the first, so go give it a shot if you like a good comedy.",
            "date": "2010-01-04T18:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 22039,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257392.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Alberio",
                "username": "Alberio"
            },
            "url": "https://myanimelist.net/reviews.php?id=22039"
        }
    ],
    [
        {
            "content": "R+ V has very good comedy and also good romance but lacks a story, but that could be okay because R+V is basically like a journal; your following the main character on a journey of events. So since it doesn't have much of a story it'll get a (6), but don't worry, if your someone who wants to watch this but isn't sure there's still hope.\r\nThe art and sound (9) were great. No complaints. Characters (9), yes, this will be another harem, but its not bad. I actually kinda respect the harem because the main character isn't a pervert and he's not a jerk either.The characters are really likable and they're also hilarious, you can't dislike any of the main characters on here. Enjoyment(9), I loved this anime for the comedy and the slightly cheesy romance lol.\\n\r\nOverall (9) this anime is out there for people who love romance and comedy with some action. Anyone who is looking for good action may be dissapointed in this.",
            "date": "2012-09-22T14:31:00+00:00",
            "helpful_count": 0,
            "mal_id": 72965,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479765.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CoolBreeze",
                "username": "CoolBreeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=72965"
        },
        {
            "content": "The first season was a little slow to start. It seemed like it had a \"monster of the week\" type plot, where nothing was really connected until towards the end of that season.\r\nSecond season was a lot better. The humor seemed to change; I laughed a ton at this season. There was finally a multi-episode plot and the battles seemed much more intense.\r\nThe characters evolved nicely as well. Moka is one of my all-time favorite characters now. They fit nicely with each other as well.\r\nThe one problem I have is the ending, it left things too open. It seemed prime for another season but Gonzohad some money issues. The ending screams that there's another season coming, there are just too many things that haven't been done yet.\\n\\n\r\nI hope they continue this series, or even do a reboot now that the manga is coming to an end. They diverged after the first season since the second season began before the manga was finished. It's got quite an American audience since Netflix started featuring it. Sadly, it's just a hope for now.\\n\\n\r\nBut I highly recommend this show to anyone, especially harem lovers. It's one of my favorites.",
            "date": "2014-03-15T13:27:00+00:00",
            "helpful_count": 0,
            "mal_id": 135773,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/dweeegs",
                "username": "dweeegs"
            },
            "url": "https://myanimelist.net/reviews.php?id=135773"
        }
    ]
]