[
    [
        {
            "content": "\"Dakara Boku Wa\" Starts off with this strange perverted Open minded boy walking around with his childhood friend. He is very known at his school for being a pervert, and many dislike him.\r\nBasically They waste your time with Pointless half Hentai Crap for the first 6 episodes. Episode 1, you get the real point of the show and the direction it should be heading into. Then you hit episode 2, and you have a Pervert who has this strange ability to regain his power through getting aroused.\r\nOn top of that through the rest of 3-6 they keep throwing Hentai-Like events at you, and slowly introducingcharacters, something i felt they could have easily done and gotten over with in 2 episodes, and made the show 3x better.\\n\\n\r\nIf you manage to get through the first 6 episodes of crap. your actually in for a treat, this show turns into gold. The plot rapidly increases with nothing but positive enjoyment.\\n\\n\r\nThe story was Fair(6) It was poorly put together, but in the end quite satisfying and enjoyable.\\n\\n\r\nThe Art was Very Good(8) Certainly not at a point where it could make you hate the show because of it being bad. The character design looked great.\\n\\n\r\nThe Sounds was Decent(4) It made no difference towards helping the show look better, They just play this weird crap whenever the Hentai-like moments come on.\\n\\n\r\nThe Characters were very good(8) they were very lovable, and created a suspenseful chose-like harem.\\n\\n\r\nThe enjoyment was Good(7) the casual villains were stupid and always had that Hentai type attack form, where they are like octopus's, with tentacles...you know what i mean, its just stupid.\\n\\n\r\nOverall i rated this show a 6, and i find that to be a fair rating, if it was sectioned off into 2 sections, 1-6, and 7-12. I would have given the first section a 3, and the second section a 9.5\\n\r\nSo if you can sit through the first half, you should notice the quality increase in the second half.\\n\\n\r\nIf you're watching the show for the Highschool DxD like presence, or just the Hardcore Ecchi, the entire thing provides that greatly, and this is exactly what your here for.\\n\\n\r\nFEEDBACK: I would definitely appreciate feedback; it would help me to become a better writer.\\n\\n\r\n#AnimeX",
            "date": "2013-10-28T18:27:00+00:00",
            "helpful_count": 265,
            "mal_id": 118619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2935173.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Crim",
                "username": "Crim"
            },
            "url": "https://myanimelist.net/reviews.php?id=118619"
        },
        {
            "content": "If you're looking for an ecchi show, one that's filled with fan-service, one that has a perverted teen in his puberty years thinking about lewd thoughts, or a High School DxD clone, then look no further. So, I Can't Play H (also known Dakara Boku wa, H ga Dekinai) is a series about a group of breasts with a perverted protagonist who makes the deal of his short life with a beautiful Shinigami, or in English terms, a grim reaper during a wet and rainy night.\r\n~ The Deal\r\nOr maybe known as the story. Well, the overall tone of the story is predictable and filled withcommon cliché, gags, and fan-service. The young boy Ryosuke Kaga (also better well known as Ero-suke, which in my opinion is the better name that suits him considering his nature) plays the main role of the protagonist. He is a perverted at some degrees but at the same time surprisingly funny to watch for his charms and will to protect the girls, or in his words “girls are to be treasured”. He is sort of the middleman compared to other perverted protagonists of the common gag in today's anime industries. For one thing, yes..Ero-suke is perverted but at the same time has a heart of gold, especially towards the shinigami he made a deal with.\\n\\n\r\nSurprisingly though, there is an actual plot to this series. Can you believe it? An actual plot for an ecchi series! Well, foremost, there are tentacle like beings in the beginning that seems to come after the duo like pouring rice. Later on though, a more direct plot seems to develop and mysteries fill the void.\\n\\n\r\n~ Goddess and the Servant\\n\\n\r\nOne of the main focus of the series is the interactions, relationship, and bond between main protagonists Ryosuke/Ero-suke and Shinigami Lisara Restall. With her deep scarlet hair and eyes, she is seen as a beautiful goddess of death. It is seems at first glance that she just wants to use Ryosuke for her own purposes. Later on though, we see that she does in fact cares for her dear servant, showing tendencies of care and even jealousy. Oh boy, my tsundere sense is tangling.\\n\\n\r\n~ Others of the Daily Life \\n\\n\r\nOf course, there are other characters that drives the series. We have the childhood friend who has boobs that evokes the jealousy of the other female cast. We have the Shinigami rival against Lisara who lately have developed a sense of lust and love towards Ero-suke. We have an idol who is seen as the mascot of the series. \\n\\n\r\nTalk about daily life being turned upside down for our poor protagonist. \\n\\n\r\n~ When life gives you money, you make fan-service\\n\\n\r\nBeing an ecchi show, it is no surprise that the theme of tentacles comes into play. In fact, the first  episode and nearly every one so far shows this theme. And of course, clothes being shredded in combat, Ero-suke supplying his powers towards his partner through eroticism, and the inflatable boobs of our teen star idol also gives the show its gags. \\n\\n\r\nStrangely though, this series actually makes sense through its usage of fan-service. Can you believe it? It's actually part of the story. As clothes gets shredded, it symbolizes a loss of power and weakness. As it comes back together, so does strength and the will to fight again! And of course, curtsey of AT-X, the series offers uncensored (yum) for those who wants to avoid the dark shades, light, and fog of the series that hides our guilty pleasures.\\n\\n\r\nThe art and music of this anime series is just average although some of the character designs actually seems to be quite appealing, namely Lisara's Shinigami outfit. If you don't believe me, just look at that beauty. Some of the soundtrack also plays its role to convey the battle moody actions in the other world against the tentacle like beings while other times just seems to be there and not really noticeable. \\n\\n\r\nWell, that's not entirely true. \"Platinum 17\" by yozuca (the Ending theme song of the series) seems to be quite noticeable. It seems to show a possible future romantic relationship between Ero-suke and Lisara, a “forbidden love” between master and servant. The flower, the bath, the bedroom, it's all there. Unfortunately though, he doesn't really manage to flower the pot. \\n\\n\r\n~ The verdict\\n\\n\r\nWell, to enjoy this series, I would say that focusing on the story and characters seems to be the key factor. Yes, there is fan-service. Yes, there are the gags. Yes, there is cliché. What did you expect? If you can't deal with it, then hit the drop button now. However, it does seem that the verdict is not carrying its bar so high. With some of the latter factors as well as the dull plot coming around, this series seems is going downhill. It's not as hot as it originally was before and that's not an understatement. Ultimately, this series is one of those guilty pleasures to watch but for those more into the advanced plot settings with more insightful characters, then look elsewhere.",
            "date": "2012-08-21T21:42:00+00:00",
            "helpful_count": 164,
            "mal_id": 70557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=70557"
        },
        {
            "content": "Boku-H is a perfect example of what ecchi harem shows are about, and in this review, I am here to explain why our standards of appreciation must be adjusted to account for what actually makes these types of shows enjoyable.\r\nBy the normal standards of grading entertainment, we usually define quality entertainment as intelligent in some way.  Intelligent design for entertainment usually is produced through a well-thought out story and an interesting cast that has thought provoking development.  Naturally, it is very easy to dismiss Boku-H as being a mediocre show when it does in fact have an uninspired story that feels rushed andconfusing at its worst moments. Nobody is surprised by the usual boy meets fantasy girl who gets boy into sexy action packed adventures.  I will be the first person to admit that the story is nothing special by any means.\\n\\n\r\nThe other point of appreciation for most entertainment also includes its physical quality, or essentially its sound and art.  Boku-H again would be easily considered unremarkable for the most part in this area. The soundtrack, while not awful, is relatively shallow and repetitive.  The animations are also not the most smooth, and heavily reliant on CG to fill in the gaps. This can be forgiven however given the nature of this particular show is ecchi.  While the rest of the show looks unremarkable, the show does its job of providing appealing scenes featuring its female cast nude in various situations.  If you are looking for an erotic anime, the nude scenes overall do not disappoint.\\n\\n\r\nSo far, it sounds like I'm saying that this show is overall a mediocre lump of fanservice.  Well, you would almost be right.  Because the thing I haven't yet explained is the REAL reason you should be watching this show.  If not story and art quality, what have I not yet covered? Characters.\\n\\n\r\nYes, characters are the reason you should be watching these types of shows.  Specifically, I highly recommend paying attention to Ryosuke Kaga.  What usually defines ecchi harem shows are the main male character, because if we think for a moment logically, these shows very literally are centered around the adventures of our beloved main character.  What I am basically trying to say is that above all, the single most important thing that makes or breaks an ecchi harem (or a hentai for that matter) is almost always the main male character.  If he is likable and the artwork is passable, almost nothing else matters. A strong main character for these shows is the catalyst for viewers being able to relate to the humor and adventures created in these types of shows.  And I will go so far to say that Ryosuke from Boku-H is easily one of the best main characters that exists for a show of this type.\\n\\n\r\nRyosuke has many qualities that should be used more in these types of shows, but aren't for some reason.  He's openly perverted, does not come off as creepy when his childhood friend inherently acknowledges him as kind and trustworthy, is never afraid to say exactly what is on his mind, and he has the guts to say \"size doesn't matter\" to his relatively flat-chested love interest Lisara. In short, he's hilariously manly to an extreme. He is hammy at times, but ultimately comes off very likable due to his honesty and kindness.  And best of all, he is voiced by Shimono Hiro, who once again succeeds at depicting manly hormonal teenage high school boys. Some of the dialogue that Ryosuke dares to say is extremely humorous, both in his shamelessness and the euphemisms he uses (get used to hearing the word \"kingdom\" for a while.  You'll know soon enough what it means if you don't know already).\\n\\n\r\nYou might wonder why I haven't said anything about the female cast.  It's because they don't matter.  Yes I could argue that the female cast is objectively flawed, not particularly interesting, and just uninspired.  On the other hand, it could be potentially because this female cast is flawed and so blatantly represents certain stereotypes and tropes that Ryosuke can so easily express his true manliness in the most hilarious way possible. Again, the actual source of entertainment from this genre of show originates almost exclusively from the main character. This is neither a good or bad thing, it just simply needs to be factored appropriately when one picks up these types of shows.\\n\\n\r\nIn general, when we pursue to immerse ourselves in entertainment, there are standards of quality that we use as a means of finding appreciation.  I personally find it very strange that many people seem to believe that ecchi harems as a whole are somehow not legitimate entertainment when Japan still consistently is able to find a market for it. Naturally, if you choose to approach this show with the expectation of finding attachment to an intelligent storyline, you are obviously going to be disappointed. However, when I compare this show to what other ecchi harems generally offer, I believe that this show definitely stands out as one of the better ones by faithfully providing sexy humor and adventures to laugh at. It is by relating to the main character that we can appreciate the madness that is pretty faces catered to a sexual orientation.  Boku-H does not disappoint here, providing what may be one of the best male protagonists in existence.",
            "date": "2013-05-27T13:16:00+00:00",
            "helpful_count": 127,
            "mal_id": 98631,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=98631"
        },
        {
            "content": "The power of boners is stronger.\r\nThe Short Version:\r\n(+)The art is actually pretty good.\r\n(+)Harem with a plot, a weak plot, but still a plot.\r\n(-)If you’re not here for the tits you’re in for a bad time.\r\n(-)The soundtrack is really unremarkable.\r\n(-)You can point at the characters and say, “You are this archtype and nothing else.”\r\nThe Story (5/10): The story for this show is more than I was expecting given this is an ecchi-harem show, it starts off with a very honest MC who, when he’s heading home, suddenly meets a stunning red headed beauty. Who basically says hi by stabbing him in the chest with a sword.Now effectively making him her power source whenever she gets into a fight, and the way he replenishes said power is… by getting a boner. I wish I got make this shit up.\\n\\n\r\nFrom this point on the show takes the standard harem show route. There’s a thing that the main girl needs the main guys help to get and they run through the standard enemies for a show like this. Monsters, people similar to the girl, the big bad guy at the end, etc. All the while slowly building up the main characters harem. There’s not really anything new to be found here at all, but the story doesn’t feel boring (Not to me anyway) and this is probably because I feel like the production team just went, “If we’re going to make an ecchi-harem show, might as well go all out.” And it kinda worked out for them in the end. Speaking of the end, it sucks.\\n\\n\r\nThe Characters (5/10): As I said in the short version the characters aren’t really much more than well-worn archtypes, none of them bring anything new to said archtypes, and as a whole they are there to fill a role and nothing else. You have the tsundere, the girl with big tits, the (semi?) loli, the childhood friend, and the wimpy protagonist to wrap everyone up.\\n\\n\r\nRyousuke Kaga: The honest MC and wielder of “The Kingdom”\\n\\n\r\nLisara Restall: The tsundere and not bad for a redhead.\\n\\n\r\nIria Fukumune: The one with the big tits and is dressed as a cow at one point.\\n\\n\r\nMina Okura: The childhood friend and the childhood friend we all kinda wanted.\\n\\n\r\nQuele Sellier: The loli and half-sister to Lisara.\\n\\n\r\nThere’s nothing else to say about the characters that I didn’t already, I will admit that I think Lisara and Mina are kinda hot though.\\n\\n\r\nThe Art & Sound (6/10) & (5/10): The art of the show was done by Feel, who also did the animation for Outbreak Company and SNAFU, as well as Corpse Princess. Now that you have a general idea of the art style, the quality in this show is definitely more than I was expecting for a harem show, my expectation being that they put all of their effort into making the tits move and that’s it, and I was right. Mostly. They just managed to find a bit of time to animate the fights as well, which aren’t anything special but again, more than I was expecting.\\n\\n\r\nThe sound of the show is entirely forgettable. I can’t remember anything of the OST, OP or the ED. The only thing that was standard was the voice acting and that’s the only thing that I didn’t forget.\\n\\n\r\nWhat do you think of this show?\\n\\n\r\nNot buying, not a chance in hell.\\n\\n\r\nWould you recommend this show?\\n\\n\r\nWant to watch an ecchi-harem to kill time? Go ahead.\\n\\n\r\nGoodbye my brethren, see you in the next one.",
            "date": "2014-10-29T20:53:00+00:00",
            "helpful_count": 59,
            "mal_id": 166739,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=166739"
        },
        {
            "content": "When I first began this anime I didn't expect anything. It seemed like a stupid pervert ecchi story with a bit of fantasy mixed in.\r\nAs I continued I realized it was exactly what I expected except that it's the best of its kind. \r\nStory-8\r\nDon't expect too much. 12 episodes, with a lead that is a pervert. How much development do you expect? It's sweet but not a \"make you think\" story like death note or code geass.\r\nArt-9\r\nSplendid. I love the art. The characters look marvelous. Even the guys don't look like monkeys or idiots.\r\nCharacter-8\r\nTypical harem. A perverted lead, tsundere, childhood friend, shy girl etc.\r\nEnjoyment-9\r\nThis iswhere the show shines. The jokes, the weird situations, even just watching the opening and ending theme is hilarious if you watch the pictures. \\n\r\nOverall- 8\\n\r\nIt's nothing unique but very enjoyable. This is good for you if you just want a break and watch a funny show like sora no otoshimono. It's nice, fun, funny and nobody pisses you off. I mean seriously, plot twists and messed up villains are overrated. Sometimes you just need a little fun. It's a nice anime but it's not going to be a \"masterpiece\".",
            "date": "2012-08-05T10:40:00+00:00",
            "helpful_count": 54,
            "mal_id": 68773,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188909.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Andyis",
                "username": "Andyis"
            },
            "url": "https://myanimelist.net/reviews.php?id=68773"
        },
        {
            "content": "I will make this very very short since i suck at writing reviews.\r\nwhat you should expect from this anime is that it got some ecchi footage and lots of action already from first episode, but overall pretty funny scences xD\r\nI would recomend you to watch the first episode if you don't like it from there drop it but if you like it continue watching it, im sure there will be lots of funny and good scences.\r\nI really injoyed the first episode and can't wait for the next one.",
            "date": "2012-07-06T17:36:00+00:00",
            "helpful_count": 49,
            "mal_id": 65509,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442723.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Megu-chi",
                "username": "Megu-chi"
            },
            "url": "https://myanimelist.net/reviews.php?id=65509"
        },
        {
            "content": "'Dakara Boku wa, H ga Dekinai' is your average ecchi rom-com with a few interesting twists thrown in here and there. That said and whether it's intentional or not, this anime has a lot of similarities with other well known series and if you're an anime savvy watcher it feels like many plot points here have been done before in a strikingly similar way elsewhere. \r\nThe story is banal and doesn't really require much in-depth description.  The male lead, Ryosuke Kaga, is the stereotypical high school anime pervert and lives out his days oblivious to the powers high above. One day he meets aredhead death god, Restall Risara, who happens to be on a hunt for the human with the highest amount of spiritual energy, or the \"special specimen\" as it's called in this anime. The first episode already looks somewhat similar to Bleach, plot-wise. Those of you that watched it, you surely remember the first episode where Ichigo and Rukia meet - it's raining outside and she stabs him with her sword so that he can defeat the hollow. Same thing in this anime, minus the hollow part and it happens inside the house. From that moment on they develop a partner (professionally speaking)  relationship. Again similar to how it was done with Rukia and Ichigo in bleach, where the male lead supports the female companion character as they strive towards a common goal. Of course this might be mere coincidence, stemming from the fact that there are lots of shinigami-based animes out there and through sheer probability, at least two of them will end up being similar. \\n\\n\r\nThere are secondary characters of course - Fukumune Iria, Okura Mina, Sellier Quele. The first one is just for pure fanservice as is the case with Sellier. They have no real depth, the story doesn't expand upon them and they're just there so that we can see more breasts on the screen. So is the case with nearly all other female characters and it makes the series more generic. The only plot significant secondary character here would be Mina, who gradually rises in importance, especially in the later episodes of the series. Out of all characters I would say she's the responsible and sensible type but one character is not enough to make up for dozens of shallow ones. \\n\\n\r\nThe story progresses from being carefree with romantic undertones to full-blown romantic drama by the end. Similar to Sora no Otoshimono, again whether it's intentional or a coincidence, these are only my personal observations. Risara and Ryosuke set out on an adventure which includes defeating many hollow-like looking monsters; another apparent similarity to Bleach that I personally noticed. The two main characters evolve from being mere strangers to something a lot more than that and we can see their relationship growing with each episode. The makers have done a really good job here and the tension between Risara and Ryosuke and how they come to terms with their feelings is a highlight of this anime. I for one, was excited to see the ending and how their relationship would eventually pan-out. \\n\\n\r\nAs for Art, it is nicely done. Characters are well drawn. The colors are crisp and the style immediately catches your eye's full attention. One thing to note however is that violence and nudity are intertwined in this anime. A lot of fighting scenes will feature the girls being completely naked - much like in Elfen Lied, but with less blood. Whether the makers have purposefully adopted that kind of style from Elfen Lied or it's just me - I don't know, but it is something worthy to notice and discretion is advised. \\n\\n\r\nThe voice acting is very convincing and the VAs themselves fit in nicely with this type of anime. The soundtrack as well as the opening and ending songs are catchy. \\n\\n\r\nAll in all, this is a decent anime. The story isn't too bad but there are a few shortcomings, the most notable is the large amount of shallow and completely pointless characters and the fact that the plot lacks uniqueness to stand out from a pile of similar anime series. However at the same time the romance component here has been executed in the best way possible and this is a good anime for all those people who like watching romance-based series. You'll also get a few laughs out of this anime, as it is filled with eyebrow-raising situations and one liners. \\n\\n\r\nTherefore 'Dakara Boku wa, H ga Dekinai' gets a rating of 7 from me. It isn't bad but it isn't very good either. Watch it for fun and definitively for the romance and you will enjoy it.",
            "date": "2012-12-06T06:38:00+00:00",
            "helpful_count": 23,
            "mal_id": 79320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=79320"
        },
        {
            "content": "Dakara Boku wa H ga Dekinai\r\nThis anime is a good Ecchi/Harem with a good story and enjoyable for one time watch, good characters and with a main girl without big breast and still better than the chesty ones.\r\nStory\r\nIs about a guy that one day sees a beautiful redhead in front of his house, this is where all begins, he invites her to enter, makes a temporal deal with her because she is a Shinigami but she doesn't drain his life but drains his pervert ''powers'' which he has a control on them and tells him that he only has a month of life and shewill help him find the person that has a great power to save him, it has comedy, ecchiness, and in the last episodes has drama and the story gets good that you will want an improved 2nd season.\\n\\n\r\nArt & Sound\\n\r\nWell the art is not smooth but you will like the ecchiness and the sound is a little repetitive in most parts but is good.\\n\\n\r\nCharacter\\n\r\nThis is where the MC Ryosuke Kaga shines, he's not the typical ecchi/harem wuss character, he is openly pervert and everyone knows him for that but he is not that over the top pervert neither, after all he loves Lisara, and just with her he's able to show all his pervertness, he really is the show to be honest, there are other characters and they are good but you could take them out of the show and you wouldn't mine if it was without them but the characters are good.\\n\\n\r\nEnjoyment\\n\r\nThe enjoyment i had was good and honestly for the ecchiness more than anything but i think every other aspect of the anime was good, it wasn't bad neither very good but for watching it one time it was good.",
            "date": "2015-08-03T16:45:00+00:00",
            "helpful_count": 20,
            "mal_id": 195102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195102"
        },
        {
            "content": "This is my first review so don't be too harsh...XD\r\nId give it a 6.5~7 /10 ...i thought it was kinda of generic and bland...though the art and animation is good ,and the insertion of jokes are done well but in a also generic way .But the episode feels like it is lacking the main pole or pillar that supports the bridge,the story.As well as for the way of absorbing viewer.Normally first episodes are ended in a way that incites viewers to watch next episode.But this episode ended with a suspense event ,but one that is not striking enough IMO to have the viewers say ,Ihave to watch next episode !I didn't read the manga because ppl were complaining about how the episode of the anime was inferior to the manga.So I watched the episode first.Back to the story the story was IMO lacking,there wasn't or was lacking rather a drive to the actions of the character.Speaking of which had rather overused generic personnalities,in other word they were kinda lacking depth.That's it for the anime.After seeing it i read the manga ...Well not surprisingly i thought is was better.But just comparing the first chapter and the episode.Some key element seems also to be lacking in the anime episode.And I also realised that the chemistry between the main chars is also missing which is kinda a big thin for me.In conclusion ,i though it was ok start for a series but i could of done better.And the lack of depth and drive is also understandable from the quantity of manga present.(If they have shown it like the manga then in a few episode it would catch up the manga)But the way they executed it was done in a rushed way.So in consequense the first episode results in a Ok episode .Though don't drop it yet,the series has a LOT of potential at hand .And the anime adaptation is not all at fault either.Maybe they decided to make and anime adaptation too early.\\n\\n\r\nResult:Good episode,ok~ish debut for a series with potential.\\n\r\nHere my first review ,hope it helped(btw im def not dropping it ,waiting to see what will happen next)",
            "date": "2012-07-08T01:12:00+00:00",
            "helpful_count": 17,
            "mal_id": 65653,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/541301.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Alex-1029",
                "username": "Alex-1029"
            },
            "url": "https://myanimelist.net/reviews.php?id=65653"
        },
        {
            "content": "alright, second review time and it has been some time since my first one, this time i'm going to discuss Dakara Boku wa, H ga Dekinai, a mouth full if you ask me.\r\nFirst off let me say that this show is still airing and I will change my score when this show is completed, so this review is meant to give you an impression. \r\nAnother thing I would like to point out from the start is that this show is ecchi, so for those people who don't like it, don't even start watching this as there are plenty of ripped clothes which will leave somegirls almost butt naked aside of some strings, so boobs, ass and shyness are there.\\n\\n\r\nWith that being said, let's start off;\\n\\n\r\nStory 7; Now this is straight off where I'm actually already bothered but also where I have to think off what still has to come. This show has great potential and can easily be 1 of the better shows out there at the moment, however the fighting scenes are generally always in the same order: enemy appears, girl gets in trouble because her energy is not high enough yet, boy gives energy, girl whoops enemy's butt.  Don't get me wrong though, the fighting scenes are pretty well done when it comes down to action, but I hope that it will change a bit in the future. \\n\\n\r\nNow for the rest of the story, as I said it has great potential and that is because so many things have not been explained yet, as the creators of this show keep giving slight hints that there is coming a major twist to this story, the real action still has to come, I won't explain what still has to come as I myself hate spoilers and I won't spoil things for you guys either.\\n\\n\r\nArt 9; Scenery is really well made, characters are not some sort of misformed animals and actually look pretty well. And as I explained earlier, fighting scenes are well made when it comes down to the actual moves of the characters, also it might just be me but I think that the shows is looking better now than it did at the start of the show, might be mistaken here though.\\n\\n\r\nSound 7; nothing really special here, the voice actors do a decent job as so far I have no real hate for a specific character when it comes down to their voices, in fact each and everyone of their voices suit the character pretty well.\\n\r\nBGM and opening/ending are mediocore, nothing that will stay with you when this show is over but still decent enough to make you somewhat enjoy it for the moment and the BGM does it's job by adding some tensity or calming atmosphere to the scenes.\\n\\n\r\nCharacter 8; This is another point that I will most likely change when this show is over, I will briefly explain why, the main characters show promise when it comes down to their power and character development in general considering romance etc. However this still has to be done of course and I hope the creators do this otherwise the score for this will drop as fast as a human in the air without a parachute.\\n\\n\r\nNow on to a little in-depth viewing;\\n\\n\r\nThe main protagonist, (Kaga, Ryosuke) is NOT as in most ecchi, action animes a complete weakling who is incredibly pathetic, in fact he is the one who has to save the female protagonist almost the whole time but there is a good reason for that which I won't explain as it would spoil too much.\\n\\n\r\nWhere this guy gets his power from is absolutely hilarious in my opinion and I think most people would agree with me, he is a very likeable character and for once I enjoy the main protagonist.\\n\\n\r\nThe female protagonist, (Renstall, Lisara) is basically Ryosuke's master and main reason why this show has the ecchi tag which you will understand straight away after the first episode, believe me when I say that after you've seen the first episode you will know straight away whether you will like this show or not. \\n\\n\r\nThe minor main characters and side characters are doing a decent job so far to add to the plot and to the comedy aspect.\\n\\n\r\nEnjoyment 9; This is a high score, I know, however I will explain why. Even though this show has it's flaws and the fighting scenes have the same order of how it goes, it is still a very enjoyable show and before you know it you will have reach episode 6 which should air this week, I think. \\n\\n\r\nAs I said many times in this review, this show has potential and I hope that they will have everything taken care of when it ends or at least make it so good that I will look forward to a season 2 if it will come out as this show can become a gem.\\n\r\nFor me personally so far, episode 1 was really well done, it will get you excited for the next episode but then it slows down a bit it will explain stuff and let's you go with the flow, but the last episode I watched today(nr.5) it will pick up some of the pace again and in between the episodes it will give hints as I stated before of some major stuff that still has to come.\\n\\n\r\nSo in 2 sentences; Dakara Boku wa, H ga Dekinai is a possible gem but still far from being one. It has flaws and will certainly need some work, but still very, very enjoyable.",
            "date": "2012-08-12T03:05:00+00:00",
            "helpful_count": 15,
            "mal_id": 69497,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1290585.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/markinho",
                "username": "markinho"
            },
            "url": "https://myanimelist.net/reviews.php?id=69497"
        },
        {
            "content": "Like your average high school boy, Ryosuke Kaga can’t stop thinking perverted thoughts.  Unlike the average high school boy, he won’t shut up about it, and cares little for anything other than breasts, butts, breasts, napes, breasts, panties, breasts, and...  Um...  Underarms.  It makes more sense when he says it.\r\nAnyway, on his way home from school, he sees a beautiful red-haired girl standing all alone in the rain outside of his house.  Not content to just stare at her wet, transparent shirt, he offers her his umbrella, and invites her in for a change and a shower.  No soonerare they indoors and alone then she begins to hold him close...  And just when he’s getting ready to ditch his V-card, she stabs him through the heart with a giant sword.\\n\\n\r\nAs it turns out, her name is Lisara, and she’s a grim reaper...  You know, those things that were cool until Soul Eater...  And in order to complete her mission on earth, she needed to form a contract with somebody who had inexplicably high amounts of life energy...  Which Ryosuke apparently has in spades...  And she draws her power directly from the one thing that makes her new partner love his life so much.  Unfortunately for her, she finds out that he drives his passion from his perversion, so she can only be at full power when he’s popping a woody...  Which works out perfectly, because without that power, she gets her ass kicked faster than Lina Inverse on her period... Losing her clothes in the process.\\n\\n\r\nAt first glance, you’d think this was the perfect set-up for an ecchi fanservice series...  Well, yes and no.  We’ll get to the meat of this review in a few paragraphs, but for the moment, I must give credit where credit is due.\\n\\n\r\nSo I Can’t Play H...  Which I’ll simply be calling H from now on...  Was produced by a company called feel, and while I’d love to say some smart-sounding words about their track record and production history, I’ve never actually heard of this company before.  They’ve done in-between animation on a few shows I’ve seen, but up until now, the only show they’ve directly produced and animated that I’ve actually seen was Corpse Princess...  Which I only remember dropping out of boredom.  \\n\\n\r\nI can’t say anything about feel, but whatever their eternally lower-cased history may be, this show is drop dead gorgeous.  The occasional CG is breathtaking, whether it’s taking the form of a simple escalator or the teleportation field around a reaper.  This is CG rendering that even Sword Art Online would be gasping at, even if the color scheme does kind of become an eyesore in the final few episodes.  The backgrounds are exquisitely detailed, expertly framed, and they will absolutely dazzle you with their use of lighting and shading.  \\n\\n\r\nThe animation for the characters is much simpler, but not bad by any means...  Their designs are very standard, a little on the bland side, and nowhere near as realistic as the aesthetic would have you believe... but their movement is still quite a bit more fluid than what you’d find in most shows of a similar ilk.  Key frames and speedlines are rare, but they’re used fairly well for what they are.\\n\\n\r\nSo, when you’re talking about ecchi titles, the bar is consistently a low one...  Titty showcases aren’t typically known for having good writing, original ideas, or any value outside of the perverse.  It’s entirely possible for ecchi shows to be enjoyable outside of the skin content that they offer...  Strike Witches is a prime example of this...  But actual depth and creativity are rare elements indeed.  So why am I bringing this up, while talking about a show that’s basically just Bleach meets Girls Bravo, with an older version of Shana in the lead role?  Because, believe it or not, So I Can’t Play H came dangerously close to impressing me.  \\n\\n\r\nWith the plot being set up the way it is, H had a potentially brilliant subversion right in the palm of it’s hand.  With Ryosuke being a hopeless pervert who values women solely for their bodies, and who’s depth of character only reaches the level of ‘I like different poses,’ and Lisara drawing her energy from that pervert power, the only thing this show had to do to have me eating out of it’s hand was to not have anybody fall in love with him.  If he was simply used as an object, as Lisara proclaimed in episode 1, then it would have been a very clever play on his habit of objectifying women.  I can take the plot at face value...  Trust me, there’s a lot worse ideas out there...  And it makes sense that, under this arrangement she’d eventually get used to being naked around him.  From there, she should have grown to see him as a necessary annoyance...  A being less than a man, who she doesn’t feel remotely threatened by, like a little kid, or a brainless dog.  In fact, the entire harem could have seen him this way, adding a surprising edge of feminism to the heaping helping of boobs that the show throws at us.\\n\\n\r\nAnd as far as the romantic aspect of H goes, this change would have also helped Ryosuke become a much better character...  He could have been emasculated by their treatment of him, faced his immature flaws, and forced himself to develop and grow in order to win more than just Lisara’s time.  I can’t even begin to describe how refreshing a dynamic this would be, and I certainly can’t express how much good will I would have had for this title.  But alas, this isn’t how things went...  Lisara’s promise to use him as a power source was nothing more than the same old cliched Tsundere bullshit that we’ve grown accustomed to.\\n\\n\r\nEvery girl in the harem falls madly in love with this skeezwad, and he doesn’t start to show monogamous interest in anybody until the third quarter of the series, and it comes from pretty much out of nowhere, proving to the viewer that male perversion can only be overcome if a woman is willing to accept and tolerate it.  Yeah, just love that womanizing douchebag, and he’ll only have eyes for you eventually.  I wasn’t really expecting any better than that, but it would have been nice.\\n\\n\r\nThen again, it’s not like that message will ever reach the ears of anybody whom it could damage...  I can’t for the life of me imagine anybody enjoying this show without a bottle of lotion sitting beside them, and any negative message it sends will fly right over the heads of THAT market.\\n\\n\r\nOh, and speaking of all the girls falling in love with him, the funniest thing about H by far is how little it understands human emotion...  Yeah, I know, big surprise, no harem characters are realistic.  But we’re talking about a whole other level here.  It’s not uncommon for harem girls to fall in love with the main character for no reason whatsoever, but this has to be the first anime I’ve ever seen where one of the girls doesn’t start to show an interest in him until another girl suggests it.  Yep...  No exaggeration there.  One of them says “We both like Ryosuke,” and in so many words, the other one says “I do?  Oh yeah, I do!”  And the laziest love interest in the series was born.\\n\\n\r\nDo I even have to mention that it gets worse than that?  There’s a reveal halfway through that’s probably one of the most bewildering anime moments I’ve seen in a long time.  Ryosuke skypes his mother for spoiler reasons, and a girl in the room asks her for some information regarding his bloodline.  She says, in so many words, “Oh, by the way, I lied about your father being dead.”  That’s it.  No hesitation, no reluctance, she just drops what should have been a ton of bricks on him out of nowhere and with not nearly enough prodding to suddenly break sixteen years of silence.  And his reaction?  Mild surprise at best.  She gives him a quick explanation, and the subject gets dropped faster than the beat at a Skrillex concert.  And no, that’s not a spoiler worthy of a warning...  I wanted it to be, as I was pretty damn sure the villain would turn out to be his father in a mask, but it never gets brought up again.  It’s even more bafflingly stupid than Ryosuke’s mental dictionary.\\n\\n\r\nWhich reminds me...  Remember that plot I mentioned earlier?  The one I begrudgingly decided to take at face value?  Yeah, it’s about as consistent as an everlasting gobstopper.  According to the back of the DVD cover, Ryosuke can’t be perverted after Lisara’s used him for power, so he wants to help her so she can leave and his life can return to normal.  Yeah, at no point in the show is that ever true.  First of all, that’s not the reason he’s helping her...  He’s doing it because she says he only has 3 months to live, and he wants her to save him.  Second of all, he never stops being perverted...  Although even when she’s buck naked right in front of him, he has to (I wish I didn’t remember this) memorize all of the dirty words in a dictionary, so he can call any dirty word to his mind when needed.  Because it takes obsessive studying to come up with the word “Bath.”\\n\\n\r\nAnd third of all, his childhood friend makes a contract with Lisara’s childhood friend, and her passion for life comes from her love of Ryosuke...  Spoiler, yes, but you’ll figure that out long before it’s revealed.  And get this...  The exploitation of her life force NEVER causes her to stop being in love with him.  I think that’s a problem, don’t you?  That is, aside from the problem of her being in love with a skeezwad.\\n\\n\r\nAnd oh, I know what you’re thinking...  “It doesn’t matter if it’s stupid, and shamelessly puts flesh on parade despite some gaping plot holes, inhuman behavior, and elements that make absolutely no sense.  Hell, Strike Witches was a booby show, and the logic revolving around the panties makes for an incomprehensible plot hole, and you love Strike Witches!.”  Yeah, you’re right.  Strike Witches was a stupid, idiotic mess with copious amounts of bare boobs.  But you know what it wasn’t?  Pretentious.  Strike Witches was a blast from start to finish because it never tried to be anything deeper than action-packed cheesecake.  But that wasn’t enough for H.\\n\\n\r\nSee, the story gets serious in the second half...  Well, at least it tries, but all it ends up doing is making even less sense...  And it tries it’s hand at some real drama.  I’ll spare you most of it, including Ryosuke’s uncanny transformation into a perfect gentleman the moment he gets a legitimate chance to pork somebody...  And talk about the villain’s motive, which is going to be a difficult thing to do without giving away any spoilers.  \\n\\n\r\nTo put it in ambiguous terms, the villain’s motivation is driven by a disturbingly real threat to the very existence of life on this planet...  It’s a threat that nobody is talking about yet, as it’s even more controversial than climate change, and the people who try to take a stand against it are demonized for their efforts.  This is quite possibly the first time I’ve seen a fictional story try to tackle this issue, but as I learned before, I wasn’t expecting too much.  Ryosuke and his harem are conflicted over this issue, which seems to be far too great a necessary evil to face...  And I swear to god, the solution this story comes up with is one of the most pretentious fictional solutions I have ever heard for anything.  It’s steeped entirely in ignorance of human nature and whimsical sci-fi fantasy, which makes H feel all the more shallow and stupid for it’s efforts.  It’s like listening to a ten year old say that Israel and Palestine should just hug it out, or seeing Superman solve the world’s problems by sending all the nukes into space.  It’s a cute idea, but for the love of god, please don’t write a freaking story bout it!\\n\\n\r\nIf I haven’t already made this clear, H is incompetent down to it’s lowest possible level.  The jokes are bad, none of the characters are likeable, the nudity is too constant and over-saturated to remain sexy for longer than the space of a single episode, and the music is made up of cookie-cutter dating sim tunes.  It’s childish and stupid down to it’s very core, and while it’s offensive to women in some very creative ways, the only thing that keeps it from becoming completely morally repulsive is the fact that the harem in question doesn’t include any incestuous or lolicon characters.  Hell, the one harem girl who’s still in junior high is also the only girl in the entire show who never does any unobscured nudity, because yeah, THAT’s going to save it at this point.  The only reason I can see anybody watching this is because of the boobs...  And if that’s enough for you, then congratulations, you’re eternally 14.\\n\\n\r\nSo I Can’t Play H is available on DVD and Blu-ray from Sentai Filmworks.  It’s fairly expensive on most sites, but at the time this review is being written, you could get it at Rightstuf.com for 17.99 or 23.99, depending on your preferred format.  There’s no dub as of yet, but knowing Sentai, they’re probably just waiting tentatively to see if this title is popular enough to justify spending money on a dub.  It’s a shame they have the rights to it, because a show like this really belongs in the hands of Funimation.  It’s one of the few titles I’d actually LIKE to see Jamie Marchi write the script for.  \\n\\n\r\nThe DVD doesn’t include the final thirteenth OVA episode, and while that omission may be a completionist’s nightmare, I really think it’s better to just pretend that episode doesn’t exist.  Why?  Well, remember all those female characters that you’ve already seen naked in every possible form of undress, and from every possible angle that won’t violate Japan’s decency laws?  Well, the final episode is a swimsuit competition!  Yeah, that’s exactly what this show needed!  No, I don’t want to learn more about the villain, or the whereabouts of Ryosuke’s dad, or the societal results of this show’s idiotic conclusion...  I wanna see my fetishes catered to even harder and more gratuitously than before, in an episode that isn’t even a tenth as well animated as the series that preceded it.  \\n\\n\r\nSo, as worthless as this show is, I can’t really call it the bottom of the barrel.  The animation, quite frankly, is too beautiful for that.  But it’s close.  And keep in mind, the ecchi genre dwells in a barrel that’s every bit as deep as the Mariana trench, and it’s bottom is littered with even more despicable 1/10(or below) titles like Dears, Eiken, Love Love, Popotan, and Master of Martial Hearts.  H is floating just a few feet above those titles, and about a dozen feet below School Days.  That’s not a place any anime wants to be...  Trust me, it’s really cold and dark down there, but it’s where this title belongs, and I can’t wait to post this review and instantly go about the task of forgetting about it.  I give So I Can’t Play H a 2/10.",
            "date": "2014-12-02T10:51:00+00:00",
            "helpful_count": 12,
            "mal_id": 170803,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=170803"
        },
        {
            "content": "Dakura Boku wa, H ga Dekinai is basically your run of the mill, standard echhi anime. While this anime is by no means terrible it is simply mediocre at best. The story was promising at times but the plot was never sufficiently explored for me to care too much. The animation was pretty good but thats to be expected. The soundtrack is by far the best part of the anime, as the opening and ending are both outstanding. The characters........ This is where Dakura Boku wa, H ga Dekinai falls flat on it's face, of all the characters i only like one, The main characterhere is extraordinarily bland and quite frankly a bore to watch, The main heroine is cliche and mostly uninteresting and most of the others are the same. So overall while i enjoyed this anime at times the story and the characters made this unable to be anything but mediocre \\n\r\n6/10 if anything listen to the op and ed of this show as they are fantastic",
            "date": "2014-07-09T14:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 151255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2698755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SakurasouBusters",
                "username": "SakurasouBusters"
            },
            "url": "https://myanimelist.net/reviews.php?id=151255"
        },
        {
            "content": "Haters of the ecchi genre or people who do not want to be accused watching porn, please skip this review and check other reviews out because this anime is all about boobs. Boobs are everywhere is this anime! Right, I'm going straight into what I feel about this anime.\r\nStory:\r\nHonestly, the plot in this anime is terribly boring. The whole anime is centred around this death goddess searching for the most powerful energy source in this world. Of course, obstacles appeared and they overcame it and that's all.  They actually spend about 9 episodes or so searching for that energy source. Pretty boring to meas it was sort of draggy. To be really honest, if the characters didn't display their body aspect to such extent, I would've dropped this anime long ago. Also, this anime focus far too much on the body aspect of the characters that made me forget I was actually watching an anime and felt more like I was watching porn. I'm not exaggerating but almost every few minutes, there will be someone's body being featured, naked. Therefore, due to the boring plot and the over-emphasise of the character's body, the story was not really brought into my mind.\\n\\n\r\nCharacter:\\n\r\nThe characters all have sufficient time in this anime. There wasn't a case of a particular character being left out after being introduced for a few minutes only. Hence, the appearing time for the characters was rather balanced. Additionally, you might want to pay attention to Lisara only as all other females are a pain in the eye. \\n\\n\r\nSound:\\n\r\nNothing to comment on the sound because it has little significance in the anime. I totally forgot the existence of a OST in this anime. However, the opening was catchy and impressive.  \\n\\n\r\nArt:\\n\r\nIf we are talking about the art in terms of the body art of the characters, it normal like any other ecchi animes. Nothing really special or unusual about the body art here.\\n\\n\r\nEnjoyment:\\n\r\nI decided to watch this anime because I had nothing else to watch, hoping this anime could at least entertain me a little. However, the plot was plainly boring and there was an over-emphasise on the character's body which disappointed me a lot. I know this is an ecchi anime, but there has to be a limit to the amount of time spent showing us the bodies of the characters. So basically, this anime was not very enjoyable to me. If the plot was a little more interesting  it might actually turn out to be a very enjoyable anime. Therefore, I would strongly advise you to not spend too much time in this anime because it might turn out to be a waste of time for you because it is really terribly boring. \\n\\n\r\nThank you.",
            "date": "2013-07-24T09:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 106607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Gladeo",
                "username": "Gladeo"
            },
            "url": "https://myanimelist.net/reviews.php?id=106607"
        },
        {
            "content": "I watched this because someone recommended it, with the bold statement 'It's better than Highschool DxD!' I am a massive DxD fan, of both the anime and the LN series. Challenge Accepted. \r\nUpon completion of this I realized that that recommendation was done by someone who was either A) High or B) Hadn't actually seen DxD. \r\nThis anime doesn't hold a candle to it.\r\nNot to say, if you like your usual action/fanservice fapfest, that isn't watchable.\r\nStory - 6\r\nI got the feeling, from watching this, that there was a decent story in there somewhere but it was garbled and disjointed. Unfortunately I think it fell preyto that age old enemy of Good Plots.... Fanservice. Maybe if I watch it again and ignore all the bouncing boobies it might make a little more sense. Easier said than done though.\\n\\n\r\nArt - 8 \\n\r\nCan't complain about the art. It's very easy on the eyes. \\n\\n\r\nSound - 5\\n\r\nGot to give the sound an ambiguous 5. I can't actually remember any of it.\\n\\n\r\nCharacters - 8 \\n\r\nThe main and the heroine are the reason for an 8 here. I had to give them credit for not pussyfooting around. If I say anymore, it'll probably be considered spoilers so I'm going to hush up. \\n\r\nI usually have a pretty good memory for interesting/unique anime characters and none of the rest of them stick out particularly vividly, which pretty much says it all in my book.\\n\\n\r\nEnjoyment - 7 \\n\r\nYeah, OK I enjoyed it. But then again I'm too easily amused by boob-power. I'm still a 14 year old at heart.\\n\\n\r\nOverall - 7\\n\r\nIt definitely feels like it could have been the successor to DxD in my opinion. It's disappointing it doesn't really live up to it though and it falls into the pitfalls that many anime of this category do. .\\n\r\nPleasing visuals and two characters that fit my personal preferences make up for a so-so storyline and forgettable secondary characters.\\n\r\nThis anime is definitely more for someone who is between series or who wants to just kill a bit of time with something generic from the ecchi/harem genre. It's not selling the genre to newcomers that for sure.",
            "date": "2013-05-31T16:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 99171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2624431.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Manganese",
                "username": "Manganese"
            },
            "url": "https://myanimelist.net/reviews.php?id=99171"
        },
        {
            "content": "NOTE: Again, this review is only based on the anime. I haven't read both the light novel and the manga.\r\nEDIT: Some grammar check and minor addition of content. My opinion regarding the anime still remains the same.\r\nAfter I and my ecchi-addicted friend watched the first episode of \"Dakara Boku wa, H ga Dekinai\" (which we simply watched since I saw it here on MAL that it's like High School DxD), we both know that there's no sparks out there, trying to hook us - its watchers - to get into the anime. Despite that, we still continued to watch the anime. Although finishing the animecould be rewarding, I doubt that most people will have enough patience to last that long, with the anime's first four episodes not deviating from the usual ecchi anime formula, (with the clothes melting off and \"OOH, BOOBS!!!\") and the laughs simply not enough.\\n\\n\r\nThe male lead character, Ryousuke, is also your usual male lead character: a lecherous wimp of a teenager (though he gains some sort of powers, the first one - making him regain ero-energy - I find cheesy ). At least I find Lisara, the female lead, a good character, serving as a foil to the pervert Ryousuke.\\n\\n\r\nThe art and character design is very much similar to High School DxD. Not that I have any complaints about it since it actually looks nice and all.\\n\\n\r\nWhat made the first four episodes \"lacking in sparks\" is that 1) the first episode basically showed all of Lisara's powers as a shinigami, and 2) the following episodes follows the usual plot developments of the usual ecchi anime, which has become, simply put, predictable and bland. By that time, some - if not most - of its viewers would've dropped the series, thinking that it shouldn't take half of the series' worth of episodes to get them hooked to the anime (unless all they're looking forward to is more boobs, that is).\\n\\n\r\nThe latter half of the anime features a genre shift from mostly ecchi/harem to more of action (although the fan service still is there), and by this point until the last episodes (which features another genre shift to romance), the story actually starts to have an identity of its own (and also, more sense to comprehend). \\n\\n\r\nUnfortunately, this anime's problem - overall - is that it plays safe and by doing so, it actually became something that is trite and banal, so if you're going to watch this seeing that it's like another (albeit inferior version of) High School DxD. If, on the other hand, you haven't seen much ecchi in your whole life (or you simply just wants boobs, boobs and more boobs in your anime), then perhaps you might just enjoy this one.",
            "date": "2013-05-24T17:08:00+00:00",
            "helpful_count": 7,
            "mal_id": 98281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2246281.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/tsuyo_sama",
                "username": "tsuyo_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=98281"
        },
        {
            "content": "Recently I was out of anime to watch and was looking for a few of them and came across Dakara boku wa H ka dekinai. I heard a lot of praise especially for it's second half and as I was dropping anime quite a lot here and there I thought about giving a shot and let's just say it didn't go well for me...\r\nStory: 2/10\r\nAt best I could describe the anime as \"border to hell\" with a 2. That's the most I could ever give it for the story section. Call me wierd, but I am very particular about a plot in an Ecchi anime,so I went in with DxD-like expectations and got severely disappointed, and sadly there were a whole long list of reasons apart from that which made me hate the show as well.  I'll go step-by-step, since the anime itself was divided into two parts, I divided my story section into two parts for easy understanding.\\n\\n\r\nThe first six episodes are basically plotless and contribute zilch to the plot, it's just ecchi and more excuses for more ecchi. Characters being introduced in a cliched manner and wasted exactly HALF the anime in it. You might bring up the excuse and say \"but that was fanservice for the fans, it's Ecchi, it has to have it\". Well, sadly this anime itself couldn't decide so who am I to judge. It was a harem in second, then pointless Ecchi in the next, and then weak plot. The studio couldn't even decide WHAT to follow for the first half and made me think as if the studio just licensed an anime and opened the reference books a few days before the airing date. Thankfully I went past the tortious first half and the end of episode six revealed that the next half (un)fortunately will focus on a proper plot (made you think the studio finally got their hands straight didn't they? Wrong.\\n\\n\r\nThe second half was something that was praised a lot by other reviewers and watchers, not to mention people said the ending was excellent, so I forced myself through the first half and trudged on to the next episodes, what did I get? A bunch of zilch in return. In the most basic sense this anime tried to pull off a Hyoudou Issei DxD-esque rescue-person-in-another-world plotline and let's just say much like the rest of the anime, they ruined it. Plain and simple. A cliched villain, ***MINOR SPOILER: whom we don't see the face of at all, for no absolute reason...END SPOILER*** a cliched adventure, a cliched set of pointless fanservice yet again (that excuse won't work anymore my friend, this half was plot-time, and a whole lot of plot holes. If you compare the amount of plot holes in this anime to a beggar's clothes only 2 times out of 10 will the beggar's clothes have more holes than this plot, which by the way is the score this anime deserves for a terrible story line. I'll end with a weak joke, it was \"a border to hell\". There you go, obligatory hell joke in anime about hell is obligatory.\\n\\n\r\nArt: 3/10\\n\\n\r\nI think I know why I immediately understood who the studio was because it was a mess as usual from Studio feel. The familiar washed-out artstyle and horrible effects immediately pointed feel. toward me and I wasn't surprised that I was right (although I was kind of surprised). Going in detail on those aforementioned reasons, even at 720p it looked washed-out. This is a familiar tactic used by the lazy art directors at feel. and I remember this clearly since SNAFU S2 where they ruined an excellent artstyle (courtesy Brain's Base for the excellent first season) and that was seen here as well. As for the effects, the characters had to perform action sequences and throw spells at each other, those required effects at a good level and feel underdelivered. They looked like something a rookie would make, no joke. It looked terrible to be honest and the washed-out artstyle made it even worse. And don't get me started on that horribly lazy tactic used in between episodes 9 to 11 as a green background almost everywhere to save time and be more lazy. As for character design, I can say that was the saving grace of this section and if not for the character design, it would've gotten a one, once again no joke. You can clearly see some effort (perhaps the only effort) out into the art into the characters. They looked vibrant, cheery and better than the rest of the art section in general. I personally like the shades of colours used for everyone, especially Quele, Lisara and Iria. Other than that... Well nothing positive so let's end here.\\n\\n\r\nSound. 4/10\\n\\n\r\nAt best I could describe the sound section as decent. Apart from that massively forgettable OP/ED (although I must admit later on the ED was kinda catchy, but kinda) the OST too couldn't figure itself out. You won't believe me if I tell you that the sound changed EVERY episode. Not a good sign when you've got sub-par story and art scores. The VAs more or less did their job decently which is why I've given a 4 and not a 2. On the other hand like I said the OST was a mess, especially the BGM. \\n\\n\r\nCharacter: 1/10\\n\\n\r\nWoah, this is the first time I've ever used 1s 2s and maybe 3s in a review ever. Well, I can say that the characters were promising at first but it's what happened to then later which made me give them this outrageous number. They took that potential and threw it down the garbage and shoved it down your throat. If you want an easy example to understand through, this is it. I'm already severely disappointed in TsunDeres and our Rias Gremory wannabe Lisara Rest-whatever was a painfully bad TsunDere. Apart from being a 99.9% Tsun, that .01% came through in the last Episodes and if you think that's enough to make me change my mind, well you're sadly mistake.I still can't believe what made people think that ending was any good. Personally I'd be glad if it went the way of the \"bad guys\" since that way I could have been a bit more generous in my scoring but then this HAD to go the typical Shounen route. Anyway, speaking of Shounen, we move to Erosuke, I mean Ryousuke, unlike Hyoudou Issei, this guy was a hilarious attempt at a pervert MC. Forget about his cliched energy, the way he got his power among many other things made me feel like banging my head on a table. As for the denseness, a thing noticed in many romance anime, well I can say this sole reason is the one I'm giving a 1 and not none. As for the other jokes we move to our onee-sama cliche 'imouto', Quele. I rooted for her throughout the anime (I moved on from Mina due to reasons I'll detail later) but then after that pathetic fanservice scene in the second half I LOATHED her as well. Mina was a character I instantly liked at first, but like this anime, my support for her crumbled faster than the plot did. She was too damn shy to be supported anywhere in the course of the anime. It was painfully obvious at the start who would win in the end. As for our other character who was brutally pushed to the side, Iria. She was your basic \"rival\" archetype and that didn't please me at all (even in that way if you take it). There was nothing about her that wasn't cliched. 'Nuff said. She wasn't even the breast character in the anime (apologies for the pun), which puts her appeal to the maximum of 0.\\n\\n\r\nEnjoyment: 3/10\\n\\n\r\nYes, the characters were horrible, yes the artstyle was washed out, yes the story was cliche as hell. But yet there was something that made me watch this anime and not dropping it, perhaps it was the way the after-credits scene was handled after each episode, or because I was dropping too many anime, or because I watched it to crush it in this review, or more likely all three. As for the fanservice part, it was absolutely fulfilled, although I'd love some reasons as to why it happens, heck, even half an excuse would work (such as Yuuki Rito's antigravity control, just kidding). I may sound positive but in the end it was almost worthwhile watching the anime.\\n\\n\r\nOverall: 2.6 (Averaged)\\n\\n\r\nBreaking the record for my lowest rated review, Dakara boku wa H ka dekinai takes the top cake as my worst reviewed anime ever. If you're in it for the plot, you'll be disappointed, if you're expecting some character development, you're an idiot (apologies for being rude), if you're in here for the Ecchi, well most of you will be satisfied. I was very surprised that this anime was praised for it's last arc and the last episode because frankly I ironically found the first half almost understandable than the second half which was a mess and a failed copy of DxD. On a personal note, it yet again disappointed me as a TsunDere fan since Lisara takes my award for the worst character of the anime. Period. All in all, this is an anime which you'll be forgiven if avoided and rewarding if you love ecchi with no plot and just oppai, although I must admit, it might be a fake too. I'm honestly half surprised at the score the anime ended up with. I expected a little more, maybe 4 but at 2.6 it makes me laugh a little. To be frankly honest with you ***SPOILER: If the end was tragic, perhaps I'd be a bit more considerate and I thought about this throughout the anime, and sadly it didn't happen. It took the pathetic harem route with no meaning to it, it didn't even try making up an excuse for the ending...\\n\\n\r\nP.S: After such a disgraceful score I don't think I have a waifu for the waifu corner. All I can say is that Caesar is the best character of the anime. That's it. Goodbye. No waifu corner. This anime doesn't deserve one.",
            "date": "2018-01-04T14:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 267421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=267421"
        },
        {
            "content": "If you were to take the classic, quiet girl with a large chest with a crush on the MC since they were kids; the large-chested foil who wants the MC just because; the moderate-chested girl who learns to love the perverted antics of the MC, and the clear romantic interest with a small chest and a tsundere personality, and add a moderate-bust sized cold killer, that'd be the entire female cast of the show. (I typically don't define anime girls by their bust size, but in this series, the screentime on just their faces and just their busts are about equal.) Throw in the pervertedMC who has a power everyone wants and that's the story in a nutshell.\\n\\n\r\nI watched the entire series because I read a review that said it got better after episode 6, I think it got better at episode 5, but (at least for me) it didn't keep on getting better to a level that was enjoyable.\\n\\n\r\nThe art is good, not great. The sound is not really memorable (but to be fair, that's a critique I have with most non-music series). The characters are walking cliches. If you like seeing the same scene of a girl being held up by tentacle-like things as her clothes fade away, followed by the MC getting a magical power up and saving the day (repeatedly during the course of the series), then you'll probably like this show. \\n\\n\r\nThe story ends so thoroughly in 12 episodes that you're pretty sure there wasn't much to the story to begin with.",
            "date": "2014-01-17T22:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 129161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3463853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/No1shero3",
                "username": "No1shero3"
            },
            "url": "https://myanimelist.net/reviews.php?id=129161"
        },
        {
            "content": "Great anime.\r\nFull of comedy,  romance, action, and tits.\r\nStory\r\nI'm not even going to waste my time explaining the plot. Just know that it's great, and the first few episodes are basically intros for the characters. It might be hard to stay on-board (It's well worth it!), but know that after all the characters are revealed, this show takes off into greatness.\r\nThis anime shifts gears mid-story and steers from comedy ecchi towards a more serious tone. It matures very well yet still retains its \"fun\".\r\nThe only predictable things in this anime are the fight scenes in the first few episodes, afterwards nothing is obvious and itwill keep you guessing.\\n\\n\r\nArt & Sound\\n\r\nArt and sound are perfectly fine. The action sequences and romance scenes had great songs/music playing in the background.\\n\\n\r\nCharacters\\n\r\nThe main characters are great and developed with sense. I don't understand why people hate stereotypes. If there is a stereotype for each type of character, they're obviously going to be the same as any other show? That's like hating an anime that doesn't kill off the main character because an older anime didn't kill of the main character either.\\n\\n\r\nEnjoyment \\n\r\nI thoroughly enjoyed this anime. I just finished watching all 12 episodes literally 15 minutes ago\\n\\n\r\nOverall\\n\r\nSeriously, this show had me laughing hard as hell (ep. 5, perfect). Action was there but you can tell it's not the main focus, but still fulfilling. Romance, I've always loved romance/love stories and this show was put together very well, it's a harem as well and the main character chooses one (which I love to see). If I was a true man I could have cried at a few moments in this show.\\n\\n\r\nJust a perfect anime.",
            "date": "2014-11-13T09:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 168419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MB22",
                "username": "MB22"
            },
            "url": "https://myanimelist.net/reviews.php?id=168419"
        },
        {
            "content": "Since your probably reading this just to test the waters for Dakara Boku wa, H ga Denkinai, I'm going to keep this review short.\r\n*MAL ratings are broken as helllll\r\nOverall, this ecchi anime is perfect.It is comedic, cute, exciting and unlike most, this actually has a story and i'snt a harem. All the characters are as believable as they can get in a 12 episode ecchi. Keep in mind that this is a casual anime, it's not a work of art but it is at its core, a ball of fun and has actually pretty decent romance. Also its not stupidly ero or ridiculous so itdoes have a slight \"realistic\" feeling to it. \\n\r\n*I wish this anime was extended!!!\\n\\n\r\nStory:\\n\r\nThe story flows well, although it was a bit slow at the beginning, most animes are, in order to set the story and introduce the everyone. It will actually make you feel something which is something alot of ecchi's fail to do, and you most likely continue watching because of the story, gags and romance.\\n\\n\r\nERO-yske:\\n\r\nThis leads me to the ecchi/fanservice/ero component, the ero in this anime is actually more of a necessity to forming the premise of the anime, as unbelievable as that is. Meaning the most of the screen time you see that is ecchi, is justified. That being said there honestly isnt that much nudity but definitely enough to satisfy.\\n\\n\r\nArt:\\n\r\nThe art is pretty good, maybe slightly above average. The detail is there, and it is enough to convey the feelings of the characters, and it will definitely have an \"effect\" on you during the ero segments. There is fighting involved, and it is actually well animated. The character designs were interesting and quite attractive, few with multicoloured/gradient hair.\\n\\n\r\nSound:\\n\r\nNot much to say, the OP and ED were okay and fit the anime. The voice actors were pretty decent, so really don't take much notice. Also no really annoying high voices, so that's good.\\n\\n\r\nCharacter:\\n\r\nThe premise of each character, were more than solid enough for this short series and because of this, I wish this series was longer. They could easily expand on all of the characters involved mainly Lisara. But excluding all that, they were believable and well thought through.\\n\\n\r\n-Main Characters:\\n\r\n As for Ryosuke, while being a teenage boy that opening expresses his love for the female form, he is the ideal guy you see in animes. Weak at first but determined, eventually becoming stronger and protecting the weak(girls). \\n\\n\r\n As for Lisara, she has a rough, or rather responsible exterior, is capable and cute when she gets embarrassed. She could maybe even a little be considered a tsundere \\n\\n\r\nEnjoyment:\\n\r\nIt's a fun series, with a storyline, and a decent romance, what more can you ask for. 10/10\\n\\n\r\nOverall:\\n\r\n8-9/10 || This couldve been something awesome. The ecchi is really a side dish to the whole anime (Which is great).",
            "date": "2013-07-13T03:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 105121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Cryse",
                "username": "Cryse"
            },
            "url": "https://myanimelist.net/reviews.php?id=105121"
        },
        {
            "content": "This is a pretty good show, kinda weak, but still pretty good. It follows this guy whos an extreme pervert and the death god (female of course) that he lives with.\r\nThis show is one of those where the writers might have gotten a little out of control with their rights. I mean the whole basis is that the death god cant live on earth without replenishing energy so she decides to make a contract where she can suck his energy out. Thing is, for him to energize himself (heres where the fanserve comes into play) he has to be turned on/horny/have a raging boner etc.and to accomplish this he basically runs around copping a feel on anyone he sees and meanwhile there is supposed to be some touching romance story going on in the background... btw this is kinda a harem in a sense. Even better is the fact that the girls' clothing is like a meter for how much energy they have left, for instance if one uses a big attack, or something happens to deplete a large bit of energy, her clothes disapear... granted they start out in spandex so really its not like we couldnt already see everything anyway...\\n\r\nOh and i cant believe i didnt bring this up till now, but the main guy is going to die. That is why he agreed to help the death god because she said if he did she'd save his life when his time inevitably comes in 3 months. \\n\r\nTo keep shit interesting there are some fight scenes, betrayals, a big showdown, a near-apocalyptic disaster, and a friggin ton of titty flashes. Everything culminates in the final episode (as it does in most anime) and it was that episode (wont talk about it for spoilers) that took my opinion of this show from okay to pretty good. Honestly I had no idea how it was going to end until it was over and thats just how I like it to be.",
            "date": "2013-01-22T12:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 84537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=84537"
        }
    ],
    [
        {
            "content": "\"Dakara Boku Wa\" Starts off with this strange perverted Open minded boy walking around with his childhood friend. He is very known at his school for being a pervert, and many dislike him.\r\nBasically They waste your time with Pointless half Hentai Crap for the first 6 episodes. Episode 1, you get the real point of the show and the direction it should be heading into. Then you hit episode 2, and you have a Pervert who has this strange ability to regain his power through getting aroused.\r\nOn top of that through the rest of 3-6 they keep throwing Hentai-Like events at you, and slowly introducingcharacters, something i felt they could have easily done and gotten over with in 2 episodes, and made the show 3x better.\\n\\n\r\nIf you manage to get through the first 6 episodes of crap. your actually in for a treat, this show turns into gold. The plot rapidly increases with nothing but positive enjoyment.\\n\\n\r\nThe story was Fair(6) It was poorly put together, but in the end quite satisfying and enjoyable.\\n\\n\r\nThe Art was Very Good(8) Certainly not at a point where it could make you hate the show because of it being bad. The character design looked great.\\n\\n\r\nThe Sounds was Decent(4) It made no difference towards helping the show look better, They just play this weird crap whenever the Hentai-like moments come on.\\n\\n\r\nThe Characters were very good(8) they were very lovable, and created a suspenseful chose-like harem.\\n\\n\r\nThe enjoyment was Good(7) the casual villains were stupid and always had that Hentai type attack form, where they are like octopus's, with tentacles...you know what i mean, its just stupid.\\n\\n\r\nOverall i rated this show a 6, and i find that to be a fair rating, if it was sectioned off into 2 sections, 1-6, and 7-12. I would have given the first section a 3, and the second section a 9.5\\n\r\nSo if you can sit through the first half, you should notice the quality increase in the second half.\\n\\n\r\nIf you're watching the show for the Highschool DxD like presence, or just the Hardcore Ecchi, the entire thing provides that greatly, and this is exactly what your here for.\\n\\n\r\nFEEDBACK: I would definitely appreciate feedback; it would help me to become a better writer.\\n\\n\r\n#AnimeX",
            "date": "2013-10-28T18:27:00+00:00",
            "helpful_count": 265,
            "mal_id": 118619,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2935173.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Crim",
                "username": "Crim"
            },
            "url": "https://myanimelist.net/reviews.php?id=118619"
        },
        {
            "content": "If you're looking for an ecchi show, one that's filled with fan-service, one that has a perverted teen in his puberty years thinking about lewd thoughts, or a High School DxD clone, then look no further. So, I Can't Play H (also known Dakara Boku wa, H ga Dekinai) is a series about a group of breasts with a perverted protagonist who makes the deal of his short life with a beautiful Shinigami, or in English terms, a grim reaper during a wet and rainy night.\r\n~ The Deal\r\nOr maybe known as the story. Well, the overall tone of the story is predictable and filled withcommon cliché, gags, and fan-service. The young boy Ryosuke Kaga (also better well known as Ero-suke, which in my opinion is the better name that suits him considering his nature) plays the main role of the protagonist. He is a perverted at some degrees but at the same time surprisingly funny to watch for his charms and will to protect the girls, or in his words “girls are to be treasured”. He is sort of the middleman compared to other perverted protagonists of the common gag in today's anime industries. For one thing, yes..Ero-suke is perverted but at the same time has a heart of gold, especially towards the shinigami he made a deal with.\\n\\n\r\nSurprisingly though, there is an actual plot to this series. Can you believe it? An actual plot for an ecchi series! Well, foremost, there are tentacle like beings in the beginning that seems to come after the duo like pouring rice. Later on though, a more direct plot seems to develop and mysteries fill the void.\\n\\n\r\n~ Goddess and the Servant\\n\\n\r\nOne of the main focus of the series is the interactions, relationship, and bond between main protagonists Ryosuke/Ero-suke and Shinigami Lisara Restall. With her deep scarlet hair and eyes, she is seen as a beautiful goddess of death. It is seems at first glance that she just wants to use Ryosuke for her own purposes. Later on though, we see that she does in fact cares for her dear servant, showing tendencies of care and even jealousy. Oh boy, my tsundere sense is tangling.\\n\\n\r\n~ Others of the Daily Life \\n\\n\r\nOf course, there are other characters that drives the series. We have the childhood friend who has boobs that evokes the jealousy of the other female cast. We have the Shinigami rival against Lisara who lately have developed a sense of lust and love towards Ero-suke. We have an idol who is seen as the mascot of the series. \\n\\n\r\nTalk about daily life being turned upside down for our poor protagonist. \\n\\n\r\n~ When life gives you money, you make fan-service\\n\\n\r\nBeing an ecchi show, it is no surprise that the theme of tentacles comes into play. In fact, the first  episode and nearly every one so far shows this theme. And of course, clothes being shredded in combat, Ero-suke supplying his powers towards his partner through eroticism, and the inflatable boobs of our teen star idol also gives the show its gags. \\n\\n\r\nStrangely though, this series actually makes sense through its usage of fan-service. Can you believe it? It's actually part of the story. As clothes gets shredded, it symbolizes a loss of power and weakness. As it comes back together, so does strength and the will to fight again! And of course, curtsey of AT-X, the series offers uncensored (yum) for those who wants to avoid the dark shades, light, and fog of the series that hides our guilty pleasures.\\n\\n\r\nThe art and music of this anime series is just average although some of the character designs actually seems to be quite appealing, namely Lisara's Shinigami outfit. If you don't believe me, just look at that beauty. Some of the soundtrack also plays its role to convey the battle moody actions in the other world against the tentacle like beings while other times just seems to be there and not really noticeable. \\n\\n\r\nWell, that's not entirely true. \"Platinum 17\" by yozuca (the Ending theme song of the series) seems to be quite noticeable. It seems to show a possible future romantic relationship between Ero-suke and Lisara, a “forbidden love” between master and servant. The flower, the bath, the bedroom, it's all there. Unfortunately though, he doesn't really manage to flower the pot. \\n\\n\r\n~ The verdict\\n\\n\r\nWell, to enjoy this series, I would say that focusing on the story and characters seems to be the key factor. Yes, there is fan-service. Yes, there are the gags. Yes, there is cliché. What did you expect? If you can't deal with it, then hit the drop button now. However, it does seem that the verdict is not carrying its bar so high. With some of the latter factors as well as the dull plot coming around, this series seems is going downhill. It's not as hot as it originally was before and that's not an understatement. Ultimately, this series is one of those guilty pleasures to watch but for those more into the advanced plot settings with more insightful characters, then look elsewhere.",
            "date": "2012-08-21T21:42:00+00:00",
            "helpful_count": 164,
            "mal_id": 70557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 5,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=70557"
        },
        {
            "content": "Boku-H is a perfect example of what ecchi harem shows are about, and in this review, I am here to explain why our standards of appreciation must be adjusted to account for what actually makes these types of shows enjoyable.\r\nBy the normal standards of grading entertainment, we usually define quality entertainment as intelligent in some way.  Intelligent design for entertainment usually is produced through a well-thought out story and an interesting cast that has thought provoking development.  Naturally, it is very easy to dismiss Boku-H as being a mediocre show when it does in fact have an uninspired story that feels rushed andconfusing at its worst moments. Nobody is surprised by the usual boy meets fantasy girl who gets boy into sexy action packed adventures.  I will be the first person to admit that the story is nothing special by any means.\\n\\n\r\nThe other point of appreciation for most entertainment also includes its physical quality, or essentially its sound and art.  Boku-H again would be easily considered unremarkable for the most part in this area. The soundtrack, while not awful, is relatively shallow and repetitive.  The animations are also not the most smooth, and heavily reliant on CG to fill in the gaps. This can be forgiven however given the nature of this particular show is ecchi.  While the rest of the show looks unremarkable, the show does its job of providing appealing scenes featuring its female cast nude in various situations.  If you are looking for an erotic anime, the nude scenes overall do not disappoint.\\n\\n\r\nSo far, it sounds like I'm saying that this show is overall a mediocre lump of fanservice.  Well, you would almost be right.  Because the thing I haven't yet explained is the REAL reason you should be watching this show.  If not story and art quality, what have I not yet covered? Characters.\\n\\n\r\nYes, characters are the reason you should be watching these types of shows.  Specifically, I highly recommend paying attention to Ryosuke Kaga.  What usually defines ecchi harem shows are the main male character, because if we think for a moment logically, these shows very literally are centered around the adventures of our beloved main character.  What I am basically trying to say is that above all, the single most important thing that makes or breaks an ecchi harem (or a hentai for that matter) is almost always the main male character.  If he is likable and the artwork is passable, almost nothing else matters. A strong main character for these shows is the catalyst for viewers being able to relate to the humor and adventures created in these types of shows.  And I will go so far to say that Ryosuke from Boku-H is easily one of the best main characters that exists for a show of this type.\\n\\n\r\nRyosuke has many qualities that should be used more in these types of shows, but aren't for some reason.  He's openly perverted, does not come off as creepy when his childhood friend inherently acknowledges him as kind and trustworthy, is never afraid to say exactly what is on his mind, and he has the guts to say \"size doesn't matter\" to his relatively flat-chested love interest Lisara. In short, he's hilariously manly to an extreme. He is hammy at times, but ultimately comes off very likable due to his honesty and kindness.  And best of all, he is voiced by Shimono Hiro, who once again succeeds at depicting manly hormonal teenage high school boys. Some of the dialogue that Ryosuke dares to say is extremely humorous, both in his shamelessness and the euphemisms he uses (get used to hearing the word \"kingdom\" for a while.  You'll know soon enough what it means if you don't know already).\\n\\n\r\nYou might wonder why I haven't said anything about the female cast.  It's because they don't matter.  Yes I could argue that the female cast is objectively flawed, not particularly interesting, and just uninspired.  On the other hand, it could be potentially because this female cast is flawed and so blatantly represents certain stereotypes and tropes that Ryosuke can so easily express his true manliness in the most hilarious way possible. Again, the actual source of entertainment from this genre of show originates almost exclusively from the main character. This is neither a good or bad thing, it just simply needs to be factored appropriately when one picks up these types of shows.\\n\\n\r\nIn general, when we pursue to immerse ourselves in entertainment, there are standards of quality that we use as a means of finding appreciation.  I personally find it very strange that many people seem to believe that ecchi harems as a whole are somehow not legitimate entertainment when Japan still consistently is able to find a market for it. Naturally, if you choose to approach this show with the expectation of finding attachment to an intelligent storyline, you are obviously going to be disappointed. However, when I compare this show to what other ecchi harems generally offer, I believe that this show definitely stands out as one of the better ones by faithfully providing sexy humor and adventures to laugh at. It is by relating to the main character that we can appreciate the madness that is pretty faces catered to a sexual orientation.  Boku-H does not disappoint here, providing what may be one of the best male protagonists in existence.",
            "date": "2013-05-27T13:16:00+00:00",
            "helpful_count": 127,
            "mal_id": 98631,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/A2ZOMG",
                "username": "A2ZOMG"
            },
            "url": "https://myanimelist.net/reviews.php?id=98631"
        },
        {
            "content": "The power of boners is stronger.\r\nThe Short Version:\r\n(+)The art is actually pretty good.\r\n(+)Harem with a plot, a weak plot, but still a plot.\r\n(-)If you’re not here for the tits you’re in for a bad time.\r\n(-)The soundtrack is really unremarkable.\r\n(-)You can point at the characters and say, “You are this archtype and nothing else.”\r\nThe Story (5/10): The story for this show is more than I was expecting given this is an ecchi-harem show, it starts off with a very honest MC who, when he’s heading home, suddenly meets a stunning red headed beauty. Who basically says hi by stabbing him in the chest with a sword.Now effectively making him her power source whenever she gets into a fight, and the way he replenishes said power is… by getting a boner. I wish I got make this shit up.\\n\\n\r\nFrom this point on the show takes the standard harem show route. There’s a thing that the main girl needs the main guys help to get and they run through the standard enemies for a show like this. Monsters, people similar to the girl, the big bad guy at the end, etc. All the while slowly building up the main characters harem. There’s not really anything new to be found here at all, but the story doesn’t feel boring (Not to me anyway) and this is probably because I feel like the production team just went, “If we’re going to make an ecchi-harem show, might as well go all out.” And it kinda worked out for them in the end. Speaking of the end, it sucks.\\n\\n\r\nThe Characters (5/10): As I said in the short version the characters aren’t really much more than well-worn archtypes, none of them bring anything new to said archtypes, and as a whole they are there to fill a role and nothing else. You have the tsundere, the girl with big tits, the (semi?) loli, the childhood friend, and the wimpy protagonist to wrap everyone up.\\n\\n\r\nRyousuke Kaga: The honest MC and wielder of “The Kingdom”\\n\\n\r\nLisara Restall: The tsundere and not bad for a redhead.\\n\\n\r\nIria Fukumune: The one with the big tits and is dressed as a cow at one point.\\n\\n\r\nMina Okura: The childhood friend and the childhood friend we all kinda wanted.\\n\\n\r\nQuele Sellier: The loli and half-sister to Lisara.\\n\\n\r\nThere’s nothing else to say about the characters that I didn’t already, I will admit that I think Lisara and Mina are kinda hot though.\\n\\n\r\nThe Art & Sound (6/10) & (5/10): The art of the show was done by Feel, who also did the animation for Outbreak Company and SNAFU, as well as Corpse Princess. Now that you have a general idea of the art style, the quality in this show is definitely more than I was expecting for a harem show, my expectation being that they put all of their effort into making the tits move and that’s it, and I was right. Mostly. They just managed to find a bit of time to animate the fights as well, which aren’t anything special but again, more than I was expecting.\\n\\n\r\nThe sound of the show is entirely forgettable. I can’t remember anything of the OST, OP or the ED. The only thing that was standard was the voice acting and that’s the only thing that I didn’t forget.\\n\\n\r\nWhat do you think of this show?\\n\\n\r\nNot buying, not a chance in hell.\\n\\n\r\nWould you recommend this show?\\n\\n\r\nWant to watch an ecchi-harem to kill time? Go ahead.\\n\\n\r\nGoodbye my brethren, see you in the next one.",
            "date": "2014-10-29T20:53:00+00:00",
            "helpful_count": 59,
            "mal_id": 166739,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4180693.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/SirHellfire",
                "username": "SirHellfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=166739"
        },
        {
            "content": "When I first began this anime I didn't expect anything. It seemed like a stupid pervert ecchi story with a bit of fantasy mixed in.\r\nAs I continued I realized it was exactly what I expected except that it's the best of its kind. \r\nStory-8\r\nDon't expect too much. 12 episodes, with a lead that is a pervert. How much development do you expect? It's sweet but not a \"make you think\" story like death note or code geass.\r\nArt-9\r\nSplendid. I love the art. The characters look marvelous. Even the guys don't look like monkeys or idiots.\r\nCharacter-8\r\nTypical harem. A perverted lead, tsundere, childhood friend, shy girl etc.\r\nEnjoyment-9\r\nThis iswhere the show shines. The jokes, the weird situations, even just watching the opening and ending theme is hilarious if you watch the pictures. \\n\r\nOverall- 8\\n\r\nIt's nothing unique but very enjoyable. This is good for you if you just want a break and watch a funny show like sora no otoshimono. It's nice, fun, funny and nobody pisses you off. I mean seriously, plot twists and messed up villains are overrated. Sometimes you just need a little fun. It's a nice anime but it's not going to be a \"masterpiece\".",
            "date": "2012-08-05T10:40:00+00:00",
            "helpful_count": 54,
            "mal_id": 68773,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1188909.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Andyis",
                "username": "Andyis"
            },
            "url": "https://myanimelist.net/reviews.php?id=68773"
        },
        {
            "content": "I will make this very very short since i suck at writing reviews.\r\nwhat you should expect from this anime is that it got some ecchi footage and lots of action already from first episode, but overall pretty funny scences xD\r\nI would recomend you to watch the first episode if you don't like it from there drop it but if you like it continue watching it, im sure there will be lots of funny and good scences.\r\nI really injoyed the first episode and can't wait for the next one.",
            "date": "2012-07-06T17:36:00+00:00",
            "helpful_count": 49,
            "mal_id": 65509,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442723.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Megu-chi",
                "username": "Megu-chi"
            },
            "url": "https://myanimelist.net/reviews.php?id=65509"
        },
        {
            "content": "'Dakara Boku wa, H ga Dekinai' is your average ecchi rom-com with a few interesting twists thrown in here and there. That said and whether it's intentional or not, this anime has a lot of similarities with other well known series and if you're an anime savvy watcher it feels like many plot points here have been done before in a strikingly similar way elsewhere. \r\nThe story is banal and doesn't really require much in-depth description.  The male lead, Ryosuke Kaga, is the stereotypical high school anime pervert and lives out his days oblivious to the powers high above. One day he meets aredhead death god, Restall Risara, who happens to be on a hunt for the human with the highest amount of spiritual energy, or the \"special specimen\" as it's called in this anime. The first episode already looks somewhat similar to Bleach, plot-wise. Those of you that watched it, you surely remember the first episode where Ichigo and Rukia meet - it's raining outside and she stabs him with her sword so that he can defeat the hollow. Same thing in this anime, minus the hollow part and it happens inside the house. From that moment on they develop a partner (professionally speaking)  relationship. Again similar to how it was done with Rukia and Ichigo in bleach, where the male lead supports the female companion character as they strive towards a common goal. Of course this might be mere coincidence, stemming from the fact that there are lots of shinigami-based animes out there and through sheer probability, at least two of them will end up being similar. \\n\\n\r\nThere are secondary characters of course - Fukumune Iria, Okura Mina, Sellier Quele. The first one is just for pure fanservice as is the case with Sellier. They have no real depth, the story doesn't expand upon them and they're just there so that we can see more breasts on the screen. So is the case with nearly all other female characters and it makes the series more generic. The only plot significant secondary character here would be Mina, who gradually rises in importance, especially in the later episodes of the series. Out of all characters I would say she's the responsible and sensible type but one character is not enough to make up for dozens of shallow ones. \\n\\n\r\nThe story progresses from being carefree with romantic undertones to full-blown romantic drama by the end. Similar to Sora no Otoshimono, again whether it's intentional or a coincidence, these are only my personal observations. Risara and Ryosuke set out on an adventure which includes defeating many hollow-like looking monsters; another apparent similarity to Bleach that I personally noticed. The two main characters evolve from being mere strangers to something a lot more than that and we can see their relationship growing with each episode. The makers have done a really good job here and the tension between Risara and Ryosuke and how they come to terms with their feelings is a highlight of this anime. I for one, was excited to see the ending and how their relationship would eventually pan-out. \\n\\n\r\nAs for Art, it is nicely done. Characters are well drawn. The colors are crisp and the style immediately catches your eye's full attention. One thing to note however is that violence and nudity are intertwined in this anime. A lot of fighting scenes will feature the girls being completely naked - much like in Elfen Lied, but with less blood. Whether the makers have purposefully adopted that kind of style from Elfen Lied or it's just me - I don't know, but it is something worthy to notice and discretion is advised. \\n\\n\r\nThe voice acting is very convincing and the VAs themselves fit in nicely with this type of anime. The soundtrack as well as the opening and ending songs are catchy. \\n\\n\r\nAll in all, this is a decent anime. The story isn't too bad but there are a few shortcomings, the most notable is the large amount of shallow and completely pointless characters and the fact that the plot lacks uniqueness to stand out from a pile of similar anime series. However at the same time the romance component here has been executed in the best way possible and this is a good anime for all those people who like watching romance-based series. You'll also get a few laughs out of this anime, as it is filled with eyebrow-raising situations and one liners. \\n\\n\r\nTherefore 'Dakara Boku wa, H ga Dekinai' gets a rating of 7 from me. It isn't bad but it isn't very good either. Watch it for fun and definitively for the romance and you will enjoy it.",
            "date": "2012-12-06T06:38:00+00:00",
            "helpful_count": 23,
            "mal_id": 79320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=79320"
        },
        {
            "content": "Dakara Boku wa H ga Dekinai\r\nThis anime is a good Ecchi/Harem with a good story and enjoyable for one time watch, good characters and with a main girl without big breast and still better than the chesty ones.\r\nStory\r\nIs about a guy that one day sees a beautiful redhead in front of his house, this is where all begins, he invites her to enter, makes a temporal deal with her because she is a Shinigami but she doesn't drain his life but drains his pervert ''powers'' which he has a control on them and tells him that he only has a month of life and shewill help him find the person that has a great power to save him, it has comedy, ecchiness, and in the last episodes has drama and the story gets good that you will want an improved 2nd season.\\n\\n\r\nArt & Sound\\n\r\nWell the art is not smooth but you will like the ecchiness and the sound is a little repetitive in most parts but is good.\\n\\n\r\nCharacter\\n\r\nThis is where the MC Ryosuke Kaga shines, he's not the typical ecchi/harem wuss character, he is openly pervert and everyone knows him for that but he is not that over the top pervert neither, after all he loves Lisara, and just with her he's able to show all his pervertness, he really is the show to be honest, there are other characters and they are good but you could take them out of the show and you wouldn't mine if it was without them but the characters are good.\\n\\n\r\nEnjoyment\\n\r\nThe enjoyment i had was good and honestly for the ecchiness more than anything but i think every other aspect of the anime was good, it wasn't bad neither very good but for watching it one time it was good.",
            "date": "2015-08-03T16:45:00+00:00",
            "helpful_count": 20,
            "mal_id": 195102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195102"
        },
        {
            "content": "This is my first review so don't be too harsh...XD\r\nId give it a 6.5~7 /10 ...i thought it was kinda of generic and bland...though the art and animation is good ,and the insertion of jokes are done well but in a also generic way .But the episode feels like it is lacking the main pole or pillar that supports the bridge,the story.As well as for the way of absorbing viewer.Normally first episodes are ended in a way that incites viewers to watch next episode.But this episode ended with a suspense event ,but one that is not striking enough IMO to have the viewers say ,Ihave to watch next episode !I didn't read the manga because ppl were complaining about how the episode of the anime was inferior to the manga.So I watched the episode first.Back to the story the story was IMO lacking,there wasn't or was lacking rather a drive to the actions of the character.Speaking of which had rather overused generic personnalities,in other word they were kinda lacking depth.That's it for the anime.After seeing it i read the manga ...Well not surprisingly i thought is was better.But just comparing the first chapter and the episode.Some key element seems also to be lacking in the anime episode.And I also realised that the chemistry between the main chars is also missing which is kinda a big thin for me.In conclusion ,i though it was ok start for a series but i could of done better.And the lack of depth and drive is also understandable from the quantity of manga present.(If they have shown it like the manga then in a few episode it would catch up the manga)But the way they executed it was done in a rushed way.So in consequense the first episode results in a Ok episode .Though don't drop it yet,the series has a LOT of potential at hand .And the anime adaptation is not all at fault either.Maybe they decided to make and anime adaptation too early.\\n\\n\r\nResult:Good episode,ok~ish debut for a series with potential.\\n\r\nHere my first review ,hope it helped(btw im def not dropping it ,waiting to see what will happen next)",
            "date": "2012-07-08T01:12:00+00:00",
            "helpful_count": 17,
            "mal_id": 65653,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/541301.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Alex-1029",
                "username": "Alex-1029"
            },
            "url": "https://myanimelist.net/reviews.php?id=65653"
        },
        {
            "content": "alright, second review time and it has been some time since my first one, this time i'm going to discuss Dakara Boku wa, H ga Dekinai, a mouth full if you ask me.\r\nFirst off let me say that this show is still airing and I will change my score when this show is completed, so this review is meant to give you an impression. \r\nAnother thing I would like to point out from the start is that this show is ecchi, so for those people who don't like it, don't even start watching this as there are plenty of ripped clothes which will leave somegirls almost butt naked aside of some strings, so boobs, ass and shyness are there.\\n\\n\r\nWith that being said, let's start off;\\n\\n\r\nStory 7; Now this is straight off where I'm actually already bothered but also where I have to think off what still has to come. This show has great potential and can easily be 1 of the better shows out there at the moment, however the fighting scenes are generally always in the same order: enemy appears, girl gets in trouble because her energy is not high enough yet, boy gives energy, girl whoops enemy's butt.  Don't get me wrong though, the fighting scenes are pretty well done when it comes down to action, but I hope that it will change a bit in the future. \\n\\n\r\nNow for the rest of the story, as I said it has great potential and that is because so many things have not been explained yet, as the creators of this show keep giving slight hints that there is coming a major twist to this story, the real action still has to come, I won't explain what still has to come as I myself hate spoilers and I won't spoil things for you guys either.\\n\\n\r\nArt 9; Scenery is really well made, characters are not some sort of misformed animals and actually look pretty well. And as I explained earlier, fighting scenes are well made when it comes down to the actual moves of the characters, also it might just be me but I think that the shows is looking better now than it did at the start of the show, might be mistaken here though.\\n\\n\r\nSound 7; nothing really special here, the voice actors do a decent job as so far I have no real hate for a specific character when it comes down to their voices, in fact each and everyone of their voices suit the character pretty well.\\n\r\nBGM and opening/ending are mediocore, nothing that will stay with you when this show is over but still decent enough to make you somewhat enjoy it for the moment and the BGM does it's job by adding some tensity or calming atmosphere to the scenes.\\n\\n\r\nCharacter 8; This is another point that I will most likely change when this show is over, I will briefly explain why, the main characters show promise when it comes down to their power and character development in general considering romance etc. However this still has to be done of course and I hope the creators do this otherwise the score for this will drop as fast as a human in the air without a parachute.\\n\\n\r\nNow on to a little in-depth viewing;\\n\\n\r\nThe main protagonist, (Kaga, Ryosuke) is NOT as in most ecchi, action animes a complete weakling who is incredibly pathetic, in fact he is the one who has to save the female protagonist almost the whole time but there is a good reason for that which I won't explain as it would spoil too much.\\n\\n\r\nWhere this guy gets his power from is absolutely hilarious in my opinion and I think most people would agree with me, he is a very likeable character and for once I enjoy the main protagonist.\\n\\n\r\nThe female protagonist, (Renstall, Lisara) is basically Ryosuke's master and main reason why this show has the ecchi tag which you will understand straight away after the first episode, believe me when I say that after you've seen the first episode you will know straight away whether you will like this show or not. \\n\\n\r\nThe minor main characters and side characters are doing a decent job so far to add to the plot and to the comedy aspect.\\n\\n\r\nEnjoyment 9; This is a high score, I know, however I will explain why. Even though this show has it's flaws and the fighting scenes have the same order of how it goes, it is still a very enjoyable show and before you know it you will have reach episode 6 which should air this week, I think. \\n\\n\r\nAs I said many times in this review, this show has potential and I hope that they will have everything taken care of when it ends or at least make it so good that I will look forward to a season 2 if it will come out as this show can become a gem.\\n\r\nFor me personally so far, episode 1 was really well done, it will get you excited for the next episode but then it slows down a bit it will explain stuff and let's you go with the flow, but the last episode I watched today(nr.5) it will pick up some of the pace again and in between the episodes it will give hints as I stated before of some major stuff that still has to come.\\n\\n\r\nSo in 2 sentences; Dakara Boku wa, H ga Dekinai is a possible gem but still far from being one. It has flaws and will certainly need some work, but still very, very enjoyable.",
            "date": "2012-08-12T03:05:00+00:00",
            "helpful_count": 15,
            "mal_id": 69497,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1290585.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/markinho",
                "username": "markinho"
            },
            "url": "https://myanimelist.net/reviews.php?id=69497"
        },
        {
            "content": "Like your average high school boy, Ryosuke Kaga can’t stop thinking perverted thoughts.  Unlike the average high school boy, he won’t shut up about it, and cares little for anything other than breasts, butts, breasts, napes, breasts, panties, breasts, and...  Um...  Underarms.  It makes more sense when he says it.\r\nAnyway, on his way home from school, he sees a beautiful red-haired girl standing all alone in the rain outside of his house.  Not content to just stare at her wet, transparent shirt, he offers her his umbrella, and invites her in for a change and a shower.  No soonerare they indoors and alone then she begins to hold him close...  And just when he’s getting ready to ditch his V-card, she stabs him through the heart with a giant sword.\\n\\n\r\nAs it turns out, her name is Lisara, and she’s a grim reaper...  You know, those things that were cool until Soul Eater...  And in order to complete her mission on earth, she needed to form a contract with somebody who had inexplicably high amounts of life energy...  Which Ryosuke apparently has in spades...  And she draws her power directly from the one thing that makes her new partner love his life so much.  Unfortunately for her, she finds out that he drives his passion from his perversion, so she can only be at full power when he’s popping a woody...  Which works out perfectly, because without that power, she gets her ass kicked faster than Lina Inverse on her period... Losing her clothes in the process.\\n\\n\r\nAt first glance, you’d think this was the perfect set-up for an ecchi fanservice series...  Well, yes and no.  We’ll get to the meat of this review in a few paragraphs, but for the moment, I must give credit where credit is due.\\n\\n\r\nSo I Can’t Play H...  Which I’ll simply be calling H from now on...  Was produced by a company called feel, and while I’d love to say some smart-sounding words about their track record and production history, I’ve never actually heard of this company before.  They’ve done in-between animation on a few shows I’ve seen, but up until now, the only show they’ve directly produced and animated that I’ve actually seen was Corpse Princess...  Which I only remember dropping out of boredom.  \\n\\n\r\nI can’t say anything about feel, but whatever their eternally lower-cased history may be, this show is drop dead gorgeous.  The occasional CG is breathtaking, whether it’s taking the form of a simple escalator or the teleportation field around a reaper.  This is CG rendering that even Sword Art Online would be gasping at, even if the color scheme does kind of become an eyesore in the final few episodes.  The backgrounds are exquisitely detailed, expertly framed, and they will absolutely dazzle you with their use of lighting and shading.  \\n\\n\r\nThe animation for the characters is much simpler, but not bad by any means...  Their designs are very standard, a little on the bland side, and nowhere near as realistic as the aesthetic would have you believe... but their movement is still quite a bit more fluid than what you’d find in most shows of a similar ilk.  Key frames and speedlines are rare, but they’re used fairly well for what they are.\\n\\n\r\nSo, when you’re talking about ecchi titles, the bar is consistently a low one...  Titty showcases aren’t typically known for having good writing, original ideas, or any value outside of the perverse.  It’s entirely possible for ecchi shows to be enjoyable outside of the skin content that they offer...  Strike Witches is a prime example of this...  But actual depth and creativity are rare elements indeed.  So why am I bringing this up, while talking about a show that’s basically just Bleach meets Girls Bravo, with an older version of Shana in the lead role?  Because, believe it or not, So I Can’t Play H came dangerously close to impressing me.  \\n\\n\r\nWith the plot being set up the way it is, H had a potentially brilliant subversion right in the palm of it’s hand.  With Ryosuke being a hopeless pervert who values women solely for their bodies, and who’s depth of character only reaches the level of ‘I like different poses,’ and Lisara drawing her energy from that pervert power, the only thing this show had to do to have me eating out of it’s hand was to not have anybody fall in love with him.  If he was simply used as an object, as Lisara proclaimed in episode 1, then it would have been a very clever play on his habit of objectifying women.  I can take the plot at face value...  Trust me, there’s a lot worse ideas out there...  And it makes sense that, under this arrangement she’d eventually get used to being naked around him.  From there, she should have grown to see him as a necessary annoyance...  A being less than a man, who she doesn’t feel remotely threatened by, like a little kid, or a brainless dog.  In fact, the entire harem could have seen him this way, adding a surprising edge of feminism to the heaping helping of boobs that the show throws at us.\\n\\n\r\nAnd as far as the romantic aspect of H goes, this change would have also helped Ryosuke become a much better character...  He could have been emasculated by their treatment of him, faced his immature flaws, and forced himself to develop and grow in order to win more than just Lisara’s time.  I can’t even begin to describe how refreshing a dynamic this would be, and I certainly can’t express how much good will I would have had for this title.  But alas, this isn’t how things went...  Lisara’s promise to use him as a power source was nothing more than the same old cliched Tsundere bullshit that we’ve grown accustomed to.\\n\\n\r\nEvery girl in the harem falls madly in love with this skeezwad, and he doesn’t start to show monogamous interest in anybody until the third quarter of the series, and it comes from pretty much out of nowhere, proving to the viewer that male perversion can only be overcome if a woman is willing to accept and tolerate it.  Yeah, just love that womanizing douchebag, and he’ll only have eyes for you eventually.  I wasn’t really expecting any better than that, but it would have been nice.\\n\\n\r\nThen again, it’s not like that message will ever reach the ears of anybody whom it could damage...  I can’t for the life of me imagine anybody enjoying this show without a bottle of lotion sitting beside them, and any negative message it sends will fly right over the heads of THAT market.\\n\\n\r\nOh, and speaking of all the girls falling in love with him, the funniest thing about H by far is how little it understands human emotion...  Yeah, I know, big surprise, no harem characters are realistic.  But we’re talking about a whole other level here.  It’s not uncommon for harem girls to fall in love with the main character for no reason whatsoever, but this has to be the first anime I’ve ever seen where one of the girls doesn’t start to show an interest in him until another girl suggests it.  Yep...  No exaggeration there.  One of them says “We both like Ryosuke,” and in so many words, the other one says “I do?  Oh yeah, I do!”  And the laziest love interest in the series was born.\\n\\n\r\nDo I even have to mention that it gets worse than that?  There’s a reveal halfway through that’s probably one of the most bewildering anime moments I’ve seen in a long time.  Ryosuke skypes his mother for spoiler reasons, and a girl in the room asks her for some information regarding his bloodline.  She says, in so many words, “Oh, by the way, I lied about your father being dead.”  That’s it.  No hesitation, no reluctance, she just drops what should have been a ton of bricks on him out of nowhere and with not nearly enough prodding to suddenly break sixteen years of silence.  And his reaction?  Mild surprise at best.  She gives him a quick explanation, and the subject gets dropped faster than the beat at a Skrillex concert.  And no, that’s not a spoiler worthy of a warning...  I wanted it to be, as I was pretty damn sure the villain would turn out to be his father in a mask, but it never gets brought up again.  It’s even more bafflingly stupid than Ryosuke’s mental dictionary.\\n\\n\r\nWhich reminds me...  Remember that plot I mentioned earlier?  The one I begrudgingly decided to take at face value?  Yeah, it’s about as consistent as an everlasting gobstopper.  According to the back of the DVD cover, Ryosuke can’t be perverted after Lisara’s used him for power, so he wants to help her so she can leave and his life can return to normal.  Yeah, at no point in the show is that ever true.  First of all, that’s not the reason he’s helping her...  He’s doing it because she says he only has 3 months to live, and he wants her to save him.  Second of all, he never stops being perverted...  Although even when she’s buck naked right in front of him, he has to (I wish I didn’t remember this) memorize all of the dirty words in a dictionary, so he can call any dirty word to his mind when needed.  Because it takes obsessive studying to come up with the word “Bath.”\\n\\n\r\nAnd third of all, his childhood friend makes a contract with Lisara’s childhood friend, and her passion for life comes from her love of Ryosuke...  Spoiler, yes, but you’ll figure that out long before it’s revealed.  And get this...  The exploitation of her life force NEVER causes her to stop being in love with him.  I think that’s a problem, don’t you?  That is, aside from the problem of her being in love with a skeezwad.\\n\\n\r\nAnd oh, I know what you’re thinking...  “It doesn’t matter if it’s stupid, and shamelessly puts flesh on parade despite some gaping plot holes, inhuman behavior, and elements that make absolutely no sense.  Hell, Strike Witches was a booby show, and the logic revolving around the panties makes for an incomprehensible plot hole, and you love Strike Witches!.”  Yeah, you’re right.  Strike Witches was a stupid, idiotic mess with copious amounts of bare boobs.  But you know what it wasn’t?  Pretentious.  Strike Witches was a blast from start to finish because it never tried to be anything deeper than action-packed cheesecake.  But that wasn’t enough for H.\\n\\n\r\nSee, the story gets serious in the second half...  Well, at least it tries, but all it ends up doing is making even less sense...  And it tries it’s hand at some real drama.  I’ll spare you most of it, including Ryosuke’s uncanny transformation into a perfect gentleman the moment he gets a legitimate chance to pork somebody...  And talk about the villain’s motive, which is going to be a difficult thing to do without giving away any spoilers.  \\n\\n\r\nTo put it in ambiguous terms, the villain’s motivation is driven by a disturbingly real threat to the very existence of life on this planet...  It’s a threat that nobody is talking about yet, as it’s even more controversial than climate change, and the people who try to take a stand against it are demonized for their efforts.  This is quite possibly the first time I’ve seen a fictional story try to tackle this issue, but as I learned before, I wasn’t expecting too much.  Ryosuke and his harem are conflicted over this issue, which seems to be far too great a necessary evil to face...  And I swear to god, the solution this story comes up with is one of the most pretentious fictional solutions I have ever heard for anything.  It’s steeped entirely in ignorance of human nature and whimsical sci-fi fantasy, which makes H feel all the more shallow and stupid for it’s efforts.  It’s like listening to a ten year old say that Israel and Palestine should just hug it out, or seeing Superman solve the world’s problems by sending all the nukes into space.  It’s a cute idea, but for the love of god, please don’t write a freaking story bout it!\\n\\n\r\nIf I haven’t already made this clear, H is incompetent down to it’s lowest possible level.  The jokes are bad, none of the characters are likeable, the nudity is too constant and over-saturated to remain sexy for longer than the space of a single episode, and the music is made up of cookie-cutter dating sim tunes.  It’s childish and stupid down to it’s very core, and while it’s offensive to women in some very creative ways, the only thing that keeps it from becoming completely morally repulsive is the fact that the harem in question doesn’t include any incestuous or lolicon characters.  Hell, the one harem girl who’s still in junior high is also the only girl in the entire show who never does any unobscured nudity, because yeah, THAT’s going to save it at this point.  The only reason I can see anybody watching this is because of the boobs...  And if that’s enough for you, then congratulations, you’re eternally 14.\\n\\n\r\nSo I Can’t Play H is available on DVD and Blu-ray from Sentai Filmworks.  It’s fairly expensive on most sites, but at the time this review is being written, you could get it at Rightstuf.com for 17.99 or 23.99, depending on your preferred format.  There’s no dub as of yet, but knowing Sentai, they’re probably just waiting tentatively to see if this title is popular enough to justify spending money on a dub.  It’s a shame they have the rights to it, because a show like this really belongs in the hands of Funimation.  It’s one of the few titles I’d actually LIKE to see Jamie Marchi write the script for.  \\n\\n\r\nThe DVD doesn’t include the final thirteenth OVA episode, and while that omission may be a completionist’s nightmare, I really think it’s better to just pretend that episode doesn’t exist.  Why?  Well, remember all those female characters that you’ve already seen naked in every possible form of undress, and from every possible angle that won’t violate Japan’s decency laws?  Well, the final episode is a swimsuit competition!  Yeah, that’s exactly what this show needed!  No, I don’t want to learn more about the villain, or the whereabouts of Ryosuke’s dad, or the societal results of this show’s idiotic conclusion...  I wanna see my fetishes catered to even harder and more gratuitously than before, in an episode that isn’t even a tenth as well animated as the series that preceded it.  \\n\\n\r\nSo, as worthless as this show is, I can’t really call it the bottom of the barrel.  The animation, quite frankly, is too beautiful for that.  But it’s close.  And keep in mind, the ecchi genre dwells in a barrel that’s every bit as deep as the Mariana trench, and it’s bottom is littered with even more despicable 1/10(or below) titles like Dears, Eiken, Love Love, Popotan, and Master of Martial Hearts.  H is floating just a few feet above those titles, and about a dozen feet below School Days.  That’s not a place any anime wants to be...  Trust me, it’s really cold and dark down there, but it’s where this title belongs, and I can’t wait to post this review and instantly go about the task of forgetting about it.  I give So I Can’t Play H a 2/10.",
            "date": "2014-12-02T10:51:00+00:00",
            "helpful_count": 12,
            "mal_id": 170803,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1594843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fear_the_Reefer",
                "username": "Fear_the_Reefer"
            },
            "url": "https://myanimelist.net/reviews.php?id=170803"
        },
        {
            "content": "Dakura Boku wa, H ga Dekinai is basically your run of the mill, standard echhi anime. While this anime is by no means terrible it is simply mediocre at best. The story was promising at times but the plot was never sufficiently explored for me to care too much. The animation was pretty good but thats to be expected. The soundtrack is by far the best part of the anime, as the opening and ending are both outstanding. The characters........ This is where Dakura Boku wa, H ga Dekinai falls flat on it's face, of all the characters i only like one, The main characterhere is extraordinarily bland and quite frankly a bore to watch, The main heroine is cliche and mostly uninteresting and most of the others are the same. So overall while i enjoyed this anime at times the story and the characters made this unable to be anything but mediocre \\n\r\n6/10 if anything listen to the op and ed of this show as they are fantastic",
            "date": "2014-07-09T14:40:00+00:00",
            "helpful_count": 8,
            "mal_id": 151255,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2698755.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SakurasouBusters",
                "username": "SakurasouBusters"
            },
            "url": "https://myanimelist.net/reviews.php?id=151255"
        },
        {
            "content": "Haters of the ecchi genre or people who do not want to be accused watching porn, please skip this review and check other reviews out because this anime is all about boobs. Boobs are everywhere is this anime! Right, I'm going straight into what I feel about this anime.\r\nStory:\r\nHonestly, the plot in this anime is terribly boring. The whole anime is centred around this death goddess searching for the most powerful energy source in this world. Of course, obstacles appeared and they overcame it and that's all.  They actually spend about 9 episodes or so searching for that energy source. Pretty boring to meas it was sort of draggy. To be really honest, if the characters didn't display their body aspect to such extent, I would've dropped this anime long ago. Also, this anime focus far too much on the body aspect of the characters that made me forget I was actually watching an anime and felt more like I was watching porn. I'm not exaggerating but almost every few minutes, there will be someone's body being featured, naked. Therefore, due to the boring plot and the over-emphasise of the character's body, the story was not really brought into my mind.\\n\\n\r\nCharacter:\\n\r\nThe characters all have sufficient time in this anime. There wasn't a case of a particular character being left out after being introduced for a few minutes only. Hence, the appearing time for the characters was rather balanced. Additionally, you might want to pay attention to Lisara only as all other females are a pain in the eye. \\n\\n\r\nSound:\\n\r\nNothing to comment on the sound because it has little significance in the anime. I totally forgot the existence of a OST in this anime. However, the opening was catchy and impressive.  \\n\\n\r\nArt:\\n\r\nIf we are talking about the art in terms of the body art of the characters, it normal like any other ecchi animes. Nothing really special or unusual about the body art here.\\n\\n\r\nEnjoyment:\\n\r\nI decided to watch this anime because I had nothing else to watch, hoping this anime could at least entertain me a little. However, the plot was plainly boring and there was an over-emphasise on the character's body which disappointed me a lot. I know this is an ecchi anime, but there has to be a limit to the amount of time spent showing us the bodies of the characters. So basically, this anime was not very enjoyable to me. If the plot was a little more interesting  it might actually turn out to be a very enjoyable anime. Therefore, I would strongly advise you to not spend too much time in this anime because it might turn out to be a waste of time for you because it is really terribly boring. \\n\\n\r\nThank you.",
            "date": "2013-07-24T09:26:00+00:00",
            "helpful_count": 8,
            "mal_id": 106607,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 5,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Gladeo",
                "username": "Gladeo"
            },
            "url": "https://myanimelist.net/reviews.php?id=106607"
        },
        {
            "content": "I watched this because someone recommended it, with the bold statement 'It's better than Highschool DxD!' I am a massive DxD fan, of both the anime and the LN series. Challenge Accepted. \r\nUpon completion of this I realized that that recommendation was done by someone who was either A) High or B) Hadn't actually seen DxD. \r\nThis anime doesn't hold a candle to it.\r\nNot to say, if you like your usual action/fanservice fapfest, that isn't watchable.\r\nStory - 6\r\nI got the feeling, from watching this, that there was a decent story in there somewhere but it was garbled and disjointed. Unfortunately I think it fell preyto that age old enemy of Good Plots.... Fanservice. Maybe if I watch it again and ignore all the bouncing boobies it might make a little more sense. Easier said than done though.\\n\\n\r\nArt - 8 \\n\r\nCan't complain about the art. It's very easy on the eyes. \\n\\n\r\nSound - 5\\n\r\nGot to give the sound an ambiguous 5. I can't actually remember any of it.\\n\\n\r\nCharacters - 8 \\n\r\nThe main and the heroine are the reason for an 8 here. I had to give them credit for not pussyfooting around. If I say anymore, it'll probably be considered spoilers so I'm going to hush up. \\n\r\nI usually have a pretty good memory for interesting/unique anime characters and none of the rest of them stick out particularly vividly, which pretty much says it all in my book.\\n\\n\r\nEnjoyment - 7 \\n\r\nYeah, OK I enjoyed it. But then again I'm too easily amused by boob-power. I'm still a 14 year old at heart.\\n\\n\r\nOverall - 7\\n\r\nIt definitely feels like it could have been the successor to DxD in my opinion. It's disappointing it doesn't really live up to it though and it falls into the pitfalls that many anime of this category do. .\\n\r\nPleasing visuals and two characters that fit my personal preferences make up for a so-so storyline and forgettable secondary characters.\\n\r\nThis anime is definitely more for someone who is between series or who wants to just kill a bit of time with something generic from the ecchi/harem genre. It's not selling the genre to newcomers that for sure.",
            "date": "2013-05-31T16:11:00+00:00",
            "helpful_count": 7,
            "mal_id": 99171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2624431.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Manganese",
                "username": "Manganese"
            },
            "url": "https://myanimelist.net/reviews.php?id=99171"
        },
        {
            "content": "NOTE: Again, this review is only based on the anime. I haven't read both the light novel and the manga.\r\nEDIT: Some grammar check and minor addition of content. My opinion regarding the anime still remains the same.\r\nAfter I and my ecchi-addicted friend watched the first episode of \"Dakara Boku wa, H ga Dekinai\" (which we simply watched since I saw it here on MAL that it's like High School DxD), we both know that there's no sparks out there, trying to hook us - its watchers - to get into the anime. Despite that, we still continued to watch the anime. Although finishing the animecould be rewarding, I doubt that most people will have enough patience to last that long, with the anime's first four episodes not deviating from the usual ecchi anime formula, (with the clothes melting off and \"OOH, BOOBS!!!\") and the laughs simply not enough.\\n\\n\r\nThe male lead character, Ryousuke, is also your usual male lead character: a lecherous wimp of a teenager (though he gains some sort of powers, the first one - making him regain ero-energy - I find cheesy ). At least I find Lisara, the female lead, a good character, serving as a foil to the pervert Ryousuke.\\n\\n\r\nThe art and character design is very much similar to High School DxD. Not that I have any complaints about it since it actually looks nice and all.\\n\\n\r\nWhat made the first four episodes \"lacking in sparks\" is that 1) the first episode basically showed all of Lisara's powers as a shinigami, and 2) the following episodes follows the usual plot developments of the usual ecchi anime, which has become, simply put, predictable and bland. By that time, some - if not most - of its viewers would've dropped the series, thinking that it shouldn't take half of the series' worth of episodes to get them hooked to the anime (unless all they're looking forward to is more boobs, that is).\\n\\n\r\nThe latter half of the anime features a genre shift from mostly ecchi/harem to more of action (although the fan service still is there), and by this point until the last episodes (which features another genre shift to romance), the story actually starts to have an identity of its own (and also, more sense to comprehend). \\n\\n\r\nUnfortunately, this anime's problem - overall - is that it plays safe and by doing so, it actually became something that is trite and banal, so if you're going to watch this seeing that it's like another (albeit inferior version of) High School DxD. If, on the other hand, you haven't seen much ecchi in your whole life (or you simply just wants boobs, boobs and more boobs in your anime), then perhaps you might just enjoy this one.",
            "date": "2013-05-24T17:08:00+00:00",
            "helpful_count": 7,
            "mal_id": 98281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2246281.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/tsuyo_sama",
                "username": "tsuyo_sama"
            },
            "url": "https://myanimelist.net/reviews.php?id=98281"
        },
        {
            "content": "Recently I was out of anime to watch and was looking for a few of them and came across Dakara boku wa H ka dekinai. I heard a lot of praise especially for it's second half and as I was dropping anime quite a lot here and there I thought about giving a shot and let's just say it didn't go well for me...\r\nStory: 2/10\r\nAt best I could describe the anime as \"border to hell\" with a 2. That's the most I could ever give it for the story section. Call me wierd, but I am very particular about a plot in an Ecchi anime,so I went in with DxD-like expectations and got severely disappointed, and sadly there were a whole long list of reasons apart from that which made me hate the show as well.  I'll go step-by-step, since the anime itself was divided into two parts, I divided my story section into two parts for easy understanding.\\n\\n\r\nThe first six episodes are basically plotless and contribute zilch to the plot, it's just ecchi and more excuses for more ecchi. Characters being introduced in a cliched manner and wasted exactly HALF the anime in it. You might bring up the excuse and say \"but that was fanservice for the fans, it's Ecchi, it has to have it\". Well, sadly this anime itself couldn't decide so who am I to judge. It was a harem in second, then pointless Ecchi in the next, and then weak plot. The studio couldn't even decide WHAT to follow for the first half and made me think as if the studio just licensed an anime and opened the reference books a few days before the airing date. Thankfully I went past the tortious first half and the end of episode six revealed that the next half (un)fortunately will focus on a proper plot (made you think the studio finally got their hands straight didn't they? Wrong.\\n\\n\r\nThe second half was something that was praised a lot by other reviewers and watchers, not to mention people said the ending was excellent, so I forced myself through the first half and trudged on to the next episodes, what did I get? A bunch of zilch in return. In the most basic sense this anime tried to pull off a Hyoudou Issei DxD-esque rescue-person-in-another-world plotline and let's just say much like the rest of the anime, they ruined it. Plain and simple. A cliched villain, ***MINOR SPOILER: whom we don't see the face of at all, for no absolute reason...END SPOILER*** a cliched adventure, a cliched set of pointless fanservice yet again (that excuse won't work anymore my friend, this half was plot-time, and a whole lot of plot holes. If you compare the amount of plot holes in this anime to a beggar's clothes only 2 times out of 10 will the beggar's clothes have more holes than this plot, which by the way is the score this anime deserves for a terrible story line. I'll end with a weak joke, it was \"a border to hell\". There you go, obligatory hell joke in anime about hell is obligatory.\\n\\n\r\nArt: 3/10\\n\\n\r\nI think I know why I immediately understood who the studio was because it was a mess as usual from Studio feel. The familiar washed-out artstyle and horrible effects immediately pointed feel. toward me and I wasn't surprised that I was right (although I was kind of surprised). Going in detail on those aforementioned reasons, even at 720p it looked washed-out. This is a familiar tactic used by the lazy art directors at feel. and I remember this clearly since SNAFU S2 where they ruined an excellent artstyle (courtesy Brain's Base for the excellent first season) and that was seen here as well. As for the effects, the characters had to perform action sequences and throw spells at each other, those required effects at a good level and feel underdelivered. They looked like something a rookie would make, no joke. It looked terrible to be honest and the washed-out artstyle made it even worse. And don't get me started on that horribly lazy tactic used in between episodes 9 to 11 as a green background almost everywhere to save time and be more lazy. As for character design, I can say that was the saving grace of this section and if not for the character design, it would've gotten a one, once again no joke. You can clearly see some effort (perhaps the only effort) out into the art into the characters. They looked vibrant, cheery and better than the rest of the art section in general. I personally like the shades of colours used for everyone, especially Quele, Lisara and Iria. Other than that... Well nothing positive so let's end here.\\n\\n\r\nSound. 4/10\\n\\n\r\nAt best I could describe the sound section as decent. Apart from that massively forgettable OP/ED (although I must admit later on the ED was kinda catchy, but kinda) the OST too couldn't figure itself out. You won't believe me if I tell you that the sound changed EVERY episode. Not a good sign when you've got sub-par story and art scores. The VAs more or less did their job decently which is why I've given a 4 and not a 2. On the other hand like I said the OST was a mess, especially the BGM. \\n\\n\r\nCharacter: 1/10\\n\\n\r\nWoah, this is the first time I've ever used 1s 2s and maybe 3s in a review ever. Well, I can say that the characters were promising at first but it's what happened to then later which made me give them this outrageous number. They took that potential and threw it down the garbage and shoved it down your throat. If you want an easy example to understand through, this is it. I'm already severely disappointed in TsunDeres and our Rias Gremory wannabe Lisara Rest-whatever was a painfully bad TsunDere. Apart from being a 99.9% Tsun, that .01% came through in the last Episodes and if you think that's enough to make me change my mind, well you're sadly mistake.I still can't believe what made people think that ending was any good. Personally I'd be glad if it went the way of the \"bad guys\" since that way I could have been a bit more generous in my scoring but then this HAD to go the typical Shounen route. Anyway, speaking of Shounen, we move to Erosuke, I mean Ryousuke, unlike Hyoudou Issei, this guy was a hilarious attempt at a pervert MC. Forget about his cliched energy, the way he got his power among many other things made me feel like banging my head on a table. As for the denseness, a thing noticed in many romance anime, well I can say this sole reason is the one I'm giving a 1 and not none. As for the other jokes we move to our onee-sama cliche 'imouto', Quele. I rooted for her throughout the anime (I moved on from Mina due to reasons I'll detail later) but then after that pathetic fanservice scene in the second half I LOATHED her as well. Mina was a character I instantly liked at first, but like this anime, my support for her crumbled faster than the plot did. She was too damn shy to be supported anywhere in the course of the anime. It was painfully obvious at the start who would win in the end. As for our other character who was brutally pushed to the side, Iria. She was your basic \"rival\" archetype and that didn't please me at all (even in that way if you take it). There was nothing about her that wasn't cliched. 'Nuff said. She wasn't even the breast character in the anime (apologies for the pun), which puts her appeal to the maximum of 0.\\n\\n\r\nEnjoyment: 3/10\\n\\n\r\nYes, the characters were horrible, yes the artstyle was washed out, yes the story was cliche as hell. But yet there was something that made me watch this anime and not dropping it, perhaps it was the way the after-credits scene was handled after each episode, or because I was dropping too many anime, or because I watched it to crush it in this review, or more likely all three. As for the fanservice part, it was absolutely fulfilled, although I'd love some reasons as to why it happens, heck, even half an excuse would work (such as Yuuki Rito's antigravity control, just kidding). I may sound positive but in the end it was almost worthwhile watching the anime.\\n\\n\r\nOverall: 2.6 (Averaged)\\n\\n\r\nBreaking the record for my lowest rated review, Dakara boku wa H ka dekinai takes the top cake as my worst reviewed anime ever. If you're in it for the plot, you'll be disappointed, if you're expecting some character development, you're an idiot (apologies for being rude), if you're in here for the Ecchi, well most of you will be satisfied. I was very surprised that this anime was praised for it's last arc and the last episode because frankly I ironically found the first half almost understandable than the second half which was a mess and a failed copy of DxD. On a personal note, it yet again disappointed me as a TsunDere fan since Lisara takes my award for the worst character of the anime. Period. All in all, this is an anime which you'll be forgiven if avoided and rewarding if you love ecchi with no plot and just oppai, although I must admit, it might be a fake too. I'm honestly half surprised at the score the anime ended up with. I expected a little more, maybe 4 but at 2.6 it makes me laugh a little. To be frankly honest with you ***SPOILER: If the end was tragic, perhaps I'd be a bit more considerate and I thought about this throughout the anime, and sadly it didn't happen. It took the pathetic harem route with no meaning to it, it didn't even try making up an excuse for the ending...\\n\\n\r\nP.S: After such a disgraceful score I don't think I have a waifu for the waifu corner. All I can say is that Caesar is the best character of the anime. That's it. Goodbye. No waifu corner. This anime doesn't deserve one.",
            "date": "2018-01-04T14:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 267421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=267421"
        },
        {
            "content": "If you were to take the classic, quiet girl with a large chest with a crush on the MC since they were kids; the large-chested foil who wants the MC just because; the moderate-chested girl who learns to love the perverted antics of the MC, and the clear romantic interest with a small chest and a tsundere personality, and add a moderate-bust sized cold killer, that'd be the entire female cast of the show. (I typically don't define anime girls by their bust size, but in this series, the screentime on just their faces and just their busts are about equal.) Throw in the pervertedMC who has a power everyone wants and that's the story in a nutshell.\\n\\n\r\nI watched the entire series because I read a review that said it got better after episode 6, I think it got better at episode 5, but (at least for me) it didn't keep on getting better to a level that was enjoyable.\\n\\n\r\nThe art is good, not great. The sound is not really memorable (but to be fair, that's a critique I have with most non-music series). The characters are walking cliches. If you like seeing the same scene of a girl being held up by tentacle-like things as her clothes fade away, followed by the MC getting a magical power up and saving the day (repeatedly during the course of the series), then you'll probably like this show. \\n\\n\r\nThe story ends so thoroughly in 12 episodes that you're pretty sure there wasn't much to the story to begin with.",
            "date": "2014-01-17T22:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 129161,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3463853.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/No1shero3",
                "username": "No1shero3"
            },
            "url": "https://myanimelist.net/reviews.php?id=129161"
        },
        {
            "content": "Great anime.\r\nFull of comedy,  romance, action, and tits.\r\nStory\r\nI'm not even going to waste my time explaining the plot. Just know that it's great, and the first few episodes are basically intros for the characters. It might be hard to stay on-board (It's well worth it!), but know that after all the characters are revealed, this show takes off into greatness.\r\nThis anime shifts gears mid-story and steers from comedy ecchi towards a more serious tone. It matures very well yet still retains its \"fun\".\r\nThe only predictable things in this anime are the fight scenes in the first few episodes, afterwards nothing is obvious and itwill keep you guessing.\\n\\n\r\nArt & Sound\\n\r\nArt and sound are perfectly fine. The action sequences and romance scenes had great songs/music playing in the background.\\n\\n\r\nCharacters\\n\r\nThe main characters are great and developed with sense. I don't understand why people hate stereotypes. If there is a stereotype for each type of character, they're obviously going to be the same as any other show? That's like hating an anime that doesn't kill off the main character because an older anime didn't kill of the main character either.\\n\\n\r\nEnjoyment \\n\r\nI thoroughly enjoyed this anime. I just finished watching all 12 episodes literally 15 minutes ago\\n\\n\r\nOverall\\n\r\nSeriously, this show had me laughing hard as hell (ep. 5, perfect). Action was there but you can tell it's not the main focus, but still fulfilling. Romance, I've always loved romance/love stories and this show was put together very well, it's a harem as well and the main character chooses one (which I love to see). If I was a true man I could have cried at a few moments in this show.\\n\\n\r\nJust a perfect anime.",
            "date": "2014-11-13T09:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 168419,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MB22",
                "username": "MB22"
            },
            "url": "https://myanimelist.net/reviews.php?id=168419"
        },
        {
            "content": "Since your probably reading this just to test the waters for Dakara Boku wa, H ga Denkinai, I'm going to keep this review short.\r\n*MAL ratings are broken as helllll\r\nOverall, this ecchi anime is perfect.It is comedic, cute, exciting and unlike most, this actually has a story and i'snt a harem. All the characters are as believable as they can get in a 12 episode ecchi. Keep in mind that this is a casual anime, it's not a work of art but it is at its core, a ball of fun and has actually pretty decent romance. Also its not stupidly ero or ridiculous so itdoes have a slight \"realistic\" feeling to it. \\n\r\n*I wish this anime was extended!!!\\n\\n\r\nStory:\\n\r\nThe story flows well, although it was a bit slow at the beginning, most animes are, in order to set the story and introduce the everyone. It will actually make you feel something which is something alot of ecchi's fail to do, and you most likely continue watching because of the story, gags and romance.\\n\\n\r\nERO-yske:\\n\r\nThis leads me to the ecchi/fanservice/ero component, the ero in this anime is actually more of a necessity to forming the premise of the anime, as unbelievable as that is. Meaning the most of the screen time you see that is ecchi, is justified. That being said there honestly isnt that much nudity but definitely enough to satisfy.\\n\\n\r\nArt:\\n\r\nThe art is pretty good, maybe slightly above average. The detail is there, and it is enough to convey the feelings of the characters, and it will definitely have an \"effect\" on you during the ero segments. There is fighting involved, and it is actually well animated. The character designs were interesting and quite attractive, few with multicoloured/gradient hair.\\n\\n\r\nSound:\\n\r\nNot much to say, the OP and ED were okay and fit the anime. The voice actors were pretty decent, so really don't take much notice. Also no really annoying high voices, so that's good.\\n\\n\r\nCharacter:\\n\r\nThe premise of each character, were more than solid enough for this short series and because of this, I wish this series was longer. They could easily expand on all of the characters involved mainly Lisara. But excluding all that, they were believable and well thought through.\\n\\n\r\n-Main Characters:\\n\r\n As for Ryosuke, while being a teenage boy that opening expresses his love for the female form, he is the ideal guy you see in animes. Weak at first but determined, eventually becoming stronger and protecting the weak(girls). \\n\\n\r\n As for Lisara, she has a rough, or rather responsible exterior, is capable and cute when she gets embarrassed. She could maybe even a little be considered a tsundere \\n\\n\r\nEnjoyment:\\n\r\nIt's a fun series, with a storyline, and a decent romance, what more can you ask for. 10/10\\n\\n\r\nOverall:\\n\r\n8-9/10 || This couldve been something awesome. The ecchi is really a side dish to the whole anime (Which is great).",
            "date": "2013-07-13T03:42:00+00:00",
            "helpful_count": 5,
            "mal_id": 105121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Cryse",
                "username": "Cryse"
            },
            "url": "https://myanimelist.net/reviews.php?id=105121"
        },
        {
            "content": "This is a pretty good show, kinda weak, but still pretty good. It follows this guy whos an extreme pervert and the death god (female of course) that he lives with.\r\nThis show is one of those where the writers might have gotten a little out of control with their rights. I mean the whole basis is that the death god cant live on earth without replenishing energy so she decides to make a contract where she can suck his energy out. Thing is, for him to energize himself (heres where the fanserve comes into play) he has to be turned on/horny/have a raging boner etc.and to accomplish this he basically runs around copping a feel on anyone he sees and meanwhile there is supposed to be some touching romance story going on in the background... btw this is kinda a harem in a sense. Even better is the fact that the girls' clothing is like a meter for how much energy they have left, for instance if one uses a big attack, or something happens to deplete a large bit of energy, her clothes disapear... granted they start out in spandex so really its not like we couldnt already see everything anyway...\\n\r\nOh and i cant believe i didnt bring this up till now, but the main guy is going to die. That is why he agreed to help the death god because she said if he did she'd save his life when his time inevitably comes in 3 months. \\n\r\nTo keep shit interesting there are some fight scenes, betrayals, a big showdown, a near-apocalyptic disaster, and a friggin ton of titty flashes. Everything culminates in the final episode (as it does in most anime) and it was that episode (wont talk about it for spoilers) that took my opinion of this show from okay to pretty good. Honestly I had no idea how it was going to end until it was over and thats just how I like it to be.",
            "date": "2013-01-22T12:11:00+00:00",
            "helpful_count": 5,
            "mal_id": 84537,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=84537"
        }
    ],
    [
        {
            "content": "First off i want to make clear that the synopsis of this anime couldn't be more wrong than the way it is written on this site. Having said this, I'll write a proper one as it's technically the plot.\r\nStory 8 / 10\r\nRyosuke Kaga is a 2nd year student at Momozomo Academy. He's a extreme fan of erotica, and praises women for their bodies and believes them to be treasures. He's kind to every girl and shows concern, However he has the habit of speaking his mind out loud and his reputation as a pervert grows everyday, As he not only compliments girls good looks, butalso emphasizes on how they're erotic and creeps out every girl in sight.\\n\\n\r\n One day on his way back home he sees a petite red haired beauty standing right outside his house on the middle of the rain, He however can't allow this so he's corteus to her and invites her in his home. This girl however is a pro at what she does, As it just happens, She is a \"Shinigami\" or a Death Goddess, At least that's what she call her self, As Ryosuke was prepared to make his move, She stabs him with half of a blade that allows her to make contracts and temporal contracts with humans to sustain her existence on the human world as for any visitor from \"Grimwald\" her world. \\n\\n\r\nRyosuke can dissolve the contract at any time, and at first he's reluctant to believe what she is, That's before they're attacked by organism that belong to her world, She begins to fight the organism and takes some of  his energy and quickly defeats it.\\n\\n\r\n Lisara Restall is the Grim Reaper name, Her world is suffering an energy shortage and her mission is to find \"The One\" a human capable of producing unfathomable amount of energy that would benefit her world greatly and mission.\\n\\n\r\n Ryosuke as i said can back out, But then she releases shocking news,She Possesses the ability to knows how long people have left to live just by looking, Ryosuke has only 3 months left to live, Now if he helps her, She can use \"The Ones\" energy to renew his life, Or he could perv out and wait for his for his number to be called. Peoples energy usually comes from a driving force, His is erotism, Now every time she uses his energy he will be incapable of getting excited \"Downstairs\" for a time. Things never stay business between a hot reaper and a perv human partner, Things tend to tangle and along the way many things happen.\\n\\n\r\nArt 9 / 10\\n\r\nThe art is above average and smooth. Very enjoyable.\\n\\n\r\nSound 8 / 10\\n\r\nThe voice actors are very good and the sound tracks are very much on point.\\n\\n\r\nCharacters 8 / 10\\n\r\nVery developed and enjoyable.\\n\\n\r\nEnjoyment 8 / 10\\n\\n\r\nI enjoyed this anime very much, I'd recommend it to anyone out there that enjoys the Ecchi Genre with some romance.\\n\\n\r\nOverall 9 / 10 \\n\\n\r\nThe anime itself it's great, A lot of ideas. It portrays a relationship that start as business and end up in romance. This anime is very serious on story line, It makes good use of Fan Service and the expected \"Ecchi\", This saddly cripples the story as for some of the material used in this anime, Was needed if it were to be a extended anime, The only mistake here is that they tried to fit way to much in such short space.\\n\\n\r\n I'm certain that in a 24Ep anime this would have been quite the anime, But on my view this cramping dropped it to an (9). Which is the overall i'm giving the anime. Why an (9), Well you gotta be made of STONE to no like this anime, It has a little bit of everything, So much that what you find lacking, It another quality fills the gap and continuously keep going, With proper Comedy, Drama, Ecchiness, Harem, Romance that rotate back and forth and fill up the gaps.",
            "date": "2014-02-16T00:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 132733,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3316339.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ChaoticThinker",
                "username": "ChaoticThinker"
            },
            "url": "https://myanimelist.net/reviews.php?id=132733"
        },
        {
            "content": "Just 4 months later after following the success of Highschool DxD and its perverted yet popular protagonist Issei, Dakara Boku wa, H ga Dekinai its first episode. After watching the first episode me being a huge harem fan expected great things from this show. However with time all my expectations were shot down and flushed down the toilet making me regret ever watching this in the first place. \r\nPlot 2/10\r\nThe plot was so bad it was almost disgusting that the producers could come up with this garbage and try to pass it off as a decent story. What turned me off the most was thatthe story was decent until about episode 7 and it felt like something was thrown in the faces off all the fans with poor story telling and replacing the plot with pure fanservice. All the seriousness of the anime was taken out and replaced by flat chests, big boobs and girls stripping every 5 seconds for completely no reason (atleast they had an excuse before) thus leaving a bad taste in my mouth. Not to mention by doing so nothing made sense and I have no idea how I was able to set to this \"Completed\" on my list.\\n\\n\r\nCharacters 4/10\\n\r\nIf I was to go through all the characters and make a list of all the traits they have and my feelings toward them, my list would look sort of like...\\n\r\n----->Borderline Sex-Offender , Shallow , Annoying , Stuck Up , \"Closet Pervert\" , \"Just Die Already\", \"No One Likes You\"\\n\r\nAnd that's just me being nice. All the characters are unlikable,, unrealistic, and almost pitiable. The only reason for the 4 is being of the character designs.\\n\\n\r\nArt 9/10\\n\r\nIf there was one thing I could praise \"So, I Can't Play H!\" for, it would be its art. Its nice too look at, easy on the eyes and at times stunning. It was very well done. To be honest it didn't deserve it.\\n\\n\r\nSound 8/10\\n\r\nThe Sound was another plus for me. I enjoyed the music throughout the series and enjoyed the OP and Ed with the OP giving me that Accel World feeling.\\n\\n\r\nOverall 5/10 (Rounded Up)\\n\r\nThinking back this might be one of the worst things I've ever seen but I can still name a few more animes that I feel are much worse than this. I also might be being too critical of this. It had a great start and a lot of potential. However it feels like all that was pushed aside by all the needless fanservice and random ecchi devices thrown in. I Recommend this to anyone who loves fanservice, anyone wants to laugh at a bad anime, or anyone who has the extreme power to sit through 12 episodes of this nonsense.",
            "date": "2014-04-05T18:50:00+00:00",
            "helpful_count": 4,
            "mal_id": 138845,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465770.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 5,
                    "sound": 8,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BossTheKid",
                "username": "BossTheKid"
            },
            "url": "https://myanimelist.net/reviews.php?id=138845"
        },
        {
            "content": "A weird one.\r\nStory wise, didn't intrigue me enough sadly. I can only give it a fair 6/10. The first episodes where something else, outstanding but after a while it went downhill fast and the last episodes were very very bad. The lie mostly in other categories that affect the story but it really seems like a ripoff Highschool DXD, which just letting the anime community know trying to copy a successful anime title will only do harm. Taking the good things from it would aid your cause but I think that the bad things were taken mostly. Like the weird ass main protagonist which Ipersonally dislike, the extra ecchi borderline hentai nature of some scenes and the whole plot its basically the same but like the extra stingy budget version (left a bad taste in my mouth).\\n\\n\r\nArt was very good with enjoyable battle scenes and colors, 8/10\\n\\n\r\nSound standard good sound nothing very unique but not bad either, 7/10\\n\\n\r\nCharacters...This is the redeeming factor, if it wasn't for the despicable male protagonist every other character is very good. 8/10.\\n\r\nTo justify, Lisara, unique mature professional and a demon to boot, couldn't do any  better there.\\n\\n\r\nRyousuke, one disgusting individual. Pervert to the bone and in the end tries to be the hero without (excuse my language) the balls to be one. Treats all women equally, equally shit  that is. Bottom of the barrel pathetic rating well deserved 1/10.\\n\\n\r\nQuele, a sister which starts a little bad but progresses well in the story. Nice character all in all.\\n\\n\r\nMina is weird, but unique I was intrigued by such design of character traits she has a weird motherly feel. I like her though.\\n\\n\r\nIria, pretty crap. Don't like her what so ever. Not as bad as Ryousuke though. 3/10 poor design.\\n\\n\r\nGenerally 8/10 very good, just because of Quele, Lisara and Mina.\\n\\n\r\nEnjoyment 7/10 Good. Although I would like to note that until the first half of the anime I enjoyed it a lot in the end it was very bad but the average of my experience is a 7/10.",
            "date": "2019-02-19T08:41:00+00:00",
            "helpful_count": 1,
            "mal_id": 301994,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7605891.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Nikos123Li",
                "username": "Nikos123Li"
            },
            "url": "https://myanimelist.net/reviews.php?id=301994"
        },
        {
            "content": "When i watch this show i have a conflicted feeling. I like the general concepts used in the show despite how plane and uninspired as they are.It uses concepts like protection fields and energy sources much like Shakugan no Shana but with little to no character depth and lots of nudity. The show lacks on drama and any really urgent dangers involved since over half the season is just them beating generic bad guys and stumbling around naked.\r\nThe art is not above or below standard its actually fair when it comes to the anime standards. The characters are drawn attractively and given provocative clothes withsome strange additions that make me wonder why. Namely the horn on Iria concerns me,it looks bizarre. In the very first episode there was a few really well done scenes that really added depth to the atmosphere but as the show progressed it got really generic. It spends all to much time at the school yard, a very overused setting with a very bland appearance. \\n\\n\r\nThe music is actually to my liking in this show, its catchy and it accompany s each scene really well for what its trying to convey. The characters voices are all well chosen and really convey there personalities but the main character ryosuke is just over the top annoying. His character in general is but the voice that goes with it despite being exactly what id expect from that sort of person just grates on my nerves.\\n\\n\r\nThe characters, all the females are well done. They have all the aspects you need for a harem styled fan service show like this. They fill out all the arch types and nothings overly original because of it sadly. The main character Ryosuke is what i consider the greatest failing of the series, hes just so excited and annoying to hear speak. Everything seems so positive or so negative with him and its just a very turbulent character that just destroys the rhythm and scheme of the show. The worst part is there trying to develop him into the standard hero but maintain the fact hes a pervert. They are trying to develop him into the standard unexpected hero and there gonna make sure to remind us how humble he is by reaffirming how perverted he is in the end of it all. The character just feels so predictable and they make him annoying to top it off.\\n\\n\r\nEnjoyment of this show is mild. Its a fan service show masquerading as a action adventure. The women get nude every episode by goop monsters and Ryosuke upon seeing them gets his libido going and he saves the day with a restoration of energy. Rinse wash repeat and you have this entire series. It is what it is and i can only say the show is fine, not great,not terrible but just ordinary. I think the only reason anyone would dislike this show in general is cause of how mediocre it inspires to be.",
            "date": "2012-08-29T16:26:00+00:00",
            "helpful_count": 3,
            "mal_id": 71143,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1386121.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shaja",
                "username": "Shaja"
            },
            "url": "https://myanimelist.net/reviews.php?id=71143"
        },
        {
            "content": "I've seen a lot of ecchi stuff...\r\nAnyway, always without spoilers:\r\nDakara is a really classic harem comedy with a demon girl that comes out of nowhere and bumps into a pervert.\r\nThen, you know it, loads of girls keep coming.\r\nIt's not the best ecchi of all time, but I loved Lisara (the demon girl), and yes, I still think that perverts as main characters is funny.\r\nAh yes, the main girl does not have gigantic boobs, it's kind of new.\r\nThe story starts kind of slowly, though I remember getting emotional at the end, and as I'm looking forward to a new season, I guess I liked (loved) thisanime.\\n\\n\r\nTo be quick:\\n\r\nBoobs anywhere, boobs everywhere, boobs anytime, you can let them be your guide !\\n\r\nSeriously, it's funny as hell, take a look.",
            "date": "2013-03-31T14:22:00+00:00",
            "helpful_count": 3,
            "mal_id": 91799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2266641.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chakaara",
                "username": "Chakaara"
            },
            "url": "https://myanimelist.net/reviews.php?id=91799"
        },
        {
            "content": "Well, I'd say that this anime is like Shakugan no Shana but... perverted and absurd.\r\nThe female protagonist looks like Shana, more adult but with small breasts like her, red looong hair, tsundere, she even dresses a green school uniform when she gets into his high school, has fire powers... and falls for the weak male protagonist, who is patient with her and likes her even when other girls are after him.\r\nThe art is great and stuff, the opening and ending are enjoyable, the other characters aren't at least annoying. This anime isn't really special but I liked it anyway.",
            "date": "2012-09-23T15:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 73087,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/507654.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ebonyhatesyou",
                "username": "ebonyhatesyou"
            },
            "url": "https://myanimelist.net/reviews.php?id=73087"
        },
        {
            "content": "I really liked this story, yes, it is quite similar to High School DxD, but still, you have to admit the plot is well made.\r\nI loved this anime to be honest, sadly it ended with many unanswered questions.\r\nWho was the masked man?\r\nWhy did the main characters father leave the family?\r\nI would love a short 2nd season or a new OVA that explains these parts, but sadly that will probably not happen, seeing that this anime was not that popular in Japan and the story, in theory did end.\r\nI don't like how the main character stayed a pervert the whole time unless one of his friendswas on the brink of death.",
            "date": "2013-07-30T05:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 107491,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2959741.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ThisIsNotMyName",
                "username": "ThisIsNotMyName"
            },
            "url": "https://myanimelist.net/reviews.php?id=107491"
        },
        {
            "content": "*heaves a sigh*\r\nWhere do I start with this review? I do not have any idea and I would dread reviewing this as much as forcing myself to watch this 12 episodes of cringe-worthy recycled anime.\r\nI have always been dubious of action and ecchi genres being lumped together because in my opinion, I would not be able to focus on the action if there's panties shots or exposed breasts every few seconds on the screen which is much reflected in most of the anime having these two genres together. I believe that there's a fine line between focusing on the action or focusing on the ecchiportion (no homo).\\n\\n\r\nDakara Boku wa , H ga Dekinai (copy pasted because I'm much more familiar with the english title) is your standard generic anime. Our main character which I can't even remember the name because most or otherwise all of the characters in this series being bland as a 2D cardboard, chanced upon a death god named Lisara whom -- ahh fuck this. Let's just make it simple - guy meets girl , girl starts to hate the guy but requires his help in order to accomplish her goal. That's it.\\n\\n\r\nThe story basically revolves around Lisara battling against monsters in the same old recycled fashion until probably episode 8? It literally went down like -\\n\r\n1) encounters monster , Lisara change to her demon suit or whatever it's called\\n\r\n2) she loses and for some reason loses her clothes every time (convenient fanservice almost equivalent that of queen's blade)\\n\r\n3) main character comes and provide eropower to Lisara\\n\r\n4) Lisara powers up\\n\r\n5) ???\\n\r\n6) Profit\\n\\n\r\nThere, I summarized the first 8 episodes for you in 6 lines. Oh and did I forget to mention? The main character provides energy to Lisara by the power of ero! How original. No, this is not doused with sarcasm because the only series that I can remember doing this is probably Highschool DxD ( oh how we love Issei and his oppais)\\n\\n\r\nThe story then finally breaks free from this recycled over and over loop which I would call it the 'Bleach loop' after episode 8. However, by then all my interest in this show have already been depleted by the horrendous past 8 episodes that I literally had to force myself to watch the remaining 4 episodes which starts to get a little more interesting than watching weed grow.\\n\\n\r\nThe art is most likely the taking point of this show as bright colors and flashly effects were used and the character designs are marvellous. The soundtrack was good but nothing too memorable, voice acting wise was generic as well. Talking about the character designs, brings me to my next point - the characters.\\n\\n\r\n.. (I can't even remember their names except for Lisara because she was probably the only one with actual personality). But the cast consist of our usual ecchi protagonist who is a pervert, a big-boobed character which happens to be his childhood friend and offers nothing but fanservice almost identical to Orihime. A loli whose tits are for some reason censored unlike the rest of the cast and Lisara ( did I miss anyone else? ).\\n\\n\r\nAs for Lisara's character, at first glance, she's almost as flat as the other characters. No I'm not referring to her tits which is probably the main highlight of the show - tits. But as the series progresses and her interactions with the generic main character reveals that she is much more than a walking flesh of fanservice because she has a reason to stick with the MC until she accomplishes her goal.\\n\\n\r\nOverall, I would highly recommend against watching this anime unless you prefer those animes with needless amounts of fanservice and fanservice sprinkled on top and one which may require to turn your brain off while watching. It's not worth grinding through the first eight episodes for a barely decent plot. While some may say that there's humour within the first eight episodes to keep the viewer entertained, I cannot stress enough the amount of recycled plotlines that even the funniest joke of all can become dull.",
            "date": "2014-09-20T06:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 161155,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3516391.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/pedomudkip",
                "username": "pedomudkip"
            },
            "url": "https://myanimelist.net/reviews.php?id=161155"
        },
        {
            "content": "Loved it! It was great if not for some of the cliche stuff that's in most harem/ecchi anime\r\nBut the synopsis on the show is totally wrong.\r\nThe only thing that's right is that she takes is \"special energy\"\r\nbut even then she does it when he gives it to her...except when he's being too perverted then she stoles it to make him pass out.",
            "date": "2014-06-26T22:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 148883,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/finerframe",
                "username": "finerframe"
            },
            "url": "https://myanimelist.net/reviews.php?id=148883"
        },
        {
            "content": "Alright listen up.\r\nI'm going to start this review by introducing myself. I am neonpinkdude and iwill bring you quick reviews based on my opinion. everyone knows my opinion is the best so like yeah.  Anyways lets get back to the point. Dakara Boku wa H ga Dekinai is an excellent well made enjoyable harem anime. The characters are my favorite part of this anime and it is one of the few harems that actually have a good ending. Usually harem animes end with a cliffhanger and no sequel which is really annoying in my opinion and that is why I liked this anime somuch. It had a really good ending and some enjoyable moments. The art style is good, The sound is outstanding. It is worth your 5 hours. trust me! In no way is it a masterpiece but it is a solid example of doing it right in its genre.\\n\r\nAlright this is an example of the quick reviews Ill be doing in the future. \\n\r\nPeace.",
            "date": "2015-05-24T08:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 188705,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4485093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/neonpinkdude",
                "username": "neonpinkdude"
            },
            "url": "https://myanimelist.net/reviews.php?id=188705"
        },
        {
            "content": "Dakara Boku wa, H ga Dekinai is an amazingly good anime and one of my favourite Anime I have ever watched. It started off great and reminded me of High School DxD which is by far my favourite anime ever. The first few episodes from about 6-8 where great but then it started to slip.... I enjoyed the humour but by this time it was almost always completely serious.\r\n I finally got to the end and cried my eyes out. How could they do that it was so devastating. I took everything down to a six except for the Art and the Sound but thenrealised that there was 1 OVA episode. So I watched that and was very happy with it  so I raised it up to a 8. Keep in mind that if i had not seen that OVA episode than I would have not been satisfied at all even if it was in the actual show than I would not have changed the score of it. OVA episodes make me feel great and I love them.\\n\\n\r\nThanks for making an outstandingly great Anime, I really enjoyed watching it and I am sure anyone else who watched it would too.",
            "date": "2014-06-01T20:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 145455,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3815535.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BornPK",
                "username": "BornPK"
            },
            "url": "https://myanimelist.net/reviews.php?id=145455"
        },
        {
            "content": "I do know my opinion is very impopular, specially seeing the other ratings, but I just can't stop loving this anime. It's just the best thing that I, me, could have watched. I am one of the few who can see the beauty every single aspect of this anime has, and the lifestyle it lets us sneak peek. Every time when I re-watch this anime, every few years, it reminds me of who I am, may you laugh of it if you want, and I've planned for years on watching this with my loved one, if I ever find one.\r\nEverything is just... So me. Orhow I should be. Or have been.\\n\r\nFocusing a bit more on the anime, there's a simply amazing-quality vivid animation, filled with everything you could ask for, be it romance, action, commedy, story or whatever. It's not the average person's masterpiece, but it is mine, and may be yours.\\n\r\nThis anime just breaks many (in my opinion dumb) anime paradigms, by *not* having an annoying, effeminate main character that avoids the women he's interested into, or never decides who he wants and ends up \"not biting any piece of the pie\"; Ryosuke is simple and honest with everyone, and always keeps his goals \"pure\". I can't just ignore this, it's a hell of an acomplishment for an anime that I had never seen before. It has none of the annoying nonsense of luring the viewer into thinking something extraordinary he wants is going to happen over and over, and never happening. In this anime, it just happens, even when you are not expecting, and always surprises the viewer positively. Think of it, how many other anime did this? This is whi I think this is a masterpiece, and one of its kind.\\n\r\nBe this your (kind of) anime or not, it's definitely respectable.\\n\r\n\\Side-note: I'd recommend watching in 1080p 60FPS (using SVP 4), if possible. If you enjoy this anime too, feel free to talk with me about it.",
            "date": "2018-11-21T12:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 294499,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7227390.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/TBlazeWarriorT",
                "username": "TBlazeWarriorT"
            },
            "url": "https://myanimelist.net/reviews.php?id=294499"
        },
        {
            "content": "Expecting it to be enjoyable until the revelation that one of the main characters, who’s only (but awesome) character trait are her large breasts, turns out to have magical implants and her real breasts are the smallest in the series. But what annoys me even more is that it’s ignored for the rest of the series and still looks like she has large breasts.\r\nThis is a pretty big plot hole and could’ve been fixed.\r\nMain plot is also hard to concentrate on, and hardly any good and juicy romance is actually ever seen.\r\n...................................................................................................................................................................................................\r\nExpecting it to be enjoyable until the revelation that one of the main characters,who’s only (but awesome) character trait are her large breasts, turns out to have magical implants and her real breasts are the smallest in the series. But what annoys me even more is that it’s ignored for the rest of the series and still looks like she has large breasts.\\n\\n\r\nThis is a pretty big plot hole and could’ve been fixed.\\n\\n\r\nMain plot is also hard to concentrate on, and hardly any good and juicy romance is actually ever seen.\\n\\n\r\n...................................................................................................................................................................................................",
            "date": "2018-10-23T11:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 292404,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/vortex444",
                "username": "vortex444"
            },
            "url": "https://myanimelist.net/reviews.php?id=292404"
        },
        {
            "content": "DxD with more tits in short.\r\nThis is an alright show at best. With it's best feature being the main Female lead( Lisara) She has a character model i really like and i am a fan of her personality. She is one of the only reasons i found most of the show enjoyable. \r\nThe first 5 or so episodes aren't bad. They are funny and have their own entertainment value to them. But from 6-11 the episodes are just so boring with nothing worth remembering. \r\nThere's some dumb crap with two worlds merging and tons of people dying. Show tries to be all emotional with itbut just comes across as boring. \\n\\n\r\nFor the first half the MC is alright but then he just becomes an idiot that get's other people injured cause of his mistakes. He also get's tons of people killed and i'm still not sure how it's his fault but what ever. \\n\\n\r\nI do like the relationship between the MC and the Female MC. I also enjoy the ending too this surprisingly. \\n\\n\r\nOverall an alright show that kind of turned into something else halfway through.",
            "date": "2017-12-08T05:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 264746,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6399529.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SovietWeeb",
                "username": "SovietWeeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=264746"
        },
        {
            "content": "As I sat through this anime I came to the conclusion that a series being enjoyable is not the same as it being good. For what this anime lacks in the departments of direction, storytelling, character development and sound design it certainly makes up in comedy and the likeability of the main female lead, Lisara.\r\nHowever, It is to my belief that this anime has too many problems for it ever to be possible to consider it a masterpiece.\r\nStory: Poor (3)\r\nI initially thought that the story was going to be good. Sadly, I encountered many problems that weren't apparent until after a couple of episodes: Certainevents and plot points are either contrived or poorly explained to the point that the audience (me) had no idea what was even going on. I can't really unveil any of the details, for that would require me to spoil a lot of the content.\\n\\n\\n\r\nArt: Decent (4)\\n\r\nSee, I liked the overall art. The character designs weren't really unique or original, but they seemed to properly make the characters stand out in their respective enviorments and you could instantly tell them apart from each other. However, most of the time there was this green hue covering everything, making the anime seem as if it was covered in vomit. I don't know why this was included (because it wasn't explained), but it pissed me off a great deal.\\n\\n\r\nSound: Pathetic (1).\\n\r\nThe ost was mediocre but not bad, and the opening was irritating and all over the place. The sound design was awful. I won't say much due to spoilers, other than that it was inconsistent.\\n\\n\r\nCharacters: Mediocre (5)\\n\r\nNot too bad I guess, except for the fact that most of the females would fall in love with the main character for no reason at all. \\n\\n\r\nEnjoyment: Fair (6)\\n\r\nTo conclude, there were a lot of problems here and there. There are good things to be mentioned about this anime, such as the comic relief and Lisara, whom I seriously thought to be the saving grace of this anime.\\n\\n\r\nOverall score: 5. Not awful, but nothing special in general. It is worth mentioning that the anime would've been better if it wasn't an ecchi harem.\\n",
            "date": "2017-11-18T08:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 263478,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5118258.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 1,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Riddarstolphe_II",
                "username": "Riddarstolphe_II"
            },
            "url": "https://myanimelist.net/reviews.php?id=263478"
        },
        {
            "content": "¨Dakara Boku wa, H ga Dekinai¨ is one of the ecchi anime I like. It doesn't have something special or different from others ecchi anime but is still a good anime if you want to have fun. I can just say that, Ryosuke is a bad ass.\r\nStory 7 : I give it a 7 because the story didn't actually surprise me. The main character is the most perverted guy in school, what can you expect from it?. The story starts kind of bad because in the first episode we see that Lisara is a Shinigami and put a half sword into Ryosuke. Thats it. After6 episodes the real story begins. But in the last two episodes was the climax. I almost cried. It was intense.\\n\\n\r\nArt 8 : Amazing. This is the kind of art that I like and I enjoy. \\n\\n\r\nSound 6 : To be honest, the sound doesn’t really fit with the anime. I think I only liked the opening song.\\n\r\nCharacters 8 : Funny characters, big boobs, sexy body, a tsundere, what more can you expect? \\n\\n\r\nEnjoyment 8 : The first episodes were the funniest. I can say like from 1 until 6. Ryosuke really made this anime funny together with the whole cast of characters.\\n\\n\r\nOverall 7 : The ending of the anime made me have a better opinion of it overall. The best moments were in the last episodes. It is an enjoyable anime with a lot of funny moments and I really liked it.\\n\\n\r\nThis concludes my review. Feedback is always appreciated. Have a nice day. \\n",
            "date": "2014-03-21T15:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 136365,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1963016.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xKrullzx",
                "username": "xKrullzx"
            },
            "url": "https://myanimelist.net/reviews.php?id=136365"
        },
        {
            "content": "This review is written after watching Episode 8. It may be subject to change as more episodes come out.\r\nWhile I enjoy the overall plot, I feel that it's incredibly predictable. Everything in the entirety is, like I said, incredibly predictable. Initially, the story was kind of \"Meh.\" but, in the recent episodes, it has started to get better. I feel like it actually has a story since about episode 4.\r\nBefore I talk about the art, I'd just like to point out; this is an Ecchi anime, *at one point, borderline hentai. Anyways, being an ecchi anime, expect a lot of breasts and tons of pantyshots. Now, I am a fan of fanservice (Go figure, right?) so, I will not judge the show on that.\\n\r\nBut enough about that, let's move on to the art.\\n\\n\r\nThe overall art is nothing spectacular, but not bad. I have never judged an anime based on art (With the exception of Lucky Star) but there are some very nice moments. In Grimworld, the art style changes significantly and actually looks pretty good. \\n\r\nBecause I don't judge animes on art, this section is short and sweet.\\n\\n\r\nSkipping over trivial things like Sound, the characters are copy, paste from loads of other harems.\\n\r\n Without saying names, I am going to list the \"Character Types\" and you can assume who goes with what. While you're at it, think of these same Character Types for other animes...\\n\r\nThe Tsundere, The Childhood Friend, The Shy One, The Eccentric One.\\n\\n\r\nAll in all, the show is pretty light-hearted, and does not take itself too seriously. If you're looking for a pretty good looking anime with lots of fanservice and Tits-Galore, this is an anime I'd recommend. If you like your anime serious, with no plot holes, flawless story telling and twists, this is not your anime.\\n\\n",
            "date": "2012-08-31T23:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 71309,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HollowBlades",
                "username": "HollowBlades"
            },
            "url": "https://myanimelist.net/reviews.php?id=71309"
        },
        {
            "content": "I know this is an ecchi anime, but they could focused more on the plot. I mean, the plot looks like a kid's show with the pervet scenes. All episodes are the same:\r\nWild monster, they start off losing, then the protagonist uses his \"Hentai Power\" and kill the monster. The story overall is too boring. The art is normal. The characters are too much mainstream:\r\nA tsundere girl\r\nA pervert guy as portagonist\r\nA childhood friend\r\nAnd so on.\r\nThe sound is fairly good, neither good or bad.",
            "date": "2013-01-05T06:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 82732,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/539169.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MorbidMind",
                "username": "MorbidMind"
            },
            "url": "https://myanimelist.net/reviews.php?id=82732"
        },
        {
            "content": "Hi!\r\nThis is a ok/pretty ok anime that you would be watching.\r\nThe story at first,so you meet a girl who's very pretty and outside your door and you invite her in.....(WHERE\"S YOUR COMMON SENSE!!!!????)Unfortunately I laughed at how stupid he was.\r\nSecond,The art was pretty good for an anime with ecchi and romance,but what ticked me off was at episode 6 and you'll see (No spoilers!)\r\nThe sound of the characters kinda blends in with the character so you should check out these actors!\r\nI enjoyed this the first time but it is DEFINITELY NOT WORTH WATCHING AGAIN excluding episode 11 and 12\r\nOverall,This was a stupid love awesome packedperverted anime that I mostly enjoyed!\\n\r\n                                                 Thanks for reading my review!",
            "date": "2016-06-08T16:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 220299,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5463554.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mashiro-Shiina-8",
                "username": "Mashiro-Shiina-8"
            },
            "url": "https://myanimelist.net/reviews.php?id=220299"
        },
        {
            "content": "Imagine Shana, except not as a loli and powered based on how aroused her partner is. That's pretty much the premise for this show. It's always interesting to see how far Japan is willing to push the boundary between ecchi and hentai, and this series does just that. So why is this series so poorly ranked? I shall borrow a few lines directly from the series:\r\nAntagonist: How is this happening?\r\nProtagonist: Didn't you know? A girl's scent is just as soft and gentle as boobs!!!\r\nAntagonist: NaniiiiiIIII??!?!\r\nIt's this type of senseless dialogue and strange plot that alienates all who can still keep a level head after seeingwhat is pretty much an endless stream of topless or otherwise unclothed girls. Though if that's all you're really looking for, feel free to dig in.\\n\\n\r\nAnimation:\\n\r\nDakara is standard fare animation quality wise. Colors are nice and vibrant but there are scenes where they could have used some more background detail, and also some scenes that would have done better with less CGI. So basically Shinigami are (seemingly) mostly cute girl-like creatures that dress similar to the familiars in C (with weird head gear). These Shinigami transform their uniform in preparation for battles- but they're probably better of in street clothes as the clothes pretty much evaporate when they're low on power. Due to this, expect almost constant nudity throughout the entire series. Styling-wise, everyone is easily distinguishable though the constant addition of new characters is a bother.\\n\\n\r\nThere's quite a bit of action with your standard magic elemental attacks though most of the time damage seems to be minimal (other than to the clothes of course). During battles, the Shinigami puts up what's equivalent to a fuzetsu from Shana and uses \"life\" energy to repair all damage done during the battle. As for ecchi, all the power for these attacks and abilities is sourced from humans, who apparently can increase their \"energy\" reserves based on what makes them interested. In the case of our protagonist, it's anything ecchi. Thus surprisingly, ecchi is actually baked in as a primary feature, rather than as just fan service, so expect it in large quantities here.\\n\\n\r\nSound:\\n\r\nThe series opens with an energetic jpop song and ends with a catchy, somewhat playful ED. These fit the mood fine though aren't really collection-worthy. BGM is average overall with\\n\r\none track that you'll soon recognized as it's overused.\\n\\n\r\nVA performance overall was, as well, fairly standard. I can't really blame the VAs though as, as seen from the lines above, some of the dialogue is a bit dry/strange.\\n\\n\r\nStory:\\n\r\nAn ordinary dude (with an obligatory childhood friend next door) finds a mysterious, red-headed beauty standing in the rain outside his house. When he lets her in she tells him he has less than three months to live. However, if he agrees to form a Kurokami-like contract with her, a shinigami, she promises to save him. Her goal is to find a certain person who has a huge amount of energy (apparently famous people have more energy) at his school. How will she locate them? She has a Dragon-ball power-scanner-like device that measures people's energy.\\n\\n\r\nThe story follows the pair as they seek out individuals as school and are attacked by other shinigami. The first half of the show is extremely predictable as it follows the same pattern of being attacked by an antagonist, who then somehow becomes an ally and an additional \"rival\" for the protagonist's harem. The story builds to a seeming climax around halfway through the show, and then the pacing goes awry. The show stops being an action-harem and transforms into an emo show not too different from the majority of Da Capo 2 SS. The story then, unconvincingly, tries to tie everything up with a last-minute climax that feels more like an afterthought. Finally, the show ends with the obligatory open-ended harem conclusion.\\n\\n\r\nThe presentation of this story felt jarring at times. A lot of major events happened just because of conveniences. For instance, if the main character had moved 5 or so degrees left or right at the first climax, the result would have been very different. Another example is the power scouters. Just like in DBZ, humans can vary their power level depending on how they feel, so it feels really odd that the Shinigami have never noticed this fact. Overall, it really feels as if the director felt he could get away with short cuts, assuming the viewer was only focusing on the nude girls bouncing around the screen.\\n\\n\r\nCharacter:\\n\r\nThe picture doesn't get much better here as well. Most of the characters feel very generic, yet certain character behaviors and interactions feel contrived and unnatural. For example, our protagonist is a really cheerful and openly perverted dude. As in Kurokami, he learns in the series that his contract enables him to use certain powers as well. Empowered by this new ability, he becomes a brash warrior who thinks he can protect his shinigami, despite never having any real battle training. Fast forward a single episode and he becomes a shriveled wimp unable to leave his bed. These transitions are not adequately developed, leaving to a very artificial aftertaste for many of the characters.\\n\\n\r\nDue to the above issue, you never really feel that the characters are plausible, and thus don't try hard to relate. This dooms any efforts at bringing out the development of the characters, which is pretty minimal in the first place. Add the fact that secondary characters are introduced and, just as quickly, disappear and you have a recipe for a pretty poor performance.\\n\\n\r\nValue:\\n\r\nDespite having an interesting twist to some established anime patterns, Dakara ends up failing in its execution; falling in the same bucket as other generic harems that go nowhere such as Champione and Hagure. The only characteristic that really sets this one apart is blatant nudity, and unless this is your thing, I'd recommend skipping this one.",
            "date": "2015-11-05T00:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 202710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202710"
        }
    ],
    [
        {
            "content": "If this doesn't prove that story has nothing to do with making a good ecchi anime, then I don't know what does.\r\nAt it's best, it is great art, cliched characters, great sound, and very funny. At it's worst, it is iffy animation, cliched characters, mammoth sized plot holes, and is coated in a yellowish tinted world. All in all, I enjoyed this anime immensely, probably as much as any ecchi based show.\r\nThe story.\r\nWell, as I said there are massive plot holes. And the story was kind of like a bunch of hero anime plots thrown in a blender to make a somewhat promising, but eventuallyfailing plot. It really just blew it's load too early, seemed to skip some parts that seemed important early on, and kind of fizzled out at the end. I hear this was based on the visual novels not the manga, so I may give those a read and see how the manga is. But, more importantly, as it is an ecchi comedy anime, I think we have to give the story less weight in general because there's just no sense in expecting a grand plot to go with all that fanservice. I give the story a 4.\\n\\n\r\nThe art.\\n\\n\r\nThe art was very good. I really liked that the main girl was not another girl with stupidly large boobs. They weren't tiny really, but a decent size. Only, I guess in ecchi show standards they are supposed to be considered very small. The other main characters are done well. The bad guy is a pretty lame effort, but I think that has more to do with him being a guy and also not actually having that much real screen time. Anyway, overall the art is good. The focus is on fanservice and battle scenes, and they do very well with both. In other scenes, especially after the first few episodes, it seems like some of the battle animations are reused a bit and the animation for regular scenes that are neither battles or heavy on fanservice are often poorly done. For these reasons I give the art a solid 7.\\n\\n\r\nSound.\\n\\n\r\nThe sound was great. From the OP, ED, effects, general songs used here and there, and the voice actors. Everything was really good. I can't find much fault in it so I give it a full 10.\\n\\n\r\nCharacters.\\n\\n\r\nMeh, I'm iffy on this category. The characters were mostly cliched harem types. The guy wasn't a total loser, even if he is incredibly perverted. He is the usual kind guy that shows his power when his girls are in trouble. He also makes a choice based on honesty and love in the end, which is kind of refreshing in the end, even if the last few episodes felt a bit out of place. The girls, well, if you've seen harem/ecchi animes before, you probably know the types by heart already. They are all here, and offer little to no variation to the norm. The thing that I like here is that the main girl is neither loli or super annoying. She is the kind of girl I usually pull for in animes, though more often than not, that isn't the type that is chosen in the end. I'll give the characters a 6 because I like the main girl so much.\\n\\n\r\nEnjoyment.\\n\\n\r\nThis is the standout factor for me. Ecchi comedies are supposed to be about enjoyment more than anything else, so instead of giving a heavy handed grade because the story didn't bring you to your knees, I feel like people should grade this type of show primarily on how much they enjoyed it. And I really enjoyed this one. It had me laughing right from the beginning. The comedy is great, and it keeps a fun edge on things even through the dramatic parts. Of course, I wouldn't have watched if I didn't like ecchi and this show doesn't disappoint on that front either. The fact that the main girl has good proportions that I prefer to the super skinny, super big boobed girls normally seen in these kinds of shows is icing on the cake. I have to admit that I was disappointed it took a few episodes for the show to just fizzle out, not to mention threw out most of the plot points completely in favor of a happy-go-lucky ending. Glad for the happy ending, but it just could have been better. Because I truly enjoyed the show despite it's flaws in the storyline, I still give a 10 for enjoyment.\\n\\n\r\nOverall, I really enjoyed the show, and as I said, I feel like this type of show needs to focus on enjoyment rather than being caught up in a thought provoking storyline. Of course, I'm still waiting for a show with this level of ecchiness and a great story, but I'm not holding my breath. I have to give an 8, because the issues with the story and the disappointing ending can't be translated into a better score. I'm really glad to see a heroine that I truly enjoy in all respects, love the comedy, sound, and of course the fanservice. And, as Eroske said, \"Ero is justice.\"",
            "date": "2013-03-01T02:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 88227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/albesir",
                "username": "albesir"
            },
            "url": "https://myanimelist.net/reviews.php?id=88227"
        },
        {
            "content": "Maybe this is one anime I watch and have a happy ending, although a bit smelly pornography but the plot and storyline are clearly likely suitable for watching",
            "date": "2013-03-22T19:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 90549,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2337139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/omtimo",
                "username": "omtimo"
            },
            "url": "https://myanimelist.net/reviews.php?id=90549"
        },
        {
            "content": "This anime started out with an interested plot but then everything went down hill. If your planning on watching this and you expect a good plot, please do not watch this. I'll give the story a (7) only because it started out pretty interesting and then by the 7th or 8th episode, things just stopped making sense (at least to me). The art and sound received a score of (9) because they were both good, no problems there. The characters(8), well.... I wouldn't call the main character a pervert, because he is a teenage boy and every one of them experiences puberty at that age,but the other characters are likable, none of them should upset you. Enjoyment (7), at first I enjoyed this anime and was looking forward to next week to see the next episode but as it went on the story started going into a direction that didn't interest me. I do recommend this to people who are looking for comedy, romance and who doesn't mind fan service. Overall (6) this anime is not bad but I dropped it because of where the story went after reaching of the very top of the roller coaster, but that's only because I mostly watch anime now with good plots.",
            "date": "2012-09-21T12:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 72845,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1479765.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/CoolBreeze",
                "username": "CoolBreeze"
            },
            "url": "https://myanimelist.net/reviews.php?id=72845"
        },
        {
            "content": "honestly it was predictable that's not to say predictable isn't enjoyable. the voice acting was great and it had allot of fan service. and as with fan service you need good art and it was good no obvious exaggerations. however the story seems to lack originality in an over all since of it the specific details are somewhat the same but it is understandable since the series had so much fan service and that if there was to much detail they would need to clarify questions. overall it very enjoyable light heart'ed fun.",
            "date": "2013-07-22T16:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 106401,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Rad_Raze",
                "username": "Rad_Raze"
            },
            "url": "https://myanimelist.net/reviews.php?id=106401"
        },
        {
            "content": "Well.. I'm back in the Ecchi genre of anime..\r\nNow I'm going to give you a question before I start the review.. \"Are you a conservative type of person?\" I not, good for you.. Why? Because this is an ecchi anime.. Not only ecchi and harem but an uncensored one.. I noticed that the animation on ecchi animes today became uncensored. You know, they show the things that will make it look like an H anime but of course it's not H anime.. This series is a good example.. \r\nI will give a short preview to give a short background of the series.. You see, there'sthis boy (Ryossuke) who dedicated himself to serve the world for the sake of eroticism.. Well, to make it short, he is very erotic.. Then, one day he encountered a strange woman in front of their house.. That woman is Lisara and guess what.. she's a grim reaper.. \\n\\n\r\nOk here are my thoughts as I finished watching this anime..\\n\\n\r\nStory (8)\\n\r\nIt is a so so for me.. Sometimes I feel interested in the flow of things, sometimes not.. But, I'm sure you are going to appreciate the story of this series as it reaches the ending parts.. Well, for me, as the story goes by it became different.. There is this \"betrayed expectation\" element that I feel I saw at the ending.. I recommend that when you are going bored, don't give up.. Honestly, I felt bored.. but still, I enjoyed..\\n\\n\r\nBut, let me give you the one main reason why I watched this series.. Of course, it's the damn fan service.. This will not be considered ecchi if they are no fan service.. Well, in terms fan service, you will learn how to appreciate flat ones.. (If you know what I mean..) Hahaha!\\n\\n\r\nArt (8)\\n\r\nIt is another so so for me.. Sometimes the art is beautiful.. The girls look beautiful especially the close up views and the sexy views.. But, I noticed parts  wherein the animation is off.. Well, it does not affect the majority of the series.. \\n\\n\r\nOne more thing.. There is this feeling within me that there must be more... More eroticism.. More urghhh.. I can't say it.. hehehe\\n\\n\r\nSound (6)\\n\r\nI don't hate the theme songs but they don't spark any interest in me.. I just skipped them...\\n\\n\r\nCharacter (8)\\n\r\nWell, its typical for an ecchi anime series that the male protagonist is either a maniac one or a very dense one.. In this case, we have a maniac one.. He is Ryossuke.. I enjoyed the element wherein he publicly claims that he is living an Ero life.. It's funny.. It's like a new lifestyle.. Though, you can't just do that in reality.. Ryo-san, You're freaking insane.. hehehe\\n\\n\r\nIn terms of the girls, I think its first time for me to see a lead female character in a ecchi series who isn't a busty one.. I'm referring of course to Lisara.. It's new.. At the beginning I don't see the hotness but on the later parts I start to see it.. The sexiness is there and like what I said.. you will appreciate the flat ones..\\n\\n\r\nOn the other girls.. I think I don't have anything to say.. \\n\\n\r\nEnjoyment (9)\\n\r\nOf course, I enjoyed watching this anime.. Like what I said before, the fan service is good.. In my case I watched the uncensored version, so I definitely have fun.. Now that I mention it, is there a uncensored version?\\n\\n\r\nRyossuke's line of thinking, the Erotic Life, is really the life of this series.. That's all..\\n\\n\r\nOverall\\n\r\nAs I watched the series I noticed that Lisara looked like the protagonist in Highschool DxD.. You know, same red hair and some parts of the overall appearance.. I thought to myself that maybe Lisara was made flat chested so that you can't compare the series to Highschool DxD.. But still, this series has an identity of its own.. It has its own brand.. We must not completely compare the two...\\n\\n\r\nUm... I absolutely suggest that you watch the uncensored version.. Ok?\\n\\n\r\nThanks..\\n\\n\r\nLightningSnow :)",
            "date": "2012-10-12T01:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 74741,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1571221.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/lightningsnow",
                "username": "lightningsnow"
            },
            "url": "https://myanimelist.net/reviews.php?id=74741"
        },
        {
            "content": "*SPOILER FREE REVIEW*\r\nAt first glance, Dakara Boku wa, H ga Dekinai seems like your average Harem/Ecchi anime, and it really is. Nothing really stood out, and it shares similar themes as compared to High School DxD and Shinmai Maou no Testament, both of which I think are better.\r\nStory 5/10\r\nThe plot wasn't horrible but I feel that they spent so much time beating around the bush. The pace of the anime wasn't executed well, with some parts too rushed. There was an interesting plot twist which I didn't expect from an otherwise stale story.\r\nArt 6/10\r\nThe art was fairly good, but some scenes appeared poorly animated.\r\nSoundtrack 4/10\r\nNothingmemorable.\\n\\n\r\nCharacters 4/10\\n\r\nThe characters seemed very cookie-cutter, lacking unique qualities.\\n\r\nTsundere CHECK\\n\r\nLoli CHECK\\n\r\nChildhood Friend CHECK\\n\r\nPerverted MC CHECK\\n\r\nRedhead CHECK\\n\\n\r\nEnjoyment 3/10\\n\r\nAs there wasn't much development, the anime failed to captivate my interest. Some of the ecchi scenes seemed out of place as well.\\n\\n\r\nOverall 4/10\\n\r\nI tried to enjoy this anime, I really did.However, this anime was simply unexceptional, which led to its downfall. There are other animes that I would recommend over Dakara Boku wa, H ga Dekinai.",
            "date": "2016-10-28T06:32:00+00:00",
            "helpful_count": 0,
            "mal_id": 232780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5798691.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/samjjms",
                "username": "samjjms"
            },
            "url": "https://myanimelist.net/reviews.php?id=232780"
        },
        {
            "content": "Just another harem ecchi show, where fanservice rules all. Neither plot nor characters can be called unique or interesting. However there are some merits here as well\r\n1. Opening and Anime OST, there are some decent tracks, worth of looking into them.\r\n2. Unexpected plot twist in the end of series. If its performed more smoothly this still can be decent anime after all. However, performance of this idea ruined even this possibility.\r\nTo summarize you can easily skip this standard harem echi show, but if you don't look into Anime OST and plot twist in the end of series.",
            "date": "2013-01-19T04:06:00+00:00",
            "helpful_count": 0,
            "mal_id": 84133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78679.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DragonFire",
                "username": "DragonFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=84133"
        }
    ]
]