[
    [
        {
            "content": "The story is basically battle royale but with animals. These people are infused with specific animal DNA resulting in them being able to turn into their animal forms. Okay not the best story wise but the fighting is what really drew me into this anime. Okay I would be lying if it was 100% the fighting, a large portion of it revolved around the amount of HEAVY fan-service in this anime. Which can always boot the enjoyment of an anime as well.\r\nThe art and animation was really well done. LIDENFILMS has yet to disappoint me when it comes to high quality art and animation.\r\nThe openingand ending were so good. The ending was a good head banger/ running song and the op was really entertaining. The music during the show fit it perfectly as well A lot of heavy metal is a great thing when it came down to it.\\n\\n\r\nThe characters were fantastic. Really i felt only one character did match their animals when it came to personality, each basically fit their characters perfectly.\\n\\n\r\nWhen it came to enjoyment I really loved it. The fights were better then most fights I have seen in DBZ, Naruto, Bleach etc. They were unpredictable and very well animated.\\n\\n\r\nOverall this was actually a decent anime to watch. I can see why the score would be swayed either high or low because of peoples tastes, but overall I think this show deserves a little more praise.",
            "date": "2018-03-30T14:12:00+00:00",
            "helpful_count": 79,
            "mal_id": 275778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275778"
        },
        {
            "content": "Hey guys,\r\nI read the manga, i knew what i had to expect.\r\nAnd man, i wasn't dissapointed. This could be the best worst anime of 2018.\r\nI seriously was waiting for this anime, even though i knew it won't be something humanity wants to remember in the future.\r\nThis show is utter trash and i love it.\r\nIf you want to have a good time just watching boobs and people killing each other, then you are in for a hell of a ride.\r\nThe Story is unimportant and just a framework for the explosive action and eroticism. \r\nThe music rocks. I have to say, the music is really good, theheavy metal tunes are awesome.\\n\\n\r\nThe fights rock. You can see them actually fighting instead of talking for half an hour.\\n\\n\r\nAnd the anime is actually funny, i didn't expect that but i had to laugh really hard a lot of times.\\n\\n\r\nI really enjoyed the anime.\\n\\n\r\nThe anime is good in its own way, and shouldn't be judged bad only because it doesn't suit your taste.\\n\\n\r\nDon't expect anything great. Grab a beer, lean back and have fun :)\\n",
            "date": "2018-03-30T18:08:00+00:00",
            "helpful_count": 60,
            "mal_id": 275808,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5102534.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Leark",
                "username": "Leark"
            },
            "url": "https://myanimelist.net/reviews.php?id=275808"
        },
        {
            "content": "A violent battle among people who morph into animals, with lots of action and fanservice. \"That's what Killing Bites is\"\r\nThe story begins when an average college student, Yuuya Nomoto, agrees to go pick up girls with his newly made acquaintances. Little did he know that by picking up they meant kidnapping and attempting a rape. Things don't go as planned, though, because Hitomi aka Ratel, the girl they try to mess with, turns out to be a real beast. That all leads to Nomoto getting mixed up in the world of therianthropes and their deadly fights. \r\nIt's easy to understand what Killing Bites is like.Don't expect deep and thought provoking story from this show. It is still good at what it wants to be, though. The plot does progress throughout the show, some of the events I have found surprising and the anime was overally engaging and pretty exciting to watch. \\n\\n\r\nThat is mostly because of fights which are well animated and interesting. The therianthropes' moves correspond to each animal's actual abilities (which are explained during the educational scenes accompanied by some heavy music, a lovely combo). Thanks to that, every character's fighting style is different and the outcomes aren't always predictable. The show is also full of violence and blood, but it fits its nature and is something I've never found unfitting in this case. Things can also get lewd during the battles but it's not the usual, glorified kind of lewd we most frequently see in ecchi shows. It's more brutal and won't be to everyone's liking.\\n\\n\r\nThe characters are another good point of Killing Bites and aren't as shallow as one could expect. Each of them has their own past, reasons and ambitions. Some of the relationships might also get pretty complicated as shown in the last episode. I also like how each therianthrope's respective animal corresponds to their personality.\\n\\n\r\nI'm also satified with both visuals and music. The artstyle is nice and the animation is of good quality. I liked the character designs and found them fitting the character's personalities. The heavy tones are great and fresh and go well with what we see. The opening song is no different from most of fripSide's songs (which is not necessarily a con if you like their style) and the ending song is fresh and catchy. I don't have any complaints about the voice acting either and I must admit I kind of fell in love with Youko's voice.\\n\\n\r\nIn spite of minor flaws, the only thing that actually bothers me is the open ending. I doubt there is going to be another season, so people that don't follow the manga are left guessing what happens next.\\n\\n\r\nAll in all Killing Bites is an entertaining and action packed anime that is far from being anything groundbreaking but can be very enjoyable if you accept it for what it is. It's well made and I find it worth giving a try. If you simply want some cool action accompanied by (pretty brutal) fanservice, go for it and embrace it as the good quality simple fun it is.",
            "date": "2018-03-31T17:21:00+00:00",
            "helpful_count": 27,
            "mal_id": 276029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/494628.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lyree",
                "username": "Lyree"
            },
            "url": "https://myanimelist.net/reviews.php?id=276029"
        },
        {
            "content": "Please note this review is intended to be read by those that have finished watching the Killing Bites and while care has been taken to minimise story related spoilers there may still be spoilers within character analysis. You have been warned!  \r\nOne nights encounter with a beast girl that changed the life of a mediocre student and introduces him to a hidden world of bloody beast fights.  \r\nBased on a popular manga of the same name Killing bites is an action based anime that also feature elements of sci-fi and ecchi Killing Bites gives us the opportunity to see what exactly would happenif beneath the hustle of bustle of modern day Japan there exists a hidden fighting arena where some of the societies largest and most well-known corporations and companies have formed vast power blocks that compete with each other via the use of bloody fights between human-beast hybrids called brutes in bloody matches called Killing Bites. Victory on the field will bring the corporations called Zaibatsu’s great fame and the countless rich people that bet on these matches great fortune and delight, but defeat will only result in your cold carcass being carted off as the next match takes over in a never-ending series of blood matches whose only job is to satisfy the rich. \\n\\n\r\nTaking place in the modern world the overall story for Killing Bites follows the life of Yuuya Nomoto a somewhat mediocre university student that whether through luck or design has had nothing but an uneventful life where it seems no matter what he does he cannot be successful in it. One night a casual acquaintance of his rings him up asking him to help in picking up girls to which he decides to readily help for friendship's sake. But never in his wildest dreams would Yuuya once imagine that doing would not only result in his friends being ripped to shreds but also introduce him to not just the curious beast girl Hitomi but also introduce him to the hidden world of the killing bite arena’s where not everything is as straightforward as society is. Joining Yuuya in his foray into the world of the ferocious world of killing bites is the direct but unexpectedly kind Hitomi, the cheerful and teasing Eruza and the elegant but arrogant Yoko. \\n\\n\r\nYuuya Nomoto \\n\\n\r\nYuuya Nomoto voiced by veteran voice actor Wataru Hatano of Fairy Tail and Nogizaka Haruka no himitsu fame is one of the main characters of the series and is the main protagonist of the series. A second-year university student initially Yuuya was someone that can be said to be the very definition of mediocrity having until the start of the series been living a life that had been dictated by society. A kind, caring and understanding person by nature Yuuya is someone that can be said to be someone that prefers to stay in the background and not draw attention to himself as he navigates the path called life a fact that he manages to accomplish for the most part thanks to his quiet and calm nature. In the beginning of the series Yuuya was noted to be someone that got scared of the unknown rather easily which is somewhat understandable if you were to see either beast human hybrids fight against each other or your so-called friends being torn into shreds. However, while certainly a mediocre person at first it can be seen that beneath this side of his Yuuya is someone that is responsible and logical and is someone that cares deeply about people whether they are his friends or merely allies something that may seem absurd by the other zaibatsu’s but not so for Yuuya. \\n\\n\r\nAs the series goes on and Yuuya gets to see more about what the killing bites involves and the true nature of the brutes Yuuya’s attitude gradually starts to change. At the beginning of the series Yuuya had a most unfortunate of first encounters with Hitomi and as a result, viewed her as something akin to an unwelcome intruder into his life though not something that he can easily say to her in person. However, as the series progresses and Yuuya and Hitomi interact more this sense of seeing her as a threat gradually disappears as Yuuya starts seeing Hitomi and the other hybrids as lifeforms and not monsters as the other zaibatsu’s have treated them. Because of this Yuuya also developed a determination and desire to save and protect Hitomi from not just the games played by the various zaibatsu’s outside of the killing bites but also inside them as well. As the series goes on this feeling of wanting to protect the hybrids gradually starts to expand as Yuuya gets to see how the other hybrids are treated and viewed by the other zaibatsu which is fuelled by his desire to see them be treated as lifeforms and not tools. While not having much trust in Hitomi in the beginning as the series progresses and as Yuuya and Hitomi overcome challenge after challenge this starts to change as Yuuya begins to place his trust in Hitomi trusting in both her skill and her confidence in navigating the best path to victory. This aspect of trusting Hitomi to make her own decisions on the field rather than issue her commands like other Zaibatsu’s would I felt was a great indication of the trust that was developed between the two. In line with this trust it can also be seen that Yuuya’s personality and attitude also changed with it as for the first time Yuuya was able to make his own decisions that are based on his own reasoning and judgement and for the first time in his life finally take control of his own life and not get caught in the pace of others like he did previously. A change that I thought was well done. The character of Yuuya I felt was an interesting character that while cowardly and unreliable at first gradually got stronger and more determined as the series went on as a result of the increasing trust that he had for Hitomi as well as his desire to be a better person as well. I felt that his voice actor Wataru Hatano did an excellent job at portraying the character of Yuuya.   \\n\\n\r\nHitomi \\n\\n\r\nHitomi voiced by veteran seiyuu singer Sora Amamiya of Aldnoah Zero and Plastic memories fame is one of the main characters of the series and is the main heroine of the series. A high school girl that Yuuya meets at the beginning of the series Hitomi is a confident, intelligent and fast thinking person that prefers action rather than thinking things through. While a calm girl by nature Hitomi is also someone that shows a certain level of arrogance in her actions that comes from the fact that she see’s herself as the strongest hybrid in the killing bites. A fact that she uses to openly taunt her opponents such is the confidence that she has in her own skills. As a result of her desire to want to leap straight into action Hitomi is someone that can be said to have a very direct personality as she see’s anything that’s unrelated to that as worthless and as a result she views things like bonds and friendships with something approaching disdain. While a brave and a tenacious fighter Hitomi is also noted to be someone that’s also merciful and honourable and will not fight opponents that are too heavily injured a trait that she also shares with fellow fighter Tiger. As with all hybrids Hitomi is also someone that also has a human side to her character and in this it can be seen that in this form her attitude is somewhat different being a polite, kind and sweet-natured girl that has a large appetite a personality more benefiting of a high school girl than her usual attitude does. \\n\\n\r\nAs the series goes on Hitomi’s personality gradually starts to change as she starts getting used to the team up that had been forced on her. At the beginning of the series, Hitomi was someone that exhibited typical loner attributes as she was quiet and preferred to keep to herself at all times even though it will be better to make friends and create a bond with your guardian something that should be important for all brutes. As a result of her unfamiliarity with normal human social culture, Hitomi was also noted to be someone that got embarrassed with the most minor of things, unlike her fellow brute Eruza. While initially distrustful of both Eruza and Yuuya as the series progresses and they overcome challenges together a gradual bond and trust is eventually formed between them. While Eruza’s naturally playful nature in the beginning often got on Hitomi’s nerves as the series progressed Hitomi’s attitude towards this gradually softened and she learned to treat these as just another aspect of her personality. This gradual thawing of Hitomi’s personality as she starts to realise the importance of bonds and friendships I felt was well done as it highlighted the increasing trust that she had towards not just Yuuya her guardian but also the other brutes that she encounters along the way and realising that perhaps there is more to life than combat after all. The character of Hitomi I felt was an interesting character that had some good development as the series went on. I felt that her seiyuu Sora Amamiya did an excellent job of portraying the character of Hitomi. \\n\\n\r\nEruza \\n\\n\r\nEruza voiced by veteran seiyuu singer Maaya Uchida of Charlotte and Gate fame is one of the main characters of the series and is one of Hitomi’s fellow brutes. A member of an opposing Zaibatsu Eruza initially appeared to be a typically hyperactive high school girl that Hitomi and Yuuya encounter in the course of their journey however as events progress this proves to be not the case. Like Hitomi, Eruza is a member of the brutes but in contrast to Hitomi Eruza’s personality is markedly different. A kind, positive and cheerful girl by nature Eruza is also someone that’s teasing and playful by nature and loves to poke fun at other’s traits that I feel suit her hybrid origin pretty well. Unlike Hitomi, Eruza is also someone that’s intelligent and fast thinking able to approach each situation with calmness and cautiousness and makes great use of tactics to fight her battles. While competitive to a degree Eruza is also someone that knows when the tide has turned and would try to retreat when this occurs rather than fight to the last. However, when pressed into a situation where she can’t readily do so Eruza’s tenacious nature would show up that makes her a ferocious opponent. \\n\\n\r\nAt the beginning of the series Eruza while calm and composed for the most part was also noted to be somewhat overconfident and was someone that had great pride in her abilities as a brute. While not openly pushing away people away from her Eruza was also noted to be someone that didn’t trust easily something that her life as a brute has forged in her. As a result of this while positive and cheerful Eruza was noted to not have many friends that she can rely on though interestingly enough she’s able to blend more into human culture than Hitomi does due to this aspect. As the series progresses and Eruza gradually learns what friends are this starts to gradually change and she starts forging bonds with others and forging friendships with them. The character of Eruza I felt was an interesting one as in addition to being a capable brute in her own right she also served as a great contrast to Hitomi in terms of both attitude and personality and showed that if you have something to fight for that you would fight even harder to protect it. \\n\\n\r\nYoko Mitsukado \\n\\n\r\nYoko Mitsukado voiced by veteran seiyuu Megumi Han of Twin Stars Exorcist fame is one of the main support characters of the series and is the series main villain. The granddaughter of the president of the Mitsukado Zaibatsu Yoko is on the surface a calm, elegant and composed young woman that is also intelligent, rational and logical. A very determined and haughty person Yoko is someone that is shown to be both very loyal to her grandfather as well as to the Zaibatsu and exhibits great pride in her belief that her zaibatsu is one of the strongest ones in Japan. Additionally, Yoko is shown to have a great deal of respect in the killing bites and the traditions that it represents. As a result of this Yoko dislikes people that are either not serious about the idea and purpose of the killing bites or are misusing it for their own ends which makes her both an enemy of both Yuuya and Shidoh the latter of which she see’s as her most hated enemy. As someone of such conviction it’s perhaps unsurprising to note that Yoko is also a very adept strategist and is able to prepare for many different situations while at the same time thinking several steps ahead of her opponents in order to achieve her aim. In this she’s shown to be not only ruthless but also someone that doesn’t let rules hinder her showing that as long as her goal is achieved in the end nothing else matters. \\n\\n\r\nIn the beginning of the series it was noted that Yoko while believing fervently in the main ideas of the killing bites was someone that viewed the hybrids as assets but not lifeforms and as a result of seeing Yuuya and Hitomi’s relationship grow as they grew to trust each other gradually saw him as both a rival that she had to crush and an enemy that stood against everything that she believed to be true from the killing bites. As a result of this Yoko become determined to crush Yuuya and crush what she see’s to be the foolish sentiments that Yuuya has. This, in turn, is reinforced by her view that Yuuya is someone that is not even qualified to be at the same table as she is.  The character of Yoko I felt was an interesting one as in addition to being a rival in the killing bites Yoko was also someone whose views on both the killing bites and on brutes, in particular, were polar opposites to Yuuya. This clash of both personalities and beliefs that were played out in the killing bites I felt was well done and appropriate as it allowed them to settle their differences on something that both are invested in. I felt that her seiyuu Megumi Han did an excellent job of portraying the character of Yoko. \\n\\n\r\nAMV \\n\r\nIn terms of animation, I thought that the series various locales and settings were well designed and though limited showed a good variety in the types of areas that the fights took place in. The designs for the various characters and especially the brutes I thought was well done and I really appreciated the great variety of animal types that was used as the template to create the brutes. The combat between the brutes which also serves as the series main premise I thought was not just well designed but also well animated and really showed how brutal and gritty such fights would be. In terms of music, I thought that the series OST did a great job at providing the scenes with music that matched the feelings that each scene invoked in us. The series opening and ending themes also did a great job of creating a sense of anticipation for the series as well. In terms of voice acting, I felt that the series voice cast did an excellent job at voicing their assigned characters with Sora Amamiya, Maaya Uchida and Megumi Han deserving special praise for their portrayal of the characters of Hitomi, Eruza and Yoko. \\n\\n\r\nOverall Killing Bites was an interesting anime that I really enjoyed seeing with its main strong points being its interesting premise, story, characters, combat scenarios and voice acting. \\n\r\nThe main premise of Killing bites is, of course, the titular fights between the brutes that are overseen by large and very ancient corporations called Zaibatsu’s. These fights between the brutes that are fielded by the Zaibatsu’s I thought was interesting as while also gritty and brutal it not only gave us the opportunity to see the types of animals that were used to create the hybrids that would fight for the zaibatsu’s when the time came but also look at the way that said zaibatsu’s treated their brutes. In the case of the former the types and identities of the animals that were used as the source of the traits for the hybrids I thought was surprising as not only did it use the more common ones like lions but also rarer ones like the honey badger and the pangolin the latter of which I had to look up as it was a term not seen before. This use of the traits of some of natures most powerful creatures on the brutes that will fight on the Zaibatsu’s behalf I thought was an interesting idea and helped bring into reality the childish dreams that many kids would have about such fights. In the case of the latter which was the Zaibatsu’s treatment of the brutes that serve them, I thought that the series did a great job of showing how the brutes are treated. While the sacrifices that each brute has paid for gaining their new-found power is immense it can be said that this also contrasts with the treatment that each Zaibatsu treats them. While some Zaibatsu’s treat their brutes as careful investments that are to be used carefully others only see them as tools that are to be discarded when they have lived past their usefulness. This mixed view on the brutes that are literally putting their lives on the line for them I thought did a good job at showing just how brutal and gritty the world of the killing bites can be as they must not only do well to enhance the prestige of their zaibatsu but also to ensure that they aren’t put down for being useless. \\n\\n\r\nWhile the brutes can be said to serve as the main contestants for the killing bites it can be said that they are not the only ones that have a stake in the competition whether it’s within the single dual killing bites or the larger destroyal as without someone that can vouch for them and support them a brute no matter how powerful cannot enter the killing bites. As a result, a certain level of bond is needed between a brute and their financier whether that person is a zaibatsu or a single individual as the mc was. This bond between the two I thought was an interesting one as it not only reflected on the trust that exists between the brute and their financier but also shows that in the competition they are in this together. This bond while not always applicable to all zaibatsu’s was I felt used very well when used with the mc and Hitomi and only served to enhance the relationship that the two forges over the course of the series. The feeling that the lives of someone that you have bonded and befriended with has been placed in your hands and can change based on the decisions that you make during the matches I thought only served to reinforce the level of trust that both have for each other in the unforgiving fields of the killing bites. \\n\\n\r\nOverall Killing Bites was an anime that while having an interesting premise in the form of the fights between brutes also had a deeper story in the form of the forging of bonds between a brute and their financier that served to improve both as they confronted the harsh and bloody world of the killing bites and was something that I really enjoyed watching. While let down somewhat by underdeveloped characters and some odd pacing issues I thought that the series still did well in showing the brutal fights between human-beast hybrids that are betted upon by rich people in their hundreds while also paring that with a decent story that was populated by some well designed and developed characters. One thing the series I thought the series did well if I might add was its use of unexpected twists in the story which was much more apparent in the latter part of the series.  As a final score, I would give Killing Bites a 7/10.  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-03-30T12:44:00+00:00",
            "helpful_count": 21,
            "mal_id": 275762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=275762"
        },
        {
            "content": "\"The beast with the sharpest fangs wins. That's what Killing Bites is.\" Your gonna hear that ALOT in this anime.\r\nKilling Bites REALLY isn't for everyone, it's for what LA would say is like one of those 90's violent schlock animes...that somehow sprung into the Winter of 2018. Well by violent schlock LA can say that Killing Bites has gory uncensored action, attempted rape, sadistic and unmoral characters and hell even the core concept of this anime is essentially a battle royale animorphism cockfighting and you know what...LA kinda loved it for all it's violent schlockiness.\r\nKilling Bites has some character developments towards the plot which focuseson the before and during the Destroyal (aka. team battle royale). The two major character developments goes to our useless main male protagonist who was thrusted into the Killing Bites Yuuya Nomoto voiced by Wataru Hatano, who is Hitomi Uzaki's pushover minder. For such a bland main male protagonist, he DOES develop in the case of his life always being told what to do and him coming out in making his own path by the end of the series. The more interesting character however is the one that ALWAYS says the quote above, Hitomi Uzaki, an animorphic ratel/honey badger. She's self-centered, abrasive as all hell and doesn't give a crap besides fighting. She herself is given some sense of a backstory and why she is who she is for majority of the anime and even though Killing Bites has no \"tact\", Hitomi's backstory gives at least a bit of levity to Hitomi's situation in the first place.\\n\\n\r\nAs for minor characters, for the most part, we do get to see the backstories of many of Hitomi's opponents as well as their animorphism before their gruesome demises by the end of it. Some of Hitomi's teammates has some small backstories like Ui Inaba (Rabbit) voiced by Sumire Uesaka, always the scared character has some weird ending as to why she's here to why Ichinosuke Okajima voiced by Toru Okawa is participating in the Destroyal and heck even some of Hitomi's buddy-rivalry with Eruza Nakanishi voiced by Maaya Uchida has plenty of screentime with her as well as Youko Mikado voiced by Megumi Han, a player in the Destroyal as well as her reasoning in competing in it.\\n\\n\r\nNow for a battle royale setup of an anime your expecting that Hitomi has ALL the plot armour and to that yes and no, yes as she does have plot armour disguised as Hitomi's animorphic trait kicking in to save herself but she gets beaten up pretty badly later down the anime and STILL survive a probable fatal wound. But the \"no\" definitely comes up in at the end result of the entire Destroyal but LA wouldn't spoil you on THAT outcome.\\n\\n\r\nKilling Bites has also some actual factual things concerning the animals in question, some LA didn't even know existed, but the most focused on is the Ratel (or Honey Badger). Now Killing Bites does tend to exaggerate the honey badger for the sake of the plot and Hitomi's physical and mental prowess as a fighter but Killing Bites does it and it's actually is oddly informative about the animal in question, like the rabbit, cobra, gecko, tiger, lion and crocodile and how the animal traits and factors are used in battle, especially with the over exaggerated narrator Junichi Sawabe makes it synergically interesting to watch animal essentially cockfighting while information about them is given to us and us connecting the dots to the fight much easier.\\n\\n\r\nAnd finally before getting into the technicals, Killing Bites always end the segment with Oshie Nodoguro voiced by Sayaka Harada who \"acts\" like a honeyguide animorphic however isn't one and she mainly interacts with Hitomi in some comedic skits with her and she's pretty funny all things considered.\\n\\n\r\nIn terms of animation done by LIDENFILMS.......this is LIDENFILMS bread and butter in terms of gritty atmosphere and gruesome battles, LIDENFILMS by all accounts know how to make these bleak atmospheric yet exhilarating battles and it's as bloody or gory as all hell. LA would give props to the character designs in both the human and animorphic aspect to them (as they have the entire human form is similar to their animal form). The battles are uncensored gory messes and yes the fanservice by all means is there and shown in rather detailed and sometimes intentionally fan-DIService manner, but yeah it's LIDENFILMS, they do this kind of stuff and this was what LA expected from LIDENFILMS. It just has all the hallmarks of their work and detail in violently detailed animation with gritty atmosphere (see Schwarzesmarken).\\n\\n\r\nAs for voice acting, well LA has seen a bit of Sora Amamiya playing up the abrasive type and she goes all out as Hitomi. From voice actors like Maaya Uchida and Sumire Uesaka did pretty well but Megumi Han as Youko Mikado was pretty interesting as well (though at first LA mistook her for Shizuka Ito) as Megumi Han goes apeshit hammy in this role (and no that's NOT a pun), kinda makes sense due to the nature of Killing Bites but still. The voice cast overall is hammy most of the time with some interesting casting here and there but the best voice actors for LA would be a tie between Megumi Han and Sora Amamiya just for some of the overtop craziness they displayed.\\n\\n\r\nKilling Bites does have some vague themes on corruption which does concern the Destroyal itself and the founders and it's companies that are betting on the winner without a care in the world for those who have DIED in the Destroyal with the best counterpoint link to this being Youko Mikado herself and her reasoning in participating however Killing Bites is obviously blatantly showing us of human's greed is everywhere and what lengths of corruption for them to keep their greed to the point of death and their scummy ways time and again by even having the Destroyal in the first place but *ahem* vague themes...\\n\\n\r\nKilling Bites is by far LA's guiltiest pleasure anime of Winter 2018 in all it's violent schlock, narm in it's more dramatic moments and being informative about animals all under the umbrella of a battle royal animorphic cock-fighting show, it's one batshit crazy concept and Killing Bites just takes and runs with it without a care in the world what anyone thinks because Killing Bites has no tact in keeping things innocent. Killing Bites just doesn't give a shit and LA doesn't think it really doesn't care WHO it offends and LA frickin' loved it for having that atmosphere about it. Mind you, LA was initially put off by Killing Bites at first but grew on LA as LA got to know Killing Bites a bit more and as it went into the Destroyal, LA's attention was all in for the violent madness that unfolded. Killing Bites actually had some method to the madness as insanely crazy as it gotten.\\n\\n\r\n\"Honey Badger don't give a shit\"",
            "date": "2018-03-30T14:16:00+00:00",
            "helpful_count": 14,
            "mal_id": 275780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=275780"
        },
        {
            "content": "May contain spoilers!\r\nStory:\r\nAwfully uninteresting, generic and boring. \r\n3/10\r\nArt:\r\nOne of the only good points, most scenes are well animated and fluid. \r\n7/10\r\nSound:\r\nAnother good point, the tracks matches the scenes, mostly on fighting scenes also the ending theme is awsome. \r\n8/10\r\nCharacters:\r\nGuy: Useless.\r\nHoney Badger girl: pisses me off with \"The one with sharper fangs wins that's Killing Bites\", beside that op af and till now killed everyone with 1 hit.\r\nThe rest are the same as the guy, useless and boring.\r\n2/10\r\nEnjoyment: if your'e looking for\r\nStory, no\r\nLooking for furry ecchi, maybe\r\nFights and gore, yes\r\n5/10\r\nOverall: \r\nBad characters, story, almost no ecchi, may improve in the future if you want a trashanime to watch give it a try.\\n\\n\r\n6/10\\n",
            "date": "2018-02-04T19:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 270683,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5793099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Zerinha",
                "username": "Zerinha"
            },
            "url": "https://myanimelist.net/reviews.php?id=270683"
        },
        {
            "content": "*Somewhere in the Discovery Chanel HQ*\r\nD:\"Quick guys, we're running out of ideas, does anyone have anything?\"\r\nA:\"Alien stuff? Dunno\"\r\nD:\"We're not the History Channel for pete's sake... Anyone else? Joe?\"\r\nJoe:\"You know how 'Animal face-off' was a pretty nice show, right\"\r\nD:\"Hmm yeah, that's actually not a bad idea, a new season would be -\"\r\nJoe:\"How about this time is animated and with scarcely clothed hot chicks!\"\r\nD:\"...\"\r\nJoe:\"And in order to appeal to the youth we should have highschool girls...\"\r\nD:\"... Joe...\"\r\nJoe:\"And... and -\"\r\nD:\"Joe this is it, you're fired\"\r\nJoe:\"What, why\"\r\nD:\"Leave now or I'll call security\"\r\nJoe:\"But wait -\"\r\nD:\"SECURITY\"\r\nLater on, Joe made his own anime studio and thus decided to get back at hisold boss...\\n\\n\\n\\n\\n\r\nKilling Bites is at the crossroad between abomination and a decent show. I was surprised the show is actually enjoyable even if it mostly consists of ecchi that can only appeal to 12-year-olds without internet.\\n\\n\r\nI assume they'll just attempt to add a \"story\" to the mindless violence this show is and manage to ruin it (something that'll be preeetty impressive considering it's already bordering train wreck).",
            "date": "2018-02-02T09:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 270427,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 1,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mike98",
                "username": "Mike98"
            },
            "url": "https://myanimelist.net/reviews.php?id=270427"
        },
        {
            "content": "First of all Thank you to the Killing Bites team to presenting this Anime.It was Amazing.\r\nAnd now about anime, when it started in first it was like whats going on, the starting was average but then it after some episodes it started to hit the mark, if i talk about story well it was good but what i special liked was the ending of the Killing Bites because the Main Thing, Main Story Starts from here...\r\nThe Art was well how to say it was kinda ero..(liked them) and the characters was interesting.\r\nWhat hit me hard was the end part and it made me so excitedfor the next season.\\n\\n\r\nWell this anime was just starting, its like dessert before meal the main thing starts now, i m really interested in Next Season... because  there are so many things that need to be discovered.....\\n\\n\r\nI cant wait for more.... Please make the 2nd season because \\n\r\n\" The One with the Sharper fangs WINS. That's what KILLING BITES is.\"\\n\r\nWaiting for you Killing Bites.......",
            "date": "2018-03-31T21:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 276135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5925689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Hentai_Prince_",
                "username": "_Hentai_Prince_"
            },
            "url": "https://myanimelist.net/reviews.php?id=276135"
        },
        {
            "content": "Killing Bites is your basic Battle Royale fighting anime with some ecchi thrown in... AND CHARACTERS WHO CAN TRANSFORM INTO ANIMALS!\r\nThis show is the best of the best. You watch the first episode and think, \"oh god this is awful\" AND YOU'RE NOT WRONG but oh does it get better! Ratel quickly tries gunning for the Best Girl spot and from there it is a hot pursuit between Tiger and Rabbit. The characters in this show are all amazing, even Cobra with his dual cannons was an alright character. Ratel is easily the most likeable and without her I don't think we'd ever figure outwhat Killing Bites is really all about. Her catchphrase is anything but forgettable and she never forgets to say it every episode (except *insert episode numbers here*). \\n\\n\r\nThis show is also EDUCATIONAL! You can, in fact, throw this show on for your kids and have them learn a ton of animal facts! For instance, did you know that Crocodiles are literally immune to AIDs?! Or that Cobra's have TWO penises?! Fascinating!! This show never ceases to amaze me. The show even goes all out during its educational segments where they show you the most gorgeous of art for the animals depicted. \\n\\n\r\nEnjoyment? What's not to enjoy? It's a show where a bunch of animal cosplayers duke it out in order to see who is the most OP animal. There is nothing UNenjoyable about this show.\\n\\n\r\nOverall, I'd say this show is something of a gem this season and I've never not been excited to watch it each week. \\n\\n\r\nTL;DR- This show is a little memey and the first episode is probably going to turn everyone away but you stick around long enough for the fighting to start and you learn that the show is a true treasure that is deserving of this high a rating.",
            "date": "2018-03-23T14:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 274691,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820377.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Haaselh0ff",
                "username": "Haaselh0ff"
            },
            "url": "https://myanimelist.net/reviews.php?id=274691"
        },
        {
            "content": "Just because it doesn't have a solid story doesn't make it trash.\r\nI see a lot of hate for this anime. I'm not really sure why but i'm really enjoying it and i'm not even fapping either lol. Hitomi is bad ass, i like the concept and it reminds me of those AniMorph books i used to read but more adult themed. \r\nHonestly this is my type of anime if only there was a real story. The art is good, the action and animation is good, the characters have good especially the females. (Of course) \r\nOverall 9/10 because the lack of actual story but this animeis really great. I've most definitely seen worse.",
            "date": "2018-01-26T16:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 269734,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6756495.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/QueenxKefura",
                "username": "QueenxKefura"
            },
            "url": "https://myanimelist.net/reviews.php?id=269734"
        },
        {
            "content": "this is one of those action ecchi animes that wont satisfy most peoples taste it is trash the good kind of trash if you turn you brain off and just take it as an mindless action ecchi anime you will enjoy it a lot the fights are great there is not much talking but more fighting its exiting the music is spot on and gets you hyped up they do give character development in between the fights witch keeps you invested thou some of the animals are wrongly portrayed and are more buffed for sake of looking cool more than animal consistency and i mustaddress the elephant in the room that one catchphrase witch everyone hated from Strike the Blood “No senpai, this is owner fight” yes they have something similar here that might make you mute the episode each time they are about to say it \".... doesn't matter. The one with the sharpest claws wins\" yea people will have nightmares about that line for weeks after watching this and its in every episode stayed at least one sometimes more than once ...\\n\\n\r\nstory: 8 there is some plot going on but were not here for it were here to see boobies and fights so on that part the story is spot on\\n\\n\r\nmusic: 8\\n\\n\r\nArt: 8 the art is nice to look at you can see blood and the fights are exiting the fan survive is survivable\\n\\n\r\nenjoyment personally i had a blast 10 even thou i should know better it had funny comedy as a bonus and most of all i didnt get bored at any point even in the most cringe parts\\n\\n\r\nover all score 8",
            "date": "2018-03-28T11:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 275463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257280.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/uNs7oPPaBL3",
                "username": "uNs7oPPaBL3"
            },
            "url": "https://myanimelist.net/reviews.php?id=275463"
        },
        {
            "content": "Whoever has the sharpest claws wins.. not in this case.\r\nStory 5: its another battle royale! Not really special, but I do like the whole animal side of it. Having their animal features and their abilities was pretty cool.\r\nArt 5: Noting special here, a couple of good ecchi scenes though.  \r\nSound 5: Voices were good, tracks were okay and the tracks reminded me of the 90s rock music (the middle cut scene)\r\nCharacter 4: I didn't like alot of them, you have the typical shy guy that has a hot girl as a partner. If I had to pick a favorite character it would be kidotakeshi, I love for what he stands for and his story about his mother was good too.  \\n\\n\r\nEnjoyment 4: I did like it (since I finished it lol), best part of the anime was when Hitomi and Eruza were in that confused state. \\n\r\nThe ending was good too, it was a good twist. \\n\\n\r\nOverall 4.8: It was good, not much more to say tbh. \\n\\n\r\nWould I recommend? \\n\r\nI mean why not its not pathetic, its okay. I would say don't waste your time watch something better, but you watch what you want :D\\n\\n\r\nThanks for reading! \\n\r\nIf you have any question or talk anime feel free to msg me :D",
            "date": "2018-04-02T19:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 276602,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879361.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BCxER80",
                "username": "BCxER80"
            },
            "url": "https://myanimelist.net/reviews.php?id=276602"
        },
        {
            "content": "On the surface everyone wants to simplify this into a fan service show, but of any fan service show show I've never seen the excess of emotion and brutality as I've seen throughout this show.\r\nIt's true that many things end of being fairly standard as far as fights and relationships go but by the last episode it's very clear that the betrayals and deaths that have piled up have formed a world that is unlike any in any fiction ever made. No joke.\r\nThe story is admittedly quite slow but after the first 4 episodes there's enough madness to keep you interested and as the showcreeps to its conclusion it's easy to doubt that there will be much of a spectacular ending to the show, after all most anime don't venture very far from conventional story telling. However, death is very much a big part of the show, don't let the personalities of the characters fool you.  If they seem too carefree it's due to their mafioso outlook towards the world.\\n\r\nThe combat covers every conceivable outcome, from thrilling second to second brawls to 10 second borefests.  But you might wonder why I score this show so high and that's due to its UNPREDICTABILITY.  The best fights aren't always between the predictable characters and some built up fight end up very standard mainly due to how animal fighting styles differ or are so similar between the combatants.\\n\r\nAdmittedly, it's pretty safe to assume that the smaller the animal is that the fighter's animal is based on, the more dangerous the fighter, but again UNPREDICTABLE.   Even if it feels standard at first, just enjoy the cheesiness and wonder about every possible way the show could go, because you will almost certainly be wrong.\\n\\n\r\nThe characters aren't deep but it's obvious that this show is starting from the ground and building the characters up.  The ost is just all around enjoyable with its guitar riffs and very much above average OP and ED.  Art wise I never so anything bad, sure it could be better but as far as an adaptation goes, it was no more and no less than 100% accurate.\\n\\n\r\nI pray for a second season to unfurl some time in the future, but honestly the ending of this makes me wonder whether a sequel could surpass the hype that this first season was able to create.",
            "date": "2018-04-01T18:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 276435,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4567828.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Animorphimagi",
                "username": "Animorphimagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=276435"
        },
        {
            "content": "The Killing Bites experience is similar to that of porn—not necessarily because you could easily jack off to either, but mostly for that aftermath with which we are all to familiar. You have a great time, but in finishing up after your session, you make the realization that you just so thoroughly enjoyed the last several minutes and it makes you disgusted–both with the content, and with yourself. Dejectedly tucking your shrinking chub into a more comfortable position, you expel a knowing sigh. You'll be back for more.\r\nKilling Bites is degenerate, cheesy, over-the-top trash. In other words: it's fantastic. I love it. It's funny, action-packed,and sexy. To summarize: it sucks. I hate it. No anime should be so bad, and yet so enjoyable. It doesn't fit any mold. It's got style. It's absurd. Killing Bites is worth watching simply because it is fun.\\n\\n\r\nStory: decent, never slow, and it doesn't get in the way of that supple \"plot\".\\n\r\nVisuals: varied and engaging fights with skimpy shots aplenty. Seriously though, the fights are quality.\\n\r\nCharacters: original and interesting to watch, some of which are totally not at all catering to any fetishes I have or have since acquired, I swear.\\n\r\nEnjoyment: far more enjoyable than is rationally acceptable. This is the strongest of this show's assets–aside from those present on the heroines.\\n\\n\r\n9/10. Would I trade my dignity for a couple hours of good entertainment again? Yes. Yes I would.",
            "date": "2018-04-01T01:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 276201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5389137.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gaphiltfish",
                "username": "gaphiltfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=276201"
        },
        {
            "content": "An anime that is fun and exciting!\r\nKilling Bites is basically a battle royal where the participants are therianthrope(human-animal hybrids), scientifically speaking, furries! \r\nSounds pretty dumb, right? \r\nWell it is and it is not at the same time, this show is basically a \"guilty pleasure\" anime, it doesn't need to have a great story (which is actually good), it doesn't need to have great characters (which is actually good), it just has to provide you with a good 24 minutes of entertainement and it delivers a good amount of fun, a bit of lewdness (which for this kind of anime is a must have) and gore.This is a show that you have to watch to balance with more serious or story heavy anime, this is a show that you sit on your couch get some popcorns put a smile on your face, just relax and enjoy. \\n\\n\r\nDon't get me wrong, it isn't a masterpiece, there are many flaws, but they are minor flaws, like for example the male therianthropes go full on transformation while the female still mantain human-like features, now i don't know if there was an explanation in why that happens in the anime (if there was i missed it), but that happens out of convenience, because the show is there to provide lewdness and gore and for me, at least, if Hitomi or Eruza went full furry I would not enjoy it as much as i did (although i bet there are some sick puppies who would).\\n\\n\r\nEducational? Maybe, I wouldn't quote it for a schoolwork but it provided some knowledge about some of the zoology of our planet. \\n\\n\r\nIn the end this anime did the job it had to do, provided laughs, gore and lewdness in the right portions at the right time. Of this season's shows this anime is one of the most underrated and i hope the ratings go up and I also hope that maybe a season 2 comes out since it was a bit teased that it can happen (although I doubt it will) and it looks like the story has just begun. If it doesn't happen the anime sold me for sure to check out the manga.\\n\\n\r\nStory- 7/10\\n\r\nArt- 8/10\\n\r\nSound- 7/10\\n\r\nCharacter- 7/10\\n\r\nEnjoyment-9/10\\n\\n\r\nOverall Rating- 8/10",
            "date": "2018-03-31T08:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 275871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6567699.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/viktheone",
                "username": "viktheone"
            },
            "url": "https://myanimelist.net/reviews.php?id=275871"
        },
        {
            "content": "I have to say, I started up with this anime because I saw it on Amazon. Watched a few episodes and thought that the little bit of information the show gave on the different animals was actually interesting and helped provide an understanding to the characters actions.\r\nAt the start the anime seemed like it was going to be 90% about the fan service, but the actual fights were interesting and decently well thought out, pulling in the characteristics of real animals and the way they would likely interact in the wild was pretty good. I liked both the main and sub-main characters as they fitinto their roles pretty well. Both Hitomi and Nomoto progressed and developed throughout the season.\\n\\n\r\nSo I decided to look for the manga and after a binge session of that I returned to the anime to watch it the rest of the way through just to give it the fair shake and see how everything was done in the anime.\\n\\n\r\nLet me just say, there is a reason why I gave this a 7/10 for overall and 7/10 for character and story. They go through this drawn out process of explaining the characters back story, which was good, I enjoy exposition because it actually allows us to relate to the characters on a more human level; but then after establishing that there was an extremely high bond of trust (not only though dialogue out lout but also internal dialogue), they make their main character completely betray that bond. This is not only breaking the few character rules they set up through the story but also the rules they established for the animalistic side of the character.\\n\\n\r\nAnd for those whom haven’t read the manga and know what is coming in Season 2, skip over the next two paragraphs, but this is very essential for those that have watched through to episode 12 and are as pissed off about the ending as I am… \\n\\n\r\nI read to that part of the manga and was disgusted with this choice in the story; it’s lazy, it’s poor character development and it defeats the ability to identify with either of the main characters from that point on. Hitomi’s character through the show is established to not care about killing that which is not a challenge to her. She thirsts to be the strongest among the beasts and then they turn around and have her basically assassinate the character she was established to have trusted, completely and totally out of the blue.\\n\\n\r\nThen they turn around and make Nomoto into a pseudo bad guy; planning his revenge against a person whom he had developed feelings of adoration towards. They would have been better off to not have her attack him at all and tell him to run away, to never show his face again, but him to return to help her break free of the corporations control and free from her bond with Reiichi Shido. Overall this plot line detracts from the series and I feel it was a very flawed design that will turn many people off of wanting to watch more if the anime is completed through a second season.\\n\\n\r\nIf you skipped the above you can read the rest without worry...\\n\\n\r\nAs for the rest of the scores, the actual animation was well done, a mix of mediums which works very well together along with organized and well placed ambient music tracks that only serve to add to the drama on screen. I liked the overall character designs and the concepts of the fights and how they worked out. I am a bit confused as to how Hitomi’s arm was reattached but I’m just going to write that off on science fiction DNA mumbo-jumbo and give it a pass.\\n\\n\r\nUp until the last episode of the first season, the story was well done; (if only they could ret-con the end of episode 12, we’d be great), but overall the show hit where it should for the audience it was written for. Would I tell my friends it’s worth watching? Yes; but with the caveat of informing them there was an extremely bad, and poorly written plot twist at the end. \\n\\n\r\nThis could have been a 9 or 10/10 show, but poor writing for the end of the season destroys what could have been great and turns it into any other poorly written anime/manga series that will likely die in its second season. \\n",
            "date": "2018-12-25T15:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 296868,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GeneFirewind",
                "username": "GeneFirewind"
            },
            "url": "https://myanimelist.net/reviews.php?id=296868"
        },
        {
            "content": "Out of 100 Nobles watching...\r\n83 were impressed!\r\n10 clawed out their own eyes in CG segments\r\n5 found the story lacking a certain bite to it\r\n2 find death game plots difficult to immerse themselves in\r\nHooooo~ boy is this a spicy meatball. There's quite a lot to unpack with Killing Bites and it's got me worried I've bitten off more than I can chew. Nonetheless I'll just go right ahead and sink my teeth into this one (okay no more puns).\r\nKilling Bites is a death game anime based on the manga of the same name. This particular flavor of the genre is that the four corporations that ruleover Japan's economy hold a recurring battle royale to redistribute power using genetically modified animal/human hybrids. Now my personal experience with these sorts of anime are currently limited to Fate:Zero, Fate:Stay/Night, and now Killing Bites and I'm beginning to find some fundamental problems that inhibit my enjoyment of the genre. That being said I had an absolute blast watching Killing Bites despite it's many flaws. \\n\\n\r\nOur main character Hitomi is a Hybrid based on a Ratel, or the Honey Badger as the internet would call it. Hitomi's personality sculpted to reflect that of an animal that just could not give a shit about anything or anyone is a fun take on the full of themselves protagonist commonly found in these sorts of shows. On that note most of the Hybrids in the show having personalities and fighting techniques centered around their specific animals traits are what brought a lot of charm to the table. Unlike the Fate franchise and it's habit of breaking immersion with world-shattering plot twists pulled out of thin air; if you have watched a healthy amount of the Discovery Channel you can get a grip on how a lot of the fights in the show will play out. \\n\\n\r\nAs far as death game plots go I found this one handled the usual questions of \"Why are the fighters okay with this? Why are these people so terrible? Wouldn't it be easier to do X instead?\" being reasonably explained by the shows world building and plot particularly close to the end of the show. The show handles it's setting fairly well as billionaire government controlling entities being totally cool with pitching their experiments against each other in battles to the death for more funding for more experiments being pretty believable. \\n\\n\r\nOur throwaway self insert soft bellied male protagonist, Nomoto, had me very worried his blandness would reflect poorly on the show looking back on it and it to tell the truth it did, however by the end of the season I really enjoyed what he contributed to the plot. \\n\\n\r\nSound design was... mostly bland with most of the tracks for the show feeling bare-bones enough to fit the mood with nothing standing out as really jamming or hype building. I loved the OP and the ED however so a lot of points were picked back up there. \\n\\n\r\nProbably the biggest glaring issue with Killing Bites was its art direction. The show really struggled with the bigboi enemies who have complicated movements or a lot of parts (like scales) presenting a dilemma. What do you do when you have to animate a bunch of moving parts and intricate lines for multiple episode long fights? Sadly that answer is almost always cheap CG. We're talking almost Kemono Friends or Berserk 2016 levels of bad here which makes me wonder what could have been. Generally character designs were interesting, hilarious, or just generally fun with enjoyable fight scenes but the two CG heavy offenders I feel will really put a nasty taste in how people will look back on the show.\\n\\n\r\nOverall, despite the absolutely insane amount of fan-service littered throughout the show if you asked me if Killing Bites is just another Fur-bait ridden garbage fire I would say no. Despite Hitomi's catchphrase making me audibly chuckle the other half of those times I felt pretty hyped up. Despite fight scenes being half horrendous CG the other half was rad animal fact fueled shenanigans. Despite only being interested enough in the plot to stay for the whole show and ready to shelve it as a one off experience Killing Bites reeled me back in so hard with it's last 5 minute reveals and plot twists that I HAVE to see how this shitstorm plays out in the manga. \\n\\n\r\nI laughed, I smiled, I enjoyed myself, and that's all I can ask for right?\\n\r\n\"It's not about who won AotS. The one with the sharpest fangs wins! That's what Killing Bites is!\" \\n\\n\r\nEdit Extra Note: I cannot wrap my head around why the scummiest characters in these stories always get to live. Characters like Shinji Matou and an character in Killing Bites. Other characters dies no problem, these stories don't shy away from killing off characters but for some reason the MC will take pity on these characters that had they gotten their way would have literally murder raped them. Generally the scumbag goes through some painful ordeal and that seems to be deemed by the author as enough penance for being a murder-rapist with no actual justice dealt. The character may be presented as reformed but it reeks of a toxic perception being given to individuals that should be at the minimum locked away for life. This is not a rant, but rather a legitimate criticism of some of the biggest roadblocks to enjoyment I have to overcome with many series like Killing Bites, Fate, Jojo etc...",
            "date": "2018-10-20T15:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 292178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7016163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Moomochi",
                "username": "Moomochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=292178"
        },
        {
            "content": "Now this anime Killing Bites is a battle between animals. You might find it interesting, but it just depend on you if you like it or not. Might be a little spoiler but I'll try not to. \r\nStory (7/10): The story was alright. Lots of fighting and lots of fan service (which is good). I think in episode 11 or 12 I found it interesting and also feel horrible at the same time. The ending on episode 12 really was unpredictable but was predictable as the same time too because I already knew something was up when... (STOP I can't spoil this sorry).  \r\nArt(10/10): Nothing to be concern about this. \\n\\n\r\nSound (10/10): It's great.\\n\\n\r\nCharacters (6.5/10): Okay now this might be a little rough and sad but tell me tell you why because what you about to watch is nothing like before. Let's start with the character name Yuya Nomoto. He's a university student who got caught up in the battle between animals or should I say he was actually forced to be in it by Reiichi Shido (who I don't like him). Nomoto is not what you think he is when you watch the anime because he is mostly useless in the rest of the story. Hitomi Uzaki is a Honey Badger hybrid. Hitomi is Shido's guardian but he left her with Nomoto so she can participate in the game. Basically, Nomoto is just a tool used to let Hitmi to get in since Shido can't do it himself. Hitomi ONLY follows Shido's orders which pretty sad since Hitomi can't even make her own decision. My favorite part (not character) is a character named Yoko Mitsukado. She doesn't like Shido (like me) but she is also careless during the battle which lead to an unexpected turn of event. In that event I saw something incredible which I might have foreseen whiling watching the anime. It was so surprising (for me). I really can't believe it happen but I wish they would show me more about what happen after that. Hopefully they should it in the next season. \\n\\n\r\nEnjoyment (7/10): Pretty good. I like it. \\n\\n\r\nOverall (7/10): Good it's not bad but I wish Nomoto would become something better in the next season if it really happen. Would I recommend this? Well, if you can't watch something ecchi I won't but if you can then yes. Do you like battles? This is you. Do you like humans with the power to transform into an animal then yes this is you. At the end of the story, Shido really pisses me off on how he changed the society and the humans. You know what I mean when you watching the end.",
            "date": "2018-07-10T11:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 283638,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/0Unknown0",
                "username": "0Unknown0"
            },
            "url": "https://myanimelist.net/reviews.php?id=283638"
        },
        {
            "content": "After finshing this anime, judging the final episode, it looks like an opening scene for a second season and if so, I wish it has. The Story or Plot don't have that much to give for the viewers. Most (Actually all) episodes only covers numerous battles against 2 or more Therianthropes (Humans with animal abilities) with a mix of slice of life.\r\nThe Art and Animation doesn't have any problems. The style and animation is pretty much the same as other anime I watch.\r\nThe Sound/Music is good on this one. It has a good intro music aswell end music. The Music used in this anime iscatchy for my opinion and I currently looking/waiting for the full version of it.\\n\\n\r\nThe Characters aren't that relatable. The Male Protagonist is the only thing I can relate to but not as a whole just a fraction of his. The Characters in this anime is pretty much unknown. What I mean is, don't have any backstory for themselves.\\n\\n\r\nEven so, I find this anime enjoyable to watch thanks to its bloody fight scenes and good music. I'm not including the fan service which are alot and pretty much self-explanatory.\\n\\n\r\nOverall, its a good show and all I can say is, don't expect to much for the story and characters. Well, I can let it pass due to the fact that the Manga hasn't been finished so it means it doesn't have a clear ending, yet.",
            "date": "2018-04-01T01:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 276207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919918.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZakkuRa",
                "username": "ZakkuRa"
            },
            "url": "https://myanimelist.net/reviews.php?id=276207"
        },
        {
            "content": "Summary: Stupid but entertaining. I may have watch this all the way through purely out of appreciation for the Honeybadger meme...that and the T&A.\r\nI'm fairly certain that anyone who has watched even one season of anime will recognise this for what it is. Ecchi battle anime. Surprisingly, there's even the semblance of a story too...just don't expect much.\r\nAll of the characters, and I do mean ALL, are very one dimensional, the artwork and animation is average, the music is rather forgettable but, in terms of Ecchi, it's actually pretty decent. They do manage to make several of the female characters believable and sexy while makingthem appear capable of the kind of fighting depicted in the anime (there's more than a few pairs of \"muscular Thighs\"). That rather surprised me. I was also surprised by how the final episode panned out...they clearly intend to make more of this.\\n\\n\r\nOne additional little treat is the end credits sequence, I got one or two solid laughs out of it.",
            "date": "2018-03-30T12:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 275765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6998966.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Down4daFall",
                "username": "Down4daFall"
            },
            "url": "https://myanimelist.net/reviews.php?id=275765"
        }
    ],
    [
        {
            "content": "The story is basically battle royale but with animals. These people are infused with specific animal DNA resulting in them being able to turn into their animal forms. Okay not the best story wise but the fighting is what really drew me into this anime. Okay I would be lying if it was 100% the fighting, a large portion of it revolved around the amount of HEAVY fan-service in this anime. Which can always boot the enjoyment of an anime as well.\r\nThe art and animation was really well done. LIDENFILMS has yet to disappoint me when it comes to high quality art and animation.\r\nThe openingand ending were so good. The ending was a good head banger/ running song and the op was really entertaining. The music during the show fit it perfectly as well A lot of heavy metal is a great thing when it came down to it.\\n\\n\r\nThe characters were fantastic. Really i felt only one character did match their animals when it came to personality, each basically fit their characters perfectly.\\n\\n\r\nWhen it came to enjoyment I really loved it. The fights were better then most fights I have seen in DBZ, Naruto, Bleach etc. They were unpredictable and very well animated.\\n\\n\r\nOverall this was actually a decent anime to watch. I can see why the score would be swayed either high or low because of peoples tastes, but overall I think this show deserves a little more praise.",
            "date": "2018-03-30T14:12:00+00:00",
            "helpful_count": 79,
            "mal_id": 275778,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1013735.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/SoraSenpai",
                "username": "SoraSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=275778"
        },
        {
            "content": "Hey guys,\r\nI read the manga, i knew what i had to expect.\r\nAnd man, i wasn't dissapointed. This could be the best worst anime of 2018.\r\nI seriously was waiting for this anime, even though i knew it won't be something humanity wants to remember in the future.\r\nThis show is utter trash and i love it.\r\nIf you want to have a good time just watching boobs and people killing each other, then you are in for a hell of a ride.\r\nThe Story is unimportant and just a framework for the explosive action and eroticism. \r\nThe music rocks. I have to say, the music is really good, theheavy metal tunes are awesome.\\n\\n\r\nThe fights rock. You can see them actually fighting instead of talking for half an hour.\\n\\n\r\nAnd the anime is actually funny, i didn't expect that but i had to laugh really hard a lot of times.\\n\\n\r\nI really enjoyed the anime.\\n\\n\r\nThe anime is good in its own way, and shouldn't be judged bad only because it doesn't suit your taste.\\n\\n\r\nDon't expect anything great. Grab a beer, lean back and have fun :)\\n",
            "date": "2018-03-30T18:08:00+00:00",
            "helpful_count": 60,
            "mal_id": 275808,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5102534.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Leark",
                "username": "Leark"
            },
            "url": "https://myanimelist.net/reviews.php?id=275808"
        },
        {
            "content": "A violent battle among people who morph into animals, with lots of action and fanservice. \"That's what Killing Bites is\"\r\nThe story begins when an average college student, Yuuya Nomoto, agrees to go pick up girls with his newly made acquaintances. Little did he know that by picking up they meant kidnapping and attempting a rape. Things don't go as planned, though, because Hitomi aka Ratel, the girl they try to mess with, turns out to be a real beast. That all leads to Nomoto getting mixed up in the world of therianthropes and their deadly fights. \r\nIt's easy to understand what Killing Bites is like.Don't expect deep and thought provoking story from this show. It is still good at what it wants to be, though. The plot does progress throughout the show, some of the events I have found surprising and the anime was overally engaging and pretty exciting to watch. \\n\\n\r\nThat is mostly because of fights which are well animated and interesting. The therianthropes' moves correspond to each animal's actual abilities (which are explained during the educational scenes accompanied by some heavy music, a lovely combo). Thanks to that, every character's fighting style is different and the outcomes aren't always predictable. The show is also full of violence and blood, but it fits its nature and is something I've never found unfitting in this case. Things can also get lewd during the battles but it's not the usual, glorified kind of lewd we most frequently see in ecchi shows. It's more brutal and won't be to everyone's liking.\\n\\n\r\nThe characters are another good point of Killing Bites and aren't as shallow as one could expect. Each of them has their own past, reasons and ambitions. Some of the relationships might also get pretty complicated as shown in the last episode. I also like how each therianthrope's respective animal corresponds to their personality.\\n\\n\r\nI'm also satified with both visuals and music. The artstyle is nice and the animation is of good quality. I liked the character designs and found them fitting the character's personalities. The heavy tones are great and fresh and go well with what we see. The opening song is no different from most of fripSide's songs (which is not necessarily a con if you like their style) and the ending song is fresh and catchy. I don't have any complaints about the voice acting either and I must admit I kind of fell in love with Youko's voice.\\n\\n\r\nIn spite of minor flaws, the only thing that actually bothers me is the open ending. I doubt there is going to be another season, so people that don't follow the manga are left guessing what happens next.\\n\\n\r\nAll in all Killing Bites is an entertaining and action packed anime that is far from being anything groundbreaking but can be very enjoyable if you accept it for what it is. It's well made and I find it worth giving a try. If you simply want some cool action accompanied by (pretty brutal) fanservice, go for it and embrace it as the good quality simple fun it is.",
            "date": "2018-03-31T17:21:00+00:00",
            "helpful_count": 27,
            "mal_id": 276029,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/494628.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Lyree",
                "username": "Lyree"
            },
            "url": "https://myanimelist.net/reviews.php?id=276029"
        },
        {
            "content": "Please note this review is intended to be read by those that have finished watching the Killing Bites and while care has been taken to minimise story related spoilers there may still be spoilers within character analysis. You have been warned!  \r\nOne nights encounter with a beast girl that changed the life of a mediocre student and introduces him to a hidden world of bloody beast fights.  \r\nBased on a popular manga of the same name Killing bites is an action based anime that also feature elements of sci-fi and ecchi Killing Bites gives us the opportunity to see what exactly would happenif beneath the hustle of bustle of modern day Japan there exists a hidden fighting arena where some of the societies largest and most well-known corporations and companies have formed vast power blocks that compete with each other via the use of bloody fights between human-beast hybrids called brutes in bloody matches called Killing Bites. Victory on the field will bring the corporations called Zaibatsu’s great fame and the countless rich people that bet on these matches great fortune and delight, but defeat will only result in your cold carcass being carted off as the next match takes over in a never-ending series of blood matches whose only job is to satisfy the rich. \\n\\n\r\nTaking place in the modern world the overall story for Killing Bites follows the life of Yuuya Nomoto a somewhat mediocre university student that whether through luck or design has had nothing but an uneventful life where it seems no matter what he does he cannot be successful in it. One night a casual acquaintance of his rings him up asking him to help in picking up girls to which he decides to readily help for friendship's sake. But never in his wildest dreams would Yuuya once imagine that doing would not only result in his friends being ripped to shreds but also introduce him to not just the curious beast girl Hitomi but also introduce him to the hidden world of the killing bite arena’s where not everything is as straightforward as society is. Joining Yuuya in his foray into the world of the ferocious world of killing bites is the direct but unexpectedly kind Hitomi, the cheerful and teasing Eruza and the elegant but arrogant Yoko. \\n\\n\r\nYuuya Nomoto \\n\\n\r\nYuuya Nomoto voiced by veteran voice actor Wataru Hatano of Fairy Tail and Nogizaka Haruka no himitsu fame is one of the main characters of the series and is the main protagonist of the series. A second-year university student initially Yuuya was someone that can be said to be the very definition of mediocrity having until the start of the series been living a life that had been dictated by society. A kind, caring and understanding person by nature Yuuya is someone that can be said to be someone that prefers to stay in the background and not draw attention to himself as he navigates the path called life a fact that he manages to accomplish for the most part thanks to his quiet and calm nature. In the beginning of the series Yuuya was noted to be someone that got scared of the unknown rather easily which is somewhat understandable if you were to see either beast human hybrids fight against each other or your so-called friends being torn into shreds. However, while certainly a mediocre person at first it can be seen that beneath this side of his Yuuya is someone that is responsible and logical and is someone that cares deeply about people whether they are his friends or merely allies something that may seem absurd by the other zaibatsu’s but not so for Yuuya. \\n\\n\r\nAs the series goes on and Yuuya gets to see more about what the killing bites involves and the true nature of the brutes Yuuya’s attitude gradually starts to change. At the beginning of the series Yuuya had a most unfortunate of first encounters with Hitomi and as a result, viewed her as something akin to an unwelcome intruder into his life though not something that he can easily say to her in person. However, as the series progresses and Yuuya and Hitomi interact more this sense of seeing her as a threat gradually disappears as Yuuya starts seeing Hitomi and the other hybrids as lifeforms and not monsters as the other zaibatsu’s have treated them. Because of this Yuuya also developed a determination and desire to save and protect Hitomi from not just the games played by the various zaibatsu’s outside of the killing bites but also inside them as well. As the series goes on this feeling of wanting to protect the hybrids gradually starts to expand as Yuuya gets to see how the other hybrids are treated and viewed by the other zaibatsu which is fuelled by his desire to see them be treated as lifeforms and not tools. While not having much trust in Hitomi in the beginning as the series progresses and as Yuuya and Hitomi overcome challenge after challenge this starts to change as Yuuya begins to place his trust in Hitomi trusting in both her skill and her confidence in navigating the best path to victory. This aspect of trusting Hitomi to make her own decisions on the field rather than issue her commands like other Zaibatsu’s would I felt was a great indication of the trust that was developed between the two. In line with this trust it can also be seen that Yuuya’s personality and attitude also changed with it as for the first time Yuuya was able to make his own decisions that are based on his own reasoning and judgement and for the first time in his life finally take control of his own life and not get caught in the pace of others like he did previously. A change that I thought was well done. The character of Yuuya I felt was an interesting character that while cowardly and unreliable at first gradually got stronger and more determined as the series went on as a result of the increasing trust that he had for Hitomi as well as his desire to be a better person as well. I felt that his voice actor Wataru Hatano did an excellent job at portraying the character of Yuuya.   \\n\\n\r\nHitomi \\n\\n\r\nHitomi voiced by veteran seiyuu singer Sora Amamiya of Aldnoah Zero and Plastic memories fame is one of the main characters of the series and is the main heroine of the series. A high school girl that Yuuya meets at the beginning of the series Hitomi is a confident, intelligent and fast thinking person that prefers action rather than thinking things through. While a calm girl by nature Hitomi is also someone that shows a certain level of arrogance in her actions that comes from the fact that she see’s herself as the strongest hybrid in the killing bites. A fact that she uses to openly taunt her opponents such is the confidence that she has in her own skills. As a result of her desire to want to leap straight into action Hitomi is someone that can be said to have a very direct personality as she see’s anything that’s unrelated to that as worthless and as a result she views things like bonds and friendships with something approaching disdain. While a brave and a tenacious fighter Hitomi is also noted to be someone that’s also merciful and honourable and will not fight opponents that are too heavily injured a trait that she also shares with fellow fighter Tiger. As with all hybrids Hitomi is also someone that also has a human side to her character and in this it can be seen that in this form her attitude is somewhat different being a polite, kind and sweet-natured girl that has a large appetite a personality more benefiting of a high school girl than her usual attitude does. \\n\\n\r\nAs the series goes on Hitomi’s personality gradually starts to change as she starts getting used to the team up that had been forced on her. At the beginning of the series, Hitomi was someone that exhibited typical loner attributes as she was quiet and preferred to keep to herself at all times even though it will be better to make friends and create a bond with your guardian something that should be important for all brutes. As a result of her unfamiliarity with normal human social culture, Hitomi was also noted to be someone that got embarrassed with the most minor of things, unlike her fellow brute Eruza. While initially distrustful of both Eruza and Yuuya as the series progresses and they overcome challenges together a gradual bond and trust is eventually formed between them. While Eruza’s naturally playful nature in the beginning often got on Hitomi’s nerves as the series progressed Hitomi’s attitude towards this gradually softened and she learned to treat these as just another aspect of her personality. This gradual thawing of Hitomi’s personality as she starts to realise the importance of bonds and friendships I felt was well done as it highlighted the increasing trust that she had towards not just Yuuya her guardian but also the other brutes that she encounters along the way and realising that perhaps there is more to life than combat after all. The character of Hitomi I felt was an interesting character that had some good development as the series went on. I felt that her seiyuu Sora Amamiya did an excellent job of portraying the character of Hitomi. \\n\\n\r\nEruza \\n\\n\r\nEruza voiced by veteran seiyuu singer Maaya Uchida of Charlotte and Gate fame is one of the main characters of the series and is one of Hitomi’s fellow brutes. A member of an opposing Zaibatsu Eruza initially appeared to be a typically hyperactive high school girl that Hitomi and Yuuya encounter in the course of their journey however as events progress this proves to be not the case. Like Hitomi, Eruza is a member of the brutes but in contrast to Hitomi Eruza’s personality is markedly different. A kind, positive and cheerful girl by nature Eruza is also someone that’s teasing and playful by nature and loves to poke fun at other’s traits that I feel suit her hybrid origin pretty well. Unlike Hitomi, Eruza is also someone that’s intelligent and fast thinking able to approach each situation with calmness and cautiousness and makes great use of tactics to fight her battles. While competitive to a degree Eruza is also someone that knows when the tide has turned and would try to retreat when this occurs rather than fight to the last. However, when pressed into a situation where she can’t readily do so Eruza’s tenacious nature would show up that makes her a ferocious opponent. \\n\\n\r\nAt the beginning of the series Eruza while calm and composed for the most part was also noted to be somewhat overconfident and was someone that had great pride in her abilities as a brute. While not openly pushing away people away from her Eruza was also noted to be someone that didn’t trust easily something that her life as a brute has forged in her. As a result of this while positive and cheerful Eruza was noted to not have many friends that she can rely on though interestingly enough she’s able to blend more into human culture than Hitomi does due to this aspect. As the series progresses and Eruza gradually learns what friends are this starts to gradually change and she starts forging bonds with others and forging friendships with them. The character of Eruza I felt was an interesting one as in addition to being a capable brute in her own right she also served as a great contrast to Hitomi in terms of both attitude and personality and showed that if you have something to fight for that you would fight even harder to protect it. \\n\\n\r\nYoko Mitsukado \\n\\n\r\nYoko Mitsukado voiced by veteran seiyuu Megumi Han of Twin Stars Exorcist fame is one of the main support characters of the series and is the series main villain. The granddaughter of the president of the Mitsukado Zaibatsu Yoko is on the surface a calm, elegant and composed young woman that is also intelligent, rational and logical. A very determined and haughty person Yoko is someone that is shown to be both very loyal to her grandfather as well as to the Zaibatsu and exhibits great pride in her belief that her zaibatsu is one of the strongest ones in Japan. Additionally, Yoko is shown to have a great deal of respect in the killing bites and the traditions that it represents. As a result of this Yoko dislikes people that are either not serious about the idea and purpose of the killing bites or are misusing it for their own ends which makes her both an enemy of both Yuuya and Shidoh the latter of which she see’s as her most hated enemy. As someone of such conviction it’s perhaps unsurprising to note that Yoko is also a very adept strategist and is able to prepare for many different situations while at the same time thinking several steps ahead of her opponents in order to achieve her aim. In this she’s shown to be not only ruthless but also someone that doesn’t let rules hinder her showing that as long as her goal is achieved in the end nothing else matters. \\n\\n\r\nIn the beginning of the series it was noted that Yoko while believing fervently in the main ideas of the killing bites was someone that viewed the hybrids as assets but not lifeforms and as a result of seeing Yuuya and Hitomi’s relationship grow as they grew to trust each other gradually saw him as both a rival that she had to crush and an enemy that stood against everything that she believed to be true from the killing bites. As a result of this Yoko become determined to crush Yuuya and crush what she see’s to be the foolish sentiments that Yuuya has. This, in turn, is reinforced by her view that Yuuya is someone that is not even qualified to be at the same table as she is.  The character of Yoko I felt was an interesting one as in addition to being a rival in the killing bites Yoko was also someone whose views on both the killing bites and on brutes, in particular, were polar opposites to Yuuya. This clash of both personalities and beliefs that were played out in the killing bites I felt was well done and appropriate as it allowed them to settle their differences on something that both are invested in. I felt that her seiyuu Megumi Han did an excellent job of portraying the character of Yoko. \\n\\n\r\nAMV \\n\r\nIn terms of animation, I thought that the series various locales and settings were well designed and though limited showed a good variety in the types of areas that the fights took place in. The designs for the various characters and especially the brutes I thought was well done and I really appreciated the great variety of animal types that was used as the template to create the brutes. The combat between the brutes which also serves as the series main premise I thought was not just well designed but also well animated and really showed how brutal and gritty such fights would be. In terms of music, I thought that the series OST did a great job at providing the scenes with music that matched the feelings that each scene invoked in us. The series opening and ending themes also did a great job of creating a sense of anticipation for the series as well. In terms of voice acting, I felt that the series voice cast did an excellent job at voicing their assigned characters with Sora Amamiya, Maaya Uchida and Megumi Han deserving special praise for their portrayal of the characters of Hitomi, Eruza and Yoko. \\n\\n\r\nOverall Killing Bites was an interesting anime that I really enjoyed seeing with its main strong points being its interesting premise, story, characters, combat scenarios and voice acting. \\n\r\nThe main premise of Killing bites is, of course, the titular fights between the brutes that are overseen by large and very ancient corporations called Zaibatsu’s. These fights between the brutes that are fielded by the Zaibatsu’s I thought was interesting as while also gritty and brutal it not only gave us the opportunity to see the types of animals that were used to create the hybrids that would fight for the zaibatsu’s when the time came but also look at the way that said zaibatsu’s treated their brutes. In the case of the former the types and identities of the animals that were used as the source of the traits for the hybrids I thought was surprising as not only did it use the more common ones like lions but also rarer ones like the honey badger and the pangolin the latter of which I had to look up as it was a term not seen before. This use of the traits of some of natures most powerful creatures on the brutes that will fight on the Zaibatsu’s behalf I thought was an interesting idea and helped bring into reality the childish dreams that many kids would have about such fights. In the case of the latter which was the Zaibatsu’s treatment of the brutes that serve them, I thought that the series did a great job of showing how the brutes are treated. While the sacrifices that each brute has paid for gaining their new-found power is immense it can be said that this also contrasts with the treatment that each Zaibatsu treats them. While some Zaibatsu’s treat their brutes as careful investments that are to be used carefully others only see them as tools that are to be discarded when they have lived past their usefulness. This mixed view on the brutes that are literally putting their lives on the line for them I thought did a good job at showing just how brutal and gritty the world of the killing bites can be as they must not only do well to enhance the prestige of their zaibatsu but also to ensure that they aren’t put down for being useless. \\n\\n\r\nWhile the brutes can be said to serve as the main contestants for the killing bites it can be said that they are not the only ones that have a stake in the competition whether it’s within the single dual killing bites or the larger destroyal as without someone that can vouch for them and support them a brute no matter how powerful cannot enter the killing bites. As a result, a certain level of bond is needed between a brute and their financier whether that person is a zaibatsu or a single individual as the mc was. This bond between the two I thought was an interesting one as it not only reflected on the trust that exists between the brute and their financier but also shows that in the competition they are in this together. This bond while not always applicable to all zaibatsu’s was I felt used very well when used with the mc and Hitomi and only served to enhance the relationship that the two forges over the course of the series. The feeling that the lives of someone that you have bonded and befriended with has been placed in your hands and can change based on the decisions that you make during the matches I thought only served to reinforce the level of trust that both have for each other in the unforgiving fields of the killing bites. \\n\\n\r\nOverall Killing Bites was an anime that while having an interesting premise in the form of the fights between brutes also had a deeper story in the form of the forging of bonds between a brute and their financier that served to improve both as they confronted the harsh and bloody world of the killing bites and was something that I really enjoyed watching. While let down somewhat by underdeveloped characters and some odd pacing issues I thought that the series still did well in showing the brutal fights between human-beast hybrids that are betted upon by rich people in their hundreds while also paring that with a decent story that was populated by some well designed and developed characters. One thing the series I thought the series did well if I might add was its use of unexpected twists in the story which was much more apparent in the latter part of the series.  As a final score, I would give Killing Bites a 7/10.  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2018-03-30T12:44:00+00:00",
            "helpful_count": 21,
            "mal_id": 275762,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4683181.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Shingster",
                "username": "Shingster"
            },
            "url": "https://myanimelist.net/reviews.php?id=275762"
        },
        {
            "content": "\"The beast with the sharpest fangs wins. That's what Killing Bites is.\" Your gonna hear that ALOT in this anime.\r\nKilling Bites REALLY isn't for everyone, it's for what LA would say is like one of those 90's violent schlock animes...that somehow sprung into the Winter of 2018. Well by violent schlock LA can say that Killing Bites has gory uncensored action, attempted rape, sadistic and unmoral characters and hell even the core concept of this anime is essentially a battle royale animorphism cockfighting and you know what...LA kinda loved it for all it's violent schlockiness.\r\nKilling Bites has some character developments towards the plot which focuseson the before and during the Destroyal (aka. team battle royale). The two major character developments goes to our useless main male protagonist who was thrusted into the Killing Bites Yuuya Nomoto voiced by Wataru Hatano, who is Hitomi Uzaki's pushover minder. For such a bland main male protagonist, he DOES develop in the case of his life always being told what to do and him coming out in making his own path by the end of the series. The more interesting character however is the one that ALWAYS says the quote above, Hitomi Uzaki, an animorphic ratel/honey badger. She's self-centered, abrasive as all hell and doesn't give a crap besides fighting. She herself is given some sense of a backstory and why she is who she is for majority of the anime and even though Killing Bites has no \"tact\", Hitomi's backstory gives at least a bit of levity to Hitomi's situation in the first place.\\n\\n\r\nAs for minor characters, for the most part, we do get to see the backstories of many of Hitomi's opponents as well as their animorphism before their gruesome demises by the end of it. Some of Hitomi's teammates has some small backstories like Ui Inaba (Rabbit) voiced by Sumire Uesaka, always the scared character has some weird ending as to why she's here to why Ichinosuke Okajima voiced by Toru Okawa is participating in the Destroyal and heck even some of Hitomi's buddy-rivalry with Eruza Nakanishi voiced by Maaya Uchida has plenty of screentime with her as well as Youko Mikado voiced by Megumi Han, a player in the Destroyal as well as her reasoning in competing in it.\\n\\n\r\nNow for a battle royale setup of an anime your expecting that Hitomi has ALL the plot armour and to that yes and no, yes as she does have plot armour disguised as Hitomi's animorphic trait kicking in to save herself but she gets beaten up pretty badly later down the anime and STILL survive a probable fatal wound. But the \"no\" definitely comes up in at the end result of the entire Destroyal but LA wouldn't spoil you on THAT outcome.\\n\\n\r\nKilling Bites has also some actual factual things concerning the animals in question, some LA didn't even know existed, but the most focused on is the Ratel (or Honey Badger). Now Killing Bites does tend to exaggerate the honey badger for the sake of the plot and Hitomi's physical and mental prowess as a fighter but Killing Bites does it and it's actually is oddly informative about the animal in question, like the rabbit, cobra, gecko, tiger, lion and crocodile and how the animal traits and factors are used in battle, especially with the over exaggerated narrator Junichi Sawabe makes it synergically interesting to watch animal essentially cockfighting while information about them is given to us and us connecting the dots to the fight much easier.\\n\\n\r\nAnd finally before getting into the technicals, Killing Bites always end the segment with Oshie Nodoguro voiced by Sayaka Harada who \"acts\" like a honeyguide animorphic however isn't one and she mainly interacts with Hitomi in some comedic skits with her and she's pretty funny all things considered.\\n\\n\r\nIn terms of animation done by LIDENFILMS.......this is LIDENFILMS bread and butter in terms of gritty atmosphere and gruesome battles, LIDENFILMS by all accounts know how to make these bleak atmospheric yet exhilarating battles and it's as bloody or gory as all hell. LA would give props to the character designs in both the human and animorphic aspect to them (as they have the entire human form is similar to their animal form). The battles are uncensored gory messes and yes the fanservice by all means is there and shown in rather detailed and sometimes intentionally fan-DIService manner, but yeah it's LIDENFILMS, they do this kind of stuff and this was what LA expected from LIDENFILMS. It just has all the hallmarks of their work and detail in violently detailed animation with gritty atmosphere (see Schwarzesmarken).\\n\\n\r\nAs for voice acting, well LA has seen a bit of Sora Amamiya playing up the abrasive type and she goes all out as Hitomi. From voice actors like Maaya Uchida and Sumire Uesaka did pretty well but Megumi Han as Youko Mikado was pretty interesting as well (though at first LA mistook her for Shizuka Ito) as Megumi Han goes apeshit hammy in this role (and no that's NOT a pun), kinda makes sense due to the nature of Killing Bites but still. The voice cast overall is hammy most of the time with some interesting casting here and there but the best voice actors for LA would be a tie between Megumi Han and Sora Amamiya just for some of the overtop craziness they displayed.\\n\\n\r\nKilling Bites does have some vague themes on corruption which does concern the Destroyal itself and the founders and it's companies that are betting on the winner without a care in the world for those who have DIED in the Destroyal with the best counterpoint link to this being Youko Mikado herself and her reasoning in participating however Killing Bites is obviously blatantly showing us of human's greed is everywhere and what lengths of corruption for them to keep their greed to the point of death and their scummy ways time and again by even having the Destroyal in the first place but *ahem* vague themes...\\n\\n\r\nKilling Bites is by far LA's guiltiest pleasure anime of Winter 2018 in all it's violent schlock, narm in it's more dramatic moments and being informative about animals all under the umbrella of a battle royal animorphic cock-fighting show, it's one batshit crazy concept and Killing Bites just takes and runs with it without a care in the world what anyone thinks because Killing Bites has no tact in keeping things innocent. Killing Bites just doesn't give a shit and LA doesn't think it really doesn't care WHO it offends and LA frickin' loved it for having that atmosphere about it. Mind you, LA was initially put off by Killing Bites at first but grew on LA as LA got to know Killing Bites a bit more and as it went into the Destroyal, LA's attention was all in for the violent madness that unfolded. Killing Bites actually had some method to the madness as insanely crazy as it gotten.\\n\\n\r\n\"Honey Badger don't give a shit\"",
            "date": "2018-03-30T14:16:00+00:00",
            "helpful_count": 14,
            "mal_id": 275780,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=275780"
        },
        {
            "content": "May contain spoilers!\r\nStory:\r\nAwfully uninteresting, generic and boring. \r\n3/10\r\nArt:\r\nOne of the only good points, most scenes are well animated and fluid. \r\n7/10\r\nSound:\r\nAnother good point, the tracks matches the scenes, mostly on fighting scenes also the ending theme is awsome. \r\n8/10\r\nCharacters:\r\nGuy: Useless.\r\nHoney Badger girl: pisses me off with \"The one with sharper fangs wins that's Killing Bites\", beside that op af and till now killed everyone with 1 hit.\r\nThe rest are the same as the guy, useless and boring.\r\n2/10\r\nEnjoyment: if your'e looking for\r\nStory, no\r\nLooking for furry ecchi, maybe\r\nFights and gore, yes\r\n5/10\r\nOverall: \r\nBad characters, story, almost no ecchi, may improve in the future if you want a trashanime to watch give it a try.\\n\\n\r\n6/10\\n",
            "date": "2018-02-04T19:04:00+00:00",
            "helpful_count": 9,
            "mal_id": 270683,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5793099.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Zerinha",
                "username": "Zerinha"
            },
            "url": "https://myanimelist.net/reviews.php?id=270683"
        },
        {
            "content": "*Somewhere in the Discovery Chanel HQ*\r\nD:\"Quick guys, we're running out of ideas, does anyone have anything?\"\r\nA:\"Alien stuff? Dunno\"\r\nD:\"We're not the History Channel for pete's sake... Anyone else? Joe?\"\r\nJoe:\"You know how 'Animal face-off' was a pretty nice show, right\"\r\nD:\"Hmm yeah, that's actually not a bad idea, a new season would be -\"\r\nJoe:\"How about this time is animated and with scarcely clothed hot chicks!\"\r\nD:\"...\"\r\nJoe:\"And in order to appeal to the youth we should have highschool girls...\"\r\nD:\"... Joe...\"\r\nJoe:\"And... and -\"\r\nD:\"Joe this is it, you're fired\"\r\nJoe:\"What, why\"\r\nD:\"Leave now or I'll call security\"\r\nJoe:\"But wait -\"\r\nD:\"SECURITY\"\r\nLater on, Joe made his own anime studio and thus decided to get back at hisold boss...\\n\\n\\n\\n\\n\r\nKilling Bites is at the crossroad between abomination and a decent show. I was surprised the show is actually enjoyable even if it mostly consists of ecchi that can only appeal to 12-year-olds without internet.\\n\\n\r\nI assume they'll just attempt to add a \"story\" to the mindless violence this show is and manage to ruin it (something that'll be preeetty impressive considering it's already bordering train wreck).",
            "date": "2018-02-02T09:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 270427,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4426849.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 1,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mike98",
                "username": "Mike98"
            },
            "url": "https://myanimelist.net/reviews.php?id=270427"
        },
        {
            "content": "First of all Thank you to the Killing Bites team to presenting this Anime.It was Amazing.\r\nAnd now about anime, when it started in first it was like whats going on, the starting was average but then it after some episodes it started to hit the mark, if i talk about story well it was good but what i special liked was the ending of the Killing Bites because the Main Thing, Main Story Starts from here...\r\nThe Art was well how to say it was kinda ero..(liked them) and the characters was interesting.\r\nWhat hit me hard was the end part and it made me so excitedfor the next season.\\n\\n\r\nWell this anime was just starting, its like dessert before meal the main thing starts now, i m really interested in Next Season... because  there are so many things that need to be discovered.....\\n\\n\r\nI cant wait for more.... Please make the 2nd season because \\n\r\n\" The One with the Sharper fangs WINS. That's what KILLING BITES is.\"\\n\r\nWaiting for you Killing Bites.......",
            "date": "2018-03-31T21:49:00+00:00",
            "helpful_count": 6,
            "mal_id": 276135,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5925689.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/_Hentai_Prince_",
                "username": "_Hentai_Prince_"
            },
            "url": "https://myanimelist.net/reviews.php?id=276135"
        },
        {
            "content": "Killing Bites is your basic Battle Royale fighting anime with some ecchi thrown in... AND CHARACTERS WHO CAN TRANSFORM INTO ANIMALS!\r\nThis show is the best of the best. You watch the first episode and think, \"oh god this is awful\" AND YOU'RE NOT WRONG but oh does it get better! Ratel quickly tries gunning for the Best Girl spot and from there it is a hot pursuit between Tiger and Rabbit. The characters in this show are all amazing, even Cobra with his dual cannons was an alright character. Ratel is easily the most likeable and without her I don't think we'd ever figure outwhat Killing Bites is really all about. Her catchphrase is anything but forgettable and she never forgets to say it every episode (except *insert episode numbers here*). \\n\\n\r\nThis show is also EDUCATIONAL! You can, in fact, throw this show on for your kids and have them learn a ton of animal facts! For instance, did you know that Crocodiles are literally immune to AIDs?! Or that Cobra's have TWO penises?! Fascinating!! This show never ceases to amaze me. The show even goes all out during its educational segments where they show you the most gorgeous of art for the animals depicted. \\n\\n\r\nEnjoyment? What's not to enjoy? It's a show where a bunch of animal cosplayers duke it out in order to see who is the most OP animal. There is nothing UNenjoyable about this show.\\n\\n\r\nOverall, I'd say this show is something of a gem this season and I've never not been excited to watch it each week. \\n\\n\r\nTL;DR- This show is a little memey and the first episode is probably going to turn everyone away but you stick around long enough for the fighting to start and you learn that the show is a true treasure that is deserving of this high a rating.",
            "date": "2018-03-23T14:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 274691,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820377.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Haaselh0ff",
                "username": "Haaselh0ff"
            },
            "url": "https://myanimelist.net/reviews.php?id=274691"
        },
        {
            "content": "Just because it doesn't have a solid story doesn't make it trash.\r\nI see a lot of hate for this anime. I'm not really sure why but i'm really enjoying it and i'm not even fapping either lol. Hitomi is bad ass, i like the concept and it reminds me of those AniMorph books i used to read but more adult themed. \r\nHonestly this is my type of anime if only there was a real story. The art is good, the action and animation is good, the characters have good especially the females. (Of course) \r\nOverall 9/10 because the lack of actual story but this animeis really great. I've most definitely seen worse.",
            "date": "2018-01-26T16:38:00+00:00",
            "helpful_count": 6,
            "mal_id": 269734,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6756495.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/QueenxKefura",
                "username": "QueenxKefura"
            },
            "url": "https://myanimelist.net/reviews.php?id=269734"
        },
        {
            "content": "this is one of those action ecchi animes that wont satisfy most peoples taste it is trash the good kind of trash if you turn you brain off and just take it as an mindless action ecchi anime you will enjoy it a lot the fights are great there is not much talking but more fighting its exiting the music is spot on and gets you hyped up they do give character development in between the fights witch keeps you invested thou some of the animals are wrongly portrayed and are more buffed for sake of looking cool more than animal consistency and i mustaddress the elephant in the room that one catchphrase witch everyone hated from Strike the Blood “No senpai, this is owner fight” yes they have something similar here that might make you mute the episode each time they are about to say it \".... doesn't matter. The one with the sharpest claws wins\" yea people will have nightmares about that line for weeks after watching this and its in every episode stayed at least one sometimes more than once ...\\n\\n\r\nstory: 8 there is some plot going on but were not here for it were here to see boobies and fights so on that part the story is spot on\\n\\n\r\nmusic: 8\\n\\n\r\nArt: 8 the art is nice to look at you can see blood and the fights are exiting the fan survive is survivable\\n\\n\r\nenjoyment personally i had a blast 10 even thou i should know better it had funny comedy as a bonus and most of all i didnt get bored at any point even in the most cringe parts\\n\\n\r\nover all score 8",
            "date": "2018-03-28T11:08:00+00:00",
            "helpful_count": 5,
            "mal_id": 275463,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257280.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/uNs7oPPaBL3",
                "username": "uNs7oPPaBL3"
            },
            "url": "https://myanimelist.net/reviews.php?id=275463"
        },
        {
            "content": "Whoever has the sharpest claws wins.. not in this case.\r\nStory 5: its another battle royale! Not really special, but I do like the whole animal side of it. Having their animal features and their abilities was pretty cool.\r\nArt 5: Noting special here, a couple of good ecchi scenes though.  \r\nSound 5: Voices were good, tracks were okay and the tracks reminded me of the 90s rock music (the middle cut scene)\r\nCharacter 4: I didn't like alot of them, you have the typical shy guy that has a hot girl as a partner. If I had to pick a favorite character it would be kidotakeshi, I love for what he stands for and his story about his mother was good too.  \\n\\n\r\nEnjoyment 4: I did like it (since I finished it lol), best part of the anime was when Hitomi and Eruza were in that confused state. \\n\r\nThe ending was good too, it was a good twist. \\n\\n\r\nOverall 4.8: It was good, not much more to say tbh. \\n\\n\r\nWould I recommend? \\n\r\nI mean why not its not pathetic, its okay. I would say don't waste your time watch something better, but you watch what you want :D\\n\\n\r\nThanks for reading! \\n\r\nIf you have any question or talk anime feel free to msg me :D",
            "date": "2018-04-02T19:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 276602,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879361.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BCxER80",
                "username": "BCxER80"
            },
            "url": "https://myanimelist.net/reviews.php?id=276602"
        },
        {
            "content": "On the surface everyone wants to simplify this into a fan service show, but of any fan service show show I've never seen the excess of emotion and brutality as I've seen throughout this show.\r\nIt's true that many things end of being fairly standard as far as fights and relationships go but by the last episode it's very clear that the betrayals and deaths that have piled up have formed a world that is unlike any in any fiction ever made. No joke.\r\nThe story is admittedly quite slow but after the first 4 episodes there's enough madness to keep you interested and as the showcreeps to its conclusion it's easy to doubt that there will be much of a spectacular ending to the show, after all most anime don't venture very far from conventional story telling. However, death is very much a big part of the show, don't let the personalities of the characters fool you.  If they seem too carefree it's due to their mafioso outlook towards the world.\\n\r\nThe combat covers every conceivable outcome, from thrilling second to second brawls to 10 second borefests.  But you might wonder why I score this show so high and that's due to its UNPREDICTABILITY.  The best fights aren't always between the predictable characters and some built up fight end up very standard mainly due to how animal fighting styles differ or are so similar between the combatants.\\n\r\nAdmittedly, it's pretty safe to assume that the smaller the animal is that the fighter's animal is based on, the more dangerous the fighter, but again UNPREDICTABLE.   Even if it feels standard at first, just enjoy the cheesiness and wonder about every possible way the show could go, because you will almost certainly be wrong.\\n\\n\r\nThe characters aren't deep but it's obvious that this show is starting from the ground and building the characters up.  The ost is just all around enjoyable with its guitar riffs and very much above average OP and ED.  Art wise I never so anything bad, sure it could be better but as far as an adaptation goes, it was no more and no less than 100% accurate.\\n\\n\r\nI pray for a second season to unfurl some time in the future, but honestly the ending of this makes me wonder whether a sequel could surpass the hype that this first season was able to create.",
            "date": "2018-04-01T18:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 276435,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4567828.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Animorphimagi",
                "username": "Animorphimagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=276435"
        },
        {
            "content": "The Killing Bites experience is similar to that of porn—not necessarily because you could easily jack off to either, but mostly for that aftermath with which we are all to familiar. You have a great time, but in finishing up after your session, you make the realization that you just so thoroughly enjoyed the last several minutes and it makes you disgusted–both with the content, and with yourself. Dejectedly tucking your shrinking chub into a more comfortable position, you expel a knowing sigh. You'll be back for more.\r\nKilling Bites is degenerate, cheesy, over-the-top trash. In other words: it's fantastic. I love it. It's funny, action-packed,and sexy. To summarize: it sucks. I hate it. No anime should be so bad, and yet so enjoyable. It doesn't fit any mold. It's got style. It's absurd. Killing Bites is worth watching simply because it is fun.\\n\\n\r\nStory: decent, never slow, and it doesn't get in the way of that supple \"plot\".\\n\r\nVisuals: varied and engaging fights with skimpy shots aplenty. Seriously though, the fights are quality.\\n\r\nCharacters: original and interesting to watch, some of which are totally not at all catering to any fetishes I have or have since acquired, I swear.\\n\r\nEnjoyment: far more enjoyable than is rationally acceptable. This is the strongest of this show's assets–aside from those present on the heroines.\\n\\n\r\n9/10. Would I trade my dignity for a couple hours of good entertainment again? Yes. Yes I would.",
            "date": "2018-04-01T01:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 276201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5389137.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/gaphiltfish",
                "username": "gaphiltfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=276201"
        },
        {
            "content": "An anime that is fun and exciting!\r\nKilling Bites is basically a battle royal where the participants are therianthrope(human-animal hybrids), scientifically speaking, furries! \r\nSounds pretty dumb, right? \r\nWell it is and it is not at the same time, this show is basically a \"guilty pleasure\" anime, it doesn't need to have a great story (which is actually good), it doesn't need to have great characters (which is actually good), it just has to provide you with a good 24 minutes of entertainement and it delivers a good amount of fun, a bit of lewdness (which for this kind of anime is a must have) and gore.This is a show that you have to watch to balance with more serious or story heavy anime, this is a show that you sit on your couch get some popcorns put a smile on your face, just relax and enjoy. \\n\\n\r\nDon't get me wrong, it isn't a masterpiece, there are many flaws, but they are minor flaws, like for example the male therianthropes go full on transformation while the female still mantain human-like features, now i don't know if there was an explanation in why that happens in the anime (if there was i missed it), but that happens out of convenience, because the show is there to provide lewdness and gore and for me, at least, if Hitomi or Eruza went full furry I would not enjoy it as much as i did (although i bet there are some sick puppies who would).\\n\\n\r\nEducational? Maybe, I wouldn't quote it for a schoolwork but it provided some knowledge about some of the zoology of our planet. \\n\\n\r\nIn the end this anime did the job it had to do, provided laughs, gore and lewdness in the right portions at the right time. Of this season's shows this anime is one of the most underrated and i hope the ratings go up and I also hope that maybe a season 2 comes out since it was a bit teased that it can happen (although I doubt it will) and it looks like the story has just begun. If it doesn't happen the anime sold me for sure to check out the manga.\\n\\n\r\nStory- 7/10\\n\r\nArt- 8/10\\n\r\nSound- 7/10\\n\r\nCharacter- 7/10\\n\r\nEnjoyment-9/10\\n\\n\r\nOverall Rating- 8/10",
            "date": "2018-03-31T08:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 275871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6567699.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/viktheone",
                "username": "viktheone"
            },
            "url": "https://myanimelist.net/reviews.php?id=275871"
        },
        {
            "content": "I have to say, I started up with this anime because I saw it on Amazon. Watched a few episodes and thought that the little bit of information the show gave on the different animals was actually interesting and helped provide an understanding to the characters actions.\r\nAt the start the anime seemed like it was going to be 90% about the fan service, but the actual fights were interesting and decently well thought out, pulling in the characteristics of real animals and the way they would likely interact in the wild was pretty good. I liked both the main and sub-main characters as they fitinto their roles pretty well. Both Hitomi and Nomoto progressed and developed throughout the season.\\n\\n\r\nSo I decided to look for the manga and after a binge session of that I returned to the anime to watch it the rest of the way through just to give it the fair shake and see how everything was done in the anime.\\n\\n\r\nLet me just say, there is a reason why I gave this a 7/10 for overall and 7/10 for character and story. They go through this drawn out process of explaining the characters back story, which was good, I enjoy exposition because it actually allows us to relate to the characters on a more human level; but then after establishing that there was an extremely high bond of trust (not only though dialogue out lout but also internal dialogue), they make their main character completely betray that bond. This is not only breaking the few character rules they set up through the story but also the rules they established for the animalistic side of the character.\\n\\n\r\nAnd for those whom haven’t read the manga and know what is coming in Season 2, skip over the next two paragraphs, but this is very essential for those that have watched through to episode 12 and are as pissed off about the ending as I am… \\n\\n\r\nI read to that part of the manga and was disgusted with this choice in the story; it’s lazy, it’s poor character development and it defeats the ability to identify with either of the main characters from that point on. Hitomi’s character through the show is established to not care about killing that which is not a challenge to her. She thirsts to be the strongest among the beasts and then they turn around and have her basically assassinate the character she was established to have trusted, completely and totally out of the blue.\\n\\n\r\nThen they turn around and make Nomoto into a pseudo bad guy; planning his revenge against a person whom he had developed feelings of adoration towards. They would have been better off to not have her attack him at all and tell him to run away, to never show his face again, but him to return to help her break free of the corporations control and free from her bond with Reiichi Shido. Overall this plot line detracts from the series and I feel it was a very flawed design that will turn many people off of wanting to watch more if the anime is completed through a second season.\\n\\n\r\nIf you skipped the above you can read the rest without worry...\\n\\n\r\nAs for the rest of the scores, the actual animation was well done, a mix of mediums which works very well together along with organized and well placed ambient music tracks that only serve to add to the drama on screen. I liked the overall character designs and the concepts of the fights and how they worked out. I am a bit confused as to how Hitomi’s arm was reattached but I’m just going to write that off on science fiction DNA mumbo-jumbo and give it a pass.\\n\\n\r\nUp until the last episode of the first season, the story was well done; (if only they could ret-con the end of episode 12, we’d be great), but overall the show hit where it should for the audience it was written for. Would I tell my friends it’s worth watching? Yes; but with the caveat of informing them there was an extremely bad, and poorly written plot twist at the end. \\n\\n\r\nThis could have been a 9 or 10/10 show, but poor writing for the end of the season destroys what could have been great and turns it into any other poorly written anime/manga series that will likely die in its second season. \\n",
            "date": "2018-12-25T15:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 296868,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GeneFirewind",
                "username": "GeneFirewind"
            },
            "url": "https://myanimelist.net/reviews.php?id=296868"
        },
        {
            "content": "Out of 100 Nobles watching...\r\n83 were impressed!\r\n10 clawed out their own eyes in CG segments\r\n5 found the story lacking a certain bite to it\r\n2 find death game plots difficult to immerse themselves in\r\nHooooo~ boy is this a spicy meatball. There's quite a lot to unpack with Killing Bites and it's got me worried I've bitten off more than I can chew. Nonetheless I'll just go right ahead and sink my teeth into this one (okay no more puns).\r\nKilling Bites is a death game anime based on the manga of the same name. This particular flavor of the genre is that the four corporations that ruleover Japan's economy hold a recurring battle royale to redistribute power using genetically modified animal/human hybrids. Now my personal experience with these sorts of anime are currently limited to Fate:Zero, Fate:Stay/Night, and now Killing Bites and I'm beginning to find some fundamental problems that inhibit my enjoyment of the genre. That being said I had an absolute blast watching Killing Bites despite it's many flaws. \\n\\n\r\nOur main character Hitomi is a Hybrid based on a Ratel, or the Honey Badger as the internet would call it. Hitomi's personality sculpted to reflect that of an animal that just could not give a shit about anything or anyone is a fun take on the full of themselves protagonist commonly found in these sorts of shows. On that note most of the Hybrids in the show having personalities and fighting techniques centered around their specific animals traits are what brought a lot of charm to the table. Unlike the Fate franchise and it's habit of breaking immersion with world-shattering plot twists pulled out of thin air; if you have watched a healthy amount of the Discovery Channel you can get a grip on how a lot of the fights in the show will play out. \\n\\n\r\nAs far as death game plots go I found this one handled the usual questions of \"Why are the fighters okay with this? Why are these people so terrible? Wouldn't it be easier to do X instead?\" being reasonably explained by the shows world building and plot particularly close to the end of the show. The show handles it's setting fairly well as billionaire government controlling entities being totally cool with pitching their experiments against each other in battles to the death for more funding for more experiments being pretty believable. \\n\\n\r\nOur throwaway self insert soft bellied male protagonist, Nomoto, had me very worried his blandness would reflect poorly on the show looking back on it and it to tell the truth it did, however by the end of the season I really enjoyed what he contributed to the plot. \\n\\n\r\nSound design was... mostly bland with most of the tracks for the show feeling bare-bones enough to fit the mood with nothing standing out as really jamming or hype building. I loved the OP and the ED however so a lot of points were picked back up there. \\n\\n\r\nProbably the biggest glaring issue with Killing Bites was its art direction. The show really struggled with the bigboi enemies who have complicated movements or a lot of parts (like scales) presenting a dilemma. What do you do when you have to animate a bunch of moving parts and intricate lines for multiple episode long fights? Sadly that answer is almost always cheap CG. We're talking almost Kemono Friends or Berserk 2016 levels of bad here which makes me wonder what could have been. Generally character designs were interesting, hilarious, or just generally fun with enjoyable fight scenes but the two CG heavy offenders I feel will really put a nasty taste in how people will look back on the show.\\n\\n\r\nOverall, despite the absolutely insane amount of fan-service littered throughout the show if you asked me if Killing Bites is just another Fur-bait ridden garbage fire I would say no. Despite Hitomi's catchphrase making me audibly chuckle the other half of those times I felt pretty hyped up. Despite fight scenes being half horrendous CG the other half was rad animal fact fueled shenanigans. Despite only being interested enough in the plot to stay for the whole show and ready to shelve it as a one off experience Killing Bites reeled me back in so hard with it's last 5 minute reveals and plot twists that I HAVE to see how this shitstorm plays out in the manga. \\n\\n\r\nI laughed, I smiled, I enjoyed myself, and that's all I can ask for right?\\n\r\n\"It's not about who won AotS. The one with the sharpest fangs wins! That's what Killing Bites is!\" \\n\\n\r\nEdit Extra Note: I cannot wrap my head around why the scummiest characters in these stories always get to live. Characters like Shinji Matou and an character in Killing Bites. Other characters dies no problem, these stories don't shy away from killing off characters but for some reason the MC will take pity on these characters that had they gotten their way would have literally murder raped them. Generally the scumbag goes through some painful ordeal and that seems to be deemed by the author as enough penance for being a murder-rapist with no actual justice dealt. The character may be presented as reformed but it reeks of a toxic perception being given to individuals that should be at the minimum locked away for life. This is not a rant, but rather a legitimate criticism of some of the biggest roadblocks to enjoyment I have to overcome with many series like Killing Bites, Fate, Jojo etc...",
            "date": "2018-10-20T15:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 292178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7016163.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Moomochi",
                "username": "Moomochi"
            },
            "url": "https://myanimelist.net/reviews.php?id=292178"
        },
        {
            "content": "Now this anime Killing Bites is a battle between animals. You might find it interesting, but it just depend on you if you like it or not. Might be a little spoiler but I'll try not to. \r\nStory (7/10): The story was alright. Lots of fighting and lots of fan service (which is good). I think in episode 11 or 12 I found it interesting and also feel horrible at the same time. The ending on episode 12 really was unpredictable but was predictable as the same time too because I already knew something was up when... (STOP I can't spoil this sorry).  \r\nArt(10/10): Nothing to be concern about this. \\n\\n\r\nSound (10/10): It's great.\\n\\n\r\nCharacters (6.5/10): Okay now this might be a little rough and sad but tell me tell you why because what you about to watch is nothing like before. Let's start with the character name Yuya Nomoto. He's a university student who got caught up in the battle between animals or should I say he was actually forced to be in it by Reiichi Shido (who I don't like him). Nomoto is not what you think he is when you watch the anime because he is mostly useless in the rest of the story. Hitomi Uzaki is a Honey Badger hybrid. Hitomi is Shido's guardian but he left her with Nomoto so she can participate in the game. Basically, Nomoto is just a tool used to let Hitmi to get in since Shido can't do it himself. Hitomi ONLY follows Shido's orders which pretty sad since Hitomi can't even make her own decision. My favorite part (not character) is a character named Yoko Mitsukado. She doesn't like Shido (like me) but she is also careless during the battle which lead to an unexpected turn of event. In that event I saw something incredible which I might have foreseen whiling watching the anime. It was so surprising (for me). I really can't believe it happen but I wish they would show me more about what happen after that. Hopefully they should it in the next season. \\n\\n\r\nEnjoyment (7/10): Pretty good. I like it. \\n\\n\r\nOverall (7/10): Good it's not bad but I wish Nomoto would become something better in the next season if it really happen. Would I recommend this? Well, if you can't watch something ecchi I won't but if you can then yes. Do you like battles? This is you. Do you like humans with the power to transform into an animal then yes this is you. At the end of the story, Shido really pisses me off on how he changed the society and the humans. You know what I mean when you watching the end.",
            "date": "2018-07-10T11:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 283638,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5337421.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/0Unknown0",
                "username": "0Unknown0"
            },
            "url": "https://myanimelist.net/reviews.php?id=283638"
        },
        {
            "content": "After finshing this anime, judging the final episode, it looks like an opening scene for a second season and if so, I wish it has. The Story or Plot don't have that much to give for the viewers. Most (Actually all) episodes only covers numerous battles against 2 or more Therianthropes (Humans with animal abilities) with a mix of slice of life.\r\nThe Art and Animation doesn't have any problems. The style and animation is pretty much the same as other anime I watch.\r\nThe Sound/Music is good on this one. It has a good intro music aswell end music. The Music used in this anime iscatchy for my opinion and I currently looking/waiting for the full version of it.\\n\\n\r\nThe Characters aren't that relatable. The Male Protagonist is the only thing I can relate to but not as a whole just a fraction of his. The Characters in this anime is pretty much unknown. What I mean is, don't have any backstory for themselves.\\n\\n\r\nEven so, I find this anime enjoyable to watch thanks to its bloody fight scenes and good music. I'm not including the fan service which are alot and pretty much self-explanatory.\\n\\n\r\nOverall, its a good show and all I can say is, don't expect to much for the story and characters. Well, I can let it pass due to the fact that the Manga hasn't been finished so it means it doesn't have a clear ending, yet.",
            "date": "2018-04-01T01:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 276207,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6919918.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ZakkuRa",
                "username": "ZakkuRa"
            },
            "url": "https://myanimelist.net/reviews.php?id=276207"
        },
        {
            "content": "Summary: Stupid but entertaining. I may have watch this all the way through purely out of appreciation for the Honeybadger meme...that and the T&A.\r\nI'm fairly certain that anyone who has watched even one season of anime will recognise this for what it is. Ecchi battle anime. Surprisingly, there's even the semblance of a story too...just don't expect much.\r\nAll of the characters, and I do mean ALL, are very one dimensional, the artwork and animation is average, the music is rather forgettable but, in terms of Ecchi, it's actually pretty decent. They do manage to make several of the female characters believable and sexy while makingthem appear capable of the kind of fighting depicted in the anime (there's more than a few pairs of \"muscular Thighs\"). That rather surprised me. I was also surprised by how the final episode panned out...they clearly intend to make more of this.\\n\\n\r\nOne additional little treat is the end credits sequence, I got one or two solid laughs out of it.",
            "date": "2018-03-30T12:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 275765,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6998966.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Down4daFall",
                "username": "Down4daFall"
            },
            "url": "https://myanimelist.net/reviews.php?id=275765"
        }
    ],
    [
        {
            "content": "What is Killing Bites?  \r\nI'll tell you what it is.  \r\nIt is ''Super Fire Dragon Fury Ball Emblem Battle Royale''  \r\nI started a ''bad'' anime marathon and somebody on MAL recommended me this anime. Well it has definitely some qualities which wouldn't fit into this category, finishing this series I finally can see why it is. Sharpen your fang and try to not get kinks, this is my review of Killing Bites.\r\nStory: 6/10 [MASSIVE SPOILER ALERT]\r\nThis story, as you saw with my opening joke, is a combination of Dragon Ball, Fire Emblem and Battle. Or mor specifically, the game thatis Killing Bites. The main story on the other hand has a bit of a backseat. In the first few episodes it is only main story, but after that it is only the game Killing Bites. I have two massive problems with this story: First, the story is way too much filled with the tournament and too less with character development and interaction. It is the focus in the first few episodes, then it is just straight up forgot about and then suddenly in the end it comes back. That's also my second problem: The End. What was that downer of an ending? I am not saying that there never should be a bad ending, but why do it in this way? Why let one of the losers get raped? Why get one of the main characters just suddenly get killed? What is the point of that? Should we be like ''NOOOO DONT DO THAT'', but rather I am just confused and angry. This anime could've been way more benifitted of a 24 episodes season, but they didn't and the story clearly suffers from that.\\n\\n\r\nArt: 7/10\\n\r\nIt's pretty okay for an action series. The animations are fluid and the artstyle is appealing. There only one bad thing about the animatino: CG. Oh yeah, get ready for lots of CG cars and snakes!\\n\\n\r\nSound: 6/10\\n\r\nI like me some guitar music, but this just feels like trying to hard to be edgy. Scratch that, this whole anime just tries to be edgy but also still tries to be appealing to the everyday anime fan. Go all out or not, there is not inbetween!\\n\\n\r\nCharacter: 6/10\\n\r\nThe main cast consist of Hitomi, a stuck up powerful bitch, and Yuuya, a coward. There are also some side characters, but the only real interesting one is Ui, a even bigger coward. The cast isn't that bad, but the anime again suffers of lack of character development and interactions.\\n\\n\r\nEnjoyment: 7/10\\n\r\nI rather enjoyed this anime (except the ending). It was funny and had some good moments. Sometimes I liked Ironically, sometimes I liked it genuinely. Also, there is a huge focus on R+ stuff, but I watched Monster Musume and Eromanga Sensei so I didn't mind it that much.\\n\\n\r\nOverall: 6/10\\n\r\nA great story idea but suffered from lack of character development/interactions and too small of a running time. Not even close to the worst I've watched, but still a damn dissapointing one.",
            "date": "2018-08-13T10:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 286386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7100257.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Groenboys",
                "username": "Groenboys"
            },
            "url": "https://myanimelist.net/reviews.php?id=286386"
        },
        {
            "content": "Killing bites is a fighting anime, the story centers around a tournament called the Destroyal. In this tournament he have four teams of three, each person on each team has a sponsor. The job of the sponsor is both in financial backing, and the ability to move their fighter like a chess piece on the tournament grounds. This story is one that follows Hitomi, the main fighter, and Nomoto her hostage / sponsor. The over all fights are okay, but the show does rely a lot on fan service to survive. \r\nIt's a little hard to go into much on what happens, but that canbe common in a fighting anime. I think this show misses in one of the larger points though, that point being. Why am I caring? Hitomi is a strong fighter, but she basically is someone who will do anything that Shidou will tell her to do. Shidou is pretty much the figure in the dark who is masterminding the whole deal. Then we have Nomo, who as stated before, is basically their hostage. He met Hitomi in a gang rape gone wrong. He was spineless driver in the whole thing, but yea. Now under the threat of death he is the sponsor for Hitomi, using money given to him by Shidou which he must not use or else. He's of course totally fine with this since Hitomi is really cute.\\n\\n\r\nI would have liked more interactions, to show them forming some sort of bond, but the show wastes no time in jumping into the bulk of the fighting. I understand, since we have 12 episodes and the tournament itself is pretty big. This might be a case of a show needing a full 24 to really flesh everything out. Of course if that did happen I'd be subjected to another 12 episodes of someone (Usually Hitomi) Pointing out that \"The one with the sharpest fangs win. That's what killing bites is.\" In literally every episode apart from number 11 that exact quote, word for word is said at least once. Which means in a couple of them, we get it another time. That for me was a huge problem. Can you imagine the writers of the show needing to come up with a reason for someone to give that exact tagline every episode? It hurts me.\\n\\n\r\nTaste: I mean, it didn't taste bad. The forced tagline leaves a bitter after taste but the fights were okay. I feel like the latest meta in fighting anime is to just have someone have overwhelming power. It kills the tension in a lot of fights I think. I wouldn't say the show is one note, it's more like it's lacking ingredients. We have a nice steak of characters that needed a little more seasoning. We have a world that's been built, but needs a good sauce. We have some side dish characters, but they just kinda got added onto the plate. I'll give it a 4 out of 10\\n\\n\r\nPresentation:  The art isn't lazy. The characters are reasonably done. Nothing sticks out as far as the music goes. As for the fan service. I think there are two ways of doing something like that in a anime. In one way. It just happens to be there. Like. Oh we just happen to have something tear just right, and in these cases I don't think it takes away from a show in general. The other way is of course how Killing Bites goes which is basically just having someone's ass hang out. There are shows that do it worse! But in this case it brings it down a little. For example in one fight we have a person with the ability to release pheromones, so we have Hitomi and Eruza basically take a break to get their freak on. Neither fighter is really punished for this, which might be the only reason why such an ability would be handy in a fighting tournament, but instead everyone just kinda takes a break to you know.. Watch.. Presentation gets a 2 out of 5\\n\\n\r\nOriginality: I mean, what we're getting is a fighting anime, with its core being a tournament. So in this what you really want to look at is how they get there, and the decided curveballs in how the tournament is presented. It all basically jumps into the tournament, but I think how it's presented is nifty. First the characters are all animal hybrids. So they have neat animal powers in a way. Eruza is a cheetah, so she's very fast. We have Inaba who is a bunny, so she has great hearing. And so forth. Next the sponsor idea is nifty in that there's a strategy in how characters are moved around. I think the idea was great, but they missed a little on the execution. But I'll give a 4 out of 5 on this one.\\n\\n\r\nIn conclusion killing bites is a fan service-y fighting anime. There's certainly a lot more too the story that is not gotten into, so it probably needs another season or two. If it'll get those? I can't really say. Might have to pick up the manga.  But this show gets a 10 out of 20.\\n",
            "date": "2018-04-07T21:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 277332,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6889857.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Lucibunny",
                "username": "Lucibunny"
            },
            "url": "https://myanimelist.net/reviews.php?id=277332"
        },
        {
            "content": "Killing Bites is one of those mediocre animes that for some reason, you still want to keep watching in order to see what happens next.  The storyline is mediocre.  It's nothing more than another battle royal survival anime.  The animation is mediocre and when it comes to character design, downright atrocious.  (I.E.: The character design of Leo, whose upper body was just ridiculously disproportionate to his lower body.).  Even the score is a mediocre blend of 90's grunge rock and what sounds like royalty free audio tracks.  \r\nHowever, the Main Character, Ratel aka Hitomi, is such an awesome characterthat she drives the story forward.  She's a character on the order of Revy from Black Lagoon.  She's rough, crass, violent and kind of sexy.  She's the kind of female lead that animes could use more of.  Unfortunately, outside of her and Ui (The Rabbit) all of the rest of the characters were pretty mediocre and cliched.  \\n\\n\r\nI will say that the ending was a plus that will probably want to make at least 60% of the people who finished this anime, want to see the second season if there ever is one. (It's an obviously low budget anime, that I doubt will have enough popularity to automatically green light S2) But, even in watching that second season, most will probably think it's mediocre or outright garbage, too.  \\n\\n\r\nIf you have nothing better to watch (and odds are you will always have something better to watch) then Killing Bites is a decent waste of time on a weekend binge.  But, if you choose to pass on this anime, you're not really missing much, either.\\n\\n\r\nStory: 5\\n\r\nArt: 5\\n\r\nSound: 5\\n\r\nCharacter: 8\\n\r\nEnjoyment: 7\\n\r\nOverall: 6",
            "date": "2018-04-06T05:44:00+00:00",
            "helpful_count": 2,
            "mal_id": 277099,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6496256.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Injenss",
                "username": "Injenss"
            },
            "url": "https://myanimelist.net/reviews.php?id=277099"
        },
        {
            "content": "what can I say that hasn't already been said about this rather interesting show. let's break it up, shall we? the story is very simple and predictable, like your run of the mill shounen anime with a weak protagonist at the start and later improves his character to become more desirable. after reading the manga (as of how it is so far) the anime does it quite a lot of justice and sticks pretty close to its source material which some fans can really appreciate. I do however feel that the animes appeal would be towards newer fans of anime or individuals that are lookingfor a good ecchi series and are bored with the usual series that we've seen to this date. the manga is drawn very well is really staticky pleasing, sadly I do not feel the same for the anime though it has its moments of awe and shock at its visual recreations of the manga. the sounds used for the action scenes closely resemble that of a bullet being fired or rocks being smashed which to some extent can carry that extra punch feeling, though it has proven to also become quite rhetorical as the show progresses. the same could not be said for the opening song of the anime. the opening song really does set the tone for the anime by utilising heavy rock beats and beautiful vocals to go with it. its adrenaline, its power, its a total takeover, the opening song fully engulfs its listeners which have compelled me many times to come back each week for it. characters are really nothing to scoth at in the slightest. you have the main character who is the lowest of the low, weak and highly dependent on others, meets a beast girl named Hitomi by chance and thus their extremely brutal and dangerous partnership begins. I feel as though many of the characters are just not fleshed out enough for the audience to really start caring about them but then again this isn't that type of anime. \\n\\n\r\nDespite all this, the show is still quite enjoyable, not for the story or the characters but more so because of the combination of all the mediocre things that have really made this show stand out as something to try for everyone. I would recommend this anime to anyone that can at least stand hearing the baseline of the anime in each episode because damn when you have that kind of baseline why not abuse it? all in all its a must watch the show in my view but it's one I recommend going in with zero expectations and an open mind.",
            "date": "2018-03-25T02:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 274962,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7088323.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/WhiteMochiBro",
                "username": "WhiteMochiBro"
            },
            "url": "https://myanimelist.net/reviews.php?id=274962"
        },
        {
            "content": "Killing Bites is without a doubt, the trashiest, schlockiest, cheesiest, most over-the-top dumpster fire of a masterpiece I have EVER seen. \r\nEverything about this show is created in a way to amplify it's rediculousness.  The story contains as many twists and turns and betrayels as some whole series do in multiple-seasons.  The character design is perfection, take a hot waifu, and slap some abs on her (The ED is glorious btw).  Humor is interlaced throughout, and is cleverly done too alleviate the EDGE that most fights contain, and the show even throws in some nature documentary style explanations to give some scientificbackground on animal characteristics.\\n\\n\\n\r\nWords can barely express how much I loved this show.  From start to finish it takes it's ridiculous premise, and RUNS with it.  Killing Bites doesn't look back for a second as it takes you on one of the most fun rides I have ever experienced.\\n",
            "date": "2019-04-29T15:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 307406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7753725.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Mobiletortoise",
                "username": "Mobiletortoise"
            },
            "url": "https://myanimelist.net/reviews.php?id=307406"
        },
        {
            "content": "This show was utter garbage relying on pseudoscientific tales to counter common misconceptions. LMAO\r\nThe \"tactics\" and \"fights\"that are supposed to fill out the story are laughable- the story itself has a certain charme of mediocreness to it though.\r\nIt's still a joke of an Anime and one no one would laugh at at that, but it actually wasn't too cringy to endure.\r\nWhat could have made it worthwhile watching then?\r\nThe Fanservice -ngl that part actually was cringy af so no\r\nThe artstyle -if you excuse the messed up proportions and \"transformations\" that look like bad fursuits ...than it's still mediocre at best (the cg didn't help either).\r\nThe charactersapart from design were also -still extremely plain,but admittedly pulled off in the best way possible.\\n\r\nThe concept behind the story was just poorly thought out so the execution still seems acceptable overall.\\n\r\nThe end really hit it though and then actually left me waiting for a season 2.\\n\r\nIt wasn't terribly enough for me to not recommend it as a timekiller.\\n\r\nMight try the Manga and see if that's any better...",
            "date": "2018-07-18T08:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 284246,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6887031.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SalkinvonBach",
                "username": "SalkinvonBach"
            },
            "url": "https://myanimelist.net/reviews.php?id=284246"
        },
        {
            "content": "To start off with, it's by no means a terrible anime. It's just that the series itself is flawed with problems that will be mentioned below.\r\nStory 4/10: It's the weakest subject by far. It's horribly paced. It touches on far too many subjects and backstories/sidestories to be properly discussed in any real way, while also detracting from the supposedly 'main'  story too. It's a thinly diluted attempt to make an intriguing world and story potential that falls flat on its own face. It also decides to swing wildly between \"moods\", in that sometimes it will have action-based sequences abruptly cut to people talking toeachother with overly exaggerated fashions and emotions crammed in there. It also drags itself down with some tropes/stereotypes that don't even feel properly done, if not just feeling completely out of place.\\n\\n\r\nThis isn't even necessarily a problem with the anime itself, because this is just an adaption of something that already suffered from this \"problem\". It wasn't so much a problem for the manga from a longtime readers side of the argument, because it was a drip-fed series and having the story be quickly paced to make up for gaps in publication schedules was reasonable. But for newcomers and anime viewers, it is very awkward to see something hint so much potential but never really explore it in favour of quickly moving forward.\\n\\n\\n\r\nArt 7/10: Nothing special, so to speak. How pretty a show looks isn't the be-all-end-all of a series quality. The animation studio was well-picked for this and they did their part well in refining and displaying the anime adaption. Even going so far as to emphasize muscle-shape via better shading and \"texture\" detail that can't be done exceptionally well in black/white manga.\\n\\n\\n\r\nSound 7/10: Pretty standard, but I found myself liking the OP/Intro music.\\n\\n\\n\r\nCharacters 5/10: Very bland and one-dimensional. The only characters with depth to them are pretty much unexplored or figuratively \"ran-over\" by rampant -edge- in the story.\\n\\n\\n\r\nEnjoyment 5/10: As someone who either wants depth or \"mindless entertainment\", I found it hard to enjoy much of anything except the work of the animation studio and the effort they put into it. It would be just mindless entertainment, but it keeps trying to be more than that, and keeps trying to force this idea very heavily at seemingly random intervals.\\n\\n\\n\r\nOverall 6/10: It's a very decent looking show with decent sound design and intro-music, but it trips over itself constantly. This wouldn't even be an issue if they spaced the contrasting elements out from eachother, but they decided to interlace everything in a very messy way.",
            "date": "2018-05-07T02:13:00+00:00",
            "helpful_count": 1,
            "mal_id": 279982,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4845968.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Jebus_Kreist",
                "username": "Jebus_Kreist"
            },
            "url": "https://myanimelist.net/reviews.php?id=279982"
        },
        {
            "content": "NOTE: This review is meant for people who have not watched much and want to know if this is worth watching.\r\nOverall I give this a hard 5 because while I did finish it I only enjoyed certain moments. But I'll break things down to keep it simple and spoiler Free besides maybe the first episode or two\r\nStory:\r\nThe story is pretty terrible. After the MC litterally gets forced into this the story seems to drift for a bit before suddenly a big tournament starts. Normally this would take a few episodes and then afterwards the story would move on but the tournament takes up the restof the anime which makes it feel like not all that much was accomplished in the end.\\n\\n\r\nCharacters:\\n\\n\r\nThe MC is complete trash. He's a loser who mostly just screams and does nothing of value. He exists mostly to just scream and cry and be the average male viewers self insert because he's seriously so bland.\\n\\n\r\nOn the other hand the main Heroine is fun. She's not especially unique but she's definitely a spirited character that has the kind of energy that's hard to hate. her existence pretty much saves the series from being a disaster.\\n\\n\r\nAs for the rest of the cast they are mostly mediocre and at best satisfy the roles they were given in the plot without being too good or bad.\\n\\n\r\nArt/animation:\\n\\n\r\nThe animation is good. Nothing special or unique but it gets the job done and with the exception of some pretty half assed CGI at a couple points it makes for some good fight scenes. If you like beautiful animation this won't do it for you but if you just want something that makes the fight scenes feel alive then this does it and the fights don't feel too stiff or dull.\\n\\n\r\nOverall:\\n\\n\r\nIf you like battle royal anime then you'll like this. If not then don't bother. The fan service is not enough to be worth a watch by itself if that's what you want and the plot and most characters are just barely okay enough to sit through. I've absolutely seen worse but I've also seen better.",
            "date": "2018-04-13T10:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 277971,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237207.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Metazoxan_Dexal",
                "username": "Metazoxan_Dexal"
            },
            "url": "https://myanimelist.net/reviews.php?id=277971"
        },
        {
            "content": "It's about a story animal humans fighting each other in a tournament. There is some progressions between the main guy and the main girl. There might be some unintentional spoilers along the way so please understand the concerns.\r\nStory:\r\nPersonally I think the story was kinda lame, basically battle royale between characters, seen too many of those types of cliché stuff so nothing really unique.\r\nArt:\r\nThe artstyle was somewhat unique so far i've seen in anime so that's something to go for if you are into the art but then again i wouldn't suggest watching this anime just because of the art.\r\nHad some ecchi scenes if you arealso into that.\\n\\n\r\nSound:\\n\\n\r\nThe ost in here was ok, nothing really out of this world but fitted the theme. Though I still wouldn't listened to this anime's ost in free time/gym.\\n\\n\r\nCharacter:\\n\\n\r\nThe character development didn't go above the average level which in my case i would say lacking a lot of it. It definitely had potential in the beginning but it was too focused on the battle royale so all the characters was being forcefully dragged in without giving time to develop anything. I must say that at the end of the anime the character development literally just fell apart. Why would you even do that type of ending when you had so much more potential?\\n\r\nA Big Fat MINUS!\\n\\n\r\nEnjoyment:\\n\\n\r\n It was enjoyable in the very beginning and had some ok pacing here and there but once it reached the later stages the paces started to go out of control. A big minus here again.\\n\\n\r\nOverall:\\n\\n\r\nI would love to give it higher scores but this anime did not make it through good enough. \\n\r\nDefinitely wouldn't recommend watching this anime, it just leaves a bad taste after (no, its not a bitter sweet ending just to make it clear).\\n\\n\\n",
            "date": "2018-04-01T05:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 276266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3350291.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 1,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Commander-Toffen",
                "username": "Commander-Toffen"
            },
            "url": "https://myanimelist.net/reviews.php?id=276266"
        },
        {
            "content": "TL;DR:\r\nTrash show that's still really fun trash for Edgy-Mc-I want a lame Ecchi heavy battle shonen.\r\nSo not gonna lie this was a surprise of the season just in sheer terms of being something that turned out to be way more amusing than I expected and now that I finished it all I can say is that it was trash....but it's very fun trash.\r\nStory:\r\nBattle Royal with animal folks and a lot of shallow worthless characters that don't serve a whole lot but do their thing and some fairly amusing fight scenes that don't go on longer than they need to.\r\nYou get a few things here andthere that could entertain the kind of edge-lord anime fan who wants some needlessly violent and sexual anime to make them feel all adult and cool but overall you're not sticking around to see if it gets any better but rather just how bad things are although I'll give them credit the entire second half kept me going and the last episode was a solid series of events that leave you wondering somewhat as to where the results of this tournament go.\\n\\n\\n\r\n3/10\\n\\n\r\nArt:\\n\\n\r\nEH I like the characters designs and animal forms but the use of 3D is horrible and most of the real effort went into the odd animal profile scenes when the characters transform which seems odd.\\n\\n\r\n5/10\\n\\n\r\nSound:\\n\\n\r\nThe intro is very EHHHH but it's a rock song in an anime which I can fully appreciate and the announcer guy when they talk about the animals is actually very very amusing but the majority of my score is going to the fact that I really like the end theme because it's a pretty damn solid hard rocking tune that get's me pumped and makes the best part of the show even better.\\n\\n\r\n8/10\\n\\n\r\nCharacter:\\n\\n\r\nI like the Inaba chick a whole lot because she's amusingly worthless but beyond that everybody else is just bodies to move a plot and they took wayyyyyyyyyy too god damn long to expand on the main chick and why you should care for her.\\n\\n\r\nReally the only use is you have new characters to lewd out for when you and your friends want to do monster girl Monday's in your image forums.\\n\\n\r\n4/10\\n\\n\r\nEnjoyment:\\n\\n\r\nThis show held my interest for all 12 episodes and I liked it's quick pace they made the show a lot less cringe inducing and the last episode was a solid way to wrap it all up although I'd be lying if I didn't say that the best part of the whole show was the 30 second sub story about the chick who's obsessed with Hitomi just for how unimportant and funny it is in comparison to the rest of the show and coupled with the fact that the end theme kicks ass that made this something that was probably my surprise of 2018.\\n\\n\r\n7/10\\n\\n\r\nOverall:\\n\\n\r\nThis show is hot garbage disguised as an ecchi heavy battle shonen that any self respecting person would stop watching after 3 episodes but since I'm a trash person with trash taste I managed to finish and enjoy it to some capacity but if we're being real it don't matter how much lewdness get's thrown your way you can't stop a bad show from being bad and this show is most certainly bad not so bad that it deserves a low score but not something I'll recommend to non action movie watching, Mountain Dew Chugging, Linking Park loving, Edgelord supreme's if you know what I mean.\\n\\n\r\n6/10",
            "date": "2018-03-31T20:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 276102,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871298.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/SamIHellaAm",
                "username": "SamIHellaAm"
            },
            "url": "https://myanimelist.net/reviews.php?id=276102"
        },
        {
            "content": "A mediocre experience from start to end. I had high hopes that this anime would bring something to the table but I was mistaken. The anime is full of fan service and fights which can be great in small doses but not the way Killing Bites utilizes it. The story was not worth noting either. If you have seen any show where the pit people against one another, then you've seen this before.\r\nIf a second season comes out, I might watch it just to see what happens with the universe with that they build. But I'm sure the story won't go much farther then pittinghuman/animals hybrids against each other for glory and money. \\n\\n\r\n- 7/10 Bloo",
            "date": "2018-03-31T15:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 275926,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440967.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NatoKenichi",
                "username": "NatoKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=275926"
        },
        {
            "content": "\"The one with the sharpest fangs wins.  That is what Killing Bites is.\" -Uzaki Hitomi.\r\nYeah so...that's said every episode whether you like it or not.  Think of it as the catalyst for the plot armor to activate.  I wish I was kidding.\r\nStory:\r\nFour powerful companies fight for power and control over each other.  In order to settle their feuds, the four companies have put funding towards therianthropes, people who've had their genetic code infused with that of an animal that allows them to transform into the biological weapons of the animal of their choice called Brutes (cause that's totally how genetic engineering works), participating in cockfightscalled 'Killing Bites', where the Brutes fight one another and the winner gets dominance over the other three companies as a result.  And so we find ourselves with Brute Ratel, a fairly unknown fighter who throws a wrench in the Killing Bites...and the guy who I guess is the main protagonist.\\n\\n\r\nAlright, not gonna sugarcoat this; Killing Bites is a glorified dick measuring contest disguised as a giant cockfight with the politics and warring powers who sponsor and host the Killing Bites acting as a backdrop to the whole thing and don't really matter.  The story features only one official \"Killing Bites\" match, featuring twelve participants who gloat so much about their supposed dominance to the point that when the show decides to give them each a pitiful excuse for a backstory to explain how and why these Brutes even went through with the therianthropy treatment to become the human/animal hybrids that they are.  Something that you end up not caring about cause it doesn't matter anyway considering prior to this knowledge, much of what you know about them is-\\n\\n\r\n\"I AM THIS ANIMAL.  I CAN DO THIS.  YOU CANNOT DEFEAT ME BECAUSE I CAN DO THE THING THAT THIS ANIMAL CAN DO.\"  Which doesn't really count for much cause you lose your impact when everyone fucking does this.\\n\\n\r\nBecause of how the show's structured, the story is mostly style over substance, utilizing the egos of Brute Ratel (Hitomi as she's called), the other Brutes, the members of each company...basically everyone but the one guy who's supposed to be the male protagonist of the show to enhance the viewing experience of the savage battle royale to make it feel exciting.  Which honestly kind of works, if only to make the show dumb fun.  Every aspect of the show is exasperated to the point that everything is so bullshit that it's more funny than anything, especially because the show has a dedicated narrator who explains animal facts like the Animal Planet so that the viewer is aware of each animal's parameters and why/how they're able to pull off the bullshit that they do, which isn't hard because the amount of things the show tries to get away with with is so out there that not even suspension of disbelief alone will get you very far.\\n\\n\r\nAs a show, Killing Bites is a show whose entire identity lies in how brutal its fights can be and how big of a dick everyone has from showing off their strength and proving that they're better than everyone else.  I'll give credit where credit is due, the show's actually pretty brutal.  And though from a narrative standpoint the show flops because the entire narrative is just a backdrop, it's at least fun enough to watch just to see the kind of bullshit that they'll do, cause bullshit can be fun if you're in the mood for it.  There're also a few weird tone shifts in the beginning episodes, and a major twist at the end of the series that's pretty \"What the fuck?!\", so watch out for those.\\n\\n\r\nOverview:\\n\r\n+ Savage as the box said it is\\n\r\n+/- Lots of things require suspension of belief\\n\r\n-  Gloating gets really old, really fast\\n\\n\r\nCharacters:\\n\\n\r\n\"The one with the sharpest fangs wins.  That is what Killing Bites is.\"  Yeah, even if you're sick of it, it's not gonna stop her from saying it all the fucking time.  Hitomi, or Brute Ratel, is a character that in four words, \"Doesn't give a fuck\".  As a human/ratel, or as it's more commonly known, the honey badger, Hitomi's defining trait is to get what she wants, pick fights with anyone who doesn't agree with her, and threatens to kill said person who doesn't agree with her.  She is the human embodiment of the honey badger, which as amusing as it is, makes her a terrible character.  Though her personality doesn't come into play so much as the amount of plot armor that she has, which weirdly enough is validated enough that I feel does get a pass in the realm of bullshit.  Cause honey badgers are basically nature's middle finger, capable of fighting predators many times larger than itself, shrug off cobra venom, and survive gunshots if shot in the wrong place, which only makes them angrier.  It is because of this quality that makes Hitomi such a weirdly polarizing character, in that everything does make enough sense when put in context, but it's still bullshit.\\n\\n\r\nNomoto however is one of those characters you really can't make a positive case for.  The guy's spineless and just ends up being dragged through everything that happens in the show, having little to no impact to the overall plot cause he quite frankly doesn't want to be in the world of illegal human/animal cockfighting and doesn't really make much of an effort to escape or man up, which in the one scene he tries to make an effort ends up getting shot down cause the show always wants him to play the beta male, which becomes even stranger with the weird buildup at the end where he's put into the spotlight which, prior to that, was someone who had almost no reason to be in this show in the first place.\\n\\n\r\nOther characters don't really matter.  The Brutes themselves all have a pretty simple and self-explanatory backstory that you probably won't care about cause they take all but five to ten minutes to explain with very little impact to your feelings towards them because half of the time they're gloating about how strong the cobra, the tiger, the alligator, (insert another animal here) is before getting an arm or a leg chopped off because they didn't pay enough attention in zoology class to know that their opponent's animal is capable of doing such a thing.  In the same vein as that, the company heads don't matter in the slightest and their power war is basically irrelevant.  The only other character I would say matters in this show is Dr. Shidoh, Hitomi's guardian who acts more like a plot device cause despite what everyone in the show says, he doesn't actually do anything and only serves to advance the plot vaguely towards a penultimate thing that leads into the next arc that we'll probably never see unless we get a sequel.\\n\\n\r\nOverview\\n\r\n+ Characters are...entertaining\\n\r\n-  Male MC is pretty useless the way through\\n\\n\r\nArt:\\n\\n\r\nOn the topic of art, what Lidenfilms ended up producing is honestly not all that interesting to look at.  The show at most looks average, and the quality of the show itself is far from anything strikingly appealing to look at.  It also doesn't help the fact that most of the show takes place at night, so that in and of itself makes everything that much harder to see, especially because about half of the fights take place in near darkness, and seeing only the glowing eyes of the characters isn't great.\\n\\n\r\nThe fight scenes however were honestly what I expected, and then some.  The fights are very messy and brutal in nature, constantly filled with injuries and bloodshed from the savagery of these people fighting which honestly was the best part of the entire series.  Cutting off limbs, pouring out pools of blood; the show didn't shy away from being as gruesome as it could possibly be, and that's something that I can give the show credit for because it at least proved that it could be as unforgiving as nature can be.  Though can I just take a moment to say how dumb the names of their attacks are?  Slash.  Freaking...\"Slash\".  Like come on, you can come up with something better than that.  A seventy power a hundred accuracy move is not cool a enough name to say when you're cutting some poor fucker's arm off.\\n\\n\r\nI also find it weird, but not at all surprised that the designs of the Brutes are what they are.  Because this is Japan, the girls end up looking like Kemonomimis primarily looking human with a few animal parts when transformed, while the guys pull off a complete transformation and look like a bipedal version of the animal of their choice.  And Hitomi fights wearing a white tank and her underwear.  Truly this show would not be complete without its fanservice.  Clearly.  It's also worth noting that two brutes in the series are rendered in CG in, which is glaringly obvious when they show up on screen.  Thankfully it's not overly jarring, so it's at least acceptable to an extent.\\n\\n\r\nOverview:\\n\r\n+  Gruesomely good fight scenes\\n\r\n+/- Fanservice designs?\\n\r\n-  Terrible attack names\\n\\n\r\nSound:\\n\\n\r\nFripside's \"Killing Bites\" is really what you would expect from the band.  Most of their work is very samey sounding, and listening back to both Clockwork Planet and Black Bullet gives me the same feeling as I get from listening to the other two, though personally I prefer those two to what Fripside has done here, so I regard this OP as inferior in comparison.\\n\\n\r\nKitsunetsuki's \"Kedamono Damono\" on the other hand is a pretty generic rock song with a numerous amount of guitar rifts to give it flair between the lyrics.  I'm not really feeling this one either, and the entire OST by itself is not really all that exciting if you ask me.\\n\\n\r\nPersonal Enjoyment:\\n\\n\r\nHonestly I think I enjoyed this show a hell of a lot more than I ever should have.  I partially blame this on the fact that I generally go with the flow on things, and since everything here was a big case of \"Just go along with it\", I think that's the reason why I'm able to sit here and say that I liked the show simply for its dumb fun.  And that's saying something with the amount of crap they try to pull with the amount of abuse any of these animals can take without dying, cause some of those 'nonfatal' wounds are very clearly fatal, especially from the blood loss of severed limbs.\\n\\n\r\nI also want to point out that they have a character who looks like fat Wolverine with a puckered butthole for a mouth.  Which that to me is hilarious cause I could not go one scene without laughing with him in the picture and take what he was saying seriously.  Not like I was doing that in the first place, but you get my point.  (No his animal is not a wolverine, no matter how great that would've been.)\\n\\n\r\nNow the question is...should you watch this show?  Personally...no.  I mean unless you want to kill some time and watch something stupid, then no.  There's honestly nothing of value to be had watching this show aside from dumb fun.  I just watched it out of morbid curiosity and I ended up having way too much fun with it cause I've reached the point in my life where anything can get a laugh out of me.  I guess another reason would be...if you want to watch a nature show but you also want to watch anime, this could be that niche you're looking for.  A very odd niche, but one I'm sure exists...somewhere.",
            "date": "2018-03-30T15:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 275793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=275793"
        },
        {
            "content": "A very bland plot, and like a majority of ecchis, it relies heavily on unnecessary fan service. The premise of it sounds cool, animal/human hybrids put into a death battle tournament. But, the way it's executed is very poor. \r\nIn short, imagine the characters from Terra Formars, only they're all Sekirei characters (with some overly muscular men thrown into the mix) and they fight each other with no character development at all.\r\nIt's furry fan service with fights every now and then.\r\nSo, if you're looking to whack it off to scantily clad animalistic girls duking it out, this is the perfect anime for you. Otherwise, I'dgive this anime a pass.",
            "date": "2018-03-26T23:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 275277,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6930425.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Calherbie",
                "username": "Calherbie"
            },
            "url": "https://myanimelist.net/reviews.php?id=275277"
        },
        {
            "content": "Don't get me wrong, this anime is trash, it cliche, a bit pervy at times and the characters are just shells.\r\nOkay so maybe a bit more than pervy, since at one moment 2 characters litterly fuck, because they are under the influence of pheromones, and they don't beat arround the bush either,  they FUUUCK.\r\nBut the overall enjoyment level of this anime is high, something about it makes me hypes when i see a new episode and just enjoy the living shit out of it. \r\nI get that most people dislike this anime, and you know what? They are probably right, but man oh man,do i enjoy it. \\n",
            "date": "2018-03-23T04:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 274644,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7082338.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Ardawen",
                "username": "Ardawen"
            },
            "url": "https://myanimelist.net/reviews.php?id=274644"
        },
        {
            "content": "The one with the sharpest fangs wins, Thus Killing Bites - Manga catchphrase\r\nThe one with the sharpest fangs wins, thats what Killing Bites is - Anime catchphrase\r\nboth catchphrases are annoying and dont work well in the contexts they are used(most of the time). Now on with the review\r\nStory: \r\nWell there this guy who joined a group of R**ists. The girl killed them all but him, had him drive to her to a fight where she turned into a hybrid monster/human to fight another Hybrid. Then as a result she stays with him and she fight Hybrids while he pees his pants. Thats about it forstory. (oo yeah and theres something about 4 factions using hybrid fights as a proxy wars with eachother)\\n\\n\r\nArt: \\n\r\nThey call this an ecchi but for the most part you just see the main girl Hitomi in her panties, theres also some nipple action like two times but thats about it. Otherwise the art style is standard for 2010s art styles.\\n\\n\r\nSound: \\n\r\nThe OP and END are both very good everything music wise is great (lots of metal) Sound effects are also very on point, mixed with some(ok) animal roars.\\n\\n\r\nCharacters: \\n\r\nHitomi - Shes a BA highschooler whos not afraid of anything and is extremely cocky. (also shes the one who uses the catchphrases above)\\n\\n\r\nYuuya - one of those generic weak will main leads who did actually wet himself in the beginning and doesn't get much better throughout. He is a follower not a leader, and he does whatever people tell him to do.\\n\\n\r\nfatguyWholookslikewolverine - He is weak, and his will to fight is low. However he is almost like a house maid.\\n\\n\r\nEnjoyment: \\n\r\nSince this is an anime about fighting its terrible only the very first fight is good. While it and all the others are interrupted by explanations on what attack or what animal a hybrid is, or by Yuuya being a baby while watching. If you enjoy seeing girls with fur and animal ears fight this could be for you.\\n\\n\r\nOverall: \\n\r\nThere's nothing really interesting here other then half animal girls and some meh fights.",
            "date": "2018-03-08T13:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 273350,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5021906.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/TheRedLine",
                "username": "TheRedLine"
            },
            "url": "https://myanimelist.net/reviews.php?id=273350"
        },
        {
            "content": "For those who are thinking of watching it, be aware that this is more of a furry fan-service anime. Honestly, it has a decent bgm and the plot had something going (yeah not anymore) but, but it reeks of unnecessary fan service and eroticism. Which pretty much overshadow its very few redeeming qualities.\r\nHitomi, our main female protagonist is basically a craze-fighting lunatic, who has a fetish for a heartless mad scientist and is a free ticket to jail (as despite her appearance she is in high school fighting in a game for adults). Which pretty much put our other main protagonist in danger of beingsent to jail, as he is a freakin' college student. \\n\\n\r\nWell, no worry because it wouldn't be a concern to our main hero, as there is little to no development between any of the characters, except for a few perverted antics for our pleasure-seeking brethren. \\n\\n\r\nAside from all the unnecessary fan service and eroticism and almost zero characters development, this train-wreck of an anime provided me. I can't put help feel annoyed whenever I hear Hitomi yell out her retarded one-liner in every freakin' fight she gets herself into. If your interested pull out a clicker and count how many time she says her stupid one-liner at the end of the season.",
            "date": "2018-03-05T11:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 273097,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7032670.jpg",
                "scores": {
                    "animation": 0,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Amaikaze",
                "username": "Amaikaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=273097"
        },
        {
            "content": "This is a three out of 10 for me\r\nI liked it because there was going to be fanc service of hot girls in furry outfits and  kicking ass.  But, sadly, it became boring. Watch this if you want to see it as a background and when there is a hot scene coming, turn your eyes and see some hot scenes of hot girls kicking but and looking sexy.\r\nStory about a battle royale on who is best fighter and everyone wants a piece of the main character. She  is strong and can act girl at times but  it seems like the storyis just basic writing and not to be taken so serious. \\n\r\nThe main dude is a jerk but he isn't, you know?  No one is shipping them so that's okay. Other characters were just lame and their deign bored me.\\n\\n\r\nIf your a teenager and new to anime, you'll like this then ^^\\n\\n",
            "date": "2018-10-08T08:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 291254,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5968825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Evangelion90",
                "username": "Evangelion90"
            },
            "url": "https://myanimelist.net/reviews.php?id=291254"
        },
        {
            "content": "Warning possible Spoilers\r\nGoing into Killing Bites, I wasn't expecting a lot, which didn't surprise me when I thought it was in the meh area after finishing it. A story about humans that can morph into animals did sound interesting, but the execution of it was pretty bad.\r\nStory (5/10)\r\nThe story starts when Nomoto Yuuya encounters a girl called Hitomi Uzaki, who has the animalistic powers of a Honey Badger. After being saved by her Nomoto has been assigned to stay close to her, for his own protection.\r\nThe show starts off pretty boring, as we get introduced to the characters whilst also having a few fights withother people with these powers. We do get an explanation for what these people are used for, which is for a battle royale type tournament where 4 separate houses use their therianthrope's to battle it out till someone wins.\\n\r\nPretty much from episode 4 till the very end, the show concentrates on the tournament. I did like how the game worked, it had a mixture between chess and battleships although it was pretty annoying how the show started forgetting it's own rules as the tournament went on.\\n\r\nI thought the fights were pretty cool, but they were quite short and were often interrupted by some other character until the final fight which was the highlight of the show for me.\\n\r\nThere was also a lot of info on the animals the characters possessed, I'm unsure if all the info is true (probably not), but it was still interesting to know the strengths and weaknesses of these animals.\\n\r\nWhen it came to the ending, I didn't know whether to be surprised or angry, because it turns out that there was a coup going on the entire time so a bunch of the higher people died, but not only that Nomoto ends up getting the short end of the stick at the end too which surprised me too and then we end on a cliffhanger for whenever a second season will come out.\\n\r\nYeah the ending just didn't feel deserved after the tedious trek to get there.\\n\\n\r\nCharacters (5/10)\\n\\n\r\nThe characters weren't anything special, they just had the usual cliched tropes I've seen a bunch of times although there were a few good moments with them.\\n\\n\r\nHitomi is kinda your typical bloodthirsty type Tsundere, who will pretty much get pissed off if you question her even a little bit unless you give her something honey related then she'll become  a sweet girl. She is very determined when it comes to fighting against her opponents and never gives up, even if she loses an arm, but it gets kinda annoying when she says her catchphrase every goddamn episode sure every so often is fine, but every episode just makes the catchphrase boring. She can be a curious person too when she experiences new things and despite being a bloodthirsty Honey Badger she does spare a few lives sometimes.\\n\\n\r\nNomoto is probably one of the most unnecessary MC's I've ever seen, I thought Harem MC's were boring, but this guy is right up there with therm. He really had nothing interesting about him, other than that he cowered in fear most of the time, then again considering the mess he was dragged into I wouldn't blame him. Even though I say he is a boring character I still think he didn't deserve what happened to him at the end.\\n\\n\r\nEruza is a cheetah of a rival house, she was a playful character and quickly grew to like Hitomi despite being enemies. Other than being a badass fighter she really didn't have much to show when it came to characterisation.\\n\\n\r\nUi is a rabbit, who ends up getting caught up in this mess much like Nomoto, surprisingly enough she is my favourite character, then again that could be due to her cuteness factor and considering the situation the urge to protect the cuteness was strong with this one. She isn't strong when it comes to fighting and all she can do is either dig or run, but her luck in the whole tournament is extraordinary since she is the one who wins the whole thing which actually made me happy as the weakest character won the whole thing.\\n\\n\r\nArt (4/10)\\n\\n\r\nKilling Bites is not a good looking show and it really shows too in certain scenes. That doesn't mean all of it is bad though, the different forms of the therianthrope's looked pretty good and there was a wide variety of choice for the animal powers they had. It's just kinda boring how must of the show is set in one location that consisted mainly of 2-3 areas, hell we were in that area with deserted buildings for like the entire second half, it got very boring looking at the same place for a while.\\n\r\nI also have to mention the atrocious CGI, it looked nasty, but luckily it was only used for specific characters and wasn't around often.\\n\r\nThe characters looked pretty generic too, I mean considering how many anime's there is it's going to be difficult thinking up new looks for characters, but I got nothing from these guys. Also the way Hitomi's hips looked were pretty ugly too, not sure if it's just me, but her hips just didn't look right.\\n\\n\r\nSound (6/10)\\n\\n\r\nThe sound is actually one of the better parts of the show, the OP was generic as hell, but the ED and the ost was actually ok. The rock based music actually fitted well for animalistic tone the show was going for and it made the battles much more fun to watch.\\n\\n\r\nExtras:\\n\\n\r\nSince this was mainly a battle royale type show, there was a lot of action in it. I thought the action was pretty good especially during the final battle which was actually quite tense, but a lot of the earlier battles felt a little quick while some just dragged on because of other characters interrupting the current fight. However this show definitely fits the right areas for someone who loves watching action and will probably come out of this happy.\\n\r\nEcchi has started to become something that needs to be used in the right way whenever it appears in the show, this is one of those times where it made me feel both uncomfortable for certain scenes and kinda aroused for others. The amount of forced rape moments was pretty high and made me feel very uneasy especially when one of the characters couldn't escape from it, but the moment between Hitomi and Eruza when they were influenced by a hormonal gas was pretty steamy, yet the amount of nudity was very low despite the revealing outfits for the female characters, there was actually only one scene throughout the whole thing where we saw bare breasts and that was very early on, so the amount of Ecchi despite being mixed for me was actually a lot lower than I expected.\\n\\n\r\nEnjoyment (4/10)\\n\\n\r\nAside from the battles and a few characters I was more bored than excited with this show, plus the ending felt more annoying than an actual decent payoff.\\n\\n\r\nOverall (5/10)\\n\\n\r\nTrue this isn't the worst thing from 2018 I've seen (that goes to A.I.C.O), but it isn't far off. At least the action wasn't disappointing to the point where I felt like dropping it, but if this does miraculously get a second season then hopefully it will be better than what we got.",
            "date": "2018-05-24T09:21:00+00:00",
            "helpful_count": 0,
            "mal_id": 281297,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=281297"
        }
    ]
]