[
    [
        {
            "content": "It is my first review, so don't go harsh on me.\r\nSo far, this anime has been funny. The references they make are funny, even if I don't get it. As well, the Ending song will be stuck in your head. This anime does what the synopsis says. Its just girls talking about stuff really. The characters are cute too.",
            "date": "2012-07-16T14:04:00+00:00",
            "helpful_count": 179,
            "mal_id": 66755,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1156283.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MFK",
                "username": "MFK"
            },
            "url": "https://myanimelist.net/reviews.php?id=66755"
        },
        {
            "content": "So, here I go with my first review.\r\nJoshiraku is not the typical moe anime due to the fact that it was created by Kohji Kumeta. For those who are not aware of Kohji Kumeta, he is the person behind Sayonara Zetsubou Sensei. This work is different from SZS because the girls of Joshiraku are just cute rakugo girls, unlike the students at SZS, where everyone has a certain disorder, if you can put it in that way.\r\nThere is this notion hanging above my head once I watch Joshiraku: \r\n\"This anime is full of ordinary dialogue so that the viewers can fully enjoy how cute thegirls are.\"\\n\r\nIn fact, that sentence can summarize how many people would view the anime, but the hidden genius of the anime lies in the dialogues. A hodge-podge of references, parodies, and comic reliefs have given Joshiraku the atmosphere of watching Lucky Star blended into SZS. Be warned though, many of the puns are Japanese references, so if you're watching a subbed episode, go for gg Fansubs, for they have translation notes (you can just google it).\\n\\n\r\nStory: 8/10\\n\r\nWhat is the Story? A typical person may ask after taking a glimpse at Joshiraku. As I stated earlier, Joshiraku is about five rakugo girls discussing random topics, which typically drifts away until the original topic is buried. Though, this must not deter you from watching it, for it is hilarious nonetheless.\\n\\n\r\nArt & Sound: 7/10\\n\r\nJ.C. Staff has somewhat neglected it, though it should be noted that they're putting a lot of effort in Little Busters! ( three episodes of LB has been released as of the time of writing of this review), but the art used in the anime is quite similar to the manga.\\n\r\nAs for the sound, I find it lacking in the way that it needs more than just dialogue and background noise. Overall, I have no major criticism of the Art and Sound.\\n\\n\r\nCharacters: 9/10\\n\r\nThe standout character for me is Kukuru. Even though the rest have those moments of brilliance, I feel that Kukuru's dark humor and paranoia has twisted the series in a way that it is genuinely enjoyable.\\n\r\nSome characters which appeared only as a part of parody can only be described as awesome. Case in point, in episode five, where there is a parody of Japan's former PM. Also, the way that the characters bash their own producers is brilliant, like how Marii made a pun about J.C. Staff and their rivals (KyoAni).\\n\\n\r\nSo, another work of Kohji Kumeta gave me the sense of humor not usually found in many comedy-themed anime. For those who enjoyed Sayonara Zetsubou Sensei, don't worry about the overall appearance, for it still has the great humor found in a work of Kohji Kumeta. Also, this is a must-watch for those who are looking for anime which reflects the dark and humorous side of life.",
            "date": "2012-10-30T21:18:00+00:00",
            "helpful_count": 85,
            "mal_id": 76319,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1408161.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Win_Zero",
                "username": "Win_Zero"
            },
            "url": "https://myanimelist.net/reviews.php?id=76319"
        },
        {
            "content": "\"Which do you prefer? Left or Right? Me...I prefer down...I like to look down.\" Kukuru. Joshiraku was my surprise hit of the 2012 season and honestly I'm surprised that I have not seen more love for this series. This show isn't about being a politically correct melodrama that'll make you shed a few tears for the beautifully crafted characters...It's just FUNNY! Kouji Kumeta's stories are supposed to be taken with an open mind and if you are willing to come at this series willing to make fun of anything then this series will have you looking at the world in a whole different light. \r\nStory:The story really isn't linear whatsoever and is more like random pieced together small stories (as it was in the manga), something that I would say is akin to Nichijou's story. I find it hard to really judge how to review the story other than by looking at each 1/3 episode as an individual story. From this perspective every mini story has an effective tale that never feels cut short (unless the humor is that the story is cut short) and everything in them has a purpose (even if that purpose is to have none). 9/10 \\n\\n\r\nArt: My only complaints that I really have with the series is that it is obvious that J.C. Staff didn't put a lot of effort into the artwork of this show. Which makes sense because with Little Busters! coming out the next season (A show that could literally make or break that company) the logical conclusion is that this show was just put on the back burner. It's not bad per say, it just doesn't have that same artistic flair that the other Kouji Kumeta's adaption had (although not every show can be animated by SHAFT). 6/10 \\n\\n\r\nSound: I thought that the OP does it's job, in that every week I heard it at the beginning of the show I got excited to watch the show. It doesn't necessarily have the stand alone value as a good song that I'd put on my iPod , but it is catchy nonetheless. The ED is also hysterical if you know the story that is behind the lyrics of the ED. If you don't know I'd suggest that you go look it up (Valeraku, gg's translator for the series, actually has pretty good translation notes). Finally the backdrop music throughout the show seems very fitting to the series and at times can add to the comedic depth. 9/10 \\n\\n\r\nCharacters: The main pinnacle of any of Kouji Kumeta's work, beside the sea of references, has always been his characters and the characters of Joshiraku are only a brilliant illustration of that. Kukuru and Marii are both two characters that I feel have absolutely no character archetype I can pin them to and it helps solidify their originality. I thought that Kigu was just there to actually be one of the \"cute girls\" at the beginning of the series, but the depth that gets added to her later in the series (listening to death metal music and going on malicious explicit rants in her head) made her one of my favorite characters of the Summer 2012 season. And that perfectly illustrates what makes these characters so fantastic is that they are so unpredictable that their humor can get you from literally anywhere. 10/10 \\n\\n\r\nSo you're not Japanese: One of the biggest problems that many people have had with this series is the fact that if you aren't from Japan then most of the humor will go right over your head. And to be honest that isn't a false statement because Kouji Kumeta's audience is Japanese and he doesn't really care to internationalize his work (and why should he?). However if you feel like you're getting lost then just pick up the translation notes that Valeraku posts and learn them. This isn't a series that you can come into without willing to put in a little work, but I guess in today's anime community people are too lazy to do that. I think it's kind of like reading Beowulf, even if you speak English you'll still need a comprehensive study book just to be able to understand half of it. I really am thankful to gg for making this great work accessible to other people, but if you want to have the full experience you have to put in a little bit of work. \\n\\n\r\nThe reason that this series is rated so high for me is the simple fact that it is so incredibly entertaining. Every week I got this show onto my computer I was literally splitting at the seams from the humor. I wouldn't suggest this show to everyone because frankly not everyone will like Kumeta's offensive style of humor, but people who are cynics like me will absolutely love it. If you're reading this review wondering if you should watch this show, then I highly suggest that you at least give it a try.",
            "date": "2012-09-30T12:56:00+00:00",
            "helpful_count": 49,
            "mal_id": 73739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1300063.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MadScientistJ",
                "username": "MadScientistJ"
            },
            "url": "https://myanimelist.net/reviews.php?id=73739"
        },
        {
            "content": "(may contain minor spoilers)\r\nYOSH! Slice of Life Comedy review here we go!\r\nJoshiraku is an anime adaptaion of a manga from the same creator of Sayonara Zetsubou Sensei.\r\nNow now, I found this anime by chance but as an avid fan of comedies I couldn't ignore it. \r\nJoshiraku is quite the interesting and funny anime. Be it the interactions between the characters, the parodies or the \"breaking of the 4th wall\" thingy.\r\nLet us begin\r\nStory:\r\nAs a slice of life comedy anime, it doesn't have a specific plot nor anything serious. It does, though, have continuity. Meaning that what happened in an episode will \"affect\" the future ones, whichis good.\\n\r\nPersonally, I find the comedy throughout the show quite good and enjoyable, although it may not be for everyone. Even so, it will definitelly find a way to entertain you and make you laugh.\\n\r\nWith all that said, the story gets an 7/10.\\n\\n\r\nArt/Animation:\\n\r\nThe art is quite good and fitting. Each character is easily identifiable by it's characteristics/colours and are drawn nicely. Same with the colourfull backgrounds (not that there are many but still xD).\\n\r\nThe animation quality is definitely good. All the characters move fluently and I failed to notice any moment in which such quality dropped.\\n\r\nArt/Animation gets an 8/10.\\n\\n\r\nSound:\\n\r\nWoo! Great! The Opening and Ending are great and I got addicted to them >.>\\n\r\nBesides that, the bg was fitting and I didn't notice any problems with it.\\n\r\nSound gets a 9/10\\n\\n\r\nCharacters:\\n\r\nThe big point of the show, as it focuses on the interaction between these. Joshiraku has a small cast of characters, each with it's own traits and characteristics that complement each other nicely.\\n\r\nNothing special to say about them, the characters are not at all unique but good and each of them is important for the show as they are. I can't imagine Joshiraku without any of them.\\n\r\nCharacters get an 8/10 'cause quite like them and I can.\\n\\n\r\nEnjoyement:\\n\r\nHell, did I have fun watching this. I sure did! I watched some of the episodes more than 3 times already. What can I say, personally it was one of the best comedy shows I've seen.\\n\r\nEnjoyement gets an 9/10\\n\\n\r\nOverall:\\n\r\nJoshiraku is a quite entertaining anime. The art and animation was good and the OP and ED will get stuck in your head for a while. It's not the best comedy out there but surely enjoyable and worth the time spent watching. One title I would recommend to comedy fans out there.\\n\r\nThat said, and Overall classification of 8.\\n\\n\\n\r\nHope this is usefull\\n\r\nThank you :)",
            "date": "2014-11-16T11:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 168837,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1430267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Panda_Hero-",
                "username": "-Panda_Hero-"
            },
            "url": "https://myanimelist.net/reviews.php?id=168837"
        },
        {
            "content": "First of all, English isn't my mother language so forgive if I do some harsh gramatical erros. \r\nStory(?)/argument\r\nJoshiraku is the other manga Kohji Kumeta is writing... Assuming most of you have watched Sayonara Zetsubou Sensei, this new manga/anime can be quite a shock on the first episode specially due to how cute everything is and how charming (if not moe) the girls are... but as almost everything Kumeta does, this traits are quite deceptive. If in Sayonara Zetsubou Sensei every chapter had an steady progression towards the punchline or \"the joke\" at the end of the episode, joshiraku completely lacks this: the humour is quitesmooth and everything is less progressive and more spread. In the end it does superficially suits that remark at the beginning of the series:\\n\\n\r\n\"This anime/manga is full of ordinary dialogue so that viewers/readers can fully enjoy how cute the girls are\"\\n\\n\r\nDECEPTION. Just like this statement, almost all the humour and social criticism is hidden and concealed. As everything it's treated in the same way as almost all of those \"moe girls start talking\" anime (Ex: Lucky Star, K-ON, etc) It's more atractive to the mainstream public than Sayonara Zetsubou Sensei. This could be the main reason Kumeta went with this setting: to attract more readers... but don't worry, The core that made Sayonara Zetsubou Sensei such an innusual and genius work it's still there so you won't be dissapointed\\n\\n\r\n-------------\\n\\n\r\nArt:\\n\\n\r\nThere isn't much to talk about the art of the show: 90% it's on the backstage of a theatre in which the girls work as comedians. Besides, The animators mimic the drawing style of the original manga to the root.\\n\\n\r\n-----------------\\n\\n\r\nAlmost every other thing is irrelevant to the action onscreen. The only thing that can be considered aside are the opening and the ending sequences but I won't review those mainly because I'm not qualified to do it properly.",
            "date": "2012-07-31T03:30:00+00:00",
            "helpful_count": 18,
            "mal_id": 68229,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/259643.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/OVanBruce",
                "username": "OVanBruce"
            },
            "url": "https://myanimelist.net/reviews.php?id=68229"
        },
        {
            "content": "What to say about Joshiraku, this is a tough thing to answer. It's basically \"Translators note\" the anime. \r\n-Story is what you expect from an SoL comedy.\r\n-Art is basic fair with basic character art and pretty good backgrounds. Nothing less from J.C. \r\n-Sound is great. I fucking love the OP, if that means anything...\r\n-Characters are characters\r\n-I enjoyed this series as much as a baka gaijin such as myself can. A lot of the humor is the miss due to culture differences. It's the type of anime that doesn't really need popularity outside of Japan. \r\nOverall I can recommend this anime to anyone and I canhighly recommend it when you have some actual knowledge of japan outside of using choice words like \"Kawaii\" and \"desu\" and only really knows what they do from anime and dramas.",
            "date": "2013-10-15T19:29:00+00:00",
            "helpful_count": 8,
            "mal_id": 117005,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2493269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wizardducklett",
                "username": "Wizardducklett"
            },
            "url": "https://myanimelist.net/reviews.php?id=117005"
        },
        {
            "content": "Today was finally the day when i wasn´t able to suppress my desire to review Joshiraku anymore. A show that fascinated me in a very unique way: Joshiraku is great by intentionally beeing bad. I know you probably already think i´m a jerk and stopped reading by now, but i will finish this anyway...\r\nJoshiraku is a 13-episode comedy released by JC Staff in the summer of 2012. While i wasn´t expecting much out of this initially, it became  one of the biggest pleasant surprises of the year for me. Every single episode made me laugh out loud while at the same time captivating mewith it´s tremendous creativity. The writer´s bravery to take risks is also worth mentioning, as Joshiraku does not take itself serious whatsoever and purposely makes every single mistake that killed other shows in the past. All we get to see is five girls who are totally  aware of the fact that they are animated characters in a TV show discussing the most uninteresting topics u can imagine while  constantly breaking the fourth wall...and it is HILARIOUS.\\n\\n\r\nFurthermore, the show openly states that it is \"full of dialogue so the audience can fully enjoy how cute the girls are\" (they aren´t cute...) and even introduces a new character in the final episode only for the others to \\n\r\nrant about how stupid the writers must be...\\n\\n\r\nOverall, this is a wonderful comedy show because it does not try to be anything else but a comedy show. It´s a heavily dialogue driven, fast paced in your face  gag firework with opening and ending sequences so annoyingly addictive that they will haunt you in your dreams. And which other show will introduce us westeners  to the traditional japanese art of rakugo theatre? So love it or hate it...but watch it first!\\n",
            "date": "2015-03-14T16:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 182350,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486543.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PhKay",
                "username": "PhKay"
            },
            "url": "https://myanimelist.net/reviews.php?id=182350"
        },
        {
            "content": "First off, if you don't know a lot about Japanese culture, you'll be very confused.\r\nSecondly, if you don't speak Japanese, a lot of the puns will fly over your head (though the fansubs certainly do their best to localize it).\r\nIf you'd rather not bother with Japanese cultural references, you're probably better off watching Nichijou. If you are interested, however, in talk about places such as Tokyo Tower and Skytree or references to Japanese politics in combination with wacky one-liners, you might like this anime.\r\nI personally am enjoying it a lot, but honestly, around half the bits I thought were funny will probably not be understoodby many Western fans, not to get all condescending about it. Those learning Japanese should definitely check it out, as it's heavy in wordplay and Japanese humor!",
            "date": "2016-03-21T21:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 213583,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731968.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RilakkuLina",
                "username": "RilakkuLina"
            },
            "url": "https://myanimelist.net/reviews.php?id=213583"
        },
        {
            "content": "Joshiraku is an anime about the lives of five rakugo comedian girls. Instead of focusing on the girls rakugo performances, the show reveals what happens off stage and various things that happens in their day-to-day lives. \r\nYou would see this sentence being repeat throughout the show: \"This anime is full of ordinary dialogue so that viewers can fully enjoy how cute the girls are\". This quote highlights the main attraction of the anime: it's dialogue. The show has the ability to turn everyday, trivial matters into something that is absolutely hilarious and even sometimes philosophical. Seeing the interactions between these girls are entertaining. Just likein real life, while you are talking with someone, sometimes, you would wonder: how did our conversation end us on this topic? That is exactly the experience of watching Joshiraku, the character would ramble on things, whether it being a thoughtful discussion on today's politics or a lamentation on their horrible childhood experiences, and spice things up with humor. Now, the humor part of this show might cause some people to dislike it. A lot of the humor in this show involves references, whether that be an homage to another anime show or current events in the Japanese society. A good amount of the jokes are culturally specific to the otaku and the Japanese culture, which might be a barrier to some people watching this show to not get what's so funny. I'd say also as you're in touch with the otaku culture, you should be able to enjoy most of the content in this show. As for me, I had a great time with it.",
            "date": "2016-12-02T06:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 234744,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5550661.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SHivayogimaTH",
                "username": "SHivayogimaTH"
            },
            "url": "https://myanimelist.net/reviews.php?id=234744"
        },
        {
            "content": "Ahh, Joshiraku. A series that initially I was skeptical about watching, knowing nothing about Rakugo. Surprisingly, not knowing anything about Rakugo did not matter. The series more so uses pop culture, environmental  or political humor more than it addresses anything about Rakugo. The characters are marvelously crafted. Each is assigned a niche essentially that they play quite well and throughout the series, build on. The visuals are clean and clear, the music especially the ending, is addicting, and its overall a very enjoyable anime. \r\nIts worth pointing out however that a lot of jokes in the series rely on Japanese puns and Japanese politicswhich would make no sense to someone not familiar with either,  like myself. \\n\\n\r\nIf you want something fun, overall positive, and different to watch, I strongly suggest giving this a try. \\n",
            "date": "2018-07-30T22:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 285209,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3325791.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/QuarryQuake",
                "username": "QuarryQuake"
            },
            "url": "https://myanimelist.net/reviews.php?id=285209"
        },
        {
            "content": "Man always strives for a challenge. Climbing Mt. Everest, landing on the Moon, and finishing Joshiraku are some of the arduous accomplishments ever achieved.\r\nThe show is mislabeled as a \"comedy\". If puns and cultural jokes are all you have to lean on; hire a writer. Don't be so proud that you can't dismiss your own faults. The only thing more revolting than the jokes are the dorks that pretend this is funny because they want to be weeb level 1 million. I understood a couple of the puns in Japanese and they weren't good. I pretty much have a PhD in Dad Humor. Timing anddelivery is everything in these types of jokes. The words themselves don't make it funny. \\n\\n\r\nI think this is a type of \"going outside simulator\". This is appealing to people who are incredibly bored and are not happy with life because they choose to do nothing with it. This is saying a lot because nothing happened; EVER! This may be used as a way to waste time. There was an ever looping joke(?) that was a screenshot to tell us that \"This anime is full of ordinary dialogues so the spectator can really enjoy how the girls are cute\". There is enough source material to make a second season; do you know why they didn't make one? Because it is poorly constructed and it wasn't well received in Japan because the Japanese didn't even find their own cultural jokes funny.\\n\\n\r\nThis show is a 2 because of 3 reasons. Kigu is a palatable character and she made me smile a couple times. I like how she is borderline clinically insane. The dark thoughts and rock jokes got old, but that is par for this show anyways. The music was decent. I like the opening and closing songs quite a bit. I downloaded them and I blast them at the gym. The last reason this isn't rated at a 1 , even though the first word I would use to describe it is \"appalling\", is because I hate Girls und Panzer and I wish for that to be my only 1 and dropped series. Hooray victory by default!\\n\\n\r\nThe floating bare ass in space is symbolic for what this show is.\\n\\n\r\nI recommend this show to people who want to cut themselves, but are aware that cutting is socially unacceptable. Dear contemplating cutters, now you can hurt yourself equally while no one will be none the wiser.",
            "date": "2016-03-18T20:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 213292,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4670871.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Midg3tLuv",
                "username": "Midg3tLuv"
            },
            "url": "https://myanimelist.net/reviews.php?id=213292"
        },
        {
            "content": "\"This anime is full of ordinary dialogue so that the viewers can fully enjoy how cute the girls are.\"\r\nThat literally sums it up.\r\nAt least, that's what I would say if it actually summed it up.\r\nThe dialogue is anything but ordinary-- the things they talk about are absolutely hilarious and I found myself almost bawling from laughter very often. All the characters had very different personalities, and, as the above statement said, are all really cute.\r\nStory: 8/10\r\nI was first introduced to Joshiraku through an osu! song- the ending theme, to be exact. It was a great, fun song, and the anime looked good, so I decidedto check it out. It's about five rakugo girls (and a mysterious mask...) that discuss random topics. Usually, they drift away from this topic until they're up to something completely different.  It's always hilarious. However, there are loads of Japanese inside jokes/puns that you probably wouldn't understand. I recommend 'gg subs' (I use KissAnime to watch it), because they make it very easy for you to simply look up what certain things mean.\\n\\n\r\nArt: 8/10\\n\r\nThe anime's art is pretty similar to the manga. Very cute, obviously. I like how they've done it, because anything more detailed would ruin the theme of the anime, in my opinion.\\n\\n\r\nSound: 10/10\\n\r\nOkay, I know what you're thinking-- \"10/10?! Isn't that a little far-fetched?!?!?!\"\\n\r\nYes, probably.\\n\r\nBut, taking in all aspects- the opening is amazing, and I have the ending downloaded onto my phone. I know most of the words from listening and singing along on repeat. IT'S SO GOOD. The voices are also cute, and cute in a good way, not in an intolerable way.\\n\\n\r\nCharacters: 9/10\\n\r\nThe characters are all very different and amazing in their own ways.\\n\r\nThere's Marii. Marii is a very funny, tomboyish character who never fails to make me laugh with her bruised butt. She is often ignored or left out by the other characters. Her name, Buratei Marii, is a pun meaning bloody mary- say it out loud. Buratei Marii. You see?!\\n\r\nKukuru is a very unlucky, emotionally unstable girl. Her name contains various Japanese puns relating to very dark things. She has a dark sense of humour.\\n\r\nKigu is a very cute girl with short yellow hair. She pretends to be cute, but often has moments in which she turns very dark, muttering that she is sick of 'their damn expectations', often swearing.\\n\r\nHer name, Kigurumi Haroukitei, is a pun-- say it out loud! Kigurumi and Hello Kitty.\\n\r\nTetora is a very lucky girl, and considered the main character of the series. Again, her name is a Japanese pun.\\n\r\nFinally, we have Gankyou. Gankyou is a glasses-wearing girl, who often acts very violent towards the other girls. She generally likes reading books and surfing the web.\\n\\n\r\nOverall: 8/10\\n\\n\r\nThis is a must-watch for those looking for anime which reflects the dark and humorous side of life- you can thank Kukuru for the 'dark' part :)",
            "date": "2016-05-05T21:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 217972,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PotatoFridges",
                "username": "PotatoFridges"
            },
            "url": "https://myanimelist.net/reviews.php?id=217972"
        },
        {
            "content": "\"This anime is full of ordinary dialogue so that the viewers can fully enjoy how cute the girls are\"\r\nThat quote pretty much sums up the attitude of this show. Joshiraku knows what it's about, and it has no problems flaunting it. It's about entertainment - and despite what the above quote says, its not the fanservice kind (although it does have some). This is a fourth-wall-breaking, satirical comedy/cultural lesson. If you're looking for anything else: 1) don't watch this anime 2) go find something else to watch 3) stop reading this review already, there's no point since you're not going to consider watching this animeanymore.\\n\\n\r\nNow for those of you still considering the show, here's the lowdown. \\n\\n\r\nThe premise of the show is just following a bunch of rakugo performers (a kind of comedian) and their acts of randomness. Each episode of Joshiraku is organized into three skits. With few exceptions, most of the segments are standalone. While the lack of any central plot forces me to give this show a low \"story score\" on technicality, it is in no way a deal-breaker. You watch this show when you want a laugh, and the compartmentalized nature of Joshiraku lets you alleviate boredom at your leisure.\\n\\n\r\nAs for the animation and music, it's nothing special. The opening and ending songs are somewhat catchy, but I find this to be true of just about any anime song that isn't just plain irritating. The characters, on the other hand, are rather distinct and are what define Joshiraku. No, it's not just because they're cute. Their interactions with each other, what the show calls \"ordinary dialogue,\" is really the driving force of the humor. And surprisingly, There's enough depth to the characters that every once in awhile the show pulls something you don't quite expect, only to realize that it completely fits the characters. It helps keep Joshiraku fresh while still establishing a rather coherent identity. \\n\\n\r\nJust a warning though. The show is rather heavy on the outside references, although there's still plenty to enjoy even if you don't get any of those. Still, Joshiraku is a great time-waster whether you choose to marathon the whole thing, or watch it on and off. And yes... I meant that in a good way.\\n\\n",
            "date": "2012-12-24T22:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 81244,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/giantfish",
                "username": "giantfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=81244"
        },
        {
            "content": "Yappari wakaranai...Japanese humor\r\nAnime fans out there. Have you noticed how many times the subtitle writer has had to put asterisks around the screen to explain some odd, weird, and convoluted Japanese joke or pun? Manga fans out there. How many times have you had to squint at the fine line between panels to read the direct translation from Japanese, and then sit back and wonder how that was actually funny?\r\nAsian culture spins almost directly counterclockise to Western culture. Asians have different eating, sleeping, working, playing, and ultimately living styles. They have different values, different laws, different mindsets, different beliefs. Undoubtedly, they also find certain thingsfunny that no American would ever dream of laughing at.\\n\\n\r\nJapanese culture within other Asian cultures is like the taro in taro rice or the yam in yam porridge - it stands out. The Japanese, having isolated themselves on a chain of islands in the Pacific Ocean for hundreds of years with limited cultural exchange with China and Korea, developed their own culture that was in part based on the preexisting cultures of Asia and in part their own unique flavors. Thus, even other Asians regarded Japanese culture as something quite foreign and strange, though it was also unusually attracting...\\n\\n\r\nIn short. True Japanese humor can only be understood by true Japanese.\\n\\n\r\nWhich is why this anime will blow your mind.\\n\\n\r\nJoshiraku pays homage to one of the classic modes of entertainment in Japan: rakugo. Rakugo is the art of the stand-up comedian, only...kneeling down. By themselves, rakugo performers are required to spin yarns, tell single-sided jokes, make puns, act out scenes. Often times, rakugo performers will play multiple roles in a scene, distinguishing between each character only by a change in inflection and a slight tilt of the head.\\n\\n\r\nJust so you know, this anime actually has as much to do with rakugo as Angel Beats has to do with actual angels.\\n\\n\r\nThis anime is not for the faint hearted. It is not for those who refuse to understand or at least try to comprehend Japanese culture. But for those of you brave enough (or foolish enough), Joshiraku can be one crazy joyride.\\n\\n\r\nStory (7/10)\\n\r\nArt (8/10)\\n\r\nSound (8/10)\\n\r\nCharacter (9/10)\\n\r\nEnjoyment (8/10)\\n\\n\r\nFor 4koma-esque anime and other slice of life anime, I change the \"Story\" criteria to \"Content\" to better fit the grading scheme. And the content receives a 7 because...its really exclusive content. As I spent an introduction saying, Japanese humor is a really elite type of humor. Some people won't get it. Most people don't find it funny. Just like Marii, they end up laughing at the wrong things (HAHAHA!! HIS TROUSERS ARE STRIPED!!!), though not a bad thing since people are laughing regardless. However, this definitely limits the possibility of a wide array of people from truly enjoying this anime. Fortunately, the anime makes it up with a strong cast of lovable characters. You may not understand the joke, but you end up enjoying seeing the characters engage in banter and saying some impossibly crazy things.\\n\\n\r\nSome of the content is somewhat inappropriate, and other parts are downright creepy. The anime even starts off by breaking the 4th wall, which was completely astounding that left me totally bewildered. If you thought Nichijou was confusing, then you'll probably faint after a couple episodes of this.\\n\\n\r\nAlso, I was disappointed there wasn't any actual rakugo.\\n\\n\r\nGood art, I especially loved the variety of outfits that the girls wear. They all look wonderful, and the artists really put time and effort into presenting them well.\\n\\n\r\nMAL should have a Favorite OP and Favorite ED list. Because Nippon Egao Hyakkei is one of the most amazing songs of anime ED history. The beginning of the OP also set the mood of the anime really well. I found myself  naturally getting hyped about watching each episode, despite knowing that I'd soon be eyebrows-twitching with a nervous smile on my face.\\n\\n\r\nCharacter is where the anime really shines. Each character is living, bright, and vibrant. They have their own unique style, not fitting into any preconceived mold (tsundere, moe, loli, etc). And the way that they interact with each other brings the entire anime together.\\n\\n\r\nI'd like to spend some time discussing each individual.\\n\\n\r\nMarii is your typical tsukkomi. In English, this would be the \"straight man\", someone who is serious when others joke around. Marii plays a certain varient of the tsukkomi where the tsukkomi is actually no smarter or more serious than the others, but ends up being the butt (no pun intended) of the jokes or ends up reacting to them strongly. Yuuko from Nichijou plays a similar role in her relationship with Mai and the others. Marii is dumb, rash, red-headed (which, incidentally, means about the same in Japanese culture as it does in Western cultures), and a major klutz. Probably the most dull characterwise out of the troupe, but makes up for that with her fiery attitude. She's definitely the best at drawing out the facepalms.\\n\\n\r\nTetora is the angel. She's perfect in everything she does, and she's never on the negative receiving end. She plays the calm, quiet controller of the cast, sometimes leading them around by the nose. She does have quite a wild side, and she ends up showing quite a variable display of emotions and personalities.\\n\\n\r\nKukuru is the possessed spirit. The most unique character of them all, Kukuru is the polar opposite of Tetora - always unlucky, always unfortunate. I'm assuming Imagine Breaker is located on her forehead. Regardless, she's perfectly fine with being unlucky and often plays the role of the old, possessed hag. She's downright creepy, but really awesome in a creepy sort of way. A completely special and unique type of character I'd love to see more of. With regards to the cast, she completely stands out in a corner, surrounded by dark aura, but as the discussion heats up she's able to be an integral, albeit depressing, part of the conversation.\\n\\n\r\nKigurumi is the masked demon. On the outside she's cute, fluffy, innocent, and sweet. Behind that lies a swearing, angry, heavy metal-loving girl. Her switches between the two personalities are completely surreal, and seeing one side of her makes you almost forget about her other side. An interesting character in her own right, she's able to keep the viewer continually guessing about what her true opinions are. \\n\\n\r\nGankyou is not your typical glasses girl. On the contrary, she loves beating up Marii and isn't all that smart. Her personality is very cool, but she can equal Marii in terms of heat and passion. Her ideas are out of this world (I swear I'm not trying to make these puns) and are often backed immediately by the rest of the crew with the exception of Marii, which leads to collective teasing and torture of the poor redhead. \\n\\n\r\nBasically, the cast is a wild bunch. Not only do they completely fly against everything that anime has shown up to now, but they also remain endearing and classic. Together, these girls become quite the unstoppable troupe of makeshift comedians.\\n\\n\r\nTo say that I didn't enjoy Joshiraku would be a lie. To say that I wasn't at times completely doubting my sanity in watching this show would also be a lie. Joshiraku is an anime that drives you to extremes, often at an extreme pace. I've never been so mindblown by a single anime.\\n\\n\r\nOverall (8/10)\\n\r\nYappari wakaranai...Joshiraku",
            "date": "2013-07-12T23:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 105093,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2258035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blaZofgold",
                "username": "blaZofgold"
            },
            "url": "https://myanimelist.net/reviews.php?id=105093"
        },
        {
            "content": "This anime is very hard to fully understand with subtitles only and I reckon most anime watchers will miss much of the content of Joshiraku.\r\nBut even then the contents are nothing special and the show does not appeal to me one bit. The puns aren't anything to laugh about (they are neither interesting nor funny). The setting is boring and episodes' plots are lame.\r\nI enjoyed the opening and ending and the voice acting crew was good too but those are all secondary.\r\nJoshiraku is not my cup of tea but I guess there might be people who enjoy this kind of stuff, since the show isn'tfundamentally bad otherwise.",
            "date": "2015-09-02T15:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 197699,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39476.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Aphyxia",
                "username": "Aphyxia"
            },
            "url": "https://myanimelist.net/reviews.php?id=197699"
        },
        {
            "content": "Joshiraku is an anime form of that friend you wanna avoid. He was fun to have around because he had all these funny and long-winding stories to tell; and you didn't care if they were true or not. But, as time passes, you just wanted him to shut up. He WON'T shut up, no matter what you do or say; no matter how hard you try.\r\nYeah. Sure. The females who star in this show are cute, hot, moe, whatever. But they get under each other's skin rather quickly.\r\n* Gankyou Kuurubiyuutei (Cool Beauty 4-Eyes): The Heather / Paniponi's Rei\r\n* Marii Buratei (Bloody Mary): The \"Holler BackGirl\" and \"Physical Punchline Receiver\"\\n\r\n* Tetora Bouhatei (Tetrapod Bulkhead): The Annoyingly Lucky Girl / Mitsuko Ramuni\\n\r\n* Kigurumi Haroukitei (Hellokitty Bodysuit): Genki Girl on one side of the coin, Black Lagoon's Revy on the other\\n\r\n* Kukuru Anrakutei (Noose Euthanasia): the human female form of Decepticon's Dirge.\\n\\n\r\nSurprisingly: The wardrobe change amongst these girls, during the middle of the episode where they travel around Japan, had been cranked to 15. They wear different clothes more times than the lot of regular animu that wave around cute girls to get your attention.\\n\\n\r\nAnd also surprisingly: A lot more goes on during these episodes than during the small amount of time they're on stage.",
            "date": "2012-09-18T12:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 72653,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=72653"
        },
        {
            "content": "If I had to sum up the show in a few words: \"A comedy based on a group of 5 girls taking turns with the old boke-tsukkomi routine.\"\r\nThe show is about 5 girls who are studying the art of Japanese stage storytelling dubbed: \"rakugo\" hence the title of the show \"Joshi (meaning woman/girl) raku\".\r\nWhen it comes to the story and art one character's line,  Kukuru's: \"Stop that! The animators are doing their best even though there's little to animate,\" pretty much sums it up. As well as a literal frame in the first episode: \"This anime is full of 'ordinary' dialogue so views canfully enjoy how cute the girls are.\"\\n\\n\r\nI quoted because ordinary, as much of what they discuss is chock-full of anime , pop-culture, and nonsensical humor and gags, which is the show's selling point. I often found myself smile and laugh unconsciously. \\n\\n\r\nThat being said, it can be difficult to understand the comedy sometimes as some rely on timing of the joke or make reference to an obscure topic. I can't say that I didn't have to pause a few times throughout the show and look up meaning of punchlines or nuances in wordplay, but it didn't distract me from enjoying the show's humorous banter.\\n\\n\r\nMany of the tracks in the OST use Japanese instruments which compliments the traditional atmosphere a rakugo has.\\n\\n\r\nOverall, I had a blast watching the show. I believe if you have some knowledge of Japanese pop-culture, a bit of knowledge in the Japanese language itself, a somewhat subtle sense of humor its not difficult to find this show an interesting watch",
            "date": "2013-01-07T11:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 82966,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KY791",
                "username": "KY791"
            },
            "url": "https://myanimelist.net/reviews.php?id=82966"
        },
        {
            "content": "\"This anime is full of ordinary dialogue, so viewers can fully enjoy how cute the girls are.\" What they didn't mention was how side splittingly amusing this so called 'ordinary dialogue' can be.\r\nJoshiraku's story or rather lack of any real progressive story is one of sheer humor. 5 friends/colleagues at the level of friendship where they can easily insult each other and not have it affect their status as well as having long pointless conversations that get completely off track and out of control. Each episode (which contains 3 stories each) all are completely different and while do reference previous episodes in the conversations, haveno real point in terms of story development\\n\\n\r\nYou watch this anime who's art style and main characters scream \"Moe\" which is backed up by the occasional \"This anime is full of ordinary dialogue\" scene. Bright colours flood the anime then they're inside a building, even dark scenes or moody takes (from one character in particular) it can easily be picked as a brighter, almost candy colour type anime. It seems childish but the type of humor they pull and discuss is anything but. Outside scenery is very well drawn with its shading that comes across as a beautiful piece of art within itself.\\n\\n\r\nSound is probably as basic as it could ever be. Little music pieces only used for opening scenes or little joke tunes played at the occasional sarcasm conversation. The Opening and Ending themes would be this anime's biggest points in terms out sound and music as not matter what mood your in they always seem to bring a smile to your face.\\n\\n\r\nCharacter is much like story for this anime in the way of, nothing really progresses but old jokes or past events that happened to characters are called upon, sometimes multiple times in later episodes, but in terms of anyone getting elevated or degraded status with other characters, nothing changes from start to finish. Their personalities however are played out so well from your average talkers, your quiet type and that one cute innocent girl that is really planning all your murders (I mean what)\\n\\n\r\nThe enjoyment... Oh god the enjoyment. There is comedy and then at least 2 or 3 tiers above it, is this anime. Their conversations always of so far off track and the original topic is forgotten beneath the mass amounts of humor. It doesn't even try to take itself seriously at all with a galore of references from small topics like everyday brands and shops to other anime and even their own animating company. Complete and utter disregard for the 4th wall some times can be done badly but somehow this always manages to pull anything from a giggle or snicker to collection of laughter in its form of presentation.",
            "date": "2014-05-09T23:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 142841,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=142841"
        },
        {
            "content": "What to make of _Joshiraku_...  So, _Joshiraku_ episode 01. It's definitely by _Zetsubou_'s author, one realizes pretty quickly; the animation is colorful and clean; the conversations gave me a few chuckles. Overall, I'm not too impressed but we'll see if the characters grow on me: I liked only some parts of the first episode of _Sayonara Zetsubou-sensei_, after all.\r\nDid it succeed? No. As presented _ragaku_ was an interesting premise but turns out to be hideously unfunny and one sympathizes with the occasional kid or person pointing out that 'once is enough' (and, as unkind an observation as this may be, one understands why theremight be only four 'seats'/theaters left). The characters are decent enough (as promised by the self-description of cute girls talking) and aren't as 'archetypal' as in _Sayonara_, and would give the occasionally alluded to K-On! a run for their money. The animation quality held up to the end, I thought.\\n\\n\r\nThere were some bits that were quite funny (I loved the Christmas story with the oversized tree). Some bits were surprisingly reflective: episode 9 has an unexpected take on Chuang-tzu which was fast enough to leave an impact, while Mari's little time-travel to the bubble era evokes Lieh-tzu's pillow story. There were more allusions to Western material than I am used to (unless the fansubbers are really messing with me), and the fourth wall bits were not annoying.\\n\\n\r\nBut overall... this was, for me, a lot like _Nichijou_: a few good parts trapped in a lot of basically filler. The dialogues and analyses weren't as sharp as _Sayonara_, the backgrounds/scenes weren't as beautiful as _Nichijou_, the overall humor weaker than _Azumanga Daioh_... I don't regret watching it, but if this was the best comedy of the season, there mustn't have been any really good ones.",
            "date": "2013-05-11T18:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 96827,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gwern",
                "username": "gwern"
            },
            "url": "https://myanimelist.net/reviews.php?id=96827"
        }
    ],
    [
        {
            "content": "It is my first review, so don't go harsh on me.\r\nSo far, this anime has been funny. The references they make are funny, even if I don't get it. As well, the Ending song will be stuck in your head. This anime does what the synopsis says. Its just girls talking about stuff really. The characters are cute too.",
            "date": "2012-07-16T14:04:00+00:00",
            "helpful_count": 179,
            "mal_id": 66755,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1156283.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MFK",
                "username": "MFK"
            },
            "url": "https://myanimelist.net/reviews.php?id=66755"
        },
        {
            "content": "So, here I go with my first review.\r\nJoshiraku is not the typical moe anime due to the fact that it was created by Kohji Kumeta. For those who are not aware of Kohji Kumeta, he is the person behind Sayonara Zetsubou Sensei. This work is different from SZS because the girls of Joshiraku are just cute rakugo girls, unlike the students at SZS, where everyone has a certain disorder, if you can put it in that way.\r\nThere is this notion hanging above my head once I watch Joshiraku: \r\n\"This anime is full of ordinary dialogue so that the viewers can fully enjoy how cute thegirls are.\"\\n\r\nIn fact, that sentence can summarize how many people would view the anime, but the hidden genius of the anime lies in the dialogues. A hodge-podge of references, parodies, and comic reliefs have given Joshiraku the atmosphere of watching Lucky Star blended into SZS. Be warned though, many of the puns are Japanese references, so if you're watching a subbed episode, go for gg Fansubs, for they have translation notes (you can just google it).\\n\\n\r\nStory: 8/10\\n\r\nWhat is the Story? A typical person may ask after taking a glimpse at Joshiraku. As I stated earlier, Joshiraku is about five rakugo girls discussing random topics, which typically drifts away until the original topic is buried. Though, this must not deter you from watching it, for it is hilarious nonetheless.\\n\\n\r\nArt & Sound: 7/10\\n\r\nJ.C. Staff has somewhat neglected it, though it should be noted that they're putting a lot of effort in Little Busters! ( three episodes of LB has been released as of the time of writing of this review), but the art used in the anime is quite similar to the manga.\\n\r\nAs for the sound, I find it lacking in the way that it needs more than just dialogue and background noise. Overall, I have no major criticism of the Art and Sound.\\n\\n\r\nCharacters: 9/10\\n\r\nThe standout character for me is Kukuru. Even though the rest have those moments of brilliance, I feel that Kukuru's dark humor and paranoia has twisted the series in a way that it is genuinely enjoyable.\\n\r\nSome characters which appeared only as a part of parody can only be described as awesome. Case in point, in episode five, where there is a parody of Japan's former PM. Also, the way that the characters bash their own producers is brilliant, like how Marii made a pun about J.C. Staff and their rivals (KyoAni).\\n\\n\r\nSo, another work of Kohji Kumeta gave me the sense of humor not usually found in many comedy-themed anime. For those who enjoyed Sayonara Zetsubou Sensei, don't worry about the overall appearance, for it still has the great humor found in a work of Kohji Kumeta. Also, this is a must-watch for those who are looking for anime which reflects the dark and humorous side of life.",
            "date": "2012-10-30T21:18:00+00:00",
            "helpful_count": 85,
            "mal_id": 76319,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1408161.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Win_Zero",
                "username": "Win_Zero"
            },
            "url": "https://myanimelist.net/reviews.php?id=76319"
        },
        {
            "content": "\"Which do you prefer? Left or Right? Me...I prefer down...I like to look down.\" Kukuru. Joshiraku was my surprise hit of the 2012 season and honestly I'm surprised that I have not seen more love for this series. This show isn't about being a politically correct melodrama that'll make you shed a few tears for the beautifully crafted characters...It's just FUNNY! Kouji Kumeta's stories are supposed to be taken with an open mind and if you are willing to come at this series willing to make fun of anything then this series will have you looking at the world in a whole different light. \r\nStory:The story really isn't linear whatsoever and is more like random pieced together small stories (as it was in the manga), something that I would say is akin to Nichijou's story. I find it hard to really judge how to review the story other than by looking at each 1/3 episode as an individual story. From this perspective every mini story has an effective tale that never feels cut short (unless the humor is that the story is cut short) and everything in them has a purpose (even if that purpose is to have none). 9/10 \\n\\n\r\nArt: My only complaints that I really have with the series is that it is obvious that J.C. Staff didn't put a lot of effort into the artwork of this show. Which makes sense because with Little Busters! coming out the next season (A show that could literally make or break that company) the logical conclusion is that this show was just put on the back burner. It's not bad per say, it just doesn't have that same artistic flair that the other Kouji Kumeta's adaption had (although not every show can be animated by SHAFT). 6/10 \\n\\n\r\nSound: I thought that the OP does it's job, in that every week I heard it at the beginning of the show I got excited to watch the show. It doesn't necessarily have the stand alone value as a good song that I'd put on my iPod , but it is catchy nonetheless. The ED is also hysterical if you know the story that is behind the lyrics of the ED. If you don't know I'd suggest that you go look it up (Valeraku, gg's translator for the series, actually has pretty good translation notes). Finally the backdrop music throughout the show seems very fitting to the series and at times can add to the comedic depth. 9/10 \\n\\n\r\nCharacters: The main pinnacle of any of Kouji Kumeta's work, beside the sea of references, has always been his characters and the characters of Joshiraku are only a brilliant illustration of that. Kukuru and Marii are both two characters that I feel have absolutely no character archetype I can pin them to and it helps solidify their originality. I thought that Kigu was just there to actually be one of the \"cute girls\" at the beginning of the series, but the depth that gets added to her later in the series (listening to death metal music and going on malicious explicit rants in her head) made her one of my favorite characters of the Summer 2012 season. And that perfectly illustrates what makes these characters so fantastic is that they are so unpredictable that their humor can get you from literally anywhere. 10/10 \\n\\n\r\nSo you're not Japanese: One of the biggest problems that many people have had with this series is the fact that if you aren't from Japan then most of the humor will go right over your head. And to be honest that isn't a false statement because Kouji Kumeta's audience is Japanese and he doesn't really care to internationalize his work (and why should he?). However if you feel like you're getting lost then just pick up the translation notes that Valeraku posts and learn them. This isn't a series that you can come into without willing to put in a little work, but I guess in today's anime community people are too lazy to do that. I think it's kind of like reading Beowulf, even if you speak English you'll still need a comprehensive study book just to be able to understand half of it. I really am thankful to gg for making this great work accessible to other people, but if you want to have the full experience you have to put in a little bit of work. \\n\\n\r\nThe reason that this series is rated so high for me is the simple fact that it is so incredibly entertaining. Every week I got this show onto my computer I was literally splitting at the seams from the humor. I wouldn't suggest this show to everyone because frankly not everyone will like Kumeta's offensive style of humor, but people who are cynics like me will absolutely love it. If you're reading this review wondering if you should watch this show, then I highly suggest that you at least give it a try.",
            "date": "2012-09-30T12:56:00+00:00",
            "helpful_count": 49,
            "mal_id": 73739,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1300063.jpg",
                "scores": {
                    "animation": 6,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/MadScientistJ",
                "username": "MadScientistJ"
            },
            "url": "https://myanimelist.net/reviews.php?id=73739"
        },
        {
            "content": "(may contain minor spoilers)\r\nYOSH! Slice of Life Comedy review here we go!\r\nJoshiraku is an anime adaptaion of a manga from the same creator of Sayonara Zetsubou Sensei.\r\nNow now, I found this anime by chance but as an avid fan of comedies I couldn't ignore it. \r\nJoshiraku is quite the interesting and funny anime. Be it the interactions between the characters, the parodies or the \"breaking of the 4th wall\" thingy.\r\nLet us begin\r\nStory:\r\nAs a slice of life comedy anime, it doesn't have a specific plot nor anything serious. It does, though, have continuity. Meaning that what happened in an episode will \"affect\" the future ones, whichis good.\\n\r\nPersonally, I find the comedy throughout the show quite good and enjoyable, although it may not be for everyone. Even so, it will definitelly find a way to entertain you and make you laugh.\\n\r\nWith all that said, the story gets an 7/10.\\n\\n\r\nArt/Animation:\\n\r\nThe art is quite good and fitting. Each character is easily identifiable by it's characteristics/colours and are drawn nicely. Same with the colourfull backgrounds (not that there are many but still xD).\\n\r\nThe animation quality is definitely good. All the characters move fluently and I failed to notice any moment in which such quality dropped.\\n\r\nArt/Animation gets an 8/10.\\n\\n\r\nSound:\\n\r\nWoo! Great! The Opening and Ending are great and I got addicted to them >.>\\n\r\nBesides that, the bg was fitting and I didn't notice any problems with it.\\n\r\nSound gets a 9/10\\n\\n\r\nCharacters:\\n\r\nThe big point of the show, as it focuses on the interaction between these. Joshiraku has a small cast of characters, each with it's own traits and characteristics that complement each other nicely.\\n\r\nNothing special to say about them, the characters are not at all unique but good and each of them is important for the show as they are. I can't imagine Joshiraku without any of them.\\n\r\nCharacters get an 8/10 'cause quite like them and I can.\\n\\n\r\nEnjoyement:\\n\r\nHell, did I have fun watching this. I sure did! I watched some of the episodes more than 3 times already. What can I say, personally it was one of the best comedy shows I've seen.\\n\r\nEnjoyement gets an 9/10\\n\\n\r\nOverall:\\n\r\nJoshiraku is a quite entertaining anime. The art and animation was good and the OP and ED will get stuck in your head for a while. It's not the best comedy out there but surely enjoyable and worth the time spent watching. One title I would recommend to comedy fans out there.\\n\r\nThat said, and Overall classification of 8.\\n\\n\\n\r\nHope this is usefull\\n\r\nThank you :)",
            "date": "2014-11-16T11:04:00+00:00",
            "helpful_count": 19,
            "mal_id": 168837,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1430267.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-Panda_Hero-",
                "username": "-Panda_Hero-"
            },
            "url": "https://myanimelist.net/reviews.php?id=168837"
        },
        {
            "content": "First of all, English isn't my mother language so forgive if I do some harsh gramatical erros. \r\nStory(?)/argument\r\nJoshiraku is the other manga Kohji Kumeta is writing... Assuming most of you have watched Sayonara Zetsubou Sensei, this new manga/anime can be quite a shock on the first episode specially due to how cute everything is and how charming (if not moe) the girls are... but as almost everything Kumeta does, this traits are quite deceptive. If in Sayonara Zetsubou Sensei every chapter had an steady progression towards the punchline or \"the joke\" at the end of the episode, joshiraku completely lacks this: the humour is quitesmooth and everything is less progressive and more spread. In the end it does superficially suits that remark at the beginning of the series:\\n\\n\r\n\"This anime/manga is full of ordinary dialogue so that viewers/readers can fully enjoy how cute the girls are\"\\n\\n\r\nDECEPTION. Just like this statement, almost all the humour and social criticism is hidden and concealed. As everything it's treated in the same way as almost all of those \"moe girls start talking\" anime (Ex: Lucky Star, K-ON, etc) It's more atractive to the mainstream public than Sayonara Zetsubou Sensei. This could be the main reason Kumeta went with this setting: to attract more readers... but don't worry, The core that made Sayonara Zetsubou Sensei such an innusual and genius work it's still there so you won't be dissapointed\\n\\n\r\n-------------\\n\\n\r\nArt:\\n\\n\r\nThere isn't much to talk about the art of the show: 90% it's on the backstage of a theatre in which the girls work as comedians. Besides, The animators mimic the drawing style of the original manga to the root.\\n\\n\r\n-----------------\\n\\n\r\nAlmost every other thing is irrelevant to the action onscreen. The only thing that can be considered aside are the opening and the ending sequences but I won't review those mainly because I'm not qualified to do it properly.",
            "date": "2012-07-31T03:30:00+00:00",
            "helpful_count": 18,
            "mal_id": 68229,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/259643.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/OVanBruce",
                "username": "OVanBruce"
            },
            "url": "https://myanimelist.net/reviews.php?id=68229"
        },
        {
            "content": "What to say about Joshiraku, this is a tough thing to answer. It's basically \"Translators note\" the anime. \r\n-Story is what you expect from an SoL comedy.\r\n-Art is basic fair with basic character art and pretty good backgrounds. Nothing less from J.C. \r\n-Sound is great. I fucking love the OP, if that means anything...\r\n-Characters are characters\r\n-I enjoyed this series as much as a baka gaijin such as myself can. A lot of the humor is the miss due to culture differences. It's the type of anime that doesn't really need popularity outside of Japan. \r\nOverall I can recommend this anime to anyone and I canhighly recommend it when you have some actual knowledge of japan outside of using choice words like \"Kawaii\" and \"desu\" and only really knows what they do from anime and dramas.",
            "date": "2013-10-15T19:29:00+00:00",
            "helpful_count": 8,
            "mal_id": 117005,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2493269.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Wizardducklett",
                "username": "Wizardducklett"
            },
            "url": "https://myanimelist.net/reviews.php?id=117005"
        },
        {
            "content": "Today was finally the day when i wasn´t able to suppress my desire to review Joshiraku anymore. A show that fascinated me in a very unique way: Joshiraku is great by intentionally beeing bad. I know you probably already think i´m a jerk and stopped reading by now, but i will finish this anyway...\r\nJoshiraku is a 13-episode comedy released by JC Staff in the summer of 2012. While i wasn´t expecting much out of this initially, it became  one of the biggest pleasant surprises of the year for me. Every single episode made me laugh out loud while at the same time captivating mewith it´s tremendous creativity. The writer´s bravery to take risks is also worth mentioning, as Joshiraku does not take itself serious whatsoever and purposely makes every single mistake that killed other shows in the past. All we get to see is five girls who are totally  aware of the fact that they are animated characters in a TV show discussing the most uninteresting topics u can imagine while  constantly breaking the fourth wall...and it is HILARIOUS.\\n\\n\r\nFurthermore, the show openly states that it is \"full of dialogue so the audience can fully enjoy how cute the girls are\" (they aren´t cute...) and even introduces a new character in the final episode only for the others to \\n\r\nrant about how stupid the writers must be...\\n\\n\r\nOverall, this is a wonderful comedy show because it does not try to be anything else but a comedy show. It´s a heavily dialogue driven, fast paced in your face  gag firework with opening and ending sequences so annoyingly addictive that they will haunt you in your dreams. And which other show will introduce us westeners  to the traditional japanese art of rakugo theatre? So love it or hate it...but watch it first!\\n",
            "date": "2015-03-14T16:51:00+00:00",
            "helpful_count": 7,
            "mal_id": 182350,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4486543.jpg",
                "scores": {
                    "animation": 5,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/PhKay",
                "username": "PhKay"
            },
            "url": "https://myanimelist.net/reviews.php?id=182350"
        },
        {
            "content": "First off, if you don't know a lot about Japanese culture, you'll be very confused.\r\nSecondly, if you don't speak Japanese, a lot of the puns will fly over your head (though the fansubs certainly do their best to localize it).\r\nIf you'd rather not bother with Japanese cultural references, you're probably better off watching Nichijou. If you are interested, however, in talk about places such as Tokyo Tower and Skytree or references to Japanese politics in combination with wacky one-liners, you might like this anime.\r\nI personally am enjoying it a lot, but honestly, around half the bits I thought were funny will probably not be understoodby many Western fans, not to get all condescending about it. Those learning Japanese should definitely check it out, as it's heavy in wordplay and Japanese humor!",
            "date": "2016-03-21T21:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 213583,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731968.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RilakkuLina",
                "username": "RilakkuLina"
            },
            "url": "https://myanimelist.net/reviews.php?id=213583"
        },
        {
            "content": "Joshiraku is an anime about the lives of five rakugo comedian girls. Instead of focusing on the girls rakugo performances, the show reveals what happens off stage and various things that happens in their day-to-day lives. \r\nYou would see this sentence being repeat throughout the show: \"This anime is full of ordinary dialogue so that viewers can fully enjoy how cute the girls are\". This quote highlights the main attraction of the anime: it's dialogue. The show has the ability to turn everyday, trivial matters into something that is absolutely hilarious and even sometimes philosophical. Seeing the interactions between these girls are entertaining. Just likein real life, while you are talking with someone, sometimes, you would wonder: how did our conversation end us on this topic? That is exactly the experience of watching Joshiraku, the character would ramble on things, whether it being a thoughtful discussion on today's politics or a lamentation on their horrible childhood experiences, and spice things up with humor. Now, the humor part of this show might cause some people to dislike it. A lot of the humor in this show involves references, whether that be an homage to another anime show or current events in the Japanese society. A good amount of the jokes are culturally specific to the otaku and the Japanese culture, which might be a barrier to some people watching this show to not get what's so funny. I'd say also as you're in touch with the otaku culture, you should be able to enjoy most of the content in this show. As for me, I had a great time with it.",
            "date": "2016-12-02T06:12:00+00:00",
            "helpful_count": 4,
            "mal_id": 234744,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5550661.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SHivayogimaTH",
                "username": "SHivayogimaTH"
            },
            "url": "https://myanimelist.net/reviews.php?id=234744"
        },
        {
            "content": "Ahh, Joshiraku. A series that initially I was skeptical about watching, knowing nothing about Rakugo. Surprisingly, not knowing anything about Rakugo did not matter. The series more so uses pop culture, environmental  or political humor more than it addresses anything about Rakugo. The characters are marvelously crafted. Each is assigned a niche essentially that they play quite well and throughout the series, build on. The visuals are clean and clear, the music especially the ending, is addicting, and its overall a very enjoyable anime. \r\nIts worth pointing out however that a lot of jokes in the series rely on Japanese puns and Japanese politicswhich would make no sense to someone not familiar with either,  like myself. \\n\\n\r\nIf you want something fun, overall positive, and different to watch, I strongly suggest giving this a try. \\n",
            "date": "2018-07-30T22:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 285209,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3325791.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/QuarryQuake",
                "username": "QuarryQuake"
            },
            "url": "https://myanimelist.net/reviews.php?id=285209"
        },
        {
            "content": "Man always strives for a challenge. Climbing Mt. Everest, landing on the Moon, and finishing Joshiraku are some of the arduous accomplishments ever achieved.\r\nThe show is mislabeled as a \"comedy\". If puns and cultural jokes are all you have to lean on; hire a writer. Don't be so proud that you can't dismiss your own faults. The only thing more revolting than the jokes are the dorks that pretend this is funny because they want to be weeb level 1 million. I understood a couple of the puns in Japanese and they weren't good. I pretty much have a PhD in Dad Humor. Timing anddelivery is everything in these types of jokes. The words themselves don't make it funny. \\n\\n\r\nI think this is a type of \"going outside simulator\". This is appealing to people who are incredibly bored and are not happy with life because they choose to do nothing with it. This is saying a lot because nothing happened; EVER! This may be used as a way to waste time. There was an ever looping joke(?) that was a screenshot to tell us that \"This anime is full of ordinary dialogues so the spectator can really enjoy how the girls are cute\". There is enough source material to make a second season; do you know why they didn't make one? Because it is poorly constructed and it wasn't well received in Japan because the Japanese didn't even find their own cultural jokes funny.\\n\\n\r\nThis show is a 2 because of 3 reasons. Kigu is a palatable character and she made me smile a couple times. I like how she is borderline clinically insane. The dark thoughts and rock jokes got old, but that is par for this show anyways. The music was decent. I like the opening and closing songs quite a bit. I downloaded them and I blast them at the gym. The last reason this isn't rated at a 1 , even though the first word I would use to describe it is \"appalling\", is because I hate Girls und Panzer and I wish for that to be my only 1 and dropped series. Hooray victory by default!\\n\\n\r\nThe floating bare ass in space is symbolic for what this show is.\\n\\n\r\nI recommend this show to people who want to cut themselves, but are aware that cutting is socially unacceptable. Dear contemplating cutters, now you can hurt yourself equally while no one will be none the wiser.",
            "date": "2016-03-18T20:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 213292,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4670871.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Midg3tLuv",
                "username": "Midg3tLuv"
            },
            "url": "https://myanimelist.net/reviews.php?id=213292"
        },
        {
            "content": "\"This anime is full of ordinary dialogue so that the viewers can fully enjoy how cute the girls are.\"\r\nThat literally sums it up.\r\nAt least, that's what I would say if it actually summed it up.\r\nThe dialogue is anything but ordinary-- the things they talk about are absolutely hilarious and I found myself almost bawling from laughter very often. All the characters had very different personalities, and, as the above statement said, are all really cute.\r\nStory: 8/10\r\nI was first introduced to Joshiraku through an osu! song- the ending theme, to be exact. It was a great, fun song, and the anime looked good, so I decidedto check it out. It's about five rakugo girls (and a mysterious mask...) that discuss random topics. Usually, they drift away from this topic until they're up to something completely different.  It's always hilarious. However, there are loads of Japanese inside jokes/puns that you probably wouldn't understand. I recommend 'gg subs' (I use KissAnime to watch it), because they make it very easy for you to simply look up what certain things mean.\\n\\n\r\nArt: 8/10\\n\r\nThe anime's art is pretty similar to the manga. Very cute, obviously. I like how they've done it, because anything more detailed would ruin the theme of the anime, in my opinion.\\n\\n\r\nSound: 10/10\\n\r\nOkay, I know what you're thinking-- \"10/10?! Isn't that a little far-fetched?!?!?!\"\\n\r\nYes, probably.\\n\r\nBut, taking in all aspects- the opening is amazing, and I have the ending downloaded onto my phone. I know most of the words from listening and singing along on repeat. IT'S SO GOOD. The voices are also cute, and cute in a good way, not in an intolerable way.\\n\\n\r\nCharacters: 9/10\\n\r\nThe characters are all very different and amazing in their own ways.\\n\r\nThere's Marii. Marii is a very funny, tomboyish character who never fails to make me laugh with her bruised butt. She is often ignored or left out by the other characters. Her name, Buratei Marii, is a pun meaning bloody mary- say it out loud. Buratei Marii. You see?!\\n\r\nKukuru is a very unlucky, emotionally unstable girl. Her name contains various Japanese puns relating to very dark things. She has a dark sense of humour.\\n\r\nKigu is a very cute girl with short yellow hair. She pretends to be cute, but often has moments in which she turns very dark, muttering that she is sick of 'their damn expectations', often swearing.\\n\r\nHer name, Kigurumi Haroukitei, is a pun-- say it out loud! Kigurumi and Hello Kitty.\\n\r\nTetora is a very lucky girl, and considered the main character of the series. Again, her name is a Japanese pun.\\n\r\nFinally, we have Gankyou. Gankyou is a glasses-wearing girl, who often acts very violent towards the other girls. She generally likes reading books and surfing the web.\\n\\n\r\nOverall: 8/10\\n\\n\r\nThis is a must-watch for those looking for anime which reflects the dark and humorous side of life- you can thank Kukuru for the 'dark' part :)",
            "date": "2016-05-05T21:54:00+00:00",
            "helpful_count": 4,
            "mal_id": 217972,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5384921.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PotatoFridges",
                "username": "PotatoFridges"
            },
            "url": "https://myanimelist.net/reviews.php?id=217972"
        },
        {
            "content": "\"This anime is full of ordinary dialogue so that the viewers can fully enjoy how cute the girls are\"\r\nThat quote pretty much sums up the attitude of this show. Joshiraku knows what it's about, and it has no problems flaunting it. It's about entertainment - and despite what the above quote says, its not the fanservice kind (although it does have some). This is a fourth-wall-breaking, satirical comedy/cultural lesson. If you're looking for anything else: 1) don't watch this anime 2) go find something else to watch 3) stop reading this review already, there's no point since you're not going to consider watching this animeanymore.\\n\\n\r\nNow for those of you still considering the show, here's the lowdown. \\n\\n\r\nThe premise of the show is just following a bunch of rakugo performers (a kind of comedian) and their acts of randomness. Each episode of Joshiraku is organized into three skits. With few exceptions, most of the segments are standalone. While the lack of any central plot forces me to give this show a low \"story score\" on technicality, it is in no way a deal-breaker. You watch this show when you want a laugh, and the compartmentalized nature of Joshiraku lets you alleviate boredom at your leisure.\\n\\n\r\nAs for the animation and music, it's nothing special. The opening and ending songs are somewhat catchy, but I find this to be true of just about any anime song that isn't just plain irritating. The characters, on the other hand, are rather distinct and are what define Joshiraku. No, it's not just because they're cute. Their interactions with each other, what the show calls \"ordinary dialogue,\" is really the driving force of the humor. And surprisingly, There's enough depth to the characters that every once in awhile the show pulls something you don't quite expect, only to realize that it completely fits the characters. It helps keep Joshiraku fresh while still establishing a rather coherent identity. \\n\\n\r\nJust a warning though. The show is rather heavy on the outside references, although there's still plenty to enjoy even if you don't get any of those. Still, Joshiraku is a great time-waster whether you choose to marathon the whole thing, or watch it on and off. And yes... I meant that in a good way.\\n\\n",
            "date": "2012-12-24T22:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 81244,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/giantfish",
                "username": "giantfish"
            },
            "url": "https://myanimelist.net/reviews.php?id=81244"
        },
        {
            "content": "Yappari wakaranai...Japanese humor\r\nAnime fans out there. Have you noticed how many times the subtitle writer has had to put asterisks around the screen to explain some odd, weird, and convoluted Japanese joke or pun? Manga fans out there. How many times have you had to squint at the fine line between panels to read the direct translation from Japanese, and then sit back and wonder how that was actually funny?\r\nAsian culture spins almost directly counterclockise to Western culture. Asians have different eating, sleeping, working, playing, and ultimately living styles. They have different values, different laws, different mindsets, different beliefs. Undoubtedly, they also find certain thingsfunny that no American would ever dream of laughing at.\\n\\n\r\nJapanese culture within other Asian cultures is like the taro in taro rice or the yam in yam porridge - it stands out. The Japanese, having isolated themselves on a chain of islands in the Pacific Ocean for hundreds of years with limited cultural exchange with China and Korea, developed their own culture that was in part based on the preexisting cultures of Asia and in part their own unique flavors. Thus, even other Asians regarded Japanese culture as something quite foreign and strange, though it was also unusually attracting...\\n\\n\r\nIn short. True Japanese humor can only be understood by true Japanese.\\n\\n\r\nWhich is why this anime will blow your mind.\\n\\n\r\nJoshiraku pays homage to one of the classic modes of entertainment in Japan: rakugo. Rakugo is the art of the stand-up comedian, only...kneeling down. By themselves, rakugo performers are required to spin yarns, tell single-sided jokes, make puns, act out scenes. Often times, rakugo performers will play multiple roles in a scene, distinguishing between each character only by a change in inflection and a slight tilt of the head.\\n\\n\r\nJust so you know, this anime actually has as much to do with rakugo as Angel Beats has to do with actual angels.\\n\\n\r\nThis anime is not for the faint hearted. It is not for those who refuse to understand or at least try to comprehend Japanese culture. But for those of you brave enough (or foolish enough), Joshiraku can be one crazy joyride.\\n\\n\r\nStory (7/10)\\n\r\nArt (8/10)\\n\r\nSound (8/10)\\n\r\nCharacter (9/10)\\n\r\nEnjoyment (8/10)\\n\\n\r\nFor 4koma-esque anime and other slice of life anime, I change the \"Story\" criteria to \"Content\" to better fit the grading scheme. And the content receives a 7 because...its really exclusive content. As I spent an introduction saying, Japanese humor is a really elite type of humor. Some people won't get it. Most people don't find it funny. Just like Marii, they end up laughing at the wrong things (HAHAHA!! HIS TROUSERS ARE STRIPED!!!), though not a bad thing since people are laughing regardless. However, this definitely limits the possibility of a wide array of people from truly enjoying this anime. Fortunately, the anime makes it up with a strong cast of lovable characters. You may not understand the joke, but you end up enjoying seeing the characters engage in banter and saying some impossibly crazy things.\\n\\n\r\nSome of the content is somewhat inappropriate, and other parts are downright creepy. The anime even starts off by breaking the 4th wall, which was completely astounding that left me totally bewildered. If you thought Nichijou was confusing, then you'll probably faint after a couple episodes of this.\\n\\n\r\nAlso, I was disappointed there wasn't any actual rakugo.\\n\\n\r\nGood art, I especially loved the variety of outfits that the girls wear. They all look wonderful, and the artists really put time and effort into presenting them well.\\n\\n\r\nMAL should have a Favorite OP and Favorite ED list. Because Nippon Egao Hyakkei is one of the most amazing songs of anime ED history. The beginning of the OP also set the mood of the anime really well. I found myself  naturally getting hyped about watching each episode, despite knowing that I'd soon be eyebrows-twitching with a nervous smile on my face.\\n\\n\r\nCharacter is where the anime really shines. Each character is living, bright, and vibrant. They have their own unique style, not fitting into any preconceived mold (tsundere, moe, loli, etc). And the way that they interact with each other brings the entire anime together.\\n\\n\r\nI'd like to spend some time discussing each individual.\\n\\n\r\nMarii is your typical tsukkomi. In English, this would be the \"straight man\", someone who is serious when others joke around. Marii plays a certain varient of the tsukkomi where the tsukkomi is actually no smarter or more serious than the others, but ends up being the butt (no pun intended) of the jokes or ends up reacting to them strongly. Yuuko from Nichijou plays a similar role in her relationship with Mai and the others. Marii is dumb, rash, red-headed (which, incidentally, means about the same in Japanese culture as it does in Western cultures), and a major klutz. Probably the most dull characterwise out of the troupe, but makes up for that with her fiery attitude. She's definitely the best at drawing out the facepalms.\\n\\n\r\nTetora is the angel. She's perfect in everything she does, and she's never on the negative receiving end. She plays the calm, quiet controller of the cast, sometimes leading them around by the nose. She does have quite a wild side, and she ends up showing quite a variable display of emotions and personalities.\\n\\n\r\nKukuru is the possessed spirit. The most unique character of them all, Kukuru is the polar opposite of Tetora - always unlucky, always unfortunate. I'm assuming Imagine Breaker is located on her forehead. Regardless, she's perfectly fine with being unlucky and often plays the role of the old, possessed hag. She's downright creepy, but really awesome in a creepy sort of way. A completely special and unique type of character I'd love to see more of. With regards to the cast, she completely stands out in a corner, surrounded by dark aura, but as the discussion heats up she's able to be an integral, albeit depressing, part of the conversation.\\n\\n\r\nKigurumi is the masked demon. On the outside she's cute, fluffy, innocent, and sweet. Behind that lies a swearing, angry, heavy metal-loving girl. Her switches between the two personalities are completely surreal, and seeing one side of her makes you almost forget about her other side. An interesting character in her own right, she's able to keep the viewer continually guessing about what her true opinions are. \\n\\n\r\nGankyou is not your typical glasses girl. On the contrary, she loves beating up Marii and isn't all that smart. Her personality is very cool, but she can equal Marii in terms of heat and passion. Her ideas are out of this world (I swear I'm not trying to make these puns) and are often backed immediately by the rest of the crew with the exception of Marii, which leads to collective teasing and torture of the poor redhead. \\n\\n\r\nBasically, the cast is a wild bunch. Not only do they completely fly against everything that anime has shown up to now, but they also remain endearing and classic. Together, these girls become quite the unstoppable troupe of makeshift comedians.\\n\\n\r\nTo say that I didn't enjoy Joshiraku would be a lie. To say that I wasn't at times completely doubting my sanity in watching this show would also be a lie. Joshiraku is an anime that drives you to extremes, often at an extreme pace. I've never been so mindblown by a single anime.\\n\\n\r\nOverall (8/10)\\n\r\nYappari wakaranai...Joshiraku",
            "date": "2013-07-12T23:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 105093,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2258035.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/blaZofgold",
                "username": "blaZofgold"
            },
            "url": "https://myanimelist.net/reviews.php?id=105093"
        },
        {
            "content": "This anime is very hard to fully understand with subtitles only and I reckon most anime watchers will miss much of the content of Joshiraku.\r\nBut even then the contents are nothing special and the show does not appeal to me one bit. The puns aren't anything to laugh about (they are neither interesting nor funny). The setting is boring and episodes' plots are lame.\r\nI enjoyed the opening and ending and the voice acting crew was good too but those are all secondary.\r\nJoshiraku is not my cup of tea but I guess there might be people who enjoy this kind of stuff, since the show isn'tfundamentally bad otherwise.",
            "date": "2015-09-02T15:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 197699,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/39476.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Aphyxia",
                "username": "Aphyxia"
            },
            "url": "https://myanimelist.net/reviews.php?id=197699"
        },
        {
            "content": "Joshiraku is an anime form of that friend you wanna avoid. He was fun to have around because he had all these funny and long-winding stories to tell; and you didn't care if they were true or not. But, as time passes, you just wanted him to shut up. He WON'T shut up, no matter what you do or say; no matter how hard you try.\r\nYeah. Sure. The females who star in this show are cute, hot, moe, whatever. But they get under each other's skin rather quickly.\r\n* Gankyou Kuurubiyuutei (Cool Beauty 4-Eyes): The Heather / Paniponi's Rei\r\n* Marii Buratei (Bloody Mary): The \"Holler BackGirl\" and \"Physical Punchline Receiver\"\\n\r\n* Tetora Bouhatei (Tetrapod Bulkhead): The Annoyingly Lucky Girl / Mitsuko Ramuni\\n\r\n* Kigurumi Haroukitei (Hellokitty Bodysuit): Genki Girl on one side of the coin, Black Lagoon's Revy on the other\\n\r\n* Kukuru Anrakutei (Noose Euthanasia): the human female form of Decepticon's Dirge.\\n\\n\r\nSurprisingly: The wardrobe change amongst these girls, during the middle of the episode where they travel around Japan, had been cranked to 15. They wear different clothes more times than the lot of regular animu that wave around cute girls to get your attention.\\n\\n\r\nAnd also surprisingly: A lot more goes on during these episodes than during the small amount of time they're on stage.",
            "date": "2012-09-18T12:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 72653,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=72653"
        },
        {
            "content": "If I had to sum up the show in a few words: \"A comedy based on a group of 5 girls taking turns with the old boke-tsukkomi routine.\"\r\nThe show is about 5 girls who are studying the art of Japanese stage storytelling dubbed: \"rakugo\" hence the title of the show \"Joshi (meaning woman/girl) raku\".\r\nWhen it comes to the story and art one character's line,  Kukuru's: \"Stop that! The animators are doing their best even though there's little to animate,\" pretty much sums it up. As well as a literal frame in the first episode: \"This anime is full of 'ordinary' dialogue so views canfully enjoy how cute the girls are.\"\\n\\n\r\nI quoted because ordinary, as much of what they discuss is chock-full of anime , pop-culture, and nonsensical humor and gags, which is the show's selling point. I often found myself smile and laugh unconsciously. \\n\\n\r\nThat being said, it can be difficult to understand the comedy sometimes as some rely on timing of the joke or make reference to an obscure topic. I can't say that I didn't have to pause a few times throughout the show and look up meaning of punchlines or nuances in wordplay, but it didn't distract me from enjoying the show's humorous banter.\\n\\n\r\nMany of the tracks in the OST use Japanese instruments which compliments the traditional atmosphere a rakugo has.\\n\\n\r\nOverall, I had a blast watching the show. I believe if you have some knowledge of Japanese pop-culture, a bit of knowledge in the Japanese language itself, a somewhat subtle sense of humor its not difficult to find this show an interesting watch",
            "date": "2013-01-07T11:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 82966,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/20870.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KY791",
                "username": "KY791"
            },
            "url": "https://myanimelist.net/reviews.php?id=82966"
        },
        {
            "content": "\"This anime is full of ordinary dialogue, so viewers can fully enjoy how cute the girls are.\" What they didn't mention was how side splittingly amusing this so called 'ordinary dialogue' can be.\r\nJoshiraku's story or rather lack of any real progressive story is one of sheer humor. 5 friends/colleagues at the level of friendship where they can easily insult each other and not have it affect their status as well as having long pointless conversations that get completely off track and out of control. Each episode (which contains 3 stories each) all are completely different and while do reference previous episodes in the conversations, haveno real point in terms of story development\\n\\n\r\nYou watch this anime who's art style and main characters scream \"Moe\" which is backed up by the occasional \"This anime is full of ordinary dialogue\" scene. Bright colours flood the anime then they're inside a building, even dark scenes or moody takes (from one character in particular) it can easily be picked as a brighter, almost candy colour type anime. It seems childish but the type of humor they pull and discuss is anything but. Outside scenery is very well drawn with its shading that comes across as a beautiful piece of art within itself.\\n\\n\r\nSound is probably as basic as it could ever be. Little music pieces only used for opening scenes or little joke tunes played at the occasional sarcasm conversation. The Opening and Ending themes would be this anime's biggest points in terms out sound and music as not matter what mood your in they always seem to bring a smile to your face.\\n\\n\r\nCharacter is much like story for this anime in the way of, nothing really progresses but old jokes or past events that happened to characters are called upon, sometimes multiple times in later episodes, but in terms of anyone getting elevated or degraded status with other characters, nothing changes from start to finish. Their personalities however are played out so well from your average talkers, your quiet type and that one cute innocent girl that is really planning all your murders (I mean what)\\n\\n\r\nThe enjoyment... Oh god the enjoyment. There is comedy and then at least 2 or 3 tiers above it, is this anime. Their conversations always of so far off track and the original topic is forgotten beneath the mass amounts of humor. It doesn't even try to take itself seriously at all with a galore of references from small topics like everyday brands and shops to other anime and even their own animating company. Complete and utter disregard for the 4th wall some times can be done badly but somehow this always manages to pull anything from a giggle or snicker to collection of laughter in its form of presentation.",
            "date": "2014-05-09T23:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 142841,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=142841"
        },
        {
            "content": "What to make of _Joshiraku_...  So, _Joshiraku_ episode 01. It's definitely by _Zetsubou_'s author, one realizes pretty quickly; the animation is colorful and clean; the conversations gave me a few chuckles. Overall, I'm not too impressed but we'll see if the characters grow on me: I liked only some parts of the first episode of _Sayonara Zetsubou-sensei_, after all.\r\nDid it succeed? No. As presented _ragaku_ was an interesting premise but turns out to be hideously unfunny and one sympathizes with the occasional kid or person pointing out that 'once is enough' (and, as unkind an observation as this may be, one understands why theremight be only four 'seats'/theaters left). The characters are decent enough (as promised by the self-description of cute girls talking) and aren't as 'archetypal' as in _Sayonara_, and would give the occasionally alluded to K-On! a run for their money. The animation quality held up to the end, I thought.\\n\\n\r\nThere were some bits that were quite funny (I loved the Christmas story with the oversized tree). Some bits were surprisingly reflective: episode 9 has an unexpected take on Chuang-tzu which was fast enough to leave an impact, while Mari's little time-travel to the bubble era evokes Lieh-tzu's pillow story. There were more allusions to Western material than I am used to (unless the fansubbers are really messing with me), and the fourth wall bits were not annoying.\\n\\n\r\nBut overall... this was, for me, a lot like _Nichijou_: a few good parts trapped in a lot of basically filler. The dialogues and analyses weren't as sharp as _Sayonara_, the backgrounds/scenes weren't as beautiful as _Nichijou_, the overall humor weaker than _Azumanga Daioh_... I don't regret watching it, but if this was the best comedy of the season, there mustn't have been any really good ones.",
            "date": "2013-05-11T18:23:00+00:00",
            "helpful_count": 0,
            "mal_id": 96827,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/419845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/gwern",
                "username": "gwern"
            },
            "url": "https://myanimelist.net/reviews.php?id=96827"
        }
    ]
]