[
    [
        {
            "content": "Since i did a review for School Rumble Ichi Gakki (1st semester), I thought i might as well do a review for School Rumble Ni Gakki as well.\r\nStory - Like the prequel, this series barely has a storyline besides Harima after Tenma, Tenma after Karasuma. But the thing i liked about this season was the involvement between Eri and Harima. The involvement between them made this season more enjoyable for me then the prequel.\r\nArt - Just like Ichi Gakki, the art has no real difference. Still beautiful as usual.\r\nSound - I really love School Rumble's choice of music. I thought after watching Season 1, theycould never find something just as cheerful as SCRAMBLE (Guru Guru Mawaru.. Guru Guru Mawaru) but to my suprise, Sentimental Generation was just as lively and also made you want to get up and sing and dance, trust me i did that once..\\n\\n\r\nCharacter - The character are the same, i don't recall any new characters in this one (watched this a year ago, can't really remember). But one thing i remember very clearly was the character developments. I mean there were still some characters that didn't change a bit... perfect example is Lala. The character that developed most in my opinion is none other then the Ojou, Eri. (Sorry have to give a spoiler, please do not read if you haven't watched yet!) From totally disliking Harima, to slightly having good feelings for him, i thought this was the best part of School Rumble overall. &lt;--Spoiler ends here. Also you get to learn much more about each and every characters.\\n\\n\r\nEnjoyment - Again, this series is perfect enjoyment. From pure comedy to pure romance, this series is something that will keep you going after a harsh day.\\n\r\nThe only reason i gave a 9 for enjoyment was because there are about 2 fillers in this season that totally were really lame. But this is mainly because there wasn't enough manga material and 2 episodes couldn't fill in the next arc for the manga.\\n\\n\r\nOverall - Some say this series wasn't as good as its prequel, i personally do not think so. I have no right to criticize one's opinion but i shall stick to my own that this series totally bombed. Overall, if your a really huge fan School Rumble and really want to know more about a certain character, you should really consider watching this season.",
            "date": "2008-01-01T18:48:00+00:00",
            "helpful_count": 82,
            "mal_id": 1796,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/27640.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sabaa",
                "username": "Sabaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=1796"
        },
        {
            "content": "School Rumble Ni Gakki, along with its predecessor, is a school/comedy/romance anime adapted from Jin Kobayashi's manga of the same name. It continues the story of a group a students from Yagami High School who learn the ups and downs of life and love, in front of a humorous comedic backdrop.\r\nStory: Compared to the first season, the story starts off slowly with a bunch shorter stories that don't seem to develop the overall plot as much. It isn't until the mid to second half of the anime does it seem to really get back to the main storyline. The story is mainly about the characterschasing after the people they are in love with only to have their attempts fail leaving them to come up with another angle of attack (metaphorically). This anime is a nice follow-up to the first season and overall it continues the plot well.\\n\\n\r\nAnimation: Like most anime comedies, there are a lot of visual jokes, so being well animated is quite important. Studio Comet does a good job fortunately and the visual humor comes across quite nicely. Some of the funniest moments I can recall come from the character Harima's reaction to certain things and situations.\\n\\n\r\nSound: Nothing much to say on sound. The seiyuu do a good job and the music fits the anime overall. I like the opening and endings.\\n\\n\r\nCharacters: In most romance/comedies and in this one as well, there are multiple love webs that exist and are the main motivations for the characters. In the first season of this anime, most of the focus is on the protagonists, Harima and Tenma. However, in the second season the scope seems to widen and greater focus is given to other characters which seemed to have a smaller role in the previous season. I like this expansion, as it makes the plot more complex and intricate.\\n\\n\r\nEnjoyment: School Rumble's (both the first season and the second) use of random, sometimes absurd comedy and good utilization of the parody help it to stand out in its genre and create many memorable moments. I dub this show a must see for comedy fans. This was one anime where I basically enjoyed every moment.",
            "date": "2007-03-20T23:41:00+00:00",
            "helpful_count": 59,
            "mal_id": 208,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/running_lemon",
                "username": "running_lemon"
            },
            "url": "https://myanimelist.net/reviews.php?id=208"
        },
        {
            "content": "So...School Rumble...I don't even know where to begin with this one...\r\nFirst let me say I will review this anime as a whole not only the second season and it might contain some minor spoilers!\r\nI will start with the conclusion for those of you who doesn't want to read the whole review. So here it goes:\r\nOverall/Conclusion - 7.8/10\r\n  Have you ever watched one of those spanish/latin soap operas or telenovelas where the characters never really manages to convey their feelings and say what they mean, especially regarding love, resulting in an never ending circle of misunderstandings and drama ? The difference is, inSchool Rumble, instead of drama you've got comedy. \\n\r\nDon't get me wrong, it's a fun series to watch from the beginning to the end and the comedy mixed with excentric characters are, probably, the key elements that will get you hooked on this series. However, if you are person like me and if you are more in the series with good story progression and characters development maybe you'll be a bit disappointed or frustrated. Still that's not a reason not to watch School Rumble, especially when you are in a mood from something relaxing and mellow.\\n\\n\r\nArt/Animation - 7.5/10\\n\\n\r\n  Although it's nothing you would expect from a recent anime, the art is not bad at all. I like the characters design and I think it fitted well with their personalities. Also I was impressed with the level of animation used is some of the scenes that required more action, although some of them were useless and not needed for this genre. This really shows the animation had more potential but also the fact that the animation buget was poorly used on scenes that don't really matter. Also, they could've work more on backgrounds and characters details but it dosen't really matter anyway, since you'll be more frustrated with other things than art in the end, trust me.\\n\\n\\n\r\nSound - 9.5/10\\n\\n\r\n I think the sound is the best part of School Rumble . The sound is in perfect tune with atmosphere and tone of the series and as a whole it adds great value to this anime. But...man...the most memorable songs are the opening and ending themes from the first season. The feel-good theme of this two songs perfectly complements the first season. and even if you don't like the show I think it will make you wanting to watch the next episodes just to listen to this songs again and, eventually you will find yourself humming along in no time. Although, at first I didn't like the opening theme from the second season, after listening to it a few times, I found Sentimental Generation to be as catchy as Scramble from the first season. I can't say the same thing about the first ending theme for the second season and I'm glad they've replaced it later with Futari Wa Wasurechau which perfectly fits the whole second season ending. As for voice actors, besides Lala, which is way overexagerated character overall, all the voice actors were really good and matched the personality of each character. Special mentions goes to Noto Mamiko and Koshimizu Ami for the voices of Yakumo and Tenma - I loved them both.\\n\\n\r\nCharacters - 7/10\\n\\n\r\n  Here comes the area where I talk about the first problem of the series. There are alot of main and supporting characters in this series and the problem is how they are handled. To be more specific, many of the supporting characters are randomly brought up in the spotlight with some random stories at the expense of the main characters which are sent into oblivion, at times, for 2-3 episodes. This happens mostly on the second season but the first one is no exception. In this way, really few of the main characters get some sort of development or progression and it's disappointing beacuse I wanted to see more of Akira, Eri and Yakumo instead of some random story with some random support character or even worse a filler.\\n\\n\r\nStory - 6/10 SOME MINORS SPOILERS HERE! Skip if it bothers you!\\n\\n\r\n  Unfortunately,this is the weakest part of series and the second problem.\\n\r\nThere aren't so many good things to say here due to the fact that is no real progression or development on the story. I mean the producers really loved to troll us from the beginning through the end, at least regarding the story. When you think something important may happen that will make the story progress, think twice because your are wrong. If something happens, it happens in such a way that the relations between characters are not affected at all in the next episode. In the beginning it's funny but after a while and through the end this never ending circle gets very frustrating. What more can I say...I think Scramble opening theme describes the best the whole story concept behind this series so...Guruguru mawaru guruguru mawaru!!\\n\\n\r\nEnjoyment - 8/10\\n\\n\r\n  If you love the anime in the comedy genre you'll have a blast watching this one but if you also love any type of development in anime and you want any type of closure maybe you will be a bit frustrated as I've been.",
            "date": "2015-03-25T06:37:00+00:00",
            "helpful_count": 21,
            "mal_id": 183321,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017661.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mannoh",
                "username": "Mannoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=183321"
        },
        {
            "content": "*This a review of both seasons of School Rumble\r\nSchool Rumble was a series that I was interested in, but had putting off for a while. However, after I had finished watching Kokoro Connect, I was in mood to watch something similar, so I finally decided to watch School Rumble. I wasn’t sure what to expect from this series. Partially because it’s a romantic comedy that some people listed under the shounen genre, and that the name of the series is School Rumble. I was also hesitant to watch this series in part because the series was originally released in 2004, and I was very skepticalabout the quality of the animation. But series definitely surprised me, and it ending up being the one of the most entertaining anime I’ve watched in a while.\\n\\n\r\nStory:\\n\\n\r\nSchool Rumble’s story revolves around the popular TV theme of unrequited love, but it approaches it from a mostly comedic prospective. A lot of the comedy in this series comes from unfortunate misunderstandings between the characters. The two main characters, Kenji Harima, who is in love with Tenma, and Tenma Tsukamoto, who is in love with their classmate Karasuma, both can’t ever find a way express their feelings to one another. Their efforts often result in horrible misunderstandings or bitter failures. Their efforts, along with other characters love interest and interactions, make for some hilarious moments throughout the series. The show doesn’t take itself too seriously, and usually substitutes drama and angst for comedy. While there are moments in this anime where the tone is more serious, and even sad at times, it doesn’t take long for it to bounce back its generally upbeat atmosphere. The story isn’t deep or thought provoking, but it serves it’s purpose by giving the characters a motive for the actions they take in every episode. My only issue with the story is its lack of an ending. As I pointed out in a previous article, the “conclusion” OVA was incredibly rushed, and didn’t cover everything that it was supposed to cover so I didn’t, and don’t plan to, watch it. So I’m judging the story based on the ending of the second season, and there wasn’t one. There were so many things left wide open, and it was very disappointing to see the series end without a proper conclusion.\\n\\n\r\nAnimation:\\n\\n\r\nThe animation is definitely School Rumble’s weakest point. While it’s not bad, it’s definitely not very good animation. It gets the job done, with decently well-defined characters and backgrounds, but it’s not anything noteworthy.\\n\\n\r\nSound:\\n\\n\r\nThe sound in this series is very well done. The music definitely fits the atmosphere and tone of the scenes that they are used in, and all of the tracks sound really good. But the stars of the soundtrack are the openings and endings. School Rumble’s first opening and ending are probably the catchiest opening and ending themes I’ve ever heard. They are both really enjoyable to listen too. I’ve probably watched and listened to the first ending more than any other ending I’ve seen. The other openings and endings are all well done, entertaining, and fit the style of the series.\\n\\n\r\nCharacters:\\n\\n\r\nThe characters in this series are all very likeable and fun to watch. From the main characters, Tenma and Harima, to the wide cast of supporting and side characters. While there some characters get more development and backstory than others, we are given some background information and development on all of the major supporting characters. The wide cast of characters is pretty diverse with several different personalities. This could lead to you loving, and or hating several characters in this series, but that is definitely not a bad thing. The main theme in the story is struggling in love, and that’s where a lot of the changes in the characters come from. Their successes and failures have a big impact on them, and we get to see how they all progress through the two seasons.\\n\\n\r\nEnjoyment:\\n\\n\r\nSchool Rumble was absolutely hilarious. It found myself constantly laughing, and I couldn’t wait to get to the next episode. The humor can feel somewhat repetitive, but that feeling never last for very long.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 3.4/5\\n\\n\r\nAnimation: 3.2/5\\n\\n\r\nSound: 4.2/5\\n\\n\r\nCharacters: 4.3/5\\n\\n\r\nEnjoyment: 4.4/5\\n\\n\r\nVerdict: 3.9/5\\n\\n\r\nYou will love School Rumble if you’re into romantic comedies, or slapstick comedies in general.",
            "date": "2014-10-25T09:35:00+00:00",
            "helpful_count": 20,
            "mal_id": 166117,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=166117"
        },
        {
            "content": "A sequal that is better than its prequel? Yes.\r\nSchool Rumble Ni Gakki delivers in a better way than its prequel did. With better animation and art and funnier side plots aside from the main plot, which by the way is almost non-existant, made this anime better than the first in the series. It also made it one of the top animes in its genre.\r\nIn the second season we are introduced to nothing new really, only more of what was before, more of Harima which is this animes one truly redeeming character. You have to agree with me that sometimes you get slightly frustrated with howthe main character woons after someone who is fundamentally so boring and dull that it's an abomination he is allowed to breath the same animated air as Harima Kenji. Still, when these small fits come over me I just remind myself that the storyboard and screenplay wanted the viewers to feel like this and it calms you down, a bit.\\n\\n\r\nTruly, the one thing that makes School Rumble, both the first and the second season, good are every single character except the female lead and her love interest. This accomplishment is worth mentioning by itself and could only have been accomplished by not having too much of a story/plot. Then again this genre (love/comedy/parody/slapstick) does not need too much of a story/plot to become satisfactory enough to be worth watching.\\n\\n\r\nWhat you need are characters and as I previously stated characters and character interaction are this animes main features. Harima Kenji together with most other characters that exist for comic relief (which basically is every single one) holds this anime up and carries it to an end that isn't an end, this is of course no surprise, first of all it's hard to make real endings at all in anime, secondly it is especially hard for this particular genre and let us not forget that they need to leave room for a possible third season.",
            "date": "2009-04-19T06:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 14301,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=14301"
        },
        {
            "content": "School Rumble is what I believe we all wish our High School lives would be like. The eccentric characters and even weirder plot twists are very funny and leave much for the mind to crave. The weird love relationships in this story keep you clicking episode after episode, hoping they find a resolve to their romance, but I'm sorry to tell you this people, there's no happy ending.\r\n*SPOILER ALERT*\r\nAfter the first season, you think they have found a resolution, but no they didn't, although funny (and literally out of this world) its just a hallucination. Then once you get to the second season, even moreconfusion arises, especially towards the ending (again).\\n\r\nLet's put it this way, if you are one of those people who watch anime because of it's length then watch this. If your one of those people who watch for its great plot and definite ending (and I stress this enough) don't watch this. Even the OVA kind of ticked me off because it jumps off nowhere and leaves me lost.\\n\\n\r\nOverall I give this anime an 7.5/10, only because of the ending...stupid ending!",
            "date": "2009-04-01T20:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 13762,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13762"
        },
        {
            "content": "It has been a while since I saw the first season of School rumble. I don't remember much of it, except it was a lot of fun. So I had to check this one out too.\r\nOverall, it is a shallow but very fun comedy.\r\nAnimation\t\r\nActually, there are very few animes with an animation style I don't like. SR2 looks as good as most \"school life\" animes out there, nothing spectacular but the characters are very well designed and there are lots of awesome scenes (often dream sequences or surreal shots to show off an emotion) that mostly fit in.\r\nSound\t\r\nI was quite surprised to notice that thereare no extremely annoying voice acting in this series. There are almost always at least one character (often female) that I find very irritating due to her voice. But not here (ok, Lala balances on the border).\\n\\n\r\nThe intro song is nice, but no top-ten material. I mostly skipped the ending songs, I found them boring. The background music fits the crazy theme, but some tunes get repetetive after a few dozen plays.\\n\\n\r\nStory\t\\n\r\nOk, X loves Y, Y loves Z, Z loves W who loves Y, yadda yadda. The whole series is all about love triangles, which of course opens up for lots of hilarious moments. Sadly, these hilarious moments get too many and get in the way for a decent story/character development.\\n\\n\r\nSince no one ever ever dare to confess their feelings to their loved one, everything rolls on and on in the same way the whole series. A few confessions and breakups would have kept the series more interesting.\\n\\n\r\nAll this said, there are still lots and lots of humour and funny moments, and that is obviously what School rumble is about.\\n\\n\r\nCharacter\t\\n\r\nMost of the characters are likeable, and there are a lot of them! Many of the secondary characters were a bit hard to tell apart, though. I suppose I should have watched the 1st season directly before this one. \\n\\n\r\nCharacter development is almost non-existant. Towards the end you get to know the Tsukamoto sisters a bit better, but overall the characters are very flat. This is not entirelly bad, though, since their personalities often are interesting enough to keep you focussed for a while, but towars the end of the season it feels a bit monotonous.\\n\\n\r\nValue\t\\n\r\nI'll probably watch this one together with the 1st season again in a couple of years, just to re-experience the hilarious atmosphere.",
            "date": "2015-02-06T11:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 179815,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146571.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/brynolf",
                "username": "brynolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=179815"
        },
        {
            "content": "Second season of SR and its as good as the first, Funny , hilarious, and just plain out silly. Its starts out very strong and good, but it got a little confusing and lost on some episodes, but overall its good for the second season.",
            "date": "2009-06-17T01:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 15826,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194998.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xDoN904",
                "username": "xDoN904"
            },
            "url": "https://myanimelist.net/reviews.php?id=15826"
        },
        {
            "content": "This is my most favorite anime, though still feel hurt. but this anime is very good, especially the characters in this anime, explains how the struggle of love.\r\nThe first time watching, I felt Tenma is the main character in this anime, but with the passing of Harima Kenji's story turns out to be the main character ..\r\nHarima Kenji is very severe struggle. I was thrilled to watch it ..",
            "date": "2010-06-17T21:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 27267,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/--Sunclaudius",
                "username": "--Sunclaudius"
            },
            "url": "https://myanimelist.net/reviews.php?id=27267"
        },
        {
            "content": "I started out watching the School Rumble anime (English sub, I unfortunately don’t understand the Japanese language) and really just expected it to be what it appeared to be – a funny comedy anime. I was partially right about that, but also VERY wrong. School Rumble, on the surface, doesn’t seem very serious. But so many things underneath the surface of it are very serious and insightful and even deeply moving. Soon after starting the anime I was hooked, and almost immediately related to Harima Kenji and began cheering him on to accomplish his goal. Throughout the beginning and middle of the series we seeHarima failing over and over at his attempts to confess his feelings to Tenma. At first it’s laughable how silly and avoidable the misunderstandings are. Then as the series continues and you begin to see the toll it takes on Harima and the amount of pain it starts to cause him it begins to get less and less bearable to watch. Of course with all the other great characters and stories in School Rumble you are still thoroughly hooked on the series, and besides, you feel that you have to see the series through to the end to see if Harima wins the heart of the girl he loves. You also feel you have to see what happens with Hanai, Eri, Yakumo, Ichijou, Mikoto, and all the other very well written and interesting characters. The ending of the first season makes you think Harima finally confesses his love to Tenma, but it ends up being imaginary. At this point I was physically fatigued and drained from the roller coaster of emotions and disappointments throughout the first season. But at the same time I couldn’t wait to watch the second season. The second season was great of course, although in the Harima and Tenma storyline it just got more and more painful to watch. More misunderstandings, more missed opportunities, more outside interference and assumptions of who Harima did or didn’t like from his classmates. More oblivousness from Tenma as she chases after the completely blank Karasuma. The second season wraps up with no resolution. So, disappointed and borderline depressed I watch the 3rd season, which is actually just two OVAs.\\n\\n\r\nResult: Complete and utter heart wrenching emptiness. Harima has been emotionally tortured and left to die basically. Tenma is gone to America to be with Karasuma and become a nurse to take care of him because he is in the hospital there with a condition that has wiped out his memory. He doesn’t even know who she is but she still wants to be with him. Harima does not get the girl. In fact no one gets anyone. Almost every story line is left unfinished.\\n\\n\r\nI was fully depressed and left with an empty feeling inside. That’s the best way I can describe it. I had to have answers. I found the manga and began reading immediately.\\n\\n\r\nAfter reading through the ENTIRE manga and then the follow up manga “School Rumble Z” I had to face harsh reality…….there was NO conclusion. No happy couples, no loose ends tied up, no happily ever after or riding off into the sunset. Just more emptiness and depression. It was as if the characters had been killed in the prime of their lives and their futures were cut short. There is no way you can understand the way it feels unless you’ve been on this journey that is School Rumble. It’s incomparable.\\n\\n\r\nI couldn’t believe it. I searched all over the internet for any and all information about School Rumble and it’s creator Jin Kobayashi. I began reaching out to fans and hearing their stories that were the same as mine. The way they felt at the end of it all was like my story. The wave of emotions: shock and disbelief, confusion, emptiness, depression, and bitterness.\\n\\n\r\nThere is much much more to this story. But that’s basically how I got started on this mission to reach Mr. Kobayashi. There have been moments of slight progress, and a few disappointments. Ups and downs, feeling like I’m all alone in this, and then feeling the love and support of School Rumble fans from many different countries around the world. One thing is certain, I have no plans of EVER giving up.\\n\\n\r\nIn closing, here’s the motto: Justice for Harima, closure for the fans, may the hero get his girl, may his spring finally come.\\n\\n\r\nhttps://www.youtube.com/channel/UC05xAG4hMwmeu4XdFei9Ywg\\n",
            "date": "2015-12-04T19:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 204803,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648190.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JKHM",
                "username": "JKHM"
            },
            "url": "https://myanimelist.net/reviews.php?id=204803"
        },
        {
            "content": "It's amazing Anime. I loved the story I think It's kinda different & chotto creative.\r\nI can rewatch some eps 'cause It was so funny and enjoyable.\r\nI love Harima-Kan It's sincere man & have true love. he doesn't wanna hurt Tenma by any way even he had to do that. and the most interesting is he eats any food made it Tenma LOL.\r\nBut I'm not happy 'cause of the end. It's open end and I didn't know that!\r\nIf I knew it I wouldn't complete watching. but anyways It's a great memory for me always and forever.",
            "date": "2011-11-25T14:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 48029,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/945697.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Harima_Ray",
                "username": "Harima_Ray"
            },
            "url": "https://myanimelist.net/reviews.php?id=48029"
        }
    ],
    [
        {
            "content": "Since i did a review for School Rumble Ichi Gakki (1st semester), I thought i might as well do a review for School Rumble Ni Gakki as well.\r\nStory - Like the prequel, this series barely has a storyline besides Harima after Tenma, Tenma after Karasuma. But the thing i liked about this season was the involvement between Eri and Harima. The involvement between them made this season more enjoyable for me then the prequel.\r\nArt - Just like Ichi Gakki, the art has no real difference. Still beautiful as usual.\r\nSound - I really love School Rumble's choice of music. I thought after watching Season 1, theycould never find something just as cheerful as SCRAMBLE (Guru Guru Mawaru.. Guru Guru Mawaru) but to my suprise, Sentimental Generation was just as lively and also made you want to get up and sing and dance, trust me i did that once..\\n\\n\r\nCharacter - The character are the same, i don't recall any new characters in this one (watched this a year ago, can't really remember). But one thing i remember very clearly was the character developments. I mean there were still some characters that didn't change a bit... perfect example is Lala. The character that developed most in my opinion is none other then the Ojou, Eri. (Sorry have to give a spoiler, please do not read if you haven't watched yet!) From totally disliking Harima, to slightly having good feelings for him, i thought this was the best part of School Rumble overall. &lt;--Spoiler ends here. Also you get to learn much more about each and every characters.\\n\\n\r\nEnjoyment - Again, this series is perfect enjoyment. From pure comedy to pure romance, this series is something that will keep you going after a harsh day.\\n\r\nThe only reason i gave a 9 for enjoyment was because there are about 2 fillers in this season that totally were really lame. But this is mainly because there wasn't enough manga material and 2 episodes couldn't fill in the next arc for the manga.\\n\\n\r\nOverall - Some say this series wasn't as good as its prequel, i personally do not think so. I have no right to criticize one's opinion but i shall stick to my own that this series totally bombed. Overall, if your a really huge fan School Rumble and really want to know more about a certain character, you should really consider watching this season.",
            "date": "2008-01-01T18:48:00+00:00",
            "helpful_count": 82,
            "mal_id": 1796,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/27640.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Sabaa",
                "username": "Sabaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=1796"
        },
        {
            "content": "School Rumble Ni Gakki, along with its predecessor, is a school/comedy/romance anime adapted from Jin Kobayashi's manga of the same name. It continues the story of a group a students from Yagami High School who learn the ups and downs of life and love, in front of a humorous comedic backdrop.\r\nStory: Compared to the first season, the story starts off slowly with a bunch shorter stories that don't seem to develop the overall plot as much. It isn't until the mid to second half of the anime does it seem to really get back to the main storyline. The story is mainly about the characterschasing after the people they are in love with only to have their attempts fail leaving them to come up with another angle of attack (metaphorically). This anime is a nice follow-up to the first season and overall it continues the plot well.\\n\\n\r\nAnimation: Like most anime comedies, there are a lot of visual jokes, so being well animated is quite important. Studio Comet does a good job fortunately and the visual humor comes across quite nicely. Some of the funniest moments I can recall come from the character Harima's reaction to certain things and situations.\\n\\n\r\nSound: Nothing much to say on sound. The seiyuu do a good job and the music fits the anime overall. I like the opening and endings.\\n\\n\r\nCharacters: In most romance/comedies and in this one as well, there are multiple love webs that exist and are the main motivations for the characters. In the first season of this anime, most of the focus is on the protagonists, Harima and Tenma. However, in the second season the scope seems to widen and greater focus is given to other characters which seemed to have a smaller role in the previous season. I like this expansion, as it makes the plot more complex and intricate.\\n\\n\r\nEnjoyment: School Rumble's (both the first season and the second) use of random, sometimes absurd comedy and good utilization of the parody help it to stand out in its genre and create many memorable moments. I dub this show a must see for comedy fans. This was one anime where I basically enjoyed every moment.",
            "date": "2007-03-20T23:41:00+00:00",
            "helpful_count": 59,
            "mal_id": 208,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/635.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/running_lemon",
                "username": "running_lemon"
            },
            "url": "https://myanimelist.net/reviews.php?id=208"
        },
        {
            "content": "So...School Rumble...I don't even know where to begin with this one...\r\nFirst let me say I will review this anime as a whole not only the second season and it might contain some minor spoilers!\r\nI will start with the conclusion for those of you who doesn't want to read the whole review. So here it goes:\r\nOverall/Conclusion - 7.8/10\r\n  Have you ever watched one of those spanish/latin soap operas or telenovelas where the characters never really manages to convey their feelings and say what they mean, especially regarding love, resulting in an never ending circle of misunderstandings and drama ? The difference is, inSchool Rumble, instead of drama you've got comedy. \\n\r\nDon't get me wrong, it's a fun series to watch from the beginning to the end and the comedy mixed with excentric characters are, probably, the key elements that will get you hooked on this series. However, if you are person like me and if you are more in the series with good story progression and characters development maybe you'll be a bit disappointed or frustrated. Still that's not a reason not to watch School Rumble, especially when you are in a mood from something relaxing and mellow.\\n\\n\r\nArt/Animation - 7.5/10\\n\\n\r\n  Although it's nothing you would expect from a recent anime, the art is not bad at all. I like the characters design and I think it fitted well with their personalities. Also I was impressed with the level of animation used is some of the scenes that required more action, although some of them were useless and not needed for this genre. This really shows the animation had more potential but also the fact that the animation buget was poorly used on scenes that don't really matter. Also, they could've work more on backgrounds and characters details but it dosen't really matter anyway, since you'll be more frustrated with other things than art in the end, trust me.\\n\\n\\n\r\nSound - 9.5/10\\n\\n\r\n I think the sound is the best part of School Rumble . The sound is in perfect tune with atmosphere and tone of the series and as a whole it adds great value to this anime. But...man...the most memorable songs are the opening and ending themes from the first season. The feel-good theme of this two songs perfectly complements the first season. and even if you don't like the show I think it will make you wanting to watch the next episodes just to listen to this songs again and, eventually you will find yourself humming along in no time. Although, at first I didn't like the opening theme from the second season, after listening to it a few times, I found Sentimental Generation to be as catchy as Scramble from the first season. I can't say the same thing about the first ending theme for the second season and I'm glad they've replaced it later with Futari Wa Wasurechau which perfectly fits the whole second season ending. As for voice actors, besides Lala, which is way overexagerated character overall, all the voice actors were really good and matched the personality of each character. Special mentions goes to Noto Mamiko and Koshimizu Ami for the voices of Yakumo and Tenma - I loved them both.\\n\\n\r\nCharacters - 7/10\\n\\n\r\n  Here comes the area where I talk about the first problem of the series. There are alot of main and supporting characters in this series and the problem is how they are handled. To be more specific, many of the supporting characters are randomly brought up in the spotlight with some random stories at the expense of the main characters which are sent into oblivion, at times, for 2-3 episodes. This happens mostly on the second season but the first one is no exception. In this way, really few of the main characters get some sort of development or progression and it's disappointing beacuse I wanted to see more of Akira, Eri and Yakumo instead of some random story with some random support character or even worse a filler.\\n\\n\r\nStory - 6/10 SOME MINORS SPOILERS HERE! Skip if it bothers you!\\n\\n\r\n  Unfortunately,this is the weakest part of series and the second problem.\\n\r\nThere aren't so many good things to say here due to the fact that is no real progression or development on the story. I mean the producers really loved to troll us from the beginning through the end, at least regarding the story. When you think something important may happen that will make the story progress, think twice because your are wrong. If something happens, it happens in such a way that the relations between characters are not affected at all in the next episode. In the beginning it's funny but after a while and through the end this never ending circle gets very frustrating. What more can I say...I think Scramble opening theme describes the best the whole story concept behind this series so...Guruguru mawaru guruguru mawaru!!\\n\\n\r\nEnjoyment - 8/10\\n\\n\r\n  If you love the anime in the comedy genre you'll have a blast watching this one but if you also love any type of development in anime and you want any type of closure maybe you will be a bit frustrated as I've been.",
            "date": "2015-03-25T06:37:00+00:00",
            "helpful_count": 21,
            "mal_id": 183321,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017661.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Mannoh",
                "username": "Mannoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=183321"
        },
        {
            "content": "*This a review of both seasons of School Rumble\r\nSchool Rumble was a series that I was interested in, but had putting off for a while. However, after I had finished watching Kokoro Connect, I was in mood to watch something similar, so I finally decided to watch School Rumble. I wasn’t sure what to expect from this series. Partially because it’s a romantic comedy that some people listed under the shounen genre, and that the name of the series is School Rumble. I was also hesitant to watch this series in part because the series was originally released in 2004, and I was very skepticalabout the quality of the animation. But series definitely surprised me, and it ending up being the one of the most entertaining anime I’ve watched in a while.\\n\\n\r\nStory:\\n\\n\r\nSchool Rumble’s story revolves around the popular TV theme of unrequited love, but it approaches it from a mostly comedic prospective. A lot of the comedy in this series comes from unfortunate misunderstandings between the characters. The two main characters, Kenji Harima, who is in love with Tenma, and Tenma Tsukamoto, who is in love with their classmate Karasuma, both can’t ever find a way express their feelings to one another. Their efforts often result in horrible misunderstandings or bitter failures. Their efforts, along with other characters love interest and interactions, make for some hilarious moments throughout the series. The show doesn’t take itself too seriously, and usually substitutes drama and angst for comedy. While there are moments in this anime where the tone is more serious, and even sad at times, it doesn’t take long for it to bounce back its generally upbeat atmosphere. The story isn’t deep or thought provoking, but it serves it’s purpose by giving the characters a motive for the actions they take in every episode. My only issue with the story is its lack of an ending. As I pointed out in a previous article, the “conclusion” OVA was incredibly rushed, and didn’t cover everything that it was supposed to cover so I didn’t, and don’t plan to, watch it. So I’m judging the story based on the ending of the second season, and there wasn’t one. There were so many things left wide open, and it was very disappointing to see the series end without a proper conclusion.\\n\\n\r\nAnimation:\\n\\n\r\nThe animation is definitely School Rumble’s weakest point. While it’s not bad, it’s definitely not very good animation. It gets the job done, with decently well-defined characters and backgrounds, but it’s not anything noteworthy.\\n\\n\r\nSound:\\n\\n\r\nThe sound in this series is very well done. The music definitely fits the atmosphere and tone of the scenes that they are used in, and all of the tracks sound really good. But the stars of the soundtrack are the openings and endings. School Rumble’s first opening and ending are probably the catchiest opening and ending themes I’ve ever heard. They are both really enjoyable to listen too. I’ve probably watched and listened to the first ending more than any other ending I’ve seen. The other openings and endings are all well done, entertaining, and fit the style of the series.\\n\\n\r\nCharacters:\\n\\n\r\nThe characters in this series are all very likeable and fun to watch. From the main characters, Tenma and Harima, to the wide cast of supporting and side characters. While there some characters get more development and backstory than others, we are given some background information and development on all of the major supporting characters. The wide cast of characters is pretty diverse with several different personalities. This could lead to you loving, and or hating several characters in this series, but that is definitely not a bad thing. The main theme in the story is struggling in love, and that’s where a lot of the changes in the characters come from. Their successes and failures have a big impact on them, and we get to see how they all progress through the two seasons.\\n\\n\r\nEnjoyment:\\n\\n\r\nSchool Rumble was absolutely hilarious. It found myself constantly laughing, and I couldn’t wait to get to the next episode. The humor can feel somewhat repetitive, but that feeling never last for very long.\\n\\n\r\nVerdict & Breakdown:\\n\\n\r\nStory: 3.4/5\\n\\n\r\nAnimation: 3.2/5\\n\\n\r\nSound: 4.2/5\\n\\n\r\nCharacters: 4.3/5\\n\\n\r\nEnjoyment: 4.4/5\\n\\n\r\nVerdict: 3.9/5\\n\\n\r\nYou will love School Rumble if you’re into romantic comedies, or slapstick comedies in general.",
            "date": "2014-10-25T09:35:00+00:00",
            "helpful_count": 20,
            "mal_id": 166117,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4196545.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Thisvthattv",
                "username": "Thisvthattv"
            },
            "url": "https://myanimelist.net/reviews.php?id=166117"
        },
        {
            "content": "A sequal that is better than its prequel? Yes.\r\nSchool Rumble Ni Gakki delivers in a better way than its prequel did. With better animation and art and funnier side plots aside from the main plot, which by the way is almost non-existant, made this anime better than the first in the series. It also made it one of the top animes in its genre.\r\nIn the second season we are introduced to nothing new really, only more of what was before, more of Harima which is this animes one truly redeeming character. You have to agree with me that sometimes you get slightly frustrated with howthe main character woons after someone who is fundamentally so boring and dull that it's an abomination he is allowed to breath the same animated air as Harima Kenji. Still, when these small fits come over me I just remind myself that the storyboard and screenplay wanted the viewers to feel like this and it calms you down, a bit.\\n\\n\r\nTruly, the one thing that makes School Rumble, both the first and the second season, good are every single character except the female lead and her love interest. This accomplishment is worth mentioning by itself and could only have been accomplished by not having too much of a story/plot. Then again this genre (love/comedy/parody/slapstick) does not need too much of a story/plot to become satisfactory enough to be worth watching.\\n\\n\r\nWhat you need are characters and as I previously stated characters and character interaction are this animes main features. Harima Kenji together with most other characters that exist for comic relief (which basically is every single one) holds this anime up and carries it to an end that isn't an end, this is of course no surprise, first of all it's hard to make real endings at all in anime, secondly it is especially hard for this particular genre and let us not forget that they need to leave room for a possible third season.",
            "date": "2009-04-19T06:16:00+00:00",
            "helpful_count": 10,
            "mal_id": 14301,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150948.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Credulous",
                "username": "Credulous"
            },
            "url": "https://myanimelist.net/reviews.php?id=14301"
        },
        {
            "content": "School Rumble is what I believe we all wish our High School lives would be like. The eccentric characters and even weirder plot twists are very funny and leave much for the mind to crave. The weird love relationships in this story keep you clicking episode after episode, hoping they find a resolve to their romance, but I'm sorry to tell you this people, there's no happy ending.\r\n*SPOILER ALERT*\r\nAfter the first season, you think they have found a resolution, but no they didn't, although funny (and literally out of this world) its just a hallucination. Then once you get to the second season, even moreconfusion arises, especially towards the ending (again).\\n\r\nLet's put it this way, if you are one of those people who watch anime because of it's length then watch this. If your one of those people who watch for its great plot and definite ending (and I stress this enough) don't watch this. Even the OVA kind of ticked me off because it jumps off nowhere and leaves me lost.\\n\\n\r\nOverall I give this anime an 7.5/10, only because of the ending...stupid ending!",
            "date": "2009-04-01T20:26:00+00:00",
            "helpful_count": 6,
            "mal_id": 13762,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/155146.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/mistah-manila",
                "username": "mistah-manila"
            },
            "url": "https://myanimelist.net/reviews.php?id=13762"
        },
        {
            "content": "It has been a while since I saw the first season of School rumble. I don't remember much of it, except it was a lot of fun. So I had to check this one out too.\r\nOverall, it is a shallow but very fun comedy.\r\nAnimation\t\r\nActually, there are very few animes with an animation style I don't like. SR2 looks as good as most \"school life\" animes out there, nothing spectacular but the characters are very well designed and there are lots of awesome scenes (often dream sequences or surreal shots to show off an emotion) that mostly fit in.\r\nSound\t\r\nI was quite surprised to notice that thereare no extremely annoying voice acting in this series. There are almost always at least one character (often female) that I find very irritating due to her voice. But not here (ok, Lala balances on the border).\\n\\n\r\nThe intro song is nice, but no top-ten material. I mostly skipped the ending songs, I found them boring. The background music fits the crazy theme, but some tunes get repetetive after a few dozen plays.\\n\\n\r\nStory\t\\n\r\nOk, X loves Y, Y loves Z, Z loves W who loves Y, yadda yadda. The whole series is all about love triangles, which of course opens up for lots of hilarious moments. Sadly, these hilarious moments get too many and get in the way for a decent story/character development.\\n\\n\r\nSince no one ever ever dare to confess their feelings to their loved one, everything rolls on and on in the same way the whole series. A few confessions and breakups would have kept the series more interesting.\\n\\n\r\nAll this said, there are still lots and lots of humour and funny moments, and that is obviously what School rumble is about.\\n\\n\r\nCharacter\t\\n\r\nMost of the characters are likeable, and there are a lot of them! Many of the secondary characters were a bit hard to tell apart, though. I suppose I should have watched the 1st season directly before this one. \\n\\n\r\nCharacter development is almost non-existant. Towards the end you get to know the Tsukamoto sisters a bit better, but overall the characters are very flat. This is not entirelly bad, though, since their personalities often are interesting enough to keep you focussed for a while, but towars the end of the season it feels a bit monotonous.\\n\\n\r\nValue\t\\n\r\nI'll probably watch this one together with the 1st season again in a couple of years, just to re-experience the hilarious atmosphere.",
            "date": "2015-02-06T11:40:00+00:00",
            "helpful_count": 4,
            "mal_id": 179815,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1146571.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/brynolf",
                "username": "brynolf"
            },
            "url": "https://myanimelist.net/reviews.php?id=179815"
        },
        {
            "content": "Second season of SR and its as good as the first, Funny , hilarious, and just plain out silly. Its starts out very strong and good, but it got a little confusing and lost on some episodes, but overall its good for the second season.",
            "date": "2009-06-17T01:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 15826,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/194998.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/xDoN904",
                "username": "xDoN904"
            },
            "url": "https://myanimelist.net/reviews.php?id=15826"
        },
        {
            "content": "This is my most favorite anime, though still feel hurt. but this anime is very good, especially the characters in this anime, explains how the struggle of love.\r\nThe first time watching, I felt Tenma is the main character in this anime, but with the passing of Harima Kenji's story turns out to be the main character ..\r\nHarima Kenji is very severe struggle. I was thrilled to watch it ..",
            "date": "2010-06-17T21:10:00+00:00",
            "helpful_count": 2,
            "mal_id": 27267,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/341051.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/--Sunclaudius",
                "username": "--Sunclaudius"
            },
            "url": "https://myanimelist.net/reviews.php?id=27267"
        },
        {
            "content": "I started out watching the School Rumble anime (English sub, I unfortunately don’t understand the Japanese language) and really just expected it to be what it appeared to be – a funny comedy anime. I was partially right about that, but also VERY wrong. School Rumble, on the surface, doesn’t seem very serious. But so many things underneath the surface of it are very serious and insightful and even deeply moving. Soon after starting the anime I was hooked, and almost immediately related to Harima Kenji and began cheering him on to accomplish his goal. Throughout the beginning and middle of the series we seeHarima failing over and over at his attempts to confess his feelings to Tenma. At first it’s laughable how silly and avoidable the misunderstandings are. Then as the series continues and you begin to see the toll it takes on Harima and the amount of pain it starts to cause him it begins to get less and less bearable to watch. Of course with all the other great characters and stories in School Rumble you are still thoroughly hooked on the series, and besides, you feel that you have to see the series through to the end to see if Harima wins the heart of the girl he loves. You also feel you have to see what happens with Hanai, Eri, Yakumo, Ichijou, Mikoto, and all the other very well written and interesting characters. The ending of the first season makes you think Harima finally confesses his love to Tenma, but it ends up being imaginary. At this point I was physically fatigued and drained from the roller coaster of emotions and disappointments throughout the first season. But at the same time I couldn’t wait to watch the second season. The second season was great of course, although in the Harima and Tenma storyline it just got more and more painful to watch. More misunderstandings, more missed opportunities, more outside interference and assumptions of who Harima did or didn’t like from his classmates. More oblivousness from Tenma as she chases after the completely blank Karasuma. The second season wraps up with no resolution. So, disappointed and borderline depressed I watch the 3rd season, which is actually just two OVAs.\\n\\n\r\nResult: Complete and utter heart wrenching emptiness. Harima has been emotionally tortured and left to die basically. Tenma is gone to America to be with Karasuma and become a nurse to take care of him because he is in the hospital there with a condition that has wiped out his memory. He doesn’t even know who she is but she still wants to be with him. Harima does not get the girl. In fact no one gets anyone. Almost every story line is left unfinished.\\n\\n\r\nI was fully depressed and left with an empty feeling inside. That’s the best way I can describe it. I had to have answers. I found the manga and began reading immediately.\\n\\n\r\nAfter reading through the ENTIRE manga and then the follow up manga “School Rumble Z” I had to face harsh reality…….there was NO conclusion. No happy couples, no loose ends tied up, no happily ever after or riding off into the sunset. Just more emptiness and depression. It was as if the characters had been killed in the prime of their lives and their futures were cut short. There is no way you can understand the way it feels unless you’ve been on this journey that is School Rumble. It’s incomparable.\\n\\n\r\nI couldn’t believe it. I searched all over the internet for any and all information about School Rumble and it’s creator Jin Kobayashi. I began reaching out to fans and hearing their stories that were the same as mine. The way they felt at the end of it all was like my story. The wave of emotions: shock and disbelief, confusion, emptiness, depression, and bitterness.\\n\\n\r\nThere is much much more to this story. But that’s basically how I got started on this mission to reach Mr. Kobayashi. There have been moments of slight progress, and a few disappointments. Ups and downs, feeling like I’m all alone in this, and then feeling the love and support of School Rumble fans from many different countries around the world. One thing is certain, I have no plans of EVER giving up.\\n\\n\r\nIn closing, here’s the motto: Justice for Harima, closure for the fans, may the hero get his girl, may his spring finally come.\\n\\n\r\nhttps://www.youtube.com/channel/UC05xAG4hMwmeu4XdFei9Ywg\\n",
            "date": "2015-12-04T19:17:00+00:00",
            "helpful_count": 2,
            "mal_id": 204803,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4648190.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/JKHM",
                "username": "JKHM"
            },
            "url": "https://myanimelist.net/reviews.php?id=204803"
        },
        {
            "content": "It's amazing Anime. I loved the story I think It's kinda different & chotto creative.\r\nI can rewatch some eps 'cause It was so funny and enjoyable.\r\nI love Harima-Kan It's sincere man & have true love. he doesn't wanna hurt Tenma by any way even he had to do that. and the most interesting is he eats any food made it Tenma LOL.\r\nBut I'm not happy 'cause of the end. It's open end and I didn't know that!\r\nIf I knew it I wouldn't complete watching. but anyways It's a great memory for me always and forever.",
            "date": "2011-11-25T14:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 48029,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/945697.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Harima_Ray",
                "username": "Harima_Ray"
            },
            "url": "https://myanimelist.net/reviews.php?id=48029"
        }
    ]
]