[
    [
        {
            "content": "This anime was a beautiful anime that I eagerly awaited each week. The art was wonderful with stunning colors and beautiful designs, and the voice acting was very good. I loved the character development and the costumes for each character. This anime is very much a reverse harem, if you don't like those, then maybe you shouldn't watch this anime, but you might be astounded by the interesting storyline. I believe this anime is based off an otome type game, and while I haven't played the game, I quite like the anime. This anime has a kind and caring main character who try's her bestto be helpful and make the best of the situation. The main character is surrounded by gods from different cultures who each bring a different persona to the mix. This anime was very fun and made me laugh. I ecspecially loved the little shorts at the end of each episode.",
            "date": "2014-06-22T13:39:00+00:00",
            "helpful_count": 60,
            "mal_id": 148063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3809005.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LollipopXXX",
                "username": "LollipopXXX"
            },
            "url": "https://myanimelist.net/reviews.php?id=148063"
        },
        {
            "content": "I am a big fan of well executed reverse harems, and I can certainly add this anime to the list of good ones. So here goes!\r\nStory: 7\r\nThis anime had every element I would expect from a good reverse harem. It begins by introducing the situation (a bunch of gods and one human chick forced to attend a school where they must learn about the human heart before they are allowed to leave and go back to their own worlds) and then begins working on developing each character little by little. At first, the episodes are pretty much what you'd expect from a reverse harem: eachseems to focus one one specific dude and a certain problem that the heroine assists them in solving, with a couple of episodes thrown in that feature the group as a whole overcoming a problem together.   This is done very well- there's plenty of humor and drama thrown in there. Near the end of the show, a main plot begins to surface that builds up to the show's climax, but the earlier episodes give plenty of time for the relationships between characters to develop.\\n\\n\r\nHowever, what really surprised me about was the lack of... romance. Yes, there is a little bit. But romance is certainly NOT the main idea of this show.  I was expecting the more general reverse harem trend, where the heroine 'dates' or has strong romantic connections with one or more of the characters, but in this show, while there are certainly hints of romance and flirting, there is little focus on romantic love. The relationships that the heroine develops with the gods are very friendly but close- sort of like how a sister would love her brother. There is a very strong focus on friendship in this show. In short, Kamigami no Asobi tis more about a girl who helps a bunch of incredibly hot gods with their complicated bromances than with a girl who falls in love with a bunch of hot guys- which is refreshing, but at the same time, a bit disappointing. I was hoping that Yui would end up with a guy the whole time, but nothing really happens, which is why I didn't rate the show a 9.\\n\\n\r\nArt: 10\\n\r\nThe characters were all beautiful. The heroine was pretty (I'm not entirely sure why she needed purple hair if she was supposed to be a normal human, but what am I expecting, this is anime) and the guys were all attractive. The attractive characters were attractive, and they were designed in ways that perfectly matched their attitudes. The hair and eyes were all great.\\n\r\nThe setting was also gorgeous and well done. Crisp architecture and nature, no complaints here.  \\n\\n\r\nSound: 6\\n\r\nI didn't really like the OP, but I guess it fit the show. I though the closing song was much catchier and upbeat, but I have questionable taste in music.\\n\r\nThe soundtrack for this anime was pretty normal. I guess the fact that I didn't notice anything meant that it fit well, but I also didn't particularly like the sound, so I'm giving it a 6. \\n\\n\\n\r\nCharacter: 8\\n\r\nRecent reverse harems have been plagued by the same problem: a 'heroine' who is nothing but an empty passive shell. Fortunately, the leading lady in Kamigami no Asobi is anything but. She is kind and compassionate, has actual emotions, and is capable of making meaningful connections with all of the guys she's surrounded with. Given the near impossible task of getting a group of guys (god guys, no less) to understand the human heart, she actually cares for all of them and builds friendships with them.\\n\\n\r\nThe gods in the show certainly fulfill the 'hot guy' aspect that reverse harems all have, and while they are all very well written, a few of their personalities are a bit stale, and frankly, I've seem then before.\\n\\n\r\nThe 'perfect' guy who is incredibly friendly and kind to the heroine but has a past that he can't get over? Check.\\n\r\nThe rebel who is a total jerk to the heroine at first but turns out to be misunderstood? Check. \\n\r\nThe guy plagued by misery who wants to keep others away so he won't hurt them? Check. \\n\r\nThe very analytical guy who doesn't understand emotion and treats everything as a mission? Check. \\n\\n\r\nWhile these are a bit overused, I can't say I disliked any of the characters.  They all fulfilled their purposes as intended. However, my favorite character in the entire show was actually sort of a side character- the gods' teacher, Thoth. I found his habits of cornering Yui and yelling at her, the insulting but hilarious nicknames he gave all of his students, and the generally vindictive, sarcastic attitude he has really funny. He was probably the most unique character and in the show, and he's the reason character didn't get a 7 instead of an 8.\\n\\n\r\nEnjoyment: 9\\n\r\nIt was a good show. I liked it a lot. The only thing I wanted that I didn't get was romance.  But I did get a lot of bromance, so I guess that makes up for it!\\n\\n",
            "date": "2014-06-29T10:54:00+00:00",
            "helpful_count": 55,
            "mal_id": 149305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3088041.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MachinaEm",
                "username": "MachinaEm"
            },
            "url": "https://myanimelist.net/reviews.php?id=149305"
        },
        {
            "content": "From the perspective of someone who watched both seasons of Uta no Prince-sama, Kamigami no Asobi is a solid 6. It's by no means a spectacular show, but it does its job decently well in 12 episodes and makes for an entertaining, if not particularly fascinating, experience.\r\nThe concept is a unique one: Kusanagi Yui, a pretty normal Japanese girl, is summoned to a strange school to help teach young gods how to care about humans. In the first episode alone, she encounters many of her new classmates, as well as Zeus himself, the commanding king of the gods who created the very school out ofthin air and can restrict the other gods' powers.\\n\\n\r\nAs the show continues, it becomes slightly obsessed with \"normal\" concepts, as Yui attempts to essentially teach the gods how to be human; this either works or doesn't, depending on the episode. Sometimes it can be very entertaining to see how the gods deal with the new ideas, with some of them enjoying themselves and others remaining totally confused. However, this also serves to erase any urgency that might've been created by the fact that Yui and the gods have only one semester's time to spend at the school. We know that they will be stuck there forever if the gods don't learn to care about humans in time, but there isn't any real worry about that goal being unreachable.\\n\\n\r\nAround halfway through its run, the show's main storyline begins to kick in, with deeper secrets revealed about certain gods, all of which serve to lead up to the climax. This is where I personally became more disillusioned with the show as a whole, mainly because of its pacing and how the story was ultimately treated. Its largest issue is that it relies on emotional investment - it doesn't really have any impact if you're not invested in the characters, and although I was enjoying the show up to that point, I didn't really feel attached to anyone except my personal favorite god, so it was difficult for me to care about most of the story. This problem mainly lies in the fact that each god's backstory was featured in only one episode, and because most of these episodes were also padded by everyday \"shenanigans\", the backstories are rather simple and poorly fleshed out.\\n\\n\r\nThe characters are nice enough. None of them made an impact on me enough to be added to my favorites list, but I did enjoy watching some of them. Others annoyed me, whether it was due to (in my opinion) too much screen time or unappealing personalities.\\n\\n\r\nA short rundown:\\n\\n\r\nApollo is arguably the most featured out of the gods. I didn't care for him, as his usual attitude is very bubbly and he tends to dominate any scene he's in; I also found his backstory one of the weakest, especially considering the mythology upon which it was based.\\n\\n\r\nHades, god of death, was my personal favorite. While he wasn't anything groundbreaking and only got one real focus episode, he was also one of the most entertaining characters due to his reactions to various situations.\\n\\n\r\nTakeru was a Japanese god, and I frankly can't recall much about him. Neither he nor his quieter brother Tsukito impressed me particularly much.\\n\\n\r\nBalder is possibly one of my least favorite characters in the show. I initially liked him, but suffice it to say that he plays a large part in the darker plot and ultimate climax, and that he's cast in a light that I found pretty out-of-character and frustrating. We are naturally supposed to sympathize with him to a point, but I found much of his eventual behavior to be either unsympathetic or just plain insulting.\\n\\n\r\nLoki, trickster and friend of Balder, was conversely a pretty decent guy. He, too, is focused on more and more as the show draws to its close, and although I found his character to be around as shallowly developed as the rest, Hosoya Yoshimasa delivered an outstanding emotional performance that served to make me like Loki that much more.\\n\\n\r\nThor, Dionysus, Thoth, and Anubis are all more minor gods who also appear in various episodes. Due to their receiving less screen time, there isn't much to say about them, aside from Thoth being quite entertaining with his habit of slamming both hands against a wall / onto a desk / etc. in every appearance. Zeus himself does appear past the first episode, but isn't featured as much as I'd have liked him to be.\\n\\n\r\nFinally, there's Kusanagi Yui herself; while more detailed than Uta no Prince-sama's Haruka, she's not an optimal main character in my eyes. She begins the show with a very decided backbone and strong opinions, standing up to Zeus himself and trying to deal with her new surroundings. However, as the show goes on, she just lets the gods and their personalities take over. We never really get to a point where she speaks up for herself and tells arguing or upset gods to shut up or calm down; she just continually makes weak protests or looks wide-eyed and worried. There are some points where I expected her to logically react more strongly, but she remained easygoing and passive. It's not a huge problem most of the time, but it did become frustrating for me as time went by.\\n\\n\r\nThe art of this show is basically easy to look at. Hair shading is an interesting, rather watercolor-esque style, while the character designs are pretty appealing and backgrounds are prettily done. There's nothing groundbreaking about much of it, but it is very pleasant. OP animation didn't appeal to me as much as ED, mainly because of a grittier and darker feel in the latter.\\n\\n\r\nThe musical score is relaxing and pleasant, with some nice flutes and strings used - not memorable per se, but then again it's been some time since I saw the last episode. I didn't care for the OP although it was catchy, but the ED stuck in my head after each listen and I personally found it a very cool song.\\n\\n\r\nAll in all, if you're looking for something light and fun, Kamigami no Asobi isn't a bad choice. It's not a masterpiece and has its few problems, but I also found it easy to watch and to comment on each episode. For me, it's just a cute, rather fluffy anime with characters that won't irritate you too much and a unique story.",
            "date": "2014-08-10T18:54:00+00:00",
            "helpful_count": 33,
            "mal_id": 156117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3715185.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jollyrogersgo",
                "username": "jollyrogersgo"
            },
            "url": "https://myanimelist.net/reviews.php?id=156117"
        },
        {
            "content": "You have to watch this anime! Through character development is not one of its strong point, it sound and animation is! I love its parts, and as you know from its cover, it is full of hot guys who I wish were real! I love the ending but won't elaborate any further. It disappointed though that everything was rushed, but I love to see a second season. Similar to some reverse harems, this anime has nose bleeds moments and melodrama, but it is good anime to watch or waste time on. Like a bowl of pho after a hangover, in anime terms a perfect animeafter Attack on Titan or Tokyo Ghoul.",
            "date": "2015-02-27T17:34:00+00:00",
            "helpful_count": 22,
            "mal_id": 181342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1870444.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wolfpackkn",
                "username": "wolfpackkn"
            },
            "url": "https://myanimelist.net/reviews.php?id=181342"
        },
        {
            "content": "I went into this anime only knowing two things, reverse harem and gods. I love anime with gods and mythology, expectantly Greek mythology. Kamigami no Asobi didn't let me down.\r\nStory~ The plot was pretty simple; eight gods and a human are trapped in an academy by Zeus and can't leave until they learn about human love and emotion. Then it had episodes about each god with Yui and a few group episodes. I think the two ending episodes were kind of forced, and unneeded.\r\nArt~ This show was filled with vivid colors and visuals. Every character seemed to pop out of the screen. The opening andend song art really captured the feeling of the anime. The ending itself was nice. Showing each god singing as the other 'students' rushed by.\\n\\n\r\nSound~ The music wasn't very memorable. The opening was upbeat and gave the show even more cheeriness.  Neither the opening nor the ending was very intriguing to me. The voice actors really had fun with their part I could tell. Each voice perfectly matched the character's attitude. \\n\\n\r\nCharacters~ The characters is were I had a bit of problem. With eight gods and one girl, it felt like it could be a good reversed harem. Didn't seem like too many or too little, yet they throw out two characters. Thor and Dionysus seemed to just be cut out. With Dee-Dee's love for wine and happy attitude, I think it would have been nice for him to see Yui as a love interest. It would have been great to have episode when his even drunk. Thor could have been the 'strong and silent' type. They just had so much potential that was wasted.\\n\\n\\n\r\nEnjoyment~ I really did love this show. It made me laugh a lot, episode 10 was my favorite. I just didn't like the ending episode and the wasted potential.",
            "date": "2015-04-05T10:01:00+00:00",
            "helpful_count": 12,
            "mal_id": 184839,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437397.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuPrincess010",
                "username": "OtakuPrincess010"
            },
            "url": "https://myanimelist.net/reviews.php?id=184839"
        },
        {
            "content": "[STORY] - 10/10\r\n-----------\r\nThe story was truly amazing. The little teaser in the beginning of the anime really put an interesting vibe into the audience, and I truly did not expect the ending either. It got me very emotional in the end, and it bothered me having to think that the ending was how it ended. Maybe there is a continuation of the anime in the manga? I don't know, but if there isn't then the producers of this anime is really making me think what happens next. I've also heard rumors that there is a second season to the anime, and I really hope so,although my hopes are low because it has been more than 4 years since the release. (Ye there's probably no season 2 lol) The ending was still truly amazing though, and I won't be disappointed if it ended like how it ended.\\n\\n\r\n[ART] - 10/10\\n\r\n-----------\\n\r\nThe details and the background were truly amazing. When it was nighttime, the night sky was filled with beautiful and dazzling stars, and it was just very detailed. Everything in this anime was very well made, so Ii don't have anything negative to say about the art.\\n\\n\r\n[SOUND] - 8/10\\n\r\n-----------\\n\r\nThe voice actors / actresses truly did an amazing job, and they suited the characters of this anime very well. The anime also put in very beautiful and romantic music in the background in a lot of the scenes, although, I don't know what to feel about the opening and ending themes. I personally don't enjoy a lot of openings and endings of animes, so this really isn't a surprise to me. \\n\\n\r\n[CHARACTER] - 10/10\\n\r\n-----------\\n\r\nEverything about the appearances and the personalities of all the characters were very outstanding, especially the uniforms for school and when the Gods turned into their God forms. It really put a deep fantasy vibe into this story, and it was really interesting to see them transform into their true forms. \\n\\n\r\n[ENJOYMENT] - 9/10\\n\r\n-----------\\n\r\nI didn't really enjoy the beginning of this anime until around episode 3-4, although like I said earlier, the ending was truly amazing and left me in shock. I knew the ending would turn out like it did because it was kind of obvious to predict, but how they pieced the ending together just made it very sad. I do wish there is a season 2, but I won't be disappointed if it didn't, because the ending of season 1 was not bad at all. \\n\\n\r\nFINAL SCORE:\\n\r\n9/10 \\n",
            "date": "2018-10-14T16:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 291759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6159701.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnastasiyaV",
                "username": "AnastasiyaV"
            },
            "url": "https://myanimelist.net/reviews.php?id=291759"
        },
        {
            "content": "At last, this anime has finished airing (although I am pretty sure specials will be on their way). I will not include any spoilers, just cause not even the barely-decent stuff is worth mentioning.\r\nEver since this anime was green-lit, I was really excited to watch it. The original game comes from Broccoli, who also made Uta no Prince--and I loved the anime for that game, albeit the second season got pretty ridiculous. I love otome games in general, so I was psyched to watch another anime based on a game. But now that the anime is over, I feel extremely disappointed and that I've wasted12 weeks watching this.\\n\\n\r\nStory: Now, the story seems decent. However, since this is a reverse harem show, obviously the anime will have little stories in it dedicated to individual gods and their respective relationship development with Yui. These stories are quite boring, and sometimes goes past the point of ridiculousness in a bad way. \\n\\n\r\nArt: Possibly the only topic I can give higher than a 4 on. It's pretty, although not so pretty that I can constantly admire.\\n\\n\r\nSound: Not memorable. Not even the opening and ending songs are good. \\n\\n\r\nCharacter: Oh God, these characters are terrible. All the gods are pigeonholed so much that I was always extremely annoyed with them. Example: Dionysus, who ONLY talks and thinks wine. Yes, I know he is the Greek god of wine, but a good character should develop or at least not repeat the same crap every. single. episode. Dionysus was also just a background character, and so nobody bothered with him--which I annoyed me so much, because I wanted a reason why this character is there if the studio bothered to draw and animate him. All other gods do this to some degree, and never really develop--even with what happens at the end. Yui is pretty much the only decent character there, because she discovers what these gods are going through and is not a--relatively speaking--wooden character that is bland and boring. But the flaws of all the other characters overshadow her, not letting her stand out.\\n\\n\r\nEnjoyment: With poor characters, fair art, and terrible stories, I felt like I was trudging through quicksand when I decided to continue with this anime, since I wanted to finish what I started. Nothing exciting happens really.\\n\\n\r\nOverall: I tell everyone to steer clear of this anime, even those who are fans of otome games and the reverse harem genre. This show isn't even laughably bad. I am severely disappointed, and annoyed that I have wasted my time with this anime.",
            "date": "2014-06-22T06:27:00+00:00",
            "helpful_count": 10,
            "mal_id": 148013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1442877.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MonochromeSong",
                "username": "MonochromeSong"
            },
            "url": "https://myanimelist.net/reviews.php?id=148013"
        },
        {
            "content": "Story: 9\r\nThe plot was very well thought out. Not once did I feel like they were trying to force stuff to happen. The plot made sense, it was interesting, complex, and easy to follow. The only thing that made it a 9, and not a 10, was the fact that there was no actual romantic relationship that emerged with the main character. That's just my own preference though, and the fact that there was no relationship actually fits the plot perfectly.\r\nArt: 10\r\nThe art was amazing. The scenery was beautifully drawn, the characters each had their own unique look that made them very appealing to lookat (especially the gods, they're hot as f#%& if I do say so myself).\\n\\n\r\nSound: 9\\n\r\nThere's nothing particularly wrong with the way they sound. Everyone's voice matched them, except for Melissa. The reason I gave it a 9 is because I wish there was a dubbed. (Please don't hurt me)\\n\\n\r\nCharacter: 8\\n\r\nThe characters were well thought out. The each had unique personalities, as well as their own issues which made us understand them better. I would have wished to understand Thoth and Zeus more. Also, more of Anubis would have been entertaining to see.\\n\\n\r\nOverall, I really enjoyed this anime. I would recommend it to everyone. People who like fantasy will especially like this. \\n\\n\r\n10/10 I would recommend this to everyone, although if you're not used to watching subbed, it might be hard for you to follow.",
            "date": "2017-07-08T12:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 252287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6314661.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shsamie",
                "username": "shsamie"
            },
            "url": "https://myanimelist.net/reviews.php?id=252287"
        },
        {
            "content": "Well then, that was nice so another reverse harem 2014 spring anime has ended, so no more fucking around as I state my ratings for each of this anime's category:\r\nVery Good 8:\r\nStory- At first I thought that it's gonna be one of those usual reverse harem genre, but then again it's a bit different as the plot focuses on a girls whose mission was to make them deities understand the meaning of being human and therefore ending their never-dying bickering for one another. Well, of course there were still those usual helping one another thing and the competition for the maiden's heart and a usualharem ending except here the harem ending was put on an acceptable level.\\n\\n\\n\r\nEnjoyment- As usual the enjoyment part is where one would ask the question as to whom the girl is gonna choose among the deities, as I've  mention on the above paragraph was that it has an acceptable harem ending and it was that acceptable harem ending where I give this part a \"Very Good\" score.\\n\\n\r\nGood 7:\\n\\n\r\nArt- Basically the character's school uniform and the god wardrobe maybe a bit gayish for a dude but for me I find very elegant and pretty much metrosexually  \"Good.\"\\n\\n\\n\r\nSound- I like both the opening and closing theme, most  of all I like the VA who did Yui's voice, so basically the score is for the opening theme, closing theme and Yui's voice.\\n\\n\\n\r\nFair 6:\\n\\n\r\nCharacter- Unfortunately, Yui still portrays the usual reverse harem girl who is nice but indecisive, sweet but too sweet and caring but a bit ditsy. Then again, her role as the central figure for the deities kinda serves it well, which is why this category would be \"Fair\" enough.\\n\\n\r\nAs for the deities, here are my rants about them:\\n\\n\r\nApollon Agana Belea - a perfect nice guy but a bit too immature on the side.\\n\\n\r\nHades Aidoneus- pretty much a gloomy old man.\\n\\n\r\nTakeru Totsuka- he is probably the only cast who is in need of attitude adjustment.\\n\\n\r\nTsukito Totsuka- If every I encounter someone with his personality, I'd be bored to death.\\n\\n\r\nBalder Hringhorni - I'd probably say that he is half nice guy and half predator.\\n\\n\r\nLoki Laevatein- He simple needs some spanking.\\n\\n\r\nThor Megingjard and Dionysus Thyrsos, what can I say, they are more on the sidelines than anything else.\\n\\n\r\nThoth Caduceus- pretty much the meanie in this series.\\n\\n\r\nZeus Keraunos- the big man who drafted Yui into service was probably the only character that I love to hate.\\n\\n\r\nAnubis Ma'at- who the fuck is he?\\n\\n\r\nMelissa- pretty much the only friend that Yui has.\\n\\n\\n\r\nGreat 9:\\n\\n\r\nOverall- I can only say that this was probably the only \"Great\" reverse harem  anime I've ever watched. The End.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-06-22T12:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 148049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=148049"
        },
        {
            "content": "I honestly really liked this story. It did a good job highlighting each characters attributes, while answering the question posed to the viewers. I felt like each episode was its own little tale, they fit together but they were also different. If your looking at this being a \"romantic\" anime then I would go elsewhere. It has the elements, but lacked the development which disappointed me. However, I really grew attached to the characters. They all had such different personalities and it was really fun to experience. I would totally watch this anime if your looking for a different kind of reverse harem. If yourhaving reservations about watching it, don't. I was skeptical about watching it at first, and I put it off. I'm glad that I gave it a chance!",
            "date": "2015-04-24T14:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 186375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1387819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/timedoctor",
                "username": "timedoctor"
            },
            "url": "https://myanimelist.net/reviews.php?id=186375"
        },
        {
            "content": "This anime put me in a state beyond words. Despite the fact that I absolutely refuse the ending so very much, I still really enjoyed the story.\r\nIt's a fun anime to watch and somewhat relaxing, but it still gives you enough trills to keep you going.\r\nAs I mentioned, the ending was not quite to my liking. I wanted more, found that the story should continue and, who knows! , the kind of set it up so that a second season wouldn't be surprising and weird.\r\nI recommend this anime a lot even though I normally don't like harems.\r\n[ignore the following, it said longer review]\r\n................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "date": "2018-10-27T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 292800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5543039.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vicky-chama",
                "username": "Vicky-chama"
            },
            "url": "https://myanimelist.net/reviews.php?id=292800"
        },
        {
            "content": "The first episode caught my eye with everyone's unique personality, the art style and the sound so i was very intrigued, but then as I watched further through the anime, it felt so rushed that there isn't much of a connection going on with the characters that would help each other develop further more, but I did enjoy the anime and wasn't really expecting the ending, the ending touched my kokoro since I really like the guys, especially Apollo. \r\nI hope that there is a season 2 since I really like it because of the unique personalities and even if the backstories aren't that verydetailed that can make the viewers feel what the characters would feel, I still think that it is interesting and somehow only Apollo and Yui are the only one I can see having a deep connection.",
            "date": "2016-10-15T22:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 231860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5732821.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CptRainy",
                "username": "CptRainy"
            },
            "url": "https://myanimelist.net/reviews.php?id=231860"
        },
        {
            "content": "I'm sorry in advance if this review isn't necessarily in standard format, but it's hard for me to compartmentalize like that, but this show surprised me so I thought it needed a review. \r\nKamigami no Asobi is not quite what it seems and certainly not what the synopsis implies. I came into this show expecting a mindless otome adaptation type show with a bit of mythology thrown in. Fun, but no big deal right? I got so much more than I bargained for. This show had me literally laughing out loud every week. No matter what your sense of humor their is most likely atleast one character who shares it. Which is a lovely segway to my next point, characters. Yes, it is a reverse harem and as such follows plenty of character tropes, BUT every character is well developed, almost every character has a backstory (usually touching), and they were all just so lovable! The characters were the shining point of this show. This, in a happy turn of events, does not exclude the heroine. I think anyone familiar with this genre realizes what a refreshing change this is. Yui speaks, thinks, cares for people, and does not seem to be compelled to be a doormat. The art and music were both fantastic but don't really need reviewing.\\n\r\nFinal warnings: 1) when it says teach them (the gods) about love and the human heart it's not what you think. This is referring to humanity, not romance 2) it is a reverse harem, don't go into this expecting it to be otherwise 3) there are feels. They caught me off guard so I had to earn you. Prepare yourself for serious feels near the end.",
            "date": "2014-06-28T13:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 149123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3269451.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/guini_mitsukuni",
                "username": "guini_mitsukuni"
            },
            "url": "https://myanimelist.net/reviews.php?id=149123"
        },
        {
            "content": "Well, that was a lot better than I expected! I am an avid otome player and I've seen a few anime that have been based off the reverse harem ideas or games, and most of the time, they don't go very well (see Amnesia).\r\nHowever, Kamigami no Asobi manages to pull it off a lot better than most. \r\nTo begin with, the story: it manages to bring together the plot in the first episode quite well. There are a few plot holes or things that weren't explained to the finest, but those are issues that can be overlooked because the series was so short to beginwith. In addition to this, it's important to note that the series was mainly episodic. A character was chosen to be the focus and then elaborated upon for an episode or so. I'll come back to this when we talk about characters. The overarching plot was about the Gods learning to understand humanity, and the show does a pretty good job of displaying it, even if it was a pretty cheesy representation. \\n\\n\r\nThe art was great! I enjoyed how the characters were drawn (very easily distinguishable, but at the same time, not outlandish and crazy like the characters of Amnesia), and the backgrounds were pretty as well. I loved the night sky portrayals. It's also important to note that the God forms of the main characters were very detailed and beautiful, along with their specifically cultured dorm rooms. \\n\\n\r\nThe sound was fine. I was a big fan of any of the music, but at least all the voice actors were pretty good and none pissed me off, which is a feat, cuz I get annoyed almost too easily. \\n\\n\r\nGetting back to the characters-- there's nine main characters. The heroine and human, Yui, is the central focus of our harem. From Greek Mythology, we have Apollon (was it supposed to be Apollo?) who gets a pretty deep tragic past that's a variation of a true myth. He gets enough development that he's fun to watch, but his motivations aren't always clear and his dialogue and actions are pretty cheesy and bland. He reminds me a lot of Tamaki from Ouran. The, from Greece, we also have Dionysus and Hades, who get little to no screen time, and whenever they do, they're used as comic relief. Personally, I wish they got more development, but I guess they were meant to be background characters and the series was too short anyhow. On the other hand, we have our Gods from Japan, Tsukito and Takeru. Both have their own episode to themselves, so they're developed well enough, though they're shoved aside in the finale for Apollon and the Norse Gods. \\n\\n\r\nThe Norse Gods finish off the series with a bang. Loki, Balder, and Thor were barely present in the first part of the series, but slowly began to make the scene until Loki and Balder were the main focus. Despite being close with them, Thor was ignored, and that made me a little sad because he had some real potential as a character. I enjoyed the Loki and Balder sequence (mainly cuz I ship them... a lot) so it was a pretty nice finale. I would like to say I was disappointed by Yui as a whole though. I know I shouldn't expect much from anime heroines at this point (especially in a reverse harem video game based shoujo anime) but I couldn't help myself. When she talked about swordsmanship, I got excited because I'm a martial artist myself, so I hoped that her character would be kickass and get the Gods off of their high and mighty thrones, but instead, the swordsmanship was used as a plot device to lure Takeru into the group and then abolished afterwards. I wish they had given her a little more umph, because she really did stand a chance at first. I didn't find her particularly annoying, but honestly, it wouldn't have made any different if she wasn't there. \\n\\n\r\nAs much as I liked Apollon, I also wish that Yui hadn't basically been paired up with him from the start. I liked him and Cassandra better, and I honestly think that Yui with perhaps Tsukito or Takeru might've been alright, if she had to have a pairing, though I don't think it was needed at all. This is coming from a person who loves shipping more than anything!! I just didn't feel the chemistry between any of the characters except Loki and Balder, if I'm being honest. \\n\\n\r\nI enjoyed this a lot more than I thought I would, to be honest. The humor was pretty good (I have a strange sense of humor, and it definitely catered to it) and the plot interesting enough that I could follow through with watching it without getting bored. All in all, a good watch! \\n\\n\r\nI would recommend if: you like mythology, you enjoy reverse-harems, you like it when a ton of boys fight over a girl, you like 'school anime' without traditional school troubles.\\n\\n\r\nI would NOT recommend if: you're looking for something dark or angsty, you want a lot of character development, you're not a fan of reverse-harems or love triangles, you don't like mythology or mythical Gods, anime about friendship and sunshine and rainbows bore you. \\n\\n\r\nHave a great day everyone! \\n\\n\r\nP.S. In twelve, episodes, Thoth boxed Yui into a wall 11 times. Eleven times. Only once was it even needed. Just saying.",
            "date": "2018-01-04T15:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 267428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=267428"
        },
        {
            "content": "Guys. I never thought I'd give a serious review on something, but there... I watched Kamigami no Asobi.\r\nThis anime has a really nice character development and it's really enjoyable to watch. \r\nThe story might not seem intresting when u are reading the synopsis, but if u end up watching it, it manages to bond u with the characters and touches ur soul in the end (well if u are the sensitive type).\r\nI don't really wanna write much, because nothing can express how good this anime  was. So, all I want to say is that if u like reverse harems YOU GONNA LOVE THIS andI highly recommend it! \\n\\n\r\nStory : 9\\n\r\nArt: 9\\n\r\nSound : 10\\n\r\nCharacter : 10\\n\r\nEnjoyment : 100 (no the 2nd zero is not a typo)\\n\r\nOverall : 10 \\n",
            "date": "2017-09-25T10:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 258651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/782431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZabimaruE",
                "username": "ZabimaruE"
            },
            "url": "https://myanimelist.net/reviews.php?id=258651"
        },
        {
            "content": "At the time of writing this, I have rewatched Kamigami no Asobi at least 4 times since I discovered it 3 months ago. It's easily in my top 5 anime but even so, decide for yourself whether this anime is for you or not. \r\nStory 8/10\r\nSo we have Yui, the only human to be summoned to the almighty Garden created by Zeus; tasked with teaching 7 gods from Japanese, Norse and Greek mythology about humans in order to gain an understanding of humans and why connecting with them is important for them as gods.\r\nI liked the simplicity of this main story objective being laid outright from the start. It allowed me to be on the same page as all the characters and experience everything with them together. The story itself is by no means weak - especially for a reverse harem. It certainly has an allure that picks up speed as more episodes go by. The pacing is very comfortable and even as things escalate and get darker towards the end with Loki and Baldr's arc, it is very well done. I easily would watch another season of this.\\n\\n\r\nArt 10/10\\n\r\nGorgeous! I could stare at the art from Kamigami no Asobi all day and it's obvious why this did so well as a visual novel. The boys all look wonderful.\\n\\n\r\nSound 10/10\\n\r\nI've downloaded the Kamigami no Asobi OST. I really could listen to it all day. It's intense, poignant, spritely, comedic and extremely fitting for the all round feel of the show. The opening sequence song Till The End is also sung by the voice actors and is divine. It also really does feel like something out of a fairytale. Want some proof? Google the 'Strong Ties' soundtrack used for the friendship between Baldr, Loki and Thor. It evokes some STRONG emotions.\\n\\n\r\nCharacter 10/10\\n\r\nSo right from the get go we meet Yui and blah, blah, blah. Stuff happens and she meets major gods from Japanese, Norse and Greek mythology (below I have excluded side characters Dionysus and Thor). \\n\\n\r\nJapanese: Takeru & Tsukito Totsuka, god of the sea and god of the moon.\\n\r\nNorse: Loki Laevatein, Baldr Hringhorni, god of fire and god of light and destruction.\\n\r\nGreek: Apollon Agana Belea & Hades Aidoneus, god of prophecy and god of the Underworld.\\n\\n\r\nYui herself is a sufficient character, she certainly has her merits and most definitely isn't a weak character. She has a tendency to be very protective of her new friends and takes her role as their teacher very seriously; despite also because she wants to go back home, she really wants these gods to graduate from 'Garden School'.\\n\\n\r\nThey are wonderful characters to watch. Each has a very different personality with weaknesses and strengths, but they each develop and change for the better (and sometimes for worse) throughout the show. Even the side characters, who we don't see nearly enough of, are very fun to watch.\\n\\n\r\nThe friend dynamic between these gods and Yui is very touching and it's a pleasure to watch it become stronger with each episode. Of course, there are gods that Yui has to win over (primarily Loki and Takeru). She brings something humane and positive to each of the boys. It also has a little fanservice but it's not super annoying.\\n\\n\r\nThere are scenes between these boys that really do provoke feels but it also is surprisingly strong with humour. \\n\\n\r\nEnjoyment 10/10\\n\r\nThe only other anime that has made me laugh as much as this is Ouran High School Host Club. Every single episode was truly enjoyable. It was a pleasure to watch something that is just so damn PERFECT. The story, art, sound and characters mesh together to make a friggin' masterpiece.\\n\\n\r\nOVERALL 10/10\\n\r\nWas there ever any doubt that this would score lower than a 10? Kamigami no Asobi makes you laugh and cry and at the same time gets rid of more annoying things in reverse harems such as EXTREME jealousy between all boys over the main character (perhaps with one story-related incident with Baldr). I'll be rewatching again for the 5th time very soon.\\n\\n\r\nThere isn't an anime that I want to have a second season more than Kamigami no Asobi.\\n\\n",
            "date": "2017-08-20T23:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 255930,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6112552.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bexx02k",
                "username": "Bexx02k"
            },
            "url": "https://myanimelist.net/reviews.php?id=255930"
        },
        {
            "content": "Kamigami no Asobi is the best Reverse Harem i ever watch. I experience sadness and happiness watching this anime.\r\nThe plot of the anime was understood. It show slight fan service and non of the episode will bored you. Every episode will show a plot which can be tear jerking, humorous and makes you fan girl.\r\n This anime  makes me portray the MC, Yui as a strong willed, hard working, persuasive and NOT a slut as i usually see in Reverse Harem MC.  Since some of the gods are hard to approach Yui work hard and even when in danger fight for what shewants. Unlike other reverse harem MC, Yui doesnt throw herself towards the god (The gods is freaking hot i would not be able to control myself, even more when they transform )and is a very active MC. Always outside of her room and even in another world continue to train herself. Both their op and ed songs are amazing and even more their character song,\\n\\n\r\nMUST WATCH ANIME. BEST REVERSE HAREM EVER.",
            "date": "2015-12-01T02:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 204559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3421487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/glenn27",
                "username": "glenn27"
            },
            "url": "https://myanimelist.net/reviews.php?id=204559"
        },
        {
            "content": "When I first read the synopsis I thought, oh cool, this sounds like something interesting, and I thought of the possibilities such a concept could have. So going into the anime I was pretty excited. After watching the anime I feel as if I wasted my time, when I could have been watching a far better show. Here I'll go into my reasoning:\r\nStory(2): \r\nThe show doesn't have much of a plot, it is basically the female protagonist getting to know all the characters (which makes sense because it is based on a otome game), which, for me, was pretty boring to watch. In addition, theanime gradually leads up to a main conflict/climax, but it is unknown what this climax is until the end, when they introduce it, resolve it, and wrap up the anime in about 2 episodes. It simply felt pointless, and the entire \"plot\" was a big disappointment.  \\n\\n\r\nCharacters(4):\\n\r\nThe characters themselves were pretty simple, though the anime did try to give some of them backgrounds, but many characters were left flat and two dimensional. This includes the protagonist, who had no backstory, and whom I found to be annoying, especially as her character seemed to react the same way to everything. \\n\\n\r\nArt(6): \\n\r\nAs far as the art and animation go, it wasn't the best I've ever seen but it certainly wasn't bad. It was pretty basic, and I actually enjoyed some of the character designs. \\n\\n\r\nEnjoyment(4): \\n\r\nNow I didn't really enjoy this anime and despite all that I have already said there were a select few parts of the anime I enjoyed. The first being the humor. Now this anime is, of course, not a comedy, however, there was some humor that I enjoyed (particularly episode 10).  I also enjoyed Apollon's and Thoth's nicknames for the various characters. \\n\\n\r\n*Sound(4): In case you were wondering about the sound of the anime, there isn't much for me to say except it was fairly bland, nothing special, but also nothing terrible.",
            "date": "2016-03-28T16:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 214594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283082.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blue_Cake",
                "username": "Blue_Cake"
            },
            "url": "https://myanimelist.net/reviews.php?id=214594"
        },
        {
            "content": "Amusing and surprisingly creative, Kamigami no Asobi was far more enjoyable that I thought it was going to be. Not only is the art lovely, but all of the characters were surprisingly likable. One would think that in a show that's basically about tons of guys having the hots for the main girl, there would be one douchebag that you pray the heroine won't fall for.\r\nNot so with this. Like its brother anime Uta no Prince Sama, pretty much all of the male cast were decent guys, if not somewhat one dimensional. One character I found surprisingly lovable was the god of the Underworld himself,Hades.  \\n\\n\r\nUnlike Prince Sama, however, this anime had a more creative spin to it. I mean, it's not every day that you see mythological gods as love interests. I have to be honest, I was kind of disappointed there were no Old Ones in this. Having the Great Cthulhu sparring for the love of the main girl against gods like Thor and Apollo would have been the best thing ever.\\n\\n\r\nI have to be totally fair in my review, however, so I must mention the anime's flaws. As always, when dealing with shows based on dating sims, the main character is kind of bland. She's not unlikable, and she's not even that dimwitted, but there's nothing too memorable about her. Her only main feature is that she is good at sword play, but that is almost forgotten near the end and the makers of the show don't use that quality to her advantage. Instead of saving the day when the show's climax is in full swing, she just follows the others and doesn't do much. In a show where gods of mythos have to learn how surprisingly strong and admirable humans are, we don't see the heroine do much except encourage and support, and while those are good qualities, it would have been refreshing to see her be the one to actually save the day; to rescue the knight in distress, so to speak.\\n\\n\r\nAll in all, the show is a solid 7. It's good. It won't blow you away in its story, character development, or even romance, but it's good.\\n",
            "date": "2015-09-21T16:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 199164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4676368.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cthulhuhuhu",
                "username": "cthulhuhuhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=199164"
        },
        {
            "content": "Finally, an otome game adaptation that sits well with me! Kamigami no Asobi has an interesting premise-- Girl and a bunch of Gods (only dudes, no Goddess because this is a dating sim) are trapped in a magic high school. The human girl must teach the Gods about humanity and love, otherwise they'll be trapped in the school.\r\nCharacters are all interesting. Of course, there are some that follow certain cliches/ has one outstanding trait about them, but for the most part, they are all fleshed out. The main character is a cut above most other otome adaptation heroines in which she does get things done,but her personality is rather stale in comparison to the male cast. \\n\\n\r\nThe story is pretty okay as well. It starts off pretty much slice-of-life ish for the first half, but quickly dives into full throttle near the end. \\n\\n\r\nAll in all, would recommend if you wanna see reverse harem.",
            "date": "2015-11-27T18:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 204300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AppleNitro",
                "username": "AppleNitro"
            },
            "url": "https://myanimelist.net/reviews.php?id=204300"
        }
    ],
    [
        {
            "content": "This anime was a beautiful anime that I eagerly awaited each week. The art was wonderful with stunning colors and beautiful designs, and the voice acting was very good. I loved the character development and the costumes for each character. This anime is very much a reverse harem, if you don't like those, then maybe you shouldn't watch this anime, but you might be astounded by the interesting storyline. I believe this anime is based off an otome type game, and while I haven't played the game, I quite like the anime. This anime has a kind and caring main character who try's her bestto be helpful and make the best of the situation. The main character is surrounded by gods from different cultures who each bring a different persona to the mix. This anime was very fun and made me laugh. I ecspecially loved the little shorts at the end of each episode.",
            "date": "2014-06-22T13:39:00+00:00",
            "helpful_count": 60,
            "mal_id": 148063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3809005.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LollipopXXX",
                "username": "LollipopXXX"
            },
            "url": "https://myanimelist.net/reviews.php?id=148063"
        },
        {
            "content": "I am a big fan of well executed reverse harems, and I can certainly add this anime to the list of good ones. So here goes!\r\nStory: 7\r\nThis anime had every element I would expect from a good reverse harem. It begins by introducing the situation (a bunch of gods and one human chick forced to attend a school where they must learn about the human heart before they are allowed to leave and go back to their own worlds) and then begins working on developing each character little by little. At first, the episodes are pretty much what you'd expect from a reverse harem: eachseems to focus one one specific dude and a certain problem that the heroine assists them in solving, with a couple of episodes thrown in that feature the group as a whole overcoming a problem together.   This is done very well- there's plenty of humor and drama thrown in there. Near the end of the show, a main plot begins to surface that builds up to the show's climax, but the earlier episodes give plenty of time for the relationships between characters to develop.\\n\\n\r\nHowever, what really surprised me about was the lack of... romance. Yes, there is a little bit. But romance is certainly NOT the main idea of this show.  I was expecting the more general reverse harem trend, where the heroine 'dates' or has strong romantic connections with one or more of the characters, but in this show, while there are certainly hints of romance and flirting, there is little focus on romantic love. The relationships that the heroine develops with the gods are very friendly but close- sort of like how a sister would love her brother. There is a very strong focus on friendship in this show. In short, Kamigami no Asobi tis more about a girl who helps a bunch of incredibly hot gods with their complicated bromances than with a girl who falls in love with a bunch of hot guys- which is refreshing, but at the same time, a bit disappointing. I was hoping that Yui would end up with a guy the whole time, but nothing really happens, which is why I didn't rate the show a 9.\\n\\n\r\nArt: 10\\n\r\nThe characters were all beautiful. The heroine was pretty (I'm not entirely sure why she needed purple hair if she was supposed to be a normal human, but what am I expecting, this is anime) and the guys were all attractive. The attractive characters were attractive, and they were designed in ways that perfectly matched their attitudes. The hair and eyes were all great.\\n\r\nThe setting was also gorgeous and well done. Crisp architecture and nature, no complaints here.  \\n\\n\r\nSound: 6\\n\r\nI didn't really like the OP, but I guess it fit the show. I though the closing song was much catchier and upbeat, but I have questionable taste in music.\\n\r\nThe soundtrack for this anime was pretty normal. I guess the fact that I didn't notice anything meant that it fit well, but I also didn't particularly like the sound, so I'm giving it a 6. \\n\\n\\n\r\nCharacter: 8\\n\r\nRecent reverse harems have been plagued by the same problem: a 'heroine' who is nothing but an empty passive shell. Fortunately, the leading lady in Kamigami no Asobi is anything but. She is kind and compassionate, has actual emotions, and is capable of making meaningful connections with all of the guys she's surrounded with. Given the near impossible task of getting a group of guys (god guys, no less) to understand the human heart, she actually cares for all of them and builds friendships with them.\\n\\n\r\nThe gods in the show certainly fulfill the 'hot guy' aspect that reverse harems all have, and while they are all very well written, a few of their personalities are a bit stale, and frankly, I've seem then before.\\n\\n\r\nThe 'perfect' guy who is incredibly friendly and kind to the heroine but has a past that he can't get over? Check.\\n\r\nThe rebel who is a total jerk to the heroine at first but turns out to be misunderstood? Check. \\n\r\nThe guy plagued by misery who wants to keep others away so he won't hurt them? Check. \\n\r\nThe very analytical guy who doesn't understand emotion and treats everything as a mission? Check. \\n\\n\r\nWhile these are a bit overused, I can't say I disliked any of the characters.  They all fulfilled their purposes as intended. However, my favorite character in the entire show was actually sort of a side character- the gods' teacher, Thoth. I found his habits of cornering Yui and yelling at her, the insulting but hilarious nicknames he gave all of his students, and the generally vindictive, sarcastic attitude he has really funny. He was probably the most unique character and in the show, and he's the reason character didn't get a 7 instead of an 8.\\n\\n\r\nEnjoyment: 9\\n\r\nIt was a good show. I liked it a lot. The only thing I wanted that I didn't get was romance.  But I did get a lot of bromance, so I guess that makes up for it!\\n\\n",
            "date": "2014-06-29T10:54:00+00:00",
            "helpful_count": 55,
            "mal_id": 149305,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3088041.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MachinaEm",
                "username": "MachinaEm"
            },
            "url": "https://myanimelist.net/reviews.php?id=149305"
        },
        {
            "content": "From the perspective of someone who watched both seasons of Uta no Prince-sama, Kamigami no Asobi is a solid 6. It's by no means a spectacular show, but it does its job decently well in 12 episodes and makes for an entertaining, if not particularly fascinating, experience.\r\nThe concept is a unique one: Kusanagi Yui, a pretty normal Japanese girl, is summoned to a strange school to help teach young gods how to care about humans. In the first episode alone, she encounters many of her new classmates, as well as Zeus himself, the commanding king of the gods who created the very school out ofthin air and can restrict the other gods' powers.\\n\\n\r\nAs the show continues, it becomes slightly obsessed with \"normal\" concepts, as Yui attempts to essentially teach the gods how to be human; this either works or doesn't, depending on the episode. Sometimes it can be very entertaining to see how the gods deal with the new ideas, with some of them enjoying themselves and others remaining totally confused. However, this also serves to erase any urgency that might've been created by the fact that Yui and the gods have only one semester's time to spend at the school. We know that they will be stuck there forever if the gods don't learn to care about humans in time, but there isn't any real worry about that goal being unreachable.\\n\\n\r\nAround halfway through its run, the show's main storyline begins to kick in, with deeper secrets revealed about certain gods, all of which serve to lead up to the climax. This is where I personally became more disillusioned with the show as a whole, mainly because of its pacing and how the story was ultimately treated. Its largest issue is that it relies on emotional investment - it doesn't really have any impact if you're not invested in the characters, and although I was enjoying the show up to that point, I didn't really feel attached to anyone except my personal favorite god, so it was difficult for me to care about most of the story. This problem mainly lies in the fact that each god's backstory was featured in only one episode, and because most of these episodes were also padded by everyday \"shenanigans\", the backstories are rather simple and poorly fleshed out.\\n\\n\r\nThe characters are nice enough. None of them made an impact on me enough to be added to my favorites list, but I did enjoy watching some of them. Others annoyed me, whether it was due to (in my opinion) too much screen time or unappealing personalities.\\n\\n\r\nA short rundown:\\n\\n\r\nApollo is arguably the most featured out of the gods. I didn't care for him, as his usual attitude is very bubbly and he tends to dominate any scene he's in; I also found his backstory one of the weakest, especially considering the mythology upon which it was based.\\n\\n\r\nHades, god of death, was my personal favorite. While he wasn't anything groundbreaking and only got one real focus episode, he was also one of the most entertaining characters due to his reactions to various situations.\\n\\n\r\nTakeru was a Japanese god, and I frankly can't recall much about him. Neither he nor his quieter brother Tsukito impressed me particularly much.\\n\\n\r\nBalder is possibly one of my least favorite characters in the show. I initially liked him, but suffice it to say that he plays a large part in the darker plot and ultimate climax, and that he's cast in a light that I found pretty out-of-character and frustrating. We are naturally supposed to sympathize with him to a point, but I found much of his eventual behavior to be either unsympathetic or just plain insulting.\\n\\n\r\nLoki, trickster and friend of Balder, was conversely a pretty decent guy. He, too, is focused on more and more as the show draws to its close, and although I found his character to be around as shallowly developed as the rest, Hosoya Yoshimasa delivered an outstanding emotional performance that served to make me like Loki that much more.\\n\\n\r\nThor, Dionysus, Thoth, and Anubis are all more minor gods who also appear in various episodes. Due to their receiving less screen time, there isn't much to say about them, aside from Thoth being quite entertaining with his habit of slamming both hands against a wall / onto a desk / etc. in every appearance. Zeus himself does appear past the first episode, but isn't featured as much as I'd have liked him to be.\\n\\n\r\nFinally, there's Kusanagi Yui herself; while more detailed than Uta no Prince-sama's Haruka, she's not an optimal main character in my eyes. She begins the show with a very decided backbone and strong opinions, standing up to Zeus himself and trying to deal with her new surroundings. However, as the show goes on, she just lets the gods and their personalities take over. We never really get to a point where she speaks up for herself and tells arguing or upset gods to shut up or calm down; she just continually makes weak protests or looks wide-eyed and worried. There are some points where I expected her to logically react more strongly, but she remained easygoing and passive. It's not a huge problem most of the time, but it did become frustrating for me as time went by.\\n\\n\r\nThe art of this show is basically easy to look at. Hair shading is an interesting, rather watercolor-esque style, while the character designs are pretty appealing and backgrounds are prettily done. There's nothing groundbreaking about much of it, but it is very pleasant. OP animation didn't appeal to me as much as ED, mainly because of a grittier and darker feel in the latter.\\n\\n\r\nThe musical score is relaxing and pleasant, with some nice flutes and strings used - not memorable per se, but then again it's been some time since I saw the last episode. I didn't care for the OP although it was catchy, but the ED stuck in my head after each listen and I personally found it a very cool song.\\n\\n\r\nAll in all, if you're looking for something light and fun, Kamigami no Asobi isn't a bad choice. It's not a masterpiece and has its few problems, but I also found it easy to watch and to comment on each episode. For me, it's just a cute, rather fluffy anime with characters that won't irritate you too much and a unique story.",
            "date": "2014-08-10T18:54:00+00:00",
            "helpful_count": 33,
            "mal_id": 156117,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3715185.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/jollyrogersgo",
                "username": "jollyrogersgo"
            },
            "url": "https://myanimelist.net/reviews.php?id=156117"
        },
        {
            "content": "You have to watch this anime! Through character development is not one of its strong point, it sound and animation is! I love its parts, and as you know from its cover, it is full of hot guys who I wish were real! I love the ending but won't elaborate any further. It disappointed though that everything was rushed, but I love to see a second season. Similar to some reverse harems, this anime has nose bleeds moments and melodrama, but it is good anime to watch or waste time on. Like a bowl of pho after a hangover, in anime terms a perfect animeafter Attack on Titan or Tokyo Ghoul.",
            "date": "2015-02-27T17:34:00+00:00",
            "helpful_count": 22,
            "mal_id": 181342,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1870444.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/wolfpackkn",
                "username": "wolfpackkn"
            },
            "url": "https://myanimelist.net/reviews.php?id=181342"
        },
        {
            "content": "I went into this anime only knowing two things, reverse harem and gods. I love anime with gods and mythology, expectantly Greek mythology. Kamigami no Asobi didn't let me down.\r\nStory~ The plot was pretty simple; eight gods and a human are trapped in an academy by Zeus and can't leave until they learn about human love and emotion. Then it had episodes about each god with Yui and a few group episodes. I think the two ending episodes were kind of forced, and unneeded.\r\nArt~ This show was filled with vivid colors and visuals. Every character seemed to pop out of the screen. The opening andend song art really captured the feeling of the anime. The ending itself was nice. Showing each god singing as the other 'students' rushed by.\\n\\n\r\nSound~ The music wasn't very memorable. The opening was upbeat and gave the show even more cheeriness.  Neither the opening nor the ending was very intriguing to me. The voice actors really had fun with their part I could tell. Each voice perfectly matched the character's attitude. \\n\\n\r\nCharacters~ The characters is were I had a bit of problem. With eight gods and one girl, it felt like it could be a good reversed harem. Didn't seem like too many or too little, yet they throw out two characters. Thor and Dionysus seemed to just be cut out. With Dee-Dee's love for wine and happy attitude, I think it would have been nice for him to see Yui as a love interest. It would have been great to have episode when his even drunk. Thor could have been the 'strong and silent' type. They just had so much potential that was wasted.\\n\\n\\n\r\nEnjoyment~ I really did love this show. It made me laugh a lot, episode 10 was my favorite. I just didn't like the ending episode and the wasted potential.",
            "date": "2015-04-05T10:01:00+00:00",
            "helpful_count": 12,
            "mal_id": 184839,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437397.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OtakuPrincess010",
                "username": "OtakuPrincess010"
            },
            "url": "https://myanimelist.net/reviews.php?id=184839"
        },
        {
            "content": "[STORY] - 10/10\r\n-----------\r\nThe story was truly amazing. The little teaser in the beginning of the anime really put an interesting vibe into the audience, and I truly did not expect the ending either. It got me very emotional in the end, and it bothered me having to think that the ending was how it ended. Maybe there is a continuation of the anime in the manga? I don't know, but if there isn't then the producers of this anime is really making me think what happens next. I've also heard rumors that there is a second season to the anime, and I really hope so,although my hopes are low because it has been more than 4 years since the release. (Ye there's probably no season 2 lol) The ending was still truly amazing though, and I won't be disappointed if it ended like how it ended.\\n\\n\r\n[ART] - 10/10\\n\r\n-----------\\n\r\nThe details and the background were truly amazing. When it was nighttime, the night sky was filled with beautiful and dazzling stars, and it was just very detailed. Everything in this anime was very well made, so Ii don't have anything negative to say about the art.\\n\\n\r\n[SOUND] - 8/10\\n\r\n-----------\\n\r\nThe voice actors / actresses truly did an amazing job, and they suited the characters of this anime very well. The anime also put in very beautiful and romantic music in the background in a lot of the scenes, although, I don't know what to feel about the opening and ending themes. I personally don't enjoy a lot of openings and endings of animes, so this really isn't a surprise to me. \\n\\n\r\n[CHARACTER] - 10/10\\n\r\n-----------\\n\r\nEverything about the appearances and the personalities of all the characters were very outstanding, especially the uniforms for school and when the Gods turned into their God forms. It really put a deep fantasy vibe into this story, and it was really interesting to see them transform into their true forms. \\n\\n\r\n[ENJOYMENT] - 9/10\\n\r\n-----------\\n\r\nI didn't really enjoy the beginning of this anime until around episode 3-4, although like I said earlier, the ending was truly amazing and left me in shock. I knew the ending would turn out like it did because it was kind of obvious to predict, but how they pieced the ending together just made it very sad. I do wish there is a season 2, but I won't be disappointed if it didn't, because the ending of season 1 was not bad at all. \\n\\n\r\nFINAL SCORE:\\n\r\n9/10 \\n",
            "date": "2018-10-14T16:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 291759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6159701.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AnastasiyaV",
                "username": "AnastasiyaV"
            },
            "url": "https://myanimelist.net/reviews.php?id=291759"
        },
        {
            "content": "At last, this anime has finished airing (although I am pretty sure specials will be on their way). I will not include any spoilers, just cause not even the barely-decent stuff is worth mentioning.\r\nEver since this anime was green-lit, I was really excited to watch it. The original game comes from Broccoli, who also made Uta no Prince--and I loved the anime for that game, albeit the second season got pretty ridiculous. I love otome games in general, so I was psyched to watch another anime based on a game. But now that the anime is over, I feel extremely disappointed and that I've wasted12 weeks watching this.\\n\\n\r\nStory: Now, the story seems decent. However, since this is a reverse harem show, obviously the anime will have little stories in it dedicated to individual gods and their respective relationship development with Yui. These stories are quite boring, and sometimes goes past the point of ridiculousness in a bad way. \\n\\n\r\nArt: Possibly the only topic I can give higher than a 4 on. It's pretty, although not so pretty that I can constantly admire.\\n\\n\r\nSound: Not memorable. Not even the opening and ending songs are good. \\n\\n\r\nCharacter: Oh God, these characters are terrible. All the gods are pigeonholed so much that I was always extremely annoyed with them. Example: Dionysus, who ONLY talks and thinks wine. Yes, I know he is the Greek god of wine, but a good character should develop or at least not repeat the same crap every. single. episode. Dionysus was also just a background character, and so nobody bothered with him--which I annoyed me so much, because I wanted a reason why this character is there if the studio bothered to draw and animate him. All other gods do this to some degree, and never really develop--even with what happens at the end. Yui is pretty much the only decent character there, because she discovers what these gods are going through and is not a--relatively speaking--wooden character that is bland and boring. But the flaws of all the other characters overshadow her, not letting her stand out.\\n\\n\r\nEnjoyment: With poor characters, fair art, and terrible stories, I felt like I was trudging through quicksand when I decided to continue with this anime, since I wanted to finish what I started. Nothing exciting happens really.\\n\\n\r\nOverall: I tell everyone to steer clear of this anime, even those who are fans of otome games and the reverse harem genre. This show isn't even laughably bad. I am severely disappointed, and annoyed that I have wasted my time with this anime.",
            "date": "2014-06-22T06:27:00+00:00",
            "helpful_count": 10,
            "mal_id": 148013,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1442877.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MonochromeSong",
                "username": "MonochromeSong"
            },
            "url": "https://myanimelist.net/reviews.php?id=148013"
        },
        {
            "content": "Story: 9\r\nThe plot was very well thought out. Not once did I feel like they were trying to force stuff to happen. The plot made sense, it was interesting, complex, and easy to follow. The only thing that made it a 9, and not a 10, was the fact that there was no actual romantic relationship that emerged with the main character. That's just my own preference though, and the fact that there was no relationship actually fits the plot perfectly.\r\nArt: 10\r\nThe art was amazing. The scenery was beautifully drawn, the characters each had their own unique look that made them very appealing to lookat (especially the gods, they're hot as f#%& if I do say so myself).\\n\\n\r\nSound: 9\\n\r\nThere's nothing particularly wrong with the way they sound. Everyone's voice matched them, except for Melissa. The reason I gave it a 9 is because I wish there was a dubbed. (Please don't hurt me)\\n\\n\r\nCharacter: 8\\n\r\nThe characters were well thought out. The each had unique personalities, as well as their own issues which made us understand them better. I would have wished to understand Thoth and Zeus more. Also, more of Anubis would have been entertaining to see.\\n\\n\r\nOverall, I really enjoyed this anime. I would recommend it to everyone. People who like fantasy will especially like this. \\n\\n\r\n10/10 I would recommend this to everyone, although if you're not used to watching subbed, it might be hard for you to follow.",
            "date": "2017-07-08T12:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 252287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6314661.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/shsamie",
                "username": "shsamie"
            },
            "url": "https://myanimelist.net/reviews.php?id=252287"
        },
        {
            "content": "Well then, that was nice so another reverse harem 2014 spring anime has ended, so no more fucking around as I state my ratings for each of this anime's category:\r\nVery Good 8:\r\nStory- At first I thought that it's gonna be one of those usual reverse harem genre, but then again it's a bit different as the plot focuses on a girls whose mission was to make them deities understand the meaning of being human and therefore ending their never-dying bickering for one another. Well, of course there were still those usual helping one another thing and the competition for the maiden's heart and a usualharem ending except here the harem ending was put on an acceptable level.\\n\\n\\n\r\nEnjoyment- As usual the enjoyment part is where one would ask the question as to whom the girl is gonna choose among the deities, as I've  mention on the above paragraph was that it has an acceptable harem ending and it was that acceptable harem ending where I give this part a \"Very Good\" score.\\n\\n\r\nGood 7:\\n\\n\r\nArt- Basically the character's school uniform and the god wardrobe maybe a bit gayish for a dude but for me I find very elegant and pretty much metrosexually  \"Good.\"\\n\\n\\n\r\nSound- I like both the opening and closing theme, most  of all I like the VA who did Yui's voice, so basically the score is for the opening theme, closing theme and Yui's voice.\\n\\n\\n\r\nFair 6:\\n\\n\r\nCharacter- Unfortunately, Yui still portrays the usual reverse harem girl who is nice but indecisive, sweet but too sweet and caring but a bit ditsy. Then again, her role as the central figure for the deities kinda serves it well, which is why this category would be \"Fair\" enough.\\n\\n\r\nAs for the deities, here are my rants about them:\\n\\n\r\nApollon Agana Belea - a perfect nice guy but a bit too immature on the side.\\n\\n\r\nHades Aidoneus- pretty much a gloomy old man.\\n\\n\r\nTakeru Totsuka- he is probably the only cast who is in need of attitude adjustment.\\n\\n\r\nTsukito Totsuka- If every I encounter someone with his personality, I'd be bored to death.\\n\\n\r\nBalder Hringhorni - I'd probably say that he is half nice guy and half predator.\\n\\n\r\nLoki Laevatein- He simple needs some spanking.\\n\\n\r\nThor Megingjard and Dionysus Thyrsos, what can I say, they are more on the sidelines than anything else.\\n\\n\r\nThoth Caduceus- pretty much the meanie in this series.\\n\\n\r\nZeus Keraunos- the big man who drafted Yui into service was probably the only character that I love to hate.\\n\\n\r\nAnubis Ma'at- who the fuck is he?\\n\\n\r\nMelissa- pretty much the only friend that Yui has.\\n\\n\\n\r\nGreat 9:\\n\\n\r\nOverall- I can only say that this was probably the only \"Great\" reverse harem  anime I've ever watched. The End.\\n\\n\\n\\n\\n\\n\\n",
            "date": "2014-06-22T12:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 148049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2129425.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RazorRamona200",
                "username": "RazorRamona200"
            },
            "url": "https://myanimelist.net/reviews.php?id=148049"
        },
        {
            "content": "I honestly really liked this story. It did a good job highlighting each characters attributes, while answering the question posed to the viewers. I felt like each episode was its own little tale, they fit together but they were also different. If your looking at this being a \"romantic\" anime then I would go elsewhere. It has the elements, but lacked the development which disappointed me. However, I really grew attached to the characters. They all had such different personalities and it was really fun to experience. I would totally watch this anime if your looking for a different kind of reverse harem. If yourhaving reservations about watching it, don't. I was skeptical about watching it at first, and I put it off. I'm glad that I gave it a chance!",
            "date": "2015-04-24T14:40:00+00:00",
            "helpful_count": 6,
            "mal_id": 186375,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1387819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/timedoctor",
                "username": "timedoctor"
            },
            "url": "https://myanimelist.net/reviews.php?id=186375"
        },
        {
            "content": "This anime put me in a state beyond words. Despite the fact that I absolutely refuse the ending so very much, I still really enjoyed the story.\r\nIt's a fun anime to watch and somewhat relaxing, but it still gives you enough trills to keep you going.\r\nAs I mentioned, the ending was not quite to my liking. I wanted more, found that the story should continue and, who knows! , the kind of set it up so that a second season wouldn't be surprising and weird.\r\nI recommend this anime a lot even though I normally don't like harems.\r\n[ignore the following, it said longer review]\r\n................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "date": "2018-10-27T20:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 292800,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5543039.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Vicky-chama",
                "username": "Vicky-chama"
            },
            "url": "https://myanimelist.net/reviews.php?id=292800"
        },
        {
            "content": "The first episode caught my eye with everyone's unique personality, the art style and the sound so i was very intrigued, but then as I watched further through the anime, it felt so rushed that there isn't much of a connection going on with the characters that would help each other develop further more, but I did enjoy the anime and wasn't really expecting the ending, the ending touched my kokoro since I really like the guys, especially Apollo. \r\nI hope that there is a season 2 since I really like it because of the unique personalities and even if the backstories aren't that verydetailed that can make the viewers feel what the characters would feel, I still think that it is interesting and somehow only Apollo and Yui are the only one I can see having a deep connection.",
            "date": "2016-10-15T22:08:00+00:00",
            "helpful_count": 4,
            "mal_id": 231860,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5732821.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CptRainy",
                "username": "CptRainy"
            },
            "url": "https://myanimelist.net/reviews.php?id=231860"
        },
        {
            "content": "I'm sorry in advance if this review isn't necessarily in standard format, but it's hard for me to compartmentalize like that, but this show surprised me so I thought it needed a review. \r\nKamigami no Asobi is not quite what it seems and certainly not what the synopsis implies. I came into this show expecting a mindless otome adaptation type show with a bit of mythology thrown in. Fun, but no big deal right? I got so much more than I bargained for. This show had me literally laughing out loud every week. No matter what your sense of humor their is most likely atleast one character who shares it. Which is a lovely segway to my next point, characters. Yes, it is a reverse harem and as such follows plenty of character tropes, BUT every character is well developed, almost every character has a backstory (usually touching), and they were all just so lovable! The characters were the shining point of this show. This, in a happy turn of events, does not exclude the heroine. I think anyone familiar with this genre realizes what a refreshing change this is. Yui speaks, thinks, cares for people, and does not seem to be compelled to be a doormat. The art and music were both fantastic but don't really need reviewing.\\n\r\nFinal warnings: 1) when it says teach them (the gods) about love and the human heart it's not what you think. This is referring to humanity, not romance 2) it is a reverse harem, don't go into this expecting it to be otherwise 3) there are feels. They caught me off guard so I had to earn you. Prepare yourself for serious feels near the end.",
            "date": "2014-06-28T13:06:00+00:00",
            "helpful_count": 5,
            "mal_id": 149123,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3269451.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/guini_mitsukuni",
                "username": "guini_mitsukuni"
            },
            "url": "https://myanimelist.net/reviews.php?id=149123"
        },
        {
            "content": "Well, that was a lot better than I expected! I am an avid otome player and I've seen a few anime that have been based off the reverse harem ideas or games, and most of the time, they don't go very well (see Amnesia).\r\nHowever, Kamigami no Asobi manages to pull it off a lot better than most. \r\nTo begin with, the story: it manages to bring together the plot in the first episode quite well. There are a few plot holes or things that weren't explained to the finest, but those are issues that can be overlooked because the series was so short to beginwith. In addition to this, it's important to note that the series was mainly episodic. A character was chosen to be the focus and then elaborated upon for an episode or so. I'll come back to this when we talk about characters. The overarching plot was about the Gods learning to understand humanity, and the show does a pretty good job of displaying it, even if it was a pretty cheesy representation. \\n\\n\r\nThe art was great! I enjoyed how the characters were drawn (very easily distinguishable, but at the same time, not outlandish and crazy like the characters of Amnesia), and the backgrounds were pretty as well. I loved the night sky portrayals. It's also important to note that the God forms of the main characters were very detailed and beautiful, along with their specifically cultured dorm rooms. \\n\\n\r\nThe sound was fine. I was a big fan of any of the music, but at least all the voice actors were pretty good and none pissed me off, which is a feat, cuz I get annoyed almost too easily. \\n\\n\r\nGetting back to the characters-- there's nine main characters. The heroine and human, Yui, is the central focus of our harem. From Greek Mythology, we have Apollon (was it supposed to be Apollo?) who gets a pretty deep tragic past that's a variation of a true myth. He gets enough development that he's fun to watch, but his motivations aren't always clear and his dialogue and actions are pretty cheesy and bland. He reminds me a lot of Tamaki from Ouran. The, from Greece, we also have Dionysus and Hades, who get little to no screen time, and whenever they do, they're used as comic relief. Personally, I wish they got more development, but I guess they were meant to be background characters and the series was too short anyhow. On the other hand, we have our Gods from Japan, Tsukito and Takeru. Both have their own episode to themselves, so they're developed well enough, though they're shoved aside in the finale for Apollon and the Norse Gods. \\n\\n\r\nThe Norse Gods finish off the series with a bang. Loki, Balder, and Thor were barely present in the first part of the series, but slowly began to make the scene until Loki and Balder were the main focus. Despite being close with them, Thor was ignored, and that made me a little sad because he had some real potential as a character. I enjoyed the Loki and Balder sequence (mainly cuz I ship them... a lot) so it was a pretty nice finale. I would like to say I was disappointed by Yui as a whole though. I know I shouldn't expect much from anime heroines at this point (especially in a reverse harem video game based shoujo anime) but I couldn't help myself. When she talked about swordsmanship, I got excited because I'm a martial artist myself, so I hoped that her character would be kickass and get the Gods off of their high and mighty thrones, but instead, the swordsmanship was used as a plot device to lure Takeru into the group and then abolished afterwards. I wish they had given her a little more umph, because she really did stand a chance at first. I didn't find her particularly annoying, but honestly, it wouldn't have made any different if she wasn't there. \\n\\n\r\nAs much as I liked Apollon, I also wish that Yui hadn't basically been paired up with him from the start. I liked him and Cassandra better, and I honestly think that Yui with perhaps Tsukito or Takeru might've been alright, if she had to have a pairing, though I don't think it was needed at all. This is coming from a person who loves shipping more than anything!! I just didn't feel the chemistry between any of the characters except Loki and Balder, if I'm being honest. \\n\\n\r\nI enjoyed this a lot more than I thought I would, to be honest. The humor was pretty good (I have a strange sense of humor, and it definitely catered to it) and the plot interesting enough that I could follow through with watching it without getting bored. All in all, a good watch! \\n\\n\r\nI would recommend if: you like mythology, you enjoy reverse-harems, you like it when a ton of boys fight over a girl, you like 'school anime' without traditional school troubles.\\n\\n\r\nI would NOT recommend if: you're looking for something dark or angsty, you want a lot of character development, you're not a fan of reverse-harems or love triangles, you don't like mythology or mythical Gods, anime about friendship and sunshine and rainbows bore you. \\n\\n\r\nHave a great day everyone! \\n\\n\r\nP.S. In twelve, episodes, Thoth boxed Yui into a wall 11 times. Eleven times. Only once was it even needed. Just saying.",
            "date": "2018-01-04T15:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 267428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4875883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeaOotori",
                "username": "LeaOotori"
            },
            "url": "https://myanimelist.net/reviews.php?id=267428"
        },
        {
            "content": "Guys. I never thought I'd give a serious review on something, but there... I watched Kamigami no Asobi.\r\nThis anime has a really nice character development and it's really enjoyable to watch. \r\nThe story might not seem intresting when u are reading the synopsis, but if u end up watching it, it manages to bond u with the characters and touches ur soul in the end (well if u are the sensitive type).\r\nI don't really wanna write much, because nothing can express how good this anime  was. So, all I want to say is that if u like reverse harems YOU GONNA LOVE THIS andI highly recommend it! \\n\\n\r\nStory : 9\\n\r\nArt: 9\\n\r\nSound : 10\\n\r\nCharacter : 10\\n\r\nEnjoyment : 100 (no the 2nd zero is not a typo)\\n\r\nOverall : 10 \\n",
            "date": "2017-09-25T10:55:00+00:00",
            "helpful_count": 2,
            "mal_id": 258651,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/782431.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ZabimaruE",
                "username": "ZabimaruE"
            },
            "url": "https://myanimelist.net/reviews.php?id=258651"
        },
        {
            "content": "At the time of writing this, I have rewatched Kamigami no Asobi at least 4 times since I discovered it 3 months ago. It's easily in my top 5 anime but even so, decide for yourself whether this anime is for you or not. \r\nStory 8/10\r\nSo we have Yui, the only human to be summoned to the almighty Garden created by Zeus; tasked with teaching 7 gods from Japanese, Norse and Greek mythology about humans in order to gain an understanding of humans and why connecting with them is important for them as gods.\r\nI liked the simplicity of this main story objective being laid outright from the start. It allowed me to be on the same page as all the characters and experience everything with them together. The story itself is by no means weak - especially for a reverse harem. It certainly has an allure that picks up speed as more episodes go by. The pacing is very comfortable and even as things escalate and get darker towards the end with Loki and Baldr's arc, it is very well done. I easily would watch another season of this.\\n\\n\r\nArt 10/10\\n\r\nGorgeous! I could stare at the art from Kamigami no Asobi all day and it's obvious why this did so well as a visual novel. The boys all look wonderful.\\n\\n\r\nSound 10/10\\n\r\nI've downloaded the Kamigami no Asobi OST. I really could listen to it all day. It's intense, poignant, spritely, comedic and extremely fitting for the all round feel of the show. The opening sequence song Till The End is also sung by the voice actors and is divine. It also really does feel like something out of a fairytale. Want some proof? Google the 'Strong Ties' soundtrack used for the friendship between Baldr, Loki and Thor. It evokes some STRONG emotions.\\n\\n\r\nCharacter 10/10\\n\r\nSo right from the get go we meet Yui and blah, blah, blah. Stuff happens and she meets major gods from Japanese, Norse and Greek mythology (below I have excluded side characters Dionysus and Thor). \\n\\n\r\nJapanese: Takeru & Tsukito Totsuka, god of the sea and god of the moon.\\n\r\nNorse: Loki Laevatein, Baldr Hringhorni, god of fire and god of light and destruction.\\n\r\nGreek: Apollon Agana Belea & Hades Aidoneus, god of prophecy and god of the Underworld.\\n\\n\r\nYui herself is a sufficient character, she certainly has her merits and most definitely isn't a weak character. She has a tendency to be very protective of her new friends and takes her role as their teacher very seriously; despite also because she wants to go back home, she really wants these gods to graduate from 'Garden School'.\\n\\n\r\nThey are wonderful characters to watch. Each has a very different personality with weaknesses and strengths, but they each develop and change for the better (and sometimes for worse) throughout the show. Even the side characters, who we don't see nearly enough of, are very fun to watch.\\n\\n\r\nThe friend dynamic between these gods and Yui is very touching and it's a pleasure to watch it become stronger with each episode. Of course, there are gods that Yui has to win over (primarily Loki and Takeru). She brings something humane and positive to each of the boys. It also has a little fanservice but it's not super annoying.\\n\\n\r\nThere are scenes between these boys that really do provoke feels but it also is surprisingly strong with humour. \\n\\n\r\nEnjoyment 10/10\\n\r\nThe only other anime that has made me laugh as much as this is Ouran High School Host Club. Every single episode was truly enjoyable. It was a pleasure to watch something that is just so damn PERFECT. The story, art, sound and characters mesh together to make a friggin' masterpiece.\\n\\n\r\nOVERALL 10/10\\n\r\nWas there ever any doubt that this would score lower than a 10? Kamigami no Asobi makes you laugh and cry and at the same time gets rid of more annoying things in reverse harems such as EXTREME jealousy between all boys over the main character (perhaps with one story-related incident with Baldr). I'll be rewatching again for the 5th time very soon.\\n\\n\r\nThere isn't an anime that I want to have a second season more than Kamigami no Asobi.\\n\\n",
            "date": "2017-08-20T23:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 255930,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6112552.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Bexx02k",
                "username": "Bexx02k"
            },
            "url": "https://myanimelist.net/reviews.php?id=255930"
        },
        {
            "content": "Kamigami no Asobi is the best Reverse Harem i ever watch. I experience sadness and happiness watching this anime.\r\nThe plot of the anime was understood. It show slight fan service and non of the episode will bored you. Every episode will show a plot which can be tear jerking, humorous and makes you fan girl.\r\n This anime  makes me portray the MC, Yui as a strong willed, hard working, persuasive and NOT a slut as i usually see in Reverse Harem MC.  Since some of the gods are hard to approach Yui work hard and even when in danger fight for what shewants. Unlike other reverse harem MC, Yui doesnt throw herself towards the god (The gods is freaking hot i would not be able to control myself, even more when they transform )and is a very active MC. Always outside of her room and even in another world continue to train herself. Both their op and ed songs are amazing and even more their character song,\\n\\n\r\nMUST WATCH ANIME. BEST REVERSE HAREM EVER.",
            "date": "2015-12-01T02:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 204559,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3421487.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/glenn27",
                "username": "glenn27"
            },
            "url": "https://myanimelist.net/reviews.php?id=204559"
        },
        {
            "content": "When I first read the synopsis I thought, oh cool, this sounds like something interesting, and I thought of the possibilities such a concept could have. So going into the anime I was pretty excited. After watching the anime I feel as if I wasted my time, when I could have been watching a far better show. Here I'll go into my reasoning:\r\nStory(2): \r\nThe show doesn't have much of a plot, it is basically the female protagonist getting to know all the characters (which makes sense because it is based on a otome game), which, for me, was pretty boring to watch. In addition, theanime gradually leads up to a main conflict/climax, but it is unknown what this climax is until the end, when they introduce it, resolve it, and wrap up the anime in about 2 episodes. It simply felt pointless, and the entire \"plot\" was a big disappointment.  \\n\\n\r\nCharacters(4):\\n\r\nThe characters themselves were pretty simple, though the anime did try to give some of them backgrounds, but many characters were left flat and two dimensional. This includes the protagonist, who had no backstory, and whom I found to be annoying, especially as her character seemed to react the same way to everything. \\n\\n\r\nArt(6): \\n\r\nAs far as the art and animation go, it wasn't the best I've ever seen but it certainly wasn't bad. It was pretty basic, and I actually enjoyed some of the character designs. \\n\\n\r\nEnjoyment(4): \\n\r\nNow I didn't really enjoy this anime and despite all that I have already said there were a select few parts of the anime I enjoyed. The first being the humor. Now this anime is, of course, not a comedy, however, there was some humor that I enjoyed (particularly episode 10).  I also enjoyed Apollon's and Thoth's nicknames for the various characters. \\n\\n\r\n*Sound(4): In case you were wondering about the sound of the anime, there isn't much for me to say except it was fairly bland, nothing special, but also nothing terrible.",
            "date": "2016-03-28T16:18:00+00:00",
            "helpful_count": 4,
            "mal_id": 214594,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5283082.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 4,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Blue_Cake",
                "username": "Blue_Cake"
            },
            "url": "https://myanimelist.net/reviews.php?id=214594"
        },
        {
            "content": "Amusing and surprisingly creative, Kamigami no Asobi was far more enjoyable that I thought it was going to be. Not only is the art lovely, but all of the characters were surprisingly likable. One would think that in a show that's basically about tons of guys having the hots for the main girl, there would be one douchebag that you pray the heroine won't fall for.\r\nNot so with this. Like its brother anime Uta no Prince Sama, pretty much all of the male cast were decent guys, if not somewhat one dimensional. One character I found surprisingly lovable was the god of the Underworld himself,Hades.  \\n\\n\r\nUnlike Prince Sama, however, this anime had a more creative spin to it. I mean, it's not every day that you see mythological gods as love interests. I have to be honest, I was kind of disappointed there were no Old Ones in this. Having the Great Cthulhu sparring for the love of the main girl against gods like Thor and Apollo would have been the best thing ever.\\n\\n\r\nI have to be totally fair in my review, however, so I must mention the anime's flaws. As always, when dealing with shows based on dating sims, the main character is kind of bland. She's not unlikable, and she's not even that dimwitted, but there's nothing too memorable about her. Her only main feature is that she is good at sword play, but that is almost forgotten near the end and the makers of the show don't use that quality to her advantage. Instead of saving the day when the show's climax is in full swing, she just follows the others and doesn't do much. In a show where gods of mythos have to learn how surprisingly strong and admirable humans are, we don't see the heroine do much except encourage and support, and while those are good qualities, it would have been refreshing to see her be the one to actually save the day; to rescue the knight in distress, so to speak.\\n\\n\r\nAll in all, the show is a solid 7. It's good. It won't blow you away in its story, character development, or even romance, but it's good.\\n",
            "date": "2015-09-21T16:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 199164,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4676368.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/cthulhuhuhu",
                "username": "cthulhuhuhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=199164"
        },
        {
            "content": "Finally, an otome game adaptation that sits well with me! Kamigami no Asobi has an interesting premise-- Girl and a bunch of Gods (only dudes, no Goddess because this is a dating sim) are trapped in a magic high school. The human girl must teach the Gods about humanity and love, otherwise they'll be trapped in the school.\r\nCharacters are all interesting. Of course, there are some that follow certain cliches/ has one outstanding trait about them, but for the most part, they are all fleshed out. The main character is a cut above most other otome adaptation heroines in which she does get things done,but her personality is rather stale in comparison to the male cast. \\n\\n\r\nThe story is pretty okay as well. It starts off pretty much slice-of-life ish for the first half, but quickly dives into full throttle near the end. \\n\\n\r\nAll in all, would recommend if you wanna see reverse harem.",
            "date": "2015-11-27T18:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 204300,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AppleNitro",
                "username": "AppleNitro"
            },
            "url": "https://myanimelist.net/reviews.php?id=204300"
        }
    ],
    [
        {
            "content": "It's very close to being great, but it's hard to make a great anime that's based on a visual novel.\r\nThe animation is good and the episodes are entertaining, so if you're like me and that's all you really need then this is a really good time waster. But out of the 8 boys only 3 of them are really paid attention to and 2 of them hardly register as characters. The main girl also gets pushed to the side during the main conflict and her skills don't help in the resolution of the story at all which makes the whole ending feel weak. \r\nI wishit had been split into two seasons so there had been enough episodes for all the the characters to be relevant in more than one episode, including the few side characters that were obviously only included because the people who played the visual novel would have been mad if they weren't.\\n\\n\r\nOverall it's a decent show that I enjoyed watching, but I doubt I'll remember it for very long.",
            "date": "2018-11-30T12:22:00+00:00",
            "helpful_count": 1,
            "mal_id": 294984,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7568896.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/tweedlebean",
                "username": "tweedlebean"
            },
            "url": "https://myanimelist.net/reviews.php?id=294984"
        },
        {
            "content": "I gave this one a solid 7 because it's not as astounding as other reverse harems are plot/story wise but at the same time it's not bad either. The twelve episodes are adequately all you need to feed that satisfactory meter, it didn't ended on a cliffhanger and the story was well executed. The characters are well developed and the MC is not annoying.\r\nIt is a very light hearted anime with a unique & cute plot. It was surprisingly enjoyable especially for reverse harem fans. I personally think the art was gorgeous. The men ofc are beautiful which got me to stick to the lastepisode. lol Each chapters contain a good amount of comedy and light drama, enough to get you out of boredom. \\n\\n\r\nOverall, its one of those shows that's forgettable but definitely one you can turn to if you are looking for a less tensed plot with childlike romance theme. It's a feel good reverse harem suited for all.",
            "date": "2018-01-15T19:54:00+00:00",
            "helpful_count": 1,
            "mal_id": 268710,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6638681.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Happy_Mask",
                "username": "Happy_Mask"
            },
            "url": "https://myanimelist.net/reviews.php?id=268710"
        },
        {
            "content": "This was my first reverse harem show that I have watched thus far. This has caught my attention and begged \"WATCH ME!\" multiple times over the course of weeks. So, since I'm familiar with items that would normally be pushed over for girls, I thought that it would nice to have a different type of show among my watch history.\r\nI'm glad I didn't make the wrong choice either, because I was surprised on how much I enjoyed this anime.\r\nStory: 7\r\nTo the show's credit, there are some interesting story elements that are unique. However, like other shows of the same genre, it suffers from some ofthe same qualities that are often beaten to death, such as how the girl meets the guys (and vice versa), and how the guys or girls are supernatural creatures or what not. Though going into this, I wasn't expecting an all original story, and for the most part, it's as unique as possible.\\n\\n\r\nArt: 8\\n\\n\r\nBrain's Base are known for more elaborate productions, such as Penguindrum and Durarara, and for a more refined anime, it looks gorgeous! All of the character designs are animated and put into settings well, and some scenery is just breath-taking to look at. (Those night skies. :3) It's not perfect, with some animation getting too distracting, but in other cases it works great.\\n\\n\r\nSound: 9\\n\\n\r\nAll of the seiyuus are either great or FANTASTIC depending on your own personal preference. Personally, I was impressed with the quality of the voices being so well, and  the cast had some of my favorites as well. Actor picks go to Saori Hayami, Yoshimasa Hosoya, Toshiyuki Tonaga, and Yuto Uemura. (Please be in more stuff)\\n\\n\r\nThe opening and ending were both a joy to listen to, though the background music composed by Elemental Garden was more forgettable with some of it's material.\\n\\n\r\nCharacter: 9\\n\\n\r\nEach of the main characters had equal amounts of development, and it was nice not to be over-burden by some stereotypes of many anime characters in the past that I've seen. The side characters aren't really focused on minus one, so that was a bit disappointing. My favorite characters in the end belonged to Loki, and Tsukito.\\n\\n\r\nEnjoyment: 10\\n\\n\r\nI looked forward to every episode after I finished one, especially towards the latter half.\\n\\n\r\nOverall: 10\\n\\n\r\nKamigami No Asobi was a successful introduction to the reverse harem genre, and has me wanting to explore more of what this particular genre has to offer. If you like the overall genre itself, or just wish to watch this for fun, this show is for you.\\n\\n",
            "date": "2014-06-29T12:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 149333,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879833.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DazzlingAnime1",
                "username": "DazzlingAnime1"
            },
            "url": "https://myanimelist.net/reviews.php?id=149333"
        },
        {
            "content": "Story 7/10\r\nThe storyline is nothing particularly creative and inventive, and relies almost entirely on its characters. It follows the various adventures of the different gods and the main character interacting with them, so it feels sort of episodic with an over-arching plot in the background. That is, until the final few episodes where the true final plot is unveiled, which I admit it was fairly interesting but very cliched. I will give it props for going a different direction than what the first few episodes suggested, though. \r\nArt and Sound 7/10\r\nThe Art was nothing truly spectacular, but it was by no means bad, either, andthe same could be said for the music. Nothing felt out of place or weird, but at the same time nothing really stood out besides maybe one of the titles and the opening and ending themes. \\n\\n\r\nCharacters 8/10\\n\\n\r\nThe characters are all quirky and lovable, and each have their own emotional baggage to deal with. This is actually one of the shows strong points, but that's a given since the story relies so heavily on them. Almost all of the important characters have a designated episode for them to cause drama and strengthen relationships with their friends. \\n\\n\r\nEnjoyment 8/10\\n\\n\r\nOverall, I probably enjoyed this show a lot more than I should have. I'm fairly certain that it was written for yaoi fan girls, so that's probably why. However, if you wouldn't want to watch a group of attractive young men who act gay and have sob stories and all fall for one girl, then this probably isn't the show for you. But if you do like that stuff, then you're probably going to like the show as much as I do.",
            "date": "2014-06-21T16:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 147915,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1964740.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hypermoyashi",
                "username": "Hypermoyashi"
            },
            "url": "https://myanimelist.net/reviews.php?id=147915"
        },
        {
            "content": "I really enjoyed this show. It was a nice mix of fiction and mythology. This is a reverse harem, so of course, many elements typical of this genre are found. There are hints of the gods harboring some feelings toward the Yui (the main girl), but the main focus of the show is friendship and human nature/feelings, which I found really nice. Humour is well incorporated and there are also instances where I was really touched.\r\nThe plot was interesting and new. Although there are some cliché here and there, the main idea was something I hadn't seen before. The ending felt a little weird. Theseemingly sad ending, though a little heartbreaking to watch, made a lot of sense. But suddenly, everyone reappeared. It became one of those typical kind of ending where everyone is always together and happy. But that's a detail that I will overlook, considering how the rest of the show was good.\\n\\n\r\nI have no complaint about the art. The characters are really cute and the setting is nice as well. Then again, I'm not a picky person when it comes to art so that aspects easily scored 10/10 with me.\\n\\n\r\nThe music and sound effect was good too. It contributed to the greatness of this show. No complain there either.\\n\\n\r\nThe characters were fun. Each had a different personality, but they were able to get to know each other, get along and join forces. I don't know that much about most of the gods presented, so I don't know how much of their personality in this show is reflected in the anime, but I did recognize some traces of the original mythology and this is something that I liked. Thoth was a particularly funny character. Even though he is only a supporting character, in each episode, we can always count on him to display his infamous \"wall slam\". It's a little recurring gag that I ended up looking forward to every week watching the show. Loki's playful personality, Balder's clumsiness, Tsukito's emotionless expression, Hades's conviction of always bringing misfortune and many other are all things that make the characters unique and loveable.\\n\\n\r\nSo overall, I loved this show. I'd definitely recommend it to someone who likes reverse harem and humour. It is a great show for leisure. For me, it was one of my favorite shows this season.",
            "date": "2014-06-21T11:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 147881,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3822721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AceOfNoTrade",
                "username": "AceOfNoTrade"
            },
            "url": "https://myanimelist.net/reviews.php?id=147881"
        },
        {
            "content": "Kamigami no Asobi is one of the best anime that I've ever watched. Seeing as I never write reviews for anime, I decided to write one for Kamigami no Asobi because I feel that this anime doesn't get enough attention. Fantasy, reverse harem, adventure, and plot twists! These attributes all appear in this anime and made me love this anime even more. \r\nStory-9\r\nI feel that the story for Kamigami no Asobi in the beginning was a bit too, well how would you put this, \"extraordinary to be true\" but as the anime progressed, I think that the story also progressed. The anime was pretty muchwhat you would expect from a reverse harem, except that it was with gods (if you didn't know already). Towards the end, the plot twists made the anime more enjoyable but at the same time, they shift their attention to certain characters and the other characters didn't get as much screen time. Overall, the plot and story was great and surprising but there were little flaws that could have been done better.\\n\\n\r\nArt-10\\n\r\nI LOVED the art for this anime and when I say loved, I mean it. From the drawing styles that reflect on the characters perfectly. For example, lets take Loki for example. His red hair perfectly reflects his fiery personality. Apollon's baby face (that's how I see it) reflects his usually innocent nature and the curiosity to try new things. Each characters design was beautiful and couldn't have done any better (although when I first saw Melissa I was a bit weirded out).\\n\\n\r\nSound-9\\n\r\nThis anime stepped up to the stage when the sound needed to be important. The effects of the sound were overwhelming but it didn't really stand out to me that much. The sound matched the action scenes of the anime pretty well.\\n\\n\r\nCharacter-10\\n\r\nIn my opinion, the characters were the best part of the anime. Each character having their own separate personality was what really made me love this anime. Although some characters got more screen time and therefore developed more, I felt that each character developed a HUGE amount during the series (mainly when it was their episode). Personally, Hades was my favorite character. With his awkward personality that later opens up, Hades's character developed was the best. \\n\\n\r\nEnjoyment-10\\n\r\nThis anime was an anime that is impossible to not enjoy. With every episode leaving me desperate for more, I couldn't stop watching it! The plot twists were all thrown in at the perfect times and they caught me off guard. One of the best points was the action scenes. All of them were beautifully crafted and it always felt like I was there, cheering for everyone from the sidelines. \\n\\n\r\nOverall-10\\n\r\nThere are very minor things that this anime could improve on. This is what I would probably define as a \"perfect anime\". It made my heart burst with emotion and I enjoyed it. \\n\\n\r\n-Ahh this is my first review so it probably isn't that great >~<-",
            "date": "2016-01-16T20:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 208704,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4985181.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/PurplePuppyNerd",
                "username": "PurplePuppyNerd"
            },
            "url": "https://myanimelist.net/reviews.php?id=208704"
        },
        {
            "content": "Personally, I always enjoy reverse harem animes, and this one was no exception. Quite the opposite in fact, because KamiAso exceeded my expectations in so many ways I was pleasantly surprised, because although it's not evident in the first few episodes, it's a reverse harem anime with an actual plotline to it, and what's more, with each episode I found myself getting more and more hooked on it.\r\nSo first of all let's talk about this story, because seeing this kind of anime have a definitive plotline is actually rather rare, because if you look at others such as UtaPri or Starry Sky the links betweeneach episode are either very very vague, or non-existent - of course we have things like Kiniro no Corda, but even then the plotline is still rather vague and only exists to facilitate the harem nature of the anime. At first, you think that 'oh this is just another otome game-based anime, it'll be the same as all the others' because you see how each episode looks at a different romantic interest... but that's not the case later on. After a bit it does change, and the characters are developed a lot more (which I will get on to). The ending was what really got to me, because I found myself crying at it! It really was a great ending, but so emotional, and the way I felt when this series ended is not something that happens often - I genuinely felt kinda depressed that it was over, because I had enjoyed it that much.\\n\\n\r\nI actually kinda want to talk about the ending but I'll try my best not to put in any major spoilers:\\n\\n\r\nTo be honest I really did not see the ending coming, due to the way they had sort of focused on each of the characters at some point, I thought that the issue leading to the climax had been done with, but I was wrong. And that is something I actually liked, because it managed to catch me off guard and create one of the most epic battle scenes; it makes you feel so excited and emotional at the same time, it's brilliant.\\n\\n\r\nNow moving on to characters. Usually these characters in this genre of anime are just your average stock characters - usually defined by hair colour. However although this may be the case at some times, it's not the case overall. Yes, each character's personality may be based on that of a stock character one finds in reverse harems, however they also have a lot more depth to them.\\n\\n\r\nI'll explain what I mean with a couple of examples [there may be some very minor spoilers here, sorry!]\\n\\n\r\nFirstly, we have Apollon. He's the Greek god of the sun: up beat, always happy, energetic type of character (think Ittoki Otoya or Hihara Kazuki - that type). But in actual fact, despite his overly cheery exterior, Apollon has his own issues and pain to deal with. When we finally see what has been weighing Apollon down, we are able to appreciate the fact that he isn't just your average overenthusiastic student council president; he uses this exterior to cover up and bury his true feelings and the ghosts of his past. In a way it does relate to a lot of people, people who try hard not to show how they feel because they don't want to worry others, or because they want to trick themselves into thinking they're okay. The fact that Apollon's character was one which explored these emotions is something that really did get me even further hooked on to this anime.\\n\\n\r\nSecondly, let's take a look at Balder, because he is the other character I can look at in a lot of detail [of course I can talk about the others but that would take too long]. Balder is the Nordic god of light, and he has this ‘curse’ on him which draws people to him and keeps any kind of harm (including rain) away. At first, he seems to be the calm, kind, level-headed one... but then we find out that there is more to him than that - I won't say any more about that because I don't want to ruin the suspense when you watch it. I think his character just goes to show how no matter how nice people can seem on the surface and no matter how hard they try to brush off everything that bothers them, it all just piles up inside until you reach that limit. It just kind of goes to show how although you can keep trying to fake a smile, eventually if you keep it all bottled up you will end up doing things you regret.\\n\\n\r\nNow, as well the story and the characters [which are the most important things to judge an anime by] the animation was really good, all the characters looked great - and yes, by that I do mean the males, despite being animated, were rather attractive - and the music was really good too.\\n\\n\r\nOverall, I have to say this is the best reverse harem I have seen to date - and even if reverse harem isn't your thing, I recommend KamiAso just because of how good the story and character development is.",
            "date": "2014-06-30T15:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 149659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2856923.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/despairdaze",
                "username": "despairdaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=149659"
        },
        {
            "content": "This anime, of course, is a reverse harem. But I think that they whole gods, plot twist really helps keep the audience fairly interested. I also like the fact that the Gods in the anime are not just Japanese, but also from many ancient cultures including Egyptian and Greek. \r\nThe comedy is definitely there and you are always guessing what's going to happen next because this isn't like any other Reverse Harem you have ever seen!\r\nMy only real complaint for this anime was the ending, I felt like it ended kind of abruptly and fast and I had to re-watch to make sure I wasn'tmissing an important piece. \\n\\n\r\nThe heroine, Yuki-chan, could have used a little more development to show us why she was picked to help the Gods, but she wasn't completely bland like other reverse harem Heroines. And with her, you are almost rooting for her to win so that she can go home! \\n\\n\r\nAll in all this show wasn't half bad! And if you particularly like reverse harems, especially those with extremely attractive God-boys then this anime is the one for you!",
            "date": "2015-07-18T11:36:00+00:00",
            "helpful_count": 2,
            "mal_id": 193744,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4752343.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DontCallMeKeke",
                "username": "DontCallMeKeke"
            },
            "url": "https://myanimelist.net/reviews.php?id=193744"
        },
        {
            "content": "the story was average i mean its been done before. \r\nthe art in this was really amazing e_e i liked the style of how this was made.\r\ni didnt care much for the music but i didnt dislike it. \r\ni liked how characters actually developed a little. \r\nin this anime we didnt get the whole backstory but small little bits are good enough since there are a lot of characters. \r\nit was a really slow anime and some episodes were fillers. actually alot were fillers but when it came down to the end of the show it all wrapped up pretty good which is why itwas worth the wait c: the way this anime ended was pretty good and no cliff hangers.",
            "date": "2014-11-14T22:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 168645,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4254795.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lazyneko",
                "username": "lazyneko"
            },
            "url": "https://myanimelist.net/reviews.php?id=168645"
        },
        {
            "content": "This relatively short anime is certainly a good one. Its set up is very similar and at the same time like no other reverse harem anime. \r\nGeneric characters but very lovable, i find my self attached to them, they are the typical personalities (the energetic one, the gloomy one, the mean one, the cool one and so forth.) but like i said at the same time one of a kind. \r\nIt is not a love story, its alot like Uta no prince sama, (set up wise) the story line is very unique and enjoyable\r\nSome of the events and many scenes seem kind of unnecessary butat the very least don't fail to entertain\\n\r\noverall i highly recommend this anime",
            "date": "2014-11-30T22:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 170621,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1396285.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/bumcakee",
                "username": "bumcakee"
            },
            "url": "https://myanimelist.net/reviews.php?id=170621"
        },
        {
            "content": "So before I get into writing this, I did read the manga beforehand. The anime and manga are totally different. I enjoyed this much more than the manga!\r\nSo now\r\nStory: 9\r\nIt wasn't a 10 only because I felt like there could have been more expansion on different stories of the characters. However, unlike the manga, the sword the Yui had was actually essential in this plot. I enjoyed that it was included and I enjoyed that there was a real purpose in the end. I felt that if this was a longer series, then the story would have definitely met a 10! I loved how itstarted and I loved how it ended. I loved how Yui was so essential in everyone's life and to moving the story along to the main part. \\n\\n\r\nArt & Sound: 10\\n\r\nNothing I can say besides the art was just great. Even the music that was played for different scenes were fantastic. \\n\\n\r\nCharacters: 9\\n\r\nI loved all the characters. Again, I just felt like it should have been longer truly grasp the different character stories. They didn't really have a story for Anubis (?), but that was like in the manga too. However, all the characters have their own little quirks and it was enjoyable to watch them progress through. Especially Balder, Loki, and Thor. \\n\\n\r\nEnjoyment & Overall: 10!\\n\r\nThis was so much better than the manga. I wanted to keep watching the series, but alas homework got in the way. However, it was funny and intense and overall it was just a fantastic anime. I loved the ending so much, I was crying!! \\n\\n\r\nI'm hoping that there would be a second season. But I doubt it haha. It was really great, and I loved it so much.",
            "date": "2016-03-21T21:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 213581,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1754169.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/nenestar",
                "username": "nenestar"
            },
            "url": "https://myanimelist.net/reviews.php?id=213581"
        },
        {
            "content": "Kamigami no Asobi takes the standard \"female protagonist suddenly transported into a different world/universe\" plot and does something interesting with it: Kusanagi Yui not only ends up on a floating garden in the sky, but she's surrounded by gods from various religions!\r\nKamiAso is, however, a reverse harem anime, and doesn't do much to hide that fact. Though I suppose it can't be helped; it was, after all, based on a visual novel (of the same name). The fanservice is therefore rampant and there are many half-naked, beautiful men vying for our protag's attention. (And love?)\r\nI found it particularly interesting that they chose to use Balder'sstory as a main plot line. Those who are familiar with Norse mythology will know what I mean, considering that Loki is also a god featured in the anime.\\n\\n\r\nThat aside, the original plot is to have the gods learn about humans and \"graduate\" out of a school in that magic floating sky garden. Kind of dramatic and usual: graduate or spend eternity here. Which of course leads to about every god falling for our lovely Yui, who is actually quite well versed in Kendo and Iai. Not your usual helpless MC, to be sure. So it's got that going for it.\\n\\n\r\nBut the music and general mood set by said music was sometimes a little off-putting. I'm not a very big fan of KamiAso's soundtrack, though I'm sure you could find many people who would say otherwise.\\n\\n\r\nThe art was also fairly beautiful; they certainly put in a valiant effort in making the gods as beautiful as they can be. Even Zeus, portrayed as a man I assume to be middle-aged, looks stunning.\\n\\n\r\nWhen it comes down to it, if you like reverse harems, moderately strong female leads and half-naked men, Kamigami no Asobi would probably suit you just fine. (Bonus points if you've played the game, though you may be dissatisfied with the ending.) If you're otherwise turned off by (massive) amounts of fanservice and harem anime in general, I suggest you carefully move away from this one.",
            "date": "2014-07-06T08:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 150677,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/402925.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/hitanyan",
                "username": "hitanyan"
            },
            "url": "https://myanimelist.net/reviews.php?id=150677"
        },
        {
            "content": "No no no I refuse to accept this!! TT_TT Kusanagi at the end looked like a mother who lost her chicks in the ending, but well I guess thank goodness that didn't happen...\r\nBUT STILL THIS IS NOT FAIR I DEMAND A SEASON 2! Or an OVA at least.... It's been a long while since I have enjoyed a reverse harem anime this much towards the point where I wish they had made the series a bit longer.\r\nThank goodness for that sappy happy ending. If it had ended with Yui never meeting them again I would have legit felt really bad for her. Can't believe thisepisode almost made me tear up a bit there..........don't know what's wrong with me ;-;\\n\\n\r\nI have to say this anime gave me new found hope in the reverse harem genre by giving us one of the most dependable and most importantly competent female leads to exist in the field. Yui actively breaks the shells of all the guys making them all fall for her which is how it should always be imo. After watching Amnesia and Diabolic lovers I had almost ragequitted the genre. But I'm so glad this anime shows that it's possible to portray a female lead who isn't incredibly submissive and only gets pushed around by the guys. It totally can lead to a much more enjoyable show :).\\n\\n\\n",
            "date": "2014-06-26T19:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 148855,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1525175.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jacksonsam",
                "username": "jacksonsam"
            },
            "url": "https://myanimelist.net/reviews.php?id=148855"
        },
        {
            "content": "'Nother late night review after finishing an anime in a day. Nothing like it.\r\nYOSH! Let's get started\r\nThe story is incredible. Probably one of my favourite anime's in my list (and that's saying... a decent amount.)\r\nBeing a lover of all things mythological, I came into this with mixed feelings. Generally, with any story involving myths, things tend to get twisted up. This being a semi-harem/romance anime, you can expect them to as well. I was incredibly surprised when I watched this and not only was the mythology nearly SPOT ON, but the way they tied it into the story was quite a miraculous feat. I leftit with a great, happy feeling and I'm hoping they create a second season for it (it's that good). \\n\\n\r\nBeing a recent anime (2014 made I believe) the art was fantastic as well. The God's transformations into their true form was miraculous each time it occurred, and the effects in the fight scenes were not lacking either.\\n\\n\r\nThe characters are GODS! What's not to like? And not just self-righteous, douchey gods either. They're rather innocent and are greatly affected by their various roles and their past. You find their back-stories (taken almost directly from mythology) to be spot on and make you really feel for the characters themselves. \\n\\n\r\nAll-in-all, it's a wonderful anime with an abundance of great characters, effects and a story-line that WORKS to boot. I encourage anyone who's thinking of watching this to do so. If you enjoy mythology as well, you won't be disappointed. \\n\\n\r\nOverall rating: 9/10",
            "date": "2014-07-26T02:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 153775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3812873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/OrangePulse",
                "username": "OrangePulse"
            },
            "url": "https://myanimelist.net/reviews.php?id=153775"
        },
        {
            "content": "As a fan of mythology, this anime was the mythology-inspired production which I most enjoyed. The crew found a good strategy to adapt the original game for the TV, knowing well how to use the essencial parts of the game to develop its story. \r\nI particularly loved the way the main gods seem to like Yui, since it is a reverse harem, and each of them has a single way to captivate the viewer - Hades interpretation, in terms of personality, was my favorite by the way!\r\nOverall, if you haven't played the game just like me - I only read a thing or two aboutit - you won't have so much trouble watching it and if you like Greek, Norse and/or Japanese mythology then you'll feel like you already knew what was supposed to happen to certain character! (The same goes if you enjoy Disney's Hercules or Marvel's Thor, but with lots of correlations instead.)",
            "date": "2016-04-24T20:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 217106,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5264017.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/annahthecompozer",
                "username": "annahthecompozer"
            },
            "url": "https://myanimelist.net/reviews.php?id=217106"
        },
        {
            "content": "I found this anime highly enjoyable, and looked forward to it every week. However, while it was still in early airing, (2 or 3 weeks), I decided to check out Broccoli's other anime - Uta no Prince Sama - to pass the time while I was waiting for more Kami episodes. Unfortunately, seeing as they are both produced by Broccoli, and I watched them at the same time, I find it impossible not to compare the two of them. And while I feel UtaPri has struck a winning formula and became one of my favourites, Kamigami has not.\r\nI still liked Kamigami. I found it amusingand endearing. But it didn't have me giggling and squealing in the way that you want a reverse harem to.\\n\\n\r\nSTORY - 6\\n\r\nThere's a certain factor about reverse harems - you can't have them feel forced. If the plot feels like all that's happened is that a massive amount of guys have been herded into a situation where they have to be around the girl all the time, things just become awkward. The very first episode of Kamigami has a paused still of every love interest with masses of sparkles and flowers all around them. It's as blatant as blatant can be that these are the characters we - the fangirls - are intended to project our affections onto. And the story is one girl being forced to teach these characters the meaning of human love - or else Earth and every other world will be destroyed. I don't know about you, but I like to see my characters fall in love naturally, gradually - it feels more fulfilling that way. But in Kamigami, it happens almost instantaneously. No shipping, no eager will-they-won't-they feeling. Just. Bam. Pretty much from episode 1. And the ending sequence just makes me feel so awkward, too. All the characters lying half naked on beds. If that isn't a blatant attempt to make the fangirls drool, nothing is.\\n\\n\r\nART - 8\\n\r\nThe character design is certainly very good. Broccoli has a way with that. The other studios trying to create reverse harems should take a page out of their book when doing character design. It really is a vital factor in these types of shows :P The costumes and magic transformations are pretty cool too.\\n\\n\r\nSOUND - 9\\n\r\nGood old elements garden! They shall never fail us! They wrote scores of amazing, catchy songs for UtaPri, and they take the OP, ED and character songs of Kamigami in their stride. I love hearing voice actors sing, and they are all very good at it.\\n\\n\r\nCHARACTER - 7\\n\r\nI'm the nerdy kind of girl that has actually chosen to study classical mythology and Ancient Greek in school. And so I couldn't help but cringe a couple times at the butchered backstory lore of the characters. Especially Apollon and Cassandra. Kusanagi was strong as a lead, and that's a bonus - but despite all of Broccoli's attempts, I didn't find myself a waifu from the cast. Balder was too batshit crazy, Loki looked like Grell Sutcliff, and although I liked Hades and Apollon, I just couldn't get excited about them.\\n\\n\r\nENJOYMENT - 8\\n\r\nThis anime is a very fun one to watch. It made me laugh frequently, and it had fanservice aplenty. I always love seeing magical spells and battles, and this had quite a lot of that. There were lots of little gags and light hearted humour, and I was never bored with it. Always looked forward to it every week.\\n\\n\r\nOVERALL - 7\\n\r\nA fun little reverse harem that is well worth your time to watch, but if you've seen Utapri, you might well end up being a little disappointed. Don't expect anything serious, and just have fun, because Kamigami is lots and lots of fun!",
            "date": "2014-06-28T10:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 149107,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3652585.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/RedReaper",
                "username": "RedReaper"
            },
            "url": "https://myanimelist.net/reviews.php?id=149107"
        },
        {
            "content": "As someone who really likes reverse harem animes, this anime didn't dissapoint me! Even when I had pretty high expectations of this anime.\r\nStory 9/10\r\nWhen Yui sees a sword shining in a storage room, she falls asleep and wakes up in a total different place. There she is told by Zeus that she has to teach the other gods in the garden about humans. In the end, they have to graduate, otherwise, they will never be able to leave the place. As the story progresses, you will see more of the peronallity's and their story's. That's actually what the anime is about.  \r\nArt 9/10\r\nThe artwas well done, I liked the way the characters and the surroundings were made.\\n\\n\r\nSound 9/10\\n\r\nThe sound was good, it fitted the moments, I liked the opening as well as the ending, they were booth good.\\n\\n\r\nCharacter 9/10\\n\r\nWell, let me see, let's start with Yui:\\n\r\nYui has a pretty bright personnality, she isn't clumsy but straight-forward and knows what to do at the right moments. As a main character, I thought she was good. What I sometimes thought was that at some moments she could be a little bit more, well, sad, or something like that. I wanted her to react a bit mor intesive, but she did that at some parts so I could live with it. Overall, she is positive-minded and I think that's good.\\n\\n\r\nToo many guys, here's a short explanation:\\n\r\nApollon is the god of the sun, he is very cheerful, and sometimes has some stupid ideas.\\n\r\nHades is the god of the underworld, he has a pretty dark personallity, doesn't talk very much and is always afraid of bringing people misery.\\n\r\nBalder is the god of light, he always has lots of people around him, he trips a lot, actually.\\n\r\nLoki, is the god of fire, he is a bit misterious and actually doesn't really like Yui.\\n\r\nTsukito, the god of the moon, he doesn't really talk much, and makes a lot of notes during class.\\n\r\nTakeru is the god of the sea, he is short tempered and likes swordmanship.\\n\r\nDionysus, the god of wine, he's not really a main character but he's a bit lazy at times but helpes out if needed.\\n\r\nThor is the god of thunder, he also isn't really a main character, but he's always around Loki and is pretty silent.\\n\\n\r\nAs my personal opinion: I liked Takeru, Apollon and Loki the most, I think :)\\n\\n\r\nEnjoyment 9/10\\n\r\nI actually really enjoyed this anime, it was really good and I got addicted after watching the first episode. It was funny and sad at some times too. I liked the way they showed some personal story's and the way the story developed at the end. \\n\\n\r\nOverall 9/10\\n\r\nAs you can see, I gave all the catagories a 9/10. It shows that  I really liked this anime. I really wished it could have been a bit longer, so the story could be a little bit deeper. It had his depht, not to say it didn't. Some parts actually made me cry pretty much. Because of the guys being gods, it has a supernatural element. There's also a bit of romance. Just give Kamigami no Asobi a shot, it's really worth watching!\\n",
            "date": "2014-06-23T11:02:00+00:00",
            "helpful_count": 0,
            "mal_id": 148227,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3440085.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/SweetSerenadexX",
                "username": "SweetSerenadexX"
            },
            "url": "https://myanimelist.net/reviews.php?id=148227"
        },
        {
            "content": "Six gorgeous male gods from different mythologies... What's there not to like? This anime was very aesthetically pleasing. The males are hunky in their school uniforms, but even yummier in God-form. There's also a beach episode where we get to see their perfectly sculpted bodies - all gratuitous, but who's going to complain?\r\nUnlike most reverse harems, the female protagonist is not a complete pushover with no will or personality. Even though she doesn't add much to the story, she at least does not detract from it. For starters, she doesn't whine or cry. (She cries maybe just once, but the situation warranted it.) \r\nThere waseven a story in this anime! It's not the most epic story (keep in mind it's a 12-episode show), but it's still a legit story that was enjoyable. Also, we do get to understand each of the gods, some more than others, but there was an attempt to give them some depth beyond their good looks. However, in all honesty, they still are mostly one-dimensional, but that has to be expected from such a short anime with six male leads. \\n\\n\r\nTake away: Easy, light-hearted anime with good-looking male leads.",
            "date": "2017-03-31T13:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 244158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6141997.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/citycat",
                "username": "citycat"
            },
            "url": "https://myanimelist.net/reviews.php?id=244158"
        }
    ]
]