[
    [
        {
            "content": "They protec, they attac, but most importantly, they're back!\r\nI'm glad this anime has come back with all the characters we know and love. The artstyle is still great, and the music is good- I personnally like the fact that they chose to go back to the first main theme instead of the 2014 version.  It might still be too early to really have an opinion on the story itself, but since it's the final series I'm sure there's going to be a lot of epic fights and possibly good plot twists too.  I have great hope for this anime.",
            "date": "2018-11-04T14:37:00+00:00",
            "helpful_count": 197,
            "mal_id": 293363,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3176143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/cirdec321",
                "username": "cirdec321"
            },
            "url": "https://myanimelist.net/reviews.php?id=293363"
        },
        {
            "content": "Ahhhhh, Friendship and Magic has finally returned with its 3rd season. No, it's not My Little Pony I am talking about, but Fairy Tail. This time around our main characters, Rarity and Appleja... oh sorry, I mean Natsu and Gray are hanging out with their little club and every goddamn villain they fight against, joins their ranks because that's the way Fairy Tail's heart beats. It's friendship time!\r\nStory:\r\nAnnoyed by very superficial, core level flaws that are practically self-explanatory? Too bad. How Fairy Tail works is completely different from the norms as it abandons every fuck it could ever give about avoiding such things. Instead, thestory entirely focuses on doing whatever it wants with the best sides it has [No matter how \"bad\" its best is]. Let's face it, the more there is content, the more room there is for all sorts of different issues, common tropes, general cliches, character flaws, logical errors that in generally, are hidden in the details in purpose of fooling the viewer into thinking that \"this shit is actually good\". Fairy Tail does not lie, it does't try to hide its flaws anywhere. What we have at hand is perhaps the single most 'Be Yourself' anime I have had the pleasure of watching, and for that reason, I really like it. \\n\\n\r\nOn a technical level, under every single general quality trait, upon analyzing, Fairy Tails achievements are miniscule, but what it does is go beyond the norms and for that reason, it is among the most intelligent anime series I have seen, but no, not in its content -- I would never claim such a thing -- but in its making. It doesn't care. And I don't want care either, and for that reason, it is the ideal show for me. Simple? Well, it really is not! For example: Let's imagine for a second that this thing actually has a plot. In that case, the series would very likely be much, much worse than it currently is because the author is really horrible at writing anything (except zero arc which was pretty damn good actually). The best decision he has ever made, was create this series without it having a plot. Intelligence.\\n\\n\r\nThe other amazing factor here is the fact that Fairy Tail cannot do anything that makes the story worse than it already is. Watching this series for that reason is a real blessing. No! I am not joking the least, and do not think for a second that is an insult because it is actually the biggest praise I can give. For example, when I watched some highly appreciated series -- which I will not mention by names, you can find them on any top 20 anime list on the interweb basically -- many of them contained this one cliche which I absolutely hate. Whenever a character is about to die, another character/nakama  quite literally teleports there and saves the other character from certain death in the very last second. It's so f****** annoying that it kills all the believability for myself in works that were otherwise good. When Fairy Tail does this exact same thing, it is not even a flaw but a pure feature/attribute that the viewer already expects of it. For that reason, Fairy Tail does what so many other shows can only dream of: It never disappoints. It simply can't. And that's precisely why the story is such a major success. This is one of the very few series which I can watch without asking any questions because I wholeheartedly acknowledge that there are no answers. It may be childish and problematic, but damn if the series doesn't know what it is. What I would in other cases call \"an absolute horseshit of a writing\", In Fairy Tail's case, I casually laugh and say \"oh, that's just Fairy Tail being Fairy Tail.\" In one way, this entire series is Moon Moon the meme except it's an anime: this anime. I can't hate it, it's too special and precious. \\n\\n\r\nCharacters:\\n\\n\r\nLike scarce  amount of shonen series -- which I will not namedrop here -- Fairy Tail does what so many others are so afraid to do: Give us canon pairings already when the series is still ongoing. 2/3 of the big 3 were nothing but a tease, the last one purely uses girls in comedic fanservice. The biggest meme, by Bones, made romantic situations a damn running gag. Fairy Tail's characters are never disrespected in this manner nor any manner. In fact, they are loved so much and so deeply that even every single mildly interesting villain join Fairy Tail's side because letting go off them is not an option. And that's okay. I think that's great. It's one thing for the viewers to hate characters, but when authors choose any of the routes mentioned above, it doesn't become pretty to watch. I unironically respect the guy because I find the romances and the feeling side of Fairy Tail to be genuine and honest unlike in so many other shonen series where \"romances\" become nothing but disgusting and dishonest comedic banter just so viewers would keep their interest and follow the characters like their unconfirmed shipping relations are some sort of ongoing cliffhanger that keeps them watching the damn thing. It's so fake and purely exist to fool the viewers to a point where the fans try to convince themselves that given pairings would be some sort of \"fanservice\" while it's the opposite. Let's face it, Gajeel x Levy is the most \"canon\" canon-pairing ever written by man, and that's my biggest reason for thinking these characters are great.\\n\\n\r\nProduction:\\n\\n\r\nThe last season certainly had a worse start considering it had about as much animation as the manga. This season still has lots of still pictures going on and money is saved pretty much whenever it is possible. Fairy Tail's viewers are familiar with this so continuity exists at least. Personally I don't mind anymore as long as it never gets as bad as in the beginning of 2014. The seiyuu work is naturally identical as well, and the glorious OST is still there. The OP and ED are bit weird choices. \\n\\n\r\nEnjoyment:\\n\\n\r\nFairy Tail is a flawed work, but none of its flaws are something the viewer is supposed to forgive like is the case with so many  supposedly \"smart\" and \"good\" anime series. Fairy Tail doesn't give a damn, and that's exactly why it is so enjoyable and entertaining series to watch. I do NOT think \"Fairy Tail is so bad that it is good\", I think Fairy Tail is completely off the scale because Fairy Tail is not a good series in the most common definition of the word. It's its own thing and stays loyal to it, which may not me enough for everyone. However, I am willing to take this series with its problems and weaknesses and by doing so, I have seen how entertainment, in its purest form, is born.\\n\\n\r\nps, I saw season 2 actually twice and upon my study, I discovered that Mira Strauss is the best girl",
            "date": "2018-12-08T14:33:00+00:00",
            "helpful_count": 77,
            "mal_id": 295458,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=295458"
        },
        {
            "content": "Well, they're back... yessh finally!\r\nIf you're planning to watch it, then do cauz this season  is gonna be the best of all the seasons. All the mysteries and dark secrets of FairyTail will finally be revealed.\r\nAnd well *coughs* with a bit of fanservice..\r\nThe series starts with Erza saying this might be the last dawn they get to see..\r\nwill this be true? or not? THE FINAL SEASON OF FAIRYTAIL IS FINALLY HERE.\r\nalthough, the war arc won't be as great as The Great Ninja War Arc of Naruto, but it will still keep us at the edge of our seats.\r\nThe only thing you may see missingin this anime is the casualty rate.. again no spoilers :3",
            "date": "2018-11-12T19:57:00+00:00",
            "helpful_count": 33,
            "mal_id": 293956,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6286159.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Blu0",
                "username": "Blu0"
            },
            "url": "https://myanimelist.net/reviews.php?id=293956"
        },
        {
            "content": "Why am I here? I'm supposed to be finished with Fairy Tail, considering the fact that I already finished reading the manga... and just when I decided that I won't read the 1000 year quest sequel because I just want everything to be over.... this appears...\r\nWhy am I back in hereeeeee?\r\n*sigh* Guess I'm just too invested in this series and just want to see it all the way through the end, huh? (Even though I already KNOW *sobs*)\r\nAnyways, Fairy Tail is back in brute force! (literally, the opening scene was basically Natsu burning up a poor animal and screaming out 'food'!!). As a person whohas already completed the manga, I just want to see everything to be adapted nicely in a gorgeous wrap... and enjoy the final ride into the finale.\\n\\n\r\nSo far, it captures the charm that the series have. It is what draws people in this show, after all.\\n\\n\r\nBut the starting premise sure is interesting if you are only an anime-viewer-only peep, as it starts in a quest where you gather all fairy tail members after a year that they have disbanded... so that they could rebuild the whole family again.\\n\\n\\n\r\nSo yeah, I'm watching this because I just can't help it.\\n\\n\\n\r\n8/10",
            "date": "2018-11-09T17:11:00+00:00",
            "helpful_count": 28,
            "mal_id": 293709,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2525105.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mira071198",
                "username": "Mira071198"
            },
            "url": "https://myanimelist.net/reviews.php?id=293709"
        },
        {
            "content": "I guess the best way to review this anime would be to take you guys through my personal experience. I started watching the fairy tail anime back in 2013 when I was still 13 years old. I binge watched the first part, then I watched the second part as it came out and then now I started watching the finale. However, since I watched this anime the first time, I have become an active member of the anime community and I have watched lots and lots of different animes, and now, this anime just keeps becoming worse and worse in my opinion.\r\nStory - 6/10\r\nThe storyis the only slightly attractive feature of this anime. The story is fluent and there are very few plotholes. The backstories of characters actually make sense and the connection between individual arcs is good. The stories have enough emotions tied to them.\\n\r\nHowever, even though the story is the most attractive part of the anime, it doesn't compare to other famous animes. The story is filled with plot armor and nonsensical power-ups. For example, this series takes place a year after the last arc and in this one year, all the characters got incredibly strong and smart. We don't get to see how they trained or how they gained their powers. We just know that they became very strong in one year. \\n\r\nThe most appalling part, however, is the random power-ups in an on-going fight/match. The main character fights the underlings of the main boss and gets bet up very easily. Then, all of a sudden they get a flashback or a shout-out from a random friend and then they one-punch-knockout their opponents. Not only this but somehow, they restore their health completely and then fight the main boss only to be taken down instantly. There is some random show-off the main boss's power and then again, the main characters get some random power and one-punch-knockout the main boss regardless of how powerful the main boss is. \\n\\n\r\nArt - 5/10\\n\r\nThis is not an anime. This is just a colored manga with hints of hentai in it. One of the main female characters gets nude every time she transforms and another one apparently likes to seduce men. Like, literally, even her wiki fandom page says she likes to seduce men (lucy heartfilia). The only purpose of those two characters is to attract attention from hormone filled men who want to vent their stress. Their bewbs are the only attractive part of the 'art' of this anime. \\n\r\nThe fighting scenes, as I mentioned earlier. are like a colored manga. It is a set of still shots (with obviously* unnecessary random bewb involvement) and the same tricks been used again and again. An anime like mob psycho 100 which is based on a webcomic drawn by an unprofessional, has far better-animated fights than this anime.\\n\\n\r\nSound - 3/10\\n\r\nThe music is catchy, but they don't use it wisely in this anime. It is repeatitive and gets annoying if you watch the anime long enough. They have to literally play the music all the time.\\n\\n\r\nCharacter - 3/10\\n\r\nRandom power-ups, no character development, character whose only compelling feature is their bust, random flashbacks. unnecessary crying and most importantly over-display of 'friendship'. The whole anime revolves around 'friendship'. Each time you see a power-up, you will see the term 'friendship' being used in the vicinity. \\n\r\nBefore someone bashes out on me for saying 'no character development, let me tell you what character development means. It means that there are some changes in your character due to some incidents. These changes are mostly positive changes and are supposed to make them more mature.    I guess the only display of character development is when Natsu learns to give up after fighting glidarts. (That's actually what made me give this factor a score of 3, instead 2)\\n\\n\r\nEnjoyment - 3/10\\n\r\nAs a teen, my pubescent hormone kept me attracted to this anime, but now that i don't feel the same attraction as before, I don't really find the point of watching this anime. I can watch other animes which are wayy better than this anime. You can just read the manga and enjoy the story rather than wasting time on this anime.\\n\\n\\n\\n",
            "date": "2019-03-02T19:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 302778,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6732167.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Aaron_Salve",
                "username": "Aaron_Salve"
            },
            "url": "https://myanimelist.net/reviews.php?id=302778"
        },
        {
            "content": "From all the reviews I've seen, it seems that many people regard Fairy Tail as a great show, but I can't understand why. There are so many problems with this show, and I cannot understand how people do not see them. I'm not really reviewing this specific season, but the anime as a whole. This series actually had some potential, but Hiro Mashima and A-1 threw all of it into the trash. \r\nThe writing is the first thing I want to address about this show. It is fucking stale. Out of the 300 episodes I have seen I swear that each arc except two containsthe exact same formula. For those who do not understand, each arc literally just consists of a new conflict and foe arising and the main characters defeating them. It goes through the same cycle over and over. The protagonists struggle a bit against the opponent and then thanks to the power of friendship, they are able to defeat them. I am not joking when I say most of the arcs just consists of this; this is an accurate description of them. There are only two arcs of this series which I actually liked thanks to the outcomes being different. I also want to mention that pacing is not very good, and arcs drag out way too long.\\n\\n\r\nI am not really a music person, but in my opinion, sound is decent in this show. The music is good, but the problem is that it gets overplayed way too often. There isn't much variety, and I feel like I hear the same songs over and over. Voice acting is not that bad in Fairy Tail either.\\n\\n\r\nFor people who do not realize, art and animation are two different things. The art in this show honestly isn't that bad. I don't remember there being many moments where facial expressions or bodies looked in an awkward way. Despite that, animation in this show is fucking awful. For being an action-based show, you would expect fights to be well animated, but it is the complete opposite. All of the fights consists of still frames and little animation. It is basically a colorized manga. I realize that this is not a seasonal show, but I wish that they would put even some effort into the important fights.\\n\\n\r\nCharacters in this show are extremely average. The problem to me is just that there are way too many. I came into season three not remembering half of the characters' names. I also just hate how fucking stupid the people in this show are. Any moment where there is suppose to be emotional and sympathetic value is ruined by fan-service put in every frame or an unfunny and forced joke. The majority of females looks exactly the same in this show; exact same facial expression and giant breasts. It really pisses me off as well that pretty much no characters have died either. Oh what's that, it looks like a character is about to die. No fuck that I'm gonna be saved by some bullshit reason. It causes the show to have no sense of risk or danger because you know that the main characters are never going to die. Character development is somewhat nonexistent in this show as well. Most characters have remained the same throughout the entirety of the three seasons.\\n\\n\r\nOverall, Fairy Tail is a very mediocre anime. Black Clover may honestly be better than this shit. It is a show that would best be watched as background noise. I really wish that I could make myself drop this show, but I'd prefer to stick to my policy of not dropping shows. For anyone who is considering to watch, I suggest you don't. Don't make the same mistake as me.",
            "date": "2019-03-31T22:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 305108,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5614278.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/kento2",
                "username": "kento2"
            },
            "url": "https://myanimelist.net/reviews.php?id=305108"
        },
        {
            "content": "Im glad the anime is going well .... but the director HIRO MASHIMA  has said that the anime could recieve a new series or a spin off but it would take a long time ....\r\nFor more details read the last chapter of fairy tail .. in that the director has told what will he will be doing with the anime next \r\nHere is the link: https://mangarock.com/manga/mrs-serie-69934/chapter/mrs-chapter-100053236\r\nTill now its only known that the MR. HIRO MASHIMA has released a new manga by the name of eden zero \r\nHope you find it helpful ...................\r\nThank You !!!!!!!\r\nIf you find this helpful ... pls give a like",
            "date": "2019-01-18T01:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 299337,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7514287.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/whitefang1204",
                "username": "whitefang1204"
            },
            "url": "https://myanimelist.net/reviews.php?id=299337"
        },
        {
            "content": "A WORD OF WARNING!!!! I hereby bestow upon this anime the name of \"GIF's, The Animation!\"\r\nI'm so annoyed with this that this is literally the first review I've ever done. Maybe the first of many, I don't know.\r\nThe animation for this season is AWFUL! I'm writing this review to rant as well as point this out because I don't see anyone else talking about how lazy, ugly, & absolutely pathetic the quality of the animation for this show has become.\r\nThis is literally like watching a colored picture book with shaking backgrounds. Hell I'm nicknaming this \"GIF's The Animation.\" Every fight scene consists of still cutoutsof the character in question, then they animate the hair for 3 frames in repetition, add some screen shaking, movement lines, and wallah! That's your fight scene! What the heck is this!?\\n\\n\r\nOn second thought, calling this show \"GIF's The animation\" is an insult to GIF's because I've seen GIF's with better animation than this.\\n\\n\r\nWhat the hell am I even watching this for when I read the manga? I thought this was supposed to be an anime! You know, with ANIMATION! Not a glorified coloring book!\\n\\n\r\nI actually went back to season 1 to check out the fight scenes there because I don't remember it being this bad and guess what. They're not! Season 1's fight scenes are actually animated! Granted there are a lot of the same lazy still frames, but they animate when it counts! Their punches and kicks have \"Movement!\" But this show, just when you think there's going to be a big fight, when they introduce a new character into a major fight to change the outcome.... nothing but still frames.\\n\\n\r\nThis is a new low, a new level of how to not even try, a new level of lazy, a new tier of cutting corners. All the fights are GIF's! They're not even bothering to animate punching. The most basic of all fight moves!!!\\n\r\nThey've actually masked this laziness with CG Special effects for their magic! So at least it \"looks cool\" right?\\n\\n\r\nThis is just a review on the animation aspect of this show. Waste your time at your own will. This is my warning. If you've read this, you may as well just read the manga, because this anime, is not really an animation. \\n\\n\\n\r\nEdit: I've decided to summarize everything else.\\n\\n\r\nStory: 6/10\\n\r\nIt deviates from the manga a bit as expected, but major plot points still in line. Watchers can still easily follow the story. They did add extra layers of plot armor.\\n\\n\r\nCharacters: Meh 6/10\\n\r\nNot much to say. They haven't changed much. Just new abilities that have deus ex machina'd their way into the show. Everyone still has plot armor so there's really no suspense at any point whatsoever. \\n\\n\r\nArt: 1/10\\n\r\nWe talked about this.\\n\\n\r\nSound: 8/10\\n\r\nWell thank god there's at least audio. I'm no sound expert so, wish I could be more critical.\\n\\n\r\nOverall: 5/10\\n\r\nI'm being very generous with this because I've seen worst shows. At least there's plot.",
            "date": "2019-04-29T23:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 307423,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1438101.jpg",
                "scores": {
                    "animation": 1,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/StormofBladeZ",
                "username": "StormofBladeZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=307423"
        },
        {
            "content": "*THE FINALE IS HERE*\r\nyep...its the ending of this beautiful series that most people spent their childhood watching it and screamed over it lol :D\r\ni started watching fairy tail last summer and i got to this series recently...a month ago or so :D\r\nthis last one is getting better and better each episode and i'm enjoying it so much :D\r\nstory 9/10:this series has the most perfect stories from the 2009 and 2014 ones...we are in the end game of natsu vs zeref story here so i'm enjoying it so much :D \r\nthe final series is about bringing the fairy tail guild back together and saving its ownmaster by the 4  very most popular MCs :D\\n\r\ni sure hope that we get some good closure here for them *spoiler*which i heard we won't sadly...i wanted a erza x jellal wedding here :(\\n\\n\r\nart 8/10:fairy tail art is very good indeed but not perfect..it has a decent art for a long running shounen :D\\n\\n\r\nsound 9/10:i always loved fairy tail's songs tbh...2014 series songs were perfect...this series also have good ops and eds so far :D\\n\\n\r\ncharacter 9/10:we will see some major developments for the characters here...specially natsu and gray...they are now more mature and responsible...they think better and act better :D\\n\\n\r\nenjoyment 9/10:i'm enjoying this last series so much....i wait for each episode every week which is rare for me to do and every episode has its moments to fulfill my expectations :D\\n\\n\r\noverall 9/10:so i consider this series the best among fairy tail series...if you are a fan and you love shounen be my guest....enjoy watching the show :D\\n\\n",
            "date": "2019-02-08T14:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 301186,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7245057.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sepid_96",
                "username": "sepid_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=301186"
        },
        {
            "content": "This season, especially the Alvarez arc, is much better than the others in terms of character motivations (particularly that of Zeref), which the other arcs (like the Tenrou Island arc [Hades had no character-driven reason to seek out the Grand Magic World], lacked). \r\nIt does contain quite a lot of plot armor and deus ex machina moments (like Ultear showing up to save Wendy and Shelia out of nowhere and Natsu magically recovering from his coma) and crappy fight sequences (like ruining the tension of the fight for a stupid nudity joke in the Jacob fight).\r\nI would recommend this season to fans of the previousseasons. It's unlikely that newer fans will enjoy this season (or this show) since most of the humor used is in the same style as the shonen series of the 2000s (or, to put it in another way, overly reliant on slapstick and immature punchlines).\\n\\n\r\nOverall, this season does make some major improvements on the previous seasons and I think you should definitely give it a try if you enjoy shonen battle series.",
            "date": "2019-03-11T18:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 303338,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thickdickrick",
                "username": "thickdickrick"
            },
            "url": "https://myanimelist.net/reviews.php?id=303338"
        },
        {
            "content": "People have been talking shit about Fairy Tail ever since it was serialized and eventually turned into an anime in the late 2000s.  They called it a \"poor man's One Piece\" and not investing. While I do agree there were and remain too much plot armor and PLOT, the Final Series is definitely the highest peak of the entire show. It maintains the great music and character that was introduced in the first season, while also looking even more fantastic with better fightscenes than the already improved (artistically) Fairy Tail 2014. The Final Series contains the raw emotions of the main cast, as wellas Zeref and the Spriggan 12, and fixes numerous plot holes and answers questions fans have been waiting for since the show first started (if you haven't read the manga). Also Natsu and the rest of the cast are way more bad ass this time, as they trained for a year in order to prepare for this final showdown (not including the 100 years quest). This is the best way to end the series that has captivated us for years on end. The only reason it is not a 10/10 is because of the art. The art itself is the best the show has ever looked, however, fight scenes still are pretty static with not a lot of fluent animation (it will probably get better since the first third of the show was animated around the same time the second season was coming to an end, so the last episodes will be looking the best). To add to this, Sword Art Online: Alicitization, and other concurrent A-1 Pictures/Cloverworks animes look better than Fairy Tail, with movements, even though they are using the same animation and production teams. Besides this, Fairy Tail: Final Series is fantastic and  makes you fall in love with the characters again as they win battles, struggle , suffer losses and do everything they can to protect their family, their guild, Fairy Tail. I wish they turn the 100 Year Quest into an anime, but they most likely won't.",
            "date": "2019-02-23T15:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 302297,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MG48282283",
                "username": "MG48282283"
            },
            "url": "https://myanimelist.net/reviews.php?id=302297"
        },
        {
            "content": "Ah, the story of friendship. Through the power of friendship, you can accomplish anything!\r\nThat's what Fairy Tail is, the power of friendship and it's been the main theme through and through. \r\nStory: Honestly, I like seeing how they use the power of friendship and camaraderie to figure out how to beat almost anything. The power of nakama is the best thing to watch. However, if you have been watching from the beginning, it's nice to see why some characters are important to the storyline. \r\nArt: I mean, who doesn't like abs that are overdrawn and exaggerated on every male character? The more abs drawn onthe character, probably the stronger the character is. You love the oppai? Well, the bigger your oppais stronger your character is as well (but this does not apply to Wendy). Mashima knows what the fans want, and he serves it nicely on the silver platter called fan service. \\n\\n\r\nCharacters: We have seen all the characters develop from the beginning, and this includes others that are not in the guild, because what else can make Fairy Tail a stronger guild? The nakama power they have made with everyone they have met throughout the entire series. \\n\\n\r\nEnjoyment: I've been watching from the beginning, so yeah, I'm pretty attached to this series. \\n\\n\r\nOverall: Fairy Tail is exactly what it is, a fairy tale. A fairy tale is a make-believe story that normally has that fairy-tale ending. Fairy Tail might not be a groundbreaking anime, nor is it the anime with the best visuals, however, Fairy Tail lives up to its name as you explore the world of make-believe as you live in the world of what would be fun with dragons, magicians, and any type of magical creature you could think of. \\n\\n\\n",
            "date": "2019-04-28T06:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 307320,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1424267.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kalaniballer22",
                "username": "kalaniballer22"
            },
            "url": "https://myanimelist.net/reviews.php?id=307320"
        },
        {
            "content": "These are dark times for my anime fan self. Somehow I keep being disappointed in every recent anime. Sadly, Fairy Tail (2018) is a disappointment as well.\r\nLong story short: while the audio is still top notch, the visuals are the worst of the whole series and the story is far from good.\r\nSTORY\r\nI like Fairy Tail, I'm not ashamed to say it. Despite what people claim, it has great plots and great ideas (although it's often mixed with a lot of stupidity).\r\nThis Final Series adapts the last 3 arcs of the manga: Avatar, Caracolle Island and the Final Arc.\r\nWhile I do enjoy Avatar and the firsthalf of the final arc (which has a lot of revelations and intense moments), the rest is really... uninspired. It's full of clichés, it's rushed, it's dumb. Caracolle Island is hilarious, but the Final Arc is really not worth it overall (it seems to be usual in the anime industry...).\\n\\n\r\nFairy Tail never had a brillant story. But at least it was decent, sometimes even great. Tartaros Arc, for example, had intense battles with very nice characters, and that was more than enough to keep it entertaining.\\n\\n\r\nThe biggest positive point of this manga is its characters (at least when they are developed). Many of them have a very nice background. Zeref, in particular, is a great character, and one of my favourite vilains in recent animes.\\n\\n\r\nBut the new characters, introduced in the Final Arc, go from \"meh, nice background\" to \"utterly garbage worthless character\".\\n\\n\\n\r\nART\\n\r\nFairy Tail never had great graphics and animation. But the first anime at least had a very nice art style, which made it enjoyable to watch.\\n\r\nThe second series had better drawings, but the animation had gotten worse as it was less dynamic.\\n\r\nNow, the Final Series... actually started very well. It's not great, but the first episodes are actually nice to the eyes (especially the environments, which are great).\\n\r\nBut starting from the end of Avatar arc, the art suddenly goes down the hill. It's mostly still pictures badly drawn!\\n\\n\\n\r\nSOUND\\n\r\nGreat seiyuus, great OST (although it has too much remix of the previous OSTs imo).\\n\\n\\n\r\nCHARACTER\\n\r\nI love the characters of Fairy Tail. They're not the most original, and when they're not important to the current plot they're transparent, but despite that, they're fun to watch.\\n\r\nMy favourite is Wendy. She's the only character who had actual progression. She got stronger and stronger over the arcs, and in this Final Series she really shines as a powerful wizard.\\n\r\nThe other characters are... well, the same as usual. Some of them are real badass (Erza in particular), they're still great to watch in action.\\n\\n\r\nBut most of the new characters are shitty. The Avatar crew was just here to have their asses kicked, I get that but still, did they have to be so... forgettable?\\n\r\nMost of the new main vilains are garbage because they're beaten quickly and don't have a story.\\n\\n\\n\\n\r\nENJOYMENT\\n\r\nI'm really disappointed in this Final Series. I'm not surprised, but still, it's a waste of potential for me The first series of this anime is still the best for me. It's the only one that kept me entertained for hundreds of episodes. The second series disappointed me most of the time, but at least it kept me onboard until the end. This Final Series, however, I'm on the verge of dropping it.\\n\\n\r\nIf you watched the previous series and want to know the end, I really advise to read the manga instead. Sure you'll miss colors and music, but really, I enjoyed the manga version of these arcs way more than I do their anime version.",
            "date": "2019-04-14T09:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 306280,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7223606.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dante012",
                "username": "Dante012"
            },
            "url": "https://myanimelist.net/reviews.php?id=306280"
        }
    ],
    [
        {
            "content": "They protec, they attac, but most importantly, they're back!\r\nI'm glad this anime has come back with all the characters we know and love. The artstyle is still great, and the music is good- I personnally like the fact that they chose to go back to the first main theme instead of the 2014 version.  It might still be too early to really have an opinion on the story itself, but since it's the final series I'm sure there's going to be a lot of epic fights and possibly good plot twists too.  I have great hope for this anime.",
            "date": "2018-11-04T14:37:00+00:00",
            "helpful_count": 197,
            "mal_id": 293363,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3176143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/cirdec321",
                "username": "cirdec321"
            },
            "url": "https://myanimelist.net/reviews.php?id=293363"
        },
        {
            "content": "Ahhhhh, Friendship and Magic has finally returned with its 3rd season. No, it's not My Little Pony I am talking about, but Fairy Tail. This time around our main characters, Rarity and Appleja... oh sorry, I mean Natsu and Gray are hanging out with their little club and every goddamn villain they fight against, joins their ranks because that's the way Fairy Tail's heart beats. It's friendship time!\r\nStory:\r\nAnnoyed by very superficial, core level flaws that are practically self-explanatory? Too bad. How Fairy Tail works is completely different from the norms as it abandons every fuck it could ever give about avoiding such things. Instead, thestory entirely focuses on doing whatever it wants with the best sides it has [No matter how \"bad\" its best is]. Let's face it, the more there is content, the more room there is for all sorts of different issues, common tropes, general cliches, character flaws, logical errors that in generally, are hidden in the details in purpose of fooling the viewer into thinking that \"this shit is actually good\". Fairy Tail does not lie, it does't try to hide its flaws anywhere. What we have at hand is perhaps the single most 'Be Yourself' anime I have had the pleasure of watching, and for that reason, I really like it. \\n\\n\r\nOn a technical level, under every single general quality trait, upon analyzing, Fairy Tails achievements are miniscule, but what it does is go beyond the norms and for that reason, it is among the most intelligent anime series I have seen, but no, not in its content -- I would never claim such a thing -- but in its making. It doesn't care. And I don't want care either, and for that reason, it is the ideal show for me. Simple? Well, it really is not! For example: Let's imagine for a second that this thing actually has a plot. In that case, the series would very likely be much, much worse than it currently is because the author is really horrible at writing anything (except zero arc which was pretty damn good actually). The best decision he has ever made, was create this series without it having a plot. Intelligence.\\n\\n\r\nThe other amazing factor here is the fact that Fairy Tail cannot do anything that makes the story worse than it already is. Watching this series for that reason is a real blessing. No! I am not joking the least, and do not think for a second that is an insult because it is actually the biggest praise I can give. For example, when I watched some highly appreciated series -- which I will not mention by names, you can find them on any top 20 anime list on the interweb basically -- many of them contained this one cliche which I absolutely hate. Whenever a character is about to die, another character/nakama  quite literally teleports there and saves the other character from certain death in the very last second. It's so f****** annoying that it kills all the believability for myself in works that were otherwise good. When Fairy Tail does this exact same thing, it is not even a flaw but a pure feature/attribute that the viewer already expects of it. For that reason, Fairy Tail does what so many other shows can only dream of: It never disappoints. It simply can't. And that's precisely why the story is such a major success. This is one of the very few series which I can watch without asking any questions because I wholeheartedly acknowledge that there are no answers. It may be childish and problematic, but damn if the series doesn't know what it is. What I would in other cases call \"an absolute horseshit of a writing\", In Fairy Tail's case, I casually laugh and say \"oh, that's just Fairy Tail being Fairy Tail.\" In one way, this entire series is Moon Moon the meme except it's an anime: this anime. I can't hate it, it's too special and precious. \\n\\n\r\nCharacters:\\n\\n\r\nLike scarce  amount of shonen series -- which I will not namedrop here -- Fairy Tail does what so many others are so afraid to do: Give us canon pairings already when the series is still ongoing. 2/3 of the big 3 were nothing but a tease, the last one purely uses girls in comedic fanservice. The biggest meme, by Bones, made romantic situations a damn running gag. Fairy Tail's characters are never disrespected in this manner nor any manner. In fact, they are loved so much and so deeply that even every single mildly interesting villain join Fairy Tail's side because letting go off them is not an option. And that's okay. I think that's great. It's one thing for the viewers to hate characters, but when authors choose any of the routes mentioned above, it doesn't become pretty to watch. I unironically respect the guy because I find the romances and the feeling side of Fairy Tail to be genuine and honest unlike in so many other shonen series where \"romances\" become nothing but disgusting and dishonest comedic banter just so viewers would keep their interest and follow the characters like their unconfirmed shipping relations are some sort of ongoing cliffhanger that keeps them watching the damn thing. It's so fake and purely exist to fool the viewers to a point where the fans try to convince themselves that given pairings would be some sort of \"fanservice\" while it's the opposite. Let's face it, Gajeel x Levy is the most \"canon\" canon-pairing ever written by man, and that's my biggest reason for thinking these characters are great.\\n\\n\r\nProduction:\\n\\n\r\nThe last season certainly had a worse start considering it had about as much animation as the manga. This season still has lots of still pictures going on and money is saved pretty much whenever it is possible. Fairy Tail's viewers are familiar with this so continuity exists at least. Personally I don't mind anymore as long as it never gets as bad as in the beginning of 2014. The seiyuu work is naturally identical as well, and the glorious OST is still there. The OP and ED are bit weird choices. \\n\\n\r\nEnjoyment:\\n\\n\r\nFairy Tail is a flawed work, but none of its flaws are something the viewer is supposed to forgive like is the case with so many  supposedly \"smart\" and \"good\" anime series. Fairy Tail doesn't give a damn, and that's exactly why it is so enjoyable and entertaining series to watch. I do NOT think \"Fairy Tail is so bad that it is good\", I think Fairy Tail is completely off the scale because Fairy Tail is not a good series in the most common definition of the word. It's its own thing and stays loyal to it, which may not me enough for everyone. However, I am willing to take this series with its problems and weaknesses and by doing so, I have seen how entertainment, in its purest form, is born.\\n\\n\r\nps, I saw season 2 actually twice and upon my study, I discovered that Mira Strauss is the best girl",
            "date": "2018-12-08T14:33:00+00:00",
            "helpful_count": 77,
            "mal_id": 295458,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/483536.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Karhu",
                "username": "Karhu"
            },
            "url": "https://myanimelist.net/reviews.php?id=295458"
        },
        {
            "content": "Well, they're back... yessh finally!\r\nIf you're planning to watch it, then do cauz this season  is gonna be the best of all the seasons. All the mysteries and dark secrets of FairyTail will finally be revealed.\r\nAnd well *coughs* with a bit of fanservice..\r\nThe series starts with Erza saying this might be the last dawn they get to see..\r\nwill this be true? or not? THE FINAL SEASON OF FAIRYTAIL IS FINALLY HERE.\r\nalthough, the war arc won't be as great as The Great Ninja War Arc of Naruto, but it will still keep us at the edge of our seats.\r\nThe only thing you may see missingin this anime is the casualty rate.. again no spoilers :3",
            "date": "2018-11-12T19:57:00+00:00",
            "helpful_count": 33,
            "mal_id": 293956,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6286159.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Blu0",
                "username": "Blu0"
            },
            "url": "https://myanimelist.net/reviews.php?id=293956"
        },
        {
            "content": "Why am I here? I'm supposed to be finished with Fairy Tail, considering the fact that I already finished reading the manga... and just when I decided that I won't read the 1000 year quest sequel because I just want everything to be over.... this appears...\r\nWhy am I back in hereeeeee?\r\n*sigh* Guess I'm just too invested in this series and just want to see it all the way through the end, huh? (Even though I already KNOW *sobs*)\r\nAnyways, Fairy Tail is back in brute force! (literally, the opening scene was basically Natsu burning up a poor animal and screaming out 'food'!!). As a person whohas already completed the manga, I just want to see everything to be adapted nicely in a gorgeous wrap... and enjoy the final ride into the finale.\\n\\n\r\nSo far, it captures the charm that the series have. It is what draws people in this show, after all.\\n\\n\r\nBut the starting premise sure is interesting if you are only an anime-viewer-only peep, as it starts in a quest where you gather all fairy tail members after a year that they have disbanded... so that they could rebuild the whole family again.\\n\\n\\n\r\nSo yeah, I'm watching this because I just can't help it.\\n\\n\\n\r\n8/10",
            "date": "2018-11-09T17:11:00+00:00",
            "helpful_count": 28,
            "mal_id": 293709,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2525105.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Mira071198",
                "username": "Mira071198"
            },
            "url": "https://myanimelist.net/reviews.php?id=293709"
        },
        {
            "content": "I guess the best way to review this anime would be to take you guys through my personal experience. I started watching the fairy tail anime back in 2013 when I was still 13 years old. I binge watched the first part, then I watched the second part as it came out and then now I started watching the finale. However, since I watched this anime the first time, I have become an active member of the anime community and I have watched lots and lots of different animes, and now, this anime just keeps becoming worse and worse in my opinion.\r\nStory - 6/10\r\nThe storyis the only slightly attractive feature of this anime. The story is fluent and there are very few plotholes. The backstories of characters actually make sense and the connection between individual arcs is good. The stories have enough emotions tied to them.\\n\r\nHowever, even though the story is the most attractive part of the anime, it doesn't compare to other famous animes. The story is filled with plot armor and nonsensical power-ups. For example, this series takes place a year after the last arc and in this one year, all the characters got incredibly strong and smart. We don't get to see how they trained or how they gained their powers. We just know that they became very strong in one year. \\n\r\nThe most appalling part, however, is the random power-ups in an on-going fight/match. The main character fights the underlings of the main boss and gets bet up very easily. Then, all of a sudden they get a flashback or a shout-out from a random friend and then they one-punch-knockout their opponents. Not only this but somehow, they restore their health completely and then fight the main boss only to be taken down instantly. There is some random show-off the main boss's power and then again, the main characters get some random power and one-punch-knockout the main boss regardless of how powerful the main boss is. \\n\\n\r\nArt - 5/10\\n\r\nThis is not an anime. This is just a colored manga with hints of hentai in it. One of the main female characters gets nude every time she transforms and another one apparently likes to seduce men. Like, literally, even her wiki fandom page says she likes to seduce men (lucy heartfilia). The only purpose of those two characters is to attract attention from hormone filled men who want to vent their stress. Their bewbs are the only attractive part of the 'art' of this anime. \\n\r\nThe fighting scenes, as I mentioned earlier. are like a colored manga. It is a set of still shots (with obviously* unnecessary random bewb involvement) and the same tricks been used again and again. An anime like mob psycho 100 which is based on a webcomic drawn by an unprofessional, has far better-animated fights than this anime.\\n\\n\r\nSound - 3/10\\n\r\nThe music is catchy, but they don't use it wisely in this anime. It is repeatitive and gets annoying if you watch the anime long enough. They have to literally play the music all the time.\\n\\n\r\nCharacter - 3/10\\n\r\nRandom power-ups, no character development, character whose only compelling feature is their bust, random flashbacks. unnecessary crying and most importantly over-display of 'friendship'. The whole anime revolves around 'friendship'. Each time you see a power-up, you will see the term 'friendship' being used in the vicinity. \\n\r\nBefore someone bashes out on me for saying 'no character development, let me tell you what character development means. It means that there are some changes in your character due to some incidents. These changes are mostly positive changes and are supposed to make them more mature.    I guess the only display of character development is when Natsu learns to give up after fighting glidarts. (That's actually what made me give this factor a score of 3, instead 2)\\n\\n\r\nEnjoyment - 3/10\\n\r\nAs a teen, my pubescent hormone kept me attracted to this anime, but now that i don't feel the same attraction as before, I don't really find the point of watching this anime. I can watch other animes which are wayy better than this anime. You can just read the manga and enjoy the story rather than wasting time on this anime.\\n\\n\\n\\n",
            "date": "2019-03-02T19:59:00+00:00",
            "helpful_count": 12,
            "mal_id": 302778,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6732167.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Aaron_Salve",
                "username": "Aaron_Salve"
            },
            "url": "https://myanimelist.net/reviews.php?id=302778"
        },
        {
            "content": "From all the reviews I've seen, it seems that many people regard Fairy Tail as a great show, but I can't understand why. There are so many problems with this show, and I cannot understand how people do not see them. I'm not really reviewing this specific season, but the anime as a whole. This series actually had some potential, but Hiro Mashima and A-1 threw all of it into the trash. \r\nThe writing is the first thing I want to address about this show. It is fucking stale. Out of the 300 episodes I have seen I swear that each arc except two containsthe exact same formula. For those who do not understand, each arc literally just consists of a new conflict and foe arising and the main characters defeating them. It goes through the same cycle over and over. The protagonists struggle a bit against the opponent and then thanks to the power of friendship, they are able to defeat them. I am not joking when I say most of the arcs just consists of this; this is an accurate description of them. There are only two arcs of this series which I actually liked thanks to the outcomes being different. I also want to mention that pacing is not very good, and arcs drag out way too long.\\n\\n\r\nI am not really a music person, but in my opinion, sound is decent in this show. The music is good, but the problem is that it gets overplayed way too often. There isn't much variety, and I feel like I hear the same songs over and over. Voice acting is not that bad in Fairy Tail either.\\n\\n\r\nFor people who do not realize, art and animation are two different things. The art in this show honestly isn't that bad. I don't remember there being many moments where facial expressions or bodies looked in an awkward way. Despite that, animation in this show is fucking awful. For being an action-based show, you would expect fights to be well animated, but it is the complete opposite. All of the fights consists of still frames and little animation. It is basically a colorized manga. I realize that this is not a seasonal show, but I wish that they would put even some effort into the important fights.\\n\\n\r\nCharacters in this show are extremely average. The problem to me is just that there are way too many. I came into season three not remembering half of the characters' names. I also just hate how fucking stupid the people in this show are. Any moment where there is suppose to be emotional and sympathetic value is ruined by fan-service put in every frame or an unfunny and forced joke. The majority of females looks exactly the same in this show; exact same facial expression and giant breasts. It really pisses me off as well that pretty much no characters have died either. Oh what's that, it looks like a character is about to die. No fuck that I'm gonna be saved by some bullshit reason. It causes the show to have no sense of risk or danger because you know that the main characters are never going to die. Character development is somewhat nonexistent in this show as well. Most characters have remained the same throughout the entirety of the three seasons.\\n\\n\r\nOverall, Fairy Tail is a very mediocre anime. Black Clover may honestly be better than this shit. It is a show that would best be watched as background noise. I really wish that I could make myself drop this show, but I'd prefer to stick to my policy of not dropping shows. For anyone who is considering to watch, I suggest you don't. Don't make the same mistake as me.",
            "date": "2019-03-31T22:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 305108,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5614278.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/kento2",
                "username": "kento2"
            },
            "url": "https://myanimelist.net/reviews.php?id=305108"
        },
        {
            "content": "Im glad the anime is going well .... but the director HIRO MASHIMA  has said that the anime could recieve a new series or a spin off but it would take a long time ....\r\nFor more details read the last chapter of fairy tail .. in that the director has told what will he will be doing with the anime next \r\nHere is the link: https://mangarock.com/manga/mrs-serie-69934/chapter/mrs-chapter-100053236\r\nTill now its only known that the MR. HIRO MASHIMA has released a new manga by the name of eden zero \r\nHope you find it helpful ...................\r\nThank You !!!!!!!\r\nIf you find this helpful ... pls give a like",
            "date": "2019-01-18T01:08:00+00:00",
            "helpful_count": 6,
            "mal_id": 299337,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7514287.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/whitefang1204",
                "username": "whitefang1204"
            },
            "url": "https://myanimelist.net/reviews.php?id=299337"
        },
        {
            "content": "A WORD OF WARNING!!!! I hereby bestow upon this anime the name of \"GIF's, The Animation!\"\r\nI'm so annoyed with this that this is literally the first review I've ever done. Maybe the first of many, I don't know.\r\nThe animation for this season is AWFUL! I'm writing this review to rant as well as point this out because I don't see anyone else talking about how lazy, ugly, & absolutely pathetic the quality of the animation for this show has become.\r\nThis is literally like watching a colored picture book with shaking backgrounds. Hell I'm nicknaming this \"GIF's The Animation.\" Every fight scene consists of still cutoutsof the character in question, then they animate the hair for 3 frames in repetition, add some screen shaking, movement lines, and wallah! That's your fight scene! What the heck is this!?\\n\\n\r\nOn second thought, calling this show \"GIF's The animation\" is an insult to GIF's because I've seen GIF's with better animation than this.\\n\\n\r\nWhat the hell am I even watching this for when I read the manga? I thought this was supposed to be an anime! You know, with ANIMATION! Not a glorified coloring book!\\n\\n\r\nI actually went back to season 1 to check out the fight scenes there because I don't remember it being this bad and guess what. They're not! Season 1's fight scenes are actually animated! Granted there are a lot of the same lazy still frames, but they animate when it counts! Their punches and kicks have \"Movement!\" But this show, just when you think there's going to be a big fight, when they introduce a new character into a major fight to change the outcome.... nothing but still frames.\\n\\n\r\nThis is a new low, a new level of how to not even try, a new level of lazy, a new tier of cutting corners. All the fights are GIF's! They're not even bothering to animate punching. The most basic of all fight moves!!!\\n\r\nThey've actually masked this laziness with CG Special effects for their magic! So at least it \"looks cool\" right?\\n\\n\r\nThis is just a review on the animation aspect of this show. Waste your time at your own will. This is my warning. If you've read this, you may as well just read the manga, because this anime, is not really an animation. \\n\\n\\n\r\nEdit: I've decided to summarize everything else.\\n\\n\r\nStory: 6/10\\n\r\nIt deviates from the manga a bit as expected, but major plot points still in line. Watchers can still easily follow the story. They did add extra layers of plot armor.\\n\\n\r\nCharacters: Meh 6/10\\n\r\nNot much to say. They haven't changed much. Just new abilities that have deus ex machina'd their way into the show. Everyone still has plot armor so there's really no suspense at any point whatsoever. \\n\\n\r\nArt: 1/10\\n\r\nWe talked about this.\\n\\n\r\nSound: 8/10\\n\r\nWell thank god there's at least audio. I'm no sound expert so, wish I could be more critical.\\n\\n\r\nOverall: 5/10\\n\r\nI'm being very generous with this because I've seen worst shows. At least there's plot.",
            "date": "2019-04-29T23:28:00+00:00",
            "helpful_count": 4,
            "mal_id": 307423,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1438101.jpg",
                "scores": {
                    "animation": 1,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/StormofBladeZ",
                "username": "StormofBladeZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=307423"
        },
        {
            "content": "*THE FINALE IS HERE*\r\nyep...its the ending of this beautiful series that most people spent their childhood watching it and screamed over it lol :D\r\ni started watching fairy tail last summer and i got to this series recently...a month ago or so :D\r\nthis last one is getting better and better each episode and i'm enjoying it so much :D\r\nstory 9/10:this series has the most perfect stories from the 2009 and 2014 ones...we are in the end game of natsu vs zeref story here so i'm enjoying it so much :D \r\nthe final series is about bringing the fairy tail guild back together and saving its ownmaster by the 4  very most popular MCs :D\\n\r\ni sure hope that we get some good closure here for them *spoiler*which i heard we won't sadly...i wanted a erza x jellal wedding here :(\\n\\n\r\nart 8/10:fairy tail art is very good indeed but not perfect..it has a decent art for a long running shounen :D\\n\\n\r\nsound 9/10:i always loved fairy tail's songs tbh...2014 series songs were perfect...this series also have good ops and eds so far :D\\n\\n\r\ncharacter 9/10:we will see some major developments for the characters here...specially natsu and gray...they are now more mature and responsible...they think better and act better :D\\n\\n\r\nenjoyment 9/10:i'm enjoying this last series so much....i wait for each episode every week which is rare for me to do and every episode has its moments to fulfill my expectations :D\\n\\n\r\noverall 9/10:so i consider this series the best among fairy tail series...if you are a fan and you love shounen be my guest....enjoy watching the show :D\\n\\n",
            "date": "2019-02-08T14:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 301186,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7245057.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/sepid_96",
                "username": "sepid_96"
            },
            "url": "https://myanimelist.net/reviews.php?id=301186"
        },
        {
            "content": "This season, especially the Alvarez arc, is much better than the others in terms of character motivations (particularly that of Zeref), which the other arcs (like the Tenrou Island arc [Hades had no character-driven reason to seek out the Grand Magic World], lacked). \r\nIt does contain quite a lot of plot armor and deus ex machina moments (like Ultear showing up to save Wendy and Shelia out of nowhere and Natsu magically recovering from his coma) and crappy fight sequences (like ruining the tension of the fight for a stupid nudity joke in the Jacob fight).\r\nI would recommend this season to fans of the previousseasons. It's unlikely that newer fans will enjoy this season (or this show) since most of the humor used is in the same style as the shonen series of the 2000s (or, to put it in another way, overly reliant on slapstick and immature punchlines).\\n\\n\r\nOverall, this season does make some major improvements on the previous seasons and I think you should definitely give it a try if you enjoy shonen battle series.",
            "date": "2019-03-11T18:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 303338,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thickdickrick",
                "username": "thickdickrick"
            },
            "url": "https://myanimelist.net/reviews.php?id=303338"
        },
        {
            "content": "People have been talking shit about Fairy Tail ever since it was serialized and eventually turned into an anime in the late 2000s.  They called it a \"poor man's One Piece\" and not investing. While I do agree there were and remain too much plot armor and PLOT, the Final Series is definitely the highest peak of the entire show. It maintains the great music and character that was introduced in the first season, while also looking even more fantastic with better fightscenes than the already improved (artistically) Fairy Tail 2014. The Final Series contains the raw emotions of the main cast, as wellas Zeref and the Spriggan 12, and fixes numerous plot holes and answers questions fans have been waiting for since the show first started (if you haven't read the manga). Also Natsu and the rest of the cast are way more bad ass this time, as they trained for a year in order to prepare for this final showdown (not including the 100 years quest). This is the best way to end the series that has captivated us for years on end. The only reason it is not a 10/10 is because of the art. The art itself is the best the show has ever looked, however, fight scenes still are pretty static with not a lot of fluent animation (it will probably get better since the first third of the show was animated around the same time the second season was coming to an end, so the last episodes will be looking the best). To add to this, Sword Art Online: Alicitization, and other concurrent A-1 Pictures/Cloverworks animes look better than Fairy Tail, with movements, even though they are using the same animation and production teams. Besides this, Fairy Tail: Final Series is fantastic and  makes you fall in love with the characters again as they win battles, struggle , suffer losses and do everything they can to protect their family, their guild, Fairy Tail. I wish they turn the 100 Year Quest into an anime, but they most likely won't.",
            "date": "2019-02-23T15:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 302297,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MG48282283",
                "username": "MG48282283"
            },
            "url": "https://myanimelist.net/reviews.php?id=302297"
        },
        {
            "content": "Ah, the story of friendship. Through the power of friendship, you can accomplish anything!\r\nThat's what Fairy Tail is, the power of friendship and it's been the main theme through and through. \r\nStory: Honestly, I like seeing how they use the power of friendship and camaraderie to figure out how to beat almost anything. The power of nakama is the best thing to watch. However, if you have been watching from the beginning, it's nice to see why some characters are important to the storyline. \r\nArt: I mean, who doesn't like abs that are overdrawn and exaggerated on every male character? The more abs drawn onthe character, probably the stronger the character is. You love the oppai? Well, the bigger your oppais stronger your character is as well (but this does not apply to Wendy). Mashima knows what the fans want, and he serves it nicely on the silver platter called fan service. \\n\\n\r\nCharacters: We have seen all the characters develop from the beginning, and this includes others that are not in the guild, because what else can make Fairy Tail a stronger guild? The nakama power they have made with everyone they have met throughout the entire series. \\n\\n\r\nEnjoyment: I've been watching from the beginning, so yeah, I'm pretty attached to this series. \\n\\n\r\nOverall: Fairy Tail is exactly what it is, a fairy tale. A fairy tale is a make-believe story that normally has that fairy-tale ending. Fairy Tail might not be a groundbreaking anime, nor is it the anime with the best visuals, however, Fairy Tail lives up to its name as you explore the world of make-believe as you live in the world of what would be fun with dragons, magicians, and any type of magical creature you could think of. \\n\\n\\n",
            "date": "2019-04-28T06:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 307320,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1424267.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kalaniballer22",
                "username": "kalaniballer22"
            },
            "url": "https://myanimelist.net/reviews.php?id=307320"
        },
        {
            "content": "These are dark times for my anime fan self. Somehow I keep being disappointed in every recent anime. Sadly, Fairy Tail (2018) is a disappointment as well.\r\nLong story short: while the audio is still top notch, the visuals are the worst of the whole series and the story is far from good.\r\nSTORY\r\nI like Fairy Tail, I'm not ashamed to say it. Despite what people claim, it has great plots and great ideas (although it's often mixed with a lot of stupidity).\r\nThis Final Series adapts the last 3 arcs of the manga: Avatar, Caracolle Island and the Final Arc.\r\nWhile I do enjoy Avatar and the firsthalf of the final arc (which has a lot of revelations and intense moments), the rest is really... uninspired. It's full of clichés, it's rushed, it's dumb. Caracolle Island is hilarious, but the Final Arc is really not worth it overall (it seems to be usual in the anime industry...).\\n\\n\r\nFairy Tail never had a brillant story. But at least it was decent, sometimes even great. Tartaros Arc, for example, had intense battles with very nice characters, and that was more than enough to keep it entertaining.\\n\\n\r\nThe biggest positive point of this manga is its characters (at least when they are developed). Many of them have a very nice background. Zeref, in particular, is a great character, and one of my favourite vilains in recent animes.\\n\\n\r\nBut the new characters, introduced in the Final Arc, go from \"meh, nice background\" to \"utterly garbage worthless character\".\\n\\n\\n\r\nART\\n\r\nFairy Tail never had great graphics and animation. But the first anime at least had a very nice art style, which made it enjoyable to watch.\\n\r\nThe second series had better drawings, but the animation had gotten worse as it was less dynamic.\\n\r\nNow, the Final Series... actually started very well. It's not great, but the first episodes are actually nice to the eyes (especially the environments, which are great).\\n\r\nBut starting from the end of Avatar arc, the art suddenly goes down the hill. It's mostly still pictures badly drawn!\\n\\n\\n\r\nSOUND\\n\r\nGreat seiyuus, great OST (although it has too much remix of the previous OSTs imo).\\n\\n\\n\r\nCHARACTER\\n\r\nI love the characters of Fairy Tail. They're not the most original, and when they're not important to the current plot they're transparent, but despite that, they're fun to watch.\\n\r\nMy favourite is Wendy. She's the only character who had actual progression. She got stronger and stronger over the arcs, and in this Final Series she really shines as a powerful wizard.\\n\r\nThe other characters are... well, the same as usual. Some of them are real badass (Erza in particular), they're still great to watch in action.\\n\\n\r\nBut most of the new characters are shitty. The Avatar crew was just here to have their asses kicked, I get that but still, did they have to be so... forgettable?\\n\r\nMost of the new main vilains are garbage because they're beaten quickly and don't have a story.\\n\\n\\n\\n\r\nENJOYMENT\\n\r\nI'm really disappointed in this Final Series. I'm not surprised, but still, it's a waste of potential for me The first series of this anime is still the best for me. It's the only one that kept me entertained for hundreds of episodes. The second series disappointed me most of the time, but at least it kept me onboard until the end. This Final Series, however, I'm on the verge of dropping it.\\n\\n\r\nIf you watched the previous series and want to know the end, I really advise to read the manga instead. Sure you'll miss colors and music, but really, I enjoyed the manga version of these arcs way more than I do their anime version.",
            "date": "2019-04-14T09:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 306280,
            "reviewer": {
                "episodes_seen": 0,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7223606.jpg",
                "scores": {
                    "animation": 3,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Dante012",
                "username": "Dante012"
            },
            "url": "https://myanimelist.net/reviews.php?id=306280"
        }
    ]
]