[
    [
        {
            "content": "Story:\r\nhmm.. without spoiling anything, this could be hard to explain..\r\nThe story might advance extremely slow at times but I have never felt the need to skip parts(I often skip boring or long parts) You won't have episodes filled with explanations as happens often in anime these days, his isn't an anime where you will have 1001 questions in the beginning(well, you might have 1 or 2 if you're good at noticing the little things)\r\nArt:\r\nmeh.. its clean, nice, detailed manga style.. You won't find any ugly or messy characters/objects so I think we can say its good.\r\nSound:\r\nI don't realy notice sound a lot and the soundsis not perfect but fits in nicely.\\n\\n\r\nCharacter:\\n\r\nYou will soon love most of the characters(even the evil one's have their charm)\\n\r\nYou learn more about them every now and then, even those backgroundfilling nobody's have some story to them\\n\\n\r\nEnjoyment: I laughed, I was touched and I was never ever frustrated so I think they did a good job on this.\\n\\n\r\nOverall:\\n\r\nThis realy wasn't my type of anime and it does seem enormously girly at first but I ended up watching it anyway because I finished all my other anime already.\\n\r\nAt times I was realy moved by how romantic everything was and the other times.. well, I fell off my chair while laughing more than once. Ah my goddess is a unique and  wonderfull anime, try it out even if it isn't your type, you might like it anyway.",
            "date": "2007-12-24T09:10:00+00:00",
            "helpful_count": 89,
            "mal_id": 1686,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/13554.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/vadeka",
                "username": "vadeka"
            },
            "url": "https://myanimelist.net/reviews.php?id=1686"
        },
        {
            "content": "Story:\r\nThe story could certainly be hard to describe without spoilers, however if you have already watched the anime, heard about it, or simply read the synopsis, then please read on.\r\nThe story advances at a steady pace, however sometimes it can be slow while sometimes it can be fast. I personally thought the story was interesting, and it intrigued me to watch more and more of it. There are no filler episodes, as each episode contributes to something within the story. Thankfully no episodes have extremely long talks, nor do they have \"no action\". There will always be a little bit of action, and comedy incertain area's.\\n\\n\r\nArt:\\n\r\nThe art I found quite thrilling, it was something different to see, the backgrounds blended nicely with what was going on, as well as sometimes the mood of the character. It isn't ugly or poor, it's very good quality art.\\n\\n\r\nSound:\\n\r\nIn my opinion the sound was okay, there wasn't any unnecessary sounds within any of the episodes, and the sound also corresponded with what was going on. Obviously the character voices and such, but also the sound of the background noises - the wind, the birds, insects, etc.\\n\\n\r\nCharacter:\\n\r\nAs soon as I started watching this anime, I fell victim to the characters.\\n\r\nThey are all so different, and you will be unable to choose which is your favourite character.\\n\r\nGood, or evil, both shall win you over. Throughout the anime, you learn more about the characters and their personalities.\\n\\n\r\nEnjoyment: Personally this anime made me laugh quite a lot, and at certain parts it even brought a tear to my eye. It is so touching, and so understanding, but at the same time it keeps you interested - wanting to know more, wanting to see what happens next.\\n\\n\r\nOverall:\\n\r\nThis type of anime is one of a lot which I enjoy watching. However, from the pictures you may see of the anime - it does seem girly, and such - however, even if it does look girly, it's not. If you just take the time to watch a couple of episodes you will realise that this anime could be a great enjoyment for you.\\n\r\nThroughout this anime, you can easily get moved from anger, to sorrow, to guilt, and probably other emotions too. Romance is also within this anime.\\n\r\nAh! My Goddess is an anime I recommended for friends to watch, and now I recommend it for you viewers to watch as well. Even if it doesn't seem appealing, give it a try and watch a couple of episodes.",
            "date": "2011-02-21T03:38:00+00:00",
            "helpful_count": 62,
            "mal_id": 34616,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kapuu",
                "username": "Kapuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=34616"
        },
        {
            "content": "Introduction\r\nAh! My Goddess is a light-hearted, sweet, fantasy without serious romance or ecchiness.  It's a great anime to watch if you are not looking for anything special but rather sit and relax to an easy viewing.  As mentioned by other reviewers, I think girls will like this series more than guys because of the strong female lead and role reversals.  However, those hard-core romantics who are seeking relationship development and ecchi harem loving guys should look elsewhere. \r\nStory\r\nThe story starts out centered around the male lead, Keiichi, who has no luck but is still kind and generous to others.  When giventhe opportunity to have any wish granted, he wished to spend eternity with a goddess.  From that point on, his whole world changed and the series slowly started to shift focus to Belldandy, his goddess.  \\n\\n\r\nThroughout the series, Keiichi would get into trouble and Belldandy would always bail him out.  Her love for him is the heart of the entire anime.  There are many cute and touching moments that stem from their relationship but not much development takes place and they never really kiss.\\n\\n\r\nArt and Sound\\n\r\nOverall, I think the characters were very well drawn and  cute.  Keiichi is really put in a fortunate position with so many beautiful female characters surrounding him.  The special effects are not terrible either.  As for the sound, I really like the opening sound track.  It sounds very scottish.  As for character voices, Belldandy's voice annoyed me because she sounded very old and mother-like.  This is probably because Kikuko Inoue played a lot of mother/teacher roles in other animes I watched.\\n\\n\r\nCharacters\\n\r\nUnlike a lot of romance animes, this anime revolves around the female lead, Belldandy, who is the guardian/housewife. Her character seems like a symbol for strong, modern women.  She is a strong heroine with incredible powers, has a caring and nurturing personality, is irresistible to men and machines alike, and at the end of the day she is the perfect housewife. With all those amazing qualities, its no surprise that she is a goddess!\\n\\n\r\nWith a strong female lead, it is only natural than the male lead, Keiichi, is weak.  He is a normal human who lacks special powers and suffers from an inferiority complex.  However, his attractiveness comes from his unconditional love for others.  He is kind, generous, and protective of everyone; even if they are strangers.  And on top of all of that, his only wish was to be with the one he loves.  He's the kind of guy that girls can picture their husbands to be like.\\n\\n\r\nConclusion\\n\r\nOverall, I could not give this anime a rating above average because there were very few memorable moments.  For the most part, it is a forgettable series that is    too similar to other romance animes, but that may be a good thing if you need a break from a harder hitting anime.  I would recommend this anime to those who just have to see every romance/comedies, but for those who are looking for a new experience, this anime will not satisfy you.",
            "date": "2008-06-15T16:22:00+00:00",
            "helpful_count": 46,
            "mal_id": 5512,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11806.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/tigerz",
                "username": "tigerz"
            },
            "url": "https://myanimelist.net/reviews.php?id=5512"
        },
        {
            "content": "Ah! it  was kinda painful for me to watch.  A!MG is the story of Keiichi, a college student down on his luck and part of the Auto Club with weirdo senpais.  That sentence in it of itself would lead one to believe that it is a very interesting anime but in actuality, it wasn\\'t.  \r\nDon\\'t get me wrong, some of my friends actually loved it because it was so sweet, I\\'m just not one of them.  The idea of a goddess agency in heaven to assist kami-sama in helping the unfortunate is great but I think the plot could havebeen a lot better.  If there were more developments in Season 1, I\\'m sure I would\\'ve watched Season 2 but I was only oh so glad that I finished Season 1 so I could move onto a different anime.\\n\\n",
            "date": "2007-07-13T10:12:00+00:00",
            "helpful_count": 25,
            "mal_id": 507,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7306.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lchoister",
                "username": "lchoister"
            },
            "url": "https://myanimelist.net/reviews.php?id=507"
        },
        {
            "content": "I found this anime extremely boring, which is really sad, because it has so much potential. There were even parts of the show where I thought, \"Oh! This will get good! I will get story!\" but instead it was nothing. D:\r\nOnly watch this if you like pointless anime romantic comedies where nothing really happens.\r\nI am in shock by how different my thoughts on this anime were before I watched it... I had always thought it would be really cool...\r\nI think I need to drop this. D:",
            "date": "2011-04-02T14:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 35587,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/274206.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Krissasaur",
                "username": "Krissasaur"
            },
            "url": "https://myanimelist.net/reviews.php?id=35587"
        },
        {
            "content": "The art is not that goos, and sometimes the characther are annoying, but still - this anime is so good that I watch almost 4-5 episodes every day, and I never did this with another anime.\r\nI liked the anime because the story is great, Urd rocks (!) and every episode always make want to see the other one!\r\nBTW - the opening song is awasome!",
            "date": "2008-05-06T10:37:00+00:00",
            "helpful_count": 7,
            "mal_id": 4574,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Roncha",
                "username": "Roncha"
            },
            "url": "https://myanimelist.net/reviews.php?id=4574"
        },
        {
            "content": "I'm not going to lie I am a big fan of this series however there are still somethings I didn't like which require me to subtract one point from a perfect score. A lot of people I know tend to shy from this series saying it has perversion...? this series by far has been one of the cleanest romance/comedy series I have watched I will point that out now so I don't ramble about it later. \r\nStory- Okay as far as storylines go I was impressed the storyline was kind of original if not strange at some points. The aspect I enjoyed the most washow it managed to fit comedy in without ruining the romance like some series often do. One thing it does follow a pretty basic story line (synopsis of storyline: Boy meets girl and blah blah slight harem scheme blah blah guy develops feelings for girl develops feeling for guy blah blah wierd stuff happens forcing them to be closer together and thats about it).\\n\r\nArt- Alright I have watched the original version on top of having read chapters from the manga and I have to say they stayed pretty acurate to the drawing style and I kind of liked it.\\n\r\nSound- I actually was pretty content with the sound it was good and matched the series the dramatic parts had music that matched really well and also the characters voice actors were really good that is of course in jap lang and eng sub.\\n\r\nCharacter- This series actually did impress me because each character did bring something different to the table and time was always taken out so that you could understand each character better. I mean yeah we have a few generic character types in the mix but it's cool because even despite that they all have something uniquely different about them that it makes you ok with that blandness. So yeah thumbs up.\\n\r\nEnjoyment- Like I said I really enjoyed this series there isn't much I can say I didn't enjoy other than a few episodes and things that I felt were rather meaningless to the story as a whole and aside from one episode which I kind of just skip over whenever I rewatch it the whole series flows well together.\\n\r\nOverall- A good anime, if you like comedy and romance this is the series for you my biggest advice if you're watching for the comedy don't be put off by the first couple of episodes trust me it get's funnier as it goes along.",
            "date": "2008-06-19T23:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 5630,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40654.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aphiel1",
                "username": "Aphiel1"
            },
            "url": "https://myanimelist.net/reviews.php?id=5630"
        },
        {
            "content": "Well, it started off okay with lots of laughs and touching moments but I don't really like weak wussy main male characters. After 18 episodes, it gets a little tiring. Then again, it's my own opinion so if you enjoy watching the same old cliches where the characters get embarassed easily by the most mundane situations, this is a must watch.\r\nSometimes I find there's no real plot, every episode bring about a new situation for the couple to overcome, their love isn't really tested and most of the time you end up feeling disappointed even though they succeed in getting through that episode's trial.",
            "date": "2017-09-19T10:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 258033,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4209305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/eatsnake",
                "username": "eatsnake"
            },
            "url": "https://myanimelist.net/reviews.php?id=258033"
        },
        {
            "content": "When you're a (straight) guy who likes romance anime, but doesn't want all the ecchi/harem nonsense, but also dislikes how terrible the heroines are in more shoujo anime, there aren't a whole lot of options for you. Either the girl is super sexy or the girl is totally unattractive, leaving all the focus on the guy. there is unfortunately little middle ground in the romance anime world. This show is tending toward balance, but the male lead is severely neglected still.\r\nThe male lead is a wishy-washy guy with no confidence, who acts really pathetic. he does absolutely nothing to impress anyone, and proves totally uselessin most situations. this is unfortunate, because the heroine is so well done\\n\\n\r\nThis show has one of the best heroines one could ask for. She's beautiful, kind, caring, and overall great. It makes perfect sense that she's a goddess because she's really the embodiment of a near perfect heroine. her only flaw is that she doesn't really seem to have one. One could easily just say \"She's a goddess. That's intentional\" and that would be a logical argument. However i don't wish to criticize her character. She really is a great character that warms your heart and puts a smile on your face.\\n\\n\r\nThe artwork in this show is awesome. I love the art style of this era and this fits in nicely with that.\\n\\n\r\nMy main problem with this show is that the plot is really bad. It never seems to go anywhere. I had expected to get far more romance, and for there to be a greater focus on Keiichi and Belldandy's relationship. but the good parts of that get swallowed up by the other characters' antics and stupidity.\\n\\n\r\nLastly, don't watch this in English dubbed. It is by far the worst English dub I have heard. That being said, I don't particularly recommend this show to anyone. at the same time i will not say that it's not worth watching. It is a perfectly good way to kill time between shows. It helps to lighten the mood after watching a very heavy show.",
            "date": "2014-02-22T21:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 133565,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1686855.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lelouch84",
                "username": "Lelouch84"
            },
            "url": "https://myanimelist.net/reviews.php?id=133565"
        },
        {
            "content": "I am writing this review of my overall impressions of Ah! My Goddess Seasons 1 & 2, mainly because it felt like one long drawn out series to me. The show was very cute and enjoyable for a bit more than half of the first season, sadly I purchased both the complete first and second seasons before watching any episodes at all, based purely on the outstanding recommendations of others. Having bought all of the episodes (along with the OVA series and movie - neither of which I ever plan on watching) I forced myself to sit through the second half of season 1 andall of season 2. \\n\\n\r\nAh! My Goddess is of the cute romantic comedy variety with great character development that is enjoyable regardless of how ridiculous or unrealistic the plot or individual story arcs seem to be. This story revolves around Keiichi Morisato, a \"university\" student (keep in mind that he is a university student when reading the rest of the review) who seems to have no luck with the ladies, nor much of a social life, and lives in a dorm-like co-op with his fellow members of the mechanic club (which for some reason doesn't allow girls). As the summary suggests Keiichi makes a phone call one day and somehow gets a hold of the \"goddess helpline\" by accident. \"A beautiful Goddess named Belldandy appears,\" before Keiichi and allows him one wish...\\n\\n\r\nThe reason why i disliked this anime was that it is aimed primarily for middle or elementary school kids. I generally like this type of romantic comedy (series like Lovely Complex, Toradora, etc.). While a show like Lovely Complex might have been enjoyed by a younger audience as well, it nonetheless was able to hold up to an adult crowd. The protagonists in Lovely Complex acted their age (for the most part). In Ah! My Goddess, on the other hand, Keiichi, who was attending university, acted like prude teenage girl. Unless Keiichi was secretly hiding in the closet, his actions towards Belldandy throughout the series were inconceivable and terribly frustrating. Likewise, at one point in the series, Keiichi's mechanic club actually gets angry at him for bringing a girl back to his room. WTF? These unrealistic situations and interactions often made the show painful to watch. Sure stuff happened, and the characters developed, it just seemed that as the show progressed, the maturity levels of the characters regressed. (see next paragraph for further reasons why I hated this stupid anime - contains a spoiler, but if you are a male over the age of 15 you shouldn't be watching this series anyways so read ahead).\\n\\n\r\nMaking a phone call and having a Goddess appear in front of you? sure, why not. The Goddess granting you a wish? I'll believe it. You wishing for the Goddess to be exclusively your possession? sounds conceivable. Keiichi (being in college) and Belldandy (being a Goddess who has been around indefinitely) going through 46 episodes, while living together, loving each other, and Belldandy doing everything that Keiichi asks of her, only kissing twice and never once having sex? RIDICULOUS.",
            "date": "2009-11-23T16:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 20787,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237201.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KansaiClub",
                "username": "KansaiClub"
            },
            "url": "https://myanimelist.net/reviews.php?id=20787"
        },
        {
            "content": "Who wouldn't want a beautiful goddess like Belldandy to stay with them forever?  (Though frankly I would rather have Urd.  She is a hottie.)  Having not seen any of the previous incarnations of this series I can't say which is the best, but this was a very entertaining version at least.\r\nI'm not sure I really cared for the pace at which Keiichi and Belldandy's relationship progressed.  As in, it seemed like it didn't.  I guess I would have prefered them to get more alone time.  As it was they seemed to have a rather bland (though devoted and loving)relationship.\\n\\n\r\nStill, I would recommend this to anyone that is interested in a romantic comedy.",
            "date": "2008-07-31T07:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 6719,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81208.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GrooveArmada",
                "username": "GrooveArmada"
            },
            "url": "https://myanimelist.net/reviews.php?id=6719"
        },
        {
            "content": "What really pulled me a first was the title itself, I first thought it was a pun on the common phrase OMG!\r\n As I watched, *some of the things there are things I actually want to happen to me* Imagine, the main character is just and ordinary student working as a mechanic part-time and all of a sudden, One phone-call mistake brings him the IDEAL GIRL! She’s great at cooking, singing, She’s kind, caring, and is devoted to Keiichi, one part I liked about it is when she said, \"You can wish for anything, EVEN THE DESTRUCTION OF THE WORLD!!!\"\r\nThe story itself revolves in aromantic comedy kinda way, It’s twists and turns are what pulled me through to watch the entire series, Now I have finished both 2 seasons and am planning to complete all media of it :D\\n",
            "date": "2012-12-23T17:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 81078,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1928708.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/3miL",
                "username": "3miL"
            },
            "url": "https://myanimelist.net/reviews.php?id=81078"
        },
        {
            "content": "Kind of boring Slice of Life. It wouldnt make any difference if the Goddesses werent Godesses but normal People, and People in the show state exactly what the Problem is, they tell Keiichi that even an elementary Romanze is more grown up than what he is doing... well, i dont have anything more to say than this. They keep introducing new Characters every 5 Episodes build them up as new Main-Sidecharacters just to drop them again and after that they may have 2 cameos 10 episodes later and thats it.\r\nConclusion: Its a rather hard to look, but tamed Harem/ecchi/slice of life anime but because itsso boring/childish/monotone you have to watch out not to fall asleep while watching it.\\n\r\nI dont know if the Manga was better but if you dont like the kind of lovely/one dimensional characters and you actually want some Story Progression, you better stay away from it. Because the story is kind of non existent. They could have easily crammed all that happened in like 5 episodes if it wasnt for said useless side build ups with story arks that went to absolutely nowhere just to get dropped again. For People that like to see some romance, but dont like Ecchi that much i really recommend it. I waited so many Years to finally watch it and now i feel kind of disillusioned because it was so mediocre :/  Ive seen Iriya no Sora UFO no Natsu in 2010 and was totally blown away and got so emotional while watching it. I kind of suspected the same here and got massively dissappointet (no feelings at all). I highly recommend to take a look at this Movie.\\n\r\nRead Snakeskins and  Krissasaur comment if you want other not all out possitive reviews about the show. The last thing i want to say is that i really like the Art and Sound (bagbpipes FTW), they never feel overly cheap or overused, the ..Angeltalk.. they use sometimes is strange but not overly distracting. On a sidenote i have to say that i have seen the show with english dubs, they may have worsen the experience, im from germany but i felt like with most english dubs this one wasnt in the shows favor.   ps Angels (most dissappointing sidecharacters by far) were build up strong and then they got immediately dropped again, they are the best example of this scheme. \\n",
            "date": "2016-01-13T09:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 208436,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356686.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Teenchib",
                "username": "Teenchib"
            },
            "url": "https://myanimelist.net/reviews.php?id=208436"
        },
        {
            "content": "A fairytale romance that seems to start after the happily ever after.\r\nI'm always skeptical of these kinds of 'harem-esque' romance stories, it's so easy to neglect a strong narrative and character depth for simple (male) wish fulfillment. On the face of it \"Aa! Megami-sama!\" is guilty on both counts and yet...it's so sweet you can't help but smile. It's simple, the plot goes nowhere, it's hardly laugh a minute yet it's joyous mood is infectious and if that's what they were going for the intro is perfect. Aa! Megami-sama! is the cotton candy of animes and there's really nothing wrong with that.",
            "date": "2016-05-12T08:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 218428,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5404051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ABCZ",
                "username": "ABCZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=218428"
        },
        {
            "content": "It's difficult to review a show that defines why you enjoy anime, especially when it's not critically acclaimed. This said, Ah! My Goddess is a show that I will hold dear for quite some time. Let's face it, the show has charm.\r\nThe show, while quirky and admittedly cheesy, will forever remain one of my favorites. I immediately connected with Keiichi, but the true \"ringer\" was Belldandy. Never have I witnessed a female character that has drawn me in as Belldandy has. Some critics claim that the relationship between Keiichi and Belldandy is \"unhealthy,\" stating that Belldandy is merely a reflection of the Japanese desire fora submissive female. Claims such as these irritate me; Keiichi and Belldandy's relationship is far removed from normalcy, but in no way is it unhealthy (setting aside outside forces).  Rather, I found their relationship to be a breath of fresh air in the world of drama/media. Keiichi and Belldandy's utter devotion to each other is enviable on many levels, and very unique. While I found the lack of any type of physical contact annoying (the show only gives mere pecks and caresses, while the manga already has them kiss), it was nice to see a show where two characters could show love to each other with out having to disrobe. The point is this: while the relationship is seen as unrealistic and cheesy by most audiences, I see their relationship as something to envy and aim for. I would take dedication and trust over realism and pointless drama any day.\\n\\n\r\nFurthermore, I would argue that Belldandy is no where near submissive and if she is, it's towards the man she loves, not to outside circumstances. Even during her submission (just wait till episode 19), Keiichi refuses to take advantage of her, and that I would argue is the true strength of the show.\\n\\n\r\nThe animation is nothing unique, but it is well done and uniform. The soundtrack is a tad cheesy, but it fits the mood of the show well. Fanservice is apparent, but not overdone and the comedy of the series ranges from slapstick to drop-dead hilarious. This all said, the draw of the show lies in the characters. The show is relatively episodic; no real plot develops, but this format works well for the show. The side stories where excellent as well. Skuld, Urd, Hild, Sayoko, and Megumi all had some great characterization, leading into some great episodes. I especially liked \"Ah! Urd's Small Love Story?\" Unfortunately though, the end of the series leaves you wanting more. Many fans are still hoping for a season 3 to say the least. A little closure would be nice!\\n\\n\r\nOverall, Ah! My Goddess is a solid, slice of life anime. A show that I would recommend to nearly any anime viewer.\\n\\n",
            "date": "2009-04-29T09:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 14614,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BushidoMusings",
                "username": "BushidoMusings"
            },
            "url": "https://myanimelist.net/reviews.php?id=14614"
        },
        {
            "content": "Story 8/10\r\nThe series has a very light-hearted approach, considering the personality and the kind of romance of the main characters, but, the story development is kinda slow, even the manga's story is slow, the development of each character should've been faster, but this made it more interesting, because it kinda show us how hard it is to live with three goddesses, it shows us that just because you have a goddess as your partner doesn't mean it's all fun and no work.\r\nArt 7/10\r\nThe animation is pretty at times but sometimes it gets pretty choppy but nothing to worry about, Belldandy's Cuteness is safe nonetheless! hehehe:)\\n\\n\r\nSound 10/10\\n\r\nNow, this is what I liked about the series, Hamaguchi Shirou is really a great composer! just listening to the soundtracks make me remember the series altogether, the Opening Theme and the Ending Themes also take me in awe, the songs fit the series just right.\\n\\n\r\nCharacter 8/10\\n\r\nOk...The Main Characters are ok I have nothing to say about them it's good, their personalities are just fitting to their roles...but it's the supporting characters who I have the problem with, they fit just as well but by considering their number,the development is bad, not that bad, but, well, its not that good either and the exposure they get is pretty small, mainly because the series focuses on the Main Characters....\\n\\n\r\nEnjoyment 8/10\\n\r\nWell, I enjoyed the series, when I watched it I was laughing all the way! Very Cute story and very funny scenes fill this series I seriously enjoyed it and really made me want more...well you'll know it better if you watch it.\\n\\n\\n\r\nOverall 8/10\\n\r\nIt's on its way to have had a perfect score but there just have to have  some flaws, nothing's perfect but we can try (just don't try too hard), right?\\n\\n\r\nBTW...this series is the one that triggered a new addiction for me...and now I'm an addict for anime! hehehe....",
            "date": "2008-12-14T04:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 10375,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119916.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/teejaeism",
                "username": "teejaeism"
            },
            "url": "https://myanimelist.net/reviews.php?id=10375"
        },
        {
            "content": "The anime's premise starts with a poor boy, Keiichi, who can't get any luck on his side, no matter how many things he tries to do right (can't we all relate?).\r\nHowever, his unheard plea for help is finally answered when the Goddess Help Agency (forget exact name) calls him and says they'll send someone right over.\r\nLittle did he know that she'd appear through a mirror.\r\nThrough a crazy turn of events, he asks his new Goddess, Belldandy, to stay by his side forever.\r\nThe magic is sown and throughout the series more Goddesses come to live with him and cause his life to become a living romancecomedy.\\n\\n\r\nThe series is very good. The story is original, the artwork is very nice (though sketchy in some areas), the sound is alright, I suppose, and the characters are, in fact, top-knotch and not static.\\n\\n\r\nIt was very enjoyable through and through.\\n\\n\r\nI give this series an 8/10.",
            "date": "2009-01-12T16:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 11396,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/134216.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mallik",
                "username": "Mallik"
            },
            "url": "https://myanimelist.net/reviews.php?id=11396"
        },
        {
            "content": "Ah my Goddess is a very enjoyable anime especially if you just want to sit back and relax and watch something less serious, It has lot of funny and quirky moments which will leave a smile on your face and wondering what will happen next!\r\nThis anime is very hard to review without spoiling to much though,\r\nSome people may find the character progression in this series a little slow and tedious but If your like me you wont mind this as even the filler episodes are decent to watch and will keep you entertained.\r\nThe Series doesn't have the most serious setting but it does show agood creative group of characters,the story will not be the most complex but I think it shines in its simplicity and uses that simplicity really well.\\n\\n\r\nThe characters are really good but some supporting casts could have been fleshed out more but that comes down to personal preference.\\n\\n\r\nThe Art and Sound style go hand in hand and work well together.\\n\\n\r\nOverall I though this was a very good anime and worth watching if you don't want a dramatic gritty comedy romance anime :)",
            "date": "2012-08-15T19:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 69893,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1446579.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SirDuck21",
                "username": "SirDuck21"
            },
            "url": "https://myanimelist.net/reviews.php?id=69893"
        },
        {
            "content": "To put it simply, this is a good older anime. The art style, for the time, was great. The sound profiles for the beginning and ending titles were also definitely on my favorite list. Now on to the good parts. Over-all this anime is a tear jerker. The story line is a slow-paced, easy setting and is easy to follow. However I was very disappointed in the character development concerning the main character. He doesn't grow very much through this VERY long series. I enjoyed the character development of the secondary characters a lot more then the main, which i believe is very poor planningon the creators behalf. That being said, I found the main character ( male) to be very weak on a mental level and his mental capabilities decreasing through out the series as he is constantly rescued and then put on a pedistoool.  To me this caused a very weak character and I was severely disappointed, HOWEVER the actual story lien is amazing. I loved watching the secondary characters grow and the histories they had. I also loved how they evolved (metaphorically) with each challenge they faced. I cant really bash this anime due to the faults of a single character though. Its defiantly a good watch, just don't get your hopes up for the main male.",
            "date": "2017-04-09T20:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 245135,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6101838.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Xeleria",
                "username": "Xeleria"
            },
            "url": "https://myanimelist.net/reviews.php?id=245135"
        },
        {
            "content": "The story of this anime is mostly character driven which varies with each episode.  The art is pretty standard.  The music was enjoyable, but not too memorable.\r\nThe best thing about this anime is definitely the characters.  I liked the characters a lot partially due to their interactions with others being very unpredictable.  This anime is full of comedy in which it succeeds in doing very well.  I also enjoyed the setting of the anime which tended to vary a lot.  The supernatural elements and hilarious antagonist also made this show very enjoyable.  If you are looking for afun comedy this series is definitely worth watching.  \\n",
            "date": "2019-03-10T17:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 303267,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7390349.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rohan121",
                "username": "rohan121"
            },
            "url": "https://myanimelist.net/reviews.php?id=303267"
        }
    ],
    [
        {
            "content": "Story:\r\nhmm.. without spoiling anything, this could be hard to explain..\r\nThe story might advance extremely slow at times but I have never felt the need to skip parts(I often skip boring or long parts) You won't have episodes filled with explanations as happens often in anime these days, his isn't an anime where you will have 1001 questions in the beginning(well, you might have 1 or 2 if you're good at noticing the little things)\r\nArt:\r\nmeh.. its clean, nice, detailed manga style.. You won't find any ugly or messy characters/objects so I think we can say its good.\r\nSound:\r\nI don't realy notice sound a lot and the soundsis not perfect but fits in nicely.\\n\\n\r\nCharacter:\\n\r\nYou will soon love most of the characters(even the evil one's have their charm)\\n\r\nYou learn more about them every now and then, even those backgroundfilling nobody's have some story to them\\n\\n\r\nEnjoyment: I laughed, I was touched and I was never ever frustrated so I think they did a good job on this.\\n\\n\r\nOverall:\\n\r\nThis realy wasn't my type of anime and it does seem enormously girly at first but I ended up watching it anyway because I finished all my other anime already.\\n\r\nAt times I was realy moved by how romantic everything was and the other times.. well, I fell off my chair while laughing more than once. Ah my goddess is a unique and  wonderfull anime, try it out even if it isn't your type, you might like it anyway.",
            "date": "2007-12-24T09:10:00+00:00",
            "helpful_count": 89,
            "mal_id": 1686,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/13554.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/vadeka",
                "username": "vadeka"
            },
            "url": "https://myanimelist.net/reviews.php?id=1686"
        },
        {
            "content": "Story:\r\nThe story could certainly be hard to describe without spoilers, however if you have already watched the anime, heard about it, or simply read the synopsis, then please read on.\r\nThe story advances at a steady pace, however sometimes it can be slow while sometimes it can be fast. I personally thought the story was interesting, and it intrigued me to watch more and more of it. There are no filler episodes, as each episode contributes to something within the story. Thankfully no episodes have extremely long talks, nor do they have \"no action\". There will always be a little bit of action, and comedy incertain area's.\\n\\n\r\nArt:\\n\r\nThe art I found quite thrilling, it was something different to see, the backgrounds blended nicely with what was going on, as well as sometimes the mood of the character. It isn't ugly or poor, it's very good quality art.\\n\\n\r\nSound:\\n\r\nIn my opinion the sound was okay, there wasn't any unnecessary sounds within any of the episodes, and the sound also corresponded with what was going on. Obviously the character voices and such, but also the sound of the background noises - the wind, the birds, insects, etc.\\n\\n\r\nCharacter:\\n\r\nAs soon as I started watching this anime, I fell victim to the characters.\\n\r\nThey are all so different, and you will be unable to choose which is your favourite character.\\n\r\nGood, or evil, both shall win you over. Throughout the anime, you learn more about the characters and their personalities.\\n\\n\r\nEnjoyment: Personally this anime made me laugh quite a lot, and at certain parts it even brought a tear to my eye. It is so touching, and so understanding, but at the same time it keeps you interested - wanting to know more, wanting to see what happens next.\\n\\n\r\nOverall:\\n\r\nThis type of anime is one of a lot which I enjoy watching. However, from the pictures you may see of the anime - it does seem girly, and such - however, even if it does look girly, it's not. If you just take the time to watch a couple of episodes you will realise that this anime could be a great enjoyment for you.\\n\r\nThroughout this anime, you can easily get moved from anger, to sorrow, to guilt, and probably other emotions too. Romance is also within this anime.\\n\r\nAh! My Goddess is an anime I recommended for friends to watch, and now I recommend it for you viewers to watch as well. Even if it doesn't seem appealing, give it a try and watch a couple of episodes.",
            "date": "2011-02-21T03:38:00+00:00",
            "helpful_count": 62,
            "mal_id": 34616,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237349.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kapuu",
                "username": "Kapuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=34616"
        },
        {
            "content": "Introduction\r\nAh! My Goddess is a light-hearted, sweet, fantasy without serious romance or ecchiness.  It's a great anime to watch if you are not looking for anything special but rather sit and relax to an easy viewing.  As mentioned by other reviewers, I think girls will like this series more than guys because of the strong female lead and role reversals.  However, those hard-core romantics who are seeking relationship development and ecchi harem loving guys should look elsewhere. \r\nStory\r\nThe story starts out centered around the male lead, Keiichi, who has no luck but is still kind and generous to others.  When giventhe opportunity to have any wish granted, he wished to spend eternity with a goddess.  From that point on, his whole world changed and the series slowly started to shift focus to Belldandy, his goddess.  \\n\\n\r\nThroughout the series, Keiichi would get into trouble and Belldandy would always bail him out.  Her love for him is the heart of the entire anime.  There are many cute and touching moments that stem from their relationship but not much development takes place and they never really kiss.\\n\\n\r\nArt and Sound\\n\r\nOverall, I think the characters were very well drawn and  cute.  Keiichi is really put in a fortunate position with so many beautiful female characters surrounding him.  The special effects are not terrible either.  As for the sound, I really like the opening sound track.  It sounds very scottish.  As for character voices, Belldandy's voice annoyed me because she sounded very old and mother-like.  This is probably because Kikuko Inoue played a lot of mother/teacher roles in other animes I watched.\\n\\n\r\nCharacters\\n\r\nUnlike a lot of romance animes, this anime revolves around the female lead, Belldandy, who is the guardian/housewife. Her character seems like a symbol for strong, modern women.  She is a strong heroine with incredible powers, has a caring and nurturing personality, is irresistible to men and machines alike, and at the end of the day she is the perfect housewife. With all those amazing qualities, its no surprise that she is a goddess!\\n\\n\r\nWith a strong female lead, it is only natural than the male lead, Keiichi, is weak.  He is a normal human who lacks special powers and suffers from an inferiority complex.  However, his attractiveness comes from his unconditional love for others.  He is kind, generous, and protective of everyone; even if they are strangers.  And on top of all of that, his only wish was to be with the one he loves.  He's the kind of guy that girls can picture their husbands to be like.\\n\\n\r\nConclusion\\n\r\nOverall, I could not give this anime a rating above average because there were very few memorable moments.  For the most part, it is a forgettable series that is    too similar to other romance animes, but that may be a good thing if you need a break from a harder hitting anime.  I would recommend this anime to those who just have to see every romance/comedies, but for those who are looking for a new experience, this anime will not satisfy you.",
            "date": "2008-06-15T16:22:00+00:00",
            "helpful_count": 46,
            "mal_id": 5512,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/11806.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/tigerz",
                "username": "tigerz"
            },
            "url": "https://myanimelist.net/reviews.php?id=5512"
        },
        {
            "content": "Ah! it  was kinda painful for me to watch.  A!MG is the story of Keiichi, a college student down on his luck and part of the Auto Club with weirdo senpais.  That sentence in it of itself would lead one to believe that it is a very interesting anime but in actuality, it wasn\\'t.  \r\nDon\\'t get me wrong, some of my friends actually loved it because it was so sweet, I\\'m just not one of them.  The idea of a goddess agency in heaven to assist kami-sama in helping the unfortunate is great but I think the plot could havebeen a lot better.  If there were more developments in Season 1, I\\'m sure I would\\'ve watched Season 2 but I was only oh so glad that I finished Season 1 so I could move onto a different anime.\\n\\n",
            "date": "2007-07-13T10:12:00+00:00",
            "helpful_count": 25,
            "mal_id": 507,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7306.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/lchoister",
                "username": "lchoister"
            },
            "url": "https://myanimelist.net/reviews.php?id=507"
        },
        {
            "content": "I found this anime extremely boring, which is really sad, because it has so much potential. There were even parts of the show where I thought, \"Oh! This will get good! I will get story!\" but instead it was nothing. D:\r\nOnly watch this if you like pointless anime romantic comedies where nothing really happens.\r\nI am in shock by how different my thoughts on this anime were before I watched it... I had always thought it would be really cool...\r\nI think I need to drop this. D:",
            "date": "2011-04-02T14:05:00+00:00",
            "helpful_count": 8,
            "mal_id": 35587,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/274206.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Krissasaur",
                "username": "Krissasaur"
            },
            "url": "https://myanimelist.net/reviews.php?id=35587"
        },
        {
            "content": "The art is not that goos, and sometimes the characther are annoying, but still - this anime is so good that I watch almost 4-5 episodes every day, and I never did this with another anime.\r\nI liked the anime because the story is great, Urd rocks (!) and every episode always make want to see the other one!\r\nBTW - the opening song is awasome!",
            "date": "2008-05-06T10:37:00+00:00",
            "helpful_count": 7,
            "mal_id": 4574,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/19837.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Roncha",
                "username": "Roncha"
            },
            "url": "https://myanimelist.net/reviews.php?id=4574"
        },
        {
            "content": "I'm not going to lie I am a big fan of this series however there are still somethings I didn't like which require me to subtract one point from a perfect score. A lot of people I know tend to shy from this series saying it has perversion...? this series by far has been one of the cleanest romance/comedy series I have watched I will point that out now so I don't ramble about it later. \r\nStory- Okay as far as storylines go I was impressed the storyline was kind of original if not strange at some points. The aspect I enjoyed the most washow it managed to fit comedy in without ruining the romance like some series often do. One thing it does follow a pretty basic story line (synopsis of storyline: Boy meets girl and blah blah slight harem scheme blah blah guy develops feelings for girl develops feeling for guy blah blah wierd stuff happens forcing them to be closer together and thats about it).\\n\r\nArt- Alright I have watched the original version on top of having read chapters from the manga and I have to say they stayed pretty acurate to the drawing style and I kind of liked it.\\n\r\nSound- I actually was pretty content with the sound it was good and matched the series the dramatic parts had music that matched really well and also the characters voice actors were really good that is of course in jap lang and eng sub.\\n\r\nCharacter- This series actually did impress me because each character did bring something different to the table and time was always taken out so that you could understand each character better. I mean yeah we have a few generic character types in the mix but it's cool because even despite that they all have something uniquely different about them that it makes you ok with that blandness. So yeah thumbs up.\\n\r\nEnjoyment- Like I said I really enjoyed this series there isn't much I can say I didn't enjoy other than a few episodes and things that I felt were rather meaningless to the story as a whole and aside from one episode which I kind of just skip over whenever I rewatch it the whole series flows well together.\\n\r\nOverall- A good anime, if you like comedy and romance this is the series for you my biggest advice if you're watching for the comedy don't be put off by the first couple of episodes trust me it get's funnier as it goes along.",
            "date": "2008-06-19T23:59:00+00:00",
            "helpful_count": 7,
            "mal_id": 5630,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40654.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aphiel1",
                "username": "Aphiel1"
            },
            "url": "https://myanimelist.net/reviews.php?id=5630"
        },
        {
            "content": "Well, it started off okay with lots of laughs and touching moments but I don't really like weak wussy main male characters. After 18 episodes, it gets a little tiring. Then again, it's my own opinion so if you enjoy watching the same old cliches where the characters get embarassed easily by the most mundane situations, this is a must watch.\r\nSometimes I find there's no real plot, every episode bring about a new situation for the couple to overcome, their love isn't really tested and most of the time you end up feeling disappointed even though they succeed in getting through that episode's trial.",
            "date": "2017-09-19T10:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 258033,
            "reviewer": {
                "episodes_seen": 18,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4209305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/eatsnake",
                "username": "eatsnake"
            },
            "url": "https://myanimelist.net/reviews.php?id=258033"
        },
        {
            "content": "When you're a (straight) guy who likes romance anime, but doesn't want all the ecchi/harem nonsense, but also dislikes how terrible the heroines are in more shoujo anime, there aren't a whole lot of options for you. Either the girl is super sexy or the girl is totally unattractive, leaving all the focus on the guy. there is unfortunately little middle ground in the romance anime world. This show is tending toward balance, but the male lead is severely neglected still.\r\nThe male lead is a wishy-washy guy with no confidence, who acts really pathetic. he does absolutely nothing to impress anyone, and proves totally uselessin most situations. this is unfortunate, because the heroine is so well done\\n\\n\r\nThis show has one of the best heroines one could ask for. She's beautiful, kind, caring, and overall great. It makes perfect sense that she's a goddess because she's really the embodiment of a near perfect heroine. her only flaw is that she doesn't really seem to have one. One could easily just say \"She's a goddess. That's intentional\" and that would be a logical argument. However i don't wish to criticize her character. She really is a great character that warms your heart and puts a smile on your face.\\n\\n\r\nThe artwork in this show is awesome. I love the art style of this era and this fits in nicely with that.\\n\\n\r\nMy main problem with this show is that the plot is really bad. It never seems to go anywhere. I had expected to get far more romance, and for there to be a greater focus on Keiichi and Belldandy's relationship. but the good parts of that get swallowed up by the other characters' antics and stupidity.\\n\\n\r\nLastly, don't watch this in English dubbed. It is by far the worst English dub I have heard. That being said, I don't particularly recommend this show to anyone. at the same time i will not say that it's not worth watching. It is a perfectly good way to kill time between shows. It helps to lighten the mood after watching a very heavy show.",
            "date": "2014-02-22T21:56:00+00:00",
            "helpful_count": 6,
            "mal_id": 133565,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1686855.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Lelouch84",
                "username": "Lelouch84"
            },
            "url": "https://myanimelist.net/reviews.php?id=133565"
        },
        {
            "content": "I am writing this review of my overall impressions of Ah! My Goddess Seasons 1 & 2, mainly because it felt like one long drawn out series to me. The show was very cute and enjoyable for a bit more than half of the first season, sadly I purchased both the complete first and second seasons before watching any episodes at all, based purely on the outstanding recommendations of others. Having bought all of the episodes (along with the OVA series and movie - neither of which I ever plan on watching) I forced myself to sit through the second half of season 1 andall of season 2. \\n\\n\r\nAh! My Goddess is of the cute romantic comedy variety with great character development that is enjoyable regardless of how ridiculous or unrealistic the plot or individual story arcs seem to be. This story revolves around Keiichi Morisato, a \"university\" student (keep in mind that he is a university student when reading the rest of the review) who seems to have no luck with the ladies, nor much of a social life, and lives in a dorm-like co-op with his fellow members of the mechanic club (which for some reason doesn't allow girls). As the summary suggests Keiichi makes a phone call one day and somehow gets a hold of the \"goddess helpline\" by accident. \"A beautiful Goddess named Belldandy appears,\" before Keiichi and allows him one wish...\\n\\n\r\nThe reason why i disliked this anime was that it is aimed primarily for middle or elementary school kids. I generally like this type of romantic comedy (series like Lovely Complex, Toradora, etc.). While a show like Lovely Complex might have been enjoyed by a younger audience as well, it nonetheless was able to hold up to an adult crowd. The protagonists in Lovely Complex acted their age (for the most part). In Ah! My Goddess, on the other hand, Keiichi, who was attending university, acted like prude teenage girl. Unless Keiichi was secretly hiding in the closet, his actions towards Belldandy throughout the series were inconceivable and terribly frustrating. Likewise, at one point in the series, Keiichi's mechanic club actually gets angry at him for bringing a girl back to his room. WTF? These unrealistic situations and interactions often made the show painful to watch. Sure stuff happened, and the characters developed, it just seemed that as the show progressed, the maturity levels of the characters regressed. (see next paragraph for further reasons why I hated this stupid anime - contains a spoiler, but if you are a male over the age of 15 you shouldn't be watching this series anyways so read ahead).\\n\\n\r\nMaking a phone call and having a Goddess appear in front of you? sure, why not. The Goddess granting you a wish? I'll believe it. You wishing for the Goddess to be exclusively your possession? sounds conceivable. Keiichi (being in college) and Belldandy (being a Goddess who has been around indefinitely) going through 46 episodes, while living together, loving each other, and Belldandy doing everything that Keiichi asks of her, only kissing twice and never once having sex? RIDICULOUS.",
            "date": "2009-11-23T16:44:00+00:00",
            "helpful_count": 5,
            "mal_id": 20787,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/237201.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/KansaiClub",
                "username": "KansaiClub"
            },
            "url": "https://myanimelist.net/reviews.php?id=20787"
        },
        {
            "content": "Who wouldn't want a beautiful goddess like Belldandy to stay with them forever?  (Though frankly I would rather have Urd.  She is a hottie.)  Having not seen any of the previous incarnations of this series I can't say which is the best, but this was a very entertaining version at least.\r\nI'm not sure I really cared for the pace at which Keiichi and Belldandy's relationship progressed.  As in, it seemed like it didn't.  I guess I would have prefered them to get more alone time.  As it was they seemed to have a rather bland (though devoted and loving)relationship.\\n\\n\r\nStill, I would recommend this to anyone that is interested in a romantic comedy.",
            "date": "2008-07-31T07:23:00+00:00",
            "helpful_count": 5,
            "mal_id": 6719,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/81208.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GrooveArmada",
                "username": "GrooveArmada"
            },
            "url": "https://myanimelist.net/reviews.php?id=6719"
        },
        {
            "content": "What really pulled me a first was the title itself, I first thought it was a pun on the common phrase OMG!\r\n As I watched, *some of the things there are things I actually want to happen to me* Imagine, the main character is just and ordinary student working as a mechanic part-time and all of a sudden, One phone-call mistake brings him the IDEAL GIRL! She’s great at cooking, singing, She’s kind, caring, and is devoted to Keiichi, one part I liked about it is when she said, \"You can wish for anything, EVEN THE DESTRUCTION OF THE WORLD!!!\"\r\nThe story itself revolves in aromantic comedy kinda way, It’s twists and turns are what pulled me through to watch the entire series, Now I have finished both 2 seasons and am planning to complete all media of it :D\\n",
            "date": "2012-12-23T17:03:00+00:00",
            "helpful_count": 5,
            "mal_id": 81078,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1928708.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/3miL",
                "username": "3miL"
            },
            "url": "https://myanimelist.net/reviews.php?id=81078"
        },
        {
            "content": "Kind of boring Slice of Life. It wouldnt make any difference if the Goddesses werent Godesses but normal People, and People in the show state exactly what the Problem is, they tell Keiichi that even an elementary Romanze is more grown up than what he is doing... well, i dont have anything more to say than this. They keep introducing new Characters every 5 Episodes build them up as new Main-Sidecharacters just to drop them again and after that they may have 2 cameos 10 episodes later and thats it.\r\nConclusion: Its a rather hard to look, but tamed Harem/ecchi/slice of life anime but because itsso boring/childish/monotone you have to watch out not to fall asleep while watching it.\\n\r\nI dont know if the Manga was better but if you dont like the kind of lovely/one dimensional characters and you actually want some Story Progression, you better stay away from it. Because the story is kind of non existent. They could have easily crammed all that happened in like 5 episodes if it wasnt for said useless side build ups with story arks that went to absolutely nowhere just to get dropped again. For People that like to see some romance, but dont like Ecchi that much i really recommend it. I waited so many Years to finally watch it and now i feel kind of disillusioned because it was so mediocre :/  Ive seen Iriya no Sora UFO no Natsu in 2010 and was totally blown away and got so emotional while watching it. I kind of suspected the same here and got massively dissappointet (no feelings at all). I highly recommend to take a look at this Movie.\\n\r\nRead Snakeskins and  Krissasaur comment if you want other not all out possitive reviews about the show. The last thing i want to say is that i really like the Art and Sound (bagbpipes FTW), they never feel overly cheap or overused, the ..Angeltalk.. they use sometimes is strange but not overly distracting. On a sidenote i have to say that i have seen the show with english dubs, they may have worsen the experience, im from germany but i felt like with most english dubs this one wasnt in the shows favor.   ps Angels (most dissappointing sidecharacters by far) were build up strong and then they got immediately dropped again, they are the best example of this scheme. \\n",
            "date": "2016-01-13T09:31:00+00:00",
            "helpful_count": 5,
            "mal_id": 208436,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/356686.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Teenchib",
                "username": "Teenchib"
            },
            "url": "https://myanimelist.net/reviews.php?id=208436"
        },
        {
            "content": "A fairytale romance that seems to start after the happily ever after.\r\nI'm always skeptical of these kinds of 'harem-esque' romance stories, it's so easy to neglect a strong narrative and character depth for simple (male) wish fulfillment. On the face of it \"Aa! Megami-sama!\" is guilty on both counts and yet...it's so sweet you can't help but smile. It's simple, the plot goes nowhere, it's hardly laugh a minute yet it's joyous mood is infectious and if that's what they were going for the intro is perfect. Aa! Megami-sama! is the cotton candy of animes and there's really nothing wrong with that.",
            "date": "2016-05-12T08:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 218428,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5404051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ABCZ",
                "username": "ABCZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=218428"
        },
        {
            "content": "It's difficult to review a show that defines why you enjoy anime, especially when it's not critically acclaimed. This said, Ah! My Goddess is a show that I will hold dear for quite some time. Let's face it, the show has charm.\r\nThe show, while quirky and admittedly cheesy, will forever remain one of my favorites. I immediately connected with Keiichi, but the true \"ringer\" was Belldandy. Never have I witnessed a female character that has drawn me in as Belldandy has. Some critics claim that the relationship between Keiichi and Belldandy is \"unhealthy,\" stating that Belldandy is merely a reflection of the Japanese desire fora submissive female. Claims such as these irritate me; Keiichi and Belldandy's relationship is far removed from normalcy, but in no way is it unhealthy (setting aside outside forces).  Rather, I found their relationship to be a breath of fresh air in the world of drama/media. Keiichi and Belldandy's utter devotion to each other is enviable on many levels, and very unique. While I found the lack of any type of physical contact annoying (the show only gives mere pecks and caresses, while the manga already has them kiss), it was nice to see a show where two characters could show love to each other with out having to disrobe. The point is this: while the relationship is seen as unrealistic and cheesy by most audiences, I see their relationship as something to envy and aim for. I would take dedication and trust over realism and pointless drama any day.\\n\\n\r\nFurthermore, I would argue that Belldandy is no where near submissive and if she is, it's towards the man she loves, not to outside circumstances. Even during her submission (just wait till episode 19), Keiichi refuses to take advantage of her, and that I would argue is the true strength of the show.\\n\\n\r\nThe animation is nothing unique, but it is well done and uniform. The soundtrack is a tad cheesy, but it fits the mood of the show well. Fanservice is apparent, but not overdone and the comedy of the series ranges from slapstick to drop-dead hilarious. This all said, the draw of the show lies in the characters. The show is relatively episodic; no real plot develops, but this format works well for the show. The side stories where excellent as well. Skuld, Urd, Hild, Sayoko, and Megumi all had some great characterization, leading into some great episodes. I especially liked \"Ah! Urd's Small Love Story?\" Unfortunately though, the end of the series leaves you wanting more. Many fans are still hoping for a season 3 to say the least. A little closure would be nice!\\n\\n\r\nOverall, Ah! My Goddess is a solid, slice of life anime. A show that I would recommend to nearly any anime viewer.\\n\\n",
            "date": "2009-04-29T09:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 14614,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BushidoMusings",
                "username": "BushidoMusings"
            },
            "url": "https://myanimelist.net/reviews.php?id=14614"
        },
        {
            "content": "Story 8/10\r\nThe series has a very light-hearted approach, considering the personality and the kind of romance of the main characters, but, the story development is kinda slow, even the manga's story is slow, the development of each character should've been faster, but this made it more interesting, because it kinda show us how hard it is to live with three goddesses, it shows us that just because you have a goddess as your partner doesn't mean it's all fun and no work.\r\nArt 7/10\r\nThe animation is pretty at times but sometimes it gets pretty choppy but nothing to worry about, Belldandy's Cuteness is safe nonetheless! hehehe:)\\n\\n\r\nSound 10/10\\n\r\nNow, this is what I liked about the series, Hamaguchi Shirou is really a great composer! just listening to the soundtracks make me remember the series altogether, the Opening Theme and the Ending Themes also take me in awe, the songs fit the series just right.\\n\\n\r\nCharacter 8/10\\n\r\nOk...The Main Characters are ok I have nothing to say about them it's good, their personalities are just fitting to their roles...but it's the supporting characters who I have the problem with, they fit just as well but by considering their number,the development is bad, not that bad, but, well, its not that good either and the exposure they get is pretty small, mainly because the series focuses on the Main Characters....\\n\\n\r\nEnjoyment 8/10\\n\r\nWell, I enjoyed the series, when I watched it I was laughing all the way! Very Cute story and very funny scenes fill this series I seriously enjoyed it and really made me want more...well you'll know it better if you watch it.\\n\\n\\n\r\nOverall 8/10\\n\r\nIt's on its way to have had a perfect score but there just have to have  some flaws, nothing's perfect but we can try (just don't try too hard), right?\\n\\n\r\nBTW...this series is the one that triggered a new addiction for me...and now I'm an addict for anime! hehehe....",
            "date": "2008-12-14T04:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 10375,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/119916.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/teejaeism",
                "username": "teejaeism"
            },
            "url": "https://myanimelist.net/reviews.php?id=10375"
        },
        {
            "content": "The anime's premise starts with a poor boy, Keiichi, who can't get any luck on his side, no matter how many things he tries to do right (can't we all relate?).\r\nHowever, his unheard plea for help is finally answered when the Goddess Help Agency (forget exact name) calls him and says they'll send someone right over.\r\nLittle did he know that she'd appear through a mirror.\r\nThrough a crazy turn of events, he asks his new Goddess, Belldandy, to stay by his side forever.\r\nThe magic is sown and throughout the series more Goddesses come to live with him and cause his life to become a living romancecomedy.\\n\\n\r\nThe series is very good. The story is original, the artwork is very nice (though sketchy in some areas), the sound is alright, I suppose, and the characters are, in fact, top-knotch and not static.\\n\\n\r\nIt was very enjoyable through and through.\\n\\n\r\nI give this series an 8/10.",
            "date": "2009-01-12T16:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 11396,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/134216.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Mallik",
                "username": "Mallik"
            },
            "url": "https://myanimelist.net/reviews.php?id=11396"
        },
        {
            "content": "Ah my Goddess is a very enjoyable anime especially if you just want to sit back and relax and watch something less serious, It has lot of funny and quirky moments which will leave a smile on your face and wondering what will happen next!\r\nThis anime is very hard to review without spoiling to much though,\r\nSome people may find the character progression in this series a little slow and tedious but If your like me you wont mind this as even the filler episodes are decent to watch and will keep you entertained.\r\nThe Series doesn't have the most serious setting but it does show agood creative group of characters,the story will not be the most complex but I think it shines in its simplicity and uses that simplicity really well.\\n\\n\r\nThe characters are really good but some supporting casts could have been fleshed out more but that comes down to personal preference.\\n\\n\r\nThe Art and Sound style go hand in hand and work well together.\\n\\n\r\nOverall I though this was a very good anime and worth watching if you don't want a dramatic gritty comedy romance anime :)",
            "date": "2012-08-15T19:27:00+00:00",
            "helpful_count": 4,
            "mal_id": 69893,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1446579.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/SirDuck21",
                "username": "SirDuck21"
            },
            "url": "https://myanimelist.net/reviews.php?id=69893"
        },
        {
            "content": "To put it simply, this is a good older anime. The art style, for the time, was great. The sound profiles for the beginning and ending titles were also definitely on my favorite list. Now on to the good parts. Over-all this anime is a tear jerker. The story line is a slow-paced, easy setting and is easy to follow. However I was very disappointed in the character development concerning the main character. He doesn't grow very much through this VERY long series. I enjoyed the character development of the secondary characters a lot more then the main, which i believe is very poor planningon the creators behalf. That being said, I found the main character ( male) to be very weak on a mental level and his mental capabilities decreasing through out the series as he is constantly rescued and then put on a pedistoool.  To me this caused a very weak character and I was severely disappointed, HOWEVER the actual story lien is amazing. I loved watching the secondary characters grow and the histories they had. I also loved how they evolved (metaphorically) with each challenge they faced. I cant really bash this anime due to the faults of a single character though. Its defiantly a good watch, just don't get your hopes up for the main male.",
            "date": "2017-04-09T20:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 245135,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6101838.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Xeleria",
                "username": "Xeleria"
            },
            "url": "https://myanimelist.net/reviews.php?id=245135"
        },
        {
            "content": "The story of this anime is mostly character driven which varies with each episode.  The art is pretty standard.  The music was enjoyable, but not too memorable.\r\nThe best thing about this anime is definitely the characters.  I liked the characters a lot partially due to their interactions with others being very unpredictable.  This anime is full of comedy in which it succeeds in doing very well.  I also enjoyed the setting of the anime which tended to vary a lot.  The supernatural elements and hilarious antagonist also made this show very enjoyable.  If you are looking for afun comedy this series is definitely worth watching.  \\n",
            "date": "2019-03-10T17:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 303267,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7390349.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/rohan121",
                "username": "rohan121"
            },
            "url": "https://myanimelist.net/reviews.php?id=303267"
        }
    ],
    [
        {
            "content": "Despite what some people might tell you, this is not a harem.  Yes, it does have several women living with a man, but only one of them is interested in the man in question.  The other 2 are just there because of the one who is interested in the man.\r\nHow big of an impact can a single phone call have on your life?  Ah! My Goddess shows us just how big of an effect one supernatural phone call can have in what is easily one of the most charming anime I have ever watched.\r\nStory - 7/10\r\nThe story to Ah! My Goddess followsKeiichi, who is very unlucky - he gets shot down when he attempts to ask the popular girl out, he doesn't have any money, and he has to take care of the dorm while his friends go out partying.  One day, while taking care of the dorm, he makes a phone call like one of his friends asked, but he dials a wrong number - and he calls the Goddess Help Line.  Belldandy, an absolutely gorgeous goddess, answers, and appears before him, explaining that she can grant him one wish.  Keiichi, not thinking, wishes for her to stay with him - and his wish is accepted.  When Keiichi's friends return, they kick him out because there's a strict policy against inviting girls to the dorm (some friends they are).   Fortunately, Belldandy manages to find a temple for them to stay at, and a series of events results in the monk giving the temple to them to take care of.  Over the course of the story, 2 more goddesses come to live with Keiichi - Urd (who wants Belldandy and Keiichi to upgrade their relationship) and Skuld (who's a younger sister who wants nothing more than to separate Keiichi and Belldandy - fortunately, she never succeeds).\\n\\n\r\nArt - 7/10\\n\r\nThe art is nice and colorful, which is just what I like about it.  It just looks very good.\\n\\n\r\nSound - 6/10\\n\r\nThe sound here is alright.  I do remember the opening theme (in a good way).  For those of you who dislike the opening theme: You just need to Open Your Mind, Open Your Mind, Open Your Mind....Okay, you can shoot me for that pun.\\n\\n\r\nThe dub is actually very good, and even though some may find Belldandy's voice to be annoying, I personally found that it added to the charm of the show.\\n\\n\r\nCharacter - 9/10\\n\r\nThe cast was what won me over with this show - Belldandy is one of the biggest sweethearts I've seen in any anime (she's basically who Haruka Shitow would be if Haruka was a goddess), and her relationship with Keiichi is one of my all time favorites.  Keiichi himself was a very good natured guy - the kind that you want to get the girl in the end.  And fortunately, he does.  Urd is kind of similar to Aversa from Fire Emblem: Awakening (although she's, you know, not evil), and Skuld is kind of a bratty little sister - except she can be nice at times.\\n\\n\r\nEnjoyment - 10/10\\n\r\nThis is one of the most charming shows I've watched.  It's a perfect show for reminding people of how beautiful anime can be.\\n\\n\r\nOverall - 8/10\\n\r\nLooking for a good romance? This one will satisfy your desire.\\n\\n\r\nRIYL: Ai Yori Aoshi, Sekirei, Onegai Teacher, Heaven's Lost Property.",
            "date": "2015-06-07T19:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 189800,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4362301.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/RoarkTenjouin",
                "username": "RoarkTenjouin"
            },
            "url": "https://myanimelist.net/reviews.php?id=189800"
        },
        {
            "content": "This is a spoiler free review:\r\nCategories: Romance, slight harem, comedy, innocent, feel-good, happy, emotional.\r\nOne of the better romance animes, Ah! My Goddess will definitely tug at your heart strings and make you think about that future someone. There is some action, though this is primarily 65% romance, 30% comedy, 5% action. Some consider this a harem anime but I consider it somewhere in between, due to the fact that most harem anime involve a guy surrounded by women and eventually becoming monogamous (which one is he gonna end up with? which one is he gonna end up with?) but this particular one involves multiple womenbut he's clearly monogamous throughout the entire series.\\n\\n\r\nThe plot is a college boy (intentionally forgetable) who despairs his bad luck and has little luck with the girls but doesn't necessarily hate his life, who one day, by random draw from heaven is selected by an angel/goddess to be granted a single wish. She tells him he deserves a wish because of his great character and his good deeds and how she likes him the way he is. This would of course make any guy feel like a million bucks so he wishes that he could be with a goddess like her forever. At first they are both shocked by his wish and wonder what to do from there but then they get to know each other and love develops. And a few comedic and serious bumps lie along the road. \\n\\n\r\nTwo of the three main girls represent the cliches of the overly sexually-appealing temptress (who has a pretty good voice actress in the english-dub btw) and the young annoying high pitched voice girl who interrupts serious, romantic moment whenever possible. The main girl is very sweet and innocent and very likable and, like the series itself, a bit too innocent for my taste. I'd say it's more of a show for female audiences but will definitely give you a sense of the feel-goods after. I actually had a customer tell me I was a very pleasant person after I had finished the show before going in to work and the feel of the show rubbed off on me. \\n\\n\r\nIf you like feel-good happy innocent romance anime with a little bit of harem theme and some comedy then this is for you. The only downsides are the annoying sister, the main male character who doesn't stand out and is definitely no Spike Spiegel, and the sad fact that touching hands is one of the most climactic physical parts of the story (which could be good or bad I suppose, this story is more emotional than physical). \\n\\n\r\nPlease take a look at my favorite characters and watched animes and send me any recommendations please. I'm always looking for my next fix.",
            "date": "2013-12-13T23:30:00+00:00",
            "helpful_count": 3,
            "mal_id": 123753,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3404479.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/UponAShallowBay",
                "username": "UponAShallowBay"
            },
            "url": "https://myanimelist.net/reviews.php?id=123753"
        },
        {
            "content": "You know the scenario. A lovable loser of an otaku (in this case the obsession is vehicles, motors, and machines) has a beautiful, mysterious woman enter their life by some magical circumstance, and this person begins to help them solve all their problems and realize their faults, and then somewhere along the way love blossoms. Reading the summary when I discovered this show was almost enough to turn me away right there, but something compelled me to have a go of it, if only to see the main work of the character designer Kosuke Fujishima of the great Tales Of series of video games. Surprisingly,I enjoyed the show, though it had several glaring faults.\\n\\n\r\nStory is pretty non-existent. There are several short arcs, but they are generally meaningless in the long run, and most of the action centers around the developing romance of our hero Morisato and his goddess girlfriend Belldandy. Their romance is slow moving, sappy as hell, and follows a predictable pattern. Morisato struggles to confess his feelings and move the relationship forward due to his meekness, despite Belldandy's indications that she wants him to make a move, and into the middle of it some trivial plot or the occasional bad guy of the week flies up to give them something to solve, which coincidentally helps Morisato or another character confront some of their anxieties, and brings them closer together. Despite all this, there is something engaging about it. The tension, if you can call it that, of the unresolved romance kept me interested in continuing and seeing the outcome. The innocence, the saccharine sweetness of it, so rare in media these days, only sometimes becomes painful to bear witness to. This is down to the characters, who are actually a fairly likable bunch.\\n\\n\r\nMorisato, the protaganist, is quite a schmuck. He always tries to do the right thing and fails. He rarely heads towards a bad thought or action, and if he does, almost immediately regrets it. He always puts the needs of others before himself. He is an utter milquetoast when it comes to his interactions with his belle. If that sounds like the makings of a detestable character, he does have several qualities that balance out his character and make him hard to root against, mainly, his determination, empathy, intelligence, and earnestness in spite of awkwardness.\\n\\n\r\nBelldandy herself is kind of hard to take. Bit of a Mary Sue. She is painfully nice, can outcook anyone, throws around powerful magics, forgives the gravest fault, hardly ever gets angry, excels at every activity, etc. Though she does get wasted on Cola, and is very clueless at times, she could have used a few more faults, a bit of complexity. It's hard to root for a perfect character, though at the same time, that perfection is slightly endearing. Or something like that. Maybe I just projected her traits onto my future wife and the result seemed good.\\n\\n\r\nTwo of Belldandy's siblings enter the picture relatively early on, Skuld, and Urd, and factor in to a large part of the action. They add a bit of comic relief, and add in some subplots that break up the monotony of the main story, though at times you see a bit too much of them. The Motor Club of Morisato's college also has a large role, and also factor into much comic relief (especially the bizarre, and possibly insane Tamayi and Otaki) and subplots. Most of these background characters have a moment to take center stage, and most are hard to hate, with even a bit of depth.\\n\\n\r\nThe villians, Mara, Hild, a few antagonistic angels, and others, are not always the typical evil for the sake of it bad guys, and despite their lame, lackadaisical attempts at thwarting the protagonists that are always doomed to failure, are adequate. They usually have some motivation, and occasionally even have a change of opinion or allegiance at some point of an episode.\\n\\n\r\nI went with the dub for watching the series, and it works. I thought it was good, as far as anime dubs go, I'm sure others will find it barely passable. The chosen voices seem to suit the characters. I obviously can't comment on the sub, you'll have to check it out for yourself.\\n\\n\r\nThe music was bland and forgettable. It does the job, but I wasn't in a rush to go and download the soundtrack or anything.\\n\\n\r\nI am no expert on art, and it is usually something I can forgive in a series, but the designs were pleasing to my eye. Nothing that really jumped out at me however. I liked how many of the characters, especially the humans, are rendered in somewhat of a normal, semi-realistic fashion. All that purple hair, ten foot long hair, and technicolour costumes straight out of the disco era of some shows gets to me after a while. Uh, yeah, I'm more of a plot and characters kind of guy.\\n\\n\r\nOverall, I did enjoy my time with Oh! My Goddess, and I'm not much of a romance fan. Every now and then it is nice to sit down to something light , mindless, and heartwarming however. I breezed through the series fairly quickly, and wouldn't have minded more than the two series that were produced, but you won't catch me crying for a reboot. In the end, there was plenty of room for improvement, but it was quite a charming show. I'll give it a 7.",
            "date": "2015-09-04T00:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 197773,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Steve_French",
                "username": "Steve_French"
            },
            "url": "https://myanimelist.net/reviews.php?id=197773"
        },
        {
            "content": "So... let's write this review!\r\nAh! My Goddess (english name of Aa! Megami-sama!) is a good anime.  I enjoyed watching it a lot. At first it seems that the anime begin to low down after 5-6 episodes but then... Boom! It comes in one shot! Sketches, humor, romance, characters, story, everything seems to gain speed! And from the 9-10th episode to the end it goes up reaching its climax at the end. But... it is not very... \"effective\", i don't know how to say it. In short terms, it is sure that the anime gain speed and more and more events go through the screenbut... it's all in a slow paced style. But this is not a flaw, don't misunderstand what i'm saying. Is the anime pace that is quite slow and calm. And when you finally pair up with its rythm, then you begin to enjoy it.\\n\\n\r\nStory 7: The story is very catchy and after the half of the anime it goes through romance more than the beginning. It's quite enjoyable.\\n\\n\r\nArt/Sound 7/6: On the art i've nothing to say. It's a 2005 anime, and to say it all, it's quite good. The sound... well, it's good but not very good. At some times you can hear some strange noises (especially when the characters shout). Music and others sounds are fair, not wonderful but they're ok, i guess.\\n\\n\r\nCharacter 8: This is the very good part of the anime. The characters are all well made (even the villain, Marller). Urd and Skuld are fantastic, and as well Keiichi and Belldandy (but, to be honest, i prefer Urd and Skuld, but that's my preference). Even the secondary characters are well made (Otaki and Tamiya are too funny, and Otaki remember me Vash from Trigun for the glasses and the hairs):\\n\\n\r\nEnjoyment 7: As i said, i enjoyed this anime. It goes at first a bit slow but then it gain speed and take the viewer on the roller coaster of the romance between the two main character. And with all the side characters it become even more enjoyable! \\n\\n\r\nOverall 7: Then, in short words, Aa! Megami-sama is a good anime, with great characters and a good story. It is worth watching.",
            "date": "2016-02-05T11:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 210185,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3652921.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/IlReaper",
                "username": "IlReaper"
            },
            "url": "https://myanimelist.net/reviews.php?id=210185"
        },
        {
            "content": "Look, its been said by many others that an adequate review for this cant be written without spoilers; I disagree, on the grounds that there is rather little that can be spoiled.\r\nThe story of keichi and the goddess belldandy finding romance with each other is prevalent throughout the entire series. The problem I have is that it barely progresses, in fact they almost seem to be on the same level in the last episode as they were at the beginning! For a story to be good, there must be progression and I saw very little of that. What of the 22 episodes between 1st andlast? well a majority of them could be stand-alones for all I care, because you could cut half of them and never really notice. There is also a plot that eventually arises in the last four or five episodes but to me it was too little, too late. \\n\r\nThe characters themselves were... characters. Keichi is that lackwit imbecile who stumbles across an awesome situation, the problem is that he goes nowhere with that situation. Belldandy is a goddess who is supposed to be all nice and stuff, but there are limitations to how nice you can be, and I think they drew dangerously close to these limits. Screw that, they surpassed them. Beyond this you toss in keichi's sister, belldandy's sisters, and the auto club and that is about all the further the characters go. Personally the pair of den and dai are about the only reason I kept watching, because they were funny. The main problem I have with the characters is that none of them have much (if any) depth to their personalities and are just so one dimensional that they would barely keep interest in a 12 epsiode show, much less 24.\\n\r\nHonestly I just kinda labored through this out of a sense of obligation to finish it, not because I enjoyed it. Heres the thing, I am a huge fan of romance but that still couldn't salvage my high hopes for this show.",
            "date": "2013-02-05T06:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 85943,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1971902.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Snakeskins",
                "username": "Snakeskins"
            },
            "url": "https://myanimelist.net/reviews.php?id=85943"
        },
        {
            "content": "Whilst performing chores for his club members Nekomi tech university student and unlucky guy accidently contacts the goddess hotline and is introduced to Belldandy and his luck changes for ever.\r\nTo get the best out of Ah! My Goddess you really have to care about the relationship between Belldandy and Keiichi, which I actually found a bit boring at times. The problem was I found Belldandy too perfect. The comedy of her defeating Sayoko and Mara without really trying was quite amusing without being hilarious but with the exception of when she got jealous I didn't find her particularly interesting.\r\nWith other goddesses Urd was my favouriteas she had a bit a bad girl side too her and Skuld I found too annoying.\\n\\n\r\nMaybe because I like bad girls my favourite character was the incompetent Mara who is a 1st class demon whose job it is to increase demons market share on Earth. Unfortunately she wasn't in the series enough.\\n\\n\r\nWith the other characters I really did not like Tamiya or Otaki in their animation or personalities, Sayoko, rich girl and queen of Nekomi Tech, was likeable as was Keiichi's sister Megumi.\\n\\n\r\nThe stories in the series were ok with the best when Urd loses her godness licence and becomes a child again.\\n\\n\r\nA good anime to watch if you don't have anything better to see.",
            "date": "2012-05-24T10:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 61821,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1270179.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Paulwillson26",
                "username": "Paulwillson26"
            },
            "url": "https://myanimelist.net/reviews.php?id=61821"
        },
        {
            "content": "Kind and easyplot anime.\r\nMain hero is a bit stupid,but he is good person and for this he was rewarded.\r\nFrom episode to episode you see how the relationship between a normal boy and a goddess is developing and bonds between them are getting stronger and stronger.\r\nWith relaxing background music and well designed characters anime anime  is becoming one of the best in its genre.\r\nBut of course heroes faces some difficulties and in traditional way they overcome them.\r\nOverall very good title for those who is bored of soap and tightened series,who just want to see relaxind and kind anime.",
            "date": "2012-02-03T13:09:00+00:00",
            "helpful_count": 3,
            "mal_id": 53135,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1123553.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zeroxis",
                "username": "Zeroxis"
            },
            "url": "https://myanimelist.net/reviews.php?id=53135"
        },
        {
            "content": "I saw the original Ah! My Goddess! OVA first, and although it was enjoyable, it was essentially a heavily-abridged version of the manga's storyline. Understandably, packing such a lengthy story into five episodes would be too much to ask for, yet I was still left wanting something more developed. The Ah! My Goddess! television series is just that.\r\nThe storytelling, typical of romantic comedies, is rather gradual. Perhaps too gradual, as Keiichi's and Belldandy's romance develops rather slowly, often succumbing to \"Just say it already!\" syndrome, leading to a laundry list of missed opportunities to push the relationship further. Still, those moments when they do sharetheir feelings and develop as a couple are genuinely heartwarming.\\n\\n\r\nFrom a visual standpoint, the series is absolutely stunning. The character designs are nice and varied, and the animation is very fluid. The background art is especially nice - From the busy city to lush open fields, each backdrop is incredibly detailed and beautiful. Artistically, Ah! My Goddess! does a fantastic job.\\n\\n\r\nThe music does an excellent job setting the mood. In addition to its remarkable opening and closing, Ah! My Goddess! has a great selection of background music. I highly recommend the soundtrack, whether you're a fan of the series or not.\\n\\n\r\nMore importantly than anything else, I think what really makes this show(And to some extent the OVA before it) work so well is its rich cast of supporting characters. Though the show centers on Keiichi and the three goddesses, the side characters are well-developed and positively brimming with personality. From Tamiya's and Otaki's comical antics to Megumi's snide commentary to Marller's scheming, I found myself actively liking every character on the show for their endearing and memorable personalities.\\n\\n\r\nA minor complaint of mine would be a somewhat anti-climactic ending. Without spoiling the specific details, the last two episodes of the series felt very detached from the otherwise gripping story arc leading up the final battle. While it was nice to see Urd and Skuld each get more character development as a result of these episodes, I feel their place at the very end leaves us with a very jarring and inconclusive ending.\\n\\n\r\nStill, overall, Ah! My Goddess! is a fun, humorous, and even touching series that I think will greatly appeal to fans of romance stories. I recommend checking it out, and give it my score of 8 out of 10.",
            "date": "2009-03-31T22:52:00+00:00",
            "helpful_count": 3,
            "mal_id": 13668,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/165243.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ChrisAlassal",
                "username": "ChrisAlassal"
            },
            "url": "https://myanimelist.net/reviews.php?id=13668"
        },
        {
            "content": "This series was something I had hoped for since seeing the Original 1993 OVA Series, as I fell in love with it and ended up following the manga devoutly after. I was a fan of Kosuke Fujishima's other major work 'You're Under Arrest!' and was always irked that YUA received a lot of adaptation as an ongoing TV series. Which seemed unfair when it's OVA came out around the same time as AMG's and there was a wealth of AMG manga stories that could be adapted to a longer TV format. But my patience was rewarded when in the early 2000s Ah! My Goddess receiveda wealth of animated adaptation in the form of a pair of TV seasons and an OVA which bookended the TV series nicely. The art designs were well-realized with some pleasant updating of character designs to match the latest manga volumes at the time the series was laid-down, with the modern perks like CGI effects allowing some really neat effects with the magic and supernatural sequences. The music was really well done with some really amazing OP/ED songs and atmospheric music/sound effects, the subbed AND dubbed versions were both quite well done in my opinion, but YMMV on preferences there. Seeing stuff like the demon Mara/Maller in animation (especially after the old OVA teased her in the OVA opening art) or the Terrible Master Urd Arc was really awesome, was really happy when the second season 'Everyone Has Wings/Flights of Fancy' was announced on the heels of the first season.",
            "date": "2018-11-19T14:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 294367,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7502462.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/MKSTEEL",
                "username": "MKSTEEL"
            },
            "url": "https://myanimelist.net/reviews.php?id=294367"
        },
        {
            "content": "Studio AIC does a wide variety of anime be it something like Tenchi Muyou or Bubblegum Crisis Tokyo 2040. If one aspect is clear, the studio is pretty solid when it comes to female characters and some sort of romance element involved. Director Hiroaki Gouda, whom is usually in the role of key animation got his first real shot in the new position. This is an interesting anime simply from the fact that the manga started in 1989 and didn’t finish until 2014 making it a total of 48 volumes. It is all very fascinating, but how good is it?\r\nOur main character is a sophomorein college by the name of Keiichi Morisato. He is simply a guy down on his luck with a love for cars and bikes which is why he is a member of the motor club. One day, Keiichi accidently calls the “Goddess Help Hotline,” so a beautiful young blond woman suddenly appears to grant him a simple wish. Jokingly, Keiichi says he would be happy if the goddess would stay by his side forever, and surprisingly enough his wish is granted. This begins a funny adventure from Keiichi and the goddess, Belldandy, to find a place to live together, and learn all aspects about one another. It really is a funny, awkward, simple, sweet comedy about a normal guy being with a beautiful goddess.\\n\\n\r\nThe show itself is loosely based on Norse mythology such as the elements of Belldandy, the heavens, and the powers that be. This is mixed into the real world causing comedic scenes, episodes, and some fun interactions between Keiichi and Belldandy. The episodes range from the motor club competing in a stock car race of sorts, to meeting Belldandy’s sisters, to an evil enemy trying to exact revenge on the gods. All the while still maintaining that slow romantic relationship build between Keiichi and Belldandy.\\n\\n\r\nAs stated before, the manga started in the late 80’s and the earlier episodes match that. Character designs and writing are very much of that era. However, half way through the series it seems the animation gets a bit more crisp, the writing changes in a more chaotic sense (coincides with the sisters arriving), and there is more action compared to building romance. The theory is since the manga stretched out over decades, so did the style and direction of Ah My Goddess based on the anime era. Literally watching this first season is almost a representation of the late 80’s to the late 90’s in anime.\\n\\n\r\nNow to compare romance anime from the past and present, where Ah My Goddess shines the most is convincing the audience of Keiichi and Belldandy’s relationship is more than just their contract with each other. Truthfully, this is one of the most touching and sweet examples of two people building romantic feelings for one another over time. Another strong suit is actually the supporting cast surprisingly enough. Side characters consistently added to the comedy from start to finish. For example, fellow motor club members always cause Keiichi some sort of grief, and even how when one character says Keiichi’s name, the audience knows something good is going to happen.\\n\\n\r\nNo, the show is not the best written for dialogue. The animation is dated for the time of release. Music in the show is essentially as low budget as a studio can get. When the sisters arrive in the anime, the two bring an entire other element to the show. Some could see this as bringing something different and fresh or seen as simply over-the-top and chaotic. There is some back story and a different entertainment value which has a place, so it really is up to the viewer if this is good or not.\\n\\n\r\nBasically, Ah My Goddess feels like two different anime across the 24 episodes. This anime also seems very reminiscent of Tench Muyou in romance, animation, and characters designs from that early 90’s period with some 2005 technology on it. It is a simple romance done right, but not ground breaking in any way. Ah My Goddess knows what it is and at least worth a single watch for fans of romantic comedies.",
            "date": "2016-12-18T12:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 235757,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1217989.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/BowlingJD",
                "username": "BowlingJD"
            },
            "url": "https://myanimelist.net/reviews.php?id=235757"
        },
        {
            "content": "STORY:\r\n The story is decent, our main protagonist Keiichi has a miserable life, and can't seem to have luck by his side. Taking pity on him Heaven sends a goddess to help him out by granting him one wish. He asks for her to stay by his side. This is a romantic comedy based on this premise so don't expect too much to happen. The plot moves rather slowly but doesn't get boring.\r\nART:\r\nThe art is fine considering it came out a decade ago.\r\nSOUND:\r\nThe soundtrack is calm and peaceful and the opening of the first season is one the most feel peaceful track.\r\nCHARACTER:\r\nThe two main charactersare Belldandy &  Keiichi.Other characters are introduced throughout the series and though some characters may feel one dimensional they undergo character development later on.Though the interactions and the scenes involving Keiichi & Belldandy are the strong points of the show.\\n\r\nENJOYMENT:\\n\r\nThis is a feel-good romantic comedy and I thoroughly enjoyed it.\\n\r\nOVERALL\\n\r\nThis is a show you watch after a long hard day at work. This will make you feel good and though it is a romantic comedy it doesn't rely on fanservice or skin show for the comedy.A must watch even if you are not into this genre.",
            "date": "2018-01-29T14:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 270051,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6899822.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Avadhut_Jakhi",
                "username": "Avadhut_Jakhi"
            },
            "url": "https://myanimelist.net/reviews.php?id=270051"
        },
        {
            "content": "*Minor Spoilers Warning*\r\nIf you wanted a perfect opportunity to have your ah my goddess in anime form fleshed out than this series is a perfect opportunity to get your feet wet in the ah my goddess universe. \r\nLet's face it besides the manga the ah my goddess hasn't had much of an opportunity to be fleshed out in anime form. Any other interations my ah my goddess in anime form before the first season of this series has either been incredibly brief (OVA and the film) or has been chibified to cater to a younger audience. \r\nThe plot of this anime is pretty muchthe same basic story of ah my goddess. Keichi is a guy that has nothing but bad luck but regardless of his bad luck he always tries to have a positive attitude towards life in general. No matter how much life may knock him down from time to time he always finds a way to keep going no matter how hopeless things may be. He ends up being left in his dorm one night, and he accidentally calls the Goddess help line by mistake. As a result of this Belldandy appears before him and tells him that she can grant him any wish that he desires. Since he hasn't had much luck winning the affections of a girl that he is attracted to and since he is very skeptical of what belldnady is offering, he ends up wishing that the goddess would be with him forever. Much to his amazement the wish is granted and that is only the start of many shenanigans left to come. \\n\\n\r\nWhat we get to see in this series is the many challenges that come with having a goddess as a girlfriend and how Keichi has to adjust to this strange and bewildering twist in his life while remaining true to his kind and caring nature. The overall plot of this anime is Belldandy's and Keichi's ever evolving relationship but due to the overall length of the anime it really does move at a snails pace without much progress being made with regards to how they feel about each other. You can't help but feel that more could be accomplished with the sheer amount of time they have with each other but it seems like that whenever an opportunity comes across for Keichi to finally work up the courage to confess his feelings to her, there is always an obstacle in the way (Aka Skuld). Belldandy is still the same warm, loving, compassionate character we've grown to appreciate/love and her ability to see the bright side of any situation gives you very little to no reason to ever dislike her as a character. \\n\\n\r\nOne thing that does work for this anime however is that it does examine multiple plots with how belldandy's sudden appearance affects multiple characters in the series. One of the plot points that are examined is how Belldandy's extended time on earth is affecting heaven. We have plot points that look at disrupting keichi's and belldnady's relationship, we even have a couple of antagonists in this series that focus on a concluding story arc close to the end of the series, and we even have a lot more time with Belldandy's sisters (Urd and Skuld) and they're history and some of the trials and tribulations they have to encounter. This is possibly the anime's greatest strength is how they treat Urd and Skuld. We get to see a huge amount of depth with regards to these characters and one thing I wanted to highlight is that even though for the most part these characters act as obstacles towards Keichi's and Belldandy's relationship and they mostly serve as the comic relief they truly shine in the  final part of this anime where one of them is the main focal point of conflict throughout this entire anime. The last two episodes of this anime have some of the most endearing and heartfelt moments throughout this entire anime because it brings a sense of humanity to these two characters and it makes for some of the most adorable awwwwwwwwww moments of the first season of this series. \\n\\n\r\nThis anime does truly cater to the slice of life genre with some magical girl elements, but there are also some scenes of intense action throughout this anime and the humour is incredibly frequent which can add a much needed boost of adrenaline to this anime during its boring poorly paced segments in which there can be quite a few all depending on who you ask.      \\n\\n\r\nThe characters are all drawn incredibly well but I found the music to be very lackluster and I wasn't particularly fond of the opening and ending songs.  \\n\\n\r\nIn the first season of this series we have an excellent opportunity to see our favorite characters fleshed out but ultimately it takes a long time for the series to focus on a serious story arc minus the ever building relationship between Belldnady and Keichi. One of the strongest aspects of this series is the ah my goddess has a huge cast of minor characters and its actually refreshing to see many of the minor characters get their time in the sun in this series. It really gives them a nice amount of depth and shows that there are more characters that a person can relate to besides Keichi and the Goddesses. \\n\\n\r\nAnyone with any experience with any kind of romantic based anime knows that ultimately true love conquers all and its nice to see the journey that Keichi and Belldnady share even though the pacing can be a bit of a problem from time to time. \\n\\n\r\nIf you truly want your ah my goddess fleshed out in anime form, than this series is an absolute must but just learn to be patient with it because it does take a long time for certain story elements to be fully addressed.\\n\\n\r\nFavorite Character: Belldandy\\n\r\nLeast Favorite Character: Skuld\\n\\n\r\n8/10 (I recommend it.)",
            "date": "2017-10-25T15:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 261703,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4402761.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TheCompletionist",
                "username": "TheCompletionist"
            },
            "url": "https://myanimelist.net/reviews.php?id=261703"
        },
        {
            "content": "Ah! My Goddess is a great show about a young man (Keiichi) who has had a series of bad luck. Bringing him to the attention of the Goddess Help Line who send Belldandy to grant him 1 wish. The trouble starts when Keiichi, thinking it a practical joke, wishes that a goddess like her could stay with him forever...\r\nWish granted.\r\nWhat insues is a funny story line with many characters and a budding romance.",
            "date": "2008-11-29T21:43:00+00:00",
            "helpful_count": 2,
            "mal_id": 9942,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118873.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Papa_G",
                "username": "Papa_G"
            },
            "url": "https://myanimelist.net/reviews.php?id=9942"
        },
        {
            "content": "just like my numbers say this anime is very good. It its defineatly the ultimate guys fantasy to have this happen to them. I'm not to sure there are many girls that would like it but i guess that anyone who enjoys romantic comedies would like it. this show also has some action even though it doesn't have as much as other action shows I also think that it is some what of a Harem. i would recommend it to anyone who likes romance, comedy, harem or magical girl anime",
            "date": "2008-06-04T16:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 5227,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65483.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EcchiEcho",
                "username": "EcchiEcho"
            },
            "url": "https://myanimelist.net/reviews.php?id=5227"
        },
        {
            "content": "Keiichi makes a phone call and then suddenly a Goddess appears before him. Ah My Goddess is an instant girlfriend romantic/comedic slice of life that's actually done right. There are a few fillers here and there and it is not as plot based as some other romance series but overall it just gives a positive impression overall.\r\nAnimation:\r\nThe drawing style is very colorful with strong greens and blues creating a very peaceful (Earthy) feel that blends well with the music and OP. Though the drawing isn't as crisp as 2010 series, it is still fairly good. Belldandy and adult Sculd are drawn nicely and yes youcan tell by Keiichi's looks that he wasn't going to get a girlfriend through normal means. There is some CGI usage but for the most part it is minimal and non-distracting. Oh, and this one is also light on fan service, which is great for a change of pace.\\n\\n\r\nSound:\\n\r\nThe OP is calming but possibly a little too much and I didn't really like the light rock ED. The BGM is light and blends in well with the production (noticeable when necessary but otherwise in the background). The VAs are very good at bringing out their respective character's personality, especially Belldandy. I also can't believe how good VAs are at doing impressions of each other.\\n\\n\r\nStory:\\n\r\nThe series starts out strong with a very good opening arc but then soon becomes episodic with gradual introductions of new characters as the series progresses. As there isn't really a central plot line, the focus is on character development, and the series really shines for it. As one can tell from the many sequels, there also isn't really much of an ending to this one, though they do add a little climax near the end. But worry not for the entertainment in each episode is more than enough to keep going.\\n\\n\r\nCharacter:\\n\r\nThe interactions between the characters in this show go well beyond the average in this genre. You definitely see the characters bonding and growing, and not through upskirts and accidental grabs (*cough ichigo*). Belldandy is by far the most outstanding of the characters as she is capable, kind-hearted, patient, beautiful, and a whole mess of other pluses, despite there being other \"goddesses\" she really stands out, and in my mind cancels out Keiichi's bad luck a thousand times over. What is impressive is that even this seemingly perfect character is developed through the series, and in a way that truly brings a smile to ones face. In contrast, though he develops a bit, Keiichi is still rather pathetic, dwarfing the growth of Keitaro in Love Hina. Perhaps we'll see more development in the subsequent series.\\n\\n\r\nValue:\\n\r\nThis isn't the most exciting of series out there, but it's a good one to relax with after a stressful day. And one that does not require deep philosophical thoughts or worries about whether it is NSFW. Overall a great watch and an easy archive.",
            "date": "2015-11-01T14:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 202418,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202418"
        },
        {
            "content": "Oh, my god. I love Ah, My Goddess. (excuse the lame joke.) \r\nThe magical girlfriend story nowadays is horrible, but I can see that they all probably were at least inspired a little by Ah, My Goddess. I think it's really cute and funny, and the whole time I'm cheering for Keiichi to get together with Belldandy. It's fun and cute, I love it. And the more dramatic parts are very, very awesome as well. \r\nThe art is quite nice. I adore the wings and the goddess' outfits, both are very intricate and pulled off nicely. Pretty much everything looks good. It's not \"WOW thatwas amazing!\" or anything, but it's far from bad. \\n\\n\r\nI actually really love the sound. Some pieces are cheery and regular anime tune, nice but not ear-catching. Then there's the gorgeous pieces with flute, piano, or violin. It's pretty and soft, something that might help me sleep. It's very goddess-like.\\n\\n\r\nI think the characters are super awesome. Belldandy is so kind and perfect that you want be annoyed by her and think she's a Mary-Sue...but she isn't annoying at all. I love her, I want to hug her, she's great. Skuld is the one who can be a little annoying...but she's just so funny and cute that I want to hug her too! Urd is funny too, and she makes me smile. Keiichi is a little boring, and there are a million other \"boring, semi-loser\" types of guys like him...but he is a nice guy and does interact well with the other characters.\\n\\n\r\nI had fun watching this, it cheered me up on boring afternoons. It's a classic anime that you must, must, must watch.\\n\\n\\n\\n",
            "date": "2010-10-05T16:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 31137,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/386953.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/paperyu",
                "username": "paperyu"
            },
            "url": "https://myanimelist.net/reviews.php?id=31137"
        },
        {
            "content": "Ah! My Goddess. A series that I have wanted to watch for a long time. I finally get around to it, and am very pleased with it :)\r\nStory:\r\nThe story is very original and very well thought out. Lots of small details included, but the only downside is that one episode there is a villain they are fighting, and the next there is no hint of a villain anywhere. The series also starts to get a little boring after a while.\r\nArt:\r\nIt was pretty decent, but it was a little on the low-quality side and with really soft-toned colors. The animation is also fairly decent.\r\nSound:\r\nThe opening themeis one of the greatest things about this anime. :) Open Your Mind ~chiisana hane hirogete~ by Yoko Ishida. :) The background music is nice, but just kinda there. Nothing too special. The ending themes really brought the show down though :\\\\n\\n\r\nCharacter:\\n\r\nBesides the stupid names, the characters are really well thought out and fully developed. The only downside is that like an anime based off a visual novel, one episode the character is there and the next it's as if they don't exist.\\n\\n\r\nEnjoyment: As stated earlier, after a while into the show you started to find yourself bored. But it is really a good series and well enjoyed.\\n\\n\r\nOverall: The story is outstanding, with decent art and sound, very likeable characters, etc. This is one great series and I hope taht someday you take the time to watch it :)",
            "date": "2009-05-15T16:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 15050,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/178000.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sailorlitakino",
                "username": "sailorlitakino"
            },
            "url": "https://myanimelist.net/reviews.php?id=15050"
        },
        {
            "content": "When I first watched this anime, I gave it an overall score of 9/10. I personally love cheesy romances and I wish I had a goddess like Belldandy to stay by my side forever. That was all I had paid attention to.\r\nAfter re-watching the anime a couple times, I adjusted my score to an overall 7. I understand that the main character is supposed to be an overly-nice guy, but I wish that wouldn't have put so much of a buffer in his ability at building up his relationships. Also, there's really nothing else to the lead guy besides his nice-guy attitude.\r\nFor 24 episodes, Ifeel like there wasn't a lot that happened story-wise. Conflicts were resolved fairly quickly for the most part. There was usually no cliffhangers to pull you into the next episode. \\n\\n\r\nThe artwork for the goddesses and the guys in charge of the auto club was fairly impressionable; everything else was not.\\n\\n\r\nThe soundtrack did a good job of setting the tone throughout the anime. The memorable tunes gave you an idea of what might be going on before anything actually happened.\\n\\n\r\nI still might watch this again one day for Belldandy's sake.",
            "date": "2017-07-19T12:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 253223,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2947019.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Average-Chris",
                "username": "Average-Chris"
            },
            "url": "https://myanimelist.net/reviews.php?id=253223"
        },
        {
            "content": "What a light-hearted anime! This is just some guilt-free, uplifting fun. I love myself a good harem every once in a while (okay, maybe more than that), but Megami-sama's not just gonna happen like that. Sure, there's no real storyline, and there are typical anime tropes galore, but each episode was just interesting enough to hold my attention. The art was merely acceptable, but the sound was pretty darn good. Some of the songs from the show were actually memorable!\r\nThe highlight of Megami-sama had to be the characters though. Each of the characters had unique personalities with quirks to be enjoyed (except a certain shortgoddess that shan't be named, personal opinion though). Belldandy had to be my favorite! She's played straight as Neutral Good the entire time, which I thought I'd quickly get sick of, but ended up thoroughly enjoying. Truly inspirational. I aspire to be as dandy as Belldandy.\\n\\n\r\nAn average anime with such a kawaii waifu such as Belldandy carries my final score for this anime to a 7.\\n\\n",
            "date": "2016-11-19T23:06:00+00:00",
            "helpful_count": 1,
            "mal_id": 234046,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5829165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/zeralul",
                "username": "zeralul"
            },
            "url": "https://myanimelist.net/reviews.php?id=234046"
        },
        {
            "content": "When I played the first episode and viewed it from beginning to end, the first thing that popped into my head was....&rdquo;Wait, this is not ecchi?&rdquo; I think a lot of people are under the misguided impression that this show is all about the &ldquo;T&rdquo; and the &ldquo;A&rdquo;. Just pervy, ecchi stuff all over the place. So I guess for those who have never seen this show but has always been a bit curious ...lemme just say, right out the gate that this show isn't ecchi. Not even moderately. But maybe it should have been, because this show is rather too wholesome it bordered onbland.\\n\\n\r\nArt/Animation\\n\r\nThe one truly exceptional and most redeemable characteristic of this series has to be the art and animation. It is truly top notch! Most notably has to be the subtle uses of CGI effects for the car races and driving around as well as, falling leaves and feathers, and then even sometimes for extensive scenery pans or for some of the characters/demons movements. What really impressed me was that even with all the CGI use, nothing looked fake or gave off that cold or stiff, computerized look you can get with CG illustrations. So needless to say that with this CG use, having seamless movement was not an issue....whenever they used CGI, otherwise it was just the standard anime movement.\\n\\n\r\nSound \t\\n\r\nThe OP Theme was great, I think that it really fits the show. It has a very nice, mellow, celestial way about it. It also sounded kind of Irish Celtic, too for some reason. The ED songs were forgettable, sorry. I watched the show in English and the voice acting was good.....maybe great, but I dunno, the show was just sooooo mundane at times. Well, maybe it has little to do with the voice acting and more to do with how diluted this story was.\\n\\n\r\nStory \t\\n\r\nTo be succinct, I think the show is overly simplistic and too much like children's programming. It's mostly in episodic format and there really wasn't any overall point to the show except: Goddess get's stuck on Earth with supposed 'loser', goddess' sisters miss her and so moves in with her and the supposed 'loser'.....hijinks and hilarity ensue. But it was mostly hijinks and very little hilarity. I was bored a lot with the middle episodes, I somehow thought this show would be a bit more entertaining.....for whatever reasons.\\n\\n\r\nCharacter \t\\n\r\nBeautifully drawn....yet I must say, this show has taken anime character design to new heights with regard to rhinal imperceptibility. I mean, seriously, where are the noses? Character depth was also there, I mean, everyone had some kind of background established....but still, I felt they were so 'flat' and boring. All they did was really hang out for most of the 26 episodes, except at near the end for about 3 &ndash; 4 episodes when things got more serious. But overall they had no real purpose or objective within the show....even the simplistic and really annoying kids from Pokemon had more purpose and depth.\\n\\n\r\nEnjoyment\\n\r\nThis show is maybe worth giving a once over maybe like an anime DVD rental or borrowing it for your otaku buddy who has almost every title imaginable, but I wouldn't recommend buying it. It's hardly action packed, mildly funny and offers a lot of overly used and cliche romantic elements. This is a show, that was not for me per se but I would recommend it for those young persons nearing their teens.",
            "date": "2008-04-24T08:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 4277,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/48644.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Bishounen_Hunter",
                "username": "Bishounen_Hunter"
            },
            "url": "https://myanimelist.net/reviews.php?id=4277"
        }
    ],
    [
        {
            "content": "'Ah! My goddess!' or 'Aa! Megami-sama!' is a unique series in that it redefines the romantic comedy genre, effectively putting itself in a class of its own.\r\nThe story might appear simple at first, a college student - Morisato Keiichi leads a rather monotonic and uneventful life. He is rather lonely in that he can't seem to find a suitable partner for a (presumably) long time relationship, often ridiculed by girls for his unattractiveness and relatively short stature. It just so happens one day that after finishing his daily chores he accidentally calls the \"goddess help line\" instead of his flatmate. Much to Keiichi's disbelief, abeautiful goddess named Belldandy comes down with the promise of granting him a single wish. What happens afterwards is something unpredictable and unique in its own way and Keiichi's wish paves way for the rest of the series. \\n\\n\r\nThere are many secondary characters in this show but the 2 main ones that you can count on to appear in every single episode since their introduction are two other goddesses Skuld and Urd. Urd is a tame, female version of the stereotypical anime pervert but officially refers to herself as the goddess of love. She comes down to Earth to help Keiichi progress in his relationship with Belldandy as the two are rather shy and reserved individuals. Skuld on the other hand is the younger sister of Belldandy with an unparalleled mind of an inventor. Her reasons for coming down are not so obvious or straight-forward as Urd's but she assists her sister in many tasks throughout the series. \\n\\n\r\nThe most interesting point in this series and the quality that sets it apart from other series in the romance genre is how the relationship between the two main characters is presented and how it progresses. Both Belldandy and Keiichi clearly show interest in each other but are afraid to make the first move. At times it's as if they were both love-shy and many other characters in this series notice that and take whatever steps necessary to bring the two closer, often with adverse effects. What makes it even more frustrating for the viewer is that the two share many traits and are very like-minded people. Belldandy is a hard working responsible person, as is Keiichi and they could be the perfect couple, yet neither of them can muster the courage to be honest with their feelings. \\n\\n\r\nAnother interesting thing to note about this series is that it has a lot of Nordic, mythological themes. One of the places referred to in this anime is called Yggdrasil, which is in fact the tree which contained the planes of existence in the Nordic mythology. There are many more references to the Norse in this anime and even the concept of goddesses is loosely based on the Valkyrie. One can certainly learn a lot about history and ancient mythology by watching this anime.\\n\\n\r\n Interestingly enough, the setting, the plot, the concepts borrowed from Norse mythology - it's all perfectly combined together into a unique anime series that will pleasantly surprise romance watchers. \\n\\n\r\nThe art and music are both very good. The character design is extremely precise and I was especially impressed by Belldandy's design as she truly brings that 'goddess' atmosphere into the series with symbols and jewellery pieces decorating her face and neck. So is the case with other goddesses but Belldandy's is by far the most interesting. The arty quality itself is also good, of course this anime has been made a while back so oddities are to be expected but they will not affect the enjoyability of the series. The highlight here is the story and the characters themselves. \\n\\n\r\nThe music further reinforces the mythological atmosphere here, especially the opening theme. Most sounds and OST themes are also orientated that way. The quality is again, very good and makes for a relaxing and pleasurable experience. \\n\\n\r\nAll in all, 'Ah! My goddess' is definitively one anime that I won't be forgetting for a long time to come and apart from getting a full score from me, it's now also a personal favorite of mine that I plan to re-watch again in the foreseeable future. A recommended watch for those that have a taste in romance and/or fantasy genre. \\n\\n\\n\\n\\n\\n",
            "date": "2011-09-04T16:02:00+00:00",
            "helpful_count": 1,
            "mal_id": 42717,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=42717"
        },
        {
            "content": "STORY – 7\r\nIt’s a story of an ordinary boy meets a goddess. Not goddess-beauty female but really a Goddess!\r\nTypical romantic-comedy type. Some might think of it as harem but better think again. The love story solely focuses on 1 couple and the comedy, well basically, all of them has something to do with it. \r\nART – 8\r\nVery nice art. One of the better art, design and background compare to the other anime.\r\nSOUND  - 8\r\nIf we are talking about opening and ending songs, they have very decent one. In fact, you may end up downloading it and make it your ring tone.  \r\nCHARACTER -8\\n\r\nI love each characters were developed. They are totally different from each other, however, they were able to meet them up at some point one way or the other. \\n\\n\r\nENJOYMENT – 8\\n\r\nI enjoyed watching this anime and for those who wants something light and fun, this is for you. \\n\\n\r\nOVERALL – 8\\n\r\nYes, this is a very much recommended anime. The story might not be as original as you want it to be, but still a must watch! Just be ready for sexy characters that people might think this is kinda ecchi, definitely not! \\n\\n\r\n[A/N: You might agree or not with all the things I wrote down here, but of course, this is my opinion, I would love to hear you opinion as well. =)\\n\r\nPlease excuse any incorrect grammar, etc. And thanks for reading!\\n\r\n-black faerie, Yui]\\n",
            "date": "2014-03-14T12:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 135701,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/380594.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jcyui",
                "username": "jcyui"
            },
            "url": "https://myanimelist.net/reviews.php?id=135701"
        },
        {
            "content": "Story 7/10\r\nThe story is about a guy named Keiichi who's in the motor club at his school, really short, and can never get a girl. One day when using the phone he accidentally calls the Goddess Assistance Agency and he replies with saying wrong number but then Belldandy, a goddess, comes out of a mirror and asks what is his wish. Keiichi is very confused but then asks for a goddess like her to stay with her forever and then the wish was granted. Throughout the show it includes a bunch of cutesy flirty moments between Belldandy and Keiichi but they never really kiss. Thestory would progress really slow, like, REALLY slow sometimes but somehow you don't feel the need to skip any parts. For the funny moments and cute relationship moments and all, I'll give story a 7.\\n\\n\r\nArt 9/10\\n\\n\r\nI think the art is between great and outstanding. The art is quite amazing though. It's very beautiful and smooth. The special effects were very beautiful and gives that soft happy feeling with all the colors. 9 :)\\n\\n\r\nSound 8/10\\n\\n\r\nI rated the sound an 8 because of the pretty cool background music that matches the feeling of the show, the amazing opening, and the okay ending.\\n\\n\r\nCharacter 7/10\\n\\n\r\nThe characters are a little dull. Keiichi is a boring clumsy character but sweet and Belldandy is a sweet, smart, and \"that perfect person\" type but it seems like Belldandy always is worrying about something and usually it's some little thing. Skuld is pretty annoying sometimes because episode after episode of hearing her scream \"ONEE-SAMAAAAAAAAAAAAAAA\" at Belldandy it gets old. Urd is probably my favorite cause she's hilarious and carefree most of the time. But all in all they make the show enjoyable.\\n\\n\r\nEnjoyment 9/10\\n\\n\r\nEven though the story takes forever, it's an enjoyable cutesy romantic comedy. The characters, the art, the sound, all come together to make it enjoyable. :)\\n\\n\r\nOverall 8/10\\n\\n\r\nI really recommend this anime. It can get boring, but the good parts of it are worth watching.",
            "date": "2011-01-09T12:01:00+00:00",
            "helpful_count": 1,
            "mal_id": 33598,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/379737.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xXKasumiXx",
                "username": "xXKasumiXx"
            },
            "url": "https://myanimelist.net/reviews.php?id=33598"
        },
        {
            "content": "when i first heard of this anime i had my doubts.... normaly i am not a fan of romtic comdy's,but i heard from a friend it was worth a watch. so after i started watching  ah my goddess, I knew i had to finish it! the story is your noraml anime story arc. guy meets girl ect, nothing new. but like anyone whould say it's how you put it all together that counts. the art work is perfect! there is not one thing they over look, when they made this anime!\r\nsound well but you in the mood quick adding to the art with verynice perssion. all the character's are fun to watch as well. they ranch from kind  (Belldandy) to insane (urd). the kid sister (skuld) adds well to the story. skuld adds her own insanty to the mix. (keilchi )is the focus of this anime. a bit of  push over but well do his best when needed. the main \"bad guys\" are like team rocket in pokemon. the only are there to be pounded on. that adds to the enjoyment. it's very fun watching belldandy and  keilchi trying to understand there feeling as the story follows threw. all and all even if you are not a fan of this series, there is a good chance you well like it. it is put together and ends like anime's should! so give it a watch^^",
            "date": "2009-05-25T15:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 15278,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/95680.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/alstore",
                "username": "alstore"
            },
            "url": "https://myanimelist.net/reviews.php?id=15278"
        },
        {
            "content": "To be totally honest I've seen the first version of the anime and thought it was way better then the seconded one. What I thought version two lack was the cool racing seen. Where K and Bell was driving a modified motorcycle, they had to work together to win the races. Oh and in ep.2 k was driving bell to find a new place and to live on they way up in the mountain they crash and bell helped him out. I don't know i just wanted to add that for some reason i don't know. P.S. if anyone know where I can download thatversion or buy that version I would appreciated, just leave a msg for me thanks :]",
            "date": "2008-11-12T20:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 9438,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/71871.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/autonut",
                "username": "autonut"
            },
            "url": "https://myanimelist.net/reviews.php?id=9438"
        },
        {
            "content": "This is one of the first animes I watched when I first started getting into anime, and I  must say this... its freaking awesome!!! I love Belldandy, I love Urd and Skuld as well and K1 is fucking hilarious, and as for some1 who is now in a similar situation to him at the begining I can totall relate to him and the story line. \r\nThis anime does seem to be a fantasy feel good anime, for men who have no luck with women. But its presented in such a way it feels as if a lot of work was put into it tonot make it seem tht way, and it makes it freaking amazing!! (just realised I use freaking  way too much) It makes it seem realistic even though theres a large amount of magic and angels and stuff involved. \\n\\n\r\nAnyway the art is amazing using the AMG movie style, instead of the slightly crappy OVA style.\\n\\n\r\nAnd its the anime boffins in Japan are attempting to animate all of the manga as much as they can, as they's also another series of this and 2 ovas at last christmas and hopefully another 20 odd ep will b coming soon as well.\\n\\n\r\nAll in all AMG FREAKING RULES!!!!!!!!!",
            "date": "2008-10-04T10:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 8411,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/53539.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Ging554",
                "username": "Ging554"
            },
            "url": "https://myanimelist.net/reviews.php?id=8411"
        },
        {
            "content": "Keiichi Morisato was an average college student with the worst of luck. One day he is left alone at his dorm room, with a mountain of chores, after his friends go out for a night of fun. The reason behind Keiichi’s unluckiness is that he has an unlucky star hanging above his head up in the heavens.\r\nIn this anime, heaven is full of Goddesses, and these Goddesses are supposed to maintain the status on Earth, but without the humans knowing. Humans that have been cursed with an unlucky star above their heads will eventually call the “Heaven Goddess Agency.” They call this number by mistake,but it is no mistake to the Goddesses watching over.\\n\r\nWhen Keiichi was left at home finishing up his chores he decides to call for some take-out food. When he dials the number, he is connected to the Goddess Agency. When someone calls the Goddess Agency they are sent a Goddess to make their deepest desire come true.\\n\r\nThis is where the story takes off. When Keiichi is sent a Goddess, Belldandy, his deepest desire is love, and he asks the Goddess to stay with him on Earth, forever!\\n\r\nIf you haven’t already figured it out this anime falls in the “Romantic” genre. With some errors to the Goddess Agency, Belldandy stays with Keiichi.\\n\r\nThroughout the anime Keiichi has to teach Belldandy how to act more humanly. What makes this anime so special is that it does not act like a soap opera. It has its own unique story and adventures (Such as friends of Belldandy coming down and staying with them, and the conflict between the Goddesses and the Demon Hild.)\\n\r\nThis anime is a beautiful, romantic story with a side of comedy. I highly recommend it.\\n",
            "date": "2010-01-28T23:14:00+00:00",
            "helpful_count": 0,
            "mal_id": 22772,
            "reviewer": {
                "episodes_seen": 24,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60005.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Renkachi",
                "username": "Renkachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=22772"
        }
    ]
]