[
    [
        {
            "content": "Himouto! Umaru-chan's second season could be one of the more underappreciated comedies out there.\r\nIt's safe to assume anyone who's considering picking up this anime has already seen the first season. My biggest gripe with the first season of Umaru was that the character herself was, for lack of a better word, a complete cunt. Even though her brashness gave the anime its spirit, the second season does a much better balancing act with the many faces of Umaru. The rest of the characters are as entertaining as ever. I certainly wouldn't have made it through the first season if it wasn't for Ebina and Kirie,for example. Himouto!'s second season truly earns a perfect rating in the character department.\\n\\n\r\nPeople love to diss any type of series for lack of development, and this was especially true for the first first season. Does the second season do anything to remedy this? You could say the show ends the same way it started, but some things undoubtedly changed along the way.\\n\\n\r\nWhile the first season introduced us to these characters, the second season is much more focused on exploring their friendships and group dynamics. It was quite rewarding to finally see these lovely people properly hitting it off and bonding together. I was especially surprised by the change in the overall tone, as for every goofy scene there seemed to be an equal amount of emotional ones. In particular the feeling of nostalgia was heavily explored. The 2nd season made me feel a range of emotions. The end result was as tasty as eating chips and chocolate with the occasional sip of cola.\\n\\n\r\nOn the flipside these emotional moments never truly lead us anywhere. The story of Himouto! (if there is one) is fractured and all we get are random everyday events. The scenes are usually loosely connected, but never in a meaningful way. This kind of structure is natural for a comedy, but it certainly doesn't let the series tap into the full potential of the more serious moments of Himouto!. Still, this could change by the end of the series, which is why I'm definitely keeping an eye on possible continuation.\\n\\n\r\nOverall, Himouto!'s second season was a very refreshing take on comedy. If you enjoyed the first season you should definitely check out this one as well, as it has all the strengths and less weaknesses. The characters are better realized and still extremely endearing. They even gave us a banging ED, so go check it out.",
            "date": "2017-12-24T16:55:00+00:00",
            "helpful_count": 35,
            "mal_id": 266287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4243495.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Tiemuuu",
                "username": "Tiemuuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=266287"
        },
        {
            "content": "Umaru is one of those series whose main problem lies in having a premise that appeals to a target demographic (that of older teenagers and young adults) but is actually most enjoyed by another (young parents and siblings with bigger age gaps).\r\nI am actually impressed at how much I ended up liking this series despite having low expectations and reading some of the reviews of the original series. While not always having laugh out loud moments, each episode delivered and I always ended up with a heartfelt smile.\r\n*Semi-spoilers and Personal Analysis*\r\nMany people describe Umaru as bratty and annoying, but upon closer inspection I believe sheis actually trying to make up for a strict and perhaps unhappy childhood. While it is never actually stated, we see some hints here and there that the siblings parents are not actually engaged in their children's lives, meaning that they are either dead (in case of the mother) or uninterested in them (in case of the father).\\n\\n\r\nWe know from the first season that Umaru only actually developed his 'indoor' persona after a year of living with her older brother, and while we do see her throwing tantrums with some of her friends she doesn't really act in a mean way other than with her brother. Even then she is shown to express guilt when pushing things too far and feelings of loneliness whenever he is not around. To me this is actually a sign of the deep emotional attachment she has to him as well as her emotional development. \\n\\n\r\nYou see child prodigies with strict childhoods tend to develop child-like traits later in life. Add to this the fact that their age difference is 10 years, and it is clear that the relationship they have is not of siblings but that of a parent/child. Some examples in Taihei's commitment to cooking so that Umaru can eat healthy food, teaching her responsibility while playing an addicting game, and being strict when he really needs to. \\n\\n\r\nYoung parents should relate to this 'look at me' attitude of small children and I think this is what will make this series enjoyable for them. For the rest of the cast I also enjoyed the teams of social developments, such as Kirie dealing with social anxiety, Sylphyn 'be loud to make friends' attitude and Ebina's awkwardness at being a country girl living in the city.",
            "date": "2017-12-25T19:10:00+00:00",
            "helpful_count": 20,
            "mal_id": 266394,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6830299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RogueChilli",
                "username": "RogueChilli"
            },
            "url": "https://myanimelist.net/reviews.php?id=266394"
        },
        {
            "content": "PLOT: Season 2 continues off with the momentum! This time, Umaru decides to take a leap of faith & be more outgoing with her friends. Her adventures gets more interesting with the encounters they deal with in every episode. Not a lot has changed to be honest...\r\nCHARACTERS:\r\nUmaru: Sweet, kind, funny, adorable, cute, lazy, intelligent & a total foodie. She still loves video games and anime. Surprisingly, I'm still impressed on how she can have so many personalities while her friends noticing & still maintain good grades.\r\nTaihei: Caregiver & older brother of Umaru. He's responsible & does a lot of cooking in the house. We getto see him with his friends at work more this season.\\n\r\nSlyphin: Umaru's rival & UMR's friend, she loves Japanese culture & is very competitive. She is also very kind & caring when it comes to her family & friends.\\n\r\nEbina: Umaru's friend & neighbour, still shy & adorable, but has growing feelings for Umaru's brother.\\n\r\nKirie: Umaru's friend & (technically) Chibi Umaru's Master lol, she's kind & caring too but at times can have a bit of an intimidating look. She is an aspiring artist & has a complicated love-hate relationship with her older brother.\\n\\n\r\nOVERALL: Even though not all has happened this season... It is still a fun anime to watch. Umaru is still adorable where a lot of us can relate to her, her personality & mannerisms. I just hope one day she can reveal her identity as UMR & her himouto (chibi-self).",
            "date": "2017-12-24T13:18:00+00:00",
            "helpful_count": 11,
            "mal_id": 266266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=266266"
        },
        {
            "content": "This is my first ever review on an anime show. Here we go! `(^.^)´\r\nWhen I read that there would be a sequel to Umaru-chan I felt very happy and excited. Now I could look forward to meeting the characters again and hopefully get to know more about Umaru-chan and all the others in the upcoming sequel. Though I was a bit worried about how this show would be different to the first one, my worries was blown away after finishing Himouto! Umaru-chan R. \r\nI can gladly tell you that this show was even better than the first one!\r\nIf you are looking for something easy andlight to watch, with a dash of humor in it, this is hopefully what you are looking for. The art is very good, I have nothing to complain or point out about it. The only thing that I wish this show would have is a stronger story. I love the simplicity of Himouto! Umaru-chan R, but I think it could have been even better if the studio went deeper into exploring some of the main plots. Now they are only scratching on the surface and it annoys me a little. I want to know more.\\n\\n\r\nTo put it simple, this is a show for those who wants a light hearted, enjoyable, sometimes hilarious slice-of-life show. For me, the main thing about this show is the developing of the characters who I came to like very deeply and identify with.\\n\\n\r\nI hope we will be re-united with Umaru-chan and all her friends soon, and I also hope this review was helpful for someone.",
            "date": "2018-01-05T07:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 267495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5702918.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/monokerus",
                "username": "monokerus"
            },
            "url": "https://myanimelist.net/reviews.php?id=267495"
        },
        {
            "content": "This looks more like a reboot to me, except with one upside—more goofier than the first season. Umaru-chan herself is starting to realize her laziness, and the other characters—they feel more characterized than before.\r\nDon't expect new characters—it's the same thing, except twice as better. We get more screentime for the side characters (like Sylphynford's brother) and more relaxing scenes. We get to see more of UMR, and we get to see Taihei and Ebina-chan together.\r\nThe art style is the same thing as it was before, and the sound is also the same thing as it was before. I liked the opening and ending songs morethan the previous one, though.\\n\\n\r\nUmaru's laziness is still there, except twice as lazy (and twice as hate and murderous intent I want towards her loli side).\\n\\n\r\nMy overall enjoyment for this show is great, it's because it's greater and have more fun than the first season. This is a good anime to watch when you're bored, if you don't have any problems with Umaru, that is.\\n\\n\r\nIt's okay to watch the first season, because I think this isn't a second season at all—more like a reboot.",
            "date": "2017-10-31T04:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 262190,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6639776.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CloroSphere",
                "username": "CloroSphere"
            },
            "url": "https://myanimelist.net/reviews.php?id=262190"
        },
        {
            "content": "Umaru Doma is back to wreck your hideous lives again with the much anticipated sequel! Well, it's more or less the continuation or reboot of the series from its manga counterpart.\r\nSo let's continue the trend with Himouto! Umaru-chan R! \r\nThe usual gang is back with Umaru becoming more daring,\r\nher brother Taihei inviting his friends into the fray (and constantly getting annoyed by Umaru at all times),\r\nEbina who still harbours feelings for Taihei although she doesn't have any courage and cringes at his presence,\r\nKirie still adoring Umaru as her Master when it comes to drawing,\r\nAnd of course Sylphin shubafeen!!!~~ with the rival and friend to UMR,a foreign introduced to Japanese culture and always wanting to look good to them.\\n\\n\r\nThe formula for this show hasn't changed a fair bit since Season 1 back in 2015, but this year Doga Kobo made it so it encompasses the relations between our loveable main characters since the entry was a fair bit paltry to understand Umaru-chan and her world at the very start. Granted, I am keen on watching Season 1 now, but that's not saying much.\\n\\n\r\nThe one thing I know got an upgrade is definitely by seeing and hearing this show's rendition. As expected of Doga Kobo, the art is somewhat unchanged and remain the same as the first season and animation-wise is also a copy-and-paste function. So the seeing part? Not much change if episodic comedy is your thing.\\n\\n\r\nBut when it comes to the OST, expect a good one, because the OP feels happening and rightfully so, where the ED is an exercising song that will make you wanna follow dance to their tune. So, a good area, checked out!\\n\\n\r\nOverall, if you're a fan of the first season, this second season is all you want and more.",
            "date": "2017-12-25T17:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 266386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=266386"
        },
        {
            "content": "How the days go fast indeed, not only in the show, where 12 episodes cover a whole year,s but only in real world, where 12 episodes felt like a lightning flash, something about this show that really distinguished is from any other, even the first season feels like a stranger in comparison, your favorite references are still present, the wholesome jokes is as lively as ever too, but what's the real new thing is “actual plot”, not going to lie, the first season, was so vague, pointless stuff occurring in a typical slice of life comedy anime, but this one has a strange addition, youcan really feel a progression in the story, the characters are doing something for once, they are developing as times goes by.\\n\\n\r\n- Story (7.8/10):\\n\r\n12 episodes that follow the life of a slacker, Umaru-chan, the perfect girl in the eyes of many along with her brother Taihei, while interacting like they siblings they are, they make some changes to the people surrounding them, they influence them to improve, to change their personalities, and enhance their treats, like for example with the shy unpopular Ebina, who gains confidence, and the lonely Kirie-chan who wins friends she can depend on, from time to time, there are those little glimpses of few character's flashbacks that really help clear things out, and desyphers the way they are. It's really satisfying how they dug up their past, only to make them seem connected somehow.\\n\\n\r\n- Art (8/10):\\n\r\nI haven't noticed any differences between this animation, and that of the first season, both are great and colorful, very lively and wholesome, ever wondered how could a drawing be wholesome? Here it is, how the characters are drawn, how the backgrounds blend so well with the atmosphere and everything, something that this anime does so well, is the representation of food, yes you heard me right, food looks so much more appealing in anime and manga, but in this particular show, it's done so well that it makes you believe it was done by purpose, and that's just one example.\\n\\n\r\n- Sound (8/10):\\n\r\nI can't think of a better fitting score for this, just like the first season, the same wholesome tracks play all the time, nothing new, or at least that's what I think, I really like the opening, it was one of those openings that are really odd and unlikable at the beginning,but I really grew to love it, and the same can be said about the ending song.\\n\\n\r\n- Character (7.8/10):\\n\r\nYour same old characters, but less annoying (yes, looking at you Sylphinford freaking Tachibana), and more likable, like Kirie-chan, what really helped raise the quality of the characters is the way they developed into the best, Bomber and Alex got some more screentime, and so did Kanau, I thought that was great, there were few other characters introduced, like family members, some of them were really interesting, but some of them were just not welcomed, of at least that's how I felt when I first saw Hikari.\\n\\n\r\n- Enjoyment (8.5/10):\\n\r\nOne might argue that this anime is just a waste of your precious time, a waste of resources and energy, it has no story for it, nothing at all, BUT, this second season, looked much more dynamic, it felt like the studio learned from their mistakes, and improved upon them, I really enjoyed every bit of this anime.\\n\\n\r\n- Overall (8.02/10):\\n\r\nYes, the decimal precision matters in the score.\\n\r\nWould I recommend this anime? It certainly is not for everyone, most the people who watched enough anime, read enough manga would grasp those little hints and references about other works, it true comedy in the show for me, lays there.",
            "date": "2018-02-17T03:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 271719,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5898843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eoussama",
                "username": "Eoussama"
            },
            "url": "https://myanimelist.net/reviews.php?id=271719"
        },
        {
            "content": "This is a comprehensive review of both Season One and Season Two.\r\nHimouto Umaru-chan was an anime I downloaded some time ago, for I was swayed by the hype (and the memes) surrounding its titular character, and one I was deliberately putting off from watching for quite a long time. I knew I wasn’t going to like it, yet in the end, I had no choice but to see it as I was running low on space on my HDD and had to delete something. You can see from my score that I didn’t like it quite much (as I had expected). After I finished watchingthe second season, I was torn between giving it a 5 or a 6. In the end, I gave it a 6 because I appreciated the animation, and the sound wasn’t half bad. Were it for the characters and plot alone, the show wouldn't have gotten anything above a 4.\\n\\n\r\n::: Story :::\\n\\n\r\nThe story of Himouto Umaru-chan is repetitive at best. When it comes to plot, it is nonexistent. Or maybe it was me who couldn't grasp it. Yet, after going over the other reviews, I came to realize that most of the negative ones come from people with the same opinion as me. One can argue the plot is about the titular character, Umaru, overcoming her inner identity and revealing it to her friends. However, this never happens in the course of the series (I haven't read the manga). There is even one episode (the second one of the Specials), where the revelation of her secret identity is teased, but the episode ends rather anticlimactically and this revelation never happens, as Kirie stops Umaru just when she is about to tell them. Talk about convenient.\\n\\n\r\n::: Art :::\\n\\n\r\nI have to admit that the art of this show was decent, to say the least. It wasn't anything groundbreaking, mind you, but it wasn't disastrous either. The colors were vivid and the animation was smooth for the most of the show, and I didn't even see the Blu-Rays - just the regular TV release. The art isn't getting more than a 7 though, because the character designs weren't anything original and memorable, except maybe Umaru's inner self, although I understand they were probably trying to stick to the original manga art.\\n\\n\r\n::: Sound :::\\n\\n\r\nUsually, when it comes to sound in an anime, I can only think of songs (OP/ED songs, insert songs, maybe some soundtrack). I don't know how people judge VAs in anime. I can't. I mean, when it comes to this show, I didn't find any of the voices grating or sounding out of character, but that's it. I don't even know what a voice must be to sound out of character. When it comes to the songs and the soundtrack though, I have an opinion. Generally, the OP songs of both seasons were annoying at best. They were both sung by Umaru's VA and described how much Umaru likes to lounge around, eat junk food, and exploit her brother. Yeah, I'm not kidding here. The EDs, especially the first season's, were okayish. Nothing spectacular or eargasmic again. Yet, the 6 goes for the soundtrack, as there was one particular score I really liked.\\n\\n\r\n::: Character :::\\n\\n\r\nI think it's fair to say the characters were this show's worst aspect. I could put up with everything else, from the repetitive story to the annoying songs. Yet, the characters were what made the experience unbearable for me. I'm writing this review mostly to express my utter disdain for them. Well, mostly for Umaru. Honestly, after all the anime shows I've seen in my life, I've never before come across such an irritating character. My irritation grows even further when I see that many people actually liked her and even RELATED to her! I mean, WHAT?! How can someone such as Umaru be relatable in any bloody way?\\n\\n\r\nThe thing about Umaru is that she is sporting two different identities that, when combined, make her the most irritating person in the whole world, anime character or not.\\n\\n\r\nWhen Umaru goes out, she is a model student with perfect grades (always gets 100 on tests), outstanding at all kinds of sports (she can beat the captains of all school sport clubs), and with fine manners (she is generous and kind, and simply the perfect human being when it comes to personality). Not only that but she is so exceptionally beautiful and perfect that all boys swoon over her and all girls admire her and want to be her friends. \\n\\n\r\nHowever, when she goes home, she dons her favorite hamster hood and transforms (yes, and no one but her brother can recognize her) into a 40-centimeter-tall orange blob of a sluggard, who doesn't do anything but watch anime, read manga, play games, eat junk food, and drink cola. A lot of cola. And this continues for the rest of the day before she goes to sleep. If you think I'm exaggerating, go watch the show and see for yourself. \\n\\n\r\nThe thing is, her outer and her inner self are in total discord. For instance, I don't understand how a person can constantly lounge around, eat junk food and not gain any weight. Umaru doesn't only not gain any weight - no, she has the most perfect body of all girls her age. Not only that but she is exceptional in sports. I mean, seriously?\\n\\n\r\nAfter watching the show, I did my research and found out that Japanese students spend at least two hours per weekday on homework, and even three hours on Sundays. Yeah, right. Throughout the show, I didn't see Umaru study for her classes at all (except that one time before the finals), let alone do her homework. From the OP of the second season it becomes somewhat clear that her brother Taihei is doing her homework, but when I thought about it, it didn't click together entirely. Because what about when Taihei works overtime and comes home late at night and is so exhausted that he goes to sleep right away? Or when he goes on business trips and doesn't come home for days? It would mean Umaru goes to school without homework. And she still maintains perfect grades. Right. You know what, if I go to school without having done my homework even one time, I'll get a straight F. No excuses. No compromises.\\n\\n\r\nHowever, what irritates me the most about Umaru is her childish personality. The spoiled brat would cry for trifles, and would always get whatever she wants by crying and throwing tantrums. Honestly, every time I saw her rolling on the floor and crying because she wanted a particular game or magazine, I wanted to turn into an anime character, get into the show, and kick her snotty ass out the window. And the worst part of her character is that she never changes. Yes, she makes a few friends throughout the show, but she never musters the courage to tell them about her inner self. So in the end, her story becomes pointless and never teaches you anything (except maybe that it's fine to pretend to be who you are not, and then to be a total drone when no one sees you). \\n\\n\r\nWhich brings me to the other main character I didn't like - Umaru's brother, Taihei. It seems the trend in modern anime is for the male characters to lack backbone. Throughout the whole series, I just wished for Taihei to man up and give a good lesson to his younger sister. However, instead of doing it, he kept on spoiling her. He would buy her anything she wanted, from games and anime DVDs to a new car! Yes, in the first season, Umaru saw a commercial for a car, told Taihei she wanted it, and he immediately agreed to buy it. And if it weren't for Taihei's fear of driving, he would have actually purchased it. Just so Umaru can use it to lounge in the backseat. Because that's why she wanted the car in the first place.\\n\\n\r\nSome people may argue with me and say that Taihei loves Umaru and that's why he spoils her. Well, guess what! Spoiling a child out of love is the worst thing a parent (or an older sibling in this case) can do. If the child never learns to accept failure and denial, what is their life going to be when they grow up and have to live on their own? I mean, Umaru isn't planning to always live with her brother and rely on him for everything, is she? That would be pretty savage of her. But knowing her, I wouldn't be surprised if that's what she is thinking.\\n\\n\r\nIf it weren't for his backbonelessness and inability to stand up for himself, Taihei would have been a likable character. He is smart, and we even see some of his backstory at school, where he was a model student with perfect grades. However, unlike Umaru, he actually spent his days studying to be on top of his class so that he didn't do anything else and didn't nurture any hobbies of his own. And he wasn't admired for being the most handsome boy. On the contrary, he had average looks.\\n\\n\r\nNow, I'm in no way saying that having average looks is crucial for a character to be relatable. However, what is crucial is for the character to make sense. We never learn about Taihei's lifestyle out of school, so I can't say for certain that it fully corresponds to his looks, but judging by his obsession with studying, he couldn't have had a lot of time to think about his appearance. However, Umaru deliberately doesn't care about her appearance and at the same time she looks stunning. Moreover, she doesn't study at all, but still somehow is the top-grade student at school. This is what doesn't make sense and makes her an annoying character. I mean, if such a person existed in real life, they would live without a single care in the world and would be always happy and contented with their life. Therefore, such person shall not exist.\\n\\n\r\nAnyway, moving on to the rest of the cast, I can only say they were as bland and unimaginative as any character in a low-profit anime these days - cardboard cut-outs sporting stereotypical personalities (although, as far as I know, the show did well in sales). They contributed to nothing and had no goals of their own except for befriending Umaru. Yeah, that's right. Both Sylphin's and Kirie's objectives in the anime were to befriend Umaru (Kirie even wanted to protect her, wtf?). Kirie actually had a goal of her own, but she barely pursued it in the show and it still involved (surprise!) Umaru. Both Kirie's and Sylphin's brothers were stereotypical characters as well, although they got so little screen time I even forgot to mention them at first.\\n\\n\r\nEbina was maybe the most realistic character in the anime, but she was extremely downplayed and turned into a stuttering laughingstock so that even when she had good moments in the show, they weren't able to erase the damage her character had already taken. For example, near the end of season two, we learn that Ebina's bad grades come from her panicking during tests and being unable to concentrate. Once she managed to get rid of her panic, her grades majorly improved. However, since this happened almost at the end of season two, her one instance of being smart wasn't able to make up for the shame of a dumbhead she had been before. Yet, since she wasn't constantly fixated on Umaru, I would say she had some charm that made her tolerable for me.\\n\\n\r\nThe show even introduced another character in the middle of the second season - Hikari. Honestly, when I first saw her, I thought she would be a very good character - a formidable opponent for everything Umaru was. However, being introduced so late in the show, she barely had any screen time and when she did, she was mostly doing one and the same thing - trying to claim Taihei for herself (she even called him 'Onii-chan'). Her lack of screen time really disappointed me and I hope the studio releases a third season where Hikari's character is better explored. But please, don't make her lose to Umaru in any way. PLEASE!\\n\\n\r\n::: Enjoyment :::\\n\\n\r\nAfter my ranting about the characters, I think it's time I continue with the next part of this review. All in all, I didn't enjoy this anime, and Umaru was the primary reason for this. However, I can't deny the fact that I marathoned the series in one night (as I always do with 1-cour shows), and was almost unable to feel the time that had passed. This means the show didn't drag on and although the story was repetitive, each episode had enough stuff going on so that I wasn't bored before I had finished it. Anyway, the show being a comedy, I can't remember many moments that struck me as particularly funny. I think I only managed to laugh two or three times for both seasons, and it was a half-hearted wry laugh. Seriously, I couldn't find anything FUNNY about Umaru and her relationship with her brother, but I managed to find many ANNOYING things about it. With that said, at least the show managed to squeeze some emotional response from me, be it a negative one.\\n\\n\r\n::: Overall :::\\n\\n\r\nTo wrap it up, I didn't like Himouto Umaru-chan, and was constantly pissed off at the titular character. I wouldn't recommend the show if you're looking for a good comedy. However, if you are looking to ride the hype train (which seems to be gone already at this point), I advise you to watch the anime, as it is one of those shows that spawn endless discussions (or at least memes) for a good period of time. So, if you want to have a common topic to discuss with your friends (and if you want to better understand the memes going around), this show is for you.",
            "date": "2018-01-01T19:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 267147,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/258942.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Eincaster",
                "username": "Eincaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=267147"
        },
        {
            "content": "So Himouto! Umaru-chan got a second season which was pretty surprising for me, but I have to say that the series is pretty decent and kind of enjoyable to watch. \r\nThis series is kind of enjoyable, it makes you laugh sometimes but its also kind of boring and annoying, like its predecessor. The art and story are pretty decent and nothing out of ordinary for a slice of life. The best thing about this anime is the characters, which they are pretty cute and really enjoyable to watch. For a slice of life anime is pretty good and enjoyable but somites it gets lazy andboring. \\n\\n\r\nI recommend to watch this anime if you enjoy slice of life and comedy but be bearable with the main protagonist and how enjoying she can get. I honestly enjoy this season than the first one. \\n\\n\r\n(￣ω￣)",
            "date": "2017-12-30T17:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 266918,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4977190.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thetsundereguy",
                "username": "thetsundereguy"
            },
            "url": "https://myanimelist.net/reviews.php?id=266918"
        },
        {
            "content": "It looks like there's some kind of jinx on the second seasons of popular anime. First it was New Game!! and now, Himouto! Umaru-chan. \r\nThe story continues with the daily lives of our favorite Himouto, Umaru and her friends. It's not an continuation from the first season, but more like a new series on it's own. The characters are all still in their high school and enjoying their lives, and the show tries to capture a glimpse of it.\r\nWhile the first season was a hilarious comedy, the second season tries to make it a bit more serious and fails. I am not saying that it'sall bad, but I expected better. There's less of good laughs and more of moe moments, which are bit too much irritating for me.\\n\\n\r\nThe art is good as expected and nothing much to say here. Ebina-chan sure looks cute when she blsuhes tho.\\n\\n\r\nThe anime falls a bit flat when it comes to the sound. The OP and ED are not at all good compared to the first season. I've seen better OSTs thsi season too.\\n\\n\r\nThe character is one point where the anime tries to shine. Himouto! Umaru-chan R takes all your favorite girls and shows their bonding. Kirei-chan specially has developed a lot and so has Ebina-chan when it comes to her feelings. As for others, Taihie and Umaru remains the same lovable brother and sister. Bomba sure is entertaining. As for Sylphin, I never liked her much and to add it, there's one more new character here, Hikari. I don't think I like her much, yep.\\n\\n\r\nOverall, if I had to say, I'd give this a 6. A poor score, considering how much I loved the first season and the specials, but that's it. Himouto! Umaru-chan R is as bland as it can be, with little or no laughs. Sure there is some good(?) character development, but I didn't come here for that. A dissapointment again, sadly. Sigh.\\n",
            "date": "2017-12-24T13:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 266271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5717953.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stranger_Hanyo",
                "username": "Stranger_Hanyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=266271"
        },
        {
            "content": "I found the sequel to Himouto! Umaru-chan much better than the 1st season. I found the first one just ok, however because I need anime to just binge and binge and binge while I do my hobbies like knitting, I still watched season 2. \r\nMuch better. Each episode was refreshing and a nice change of location and scene. We got to see Umaru in several other outfits and states, with more character interactions and also a better juicier plot. \r\nIt sounds contradicting for a slice-of-life to have a juicy plot, but I feel like a slice-of-life should at least be a bit more exciting andhave that productive \"it's another day!!\" vibe, cus it's a slice-of-LIFE, and we want to see someone with an exciting life, not a boring one.",
            "date": "2018-12-05T22:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 295334,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nuestren22",
                "username": "nuestren22"
            },
            "url": "https://myanimelist.net/reviews.php?id=295334"
        },
        {
            "content": "Himouto! Umaru-chan, an anime about a Mary Sue and how she abuses her brother to get what she wants. This may not seem like a good story for an anime but hear me out, this anime is hilarious!\r\nUmaru Doma is a girl that's popular in school, she has good grades and friends, however, when she comes home, she turns into a lazy monster, a spoiled brat who gets everything from her brother. This is the second season of Umaru causing chaos and while I enjoy both I think the second season does a better job with the characters, especially Umaru. The second season doesn't domuch to change the story but it does have little side stories like Umaru's childhood friend Ebina trying to express her feelings to her crush, which adds to the comedy. \\n\\n\r\nIf you want a good comedy I would suggest watching Himouto! Umaru-chan and the second season, but I'll admit that this series isn't for everybody. If you don't mind a little sister being mean to her older brother for a couple episodes then I think you would enjoy Umaru-chan",
            "date": "2018-08-17T08:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 286691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5989277.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DvaWinkyFace",
                "username": "DvaWinkyFace"
            },
            "url": "https://myanimelist.net/reviews.php?id=286691"
        },
        {
            "content": "I wrote a review for this season, but it was too long since I was mostly venting my frustrations. Instead of talking about specifics, I'll just directly point out the main reason why this season was unbearable:\r\nThe brother main character keeps to himself the location and phone number of a brother of one of Umaru's friends, and they've said they've been looking for the whereabouts of that brother for 10 years. The brother MC notices the brother has the same last name as her, has the same hairband as her, acts like her... but doesn't bother simply asking that brother if he was relatedto her or not. Why you may ask? They never explain why. Which makes the brother MC an inconsiderate dumbass, and any shipping with Umaru's friend feel infuriating, when I was happily routing for them the first season.\\n\\n\r\nThis season has less funny moments, and more emotional ones, and the emotional ones never lead to any gratifying conclusions. This season tried to shove too much generic, uninteresting friendship sentimentality instead of fun times with Umaru in her room.\\n\\n\r\nThis show does not deserve our affection. I liked this show cause it was funny, but if you really want to give me all these emotional moments and have me genuinely like these characters, then no. Umaru is unlikable since she keeps these identities secret from her friends, purple-hair friend is unlikable since she's always spiteful to those around her, blue-hair girl is generic in how happy-go-lucky she always is, and the brother MC, as mentioned before, IS A DUMBASS.\\n\\n\r\nRed-hair girl was this show's saving grace for me, but since they keep shoehorning the romance between her and an idiot, it becomes unbearable.\\n\\n\r\nLess funny, more generic, unsatisfying, uninteresting slice of life bullsh*t. If you want this type of comedy with great characters, just skip this season and watch Lucky Star.",
            "date": "2018-03-28T19:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 275526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6384970.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheMAM",
                "username": "TheMAM"
            },
            "url": "https://myanimelist.net/reviews.php?id=275526"
        },
        {
            "content": "When I watched the first episode of first season this anime turned out to be my number one anime. I watched the first season again-again every weekend after the hard work. I was so happy when they announced the second season. So let see my short review about this.\r\nI am happy because they didn't change the settings (same place, same soundtrack, same design), just new Himouto-s. Or at least I hoped for it. In the first season we already got to know how Himouto is our Umaru, and I thought there will be new ways to show this kind of lifestyle. This season concentrated aboutthe minor characters what I like very much (as a video gamer I always sorry about in a narrative video game that we can't get to know better these kind of characters), however it lacks of funny moments and that's why I rewatched the first season all the time because of these Himouto moments which are missing now.\\n\\n\r\nThe one thing is that I dislike, or I mean the one I dislike in the season is the character of Hikari. She was very annoying and useless character, I see her as a lame or wannabe Himouto. After I saw her for the third time I couldn't stand it anymore and skipped those scenes with her in it.\\n\\n\r\nHowever I hope they will continue this anime because I still love it (see the romance of Ebina and Taihei, the progress of Kirie). So yeah it was a little bit of downside from the first season, but you will like this one too ;)",
            "date": "2018-01-26T05:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 269692,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6581223.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FaithXIII",
                "username": "FaithXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=269692"
        },
        {
            "content": "Himouto! Umaru-chan R is showing more dimensions to itself than the first season did...in a good way.\r\nOk, so as a person who was highly skeptical about the first season and the major problem/dilemma of the main protagonist Umaru Doma voiced by Aimi Tanaka and her \"himouto-ness\" and oddly by the end of the first season LA warmed up to it, LA wondered if this second season that appeared ut of nowhere will stick the same old scthick or try some different. It tried something different.\r\nFor sure, the Himouto-ness of this second season is still there with Umaru being her usual self and all with oneactual obstacle in the way but that a bit later. The actual improvement of this second season comes to the form of the character development and fleshing out of Umaru's friend circle of Kirie, Ebina and Sylphinford along with ALL their family members and LA does mean ALL. Kirie by FAR gets the majority of the stage presences in this season and though LA didn't like Kirie from the first season being the highly reserved and shy character she definitely opened up this season by interacting with nearly EVERY single character even outside of her click. Ebina gets into a bit to her older brother which sets out Ebina's twice shy romance with Taihei with the help of Kirie. Sylphinford gets some again in the form of her family members along with her usual antics with UMR and Umaru.\\n\\n\r\nNow for that obstacle Umaru faces, it's in the form of another little sister archetype Hikari Kongou voiced by Inori Minase vying for Taihei's attention for some reason and this obviously annoys Umaru to no end wanting Taihei all to herself. We do get to see who she is and what relation she has to Taihei and even though she's a rival to Umaru, she's VERY similar to Umaru personality wise (just without the himouto scthick). Which actually adds to the fact that Umaru DOES care about Taihei as a family member due to Hikari being in the picture even if many of Umaru's exploits led to some of her ulterior motives for her, Hikari acts as a good counterbalance to Umaru.\\n\\n\r\nThe animation done by Doga Kobo is expected moeness and instills the same flavour from the first season, to be expected they also did the first season. There isn't much notable things to talk about for the animation as it's pretty much the same quality from the first season.\\n\\n\r\nThe voice acting is obviously the same but like LA said about Kirie, LA obviously started to notice Kirie's voice actor Haruka Shirashi in the process and due to her character opening up, we get to see more of her range though it's the typical shy and hauntingly nervous, she does flex her vocal chops more this season. LA really likes Nana Ebina voiced by Akari Kageyama as a character even with her vocal archetype not being LA's type but she did quite well as well. Once again though some people might find her annoying but LA quite enjoyed Sylphinford's voice actor Yurina Furukawa and like from the first season injected that zany flair into this season with her opening her range as well for some of the more solemn moments of this season.\\n\\n\r\nThere isn't a doubt that Himouto! Umaru-chan R is a vast improvement from the first season for LA and sure some people might think that just because of the character development gets flesh out means as much, but considering the first season's character development was more or less showing Umaru's himoutoness and her excessive laziness bringing in that divided towards people about this anime (like LA), showing more of Umaru's friends and their developments as characters was a welcoming change that LA didn't mind that Kirie or Ebina or Sylphinford had some focus as they desperately needed it otherwise they would have turned into one-note running gag characters. \\n\\n\r\nLA didn't expected a huge change to the structure of Himouto! Umaru-chan as a series but this change was enough for LA to still stick to Himouto! Umaru-chan even with her shortcomings as a slice of life anime looking at Himouto.",
            "date": "2017-12-25T14:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 266372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=266372"
        },
        {
            "content": "\"I had fun watching Umaru.\"\r\n\r\nPros:\r\n1. Character developments\r\n2. Character backstories told\r\n3. Umaru not as annoying as in first season\r\n4. More heartwarming than first season\r\nCons:\r\n1. Not for those who doesn't like moe Slice of life anime\r\n2. Umaru still can be kinda annoying at times\r\n3. Character ships hinted, but didn't progress \r\n\r\nHimouto Umaru-chan is an anime I stumbled upon in 2015 because of how popular it was back then. As a fan of moe Slice of Life anime myself, of course I had to watch it. After watching the 1st episode, at first I didn't really like it. I didn't like Umaru's character at all. Butafter watching a few more episodes, I found out that I actually enjoyed watching this. It's cute and the as a sister Umaru-chan is very like a sister in real life, a brat that no one likes. She isn't moefied to the Sagiri level and that's what I thank this anime for. \\n\\n\r\nNow where Umaru 2nd season stood out from it's previous season was in it's characters department. We got a lot more character backstories told to us this season to make us care about them. Each backstories told was surprisingly very heartwarming. I especially like learning about the characters when they are in their childhood days. They are very cute and likable. Character developments also took place more often in this season. You get to see characters getting past their old self and revealing a new side of them. Quite entertaining. At least the characters this season aren't as cardboard as they were in the first season.\\n\\n\r\nThe OP and ED theme also stood out to me. The OP theme, if you read the lyrics, suits the anime pretty well. It's Umaru herself in the lyrics. The ED theme stirred quite a craze in Chinese Anime Streaming Site Bilibili where a lot of people are doing dance covers of it. I also found the ED to be  very catchy. The voice acting is great! The voice actors and actresses did their best to make the character feel realistic. The BGM aren't anything special, so no comment on that. \\n\\n\r\nThat's pretty much it that made the 2nd season better than the first. This is a Slice of Life anime so no story is needed. The art and animation remained what it was like in the first season, no major changes. So ya, overall, what makes the 2nd season stood out more was thanks to its characters. They were well developed and were well built up. So if you hate the first season because of the shallow characters then watch this, I heard a lot of positive reaction from people who didn't like the fist season and fellow manga readers, so don'w worry. That's it for my review. Thanks for reading. :)",
            "date": "2017-12-24T22:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 266320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=266320"
        },
        {
            "content": "Himouto! Umaru Chan, one of my favorite guilty pleasure anime. When I came across the first season, I don't know why but I was so hooked that I binged the entire thing so fast, since then I was really hoping for a sequel and I am GLAD we got this cause it is so enjoyable and just what I needed after watching some serious dark anime like Made in Abyss. \r\nI usually say for anime like this, there is really nothing much to break down, They are just made for you sit back and have a good time, but in modern anime, shows like thisare so over saturated that a lot of time you can't give them a pass, They force a bunch of bad jokes and stereotypical cuteness at your face with a bunch of lazy ass characters that makes it seem like they are just trying to sell the show using a formual instead of giving you something to have a good time, and that's why a lot of these shows that use the same formula are so painful to watch but Himouto Umaru chan is just so organic, they do use a similar formula and it has it's fair share of cliched scenes, but using that they have constructed something that is so worthwhile.\\n\\n\r\nPart of what makes Umaru chan work is how effortlessly relatable it is, you gotta admit that there is an Umaru in all of us, she is the child in us that just wants to laze around, eat junk food and have fun all day and there are so many scenes that just make you go like \"Ah, That is so me!\". \\n\\n\r\nAlso Why this show is good is this environment that is being created, it almost makes you want to go live there, that's how you know a slice of life is working. The different characters placed in this environment and the impact they have on the different personas of Umaru makes it seem like a superhero character and the interesting ways he hides his identity and reacts when he's not himself, apart from all the fun and jokes, this is the element of the show that really captivates you.\\n\\n\r\nComing to the jokes, This shit is hilarious! You gotta be super serious to think this is not funny lmao, while I would say the second season isn't nearly as funny as the first one, they make up for it by kind of really exploring the other characters which I thought was really interesting and the way they connect these characters together and create circumstances really add to the flavor of the show. One gripe I do have about this show is the pacing of it, like they would build up scenes for Christmas and then go all the way to new year. Like what's the rush man? calm down gahdamn. \\n\\n\r\nNothing much to say about the Art and Music, I usually skip the OP and ED. The background music does it's job but it's nothing to talk about, the Animation is cool, It is pretty consistent throughout and gives you that laid back and jolly feel so I will give them credit for that, The true magic is the voice acting, Hats off to the voice actors, they don't sound cute or funny just to be that, they deliver the jokes in a way that makes it feel genuine and 10 times funnier than it should be. \\n\\n\r\nOverall man this was a great season and I am really hoping for the announcement of a 3rd one, This is one of those shows you wish never end. Himuto Umaru chan is a very rare show that has mastered being flawed and formulaic and yet remain extremely entertaining. \\n\\n\r\n7.25-7.5/10\\n\\n\r\nJust give me more, please.",
            "date": "2017-12-24T12:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 266260,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tigermaskshinobi",
                "username": "tigermaskshinobi"
            },
            "url": "https://myanimelist.net/reviews.php?id=266260"
        },
        {
            "content": "The first ever girl who can change her height! (Not using magic of course)\r\nHimouto, as I heard, is a combination of hikikomori and imouto. From only the title, I knew that what I would see is a comedy, slice of life anime about a little sister who nail herself at home, also cause endless troubles to her brother. But so far, Umaru-chan has shown me the kindness I’ve never thought about.  \r\nReceptive and Unique; those two adjectives is the best way to describe ss1. But at some last episodes, UMR-R makes me feel like I am watching a harem rom-com series disguises as aslice of life anime.  I don’t intend to offense because this is one of my favorite slice of life anime. Not only has a fancy idea, it also has close bro-sis’s relationship, which hits right on my style.     \\n\\n\r\nFor those who never watch ss1, I highly recommend that for you. I also mention about both seasons in this review. It’s the only way for me to describe this anime fully.\\n\\n\\n\r\nStory:\\n\r\nEveryone has their dark side that doesn’t want to be explored. Worse, though, no one can accept that or doesn’t get away from you. And about our main character: Umaru-chan, a student girl always has a high academic achievement, a definition of perfection, has lots of respect at school, turn out to be a lazy ‘hamster’ chibi at home. The one who knows both of these characteristics, and surprisingly doesn’t tell anyone about this secret, is her reliable onii-chan. \\n\\n\r\nIn front of each person, she has different characteristic to show. Until now, there are 3 sides of her and I’ve no idea why she has to hide her true identity, also her past, too. Anyway, everybody fall in love with it, even with annoying actions.\\n\\n\r\nRomance has been focused more in ss2, but not too much to dim the slice of life part. If it has anything I’m not happy about, like I said before, is harem situation beginning to develop. Other than that, UMR has lively moments and bland relationships.\\n\\n\\n\r\nCharacters / Art / Sounds:\\n\\n\r\nAdorable characters\\n\\n\r\nWith the development of each character grows smoothly, they’re all express emotions and acts fit with their easily recognized characteristics. When talk about it, in ss2, Kirie-chan isn’t longer too shy; a dynamic Tachibana has shown her deep and thought that surprising me; the sight of Doma x Ebina love story; and still a beloved himouto umaru-chan from ss1, even Doma said that he could feel the changes of her. With the attendance of more supporting characters, the story still has a lot of things to blush. \\n\\n\r\nNothing too much special about art and sounds effect. I can say it fits well with the characters for every side, and it’s quite similar to the manga’s art, also cute chibi. Love Tachibana’s voice and exciting ED.\\n\\n\\n\r\nEnjoyment:\\n\r\nAn easy to watch anime and beloved characters. I also checked for the manga right after watching all episodes, also asking myself why this hasn’t gone viral, but different people have different thought, so I got it quickly. \\n\\n\r\nAnyway, this is worth giving it a try, just like me when I first saw it. Let’s have a cute, funny time with Himouto Umaru-chan and friends.  \\n\\n\\n",
            "date": "2018-03-31T10:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 275888,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6677450.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/0hht0",
                "username": "0hht0"
            },
            "url": "https://myanimelist.net/reviews.php?id=275888"
        },
        {
            "content": "There's many anime out there that try to replicate a sense of humor without the 'humor' part. Umaru-chan R does the complete opposite and delivers on a boisterous show, with controlled humor that settles nicely.\r\nComing from the first season I must admit that Umaru-chan R does it justice. There's improved character development, more humor, and much better music than the first go. But what is the basis? Well basically we follow Umaru through her lazy lie of a life from where we left off in the first season, but just with more development and a subtle 'serious' tone that knocks on the door every nowand then. \\n\\n\r\nNow I say character development but very nonchalantly. Yes, the characters do feel more \"alive\" than the first time, but we still have Ebina-chan being her usual moe character. And Umaru, being lazy. But there are points when we do learn more about one character here or there, and honestly it all melds together nicely.\\n\\n\r\nI said before that I enjoy the music in this season more than the last, and it's no lie. I really adore the outro/intro(s) of this season, they feel more genuine and don't sound as generic as the last. The art is well done, but nothing special. Although I must admit that it has some nice eye-candy moments, but it's very few and far between.\\n\\n\r\nOverall I really do like this season more, and hate to see it over already. Hopefully a third installment is made sometime in the future, but it seems like there's a possibility of that happening based on the ending. I recommend you watch this only if you enjoy some moe-tropes and a lot of (sometimes) cheesy humor; oh and a nice OP and stuff.",
            "date": "2018-02-06T20:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 270873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=270873"
        },
        {
            "content": "This is an anime that is best watched to calm down. The anime is calm , the characters are whimsical and it never takes itself too seriously neither does it suddenly forces something serious on us.\r\nThe story is calm and just tells the story about a perfect girl who is a lazy brat in the background and how people meet and talk with her. Slowly we see her making friends and honestly through her own personality bring changes on the lives of people she meets through her kindness or innocence. It's a light hearted cartoon. The most \"serious\" theme it gets close to is howtime changes but even that is never too serious. The charecters simplicity also compliments this style.\\n\\n\r\nThe characters , though they have their own struggle , the struggles are simple. Some deal with shyness , Some deal with inability to make friends while others just deal with social anxiety.Initially the charecter sometime might come across as too simple but it's not too bad. By the end i honestly had grown attached to all the characters and their simple nature.\\n\\n\r\nI would genuinely say watch this anime. Watch this to see something light hearted and simple. We have enough troubles in our lives so you might as well just calm down.",
            "date": "2018-02-04T21:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 270689,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/restlesssheep",
                "username": "restlesssheep"
            },
            "url": "https://myanimelist.net/reviews.php?id=270689"
        }
    ],
    [
        {
            "content": "Himouto! Umaru-chan's second season could be one of the more underappreciated comedies out there.\r\nIt's safe to assume anyone who's considering picking up this anime has already seen the first season. My biggest gripe with the first season of Umaru was that the character herself was, for lack of a better word, a complete cunt. Even though her brashness gave the anime its spirit, the second season does a much better balancing act with the many faces of Umaru. The rest of the characters are as entertaining as ever. I certainly wouldn't have made it through the first season if it wasn't for Ebina and Kirie,for example. Himouto!'s second season truly earns a perfect rating in the character department.\\n\\n\r\nPeople love to diss any type of series for lack of development, and this was especially true for the first first season. Does the second season do anything to remedy this? You could say the show ends the same way it started, but some things undoubtedly changed along the way.\\n\\n\r\nWhile the first season introduced us to these characters, the second season is much more focused on exploring their friendships and group dynamics. It was quite rewarding to finally see these lovely people properly hitting it off and bonding together. I was especially surprised by the change in the overall tone, as for every goofy scene there seemed to be an equal amount of emotional ones. In particular the feeling of nostalgia was heavily explored. The 2nd season made me feel a range of emotions. The end result was as tasty as eating chips and chocolate with the occasional sip of cola.\\n\\n\r\nOn the flipside these emotional moments never truly lead us anywhere. The story of Himouto! (if there is one) is fractured and all we get are random everyday events. The scenes are usually loosely connected, but never in a meaningful way. This kind of structure is natural for a comedy, but it certainly doesn't let the series tap into the full potential of the more serious moments of Himouto!. Still, this could change by the end of the series, which is why I'm definitely keeping an eye on possible continuation.\\n\\n\r\nOverall, Himouto!'s second season was a very refreshing take on comedy. If you enjoyed the first season you should definitely check out this one as well, as it has all the strengths and less weaknesses. The characters are better realized and still extremely endearing. They even gave us a banging ED, so go check it out.",
            "date": "2017-12-24T16:55:00+00:00",
            "helpful_count": 35,
            "mal_id": 266287,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4243495.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Tiemuuu",
                "username": "Tiemuuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=266287"
        },
        {
            "content": "Umaru is one of those series whose main problem lies in having a premise that appeals to a target demographic (that of older teenagers and young adults) but is actually most enjoyed by another (young parents and siblings with bigger age gaps).\r\nI am actually impressed at how much I ended up liking this series despite having low expectations and reading some of the reviews of the original series. While not always having laugh out loud moments, each episode delivered and I always ended up with a heartfelt smile.\r\n*Semi-spoilers and Personal Analysis*\r\nMany people describe Umaru as bratty and annoying, but upon closer inspection I believe sheis actually trying to make up for a strict and perhaps unhappy childhood. While it is never actually stated, we see some hints here and there that the siblings parents are not actually engaged in their children's lives, meaning that they are either dead (in case of the mother) or uninterested in them (in case of the father).\\n\\n\r\nWe know from the first season that Umaru only actually developed his 'indoor' persona after a year of living with her older brother, and while we do see her throwing tantrums with some of her friends she doesn't really act in a mean way other than with her brother. Even then she is shown to express guilt when pushing things too far and feelings of loneliness whenever he is not around. To me this is actually a sign of the deep emotional attachment she has to him as well as her emotional development. \\n\\n\r\nYou see child prodigies with strict childhoods tend to develop child-like traits later in life. Add to this the fact that their age difference is 10 years, and it is clear that the relationship they have is not of siblings but that of a parent/child. Some examples in Taihei's commitment to cooking so that Umaru can eat healthy food, teaching her responsibility while playing an addicting game, and being strict when he really needs to. \\n\\n\r\nYoung parents should relate to this 'look at me' attitude of small children and I think this is what will make this series enjoyable for them. For the rest of the cast I also enjoyed the teams of social developments, such as Kirie dealing with social anxiety, Sylphyn 'be loud to make friends' attitude and Ebina's awkwardness at being a country girl living in the city.",
            "date": "2017-12-25T19:10:00+00:00",
            "helpful_count": 20,
            "mal_id": 266394,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6830299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/RogueChilli",
                "username": "RogueChilli"
            },
            "url": "https://myanimelist.net/reviews.php?id=266394"
        },
        {
            "content": "PLOT: Season 2 continues off with the momentum! This time, Umaru decides to take a leap of faith & be more outgoing with her friends. Her adventures gets more interesting with the encounters they deal with in every episode. Not a lot has changed to be honest...\r\nCHARACTERS:\r\nUmaru: Sweet, kind, funny, adorable, cute, lazy, intelligent & a total foodie. She still loves video games and anime. Surprisingly, I'm still impressed on how she can have so many personalities while her friends noticing & still maintain good grades.\r\nTaihei: Caregiver & older brother of Umaru. He's responsible & does a lot of cooking in the house. We getto see him with his friends at work more this season.\\n\r\nSlyphin: Umaru's rival & UMR's friend, she loves Japanese culture & is very competitive. She is also very kind & caring when it comes to her family & friends.\\n\r\nEbina: Umaru's friend & neighbour, still shy & adorable, but has growing feelings for Umaru's brother.\\n\r\nKirie: Umaru's friend & (technically) Chibi Umaru's Master lol, she's kind & caring too but at times can have a bit of an intimidating look. She is an aspiring artist & has a complicated love-hate relationship with her older brother.\\n\\n\r\nOVERALL: Even though not all has happened this season... It is still a fun anime to watch. Umaru is still adorable where a lot of us can relate to her, her personality & mannerisms. I just hope one day she can reveal her identity as UMR & her himouto (chibi-self).",
            "date": "2017-12-24T13:18:00+00:00",
            "helpful_count": 11,
            "mal_id": 266266,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=266266"
        },
        {
            "content": "This is my first ever review on an anime show. Here we go! `(^.^)´\r\nWhen I read that there would be a sequel to Umaru-chan I felt very happy and excited. Now I could look forward to meeting the characters again and hopefully get to know more about Umaru-chan and all the others in the upcoming sequel. Though I was a bit worried about how this show would be different to the first one, my worries was blown away after finishing Himouto! Umaru-chan R. \r\nI can gladly tell you that this show was even better than the first one!\r\nIf you are looking for something easy andlight to watch, with a dash of humor in it, this is hopefully what you are looking for. The art is very good, I have nothing to complain or point out about it. The only thing that I wish this show would have is a stronger story. I love the simplicity of Himouto! Umaru-chan R, but I think it could have been even better if the studio went deeper into exploring some of the main plots. Now they are only scratching on the surface and it annoys me a little. I want to know more.\\n\\n\r\nTo put it simple, this is a show for those who wants a light hearted, enjoyable, sometimes hilarious slice-of-life show. For me, the main thing about this show is the developing of the characters who I came to like very deeply and identify with.\\n\\n\r\nI hope we will be re-united with Umaru-chan and all her friends soon, and I also hope this review was helpful for someone.",
            "date": "2018-01-05T07:45:00+00:00",
            "helpful_count": 9,
            "mal_id": 267495,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5702918.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/monokerus",
                "username": "monokerus"
            },
            "url": "https://myanimelist.net/reviews.php?id=267495"
        },
        {
            "content": "This looks more like a reboot to me, except with one upside—more goofier than the first season. Umaru-chan herself is starting to realize her laziness, and the other characters—they feel more characterized than before.\r\nDon't expect new characters—it's the same thing, except twice as better. We get more screentime for the side characters (like Sylphynford's brother) and more relaxing scenes. We get to see more of UMR, and we get to see Taihei and Ebina-chan together.\r\nThe art style is the same thing as it was before, and the sound is also the same thing as it was before. I liked the opening and ending songs morethan the previous one, though.\\n\\n\r\nUmaru's laziness is still there, except twice as lazy (and twice as hate and murderous intent I want towards her loli side).\\n\\n\r\nMy overall enjoyment for this show is great, it's because it's greater and have more fun than the first season. This is a good anime to watch when you're bored, if you don't have any problems with Umaru, that is.\\n\\n\r\nIt's okay to watch the first season, because I think this isn't a second season at all—more like a reboot.",
            "date": "2017-10-31T04:36:00+00:00",
            "helpful_count": 8,
            "mal_id": 262190,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6639776.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CloroSphere",
                "username": "CloroSphere"
            },
            "url": "https://myanimelist.net/reviews.php?id=262190"
        },
        {
            "content": "Umaru Doma is back to wreck your hideous lives again with the much anticipated sequel! Well, it's more or less the continuation or reboot of the series from its manga counterpart.\r\nSo let's continue the trend with Himouto! Umaru-chan R! \r\nThe usual gang is back with Umaru becoming more daring,\r\nher brother Taihei inviting his friends into the fray (and constantly getting annoyed by Umaru at all times),\r\nEbina who still harbours feelings for Taihei although she doesn't have any courage and cringes at his presence,\r\nKirie still adoring Umaru as her Master when it comes to drawing,\r\nAnd of course Sylphin shubafeen!!!~~ with the rival and friend to UMR,a foreign introduced to Japanese culture and always wanting to look good to them.\\n\\n\r\nThe formula for this show hasn't changed a fair bit since Season 1 back in 2015, but this year Doga Kobo made it so it encompasses the relations between our loveable main characters since the entry was a fair bit paltry to understand Umaru-chan and her world at the very start. Granted, I am keen on watching Season 1 now, but that's not saying much.\\n\\n\r\nThe one thing I know got an upgrade is definitely by seeing and hearing this show's rendition. As expected of Doga Kobo, the art is somewhat unchanged and remain the same as the first season and animation-wise is also a copy-and-paste function. So the seeing part? Not much change if episodic comedy is your thing.\\n\\n\r\nBut when it comes to the OST, expect a good one, because the OP feels happening and rightfully so, where the ED is an exercising song that will make you wanna follow dance to their tune. So, a good area, checked out!\\n\\n\r\nOverall, if you're a fan of the first season, this second season is all you want and more.",
            "date": "2017-12-25T17:34:00+00:00",
            "helpful_count": 5,
            "mal_id": 266386,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=266386"
        },
        {
            "content": "How the days go fast indeed, not only in the show, where 12 episodes cover a whole year,s but only in real world, where 12 episodes felt like a lightning flash, something about this show that really distinguished is from any other, even the first season feels like a stranger in comparison, your favorite references are still present, the wholesome jokes is as lively as ever too, but what's the real new thing is “actual plot”, not going to lie, the first season, was so vague, pointless stuff occurring in a typical slice of life comedy anime, but this one has a strange addition, youcan really feel a progression in the story, the characters are doing something for once, they are developing as times goes by.\\n\\n\r\n- Story (7.8/10):\\n\r\n12 episodes that follow the life of a slacker, Umaru-chan, the perfect girl in the eyes of many along with her brother Taihei, while interacting like they siblings they are, they make some changes to the people surrounding them, they influence them to improve, to change their personalities, and enhance their treats, like for example with the shy unpopular Ebina, who gains confidence, and the lonely Kirie-chan who wins friends she can depend on, from time to time, there are those little glimpses of few character's flashbacks that really help clear things out, and desyphers the way they are. It's really satisfying how they dug up their past, only to make them seem connected somehow.\\n\\n\r\n- Art (8/10):\\n\r\nI haven't noticed any differences between this animation, and that of the first season, both are great and colorful, very lively and wholesome, ever wondered how could a drawing be wholesome? Here it is, how the characters are drawn, how the backgrounds blend so well with the atmosphere and everything, something that this anime does so well, is the representation of food, yes you heard me right, food looks so much more appealing in anime and manga, but in this particular show, it's done so well that it makes you believe it was done by purpose, and that's just one example.\\n\\n\r\n- Sound (8/10):\\n\r\nI can't think of a better fitting score for this, just like the first season, the same wholesome tracks play all the time, nothing new, or at least that's what I think, I really like the opening, it was one of those openings that are really odd and unlikable at the beginning,but I really grew to love it, and the same can be said about the ending song.\\n\\n\r\n- Character (7.8/10):\\n\r\nYour same old characters, but less annoying (yes, looking at you Sylphinford freaking Tachibana), and more likable, like Kirie-chan, what really helped raise the quality of the characters is the way they developed into the best, Bomber and Alex got some more screentime, and so did Kanau, I thought that was great, there were few other characters introduced, like family members, some of them were really interesting, but some of them were just not welcomed, of at least that's how I felt when I first saw Hikari.\\n\\n\r\n- Enjoyment (8.5/10):\\n\r\nOne might argue that this anime is just a waste of your precious time, a waste of resources and energy, it has no story for it, nothing at all, BUT, this second season, looked much more dynamic, it felt like the studio learned from their mistakes, and improved upon them, I really enjoyed every bit of this anime.\\n\\n\r\n- Overall (8.02/10):\\n\r\nYes, the decimal precision matters in the score.\\n\r\nWould I recommend this anime? It certainly is not for everyone, most the people who watched enough anime, read enough manga would grasp those little hints and references about other works, it true comedy in the show for me, lays there.",
            "date": "2018-02-17T03:09:00+00:00",
            "helpful_count": 4,
            "mal_id": 271719,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5898843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Eoussama",
                "username": "Eoussama"
            },
            "url": "https://myanimelist.net/reviews.php?id=271719"
        },
        {
            "content": "This is a comprehensive review of both Season One and Season Two.\r\nHimouto Umaru-chan was an anime I downloaded some time ago, for I was swayed by the hype (and the memes) surrounding its titular character, and one I was deliberately putting off from watching for quite a long time. I knew I wasn’t going to like it, yet in the end, I had no choice but to see it as I was running low on space on my HDD and had to delete something. You can see from my score that I didn’t like it quite much (as I had expected). After I finished watchingthe second season, I was torn between giving it a 5 or a 6. In the end, I gave it a 6 because I appreciated the animation, and the sound wasn’t half bad. Were it for the characters and plot alone, the show wouldn't have gotten anything above a 4.\\n\\n\r\n::: Story :::\\n\\n\r\nThe story of Himouto Umaru-chan is repetitive at best. When it comes to plot, it is nonexistent. Or maybe it was me who couldn't grasp it. Yet, after going over the other reviews, I came to realize that most of the negative ones come from people with the same opinion as me. One can argue the plot is about the titular character, Umaru, overcoming her inner identity and revealing it to her friends. However, this never happens in the course of the series (I haven't read the manga). There is even one episode (the second one of the Specials), where the revelation of her secret identity is teased, but the episode ends rather anticlimactically and this revelation never happens, as Kirie stops Umaru just when she is about to tell them. Talk about convenient.\\n\\n\r\n::: Art :::\\n\\n\r\nI have to admit that the art of this show was decent, to say the least. It wasn't anything groundbreaking, mind you, but it wasn't disastrous either. The colors were vivid and the animation was smooth for the most of the show, and I didn't even see the Blu-Rays - just the regular TV release. The art isn't getting more than a 7 though, because the character designs weren't anything original and memorable, except maybe Umaru's inner self, although I understand they were probably trying to stick to the original manga art.\\n\\n\r\n::: Sound :::\\n\\n\r\nUsually, when it comes to sound in an anime, I can only think of songs (OP/ED songs, insert songs, maybe some soundtrack). I don't know how people judge VAs in anime. I can't. I mean, when it comes to this show, I didn't find any of the voices grating or sounding out of character, but that's it. I don't even know what a voice must be to sound out of character. When it comes to the songs and the soundtrack though, I have an opinion. Generally, the OP songs of both seasons were annoying at best. They were both sung by Umaru's VA and described how much Umaru likes to lounge around, eat junk food, and exploit her brother. Yeah, I'm not kidding here. The EDs, especially the first season's, were okayish. Nothing spectacular or eargasmic again. Yet, the 6 goes for the soundtrack, as there was one particular score I really liked.\\n\\n\r\n::: Character :::\\n\\n\r\nI think it's fair to say the characters were this show's worst aspect. I could put up with everything else, from the repetitive story to the annoying songs. Yet, the characters were what made the experience unbearable for me. I'm writing this review mostly to express my utter disdain for them. Well, mostly for Umaru. Honestly, after all the anime shows I've seen in my life, I've never before come across such an irritating character. My irritation grows even further when I see that many people actually liked her and even RELATED to her! I mean, WHAT?! How can someone such as Umaru be relatable in any bloody way?\\n\\n\r\nThe thing about Umaru is that she is sporting two different identities that, when combined, make her the most irritating person in the whole world, anime character or not.\\n\\n\r\nWhen Umaru goes out, she is a model student with perfect grades (always gets 100 on tests), outstanding at all kinds of sports (she can beat the captains of all school sport clubs), and with fine manners (she is generous and kind, and simply the perfect human being when it comes to personality). Not only that but she is so exceptionally beautiful and perfect that all boys swoon over her and all girls admire her and want to be her friends. \\n\\n\r\nHowever, when she goes home, she dons her favorite hamster hood and transforms (yes, and no one but her brother can recognize her) into a 40-centimeter-tall orange blob of a sluggard, who doesn't do anything but watch anime, read manga, play games, eat junk food, and drink cola. A lot of cola. And this continues for the rest of the day before she goes to sleep. If you think I'm exaggerating, go watch the show and see for yourself. \\n\\n\r\nThe thing is, her outer and her inner self are in total discord. For instance, I don't understand how a person can constantly lounge around, eat junk food and not gain any weight. Umaru doesn't only not gain any weight - no, she has the most perfect body of all girls her age. Not only that but she is exceptional in sports. I mean, seriously?\\n\\n\r\nAfter watching the show, I did my research and found out that Japanese students spend at least two hours per weekday on homework, and even three hours on Sundays. Yeah, right. Throughout the show, I didn't see Umaru study for her classes at all (except that one time before the finals), let alone do her homework. From the OP of the second season it becomes somewhat clear that her brother Taihei is doing her homework, but when I thought about it, it didn't click together entirely. Because what about when Taihei works overtime and comes home late at night and is so exhausted that he goes to sleep right away? Or when he goes on business trips and doesn't come home for days? It would mean Umaru goes to school without homework. And she still maintains perfect grades. Right. You know what, if I go to school without having done my homework even one time, I'll get a straight F. No excuses. No compromises.\\n\\n\r\nHowever, what irritates me the most about Umaru is her childish personality. The spoiled brat would cry for trifles, and would always get whatever she wants by crying and throwing tantrums. Honestly, every time I saw her rolling on the floor and crying because she wanted a particular game or magazine, I wanted to turn into an anime character, get into the show, and kick her snotty ass out the window. And the worst part of her character is that she never changes. Yes, she makes a few friends throughout the show, but she never musters the courage to tell them about her inner self. So in the end, her story becomes pointless and never teaches you anything (except maybe that it's fine to pretend to be who you are not, and then to be a total drone when no one sees you). \\n\\n\r\nWhich brings me to the other main character I didn't like - Umaru's brother, Taihei. It seems the trend in modern anime is for the male characters to lack backbone. Throughout the whole series, I just wished for Taihei to man up and give a good lesson to his younger sister. However, instead of doing it, he kept on spoiling her. He would buy her anything she wanted, from games and anime DVDs to a new car! Yes, in the first season, Umaru saw a commercial for a car, told Taihei she wanted it, and he immediately agreed to buy it. And if it weren't for Taihei's fear of driving, he would have actually purchased it. Just so Umaru can use it to lounge in the backseat. Because that's why she wanted the car in the first place.\\n\\n\r\nSome people may argue with me and say that Taihei loves Umaru and that's why he spoils her. Well, guess what! Spoiling a child out of love is the worst thing a parent (or an older sibling in this case) can do. If the child never learns to accept failure and denial, what is their life going to be when they grow up and have to live on their own? I mean, Umaru isn't planning to always live with her brother and rely on him for everything, is she? That would be pretty savage of her. But knowing her, I wouldn't be surprised if that's what she is thinking.\\n\\n\r\nIf it weren't for his backbonelessness and inability to stand up for himself, Taihei would have been a likable character. He is smart, and we even see some of his backstory at school, where he was a model student with perfect grades. However, unlike Umaru, he actually spent his days studying to be on top of his class so that he didn't do anything else and didn't nurture any hobbies of his own. And he wasn't admired for being the most handsome boy. On the contrary, he had average looks.\\n\\n\r\nNow, I'm in no way saying that having average looks is crucial for a character to be relatable. However, what is crucial is for the character to make sense. We never learn about Taihei's lifestyle out of school, so I can't say for certain that it fully corresponds to his looks, but judging by his obsession with studying, he couldn't have had a lot of time to think about his appearance. However, Umaru deliberately doesn't care about her appearance and at the same time she looks stunning. Moreover, she doesn't study at all, but still somehow is the top-grade student at school. This is what doesn't make sense and makes her an annoying character. I mean, if such a person existed in real life, they would live without a single care in the world and would be always happy and contented with their life. Therefore, such person shall not exist.\\n\\n\r\nAnyway, moving on to the rest of the cast, I can only say they were as bland and unimaginative as any character in a low-profit anime these days - cardboard cut-outs sporting stereotypical personalities (although, as far as I know, the show did well in sales). They contributed to nothing and had no goals of their own except for befriending Umaru. Yeah, that's right. Both Sylphin's and Kirie's objectives in the anime were to befriend Umaru (Kirie even wanted to protect her, wtf?). Kirie actually had a goal of her own, but she barely pursued it in the show and it still involved (surprise!) Umaru. Both Kirie's and Sylphin's brothers were stereotypical characters as well, although they got so little screen time I even forgot to mention them at first.\\n\\n\r\nEbina was maybe the most realistic character in the anime, but she was extremely downplayed and turned into a stuttering laughingstock so that even when she had good moments in the show, they weren't able to erase the damage her character had already taken. For example, near the end of season two, we learn that Ebina's bad grades come from her panicking during tests and being unable to concentrate. Once she managed to get rid of her panic, her grades majorly improved. However, since this happened almost at the end of season two, her one instance of being smart wasn't able to make up for the shame of a dumbhead she had been before. Yet, since she wasn't constantly fixated on Umaru, I would say she had some charm that made her tolerable for me.\\n\\n\r\nThe show even introduced another character in the middle of the second season - Hikari. Honestly, when I first saw her, I thought she would be a very good character - a formidable opponent for everything Umaru was. However, being introduced so late in the show, she barely had any screen time and when she did, she was mostly doing one and the same thing - trying to claim Taihei for herself (she even called him 'Onii-chan'). Her lack of screen time really disappointed me and I hope the studio releases a third season where Hikari's character is better explored. But please, don't make her lose to Umaru in any way. PLEASE!\\n\\n\r\n::: Enjoyment :::\\n\\n\r\nAfter my ranting about the characters, I think it's time I continue with the next part of this review. All in all, I didn't enjoy this anime, and Umaru was the primary reason for this. However, I can't deny the fact that I marathoned the series in one night (as I always do with 1-cour shows), and was almost unable to feel the time that had passed. This means the show didn't drag on and although the story was repetitive, each episode had enough stuff going on so that I wasn't bored before I had finished it. Anyway, the show being a comedy, I can't remember many moments that struck me as particularly funny. I think I only managed to laugh two or three times for both seasons, and it was a half-hearted wry laugh. Seriously, I couldn't find anything FUNNY about Umaru and her relationship with her brother, but I managed to find many ANNOYING things about it. With that said, at least the show managed to squeeze some emotional response from me, be it a negative one.\\n\\n\r\n::: Overall :::\\n\\n\r\nTo wrap it up, I didn't like Himouto Umaru-chan, and was constantly pissed off at the titular character. I wouldn't recommend the show if you're looking for a good comedy. However, if you are looking to ride the hype train (which seems to be gone already at this point), I advise you to watch the anime, as it is one of those shows that spawn endless discussions (or at least memes) for a good period of time. So, if you want to have a common topic to discuss with your friends (and if you want to better understand the memes going around), this show is for you.",
            "date": "2018-01-01T19:45:00+00:00",
            "helpful_count": 4,
            "mal_id": 267147,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/258942.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Eincaster",
                "username": "Eincaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=267147"
        },
        {
            "content": "So Himouto! Umaru-chan got a second season which was pretty surprising for me, but I have to say that the series is pretty decent and kind of enjoyable to watch. \r\nThis series is kind of enjoyable, it makes you laugh sometimes but its also kind of boring and annoying, like its predecessor. The art and story are pretty decent and nothing out of ordinary for a slice of life. The best thing about this anime is the characters, which they are pretty cute and really enjoyable to watch. For a slice of life anime is pretty good and enjoyable but somites it gets lazy andboring. \\n\\n\r\nI recommend to watch this anime if you enjoy slice of life and comedy but be bearable with the main protagonist and how enjoying she can get. I honestly enjoy this season than the first one. \\n\\n\r\n(￣ω￣)",
            "date": "2017-12-30T17:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 266918,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4977190.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/thetsundereguy",
                "username": "thetsundereguy"
            },
            "url": "https://myanimelist.net/reviews.php?id=266918"
        },
        {
            "content": "It looks like there's some kind of jinx on the second seasons of popular anime. First it was New Game!! and now, Himouto! Umaru-chan. \r\nThe story continues with the daily lives of our favorite Himouto, Umaru and her friends. It's not an continuation from the first season, but more like a new series on it's own. The characters are all still in their high school and enjoying their lives, and the show tries to capture a glimpse of it.\r\nWhile the first season was a hilarious comedy, the second season tries to make it a bit more serious and fails. I am not saying that it'sall bad, but I expected better. There's less of good laughs and more of moe moments, which are bit too much irritating for me.\\n\\n\r\nThe art is good as expected and nothing much to say here. Ebina-chan sure looks cute when she blsuhes tho.\\n\\n\r\nThe anime falls a bit flat when it comes to the sound. The OP and ED are not at all good compared to the first season. I've seen better OSTs thsi season too.\\n\\n\r\nThe character is one point where the anime tries to shine. Himouto! Umaru-chan R takes all your favorite girls and shows their bonding. Kirei-chan specially has developed a lot and so has Ebina-chan when it comes to her feelings. As for others, Taihie and Umaru remains the same lovable brother and sister. Bomba sure is entertaining. As for Sylphin, I never liked her much and to add it, there's one more new character here, Hikari. I don't think I like her much, yep.\\n\\n\r\nOverall, if I had to say, I'd give this a 6. A poor score, considering how much I loved the first season and the specials, but that's it. Himouto! Umaru-chan R is as bland as it can be, with little or no laughs. Sure there is some good(?) character development, but I didn't come here for that. A dissapointment again, sadly. Sigh.\\n",
            "date": "2017-12-24T13:44:00+00:00",
            "helpful_count": 3,
            "mal_id": 266271,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5717953.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Stranger_Hanyo",
                "username": "Stranger_Hanyo"
            },
            "url": "https://myanimelist.net/reviews.php?id=266271"
        },
        {
            "content": "I found the sequel to Himouto! Umaru-chan much better than the 1st season. I found the first one just ok, however because I need anime to just binge and binge and binge while I do my hobbies like knitting, I still watched season 2. \r\nMuch better. Each episode was refreshing and a nice change of location and scene. We got to see Umaru in several other outfits and states, with more character interactions and also a better juicier plot. \r\nIt sounds contradicting for a slice-of-life to have a juicy plot, but I feel like a slice-of-life should at least be a bit more exciting andhave that productive \"it's another day!!\" vibe, cus it's a slice-of-LIFE, and we want to see someone with an exciting life, not a boring one.",
            "date": "2018-12-05T22:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 295334,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/nuestren22",
                "username": "nuestren22"
            },
            "url": "https://myanimelist.net/reviews.php?id=295334"
        },
        {
            "content": "Himouto! Umaru-chan, an anime about a Mary Sue and how she abuses her brother to get what she wants. This may not seem like a good story for an anime but hear me out, this anime is hilarious!\r\nUmaru Doma is a girl that's popular in school, she has good grades and friends, however, when she comes home, she turns into a lazy monster, a spoiled brat who gets everything from her brother. This is the second season of Umaru causing chaos and while I enjoy both I think the second season does a better job with the characters, especially Umaru. The second season doesn't domuch to change the story but it does have little side stories like Umaru's childhood friend Ebina trying to express her feelings to her crush, which adds to the comedy. \\n\\n\r\nIf you want a good comedy I would suggest watching Himouto! Umaru-chan and the second season, but I'll admit that this series isn't for everybody. If you don't mind a little sister being mean to her older brother for a couple episodes then I think you would enjoy Umaru-chan",
            "date": "2018-08-17T08:33:00+00:00",
            "helpful_count": 2,
            "mal_id": 286691,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5989277.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DvaWinkyFace",
                "username": "DvaWinkyFace"
            },
            "url": "https://myanimelist.net/reviews.php?id=286691"
        },
        {
            "content": "I wrote a review for this season, but it was too long since I was mostly venting my frustrations. Instead of talking about specifics, I'll just directly point out the main reason why this season was unbearable:\r\nThe brother main character keeps to himself the location and phone number of a brother of one of Umaru's friends, and they've said they've been looking for the whereabouts of that brother for 10 years. The brother MC notices the brother has the same last name as her, has the same hairband as her, acts like her... but doesn't bother simply asking that brother if he was relatedto her or not. Why you may ask? They never explain why. Which makes the brother MC an inconsiderate dumbass, and any shipping with Umaru's friend feel infuriating, when I was happily routing for them the first season.\\n\\n\r\nThis season has less funny moments, and more emotional ones, and the emotional ones never lead to any gratifying conclusions. This season tried to shove too much generic, uninteresting friendship sentimentality instead of fun times with Umaru in her room.\\n\\n\r\nThis show does not deserve our affection. I liked this show cause it was funny, but if you really want to give me all these emotional moments and have me genuinely like these characters, then no. Umaru is unlikable since she keeps these identities secret from her friends, purple-hair friend is unlikable since she's always spiteful to those around her, blue-hair girl is generic in how happy-go-lucky she always is, and the brother MC, as mentioned before, IS A DUMBASS.\\n\\n\r\nRed-hair girl was this show's saving grace for me, but since they keep shoehorning the romance between her and an idiot, it becomes unbearable.\\n\\n\r\nLess funny, more generic, unsatisfying, uninteresting slice of life bullsh*t. If you want this type of comedy with great characters, just skip this season and watch Lucky Star.",
            "date": "2018-03-28T19:57:00+00:00",
            "helpful_count": 2,
            "mal_id": 275526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6384970.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TheMAM",
                "username": "TheMAM"
            },
            "url": "https://myanimelist.net/reviews.php?id=275526"
        },
        {
            "content": "When I watched the first episode of first season this anime turned out to be my number one anime. I watched the first season again-again every weekend after the hard work. I was so happy when they announced the second season. So let see my short review about this.\r\nI am happy because they didn't change the settings (same place, same soundtrack, same design), just new Himouto-s. Or at least I hoped for it. In the first season we already got to know how Himouto is our Umaru, and I thought there will be new ways to show this kind of lifestyle. This season concentrated aboutthe minor characters what I like very much (as a video gamer I always sorry about in a narrative video game that we can't get to know better these kind of characters), however it lacks of funny moments and that's why I rewatched the first season all the time because of these Himouto moments which are missing now.\\n\\n\r\nThe one thing is that I dislike, or I mean the one I dislike in the season is the character of Hikari. She was very annoying and useless character, I see her as a lame or wannabe Himouto. After I saw her for the third time I couldn't stand it anymore and skipped those scenes with her in it.\\n\\n\r\nHowever I hope they will continue this anime because I still love it (see the romance of Ebina and Taihei, the progress of Kirie). So yeah it was a little bit of downside from the first season, but you will like this one too ;)",
            "date": "2018-01-26T05:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 269692,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6581223.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/FaithXIII",
                "username": "FaithXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=269692"
        },
        {
            "content": "Himouto! Umaru-chan R is showing more dimensions to itself than the first season did...in a good way.\r\nOk, so as a person who was highly skeptical about the first season and the major problem/dilemma of the main protagonist Umaru Doma voiced by Aimi Tanaka and her \"himouto-ness\" and oddly by the end of the first season LA warmed up to it, LA wondered if this second season that appeared ut of nowhere will stick the same old scthick or try some different. It tried something different.\r\nFor sure, the Himouto-ness of this second season is still there with Umaru being her usual self and all with oneactual obstacle in the way but that a bit later. The actual improvement of this second season comes to the form of the character development and fleshing out of Umaru's friend circle of Kirie, Ebina and Sylphinford along with ALL their family members and LA does mean ALL. Kirie by FAR gets the majority of the stage presences in this season and though LA didn't like Kirie from the first season being the highly reserved and shy character she definitely opened up this season by interacting with nearly EVERY single character even outside of her click. Ebina gets into a bit to her older brother which sets out Ebina's twice shy romance with Taihei with the help of Kirie. Sylphinford gets some again in the form of her family members along with her usual antics with UMR and Umaru.\\n\\n\r\nNow for that obstacle Umaru faces, it's in the form of another little sister archetype Hikari Kongou voiced by Inori Minase vying for Taihei's attention for some reason and this obviously annoys Umaru to no end wanting Taihei all to herself. We do get to see who she is and what relation she has to Taihei and even though she's a rival to Umaru, she's VERY similar to Umaru personality wise (just without the himouto scthick). Which actually adds to the fact that Umaru DOES care about Taihei as a family member due to Hikari being in the picture even if many of Umaru's exploits led to some of her ulterior motives for her, Hikari acts as a good counterbalance to Umaru.\\n\\n\r\nThe animation done by Doga Kobo is expected moeness and instills the same flavour from the first season, to be expected they also did the first season. There isn't much notable things to talk about for the animation as it's pretty much the same quality from the first season.\\n\\n\r\nThe voice acting is obviously the same but like LA said about Kirie, LA obviously started to notice Kirie's voice actor Haruka Shirashi in the process and due to her character opening up, we get to see more of her range though it's the typical shy and hauntingly nervous, she does flex her vocal chops more this season. LA really likes Nana Ebina voiced by Akari Kageyama as a character even with her vocal archetype not being LA's type but she did quite well as well. Once again though some people might find her annoying but LA quite enjoyed Sylphinford's voice actor Yurina Furukawa and like from the first season injected that zany flair into this season with her opening her range as well for some of the more solemn moments of this season.\\n\\n\r\nThere isn't a doubt that Himouto! Umaru-chan R is a vast improvement from the first season for LA and sure some people might think that just because of the character development gets flesh out means as much, but considering the first season's character development was more or less showing Umaru's himoutoness and her excessive laziness bringing in that divided towards people about this anime (like LA), showing more of Umaru's friends and their developments as characters was a welcoming change that LA didn't mind that Kirie or Ebina or Sylphinford had some focus as they desperately needed it otherwise they would have turned into one-note running gag characters. \\n\\n\r\nLA didn't expected a huge change to the structure of Himouto! Umaru-chan as a series but this change was enough for LA to still stick to Himouto! Umaru-chan even with her shortcomings as a slice of life anime looking at Himouto.",
            "date": "2017-12-25T14:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 266372,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=266372"
        },
        {
            "content": "\"I had fun watching Umaru.\"\r\n\r\nPros:\r\n1. Character developments\r\n2. Character backstories told\r\n3. Umaru not as annoying as in first season\r\n4. More heartwarming than first season\r\nCons:\r\n1. Not for those who doesn't like moe Slice of life anime\r\n2. Umaru still can be kinda annoying at times\r\n3. Character ships hinted, but didn't progress \r\n\r\nHimouto Umaru-chan is an anime I stumbled upon in 2015 because of how popular it was back then. As a fan of moe Slice of Life anime myself, of course I had to watch it. After watching the 1st episode, at first I didn't really like it. I didn't like Umaru's character at all. Butafter watching a few more episodes, I found out that I actually enjoyed watching this. It's cute and the as a sister Umaru-chan is very like a sister in real life, a brat that no one likes. She isn't moefied to the Sagiri level and that's what I thank this anime for. \\n\\n\r\nNow where Umaru 2nd season stood out from it's previous season was in it's characters department. We got a lot more character backstories told to us this season to make us care about them. Each backstories told was surprisingly very heartwarming. I especially like learning about the characters when they are in their childhood days. They are very cute and likable. Character developments also took place more often in this season. You get to see characters getting past their old self and revealing a new side of them. Quite entertaining. At least the characters this season aren't as cardboard as they were in the first season.\\n\\n\r\nThe OP and ED theme also stood out to me. The OP theme, if you read the lyrics, suits the anime pretty well. It's Umaru herself in the lyrics. The ED theme stirred quite a craze in Chinese Anime Streaming Site Bilibili where a lot of people are doing dance covers of it. I also found the ED to be  very catchy. The voice acting is great! The voice actors and actresses did their best to make the character feel realistic. The BGM aren't anything special, so no comment on that. \\n\\n\r\nThat's pretty much it that made the 2nd season better than the first. This is a Slice of Life anime so no story is needed. The art and animation remained what it was like in the first season, no major changes. So ya, overall, what makes the 2nd season stood out more was thanks to its characters. They were well developed and were well built up. So if you hate the first season because of the shallow characters then watch this, I heard a lot of positive reaction from people who didn't like the fist season and fellow manga readers, so don'w worry. That's it for my review. Thanks for reading. :)",
            "date": "2017-12-24T22:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 266320,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=266320"
        },
        {
            "content": "Himouto! Umaru Chan, one of my favorite guilty pleasure anime. When I came across the first season, I don't know why but I was so hooked that I binged the entire thing so fast, since then I was really hoping for a sequel and I am GLAD we got this cause it is so enjoyable and just what I needed after watching some serious dark anime like Made in Abyss. \r\nI usually say for anime like this, there is really nothing much to break down, They are just made for you sit back and have a good time, but in modern anime, shows like thisare so over saturated that a lot of time you can't give them a pass, They force a bunch of bad jokes and stereotypical cuteness at your face with a bunch of lazy ass characters that makes it seem like they are just trying to sell the show using a formual instead of giving you something to have a good time, and that's why a lot of these shows that use the same formula are so painful to watch but Himouto Umaru chan is just so organic, they do use a similar formula and it has it's fair share of cliched scenes, but using that they have constructed something that is so worthwhile.\\n\\n\r\nPart of what makes Umaru chan work is how effortlessly relatable it is, you gotta admit that there is an Umaru in all of us, she is the child in us that just wants to laze around, eat junk food and have fun all day and there are so many scenes that just make you go like \"Ah, That is so me!\". \\n\\n\r\nAlso Why this show is good is this environment that is being created, it almost makes you want to go live there, that's how you know a slice of life is working. The different characters placed in this environment and the impact they have on the different personas of Umaru makes it seem like a superhero character and the interesting ways he hides his identity and reacts when he's not himself, apart from all the fun and jokes, this is the element of the show that really captivates you.\\n\\n\r\nComing to the jokes, This shit is hilarious! You gotta be super serious to think this is not funny lmao, while I would say the second season isn't nearly as funny as the first one, they make up for it by kind of really exploring the other characters which I thought was really interesting and the way they connect these characters together and create circumstances really add to the flavor of the show. One gripe I do have about this show is the pacing of it, like they would build up scenes for Christmas and then go all the way to new year. Like what's the rush man? calm down gahdamn. \\n\\n\r\nNothing much to say about the Art and Music, I usually skip the OP and ED. The background music does it's job but it's nothing to talk about, the Animation is cool, It is pretty consistent throughout and gives you that laid back and jolly feel so I will give them credit for that, The true magic is the voice acting, Hats off to the voice actors, they don't sound cute or funny just to be that, they deliver the jokes in a way that makes it feel genuine and 10 times funnier than it should be. \\n\\n\r\nOverall man this was a great season and I am really hoping for the announcement of a 3rd one, This is one of those shows you wish never end. Himuto Umaru chan is a very rare show that has mastered being flawed and formulaic and yet remain extremely entertaining. \\n\\n\r\n7.25-7.5/10\\n\\n\r\nJust give me more, please.",
            "date": "2017-12-24T12:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 266260,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5007521.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/tigermaskshinobi",
                "username": "tigermaskshinobi"
            },
            "url": "https://myanimelist.net/reviews.php?id=266260"
        },
        {
            "content": "The first ever girl who can change her height! (Not using magic of course)\r\nHimouto, as I heard, is a combination of hikikomori and imouto. From only the title, I knew that what I would see is a comedy, slice of life anime about a little sister who nail herself at home, also cause endless troubles to her brother. But so far, Umaru-chan has shown me the kindness I’ve never thought about.  \r\nReceptive and Unique; those two adjectives is the best way to describe ss1. But at some last episodes, UMR-R makes me feel like I am watching a harem rom-com series disguises as aslice of life anime.  I don’t intend to offense because this is one of my favorite slice of life anime. Not only has a fancy idea, it also has close bro-sis’s relationship, which hits right on my style.     \\n\\n\r\nFor those who never watch ss1, I highly recommend that for you. I also mention about both seasons in this review. It’s the only way for me to describe this anime fully.\\n\\n\\n\r\nStory:\\n\r\nEveryone has their dark side that doesn’t want to be explored. Worse, though, no one can accept that or doesn’t get away from you. And about our main character: Umaru-chan, a student girl always has a high academic achievement, a definition of perfection, has lots of respect at school, turn out to be a lazy ‘hamster’ chibi at home. The one who knows both of these characteristics, and surprisingly doesn’t tell anyone about this secret, is her reliable onii-chan. \\n\\n\r\nIn front of each person, she has different characteristic to show. Until now, there are 3 sides of her and I’ve no idea why she has to hide her true identity, also her past, too. Anyway, everybody fall in love with it, even with annoying actions.\\n\\n\r\nRomance has been focused more in ss2, but not too much to dim the slice of life part. If it has anything I’m not happy about, like I said before, is harem situation beginning to develop. Other than that, UMR has lively moments and bland relationships.\\n\\n\\n\r\nCharacters / Art / Sounds:\\n\\n\r\nAdorable characters\\n\\n\r\nWith the development of each character grows smoothly, they’re all express emotions and acts fit with their easily recognized characteristics. When talk about it, in ss2, Kirie-chan isn’t longer too shy; a dynamic Tachibana has shown her deep and thought that surprising me; the sight of Doma x Ebina love story; and still a beloved himouto umaru-chan from ss1, even Doma said that he could feel the changes of her. With the attendance of more supporting characters, the story still has a lot of things to blush. \\n\\n\r\nNothing too much special about art and sounds effect. I can say it fits well with the characters for every side, and it’s quite similar to the manga’s art, also cute chibi. Love Tachibana’s voice and exciting ED.\\n\\n\\n\r\nEnjoyment:\\n\r\nAn easy to watch anime and beloved characters. I also checked for the manga right after watching all episodes, also asking myself why this hasn’t gone viral, but different people have different thought, so I got it quickly. \\n\\n\r\nAnyway, this is worth giving it a try, just like me when I first saw it. Let’s have a cute, funny time with Himouto Umaru-chan and friends.  \\n\\n\\n",
            "date": "2018-03-31T10:17:00+00:00",
            "helpful_count": 1,
            "mal_id": 275888,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6677450.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/0hht0",
                "username": "0hht0"
            },
            "url": "https://myanimelist.net/reviews.php?id=275888"
        },
        {
            "content": "There's many anime out there that try to replicate a sense of humor without the 'humor' part. Umaru-chan R does the complete opposite and delivers on a boisterous show, with controlled humor that settles nicely.\r\nComing from the first season I must admit that Umaru-chan R does it justice. There's improved character development, more humor, and much better music than the first go. But what is the basis? Well basically we follow Umaru through her lazy lie of a life from where we left off in the first season, but just with more development and a subtle 'serious' tone that knocks on the door every nowand then. \\n\\n\r\nNow I say character development but very nonchalantly. Yes, the characters do feel more \"alive\" than the first time, but we still have Ebina-chan being her usual moe character. And Umaru, being lazy. But there are points when we do learn more about one character here or there, and honestly it all melds together nicely.\\n\\n\r\nI said before that I enjoy the music in this season more than the last, and it's no lie. I really adore the outro/intro(s) of this season, they feel more genuine and don't sound as generic as the last. The art is well done, but nothing special. Although I must admit that it has some nice eye-candy moments, but it's very few and far between.\\n\\n\r\nOverall I really do like this season more, and hate to see it over already. Hopefully a third installment is made sometime in the future, but it seems like there's a possibility of that happening based on the ending. I recommend you watch this only if you enjoy some moe-tropes and a lot of (sometimes) cheesy humor; oh and a nice OP and stuff.",
            "date": "2018-02-06T20:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 270873,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=270873"
        },
        {
            "content": "This is an anime that is best watched to calm down. The anime is calm , the characters are whimsical and it never takes itself too seriously neither does it suddenly forces something serious on us.\r\nThe story is calm and just tells the story about a perfect girl who is a lazy brat in the background and how people meet and talk with her. Slowly we see her making friends and honestly through her own personality bring changes on the lives of people she meets through her kindness or innocence. It's a light hearted cartoon. The most \"serious\" theme it gets close to is howtime changes but even that is never too serious. The charecters simplicity also compliments this style.\\n\\n\r\nThe characters , though they have their own struggle , the struggles are simple. Some deal with shyness , Some deal with inability to make friends while others just deal with social anxiety.Initially the charecter sometime might come across as too simple but it's not too bad. By the end i honestly had grown attached to all the characters and their simple nature.\\n\\n\r\nI would genuinely say watch this anime. Watch this to see something light hearted and simple. We have enough troubles in our lives so you might as well just calm down.",
            "date": "2018-02-04T21:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 270689,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/restlesssheep",
                "username": "restlesssheep"
            },
            "url": "https://myanimelist.net/reviews.php?id=270689"
        }
    ]
]