[
    [
        {
            "content": "Do you want to root for an abusive romance just because it's yuri? Do you want to see non-consensual lewd yuri scenes? Do you want to see people cheating and causing others pain? Do you like watching people so unlikeable that even those with the lowest of self-confidence can point to them and remark, \"Well at least I'm not like them.\" Then NTR is for you. \r\nNot only is NTR filled with terrible people doing terrible things, but it's also a terrible story filled with terrible characters. First off all of these characters besides the main guy are unlikeable. Yuma is at least meh, butshe still does terrible things even though it should be obvious that what she's doing is wrong. Ultimately I view her more as the scapegoat for Hotaru's abuse rather than someone to hate on her own. However, her own \"feelings\" towards Hotaru are so tacked on and poorly done that it makes it hard to like her even with this knowledge. She's tainted by those around her and what the plot decided to do with her. Especially when she started to turn into a controlling douchebag too. It was as if they thought 2 controlling douchebags weren't enough, they needed to have 3 of them.\\n\\n\r\nFujiwara and Hotaru are the worst of the lot, and it's hard to imagine characters that are worse than these two. Hotaru is a manipulative and abusive dirtbag. She frequently comes onto Yuma under the guise of helping her. Then she molests her without her consent even as Yuma tells her to stop. The show is clearly trying to go with \"Yuma loved her all along so it's ok\", and makes this clear as it develops. But no, that is sexual abuse and it is not ok. Furthermore, the way that Hotaru acts is disgusting. She manipulates Yuma into relying on her for everything. She is trying to be her practice, her outlet, the thing that helps her stand. This is a common abuse tactic as it makes it that much harder for the person to get rid of their abuser. She's trying to make it that she is needed, so that she can't be disposed of, and quite frankly it's disgusting. The way that she tried to plant seeds into her mind that she liked it, the way that she takes advantage of her, and the way that she has no respect for relationships or boundaries. I don't even care that much about the cheating, I care about the main ship is one that's based off an abusive relationship.\\n\\n\r\nAnd no just because Hotaru is being abused by Fujiwara does not make it ok. In fact, it only trivialized it as it feels so phoned in that it's hard to take seriously. It's clear that they're trying to come up with some sort of excuse for one of their leads to be abusive, but it just doesn't work. You can't just magic away something like that, especially with an obviously evil villain. It looks fake, and like it was all set up just to excuse her. Which again I find disgusting.\\n\\n\r\nEven outside of abuse the two girls basically tell each other that they can't-do / shouldn't do the very exact things that they themselves do. I'm not sure why I would want to watch a bunch of controlling douchebags but here is NTR to provide that. \\n\\n\r\nThe sad part is the last guy is actually decent and show what someone should be like in a healthy relationship. However, all he gets to show for it is to be cheated on and lied to. I'm so glad that we get to see the only decent person here suffer. Thanks, NTR.\\n\\n\r\nDid I mention the story? First off its crap. It can't decide between echii fanservice or drama and thusly switches between the two without rhyme or reason. As a friend of mine put it, there's too much drama to just enjoy the echii, and too much echii to distract from the drama. Not that the drama is any good, and personally I find it hard to enjoy echii between scumbags. Even worse is the fact that story ends up stalling. For a good half of the show, it decides to go no where with it, and just leave at the same point. Stalling is terrible and for a show that already has so little to say and do like NTR it just makes it worse. Although admittely every minute that they don't progress means that it's every minute farther away from the yuri couple getting together, which is a benefit although a small one. Not to mention it keeps on cycliDo you want to root for an abusive romance just because it's yuri? Do you want to see non-consensual lewd yuri scenes? Do you want to see people cheating and causing others pain? Do you like watching people so unlikeable that even those with the lowest of self-confidence can point to them and remark, \"Well at least I'm not like them.\" Then NTR is for you. \\n\r\n...\\n\\n\r\nWait was I somewhere? Sorry about that. But I'm sure you can see how that can be annoying..\\n\\n\r\nNot to mention it keeps on cycling the same plot ideas over and over again as if it's incapable to come up with new ones, which at this point I'm pretty sure is exactly what happened.\\n\\n\r\nThe art is also pretty bad, and the production values are all terrible. I never really payed attention to the sound because these immoral douches drowned out any care I had about the other parts of the show. When a show glorfies a couple based off cheating and abuse it's hard to care about any other part of it. Add to that a story that goes no where and some of the least likeable characters imaginable, you have a recipe for one of the worst anime out there, which NTR is.",
            "date": "2017-09-20T09:30:00+00:00",
            "helpful_count": 188,
            "mal_id": 258133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984878.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fircoal",
                "username": "Fircoal"
            },
            "url": "https://myanimelist.net/reviews.php?id=258133"
        },
        {
            "content": "In regards to the reviews ive read about netsuzou trap I felt I should do my part and write a review. First of all, the manga and anime are really interesting and well written when it concerns the manga. I believe a good anime/manga like a good movie or tv show when it's well written makes us hate and love and empathize with the characters and Netsuzou TRap did just that.\r\nSPOILERS AHEAD\r\nThe main issue facing this anime is that it's easily misunderstood from what I've seen personally. \r\nThe story revolves around two girls in love and realising their feelings. The cheating is secondary, if even.However, most people are focusing on the cheating aspect and how the boys are being taken advantage of. Which is completely false, Takeda is helping Yuma on his own choice and Fujiwara knows what he got himself into. The real issue here is the drama that revolves around the two female characters. How they deal with their feelings, hide their feelings and even, in Hotaru's case, sacrifice herself for the person she loves. I will get to this more in depths next.\\n\\n\r\nFor a quick explanation on the characters themselves,\\n\\n\r\nHotaru is the type to not be forthcoming with how she feels but instead work in the shadows to ensure the safety of the person shes trying to protect. This was evident when she was beaten and being blackmailed by Fujiwara, using the picture he took of Yuma and Hotaru. Most of what she did was also to get Yuma's attention which is understood later in the anime. This doesn't excuse all of her choices but we can empathize to the fact she was scared of this situation but also of her own feelings. \\n\\n\r\nYuma is the complete opposite she is oblivious to most things in life and struggles with her feelings towards Hotaru and what they mean. But her protective and stubborn personality is exactly what hotaru needs and balance their relationship perfectly. \\n\\n\r\nTakeda is a literal angel, he doesn't hold any grudges against Yuma even after being rejected. He is an admirable person and a good friend to Yuma. \"He deserves better\" like everyone says, and it's true.\\n\\n\r\nFujiwara is a piece of shit. \\n\\n\r\nThe storytelling and the point of view we get from the characters is great even if its lacks of details like there is in the manga. \\n\r\nArt 8/10\\n\r\nSoundtrack 10/10\\n\r\nStory 10/10\\n\\n\r\nTo conclude Netsuzou TRap isn't for everyone if youre looking for an anime where the boys are the focus and get their happy ending this isnt the anime for you. However if you want a deep and interesting story about the growth of two girls in love and the process of them accepting it, you should give it a try.",
            "date": "2017-09-20T11:22:00+00:00",
            "helpful_count": 123,
            "mal_id": 258142,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5993674.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/notakimchi",
                "username": "notakimchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=258142"
        },
        {
            "content": "The first thing you should know about Netsuzou TRap is that it's absolute trash.\r\nIf you still want to stick around, you should also know that it's pandering to the NTR fetish. For the insanely small percentage of anime fans that don't frequent hentai sites, \"NTR\", or \"netorare\", is the cuckold genre; some poor guy gets his girl stolen by someone who's usually insufferable.\r\nExcept this time, the guy is getting his cute girl stolen by another cute girl, causing me to have conflicting feelings. She's still a bit insufferable (though the story does try to justify her actions by implying she's going through some difficult stuffherself), but the yuri scenes are great, and will likely be even better on a future BD release.\\n\\n\r\nThe art was pretty bad in the first episode, but improved over time. \\n\\n\r\nNetsuzou TRap regularly frustrates me, and yet I keep watching it, so I think it's doing its job. NTR fans will likely have a better time with it than I am.",
            "date": "2017-07-26T09:14:00+00:00",
            "helpful_count": 73,
            "mal_id": 253841,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4563958.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CatSoul",
                "username": "CatSoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=253841"
        },
        {
            "content": "You have to meet one of two criteria in order to find some value in this anime\r\n1. Have a fetish for netorare, a phenomenon where the viewer is made to feel intense jealousy over a character cheating on their significant other\r\n2. Are desperate for some sweet sweet yuri action regardless of the surrounding circumstances\r\nIf you meet neither this is probably the worst anime of the season by a mile. If you meet one or both it becomes tolerable\r\nNTR has some of the best yuri scenes in recent memory. The girls are extremely attractive, one submissive the other domineering, and the two have great chemistry together\r\nThelevel of netorare is tame compared to the extremes usually found in the genre. Turns out two girls banging each other is less emotionally jarring than cheating with someone of the opposite sex - in most cases a mutual friend. Instead we have a naive girl who got into a relationship not really understanding what it meant to date someone, and being pulled away by her best friend who she's probably loved all along. Her biggest fault here is not telling her boyfriend, Takeda, of what was happening behind his back. Not necessarily her swaying feelings itself.\\n\\n\r\nI found the manga to be unbearable because it doesn't go anywhere but the anime at least tries to offer a somewhat of a conclusive ending. It's the better version of the two for sure.\\n\\n\r\nThe MAL score and reviews are correct, this is an incredibly trashy anime pandering to the lowest common denominator of hard dicked miscreants in the anime community, but one mans trash can another mans treasure and there's value to be had here if you meet the targeted audience.",
            "date": "2017-09-20T20:36:00+00:00",
            "helpful_count": 43,
            "mal_id": 258184,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/259533.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/84DaysWithout",
                "username": "84DaysWithout"
            },
            "url": "https://myanimelist.net/reviews.php?id=258184"
        },
        {
            "content": "Before this show came out, I had been a fan of the manga. The story isn’t particularly good, but good art and yuri is enough to keep me entertained. Luckily, this anime was released, giving me the opportunity to uncover the very poorly hidden flaws in the original story as well as directing and writing errors in the adaptation! As the manga progressed, I was actually kind of happy to see that there was a toxic relationship between Fujiwara and Hotaru. Granted, Fujiwara’s blank face immediately gives away that something is wrong, but regardless I was interested to see how they would turnout. That is, until I started the first episode.\\n\\n\r\nOnce I saw that each episode of NTR would only be 9 minutes with about 2 minutes’ worth of opening and ending, I already knew that the anime would not give the manga what little justice is deserved. But with this terrible cast of characters, I don’t even think a full length show would help them. From the manga alone, I was well aware of the fact that Takeda and Yuma weren’t the most interesting characters, but it’s the anime that makes this very blatant. The only thing I’ve seen Takeda do is blush and look like the stereotypical male side character of a romance anime. Yuma has it even worse. Most of her lines are “Wh-what?! Hotaru!” and her only emotion is embarrassment. I’m honestly surprised that the two of them actually managed to be in a relationship. High schoolers or not the two of them lack romantic chemistry of any sorts and are only capable of blushing to one another.\\n\\n\r\nWhen I complain about an anime, I rarely stray from talking about the story, characters, and uses of animation to tell a story. However, I feel like I would be committing a sin for not mentioning that some of the direction in this show is just jarring. My first complaint is that the opening doesn’t fit with this show in the slightest. I couldn’t care less about the pictures that go with it seeing that each time I see it, I’m distracted by the rock song playing. There’s no way to get around it either. If I were to mute the opening, I’d have to watch basically some moving stills for a minute and 30 seconds. The opening lacks much actual animation and tries to cover everything in effects and filters to give the illusion that something cool is happening. It doesn’t help that the ending is a textbook definition of putting the bare minimum of effort into something.\\n\\n\r\nAside from the opening and ending, the direction of the show at some points is just horrendous. I had to rewind some scenes several times just to understand what was happening. This may sound like an exaggeration so let me give two examples. From episode two, there is a scene where Hotaru pulls Yuma into a kiss from behind a bush so that somebody inside the school can’t see them too well. When Takeda calls for them from the school window, the animators portrayed the distance of the characters and their positions in relation to one another so poorly that I thought that Takeda was diagonal from the girls rather than above them. The second example has to be the most amateur thing I’ve ever seen in anime. From episode 2 again, Takeda shows up to Yuma’s classroom to ask about going to the amusement park during the weekend. Yuma thinks ‘I’m not ready’ and then THERE IS A FAST FADE AWAY AND THE QUARTET IS IN AN AMUSEMENT PARK. This scene actually made me do a double-take.  If you choose to make episodes of a somewhat story driven anime to only have 6 minutes’ worth of content, at least get a director who can make decent transitions.\\n\\n\r\nAs stated earlier, I don’t like Takeda and Yuma due to their flat personalities, but it’s really Hotaru that disappoints me. Partially due to the rushed pace of the show, the changes of her mood are laughably fast. You blink and she’s sad. Then you blink again and she’s suddenly cheerful again. Also, I really don’t think they casted the right voice actor for this role. Her VA isn’t bad but sometimes her performances make Hotaru’s relationship with Fujiwara seem like it came out of a hentai. I am convinced that Fujiwara is not actually a character but rather a brick with a face painted on it that has up to 3 speaking lines per episode.\\n\\n\r\nDespite my complaints, I do have some praise for the show. I’m happy that the yuri in this show is not diluted. The censoring matches the censoring of the manga. Instead of literally turning Yuma and Hotaru’s bodies into clouds *cough Love Stage cough* they actually depicted sexual scenes which is rare for any anime that focuses on a homosexual relationship that’s not a hentai. \\n\\n\r\nMy last problems are entirely revolving around the art and animation. I won’t lie, the art looks nice. Not anything at the levels of Kyoto Animation, but nice to look at. But there’s always a catch with this kind of show. Where art hardly makes up for the visuals, the animation can be dreadful. Most of the times it’s just decent but others it’s so funny looking I actually laughed. An example being towards the end of episode 4 where Hotaru is playing with Yuma’s chest while she talks to Takeda on the phone. Hotaru kinda shakes around and it honestly looks like they pulled the scene out of a Windows Movie Maker video.This scene also leads to my main issue with the art. Every character suffers from a severe case of same-face syndrome. If you were to take a shot each time you saw the  SAME EXACT faces used for every expression, you’d be in the hospital getting your stomach pumped halfway through the fourth episode. Even so, EACH CHARACTER ONLY HAS A MAXIMUM OF THREE EMOTIONS: Default,embarrassed, and sad. Embarrassment is only shown with a blush which I can’t really complain about, but sadness is shown through the loss of a character’s pupils.\\n\\n\r\nAll in all, each episode of this show feels more like a trailer rather than  an actual series. It looks like the staff wanted to quickly use whatever popularity NTR had, and pump out whatever they could to make a quick buck or two. Once again, another yuri show has left me disappointed. I can't believe anybody is actually watching this for the story so let me say, you’re better off watching some hentai.\\n",
            "date": "2017-07-26T17:06:00+00:00",
            "helpful_count": 35,
            "mal_id": 253888,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731082.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/CosmicTea",
                "username": "CosmicTea"
            },
            "url": "https://myanimelist.net/reviews.php?id=253888"
        },
        {
            "content": "\"Netsuzou Trap\" is a very poor netorare show. If you’re not familiar with the term, netorare shows are shows that deal with adultery, aka cheating on your partner. In this case, it was Hotaru cheating on Fujiwara with Yuma who, in turn, cheated on her boyfriend Takeda. While the characters gave a valiant effort to try and save this show from being absolute trash, it didn’t do enough to make it decent. The only blessing about this show is the length of the episodes (9 minutes). This anime is something you can get in, watch and get out of rather quickly so there really isn’tany harm in watching the show. There definitely is a lot worse out there. Generic would be the best word to describe this....",
            "date": "2017-10-04T12:38:00+00:00",
            "helpful_count": 15,
            "mal_id": 259699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6086781.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/aranhaa",
                "username": "aranhaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=259699"
        },
        {
            "content": "First of all, why the fuck these girls look like Oregairu's Yukino and Yui, with their personality and boobs swapped. Secondly, the genre mentioned for this anime is Shoujo, which i feel for echhi/hentai lovers will be fantasy.\r\nIt was my first time watching an \"Bisexual\" anime.\r\nFirst episode was just like \"Tutorial : How to Kiss a Girl (for all genders)\". The only best thing which i found was duration : 9 minutes ( including OP and Ending). Story has some direction but can't say it's positive or not. Character development wasn't tad bit of focused at all either.\r\nThis is only how i can rate thisanime up to this point. I'll update it later.",
            "date": "2017-07-26T12:03:00+00:00",
            "helpful_count": 12,
            "mal_id": 253858,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5804093.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SpoilerMagnet",
                "username": "SpoilerMagnet"
            },
            "url": "https://myanimelist.net/reviews.php?id=253858"
        },
        {
            "content": "Finally, after all this time, we get a proper yuri anime which focusses on the sexual relationships between two girls! A one of a kind, niche thing.\r\nNetsuzou TRap isnt for everyone. It only targets those who like yuri anime and want to see girl on girl action which is hardly seen in anime, especially sexual relationships, because of the controversy behind the LGBTQI+ community. This anime is a game changer and hopefully will inspire other anime to be free in it's story writing regardless if it's controversial.\r\nThe story is quite predictable but this is a yuri anime. It's satisfying and hits the marks for whatyou expect this anime to be; an NTR anime. Two girls each have boyfriends and they start \"experimenting and practising\" sexual acts with each other in order to be more experienced when the time comes to engage in the acts with their boyfriends. However, when experimenting with lesbian sexual acts, they come to realise that they are growing more closer and more affectionate to each other. This becomes a problem when they try to maintain their relationships between their boyfriends while keeping their lesbian sexual encounters a secret. This anime is only 9 minutes long per episode, which is shorter than a standard anime episode. This allows unnecessary fillers in episodes and allows the anime to get straight to the point without having to add unnecessary information that will only bore the viewer. However, the short 9 minute episodes does also feel like there is a lot cut out and makes the pacing of the show rather fast which some may not be used to. It makes waiting each week more excruciating as we aren't getting as much information as we would with a standard anime episode. This anime has a simple concept and will make a small part of the community who like yuri very happy.\\n\\n\r\nOne gripe I do have with this show so far though is that the supposed sexually explicit scenes are watered down and doesn't quite give a full \"yuri\" experience but at the very least this anime goes slightly beyond your typical shoujo ai.\\n\\n\r\nThe art and animation in this anime is nothing exceptional. It's like every other anime, they all pretty much look the same anyway. However, it still looks pleasantly good and it will please viewers and it's an art style we are all familiar with. On a side note though, I love the blushing Okazaki does whenever Mizushina does something unexpectedly sexual to her.\\n\\n\r\nThe soundtrack is alright. The OP gets you in the mood to get prepared for the start of the episode and the ED leaves you with a satisfied feel after knowing the end of the episode has come. I like this voice acting in this anime, especially with the two main female protagonists.\\n\\n\r\nThe two main girls are very likeable and the character development is explored through their growing relationships through their sexual encounters which allows us to see their progression through their controversial lesbian relation; from initial deterrence to acceptance and overall satisfaction of sexual acts from someone you know well of the same sex.\\n\\n\r\nOverall, I am enjoying this series so far as it's something different from your typical shoujo ai anime.\\n\\n\r\nI recommend this anime to those who want to see a proper yuri anime.",
            "date": "2017-07-26T09:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 253845,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4441554.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/fillyy",
                "username": "fillyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=253845"
        },
        {
            "content": "Netsuzou TRap is a show I initially hated, but upon giving it a second chance after it had finished airing ended up liking quite a lot.\r\nGoing into this show my experience with yuri anime was limited to shows like Sakura Trick and Yuru Yuri, where the characters tended to consist of naturally likeable, pure hearted angels who would be cute and endearing to watch, but not at all representative of actual people.  These unrealistic expectations led to a pretty rude awakening upon first checking out Netsuzou TRap, and made me dislike it enough to outright drop it.\r\nSome months later, with a much firmer ideaof exactly what I'd be in for, I checked this show out again and feel I can actually rate this very highly.\\n\\n\r\nI'd describe Netsuzou TRap as a visceral character drama about a cast of naive, insecure and otherwise emotionally vulnerable people. You have Yuma, our kind-hearted protagonist who means well but through her confusion and misunderstanding of her emotions is prone to being taken advantage of, or inadvertently causing pain for others.  Hotaru knows exactly what she want, but not how to express herself in a way that's healthy or responsible. The boys of the show, a nice guy and an asshole respectively,  serve more as mirrors for Yuma and Hotaru to reflect off of rather than interesting characters in their own right, but this works well and feels appropriate considering the short episodes and length of the show.  \\n\\n\r\nWhether or not you enjoy Netsuzou TRap will depend pretty much exclusively on whether you can empathise with the main characters, regardless if you think they're right or wrong. If you watch anime purely for the escapism, you likely won't find much value in this show. If you find character studies more interesting or like watching characters who aren't perfect and who have all the flaws and fears that real people might have, then this might be more your kind of thing.\\n\\n\r\nThe story as a whole is fairly tight and works its way soundly to a fairly conclusive ending that, for once, doesn't require further reading of any source material to appreciate. I personally liked the character designs and artwork, and although it didn't bother me that much I feel as if it could have done with slightly more animation and less panning shots. \\n\\n\r\nIn terms of yuri, there's a fair amount of it and it's pretty decent both on a romantic and sexual level, but it wouldn't necessarily by why I'd recommend the show, even though it's the reason I started watching in the first place.",
            "date": "2017-11-15T14:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 263285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4814791.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rawrXtina",
                "username": "rawrXtina"
            },
            "url": "https://myanimelist.net/reviews.php?id=263285"
        },
        {
            "content": "Overall, I'm enjoying this anime enough. It won't be everybody's cup of tea (obviously). It reminds me of Sakura Trick with less \"yuri for guys\". It depicts more of an actual struggle in people with confused feelings on sexuality.\r\nI think people are being much too harsh on this anime. Granted, the anime tries to squeeze in quite a bit in 7 minutes, and the story moves quickly, so it lacks impact to some degree.\r\nStill, the characters actually have depth to them, and their relationships are actually different and fairly interesting. Hotaru comes off as a bit calculating and almost as though she's using Yuma, butit seems more like she's in love without a proper outlet.\\n\\n\r\nI think it's going to appeal to those who can relate, rather than yuri fanboys. So far, the story, and above all, the relationships, are more fleshed out than people give them credit for.\\n\r\nAnd the character design is nice, I'll give them that too.",
            "date": "2017-08-15T04:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 255494,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4073859.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/valkubanging",
                "username": "valkubanging"
            },
            "url": "https://myanimelist.net/reviews.php?id=255494"
        },
        {
            "content": "First of all, this is a rant, written in poor English. And Netsuzou TRap is horrible & will be that way till the end.\r\nOn the 5th episode (and another disgusting cliffhanger) I've decided to read manga to know the continuation (all translated 16 chapters)... it won't get better. Anyone who gave this anime chance, like me - stop right now, please. Save some hope for the ones who deserve it.\r\nNow in details.\r\nNetsuzou TRap has completely OK-tier art and mediocre animation, but the greatest trouble is in the characters. I still remember the feeling of disgust from School Days and Makoto-kun. That nice boat in theend healed some scars on my soul, but in NTR... you will meet the 100% bastard, with no character and charisma who will force you to despise him all the screen time, being the complete failure as a human being...\\n\r\n...who will just get away with everything. And be treated like his behaviour is okay.\\n\\n\r\nThat's the thing I can't stand. Portray anything, as evil, immoral and twisted as you like... but don't show it as *perfectly* normal.\\n\\n\r\nIf you have anything like moral compass, I mean, even that little bit that can survive half a hundred R+-rated titles (with Netsuzou TRap rated PG-13 - I still wandering who was bribed and with what amount of money) - you will despise this anime, its creator and everything about it.\\n\\n\r\nI even thought about a little improvement for MAL - creating black list for authors. This feature would help you never meet anything related to people you choose. And I would have only one name in the list - Kodama, Naoko, original creator of this abomination.",
            "date": "2017-08-04T11:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 254691,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3563739.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Sentikoret",
                "username": "Sentikoret"
            },
            "url": "https://myanimelist.net/reviews.php?id=254691"
        },
        {
            "content": "So this is an NTR anime which means if you are like me and despising cheating or looking for a good romance go no further and skip this. Before the review, just wanted to say its an anime only ending so  if you decided to invest in this series anyway, go the manga route.\r\nStory 3\\10\r\nLong story short, a girl cheats on her boyfriend with her best friend which is also a female. So a yuri ntr anime to sum it up. It shows how our main MC Yuma, deals with guilt and being secretive to her boyfriend while cheating and trying to find herfeelings. Sadly even though most of us would not enjoy the plot in the first place, its done terrible as well having the characters do unrealistic and unnatural acts in order to keep the show going and relying on cliffhangers since this is a ten episode series. \\n\r\nArt 5\\10\\n\r\nThis is a ten minute per episode series, so the art is gonna take a hit along with this series has 21 chapters as of this review an anime should be the LAST thing on the creators mind. The budget was dispersed equally and while not bad at all, it is lower then 2017 standards but this never really bothered me and it most likely will not bother you.\\n\r\nSound 8\\10\\n\r\nRead carefully because this is most likely the only thing I can praise about this anime. While music is subjective to each individual, The Opening was a great listen along with the ending. The OST is also where you may find some great music. I remember the OST from this anime the most besides my anger at this anime but The music will stay in your head and would be an excellent edition to a good anime but sadly it went to this...\\n\r\nCharacters 2\\10\\n\r\nPoint of the show for most is learning to hate every character. You hate the girls cheating, along with how stupid the MC is. The main guy is our dense main protagonist of any harem where he wont get the most obvious hints of her cheating. We also have a misogynist but funny part is, he brings up the best points and does care about his friends at the very least.( note I hate the word misogynist since feminazis and sjw take it out of proportion but there is a quote and his actions that prove this).\\n\r\nOverall 3\\10\\n\r\nThe manga is a bit better, but I suggest unless your into the NTR genre or like cheating I would strongly advice skipping this anime but maybe listening to the opening on youtube or something.\\n",
            "date": "2017-09-13T10:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 257424,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5249550.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ninjaguy2511",
                "username": "ninjaguy2511"
            },
            "url": "https://myanimelist.net/reviews.php?id=257424"
        },
        {
            "content": "After I watched six episodes of Netsuzou TRap, I think I have to write something. I will analyze the show first and then write some of my own thoughts. \r\nStory: 5 \r\nJust one word to describe the story: disappointing. So what's the story actually about? It's just a nine-minute short anime, pointless. There is nothing that people try to express through this show... There are two cute girls try to make love in order to give the audience fan service... And the rest of it is also like garbage. Their relationship with their ''boyfriends'' is ridiculous, let's see what will happen next. The show actuallyis halfway yuri and halfway school romance, it ruins both...\\n\r\nArt: 8\\n\r\nThe art is probably the only good. It's mainly made by the Jakarta department of Creators in Pack. This studio is good at making short series. All of the drawings and colours in this anime seem to be pretty nice.\\n\r\nSound: 5\\n\r\nFor the sound part I feel like the OP, ED and background music is about to be average. There is nothing special and it's kind of dull. But in fact, the music is not too bad.\\n\r\nCharacters: 3\\n\r\nHorrible, just horrible. Boy1: handsome airhead. Boy2: a smart guy that only interested in having sex. Girl1: previously normal girl that has a boyfriend but now she is becoming one of the yuri group. Girl2: originally yuri girl who surprisingly finds a boyfriend. These meaningless combinations are just gross. It just takes advantage of the Yuri fan, but as a work of yuri, it's also a failure. I'm just going to finish it painfully because my no-drop policy. (Don't be angry, it's my personal opinion.)\\n\r\nEnjoyment: 4\\n\r\nIf there is something I enjoyed during watching this, it's the artwork for sure. Cute girls! However, I think this is the ONLY advantage of this show. But if I only care about cute girls, why shouldn't I go watch Ecchi anime???\\n\r\nOverall: 4\\n\r\nOverall, NTR TRap makes me lmao. I don't mean it in a good way, for sure. Why did I laugh? Well, this show makes me wonder how boring the anime nowadays can be... As these cute girls having yuri sex on the screen, I feel like I'm looking at a bunch of clowns...\\n\r\n-------------------------------------------------------------------------------------------\\n\r\nThank you so much for reading! Ah? You say it's not ending? Yeah, now I will write some random thoughts about anime nowadays, and, personally, I feel like it's even more important than a single anime review.\\n\r\nTime flew, the world of old anime fans doesn't exist anymore. The time that people need to treat anime with their true love doesn't exist anymore.\\n\r\nI was born in 2002, not as old as most of you, but I started to watch anime since 2006. Back then, there were not a lot of anime websites, were not much people in my country who loved anime, and there were not countless comments as well. Aya Hirano became hugely popular with Haruhi Suzumiya. The most popular download format was still RMVB. Even Crunchyroll and Niconico were just formed. Back then, anime was 30, 40 mega and with very low resolution, we watched them with pure joy.\\n\r\nThere was no ''Kawaii'', no ''moe'', and no ''Waifu'', too. The anime video got expired very fast, and we had nowhere to save them. Countless DVDs, represented our previous memories. Back then, I could only read every word and illustrations, and even advertisements of a monthly anime magazine with my full attention. I saw every review on the thick magazine as my treasure. I would watched the free DVD inside the magazine several times, even if it was an anime that finished airing long time ago. I cherished them, because it's not easy to get even a single letter about anime culture.\\n\r\nBut now, it's totally different.\\n\r\nCountless information makes anime become a hobby with extremely low standard. If we move our fingers a little, we can get the information of previously ten days, or even several months in a single day. The anime info is so various, as a result, it will probably make some people go wrong way. Paper media is beaten by new media, the hard-working writers for the anime magazine doesn't exist anymore. Why? Because there won't be people who spend a whole day reading a freaking long professional anime introduction. The characters nowadays are always overly exaggerated, seems like this is the only purpose for anime. People just look at the characters instead of analysing the anime meaning itself and simple joy is replaced by following the crowd. Don't ask them why they became like this, it's because the period has changed. The period that you had to try very hard to satisfy you hobbies has passed.\\n\r\nBack then you tried so hard, nowadays, people can get it easily.\\n\r\nPeople would never cherish things they could easily get.\\n\r\n-------------------------------------------------------------------------------------------\\n\r\nPS: My words don't mean to hurt newcomers at all. If you are a freshman to anime, welcome!!!!! :D It's just some random thoughts... I was sad when I saw this dull anime. Thank you again for taking your time to read.\\n\r\nBut, but...\\n\r\nGood times would never come back, right?\\n\\n\\n\\n",
            "date": "2017-08-10T00:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 255102,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992416.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Litcotaku",
                "username": "Litcotaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=255102"
        },
        {
            "content": "As the title suggests, this is a show about cheating, so by that point alone, it won't be for everyone. If you don't want to see major characters being complete pieces of shit and toying with other people, just avoid it altogether.\r\nThe problem with Netsuzou Trap, however, that it's not even good at being an NTR series. Because of how short it is (9-minute episodes, including a full-length opening and a short ending sequence, leaving a stunning 6,5 minutes for actual plot), it ends up feeling rushed and shallow. To make some kind of impact, it could've chosen two different approaches - going grimdark likeSchool Days, punishing the characters for their behaviour, or elaborating on their internal conflicts and giving them a proper chance at redeeming themselves. It did neither, ending on a horribly unsatisfying note.\\n\\n\r\nI think it didn't have to be that way, if not for one fatal problem - Hotaru. Her boyfriend, Fujiwara, being an abusive dickhead fitted the formula, just like the fact of the protagonist, Yuma, being torn between her attraction to, and later love for Hotaru and unwillingness to hurt her genuinely nice boyfriend, Takeda (spiced up by the confusion about her own sexuality). Yume makes questionable choices and could be considered a bit spineless, but means well all throughout the story. Hotaru, however, not only acts like a psychopath, seducing, sexually assaulting and toying with Yume, but the justification the show gives for it is simply absurd. She receives a happy ending with Yume, while everything she deserves from her is a slap across the face. Paradoxically, the one real \"romantic moment\" the show offered was the one that upset me the most - it didn't earn this conclusion in the slightest.\\n\\n\r\nThe show is also pretty tone-deaf, including comedic moments that completely don't fit its general climate - it makes School Days look like a masterpiece of an NTR drama. Unlike some, I don't really hate all the characters and the general concepts Netsuzou Trap uses (I really did enjoy School Days after all). It simply doesn't know how to use any of them properly or how to appeal to any of its possible audiences. It fails as a yuri romance and it fails at least as hard as an NTR show. Even the fanservice isn't very interesting, always either including Yume being sexually assaulted or the scene being interrupted by someone (after all, you have to condense all the conflict into the tiny runtime). It ends up being and series for no one and without any real redeeming qualities. \\n\\n\r\nAvoid, unless you want to watch it from morbid curiosity, like I did.",
            "date": "2019-03-27T04:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 304451,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6802350.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Plk_Lesiak",
                "username": "Plk_Lesiak"
            },
            "url": "https://myanimelist.net/reviews.php?id=304451"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nBeing trapped in some form is almost never a fun experience.\r\nIt doesn’t have to be tangible like locked inside of a room because of a misplaced key. It could also be a mental cage of sorts like anxiety or depression. Whether from a physical or a psychological standpoint, the trap is set, and the feeling of helplessness consumes.\r\nOne other way to reach this same feeling is through watching Netsuzou TRap, an anime which “traps” the audience with boredom, uselessness, and irritation aplenty.\r\nSTORY\r\nThose with a keen enough eye will notice a strangeness in the title ofthis anime. The “r” there is capitalized for a reason: to complete the initialism “NTR”. In this context, “NTR” stands for “netorare”, an infamous genre within the sphere of animated Japanese pornography (i.e., “hentai”). It centers on unwanted sexual advances of an extreme measure. While this description purposefully avoids simplified, coarser language for the sake of professionalism, suffice it to say that NTR is a niche among niches.\\n\\n\r\nThus, true to its title and as it forewarns, Netsuzou TRap channels this genre in the content it delivers. A young lady name Yuma dates her new boyfriend Takeda as she contends with her best friend Hotaru and her “pranks”. Now, the anime by no means reaches the same level of depravity (if only because it is not considered hentai), but the genre’s shadow falls over this anime across its just-under-two-hours runtime.\\n\\n\r\nFetishes aside, the audience will find next to zero value within this darkness.\\n\\n\r\nThe show attempts to prove differently, though, with its risqué scenes between Yuma and Hotaru. Representing one of its only major allures, their presence at least makes sense given Hotaru’s motivations and the negative nature of the narrative. Yet the anime doesn’t know what to make of them. Yuma will be shocked and appalled at Hotaru’s actions but will soon after forgive-and-forget. Which leads back to shock and then once again to forgiving and so on and so forth.\\n\\n\r\nSuch a churn gives Netsuzou TRap the vibe that it is not so much a worthwhile story with some ecchi material sprinkled in but rather a bunch of lewd moments loosely stringed together by a haphazard narrative. That is to say, a lame excuse for some perverted asides. This argument becomes more apparent when sifting through the non-risqué scenes.\\n\\n\r\nFor instance, infrequent tonal problems pop up despite the seriousness of the situation. Hotaru jokes about (not) raping Yuma despite the serious tone of the situation and having literally felt her up in the bath minutes prior.\\n\\n\r\nThere’s also the dialogue and how it treads the same ground over and over. Yuma repeats constantly about understanding Hotaru and being so close to yet so far from Hotaru and hating the fact that she does not know every side of Hotaru. It gets very same-y very fast.\\n\\n\r\nIts dramatic edge chooses not to find anything beneficial, either. Netsuzou TRap contains potential talking points about homosexuality, relationship abuse, and the meaning of love. Yet, much like the ecchi content, their existence within the anime rarely leads to a stronger thematic foothold.\\n\\n\r\nRealistically, if one wants an interesting story, it isn’t here. And if he or she wants some titillation for the imagination, it would be better to seek out normal porn (hentai or otherwise). Thus, because this show fails in both regards, it remains out of the light indefinitely.\\n\\n\r\nART & ANIMATION\\n\\n\r\nThe visuals for Netsuzou TRap rise above the story they present. That’s not saying much and, indeed, not by much anyway.\\n\\n\r\nAt the minimum, the character designs, while not exactly inspired, conform to the anime’s aims and the characters personalities. Takeda is plain looking to go with his good-guy self, and Fujiwara is a bit more eccentric (taller, unkempt, silver palette) to go with his bad-guy self.\\n\\n\r\nSimilarly, Yume’s design (lighter coloring) and Hotaru’s design (darker coloring) coincide with their opposing roles within the show while still maintaining their cute and refined looks. Furthermore, the show bolsters its ecchi scenes with better animation than usual, making sure that the grabbing, touching, and caressing matches the intensity of the ladies’ lust.\\n\\n\r\nThe remainder of the artistry leaves much to be desired. The bland setting hardly ever stands out. Weird fade-to-white cuts happen on occasion to move the setting along. Its jokey style which accompanies the comedic moments feels out of place.\\n\\n\r\nMore generally, the quality of the visuals lessens as the season progresses with lower movement and worsening actual animation. Episode six is particularly bereft of problems, such as forgetting to include Hotaru’s side ponytail and mistimed mouth synchronization.\\n\\n\r\nWith these errors and the boring artistry in general, the visuals scrape by at best.\\n\\n\r\nCHARACTERS\\n\\n\r\nNetsuzou TRap mostly centers on four important people: Yuma, Takeda, Hotaru, and Fujiwara. Yuma dates Takeda, Hotaru dates Fujiwara, and the lot of them find their relationships tested on many different fronts.\\n\\n\r\nYuma is the most out of tune with her feelings, and so her designation as the main protagonist makes sense. Nervousness keeps her from going further with Takeda, a young man who sincerely respects her and their romantic bond.\\n\\n\r\nOn the complete opposite end, Hotaru seems to know exactly what she wants, letting Yuma know as well (under the guise of “practice”). Same goes for Fujiwara. As he would put it, he hates women but loves sex, so his own “bond” with Hotaru barely extends past hormonal needs.\\n\\n\r\nBesides Fujiwara, whose involvement equates to a fourth-wheel given his barebones connections with the others, the cast of Netsuzou TRap arguably stand as the show’s strongest aspect. If only because they own up to their respective parts in this dramatic dance.\\n\\n\r\nFor instance, Yuma struggles with her tumultuous feelings for both Takeda and Hotaru. She understands how poorly she treats him with her distractions and her unwillingness to face their relationship with maturity even as he always gives her the benefit of the doubt. And, with Hotaru, her small backstory about protecting her best friend and having parallel jealousies in her aloof behavior pull her the other way.\\n\\n\r\nHotaru herself refuses to budge from her common tactics of evilness, leaving her in static state for much of the season and thus failing to have a very impactful arc. Nonetheless, her manipulative personality is easily seen throughout Netsuzou TRap. She lies about her emotions. She forces unfair predicaments. She commits to underhanded plans. As her overbearing forwardness weighs down on both Yuma and the audience alike, her deplorable actions feel heavy in their implications and their control. Yes, she’s a mean person but designedly so.\\n\\n\r\nAs for Takeda, he’s simply a cool dude, a regular guy like anybody else. His lovestruck thoughts do not impede his supportiveness, for he reads boundaries and offers advice when possible, even as the situation turns against him. Compared to Fujiwara, Yuma, and Hotaru, who wrestle with or outright indulge in the shadier side of the mind, his saint-like attitude shines as a glimmer of hope and friendliness. Unfortunately for him, the phrase “nice guys finish last” rings true. Yet he can also rest easy knowing that he – and he alone – has the moral high ground when all is said and done.\\n\\n\r\nSo, unlike the rest of the anime, the characters at least have some solid ground to stand upon.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nNetsuzou TRap decides upon a curious option. Where the average twelve-episode anime has only one ending track, this anime instead includes three different EDs during the season. A new one appears every three episodes (except for the final three episodes), giving the audience an unexpected change of pace every now and again.\\n\\n\r\nWhile these moodier pieces do not have much intrigue in the way of instrumentation or musicality, knowing that the show went out of its way to create multiple tracks deserves at least some recognition.\\n\\n\r\nThe rest of the audio direction falls short of such praise. The opening track, “Blue Bud Blue”, goes for a pop-rock song that loses its nifty guitar playing amidst the loudness. The voice-acting performances provide next to nothing of note save for perhaps Hiromi Igarashi as Hotaru not having as much nastiness in her way of speaking as needed. And the original soundtrack, while trying its hardest, fouls out with its simplistic approach.\\n\\n\r\nAltogether, the sound work within Netsuzou TRap is more negative than positive – a common occurrence throughout the entirety of this project.\\n\\n\r\nENJOYMENT\\n\\n\r\nA lot of my readers know that I am a big fan of the “yuri” genre. Admittedly, it’s a big reason as to why I even gave the show a shot in the first place. What I watched, though, wasn’t very rewarding or very interesting in the slightest.\\n\\n\r\nIn fact, the more I got through this anime, the more I came to like a different, almost opposite part entirely: Takeda. He is way too nice of dude to have to be put through these events, and I was rooting for him the whole time because he totally deserved better than he received here (title of the anime notwithstanding).\\n\\n\r\nOtherwise, the show rarely contained anything of note to me. The romance elements were mostly icky. The scenes as portrayed had little weight. The ending didn’t seem all that convincing or satisfying. The show’s only saving grace? It’s short enough that it avoids becoming an absolute slog to complete. But this situation also works against it, for the anime leaves the brain as fast as it entered.\\n\\n\r\nNetsuzou TRap just barely survives a full hounding. While its cast members reach mediocre execution, the rest of this unremarkable, uneventful tale locks itself away and throws out the key.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, a schlocky narrative that holds very little value on either the ecchi or the dramatic side\\n\\n\r\nArt & Animation: Bad, an uninteresting visual direction with visible errors contains some meager designs for its cast members and marginally improved animation at times\\n\\n\r\nCharacters: Fine, Yuma introspects, Hotaru manipulates, and Takeda supports, fitting their roles within this journey well enough, but Fujiwara lacks involvement\\n\\n\r\nMusic & Sound: Bad, while the changing EDs surprise, the tracks themselves and the audio in general miss the mark\\n\\n\r\nEnjoyment: Bad, Takeda is at least a super-cool guy\\n\\n\r\nFinal Score: 2/10",
            "date": "2018-11-13T15:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 294008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=294008"
        },
        {
            "content": "Story 7/10\r\nThe story is focused on a high school girl in your second year who has just started dating a male friend in her club. BUT she's never been particularly interested in a relationship, it seems. And her friend (a girl) insists that she needs to “practice” sexual acts with each other before doing them with her boyfriend. \r\nArt 7/10\r\nIt definitely suffers on this front from a lack of explicit content, or even fully-drawn bodies; while Kodama's art can be very sensual when she's drawing legs and lower torsos, the lack of nipples makes most of the scenes involving breasts look a bit off, particularlysince she doesn't draw upper bodies in general particularly well. \\n\\n\r\nSound 7/10\\n\r\nI think is reasonable.\\n\\n\r\nCharacter 9/10\\n\r\nFor Yuri lovers, the two girls are pretty cute.\\n\\n\r\nEnjoyment 7/10\\n\r\nIf this is your kind of romance fiction, this stands to be a pretty good entry into the genre. \\n\\n\r\nOverall 7/10\\n\r\nIf you like your yuri, this is your world. Sweet and focused on the emotional relationship between girls with aggressive romance.. NTR: Netsuzou Trap is a fairly unusual yuri story. It's good to see the variety that the genre has to offer, even if Kodama Naoko's full series debut has its issues.",
            "date": "2018-04-13T04:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 277939,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020384.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seadragongamv",
                "username": "Seadragongamv"
            },
            "url": "https://myanimelist.net/reviews.php?id=277939"
        },
        {
            "content": "Before I begin just know. This Anime is complete trash, it might actually be the worst anime I have ever watched. It had the most hateable characters i've ever seen, they were so badly written and were just awful people in general. The only positive of this show is the Art and Sound, as they're very well done and can't be criticized... Although the story on the other hand, is the worst excuse for a story i've ever seen... it was trying to get the whole friends fall in love thing but it was trying to be too smart and complex but it all togetherjust failed and was a complete mess\\n\\n\r\nThis is a pathetic excuse for an Anime and I wish i could rate it 0 as it doesn't even deserve the 1 rating it got",
            "date": "2017-11-08T17:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 262824,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4957827.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Itakuu",
                "username": "Itakuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=262824"
        },
        {
            "content": "My first time watching anything ''NTR'' so I'll be completely honest. I've already read the manga so I kind of knew what will occur yet, it still captivated me. \r\nWhat I like the most is how they display the mental struggling within the main character, that what distinguish it from a lot of absolute trash anime. \r\nAnd I truly enjoyed the art. And the funny small bits they always squeeze in. \r\nI know for a certainty if this was the opposite version - YAOI, people would be more into it, cheering up for it, so it irritates me seeing so much hate over stupid things.If you want to hate, make it sensible, that's all to it.\\n\\n\\n\r\nThis anime obviously will escalate and things will get more interesting and I don't see a reason to not watch it, unless you think it's a disgusting fetish, I mostly enjoyed the mental struggle / the actual issues with each character, not the anime being NTR itself.",
            "date": "2017-08-27T16:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 256377,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5775199.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/CitrineTsuki",
                "username": "CitrineTsuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=256377"
        },
        {
            "content": "Cheating from the start.\r\nThis anime is a weird one, my goal this season is to watch all anime, except sequels to ones I haven't watched yet, and this is probably the most taxing so far.   It's semi interesting, but the plot content has me not sure if I should continue.\r\nStory:   It's yuri cheating, no other way to describe it, a girl has a boyfriend and one of her friends starts coming onto her.\r\nArt:  Passablle.\r\nCharacters:   Some depth to them, but it feels like most of the focus is on the two girls, the boyfriends get some depth but don'tfeel like I know them enough.\\n\\n\r\nEnjoyment and overall:   if this is your kind of thing you might like it, it's enough to keep my interest, but if I wasn't planning on watching all anime this season, I probably would have given it up I think.",
            "date": "2017-07-26T10:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 253846,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=253846"
        },
        {
            "content": "So this story is about two girls who are best friends, Yuma, whose point of view the story is from, and Hotaru. Hotaru is in a relationship with a boy named Fujiwara, and Yuma recently started dating a boy named Takeda. Hotaru actually loves Yuma and is in an abusive relationship with Fujiwara, so she proceeds to rape Yuma multiple times during the show. Yuma doesn't do anything to stop her because she is her best friend and doesn't confess about it to anyone. (Also maybe gets a case of Stockholm syndrome, it's been a bit since I've watched it.) Takeda begins to feel likeYuma is cheating on her/ is using him, so he breaks up with her. Yuma is destroyed by this and is on the verge of a mental breakdown. She tries to get back with him after finding out about her friends abusive relationship and being raped more and I believe he agrees or just agrees to be friends for then. Again its been a bit since I've watched it and I'm not about to waste my time again. This whole show is just rape, abuse, mind break, and Stockholm syndrome. If you like that, then you will probably like this show. The reason I decided to write this review is because I saw someone rate this show a ten, which is fine I guess. But he called it a mutual love for the girls and both the boys being played by the girls, which is complete BS. I don't care if you like this show, but call it how it is.",
            "date": "2018-08-11T18:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 286234,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6374981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SpartanS7",
                "username": "SpartanS7"
            },
            "url": "https://myanimelist.net/reviews.php?id=286234"
        }
    ],
    [
        {
            "content": "Do you want to root for an abusive romance just because it's yuri? Do you want to see non-consensual lewd yuri scenes? Do you want to see people cheating and causing others pain? Do you like watching people so unlikeable that even those with the lowest of self-confidence can point to them and remark, \"Well at least I'm not like them.\" Then NTR is for you. \r\nNot only is NTR filled with terrible people doing terrible things, but it's also a terrible story filled with terrible characters. First off all of these characters besides the main guy are unlikeable. Yuma is at least meh, butshe still does terrible things even though it should be obvious that what she's doing is wrong. Ultimately I view her more as the scapegoat for Hotaru's abuse rather than someone to hate on her own. However, her own \"feelings\" towards Hotaru are so tacked on and poorly done that it makes it hard to like her even with this knowledge. She's tainted by those around her and what the plot decided to do with her. Especially when she started to turn into a controlling douchebag too. It was as if they thought 2 controlling douchebags weren't enough, they needed to have 3 of them.\\n\\n\r\nFujiwara and Hotaru are the worst of the lot, and it's hard to imagine characters that are worse than these two. Hotaru is a manipulative and abusive dirtbag. She frequently comes onto Yuma under the guise of helping her. Then she molests her without her consent even as Yuma tells her to stop. The show is clearly trying to go with \"Yuma loved her all along so it's ok\", and makes this clear as it develops. But no, that is sexual abuse and it is not ok. Furthermore, the way that Hotaru acts is disgusting. She manipulates Yuma into relying on her for everything. She is trying to be her practice, her outlet, the thing that helps her stand. This is a common abuse tactic as it makes it that much harder for the person to get rid of their abuser. She's trying to make it that she is needed, so that she can't be disposed of, and quite frankly it's disgusting. The way that she tried to plant seeds into her mind that she liked it, the way that she takes advantage of her, and the way that she has no respect for relationships or boundaries. I don't even care that much about the cheating, I care about the main ship is one that's based off an abusive relationship.\\n\\n\r\nAnd no just because Hotaru is being abused by Fujiwara does not make it ok. In fact, it only trivialized it as it feels so phoned in that it's hard to take seriously. It's clear that they're trying to come up with some sort of excuse for one of their leads to be abusive, but it just doesn't work. You can't just magic away something like that, especially with an obviously evil villain. It looks fake, and like it was all set up just to excuse her. Which again I find disgusting.\\n\\n\r\nEven outside of abuse the two girls basically tell each other that they can't-do / shouldn't do the very exact things that they themselves do. I'm not sure why I would want to watch a bunch of controlling douchebags but here is NTR to provide that. \\n\\n\r\nThe sad part is the last guy is actually decent and show what someone should be like in a healthy relationship. However, all he gets to show for it is to be cheated on and lied to. I'm so glad that we get to see the only decent person here suffer. Thanks, NTR.\\n\\n\r\nDid I mention the story? First off its crap. It can't decide between echii fanservice or drama and thusly switches between the two without rhyme or reason. As a friend of mine put it, there's too much drama to just enjoy the echii, and too much echii to distract from the drama. Not that the drama is any good, and personally I find it hard to enjoy echii between scumbags. Even worse is the fact that story ends up stalling. For a good half of the show, it decides to go no where with it, and just leave at the same point. Stalling is terrible and for a show that already has so little to say and do like NTR it just makes it worse. Although admittely every minute that they don't progress means that it's every minute farther away from the yuri couple getting together, which is a benefit although a small one. Not to mention it keeps on cycliDo you want to root for an abusive romance just because it's yuri? Do you want to see non-consensual lewd yuri scenes? Do you want to see people cheating and causing others pain? Do you like watching people so unlikeable that even those with the lowest of self-confidence can point to them and remark, \"Well at least I'm not like them.\" Then NTR is for you. \\n\r\n...\\n\\n\r\nWait was I somewhere? Sorry about that. But I'm sure you can see how that can be annoying..\\n\\n\r\nNot to mention it keeps on cycling the same plot ideas over and over again as if it's incapable to come up with new ones, which at this point I'm pretty sure is exactly what happened.\\n\\n\r\nThe art is also pretty bad, and the production values are all terrible. I never really payed attention to the sound because these immoral douches drowned out any care I had about the other parts of the show. When a show glorfies a couple based off cheating and abuse it's hard to care about any other part of it. Add to that a story that goes no where and some of the least likeable characters imaginable, you have a recipe for one of the worst anime out there, which NTR is.",
            "date": "2017-09-20T09:30:00+00:00",
            "helpful_count": 188,
            "mal_id": 258133,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984878.jpg",
                "scores": {
                    "animation": 2,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Fircoal",
                "username": "Fircoal"
            },
            "url": "https://myanimelist.net/reviews.php?id=258133"
        },
        {
            "content": "In regards to the reviews ive read about netsuzou trap I felt I should do my part and write a review. First of all, the manga and anime are really interesting and well written when it concerns the manga. I believe a good anime/manga like a good movie or tv show when it's well written makes us hate and love and empathize with the characters and Netsuzou TRap did just that.\r\nSPOILERS AHEAD\r\nThe main issue facing this anime is that it's easily misunderstood from what I've seen personally. \r\nThe story revolves around two girls in love and realising their feelings. The cheating is secondary, if even.However, most people are focusing on the cheating aspect and how the boys are being taken advantage of. Which is completely false, Takeda is helping Yuma on his own choice and Fujiwara knows what he got himself into. The real issue here is the drama that revolves around the two female characters. How they deal with their feelings, hide their feelings and even, in Hotaru's case, sacrifice herself for the person she loves. I will get to this more in depths next.\\n\\n\r\nFor a quick explanation on the characters themselves,\\n\\n\r\nHotaru is the type to not be forthcoming with how she feels but instead work in the shadows to ensure the safety of the person shes trying to protect. This was evident when she was beaten and being blackmailed by Fujiwara, using the picture he took of Yuma and Hotaru. Most of what she did was also to get Yuma's attention which is understood later in the anime. This doesn't excuse all of her choices but we can empathize to the fact she was scared of this situation but also of her own feelings. \\n\\n\r\nYuma is the complete opposite she is oblivious to most things in life and struggles with her feelings towards Hotaru and what they mean. But her protective and stubborn personality is exactly what hotaru needs and balance their relationship perfectly. \\n\\n\r\nTakeda is a literal angel, he doesn't hold any grudges against Yuma even after being rejected. He is an admirable person and a good friend to Yuma. \"He deserves better\" like everyone says, and it's true.\\n\\n\r\nFujiwara is a piece of shit. \\n\\n\r\nThe storytelling and the point of view we get from the characters is great even if its lacks of details like there is in the manga. \\n\r\nArt 8/10\\n\r\nSoundtrack 10/10\\n\r\nStory 10/10\\n\\n\r\nTo conclude Netsuzou TRap isn't for everyone if youre looking for an anime where the boys are the focus and get their happy ending this isnt the anime for you. However if you want a deep and interesting story about the growth of two girls in love and the process of them accepting it, you should give it a try.",
            "date": "2017-09-20T11:22:00+00:00",
            "helpful_count": 123,
            "mal_id": 258142,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5993674.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/notakimchi",
                "username": "notakimchi"
            },
            "url": "https://myanimelist.net/reviews.php?id=258142"
        },
        {
            "content": "The first thing you should know about Netsuzou TRap is that it's absolute trash.\r\nIf you still want to stick around, you should also know that it's pandering to the NTR fetish. For the insanely small percentage of anime fans that don't frequent hentai sites, \"NTR\", or \"netorare\", is the cuckold genre; some poor guy gets his girl stolen by someone who's usually insufferable.\r\nExcept this time, the guy is getting his cute girl stolen by another cute girl, causing me to have conflicting feelings. She's still a bit insufferable (though the story does try to justify her actions by implying she's going through some difficult stuffherself), but the yuri scenes are great, and will likely be even better on a future BD release.\\n\\n\r\nThe art was pretty bad in the first episode, but improved over time. \\n\\n\r\nNetsuzou TRap regularly frustrates me, and yet I keep watching it, so I think it's doing its job. NTR fans will likely have a better time with it than I am.",
            "date": "2017-07-26T09:14:00+00:00",
            "helpful_count": 73,
            "mal_id": 253841,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4563958.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/CatSoul",
                "username": "CatSoul"
            },
            "url": "https://myanimelist.net/reviews.php?id=253841"
        },
        {
            "content": "You have to meet one of two criteria in order to find some value in this anime\r\n1. Have a fetish for netorare, a phenomenon where the viewer is made to feel intense jealousy over a character cheating on their significant other\r\n2. Are desperate for some sweet sweet yuri action regardless of the surrounding circumstances\r\nIf you meet neither this is probably the worst anime of the season by a mile. If you meet one or both it becomes tolerable\r\nNTR has some of the best yuri scenes in recent memory. The girls are extremely attractive, one submissive the other domineering, and the two have great chemistry together\r\nThelevel of netorare is tame compared to the extremes usually found in the genre. Turns out two girls banging each other is less emotionally jarring than cheating with someone of the opposite sex - in most cases a mutual friend. Instead we have a naive girl who got into a relationship not really understanding what it meant to date someone, and being pulled away by her best friend who she's probably loved all along. Her biggest fault here is not telling her boyfriend, Takeda, of what was happening behind his back. Not necessarily her swaying feelings itself.\\n\\n\r\nI found the manga to be unbearable because it doesn't go anywhere but the anime at least tries to offer a somewhat of a conclusive ending. It's the better version of the two for sure.\\n\\n\r\nThe MAL score and reviews are correct, this is an incredibly trashy anime pandering to the lowest common denominator of hard dicked miscreants in the anime community, but one mans trash can another mans treasure and there's value to be had here if you meet the targeted audience.",
            "date": "2017-09-20T20:36:00+00:00",
            "helpful_count": 43,
            "mal_id": 258184,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/259533.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/84DaysWithout",
                "username": "84DaysWithout"
            },
            "url": "https://myanimelist.net/reviews.php?id=258184"
        },
        {
            "content": "Before this show came out, I had been a fan of the manga. The story isn’t particularly good, but good art and yuri is enough to keep me entertained. Luckily, this anime was released, giving me the opportunity to uncover the very poorly hidden flaws in the original story as well as directing and writing errors in the adaptation! As the manga progressed, I was actually kind of happy to see that there was a toxic relationship between Fujiwara and Hotaru. Granted, Fujiwara’s blank face immediately gives away that something is wrong, but regardless I was interested to see how they would turnout. That is, until I started the first episode.\\n\\n\r\nOnce I saw that each episode of NTR would only be 9 minutes with about 2 minutes’ worth of opening and ending, I already knew that the anime would not give the manga what little justice is deserved. But with this terrible cast of characters, I don’t even think a full length show would help them. From the manga alone, I was well aware of the fact that Takeda and Yuma weren’t the most interesting characters, but it’s the anime that makes this very blatant. The only thing I’ve seen Takeda do is blush and look like the stereotypical male side character of a romance anime. Yuma has it even worse. Most of her lines are “Wh-what?! Hotaru!” and her only emotion is embarrassment. I’m honestly surprised that the two of them actually managed to be in a relationship. High schoolers or not the two of them lack romantic chemistry of any sorts and are only capable of blushing to one another.\\n\\n\r\nWhen I complain about an anime, I rarely stray from talking about the story, characters, and uses of animation to tell a story. However, I feel like I would be committing a sin for not mentioning that some of the direction in this show is just jarring. My first complaint is that the opening doesn’t fit with this show in the slightest. I couldn’t care less about the pictures that go with it seeing that each time I see it, I’m distracted by the rock song playing. There’s no way to get around it either. If I were to mute the opening, I’d have to watch basically some moving stills for a minute and 30 seconds. The opening lacks much actual animation and tries to cover everything in effects and filters to give the illusion that something cool is happening. It doesn’t help that the ending is a textbook definition of putting the bare minimum of effort into something.\\n\\n\r\nAside from the opening and ending, the direction of the show at some points is just horrendous. I had to rewind some scenes several times just to understand what was happening. This may sound like an exaggeration so let me give two examples. From episode two, there is a scene where Hotaru pulls Yuma into a kiss from behind a bush so that somebody inside the school can’t see them too well. When Takeda calls for them from the school window, the animators portrayed the distance of the characters and their positions in relation to one another so poorly that I thought that Takeda was diagonal from the girls rather than above them. The second example has to be the most amateur thing I’ve ever seen in anime. From episode 2 again, Takeda shows up to Yuma’s classroom to ask about going to the amusement park during the weekend. Yuma thinks ‘I’m not ready’ and then THERE IS A FAST FADE AWAY AND THE QUARTET IS IN AN AMUSEMENT PARK. This scene actually made me do a double-take.  If you choose to make episodes of a somewhat story driven anime to only have 6 minutes’ worth of content, at least get a director who can make decent transitions.\\n\\n\r\nAs stated earlier, I don’t like Takeda and Yuma due to their flat personalities, but it’s really Hotaru that disappoints me. Partially due to the rushed pace of the show, the changes of her mood are laughably fast. You blink and she’s sad. Then you blink again and she’s suddenly cheerful again. Also, I really don’t think they casted the right voice actor for this role. Her VA isn’t bad but sometimes her performances make Hotaru’s relationship with Fujiwara seem like it came out of a hentai. I am convinced that Fujiwara is not actually a character but rather a brick with a face painted on it that has up to 3 speaking lines per episode.\\n\\n\r\nDespite my complaints, I do have some praise for the show. I’m happy that the yuri in this show is not diluted. The censoring matches the censoring of the manga. Instead of literally turning Yuma and Hotaru’s bodies into clouds *cough Love Stage cough* they actually depicted sexual scenes which is rare for any anime that focuses on a homosexual relationship that’s not a hentai. \\n\\n\r\nMy last problems are entirely revolving around the art and animation. I won’t lie, the art looks nice. Not anything at the levels of Kyoto Animation, but nice to look at. But there’s always a catch with this kind of show. Where art hardly makes up for the visuals, the animation can be dreadful. Most of the times it’s just decent but others it’s so funny looking I actually laughed. An example being towards the end of episode 4 where Hotaru is playing with Yuma’s chest while she talks to Takeda on the phone. Hotaru kinda shakes around and it honestly looks like they pulled the scene out of a Windows Movie Maker video.This scene also leads to my main issue with the art. Every character suffers from a severe case of same-face syndrome. If you were to take a shot each time you saw the  SAME EXACT faces used for every expression, you’d be in the hospital getting your stomach pumped halfway through the fourth episode. Even so, EACH CHARACTER ONLY HAS A MAXIMUM OF THREE EMOTIONS: Default,embarrassed, and sad. Embarrassment is only shown with a blush which I can’t really complain about, but sadness is shown through the loss of a character’s pupils.\\n\\n\r\nAll in all, each episode of this show feels more like a trailer rather than  an actual series. It looks like the staff wanted to quickly use whatever popularity NTR had, and pump out whatever they could to make a quick buck or two. Once again, another yuri show has left me disappointed. I can't believe anybody is actually watching this for the story so let me say, you’re better off watching some hentai.\\n",
            "date": "2017-07-26T17:06:00+00:00",
            "helpful_count": 35,
            "mal_id": 253888,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4731082.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/CosmicTea",
                "username": "CosmicTea"
            },
            "url": "https://myanimelist.net/reviews.php?id=253888"
        },
        {
            "content": "\"Netsuzou Trap\" is a very poor netorare show. If you’re not familiar with the term, netorare shows are shows that deal with adultery, aka cheating on your partner. In this case, it was Hotaru cheating on Fujiwara with Yuma who, in turn, cheated on her boyfriend Takeda. While the characters gave a valiant effort to try and save this show from being absolute trash, it didn’t do enough to make it decent. The only blessing about this show is the length of the episodes (9 minutes). This anime is something you can get in, watch and get out of rather quickly so there really isn’tany harm in watching the show. There definitely is a lot worse out there. Generic would be the best word to describe this....",
            "date": "2017-10-04T12:38:00+00:00",
            "helpful_count": 15,
            "mal_id": 259699,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6086781.jpg",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/aranhaa",
                "username": "aranhaa"
            },
            "url": "https://myanimelist.net/reviews.php?id=259699"
        },
        {
            "content": "First of all, why the fuck these girls look like Oregairu's Yukino and Yui, with their personality and boobs swapped. Secondly, the genre mentioned for this anime is Shoujo, which i feel for echhi/hentai lovers will be fantasy.\r\nIt was my first time watching an \"Bisexual\" anime.\r\nFirst episode was just like \"Tutorial : How to Kiss a Girl (for all genders)\". The only best thing which i found was duration : 9 minutes ( including OP and Ending). Story has some direction but can't say it's positive or not. Character development wasn't tad bit of focused at all either.\r\nThis is only how i can rate thisanime up to this point. I'll update it later.",
            "date": "2017-07-26T12:03:00+00:00",
            "helpful_count": 12,
            "mal_id": 253858,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5804093.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SpoilerMagnet",
                "username": "SpoilerMagnet"
            },
            "url": "https://myanimelist.net/reviews.php?id=253858"
        },
        {
            "content": "Finally, after all this time, we get a proper yuri anime which focusses on the sexual relationships between two girls! A one of a kind, niche thing.\r\nNetsuzou TRap isnt for everyone. It only targets those who like yuri anime and want to see girl on girl action which is hardly seen in anime, especially sexual relationships, because of the controversy behind the LGBTQI+ community. This anime is a game changer and hopefully will inspire other anime to be free in it's story writing regardless if it's controversial.\r\nThe story is quite predictable but this is a yuri anime. It's satisfying and hits the marks for whatyou expect this anime to be; an NTR anime. Two girls each have boyfriends and they start \"experimenting and practising\" sexual acts with each other in order to be more experienced when the time comes to engage in the acts with their boyfriends. However, when experimenting with lesbian sexual acts, they come to realise that they are growing more closer and more affectionate to each other. This becomes a problem when they try to maintain their relationships between their boyfriends while keeping their lesbian sexual encounters a secret. This anime is only 9 minutes long per episode, which is shorter than a standard anime episode. This allows unnecessary fillers in episodes and allows the anime to get straight to the point without having to add unnecessary information that will only bore the viewer. However, the short 9 minute episodes does also feel like there is a lot cut out and makes the pacing of the show rather fast which some may not be used to. It makes waiting each week more excruciating as we aren't getting as much information as we would with a standard anime episode. This anime has a simple concept and will make a small part of the community who like yuri very happy.\\n\\n\r\nOne gripe I do have with this show so far though is that the supposed sexually explicit scenes are watered down and doesn't quite give a full \"yuri\" experience but at the very least this anime goes slightly beyond your typical shoujo ai.\\n\\n\r\nThe art and animation in this anime is nothing exceptional. It's like every other anime, they all pretty much look the same anyway. However, it still looks pleasantly good and it will please viewers and it's an art style we are all familiar with. On a side note though, I love the blushing Okazaki does whenever Mizushina does something unexpectedly sexual to her.\\n\\n\r\nThe soundtrack is alright. The OP gets you in the mood to get prepared for the start of the episode and the ED leaves you with a satisfied feel after knowing the end of the episode has come. I like this voice acting in this anime, especially with the two main female protagonists.\\n\\n\r\nThe two main girls are very likeable and the character development is explored through their growing relationships through their sexual encounters which allows us to see their progression through their controversial lesbian relation; from initial deterrence to acceptance and overall satisfaction of sexual acts from someone you know well of the same sex.\\n\\n\r\nOverall, I am enjoying this series so far as it's something different from your typical shoujo ai anime.\\n\\n\r\nI recommend this anime to those who want to see a proper yuri anime.",
            "date": "2017-07-26T09:58:00+00:00",
            "helpful_count": 9,
            "mal_id": 253845,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4441554.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/fillyy",
                "username": "fillyy"
            },
            "url": "https://myanimelist.net/reviews.php?id=253845"
        },
        {
            "content": "Netsuzou TRap is a show I initially hated, but upon giving it a second chance after it had finished airing ended up liking quite a lot.\r\nGoing into this show my experience with yuri anime was limited to shows like Sakura Trick and Yuru Yuri, where the characters tended to consist of naturally likeable, pure hearted angels who would be cute and endearing to watch, but not at all representative of actual people.  These unrealistic expectations led to a pretty rude awakening upon first checking out Netsuzou TRap, and made me dislike it enough to outright drop it.\r\nSome months later, with a much firmer ideaof exactly what I'd be in for, I checked this show out again and feel I can actually rate this very highly.\\n\\n\r\nI'd describe Netsuzou TRap as a visceral character drama about a cast of naive, insecure and otherwise emotionally vulnerable people. You have Yuma, our kind-hearted protagonist who means well but through her confusion and misunderstanding of her emotions is prone to being taken advantage of, or inadvertently causing pain for others.  Hotaru knows exactly what she want, but not how to express herself in a way that's healthy or responsible. The boys of the show, a nice guy and an asshole respectively,  serve more as mirrors for Yuma and Hotaru to reflect off of rather than interesting characters in their own right, but this works well and feels appropriate considering the short episodes and length of the show.  \\n\\n\r\nWhether or not you enjoy Netsuzou TRap will depend pretty much exclusively on whether you can empathise with the main characters, regardless if you think they're right or wrong. If you watch anime purely for the escapism, you likely won't find much value in this show. If you find character studies more interesting or like watching characters who aren't perfect and who have all the flaws and fears that real people might have, then this might be more your kind of thing.\\n\\n\r\nThe story as a whole is fairly tight and works its way soundly to a fairly conclusive ending that, for once, doesn't require further reading of any source material to appreciate. I personally liked the character designs and artwork, and although it didn't bother me that much I feel as if it could have done with slightly more animation and less panning shots. \\n\\n\r\nIn terms of yuri, there's a fair amount of it and it's pretty decent both on a romantic and sexual level, but it wouldn't necessarily by why I'd recommend the show, even though it's the reason I started watching in the first place.",
            "date": "2017-11-15T14:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 263285,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4814791.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/rawrXtina",
                "username": "rawrXtina"
            },
            "url": "https://myanimelist.net/reviews.php?id=263285"
        },
        {
            "content": "Overall, I'm enjoying this anime enough. It won't be everybody's cup of tea (obviously). It reminds me of Sakura Trick with less \"yuri for guys\". It depicts more of an actual struggle in people with confused feelings on sexuality.\r\nI think people are being much too harsh on this anime. Granted, the anime tries to squeeze in quite a bit in 7 minutes, and the story moves quickly, so it lacks impact to some degree.\r\nStill, the characters actually have depth to them, and their relationships are actually different and fairly interesting. Hotaru comes off as a bit calculating and almost as though she's using Yuma, butit seems more like she's in love without a proper outlet.\\n\\n\r\nI think it's going to appeal to those who can relate, rather than yuri fanboys. So far, the story, and above all, the relationships, are more fleshed out than people give them credit for.\\n\r\nAnd the character design is nice, I'll give them that too.",
            "date": "2017-08-15T04:47:00+00:00",
            "helpful_count": 6,
            "mal_id": 255494,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4073859.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/valkubanging",
                "username": "valkubanging"
            },
            "url": "https://myanimelist.net/reviews.php?id=255494"
        },
        {
            "content": "First of all, this is a rant, written in poor English. And Netsuzou TRap is horrible & will be that way till the end.\r\nOn the 5th episode (and another disgusting cliffhanger) I've decided to read manga to know the continuation (all translated 16 chapters)... it won't get better. Anyone who gave this anime chance, like me - stop right now, please. Save some hope for the ones who deserve it.\r\nNow in details.\r\nNetsuzou TRap has completely OK-tier art and mediocre animation, but the greatest trouble is in the characters. I still remember the feeling of disgust from School Days and Makoto-kun. That nice boat in theend healed some scars on my soul, but in NTR... you will meet the 100% bastard, with no character and charisma who will force you to despise him all the screen time, being the complete failure as a human being...\\n\r\n...who will just get away with everything. And be treated like his behaviour is okay.\\n\\n\r\nThat's the thing I can't stand. Portray anything, as evil, immoral and twisted as you like... but don't show it as *perfectly* normal.\\n\\n\r\nIf you have anything like moral compass, I mean, even that little bit that can survive half a hundred R+-rated titles (with Netsuzou TRap rated PG-13 - I still wandering who was bribed and with what amount of money) - you will despise this anime, its creator and everything about it.\\n\\n\r\nI even thought about a little improvement for MAL - creating black list for authors. This feature would help you never meet anything related to people you choose. And I would have only one name in the list - Kodama, Naoko, original creator of this abomination.",
            "date": "2017-08-04T11:34:00+00:00",
            "helpful_count": 6,
            "mal_id": 254691,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3563739.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Sentikoret",
                "username": "Sentikoret"
            },
            "url": "https://myanimelist.net/reviews.php?id=254691"
        },
        {
            "content": "So this is an NTR anime which means if you are like me and despising cheating or looking for a good romance go no further and skip this. Before the review, just wanted to say its an anime only ending so  if you decided to invest in this series anyway, go the manga route.\r\nStory 3\\10\r\nLong story short, a girl cheats on her boyfriend with her best friend which is also a female. So a yuri ntr anime to sum it up. It shows how our main MC Yuma, deals with guilt and being secretive to her boyfriend while cheating and trying to find herfeelings. Sadly even though most of us would not enjoy the plot in the first place, its done terrible as well having the characters do unrealistic and unnatural acts in order to keep the show going and relying on cliffhangers since this is a ten episode series. \\n\r\nArt 5\\10\\n\r\nThis is a ten minute per episode series, so the art is gonna take a hit along with this series has 21 chapters as of this review an anime should be the LAST thing on the creators mind. The budget was dispersed equally and while not bad at all, it is lower then 2017 standards but this never really bothered me and it most likely will not bother you.\\n\r\nSound 8\\10\\n\r\nRead carefully because this is most likely the only thing I can praise about this anime. While music is subjective to each individual, The Opening was a great listen along with the ending. The OST is also where you may find some great music. I remember the OST from this anime the most besides my anger at this anime but The music will stay in your head and would be an excellent edition to a good anime but sadly it went to this...\\n\r\nCharacters 2\\10\\n\r\nPoint of the show for most is learning to hate every character. You hate the girls cheating, along with how stupid the MC is. The main guy is our dense main protagonist of any harem where he wont get the most obvious hints of her cheating. We also have a misogynist but funny part is, he brings up the best points and does care about his friends at the very least.( note I hate the word misogynist since feminazis and sjw take it out of proportion but there is a quote and his actions that prove this).\\n\r\nOverall 3\\10\\n\r\nThe manga is a bit better, but I suggest unless your into the NTR genre or like cheating I would strongly advice skipping this anime but maybe listening to the opening on youtube or something.\\n",
            "date": "2017-09-13T10:55:00+00:00",
            "helpful_count": 5,
            "mal_id": 257424,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5249550.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ninjaguy2511",
                "username": "ninjaguy2511"
            },
            "url": "https://myanimelist.net/reviews.php?id=257424"
        },
        {
            "content": "After I watched six episodes of Netsuzou TRap, I think I have to write something. I will analyze the show first and then write some of my own thoughts. \r\nStory: 5 \r\nJust one word to describe the story: disappointing. So what's the story actually about? It's just a nine-minute short anime, pointless. There is nothing that people try to express through this show... There are two cute girls try to make love in order to give the audience fan service... And the rest of it is also like garbage. Their relationship with their ''boyfriends'' is ridiculous, let's see what will happen next. The show actuallyis halfway yuri and halfway school romance, it ruins both...\\n\r\nArt: 8\\n\r\nThe art is probably the only good. It's mainly made by the Jakarta department of Creators in Pack. This studio is good at making short series. All of the drawings and colours in this anime seem to be pretty nice.\\n\r\nSound: 5\\n\r\nFor the sound part I feel like the OP, ED and background music is about to be average. There is nothing special and it's kind of dull. But in fact, the music is not too bad.\\n\r\nCharacters: 3\\n\r\nHorrible, just horrible. Boy1: handsome airhead. Boy2: a smart guy that only interested in having sex. Girl1: previously normal girl that has a boyfriend but now she is becoming one of the yuri group. Girl2: originally yuri girl who surprisingly finds a boyfriend. These meaningless combinations are just gross. It just takes advantage of the Yuri fan, but as a work of yuri, it's also a failure. I'm just going to finish it painfully because my no-drop policy. (Don't be angry, it's my personal opinion.)\\n\r\nEnjoyment: 4\\n\r\nIf there is something I enjoyed during watching this, it's the artwork for sure. Cute girls! However, I think this is the ONLY advantage of this show. But if I only care about cute girls, why shouldn't I go watch Ecchi anime???\\n\r\nOverall: 4\\n\r\nOverall, NTR TRap makes me lmao. I don't mean it in a good way, for sure. Why did I laugh? Well, this show makes me wonder how boring the anime nowadays can be... As these cute girls having yuri sex on the screen, I feel like I'm looking at a bunch of clowns...\\n\r\n-------------------------------------------------------------------------------------------\\n\r\nThank you so much for reading! Ah? You say it's not ending? Yeah, now I will write some random thoughts about anime nowadays, and, personally, I feel like it's even more important than a single anime review.\\n\r\nTime flew, the world of old anime fans doesn't exist anymore. The time that people need to treat anime with their true love doesn't exist anymore.\\n\r\nI was born in 2002, not as old as most of you, but I started to watch anime since 2006. Back then, there were not a lot of anime websites, were not much people in my country who loved anime, and there were not countless comments as well. Aya Hirano became hugely popular with Haruhi Suzumiya. The most popular download format was still RMVB. Even Crunchyroll and Niconico were just formed. Back then, anime was 30, 40 mega and with very low resolution, we watched them with pure joy.\\n\r\nThere was no ''Kawaii'', no ''moe'', and no ''Waifu'', too. The anime video got expired very fast, and we had nowhere to save them. Countless DVDs, represented our previous memories. Back then, I could only read every word and illustrations, and even advertisements of a monthly anime magazine with my full attention. I saw every review on the thick magazine as my treasure. I would watched the free DVD inside the magazine several times, even if it was an anime that finished airing long time ago. I cherished them, because it's not easy to get even a single letter about anime culture.\\n\r\nBut now, it's totally different.\\n\r\nCountless information makes anime become a hobby with extremely low standard. If we move our fingers a little, we can get the information of previously ten days, or even several months in a single day. The anime info is so various, as a result, it will probably make some people go wrong way. Paper media is beaten by new media, the hard-working writers for the anime magazine doesn't exist anymore. Why? Because there won't be people who spend a whole day reading a freaking long professional anime introduction. The characters nowadays are always overly exaggerated, seems like this is the only purpose for anime. People just look at the characters instead of analysing the anime meaning itself and simple joy is replaced by following the crowd. Don't ask them why they became like this, it's because the period has changed. The period that you had to try very hard to satisfy you hobbies has passed.\\n\r\nBack then you tried so hard, nowadays, people can get it easily.\\n\r\nPeople would never cherish things they could easily get.\\n\r\n-------------------------------------------------------------------------------------------\\n\r\nPS: My words don't mean to hurt newcomers at all. If you are a freshman to anime, welcome!!!!! :D It's just some random thoughts... I was sad when I saw this dull anime. Thank you again for taking your time to read.\\n\r\nBut, but...\\n\r\nGood times would never come back, right?\\n\\n\\n\\n",
            "date": "2017-08-10T00:00:00+00:00",
            "helpful_count": 5,
            "mal_id": 255102,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992416.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Litcotaku",
                "username": "Litcotaku"
            },
            "url": "https://myanimelist.net/reviews.php?id=255102"
        },
        {
            "content": "As the title suggests, this is a show about cheating, so by that point alone, it won't be for everyone. If you don't want to see major characters being complete pieces of shit and toying with other people, just avoid it altogether.\r\nThe problem with Netsuzou Trap, however, that it's not even good at being an NTR series. Because of how short it is (9-minute episodes, including a full-length opening and a short ending sequence, leaving a stunning 6,5 minutes for actual plot), it ends up feeling rushed and shallow. To make some kind of impact, it could've chosen two different approaches - going grimdark likeSchool Days, punishing the characters for their behaviour, or elaborating on their internal conflicts and giving them a proper chance at redeeming themselves. It did neither, ending on a horribly unsatisfying note.\\n\\n\r\nI think it didn't have to be that way, if not for one fatal problem - Hotaru. Her boyfriend, Fujiwara, being an abusive dickhead fitted the formula, just like the fact of the protagonist, Yuma, being torn between her attraction to, and later love for Hotaru and unwillingness to hurt her genuinely nice boyfriend, Takeda (spiced up by the confusion about her own sexuality). Yume makes questionable choices and could be considered a bit spineless, but means well all throughout the story. Hotaru, however, not only acts like a psychopath, seducing, sexually assaulting and toying with Yume, but the justification the show gives for it is simply absurd. She receives a happy ending with Yume, while everything she deserves from her is a slap across the face. Paradoxically, the one real \"romantic moment\" the show offered was the one that upset me the most - it didn't earn this conclusion in the slightest.\\n\\n\r\nThe show is also pretty tone-deaf, including comedic moments that completely don't fit its general climate - it makes School Days look like a masterpiece of an NTR drama. Unlike some, I don't really hate all the characters and the general concepts Netsuzou Trap uses (I really did enjoy School Days after all). It simply doesn't know how to use any of them properly or how to appeal to any of its possible audiences. It fails as a yuri romance and it fails at least as hard as an NTR show. Even the fanservice isn't very interesting, always either including Yume being sexually assaulted or the scene being interrupted by someone (after all, you have to condense all the conflict into the tiny runtime). It ends up being and series for no one and without any real redeeming qualities. \\n\\n\r\nAvoid, unless you want to watch it from morbid curiosity, like I did.",
            "date": "2019-03-27T04:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 304451,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6802350.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Plk_Lesiak",
                "username": "Plk_Lesiak"
            },
            "url": "https://myanimelist.net/reviews.php?id=304451"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nBeing trapped in some form is almost never a fun experience.\r\nIt doesn’t have to be tangible like locked inside of a room because of a misplaced key. It could also be a mental cage of sorts like anxiety or depression. Whether from a physical or a psychological standpoint, the trap is set, and the feeling of helplessness consumes.\r\nOne other way to reach this same feeling is through watching Netsuzou TRap, an anime which “traps” the audience with boredom, uselessness, and irritation aplenty.\r\nSTORY\r\nThose with a keen enough eye will notice a strangeness in the title ofthis anime. The “r” there is capitalized for a reason: to complete the initialism “NTR”. In this context, “NTR” stands for “netorare”, an infamous genre within the sphere of animated Japanese pornography (i.e., “hentai”). It centers on unwanted sexual advances of an extreme measure. While this description purposefully avoids simplified, coarser language for the sake of professionalism, suffice it to say that NTR is a niche among niches.\\n\\n\r\nThus, true to its title and as it forewarns, Netsuzou TRap channels this genre in the content it delivers. A young lady name Yuma dates her new boyfriend Takeda as she contends with her best friend Hotaru and her “pranks”. Now, the anime by no means reaches the same level of depravity (if only because it is not considered hentai), but the genre’s shadow falls over this anime across its just-under-two-hours runtime.\\n\\n\r\nFetishes aside, the audience will find next to zero value within this darkness.\\n\\n\r\nThe show attempts to prove differently, though, with its risqué scenes between Yuma and Hotaru. Representing one of its only major allures, their presence at least makes sense given Hotaru’s motivations and the negative nature of the narrative. Yet the anime doesn’t know what to make of them. Yuma will be shocked and appalled at Hotaru’s actions but will soon after forgive-and-forget. Which leads back to shock and then once again to forgiving and so on and so forth.\\n\\n\r\nSuch a churn gives Netsuzou TRap the vibe that it is not so much a worthwhile story with some ecchi material sprinkled in but rather a bunch of lewd moments loosely stringed together by a haphazard narrative. That is to say, a lame excuse for some perverted asides. This argument becomes more apparent when sifting through the non-risqué scenes.\\n\\n\r\nFor instance, infrequent tonal problems pop up despite the seriousness of the situation. Hotaru jokes about (not) raping Yuma despite the serious tone of the situation and having literally felt her up in the bath minutes prior.\\n\\n\r\nThere’s also the dialogue and how it treads the same ground over and over. Yuma repeats constantly about understanding Hotaru and being so close to yet so far from Hotaru and hating the fact that she does not know every side of Hotaru. It gets very same-y very fast.\\n\\n\r\nIts dramatic edge chooses not to find anything beneficial, either. Netsuzou TRap contains potential talking points about homosexuality, relationship abuse, and the meaning of love. Yet, much like the ecchi content, their existence within the anime rarely leads to a stronger thematic foothold.\\n\\n\r\nRealistically, if one wants an interesting story, it isn’t here. And if he or she wants some titillation for the imagination, it would be better to seek out normal porn (hentai or otherwise). Thus, because this show fails in both regards, it remains out of the light indefinitely.\\n\\n\r\nART & ANIMATION\\n\\n\r\nThe visuals for Netsuzou TRap rise above the story they present. That’s not saying much and, indeed, not by much anyway.\\n\\n\r\nAt the minimum, the character designs, while not exactly inspired, conform to the anime’s aims and the characters personalities. Takeda is plain looking to go with his good-guy self, and Fujiwara is a bit more eccentric (taller, unkempt, silver palette) to go with his bad-guy self.\\n\\n\r\nSimilarly, Yume’s design (lighter coloring) and Hotaru’s design (darker coloring) coincide with their opposing roles within the show while still maintaining their cute and refined looks. Furthermore, the show bolsters its ecchi scenes with better animation than usual, making sure that the grabbing, touching, and caressing matches the intensity of the ladies’ lust.\\n\\n\r\nThe remainder of the artistry leaves much to be desired. The bland setting hardly ever stands out. Weird fade-to-white cuts happen on occasion to move the setting along. Its jokey style which accompanies the comedic moments feels out of place.\\n\\n\r\nMore generally, the quality of the visuals lessens as the season progresses with lower movement and worsening actual animation. Episode six is particularly bereft of problems, such as forgetting to include Hotaru’s side ponytail and mistimed mouth synchronization.\\n\\n\r\nWith these errors and the boring artistry in general, the visuals scrape by at best.\\n\\n\r\nCHARACTERS\\n\\n\r\nNetsuzou TRap mostly centers on four important people: Yuma, Takeda, Hotaru, and Fujiwara. Yuma dates Takeda, Hotaru dates Fujiwara, and the lot of them find their relationships tested on many different fronts.\\n\\n\r\nYuma is the most out of tune with her feelings, and so her designation as the main protagonist makes sense. Nervousness keeps her from going further with Takeda, a young man who sincerely respects her and their romantic bond.\\n\\n\r\nOn the complete opposite end, Hotaru seems to know exactly what she wants, letting Yuma know as well (under the guise of “practice”). Same goes for Fujiwara. As he would put it, he hates women but loves sex, so his own “bond” with Hotaru barely extends past hormonal needs.\\n\\n\r\nBesides Fujiwara, whose involvement equates to a fourth-wheel given his barebones connections with the others, the cast of Netsuzou TRap arguably stand as the show’s strongest aspect. If only because they own up to their respective parts in this dramatic dance.\\n\\n\r\nFor instance, Yuma struggles with her tumultuous feelings for both Takeda and Hotaru. She understands how poorly she treats him with her distractions and her unwillingness to face their relationship with maturity even as he always gives her the benefit of the doubt. And, with Hotaru, her small backstory about protecting her best friend and having parallel jealousies in her aloof behavior pull her the other way.\\n\\n\r\nHotaru herself refuses to budge from her common tactics of evilness, leaving her in static state for much of the season and thus failing to have a very impactful arc. Nonetheless, her manipulative personality is easily seen throughout Netsuzou TRap. She lies about her emotions. She forces unfair predicaments. She commits to underhanded plans. As her overbearing forwardness weighs down on both Yuma and the audience alike, her deplorable actions feel heavy in their implications and their control. Yes, she’s a mean person but designedly so.\\n\\n\r\nAs for Takeda, he’s simply a cool dude, a regular guy like anybody else. His lovestruck thoughts do not impede his supportiveness, for he reads boundaries and offers advice when possible, even as the situation turns against him. Compared to Fujiwara, Yuma, and Hotaru, who wrestle with or outright indulge in the shadier side of the mind, his saint-like attitude shines as a glimmer of hope and friendliness. Unfortunately for him, the phrase “nice guys finish last” rings true. Yet he can also rest easy knowing that he – and he alone – has the moral high ground when all is said and done.\\n\\n\r\nSo, unlike the rest of the anime, the characters at least have some solid ground to stand upon.\\n\\n\r\nMUSIC & SOUND\\n\\n\r\nNetsuzou TRap decides upon a curious option. Where the average twelve-episode anime has only one ending track, this anime instead includes three different EDs during the season. A new one appears every three episodes (except for the final three episodes), giving the audience an unexpected change of pace every now and again.\\n\\n\r\nWhile these moodier pieces do not have much intrigue in the way of instrumentation or musicality, knowing that the show went out of its way to create multiple tracks deserves at least some recognition.\\n\\n\r\nThe rest of the audio direction falls short of such praise. The opening track, “Blue Bud Blue”, goes for a pop-rock song that loses its nifty guitar playing amidst the loudness. The voice-acting performances provide next to nothing of note save for perhaps Hiromi Igarashi as Hotaru not having as much nastiness in her way of speaking as needed. And the original soundtrack, while trying its hardest, fouls out with its simplistic approach.\\n\\n\r\nAltogether, the sound work within Netsuzou TRap is more negative than positive – a common occurrence throughout the entirety of this project.\\n\\n\r\nENJOYMENT\\n\\n\r\nA lot of my readers know that I am a big fan of the “yuri” genre. Admittedly, it’s a big reason as to why I even gave the show a shot in the first place. What I watched, though, wasn’t very rewarding or very interesting in the slightest.\\n\\n\r\nIn fact, the more I got through this anime, the more I came to like a different, almost opposite part entirely: Takeda. He is way too nice of dude to have to be put through these events, and I was rooting for him the whole time because he totally deserved better than he received here (title of the anime notwithstanding).\\n\\n\r\nOtherwise, the show rarely contained anything of note to me. The romance elements were mostly icky. The scenes as portrayed had little weight. The ending didn’t seem all that convincing or satisfying. The show’s only saving grace? It’s short enough that it avoids becoming an absolute slog to complete. But this situation also works against it, for the anime leaves the brain as fast as it entered.\\n\\n\r\nNetsuzou TRap just barely survives a full hounding. While its cast members reach mediocre execution, the rest of this unremarkable, uneventful tale locks itself away and throws out the key.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Terrible, a schlocky narrative that holds very little value on either the ecchi or the dramatic side\\n\\n\r\nArt & Animation: Bad, an uninteresting visual direction with visible errors contains some meager designs for its cast members and marginally improved animation at times\\n\\n\r\nCharacters: Fine, Yuma introspects, Hotaru manipulates, and Takeda supports, fitting their roles within this journey well enough, but Fujiwara lacks involvement\\n\\n\r\nMusic & Sound: Bad, while the changing EDs surprise, the tracks themselves and the audio in general miss the mark\\n\\n\r\nEnjoyment: Bad, Takeda is at least a super-cool guy\\n\\n\r\nFinal Score: 2/10",
            "date": "2018-11-13T15:17:00+00:00",
            "helpful_count": 3,
            "mal_id": 294008,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 2,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=294008"
        },
        {
            "content": "Story 7/10\r\nThe story is focused on a high school girl in your second year who has just started dating a male friend in her club. BUT she's never been particularly interested in a relationship, it seems. And her friend (a girl) insists that she needs to “practice” sexual acts with each other before doing them with her boyfriend. \r\nArt 7/10\r\nIt definitely suffers on this front from a lack of explicit content, or even fully-drawn bodies; while Kodama's art can be very sensual when she's drawing legs and lower torsos, the lack of nipples makes most of the scenes involving breasts look a bit off, particularlysince she doesn't draw upper bodies in general particularly well. \\n\\n\r\nSound 7/10\\n\r\nI think is reasonable.\\n\\n\r\nCharacter 9/10\\n\r\nFor Yuri lovers, the two girls are pretty cute.\\n\\n\r\nEnjoyment 7/10\\n\r\nIf this is your kind of romance fiction, this stands to be a pretty good entry into the genre. \\n\\n\r\nOverall 7/10\\n\r\nIf you like your yuri, this is your world. Sweet and focused on the emotional relationship between girls with aggressive romance.. NTR: Netsuzou Trap is a fairly unusual yuri story. It's good to see the variety that the genre has to offer, even if Kodama Naoko's full series debut has its issues.",
            "date": "2018-04-13T04:31:00+00:00",
            "helpful_count": 3,
            "mal_id": 277939,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5020384.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Seadragongamv",
                "username": "Seadragongamv"
            },
            "url": "https://myanimelist.net/reviews.php?id=277939"
        },
        {
            "content": "Before I begin just know. This Anime is complete trash, it might actually be the worst anime I have ever watched. It had the most hateable characters i've ever seen, they were so badly written and were just awful people in general. The only positive of this show is the Art and Sound, as they're very well done and can't be criticized... Although the story on the other hand, is the worst excuse for a story i've ever seen... it was trying to get the whole friends fall in love thing but it was trying to be too smart and complex but it all togetherjust failed and was a complete mess\\n\\n\r\nThis is a pathetic excuse for an Anime and I wish i could rate it 0 as it doesn't even deserve the 1 rating it got",
            "date": "2017-11-08T17:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 262824,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4957827.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Itakuu",
                "username": "Itakuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=262824"
        },
        {
            "content": "My first time watching anything ''NTR'' so I'll be completely honest. I've already read the manga so I kind of knew what will occur yet, it still captivated me. \r\nWhat I like the most is how they display the mental struggling within the main character, that what distinguish it from a lot of absolute trash anime. \r\nAnd I truly enjoyed the art. And the funny small bits they always squeeze in. \r\nI know for a certainty if this was the opposite version - YAOI, people would be more into it, cheering up for it, so it irritates me seeing so much hate over stupid things.If you want to hate, make it sensible, that's all to it.\\n\\n\\n\r\nThis anime obviously will escalate and things will get more interesting and I don't see a reason to not watch it, unless you think it's a disgusting fetish, I mostly enjoyed the mental struggle / the actual issues with each character, not the anime being NTR itself.",
            "date": "2017-08-27T16:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 256377,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5775199.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/CitrineTsuki",
                "username": "CitrineTsuki"
            },
            "url": "https://myanimelist.net/reviews.php?id=256377"
        },
        {
            "content": "Cheating from the start.\r\nThis anime is a weird one, my goal this season is to watch all anime, except sequels to ones I haven't watched yet, and this is probably the most taxing so far.   It's semi interesting, but the plot content has me not sure if I should continue.\r\nStory:   It's yuri cheating, no other way to describe it, a girl has a boyfriend and one of her friends starts coming onto her.\r\nArt:  Passablle.\r\nCharacters:   Some depth to them, but it feels like most of the focus is on the two girls, the boyfriends get some depth but don'tfeel like I know them enough.\\n\\n\r\nEnjoyment and overall:   if this is your kind of thing you might like it, it's enough to keep my interest, but if I wasn't planning on watching all anime this season, I probably would have given it up I think.",
            "date": "2017-07-26T10:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 253846,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/wolfwing",
                "username": "wolfwing"
            },
            "url": "https://myanimelist.net/reviews.php?id=253846"
        },
        {
            "content": "So this story is about two girls who are best friends, Yuma, whose point of view the story is from, and Hotaru. Hotaru is in a relationship with a boy named Fujiwara, and Yuma recently started dating a boy named Takeda. Hotaru actually loves Yuma and is in an abusive relationship with Fujiwara, so she proceeds to rape Yuma multiple times during the show. Yuma doesn't do anything to stop her because she is her best friend and doesn't confess about it to anyone. (Also maybe gets a case of Stockholm syndrome, it's been a bit since I've watched it.) Takeda begins to feel likeYuma is cheating on her/ is using him, so he breaks up with her. Yuma is destroyed by this and is on the verge of a mental breakdown. She tries to get back with him after finding out about her friends abusive relationship and being raped more and I believe he agrees or just agrees to be friends for then. Again its been a bit since I've watched it and I'm not about to waste my time again. This whole show is just rape, abuse, mind break, and Stockholm syndrome. If you like that, then you will probably like this show. The reason I decided to write this review is because I saw someone rate this show a ten, which is fine I guess. But he called it a mutual love for the girls and both the boys being played by the girls, which is complete BS. I don't care if you like this show, but call it how it is.",
            "date": "2018-08-11T18:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 286234,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6374981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SpartanS7",
                "username": "SpartanS7"
            },
            "url": "https://myanimelist.net/reviews.php?id=286234"
        }
    ],
    [
        {
            "content": "Netsuzou TRap\r\n |\r\n v\r\nNTR\r\n |\r\n v\r\nNETORARE\r\nThis is explicitly shown directly in the title, so if you're not into Netorare, DON'T watch this series.\r\nI like the fact that this series shows a different kind of \"how to handle love\" as not every love story is \"First and Only Love\" or \"No Cheating Ever even when sad\". Almost like Scum's Wish, this wants to open the eyes to people to not make the error of tagging everyone that cheated into the \"horrible people\" list as every love has a situation behind and not everyone can have a mutual love with the one they truly love, since sometimesa person doesn't understand their feelings and this could lead to a huge amount of possible scenarios (even the \"mutual love but not going to stay together\" path).\\n\\n\r\nThe series has a share of \"domestic abuse\" too, so make sure you really want to see Netorare and Violence towards a partner.",
            "date": "2018-04-08T11:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 277406,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7119938.jpg",
                "scores": {
                    "animation": 10,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LilyWhiteheart",
                "username": "LilyWhiteheart"
            },
            "url": "https://myanimelist.net/reviews.php?id=277406"
        },
        {
            "content": "It's too bad.\r\nEven if – let's assume for the sake of argument – the source manga was bad, this adaptation didn't have to be bad. The premise itself could have been interesting, exploring dysfunctional and abusive relationships. While similar stories have been done before (Kuzu no Honkai as a recent example), Netsuzou TRap could have been refreshing as a yuri genre work, as it was willing to involve male characters in the main conflict.\r\nBut it falls way too short. The visuals, though not quite ugly, are substandard, and there's too much reliance on narration over film language. While the intimate scenes aren't unappealing, their presentationlacks finesse (less is more, as they say) and they're not paced properly (i.e., with increasing intensity).\\n\\n\r\nThe characters are too basic (each of the four can be described in one word, respectively). Yuma's stupidity can be chalked up to an extremely heteronormative Japanese society, but this level of denial is dated by modern yuri genre standards. The show fails to endear the average viewer to Yuma (with the exception of one aspect, which I'll touch on later).\\n\\n\r\nThe message behind Yuma's final dramatic plea is good in theory, but otherwise the payoff is too small for all the frustrating drama, so the message doesn't have enough impact. There's no falling action at all, either. In most romantic dramas, even a clichéd epilogue is better than no epilogue at all.\\n\\n\r\nThe script would have needed a complete rewrite, and it should have been a film or OVA, no longer than one hour. I could go on about the various ways it could have been better, but this is supposed to be a review, not a speculative essay.\\n\\n\r\nIn the end, I didn't have a bad time. I was starved for romance, and I usually prefer the yuri genre for that, so it was at least serviceable in that way. Even though Yuma was dense as a brick, Kakuma Ai's performance was actually touching at times. The series was only about 84 minutes long (without OP and ED), so it's not like I had to sit through a full standard anime season.\\n\\n\r\nAs it stands, Netsuzou TRap is a waste of time for general audiences. It might pass as a temporary fix for fans of the yuri genre who want to see yuri with moving images and sound, and who can stomach the cheating and the abuse... but otherwise they're better off reading yuri manga (there's some really great stuff out there), if they've already seen the handful of good anime in the genre.\\n\\n\r\nIf you don't mind me using this review as a soapbox... The genre may be still be in its infancy (especially in anime), so we have to be patient. Or just create our own stories. You know, be the change you want to see, and all that.\\n\\n\r\nEdit: Kat Callahan has written a very interesting post on how Netsuzou TRap depicts the cycle of abuse. It's a terrifyingly fitting interpretation, and her post is an absolute must-read, but I think the fact that the story took such turns is a result of intuitive decisions by the author (in an effort to justify the plot), instead of  intent based on real-life psychology. The series simply doesn't place enough emphasis on the abuse, for me to be able to believe that it is part of the message. That said, it does make the series a little better in my eyes, and it also makes me wish that the series had explored this aspect with a steadier hand.",
            "date": "2017-12-11T10:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 264982,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2722305.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LeeTailor",
                "username": "LeeTailor"
            },
            "url": "https://myanimelist.net/reviews.php?id=264982"
        },
        {
            "content": "I hoped in the end the main character would realise she is the victim of a sociopath, that's why I watched it until the end. \r\nThis story shows an unhealthy, abusive relationship. Due to the main character's low self esteem and insecurities, she is being mentally, emotionally and physically abused by her sociopath \"best friend\". This girl uses gaslighting & projection and she avoids the subject to be held accountable. She conditions the victim to be dependent on her through physical affection, isolates her from everyone, uses smear-campain against family so that the victim is completely alone. In the end the sociopath uses her ownboyfriend for triangulation so that the victim gets jealous. And there are many more tactics to be observed.\\n\r\nThis should not even be aired unless people get the message in the end that this is an abusive relationship and the victim realizes this, gains confidence to break free, rescues herself or gets rescued by her environment. This show gives a very wrong image of relationships!",
            "date": "2017-10-12T02:11:00+00:00",
            "helpful_count": 2,
            "mal_id": 260560,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/folkaholic",
                "username": "folkaholic"
            },
            "url": "https://myanimelist.net/reviews.php?id=260560"
        },
        {
            "content": "Hello world, this is my first review. This Show... wow.... Just Gross. I did not enjoy watching this anime. The story intrigued me at first. But as we got to know these naff ass characters. I was actually disgusted by the behavior of all of them. Not even the yuri action made me feel good. I felt really bad for Takeda. The poor boy just didn't know he had such a naff ass girlfriend. The fact that he was still nice to her blows my mind. He is bigger person than I. I couldn't do it. As much as Yuma bothered me. Wow Hotaru andFujiwara. Both disgusting. \\n\\n\r\nI felt no connection with this anime. I actually dropped it around week 8 but since i invested the time, I wanted to see if it got better. Nope.  \\n\\n\r\nAnd another thing. One of my favorite seiyuus was in this mess of a show and i didn't even realize it until i was told. Usually i can pick up his voice in an instant. My brain didn't even register that Daisuke Ono was apart of this train wreck.\\n\\n\r\nThis is just my opinion of the show. I do not have final say. If you like it, do you. We are all entitled to like what we like. No judgement here.\\n\\n\r\npeacexx",
            "date": "2017-10-08T20:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 260235,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4253349.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/beatlechan1982",
                "username": "beatlechan1982"
            },
            "url": "https://myanimelist.net/reviews.php?id=260235"
        },
        {
            "content": "Major Spoilers about the Story\r\nNetsuzou TRap was actually something I was looking forward to watching. I was interested in seeing how exactly an anime would take on a premise of having your partner taken away by someone else. Sadly, it didn't really do that, it just became the story of how Yuma Okazaki became a lesbian because the show was too scared to actually have any decent drama.\r\nSo when you think of something with NTR, you expect some intense mental turmoil right? One side of the couple is unsure whether to choose their partner or the new person seducing them, while the other side istrying desperately to get back their partner but usually failing miserably. Well, that's not what happens. The most dramatic thing that happens is that a couple breaks up cause one of them \"suspects\" that the other doesn't love him, and an abusive relationship that isn't properly explored. What we do have as drama is quite forced or lacklustre that you can't help but feel bored. The story is way too tame for something that supposedly wears the NTR badge proudly on their anime. The ending is also way too sappy, there was practically no need for the show to have people cheating on each other. They could have just thrown away the two guys and focused on our main characters, wouldn't have made much of a difference anyway.\\n\\n\r\nTalking about the characters, I have to say I found the abusive couple (Hotaru Mizushina and Fujiwara) way more interesting than the other one, even if they got little spotlight besides some weak drama set up. If I had to choose between the two couples, one consisting of an idiot who doesn't understand she's cheating on her boyfriend most of the time (Yuma) and the guy who's too nice to do anything or too trusting to realise he's being cheated on (Takeda), I would choose the abusive couple. I probably would have enjoyed this anime much more if they threw away Yuma and Takeda and actually gave us a better look into how Hotaru's and Fujiwara's strictly sexual relationship works. \\n\\n\r\nAnd one more thing. Get rid of the comedy. It's so out of place that it's more cringy than funny. This is supposed to be a serious anime about people being unfaithful and having conflicting feelings towards others, we don't need a few dozen moe scenes trying desperately to lighten the mood of a show that needs to be somewhat dark.\\n\\n\r\nTake my advice, whether you like NTR (the term not the anime) or not, don't watch this show at all. It doesn't have the guts to be what it wants to be, and we end up with a lost of lost potential for something that could have truly been a worthwhile watch. If you're gonna give me an NTR anime, don't be a pussy about it and make it an actual NTR anime.\\n\\n\r\nThanks for Reading, Send Feedback if you have any!",
            "date": "2017-09-20T19:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 258176,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6011085.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/EnZanity",
                "username": "EnZanity"
            },
            "url": "https://myanimelist.net/reviews.php?id=258176"
        },
        {
            "content": "I advise anyone who plans on watching this to avoid it. This show is basically just soft core hentai. You are better off just skipping this and visiting hentaihaven for your fap material. There is little to no character development that I have seen so far, although I have only seen 7 episodes, i highly doubt the characters will be given any development in the remaining 5, especially as the girl on girl element is just getting more intense. I will watch this to completion and update if they squeeze in any character development. The art isn't anything to get excited about either, but forwhat this anime is, I didn't expect to be stunned with art, although it would've been the one redeeming factor of the show.",
            "date": "2017-08-23T04:21:00+00:00",
            "helpful_count": 2,
            "mal_id": 256081,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4783172.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/JoshP365",
                "username": "JoshP365"
            },
            "url": "https://myanimelist.net/reviews.php?id=256081"
        },
        {
            "content": "Why do I even watch this in the first place? Is it for Fanservice? For story?\r\nThe answer to the question above is pondered by so many people who decide to waste their precious 9 minutes per episode. Maybe everyone who stumbles upon this trash of the season perhaps doesn't realize what they're stepping into. A TOTAL TRASH!.\r\nHere, let me describe my experience for the last five episode. First, there are two couples. \"Yeah, finally some anime where the story starts with the couples already dating!\". Some of you may think like that but wait a minute. The girls start to cheat on their respective boyfriendto......... guess who? To each other! That's right folks. This is a straight-up Yuri from the get-go. OK, maybe you like Yuri and Netorare and then ask, \"Why should I hate this anime. I love Netorare and Yuri\" (If you are one of the people I specify above, please seek some help. you are just in the right place for a help). Then here's another bad thing I notice here. One of the boys is just a straight-up jerk, abusive man. Another one is a straight-up way too nice man. The abusive guy is really into his character (meaning, he's a complete douchebag who will resort to any possible path just to get laid. Even worse, he blackmails the girls into doing a threesome. Rape and violence never go together well)\\n\\n\r\nSo, this is a complete failure in my opinion. The story just not suited into anime. it's too short. The story is disgusting (Netorare is not my least favorite genre. It's just when you combine it with Yuri and Torture, it is there where the anime turns into a sickening parade)\\n\\n\r\nFOR YOUR INFORMATION\\n\r\nNetorare means Cuckold. Don't know what cuckold means? It basically means cheating from your partner in a sexual manner",
            "date": "2017-08-19T00:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 255792,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6428783.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 2,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Battlemaster",
                "username": "Battlemaster"
            },
            "url": "https://myanimelist.net/reviews.php?id=255792"
        },
        {
            "content": "I'm honestly just disappointed. The manga isn't a masterpiece by any means, but my god... this anime is just so boring. It takes out a lot of the character building due to its very short episodes, and makes every character look insanely stupid and naive, or just boring. It's a shame, as I was hopeful that with the announcement of this and Citrus being made into anime series, it meant the yuri/shoujo ai genre was finally getting some more love. But I suppose I was wrong, and we're stuck with this blandness. \r\nAt least the opening song is pretty good and the art is clean.",
            "date": "2017-08-02T13:39:00+00:00",
            "helpful_count": 2,
            "mal_id": 254519,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4988980.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kuriyamam",
                "username": "kuriyamam"
            },
            "url": "https://myanimelist.net/reviews.php?id=254519"
        },
        {
            "content": "I would like to express how this anime makes you feel in terms of pure emotions. At first when they go on a double date with boyfriends, no background known :/ Not only that, it does not sound at all romantic, just makes you wanna quit within the first minute. But you are promised Shoujo AI and for those who like that, They will find the patience to continue. Oh wow what do we see, One girl seems careless or has done it before the other one escapes free. At this point the bisexual bullshit killed me. I mean I’m fine with a girl likinga guy or a girl but you can’t like someone of certain sex and cheat on someone of a different sex, that’s wrong in my brain. Well cheating is supposed to completely tear appart any reason why I wanted to continue ... In the hopes that it will get better yes it got better at playing with my feelings, It’s emotionally draining to see what happens next, don’t ask why I stuck till the end. Hotaru starts doing some really unspeakable things throughout the story, so I agree with how Yuma feels about this. In fact that’s how they should have mutually understood each other. At the point where I saw Hotaru suffer more and more I thought she completely didn’t have a brain continuing like that. How can she do what she did :/ it’s not like you must be on the high and dangerous wave while waiting for the good to happen. In fact is it not better to play it safe no matter what and look for opportunities? To put it into simple terms it’s like you giving some of your lifespan away for free for no reason. Fujiwara is playing along nicely and in some sense I don’t blame him as much as Hotaru. He said it clearly himself why he’s in all this, but Hotaru ... her character Is disastruous ... she just seems to play the devil role. Ah right, Takeda left to talk about. That guy really is innocent. But let’s not forget how in the first episodes it was him who agreed to this double date nonsense. It was him who “wasn’t gentle” and rushed things. Guess a breakup really improved him in the better ways to the point in there he really diserves better. But in a sense Yuma is perfect for him if not her being Hotaru’s Victim in the devil’s play. In conclusion I feel sorry for those who watched this and like me felt this Unease about Hotaru and Fujiwara. Hotaru and Fujiwara relationship completely affected my feelings towards Romance anime. This is not right ... but who am I to judge. \\n\\n\r\nIf you enjoyed this, You must really be careless about the story and focused on the echii aspect of it, otherwise may God show you some love someday. \\n\\n\\n\r\nAbout the picture taken, I don’t think Hotaru was blackmailed with the picture, wasn’t she the one who started this relationship and she’d be the one establishing the rules of it? \\n\\n\r\nThis story lacked patience on characters showing the monster nature of inpatient people. Maybe Yuma was just a victim maybe not. Either way it’s a perfect example of this disgoust feeling because of rushed things in life. If you rush, your loss. Meaure 10 times cut once, well with Romance, maybe measure until you fall in love.",
            "date": "2019-01-05T04:26:00+00:00",
            "helpful_count": 1,
            "mal_id": 298116,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4475759.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 2,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/adminy",
                "username": "adminy"
            },
            "url": "https://myanimelist.net/reviews.php?id=298116"
        },
        {
            "content": "I'm not going to write a very long or indepth review as is common on this site, instead im going to keep it short and say why I loved this show!\r\nYou should already know that this anime is about the journey of two girls discovering what it really means to love someone. But instead of the typical boy-girl relationship, they come to realize that the person they love is someone of the same gender.\r\nPersonally, I love shows that go outside of the gender norms. Gay and Lesbian (admittedly way more into the Lesbian side) relationships appeal to me in a way that a normal relationshipcould never be. There is something pure about a relationship that gives nothing but still receives so much! This show does an excellent job at showing why people would make the choice to love outside of the social norms while presenting some very real characters! (if not a little extreme but still characters that can and do exist in real life)\\n\\n\r\nThe show has two main females and two main males (tho they are secondary in the main cast role). One female and one male represent the \"good\" wholesome character, and the other makes up the \"bad\" degenerative character. One character genuinely loves someone and wants the best for their partner, while the other simply wants something but does not love their partner. These two extremes help mold our MC into a character you can cheer for!\\n\\n\r\nIf you read other reviews you will see a lot of people talking about how the pacing is odd and slow in this show... I do not get that. First off, the episodes are about 6.5 minutes in length if you skip the OP and ED, so it's not like much time passes in each episode. Secondly, this is a relationship we are talking about. One that defies what most of us were raised to understand as \"acceptable\" and \"unacceptable\". Personally, I thought this show was paced very well! The MC questions their feelings and works through them by thinking about it, talking about it, and acting on it! There are many things in my life that are similar to what the MC goes through, that took a year or more for me to figure out! This show spans the length of maybe 4 months at most! With that in mind, the pacing is actually pretty fast!\\n\\n\r\nThis went a little longer than I wanted but I feel like I have accurately said what I wanted to say! I really hope you decide to give this show a shot despite the bad ratings, it really is worth while.\\n\\n\r\nWhether you have a fetish for girl on girl, or just really want to know more about what kind of thoughts someone has when they go through this kind of ordeal, I highly recommend this!",
            "date": "2018-07-11T01:05:00+00:00",
            "helpful_count": 1,
            "mal_id": 283696,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4446568.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Graum",
                "username": "Graum"
            },
            "url": "https://myanimelist.net/reviews.php?id=283696"
        },
        {
            "content": "(this review contains spoilers) >(this is my second review) and I do not speak English so I'm sorry for any mistake\r\n.\r\n.\r\n.\r\n.\r\n.\r\nWell, I do not even know where to begin to talk about this anime, but I'll tell you soon that it sins at all points.\r\nStarting with the story, despite being a NTR anime it sins up in this, it does not have PLOT any, if you want to see something with betrayal I recommend a thousand times you watch White Album 2.\r\nThe art is very generic, mainly in the designer of the protagonists / students, in the girls it's even cute but that's it.\r\nthe charactershave no development at all, basically Hotaru plays with the heart of yuma during the whole anime and yuma spends the whole anime wondering if this is normal ???? wtf\\n\r\nthe fujiwara who is the most exploited character in the manga basically started and ended up as a bastard\\n\\n\r\nthe only character that was worth it was takeda, it is quite sad to see the situation in which he stay, is without compassion, and even after he had finished dating he still continued to help yuma and to cherish her happiness.\\n\\n\r\nthe soundtrack is quite imperceptible and weak, the only thing that is really good is the opening that is wonderful.\\n\\n\r\nabout enjoyment .. iff this is what you are looking, give up. because in this anime you will not feel fun. at most you will feel anger\\n\\n\r\nso concluding, the anime has several bad points and bad points explored, in addition to the final being totally clichéd / expected. I would not recommend to anyone, 4/10 for mercy",
            "date": "2018-04-18T10:20:00+00:00",
            "helpful_count": 1,
            "mal_id": 278393,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5869216.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Hikikoyozai",
                "username": "Hikikoyozai"
            },
            "url": "https://myanimelist.net/reviews.php?id=278393"
        },
        {
            "content": "To start this short review off, I'm just gonna say Netsuzou TRap isn't your typical NTR. We can all agree NTR is cancer, but in this anime it was slightly different.\r\nThe main character is Yuma, a woman, and (this ain't even a spoiler, you know damn well what anyone who watches this anime is coming here for) she doesn't realize she's totally lesbo for Hotaru (neighbor+childhood friend) till practically the end. Her love interest isn't stolen away like normal NTR dictates either.\r\nThe whole anime we're put through some pretty nice character development on Yuma's part. Not \"amazing,\" but done pretty well considering each episode isonly 8 minutes long. Everyone else is non-existent. I think the main reason why this anime is getting such bad ratings is that:\\n\r\n1) The side-dicks (they're guys, so not side-chicks, get it? eh? eh?) are really awful. Takeda was the the literal definition of \"Nice Guy\" and Fujiwara was just an ass hole. They were pretty much useless to the yuri story except for slowing down the progress between Yuma and Hotaru. Still get what we want in the end though.\\n\r\n2) People don't understand that finding out you're gay/bi isn't some instantaneous thought process especially in a society where that sort of thing is frowned on most of the time. Luckily this anime has giant time skips so we don't have to go through years of Yuma wondering if she's a gay girl or just jealous.\\n\\n\r\nStory was a 5 since it was just stalling, but still worked out (sort of).\\n\r\nArt was 9 since it's pretty normal for 2017, so it's good.\\n\r\nSound was 9 for the same reason. I will say the music wasn't memorable though, but the voice actors sounded cute and into it.\\n\r\nCharacters was 5 since Yuma was literally the only one that showed any signs of growing and changing.\\n\r\nEnjoyment was a 6 since this anime was pretty realistic with Yuma and her coming to grips that she might actually love another girl. Loved all the teasing Hotaru did too ( ͡° ͜ʖ ͡°)\\n\r\nOverall I give it a 6 since it isn't the best of love stories, even frustrating at some points, but it's okay if you want to see yuri romance with a nice ending.",
            "date": "2018-03-12T00:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 273628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3560787.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Voidgangsta",
                "username": "Voidgangsta"
            },
            "url": "https://myanimelist.net/reviews.php?id=273628"
        },
        {
            "content": "I don't understand why people hate this anime. A lot of people failed to see beyond the cheating part. The story itself was more realistic than the generic cutesy slice of life romance animes. I love the way Hotaru's relationship with Fujiwara was portrayed so realistically. This side to some relationships is never shown in anime. \r\nIt's interesting how people love Clannad so much but turn away from animes like these because they show bad kinds of relationships. I'm glad this anime portrayed it so realistically and didn't make any baby like immature characters like in Clannad\r\nPersonally, this anime was good only because it wasinteresting to the end. I was constantly wondering what would happen between all the characters and the drama and suspense kept me watching. Pity that it was so short. I wish the author spent more time incorporating some elements from the manga into the anime. Would have made a great full length anime. And definitely better than Clannad.",
            "date": "2018-01-29T13:19:00+00:00",
            "helpful_count": 1,
            "mal_id": 270045,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429719.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/codegeassxoxo",
                "username": "codegeassxoxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=270045"
        },
        {
            "content": "This series is really really short. Thats probably the best part of it all. You can binge all 12 episodes in probably about two hours. And if this was all condensed into some sort of weird movie, I think it would have worked a whole lot better. Given the abusive relationships aren't suddenly made not squicky to watch by binging all of it. But I do think it helps the momentum quite a bit, and makes the arcs more engaging. \r\nAt the heart of this story is a tale of repression of sexuality, and what happens when people come out of the closet under complicatedcircumstances. Or rather, are forced out of it. At least, that's what I think this story is TRYING to do. But it just doesn't really work out that way. \\n\\n\r\nThe characters are basically broken down into two sorts of extremes; normal(ish) and toxic(ish). With the two hyper-sexual characters in a highly toxic relationship, and the repressed characters being in a normal relationship. And it is in the representation of these characters that the narrative falls apart. As the hypersexual girl \"frees\" the normal girl through her sexuality and \"love\". But this just proves to make the characters miserable until eventually the finale rolls around and everyone is happy. Why? Because. Thats why. \\n\\n\r\nOverall I would reccomend this to someone with a couple hours to kill that is curious if there is such a thing as bad anime that is just wholly bad. (We've all been there in our early days as weebs)",
            "date": "2018-01-09T22:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 268084,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Alamojak",
                "username": "Alamojak"
            },
            "url": "https://myanimelist.net/reviews.php?id=268084"
        },
        {
            "content": "I couldn't handle this!\r\nI watched it and finished it, but it took me time because I kept on cringing at each episode and how it went. In all honesty, this was a really upsetting story. I have no idea where to even start. However, my reasons are pretty simple. The cheating, and heartbreak was the worst. People may disagree with me, but the author should have worked and properly developed a relationship between two main characters instead of creating a drama out of every episode. This was pretty dumb, the ending was also pretty stupid since I didn't even here Hotaru say that she lovesYume. \\n\\n\r\nHonestly, this would have been a better story if both guys weren't there. JSYINGHHHH!",
            "date": "2017-12-28T11:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 266655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6832377.jpg",
                "scores": {
                    "animation": 10,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/elimation",
                "username": "elimation"
            },
            "url": "https://myanimelist.net/reviews.php?id=266655"
        },
        {
            "content": "Sometimes, I ask myself, \"Why do you subject yourself to this? Do you really think that if you continue to watch bad anime, you'll eventually come to love bad anime?\" Believe me when I say that I don't believe that will ever be the case; after all, trash is trash, even if it's yuri trash. The simple fact that it's yuri resulted in a particular anime being added to the list of anime I watched in the Summer 2017 season when it was announced; although I'm straight, I sometimes have a yuri thirst that I need to quench. Thus, if you ask me why Ikept watching a netorare (cheating) anime such as this one I'm about to review, the answer is simple; it's yuri. The problem is, however, it's not even good yuri.\\n\\n\r\nLadies and gentlemen, welcome to my review of \"Netsuzou TRap\".\\n\\n\r\nNetsuzou TRap revolves around the relationship between Yuma and Hotaru, two best friends who both have boyfriends. In Yuma's case, she just started dating her boyfriend, Takeda; nervous about getting intimate with him, she turns to Hotaru for help. It was at this moment that Yuma realized she messed up, as this resulted in Hotaru kissing her as \"practice\". Of course, with a title like NTR, it wasn't just going to end there; even with their boyfriends being in the picture, Hotaru keeps \"practicing\" with Yuma, even though she constantly tells her to stop, even though it's clearly obvious that SHE WANTS IT. Thus, we get the heart-wrenching story of how one toxic relationship shatters all kinds of relationships, both friendships and romantic relationships! Yay! (Just kill me now.)\\n\\n\r\nNow, let me get one thing clear; I don't like netorare or even the very idea of cheating. No matter the genders of the person you're cheating on and the person you're cheating with, it's still a relationship-breaker on both sides, as it results in the loss of an important aspect of a relationship - trust. With that out of the way, I will honestly say that the story of Netsuzou TRap is really bad, without a doubt. Cheating aside, everything within NTR's story feels fake; the actions and thoughts of these characters can be compared to plastic. However, for reasons I cannot even decipher myself, I was intrigued at the same time. Was it because it was yuri, or maybe I just wanted to see Fujiwara or nearly any other character get hit by a bus?\\n\\n\r\nThat last sentence actually transitions into the central issue with this anime, which is, of course, its characters. Yuma is pretty much an idiot who can't figure out her growing \"feelings\" for Hotaru, even though these \"feelings\" are so shoe-horned in that it just makes me want to slap myself. Hotaru is so much worse, and her actions make me believe that she's actually a succubus in disguise as a human; she constantly seduces Yuma to the point where she thinks she loves her. Their relationship, however, is even worse than the two of them as individual characters; as friends, they're pretty \"meh\", but everything about their \"romantic\" relationship is so abrupt and ultimately empty that I consider them to be the worst yuri couple I have ever seen.\\n\\n\r\nThere is one character who is worse on his own than Yuma and Hotaru together, and that is Hotaru's \"boyfriend\", Fujiwara. There is quite a long list of words I could use to describe this character (some of them being not so friendly), but I'm just going to use \"manipulative\", \"heartless\", \"abusive\", \"misogynistic\", and \"unfaithful\". Yes, you read that last word right; as if two cheaters wasn't enough, another one had to come into the picture and be even worse of a human being than the other two. With both Hotaru and Fujiwara being horrible human beings, it's clear exactly why they're dating, but that doesn't excuse their relationship also feeling false.\\n\\n\r\nLuckily, the cast of this anime has one saving grace within, however minor this saving grace is, and his name is Takeda. One may compare him to a typical male protagonist in another romance anime, but in comparison to everyone else in this series, he is at least a decent human being; he's kind, sweet, and (for whatever reason) very caring towards Yuma. I even found his relationship with Yuma to be more believable than Yuma's relationship with Hotaru; heck, if Yuma wasn't cheating on Takeda behind his back, I believe that they could have been capable of having a rather healthy relationship! (Note: When you end up aiming for the protagonist of a YURI ANIME to end up with a guy instead, that yuri anime is doing a poor job at being one.) Unfortunately, it soon becomes clear that Takeda's only purpose in Netsuzou TRap is to constantly be lied to and eventually get his heart broken. What a shame, really.\\n\\n\r\nWith all of this being said, is there any other thing about Netsuzou TRap that is at least decent? Well, I guess I can say that the animation is rather lazy, but with this being a short anime from a studio with a not-so-impressive track record (Creators in Pack), this fact doesn't tick me off as much as it should. Let's see, what else.... Oh! Actually, the voice acting isn't too bad; each voice was a good fit for their character, with the best performance going to, surprisingly, Daisuke Ono as Fujiwara. (An impressive voice actor still doesn't excuse Fujiwara as a character, though.) I also didn't really hate the opening or ending themes, even though they don't really have much re-listen value to them.\\n\\n\r\nTake this piece of advice that I'm about to give you; go watch Sakura Trick or Aoi Hana if you want a yuri anime to watch, or go watch School Days if you want an anime where the main character cheats on the person they're dating. What's that? You want both at the same time? FINE! Go watch Netsuzou TRap! Just know that if you ask your best friend for dating advice, you shouldn't let them seduce you instead!",
            "date": "2017-09-29T19:29:00+00:00",
            "helpful_count": 1,
            "mal_id": 259172,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1591307.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/HidamariSeashore",
                "username": "HidamariSeashore"
            },
            "url": "https://myanimelist.net/reviews.php?id=259172"
        },
        {
            "content": "The following review includes spoilers for the season finale, but literally nothing happens in this show so it's totally cool:\r\nForgive me if this review seems rushed because the fact of the matter is that it is. I have spent twelve dreadful, painstaking weeks putting up with this nonsense so you guys don't have to and, frankly, it wasn't even almost worth it. There is literally nothing about NTR's story or formula that makes it worth watching. Hell, the only reason I haven't given consistent F's to every episode is that the art isn't terrible and Yuma is kind of cute. But that doesn't matter anymore.The point is- NTR is a garbage anime about garbage characters and its a garbage adaptation of a relatively decent manga series.\\n\\n\r\nTo sum the \"finale\" up in a nutshell, Yuma finally harnesses 1% of the common sense it takes to figure out that Fujiwara is an abusive jerk. Hotaru goes through the whole spiel of, \"Oh, no, it's okay. He only hits me when I refuse to have sex with him,\" which is apparently a completely fine excuse as far as everyone in this anime is concerned and, what do you know, Yuma is left unsatisfied and unloved for the umpteenth time in the last twelve episodes. Meanwhile, Takeda continues to literally sit there and serve his purpose as a metaphorical punching bag for Yuma's transition into lesbianism. Within another two minutes or so, it finally clicks in Yuma's microscopic brain that she might just be interested in women. So, after confessing like three more times or whatever, Hotaru finally figures out that Yuma is being totally serious and the two kiss in front of like six million people in Shibuya crossing or whatever iconic Japanese street this particular series decided to end in.\\n\\n\r\nOf course, this happens right after the customary yuri line of, \"Two girls in love? It can not be!\" and if there was even a drop of justice in this world, these girls would have been hit by a car right then and there. But considering the creators of NTR secretly hate every single one of us, we're greeted by a monochromatic montage of the boring scenes from the last eleven episodes that ultimately ends with an even more boring shot of Yuma and Hotaru talking in an elevator- presumably about how they feel super naughty or how they want to make out or something. Either way, it is a conversation I have no intentions on ever thinking of again, considering that as soon as this review comes to a close I am going to wipe NTR from my memory forever.\\n\\n\r\nIn Summary:\\n\r\nI can wholeheartedly recommend NTR to anyone out there that I utterly despise; I think this series would be great for you guys. But for anyone that I do not wish death upon, avoid this boring excuse for a cuckolding yuri anime. You can leech the same amount of thematic content by placing two of your little sister's barbies on top of each other and making them kiss. In fact, I would honestly prefer that -- because at least that wouldn't consume twelve weeks of my life and it could be over within seconds. NTR isn't the type of series that is bad in the sense that it's poorly made or put together, it's bad in the sense that it is not even as fun as a trip to your grandparents' house on Christmas Eve. Think about what it would be like to actually watch paint dry. Good, now think about what it would be like to blow on that paint for hours upon hours until it becomes dry. That is what NTR feels like, and I am so incredibly thankful that it is finally over.\\n\\n\r\nEpisode Grade: F\\n\r\nSeries Grade: F",
            "date": "2017-09-25T17:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 258665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/229337.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/DJNOSTYLE",
                "username": "DJNOSTYLE"
            },
            "url": "https://myanimelist.net/reviews.php?id=258665"
        },
        {
            "content": "Netsuzou TRap is over.\r\nIt was bad to ok.\r\nFirst off its a yuri drama series that are less then 10 minutes long an episode.\r\nAnd despite the yuri tag it doesn't have much ecchi in it at all.\r\nWhich was a nice surprise.\r\nIt was sexualized when it needed to be, not whenever it wanted to be.\r\nThere we're some noticable themes in this anime as well.\r\nLike abuse, and of course lesbian relationships.\r\nMost of the characters weren't very good in my opinion.\r\nAnd how the conflicts were made seem forced.\r\nAnywhom, I give this anime a 3 outta 10.\r\nI just didn't find it very enjoyable.\r\nI would only recommend it to someone ofwhich whom is seriously questioning thier sexuality and has a hard on for domestic abuse.\\n\r\nThis has been your spoiler free but not really review of Netsuzou TRap.",
            "date": "2017-09-24T16:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 258583,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 3,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=258583"
        },
        {
            "content": "Do you like adorbs yuri stories? \r\nDo you like pretty artstyle? \r\nYes? Watch Netsuzou Trap!\r\nDo you hate it when nice guys end up getting the short end of the stick? \r\nDo you dislike yuri stories? \r\nDo you always judge anime using Code Geass or Death note as a standard? \r\nIf you said yes to any of these last 3 questions, chances are you're not gonna like this show.  \r\nThe thing is with these types of shows, you have to have an open mind and not immediately assume it's trash because you can tell what's going on. I'm not* saying this show is great byany stretch of the imagination, I always judge shows by their entertainment value, NTR, had a lot of cute moments between the two main girls and had a definitive romance unlike other anime that are considered masterpieces that end up being open-ended as to whether or not the two MC's ended up in a relationship.",
            "date": "2017-09-23T14:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 258410,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5675550.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 4,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zeranvor",
                "username": "Zeranvor"
            },
            "url": "https://myanimelist.net/reviews.php?id=258410"
        },
        {
            "content": "From my understanding and personal experience by reading the other reviews and many comments about this Anime's plot on other services, a lot of people really dislike this anime.\r\nThere is plenty of reason to dislike this anime, there are only four real characters and they aren't really developed fully. The interactions between the characters, especially Yuma and Takeda, can seem a little odd. And finally, the morals of Hotaru and Yuma are questionable.However, if the viewer can get past these surface readings and really analyze this anime, several scenes of this anime offer profound and very interesting ideas on what love is, and how loversshould interact.\\n\\n\r\nOne line from this anime that I cannot get out of my head is when Hotaru asks Yuma \"Do you think it's responsible to feed a stray cat?\" This kind of profound, morally questioning analogy and dialogue is not what I expected going into this anime. What amazes me most about this response that Hotaru gives is that I have never heard this kind of an analogy be made about a relationship before. What that line, and what Hotaru says afterward, really mean is that a person can not love someone and show them their affection only when it is convenient for them, but must do so always. And if they can't do that, they should not be showing any affection to that person at all. I was so jarred by this interaction because I went into watching this anime believing it was just going to be fanservice and smut, especially since how short the episodes were, but what I got was some very deep and meaningful dialogue that I could use to analyze many other romance genre works - anime, manga, I can even think of a Hollywood TV show I can apply this to.\\n\\n\r\nIn conclusion, Netsuzou TRap can very easily be written off as smut and not very meaningful or serious by many people, and is many times written off as such. But if you really pay attention to the dialogue between Yuma and Hotaru I believe you will get something out of watching this anime. I know I have. Also its only like 100 minutes long. Overall, for the average anime viewer, I give it a 6/10, but, honestly, if the anime was just the interactions and dialogue between Yuma and Hotaru this would earn a solid 9/10 in my book.\\n\\n",
            "date": "2017-09-22T20:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 258330,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PluralChimera0",
                "username": "PluralChimera0"
            },
            "url": "https://myanimelist.net/reviews.php?id=258330"
        }
    ],
    [
        {
            "content": "Netsuzou TRap...Not Too Raunchy?\r\nNetsuzou TRap or -sigh- NTR is by definition try to have it's main yuri love interests of Hotaru Mizushina voiced by Hiromi Igarashi and Yuma Okazaki voiced by Ai Kakuma to do NTR or \"netorare\" with their respective boyfriends of Fujiwara voiced by Daisuke Ono and Takeda voiced by Ryota Osaka.\r\nYes for a devoted shoujo ai/yuri fan this anime short elicits the feel of a yuri anime especially of Hotaru's teasing and Yuma's blushing and reactions however the \"NTR\" feel because of this kind of circumstance this anime short takes kinda ignores all this. It's a more yuri anime short than anNTR, which is kinda weird considering the title acronym of this anime short is suppose to evoke this. Maybe the TRap is suppose to mean we're thinking people it's an NTR but really it's a yuri anime instead.\\n\\n\r\nAs for the yuri fanservice...it's plentiful though obviously not \"showing much\" if any besides some forceful kissing, cosplaying and showing some skin, the fanservice is there but not going all the way.\\n\\n\r\nCharacters however well yeah it's just those four characters and all four characters have some annoyances. Hotaru's problem is her split personality problem of trying to tease and goad Yuma into their yuri NTR which does have a purpose but if anything it feels like she's padding things out for the finale. Yuma on the other hand just goes with the flow with some to little resistance and completely leaves Takeda out of the loop. Fujiwara is an asshole. Takeda is a clueless, out of the loop useless character to the entire proceedings of the NTR. Fujiwara does stir up things to Yuma and Hotaru's \"outings\" and is Yuma ultimate obstacle in \"saving Hotaru\" but both Takeda and Fujiwara as the recipients of the NTR to their respective girlfriends just doesn't evoke it as Fujiwara wants to make things worse and bats the feelings of NTR away because he's an asshole boyfriend and Takeda is useless and hardly gets hit by the NTR because he's NEVER in the situation for him to get the response.\\n\\n\r\nAnimation wise,  Creators in Pack did meh at it, besides the sloppy coloring of some of the character designs and plain boring backgrounds...it was just \"meh\".\\n\\n\r\nVoice acting wise...Ai Kakuma easily got LA's favourite voice actor with Hiromi Igarashi doing her best teasing suave vocals. LA can't say much with such a minimal voice cast of only 4 character roles.\\n\\n\r\nNetsuzou TRap if LA can sum it up it's more CFY (Cheating For Yuri) than NTR.\\n\\n\r\nLet's just hope Citrus does better...",
            "date": "2017-09-21T02:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 258204,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=258204"
        },
        {
            "content": "Netsuzou TRap is an anime centered around the relationships between the four characters, Hotaru, Yuma, Fujiwara and Takeda and shows the drama that arises as a result. To put it simply, I thought the anime was bad.\r\nHaving a story based around NTR(Netorare) would be difficult to pull off well and it doesn't do the anime any favors when the duration of the show is too short to allow for any kind of significant development. On the other hand, if the show wasn't as short as it was, I don't know if I would have been able to complete it.\r\nI thought the art style and directionwas nice and it was one of the good points of the anime. With regards to the characters, with the exception of Takeda, all of the cast is unlikable. Even if I think that it may have been intentionally done that way, it's not much of a saving grace for the show.\\n\r\nMy recommendation would be to stay clear away from Netsuzou TRap.",
            "date": "2017-09-20T19:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 258179,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5992469.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/BlackCicero",
                "username": "BlackCicero"
            },
            "url": "https://myanimelist.net/reviews.php?id=258179"
        },
        {
            "content": "I strongly believe that if you don’t like NTR anime, you won’t like this anime, not even for the sake of yuri. For me, as a 10 min break during my Wednesday, was enjoyable.\r\nTHIS REVIEW CONTAINS MINOR SPOILERS\r\nSTORY (7/10): As the length of each episode is around 10 minutes (even less, if you consider the opening and the ending), the story feels a little rush, the transition between some scenes is abrupt. I strongly believe that if the episodes length were more (~20 min), the story could have been better told. Character decisions would have been more consistent. Nevertheless, Netsuzou TRap is a simple storybut quite unique in the yuri part, in the sense that there are two girls involved betraying their boyfriends. \\n\\n\r\nThe fanservice was decent (they actually put some sexual scenes) and the comedy elements hilarious. The ending was satisfying but it leaves me with the sensation that I would love to see more.\\n\\n\r\nSOUND (8/10): Music really catched my attention. The opening is SO GOOD, “Blue Bud Blue\" by Haruka Toujou has powerful guitars that stick in your mind. Now, I automatically associated those guitars with the anime. The music for each character was also good, I feel that each theme suit its respective character.\\n\\n\r\nART (6/10): The art is not too good, not very memorable but the animation in general was fluid. There is one particular issue that I don’t like with the female character designs... the legs, it was weird.\\n\\n\r\nCHARACTERS (7/10): In a general point of view, they have weakness. Takeda is such a good guy with a big heart but lacks on the ability to notice the true behind Yuma. Yuma is overall stupid [or very slow learned] till the last chapters. But the true interesting characters here are the other couple: Fujiwara and Hotaru. Fujiwara is a completely scum, while Hotaru has motivations that if you haven’t read the manga, probably you will take time to figure out. But for the NTR thematic, each of them were realistic, everyone have met guys like Takeda, Yuma, Fujiwara or Hotaru.\\n",
            "date": "2017-09-20T13:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 258149,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6131854.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Sauchel",
                "username": "Sauchel"
            },
            "url": "https://myanimelist.net/reviews.php?id=258149"
        },
        {
            "content": "Okay so how to review this.\r\nFirst the good then:\r\n- Character designs were decent.\r\n- The Overal animation was on par for normal.\r\n- Voice actors were good. \r\nThen the bad: (Oh boy where to start.)\r\n- This is not an anime, this is a softcore Hentai.\r\n- Not appropriate to be on Anime websites or Crunchyroll\r\n- Story is garbage NTR shit\r\n- Overusage of rape scenes\r\n- Cheap heat on the main antagonist\r\n- The title is obviously shown ntr in it.\r\n- Attempting to capatalise on the weird fetish of NTR in hentai\r\n- Show is not a hentai it's meant to be an anime so most people don't want to see that.\\n\\n\r\nOveral:\\n\r\nDo not watch this garbage. The plot of this show makes Eromanga sensei look like it was written by Shakespear. I'm actually genuinely angry that this is even a thing.",
            "date": "2017-09-13T19:11:00+00:00",
            "helpful_count": 1,
            "mal_id": 257462,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5314675.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 6,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/AnimeWithMitachi",
                "username": "AnimeWithMitachi"
            },
            "url": "https://myanimelist.net/reviews.php?id=257462"
        },
        {
            "content": "Honestly, I had high hopes for this anime. I saw a certain someone dedicating a whole video for the anime adaptation of NTR (and also Citrus). Didn't know about it before that, but after watching his video I couldn't wait for this yuri anime to air... But I couldn't be more dissappointed :( \r\nMaybe it's because of all the excitment I build up, I dunno really. However these are the reasons to why I don't enjoy it:\r\nEvery goddamn character is more or less AWFUL, without exaggeration. I wanted to score \"character\" with 1, only reason I gave it a 2 is because of Takeda (whoseems to be the only somewhat ok character so far). \\n\\n\r\nI feel like Hotaru is forcing herself on Yuma, and that alone makes me very uncomfortable to watch this. Yuma clearly has some kind of sexuality confusion, so for Hotaru to force herself on her is in my opinion not ok, even though this anime is supposed to(?) be more focused on the sexual relationship between 2 girls.\\n\\n\r\nDo I even need to mention Fujiwara? No spoilers, but yeah, don't like that dude.\\n\\n\r\nTo be honest, I don't even know what I think about Yuma... She is confused, but I don't know if that's a good enough reason to keep hurting Takeda and also leading him on when she doesn't know what she actually wants :/\\n\\n\r\nI'm still gonna watch it through though, with little hope of improvement in the characters..",
            "date": "2017-08-05T12:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 254754,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6061307.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/mobergnelly",
                "username": "mobergnelly"
            },
            "url": "https://myanimelist.net/reviews.php?id=254754"
        },
        {
            "content": "I'll be honest. I didn't expect a thing from this series and I'm still disappointed. I haven't read the manga and I'm watching this anime only because I'm getting into yuri, so I'm not gonna criticise this anime based on its faithfulness towards the manga, but for what it is.\r\nI despise Netsuzou TRap with a passion and it is easily the worst anime I've ever seen, so I'm gonna get with the positives first.\r\nThe art is kinda nice and I like the yuri scenes (although they don't show anything). That's it. There's nothing else positive or enjoyalbe with this piece of trash that some peoplelike to call anime.\\n\\n\r\nFirst of all, the main gimmick of this piece of fiction is probably the worst thing about this anime and it makes the other aspects of it really unenjoyable. This anime is about a girl who cheats on her boyfriend with another girl. I'm no one to judge the kind of fetish/fantasy that this anime offers to it's audience, but adultery is a horrible act that should not be romanticized in such a way.\\n\\n\r\nFollowing with the characters, they are the four most disgusting people I've had the displeasure of encountering in a piece of media. I'm not gonna call them by their names because I don't remember nor care what they are called.\\n\\n\r\nThe pink hair girl is a complete idiot who doesn't seem to know what infidelity is, but sure likes practicing it. Even if it seems like she is geting forced to romantically and sexualy engage with the dark hair girl, she doesn't complain about her friend harassing her and she obviously enjoys it. She is a horrible person who does not like her boyfriend at all and she has him suffering like an idiot, while she kisses or fornicates with her girl friend.\\n\\n\r\nDark hair girl is even a worse person than pink hair girl. She is the one who constantly harasses her friend in a sexual matter. She seems to do this because she is fisically abused by her boyfriend, but I think this is a really stupid excuse to make her harass someone. If someone is being abused by their partner/friend/relative, they tend to abuse other loved people too, but not in the time they are abused, they do it in a more distant future, when it seems their emotional wounds have been healed.\\n\\n\r\nWhite hair boy is by far the worst of all this characters. He fisically abuses her girlfriend (dark hair girl) and he is not mad about her girlfriend cheating on him, instead he uses it in his favor to blackmail her. This character is clearly a sociopath that doesn't care about the well being of anyone but himself and there is nothing remotly relatable or redeemable about him.\\n\\n\r\nBrown hair guy is the only character I don't dislike, but he is such a poor unlucky bastard. He gets cheated by his girlfriend (pink hair girl) and he doesn't even notice although being really obvious to everyone else. He is a moron that doens't really deserve what is happening to him, but should know better.\\n\\n\r\nBeing done reviewing each character and interactions, only leaves me with the story. The plot is nearly inexistant. I mean, the characters do stuff and go to places, but everything they do is completly unimportant, being the only important parts the ones where the characters harm each other in one way or another.\\n\\n\r\nI haven't finished this series and I don't know if I will, but I highly doubt this anime with horrible and unrelatable characters, boring plot and morally questionable themes will get any good.",
            "date": "2017-08-04T17:30:00+00:00",
            "helpful_count": 1,
            "mal_id": 254711,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6240634.jpg",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AwesomeSuitGuy",
                "username": "AwesomeSuitGuy"
            },
            "url": "https://myanimelist.net/reviews.php?id=254711"
        },
        {
            "content": "Hello everyone if you're about to read this review thank you for your time.\r\n   Before I forget the show is \"NTR\" meaning to steal someones lover (in this case it's girl steals boy girlfriend reverse NTR) if you are not a fan of this I strongly suggest you to not watch or read this. I personally don't like the genre BUT it does not affect my viewing or rating of the show trust me I watch alot of hentai NTR is literally most of whats hentai nowadays.\r\n    Alright lets start this off by saying-\r\nThis Anime and Manga are both completetrash. I have reviewed the manga\\n\r\non its manga page its spoiler-free so if you wanna read that review I go into a \\n\r\nbit more depth.\\n\\n\r\n   So instead of writing a long review of why I hate the show i'll break it down into the category that it has you put your number scores in lets get started.\\n\\n\r\n  Story-I gave it a 3 \\n\r\nThis show will try to be something it's not and can be solved by just saying what needs to be said.Instead it tries to be a slice of life , drama, romance which im sorry but it can not be done in a 9 minute show source material is trash as well.\\n\\n\r\n  Art- I gave it a 8 which in all honesty I wanna give it something lower\\n\r\nThe art and animation in some parts are probably the only good thing about this show. The only time the show shines is when the taboo is happening. \\n\\n\r\n  Sound- I gave it a 3 hardly noticeable\\n\r\nAs stated above i have nothing to say about the ost op etc. its garbage i skip the op and hardly notice any ost in the show.\\n\\n\r\n  Characters- I gave this a 3 \\n\r\nAlright ready for this im going to describe the characters in a few words.\\n\r\nHotaru-\"Victim\" she the drama of the show/manga.\\n\r\nYuma-\"Pure\" she cant make up her mind on what she wants.\\n\r\nTakeda-\"Victim\"\"Pure\" this is the person they try to make you feel bad for which honestly fails.\\n\r\nFujiwara-\"Scumbag\"\"Voice of reason\" I will not spoil the show but trust me on this you're gonna find yourself saying is this guy f'ing serious.\\n\\n\r\n   Enjoyment-I gave this a 4 \\n\r\nI personally love yuri 2 girls loving each other just gets me going it looks beautiful but it can not save this show from bad writing,characters.\\n\\n\r\n   Overall-I gave the show a 4\\n\r\nHere most people will tell you. Don't put yourself into (certain character shoes) but trust me I did not I refuse to believe there are people as pathetic as japan tries to portray some NTR this show is no exception. As stated above this shows source material is bad so ofcourse the show is gonna be. Aside from that I would love to thank you for taking your time to read this and hope it was helpful in making your choice of reading or watching this show. If you would love to read something personal that I find relatable with this show please read the next section.\\n\\n\\n\r\nNow this is something on the side I stated that all the drama could be solved easily right i'll tell you something about myself. Back when I dated a certain girl it was unknown to me that she had not broken up with her boyfriend and got together with me. When I found out it was as simple as (breaking the F up) this show literally could've been something else if the \"cheating\" stopped being \"cheating\".\\n",
            "date": "2017-08-03T23:45:00+00:00",
            "helpful_count": 1,
            "mal_id": 254650,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/738999.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/xGoldenDarkness",
                "username": "xGoldenDarkness"
            },
            "url": "https://myanimelist.net/reviews.php?id=254650"
        },
        {
            "content": "If you want sweet,cute yuri love story then this anime isn't for you.The characters are dreadful except Takeda.The mc is dense as hell,Hotaru is a slut who can't keep her skirts up more than a second and Fujiwara is a horrible person overall.I feel no romantic feelings toward Hotaru and Yuma.They are no more than friends with benefits and Hotaru will only have sex with her when she is piss off with her boyfriend.Meanwhile,Yuma the the main character has as much as personality as a rock.She cheat on her boyfriend with Hotaru but doesn't think as it is cheating because they are both girls.This isthe most stupid reason for cheating I ever heard.She only hurts Takeda who is the most decent character in the series.\\n\\n\r\n I continue to watch the anime for the best guy(Takeda) hoping he will have a happy ending because there's no other reason to watch this series.Thankfully the show is only 9 minutes long.The show fanservice is not that great and average at best.The seiyuu for yuma is a great actress but I don't think she is great at voicing the character during fanservice(organasm).\\n\\n\r\n Skipping this show won't have any effect since it's quite forgetful.I recommend this show for people who are tired of watching yuri anime where  the couple may or may not kiss (You know what I mean)",
            "date": "2017-08-03T22:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 254646,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 2,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/MrFaceToFace",
                "username": "MrFaceToFace"
            },
            "url": "https://myanimelist.net/reviews.php?id=254646"
        },
        {
            "content": "I've been buying and following this series as a manga. Yuri is definitely my thing and I was pretty excited when I heard this series was getting a anime adaptation, but, looking at the studio that's doing this and their past works, I can't tell if it's the author that's the sucker here or the studio.\r\nOverall 5/10 - F\r\nThis is probably the lowest score I've given. Yuri anime itself is definitely not bad, look at Sakura Trick for example. This anime brings shame to the genre.\r\nStory 5/10 - F\r\nDownright failure. This studio is better off firing their director and replacing him/her right now on episode5 because they aren't doing shit. They are poorly adapting the manga, scene for scene with no thought at all.\\n\\n\r\nArt 6/10 - D\\n\r\nFirst episode, fair enough. It was average, 2017 art. If this was 5 years back it would be praise-worthy. Few episodes in, the art gets sloppy, inconsistent. Chibi or even half drawn characters replace some scenes and it becomes a mess.\\n\\n\r\nSound 6/10 - D\\n\r\nNothing note-worthy. It's not a failure, but its not a passing either.\\n\\n\r\nCharacter 6/10 - D\\n\r\nVoice actors were chosen poorly, the development of the characters were poor, overall it was a shitshow mess. It feels like the only actual thing in this anime are the characters and they couldn't even do them right.\\n\\n\r\nEnjoyment 6/10 - D\\n\r\nYou're better off reading the manga. This anime is a mess. The studio clearly never planned to do a decent job in the first place with 9 minute episodes and an opening that shows nothing other the 4 main characters.\\n",
            "date": "2017-08-02T22:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 254559,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5488856.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Inorichi",
                "username": "Inorichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=254559"
        },
        {
            "content": "Netsuzou TRap is a yuri NTR anime. Yuri meaning it focuses on a homosexual relationship between two females, and NTR being an abbreviation for \"netorare\" or basically a cuckold relationship.\r\nI haven't read the manga for this series and only heard of this show through popular names in the anime community touting this anime as a possible leader of a \"yuri renaissance\". Had this anime had full 23 minute episodes and characters with more than 3 emotions, maybe it could've done that, but what has been given to us is nothing close.\r\nFirst the positives. The show is not terrible. It's not a 2/10 anime, it's nota pathetic waste of time, and it's not boring. The drama is alright, the plot exists, and the animation is decent. In the 7 minutes of actual story, there are moments where you may be interested to find out where the plot goes, as well as who knows what secrets, and there are moments where you just have to appreciate you are watching some yuri (come on, we all know that's why most people watch this). \\n\\n\r\nAnd unfortunately, that's all the \"positives\" I can come up with. The main problem is that the characters each have only 3 emotions (at most) programmed into them and that REALLY makes it hard to connect with them, and in the little screen time they have, there needs to be some serious connecting going on. Speaking of screen time, I don't watch to many \"short\" anime, but in a 9 minute long show, how can 2 minutes of that be OP/ED? Why waste that time? The opening theme doesn't fit at all with the tone of the show either. Not sure what the they were thinking when they made that. Another disappointing part of the show is the pacing. In order to move the story along in a quick way, some cuts have to be made. Sadly, what they decided to cut out was all of the segways. It feels like you are watching a YouTube video with bad jumpcuts every time it switches scenes, and that ties back in to lack of personal connection this show offers. It's hard for me to resonante with a character when the scene cuts from two characters sharing a bond, immediately to a conversation at school. It's just odd. \\n\\n\r\nIn summary, the show isn't god awful, but it certainly isn't good. The story is choppy and you have to turn your brain off to enjoy it, the art is decent, the OP doesn't fit the show, and the characters are bad, but I'll probably keep watching. 5/10",
            "date": "2017-08-01T19:59:00+00:00",
            "helpful_count": 1,
            "mal_id": 254462,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4341539.jpg",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/czarryno",
                "username": "czarryno"
            },
            "url": "https://myanimelist.net/reviews.php?id=254462"
        },
        {
            "content": "this is one of the two shorter shows this season that uses LGBT for shock factor in their borderline (rape) hentai. our two main (girl) characters are friends who one of which recently got a boyfriend the other a well-known man-eater. the first girl (the one the show follows) is Yuma Okazaki and she lacks experience as this show tells us. so our other girl Hotaru pretty much lesbian rapes her to teach her things (at least what she wants us to think (as the description tells you)). groping her and making out with her whenever she can even though Yuma refuses. like I saidthis is a borderline hentai or at least it's 100% fan service. so you can judge the plot based on that\\n\\n\r\nthe art is really good so you can enjoy your groping especially if you get your hands on the uncensored later if you're a pervert which if you're watching this unironically you probably are. just as good as any other modern anime not trying anything special with it.\\n\\n\r\nthe music is surprisingly good. it's worth checking out if you're into listening to anime music on your free time.\\n\\n\r\nYuma and Hotaru are the only characters you need to worry about as the only other ones are the guys who are only around to push the maybe this is really Hotaru teaching her stuff. I talked enough about them in the story section. I like the characters for what there is. there are much worse in this genre so the bar is set kinda low.\\n\\n\r\noverall if you looking for a hentai meant for TV this is a place you want to go otherwise stay far away (sometimes it sucks to be a completionist) i'll give it a 7. (even though it is pretty good considering what it is that's as high as i will go because I would go watch an actual hentai if i wanted this)",
            "date": "2017-07-30T13:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 254247,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5049264.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BlueEclispe",
                "username": "BlueEclispe"
            },
            "url": "https://myanimelist.net/reviews.php?id=254247"
        },
        {
            "content": "9/10. The show didn't hide what it was, need a quick break to watch fan service? Well here you go. \"Might as well watch hentai\" like I'm not looking for porn I'm looking for almost-porn. Citrus was my first Yuri anime, and this the second. As being honest, most of the time I look for Yuri for the \"action\". I am a teenager, discovering what genders I like, and so yeah. I like good stories, yeah yeah. Although this story isn't something to brag about, it wasn't trying to be very good and didn't add very unneeded drama like citrus did a few times.\r\nPppft Ididn't go into a Yuri anime expecting the best plot ever, that would be nice but not what I planned to watch this for.",
            "date": "2018-12-26T19:30:00+00:00",
            "helpful_count": 0,
            "mal_id": 297009,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7459631.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LeynaSept",
                "username": "LeynaSept"
            },
            "url": "https://myanimelist.net/reviews.php?id=297009"
        },
        {
            "content": "Till episode 6 my personal fav character in this anime is FUJIWARA.\r\n\"He has such a bad boy look & is hell faithful.\r\nThe only thing he cares of is his pleasure.\"\r\nWell I think that he might be the main antagonist of the anime.\r\nYeah .He is fit to be an cool antagonist .\r\nBut the fact is:Even the main protagonist of the story , YUMA is cheating with \r\nHOTARU(though she is a girl)!!!!!!\r\nIn the latest episode i saw that fujiwara caught the 2 girls in a lesbo relationship.\r\nThey dont hv any guard to save them & now all they can do is beg for mercy towards him.\r\nThe pointis : ALL THE 3(YUMA, HOTARU & FUJIWARA) are equally unfaithful\\n\r\neven though yuma may be feeling guilty for cheating,but she cant resist herself to not fall for hotaru \\n\\n",
            "date": "2017-08-11T09:04:00+00:00",
            "helpful_count": 0,
            "mal_id": 255192,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Red1000r",
                "username": "Red1000r"
            },
            "url": "https://myanimelist.net/reviews.php?id=255192"
        }
    ]
]