[
    [
        {
            "content": "First off, I want to say To LOVE-Ru Darkness is not for everyone.\r\nThis show is NOT for people who hate fanservice and/or harems. This show IS for people who love tons of ecchi, harems, and more ecchi. To top it off, To LOVE-Ru Darkness actually has... wait for it... a plot. *Gasp* Really?! Yes, it does. It's not just mindless fanservice (although that's cool too). You should definitely watch this show if ecchi is your thing.\r\n...But you all probably knew that since this is the third season of the To LOVE-Ru series and you've seen the first two seasons (To LOVE-Ru and Motto To LOVE-Ru,respectively). If you haven't, then there really is no point in reading this review! Go check out the first two seasons! \\n\\n\\n\\n\r\nNow, there are a few things I want to go over about this show:\\n\\n\\n\r\n1) Story - 7/10\\n\\n\r\nYou claim all ecchi shows have no plot? Think again! At first glance, the To LOVE-Ru series might seem that way, but in reality it has many arcs that keeps pointing in one direction. Sure, it's not going to be some mindblowing masterpiece like Death Note, but how can you even compare TLRD to something so different?! We have to realize that the main goal of the show is to make us go crazy over which heroine the male protagonist will choose in the end. So far, it has done that well.\\n\\n\r\nHowever, like I've said before this show does have a bit of a story. I mean, there are two girls from outerspace trying to accomplish different things with the male protagonist. Conflicting things, if I might add. Then you get to see many girls on earth who show interest in the male protagonist. Well, it doesn't stop there because in TLRD there are even more girls from outerspace trying to accomplish things with...you guessed it: the male protagonist.\\n\\n\r\nOf course, if you are Momo Bella Deviluke such troublesome things look more like a great opportunity. So for an ecchi-harem, To Love-Ru should please many (in more ways than one ;)).\\n\\n\r\nDon't get me wrong -- Yeah it does have a story but it's still considerably weak. It isn't anything compelling but there are moments where it leaves you wanting more. It's enjoyable nonetheless. I'll leave it at that.\\n\\n\\n\r\n2) Art - 10/10\\n\\n\r\nThe To LOVE-Ru series has come a long way in terms of artwork. In the first season, the visuals were great for its time. But damn, the second season and third season turned it up a level or two.  The scenery, the characters, even the small background objects look amazing. However, I remember reading forum posts and reviews criticizing the second and third season's artwork. You see... when the studio colored the characters, they added this shiny gloss to them to give the illusion of rounded body parts (i.e. the chin, elbows, knees). Not a lot of people liked it but personally I loved it. I think the studio made a good decision keeping the artwork for TLRD the same as the second season. \\n\\n\r\nSo overall, I think the show has beautiful art.\\n\\n\\n\r\n3) Sound - 8/10\\n\\n\r\nSince it has been a year or two since the last season finished airing, To LOVE-Ru Darkness may come as a surprise to you in the sound department. Beginning with the OP song, I found it to be very good. It's called \"RAKUEN PROJECT\" by Ray. It's sort of a mix of electronic/dance music with rock. It threw me off a bit because the first few seconds sounded like the last few seconds of an ED song. I literally said \"Damnit, this isn't the real version of the episode!\" However a few seconds later you get to the \"actual\" part of the song. It's a really good song. Kinda stuck in my head now...\\n\\n\r\nAbout the voice actors - You may find that you dislike the chosen voice actors for some of the characters in the show. I remember when I watched the first episode... I was wondering why the girls sounded so much younger than they looked. I thought for a second maybe they changed voice actors since the last season because I didn't remember them sounding like this. So I did a little research but found out they used the same voice actors as last season. I shrugged and decided to just watch through the first episode and hope that the voices grew on me. Well what do you know? By the end of the episode I wasn't thinking twice about having someone else voice the characters. You might appreciate the voices even more when you get to the \"naughty\" scenes ;).\\n\\n\r\nThe background music was very good too. Subtle, but good. There is usually a ballad playing when it gets to storytelling time and an upbeat soundtrack during the rare intense scenes (fighting, heated dialogues with enememies, etc.). There aren't many sound effects besides the occassional boob/ass grab. Even I found that hilariously good.\\n\\n\r\nI'm not particularly fond with the ED song. It's called \"Foul Play ni Kurari\" by Kanon Wakeshima. It is a fast-tempo song with a string orchestra. A good song, don't get me wrong but for an ending it's a bit too 'cutesy'. I would have preferred a rock song with a bit of a ballad-edge to it but this song is good, too.\\n\\n\r\n4) Characters - 9/10\\n\\n\r\nOne of the first things you will realize in To LOVE-Ru Darkness is the lack of Lala Satalin Deviluke. In the first two seasons, she was the main heroine but she has since dwindled into just another heroine subject to equal competition. Actually, she doesn't even get as much screentime now. I really miss her and I find myself happy just being able to see her even for a second.\\n\\n\r\nSadly, because of all the new characters the show has pretty much changed from being a harem that ends with a relationship between just two people into a harem that strictly aims to create a harem ending. I have mixed feelings about the change. On the one hand, I want Lala to win but on the other hand I'm starting to see myself change opinions because of the numerous interactions the other characters have with Rito.\\n\\n\r\nLet us begin with the male protagonist. Yuuki Rito. He's a pretty typical character. He's clumsy, thick-headed sometimes, but a good person inside. Many girls like that about him. What makes him stand out though is the fact he's notorious for getting into situations that end with him being on top or under a girl. Sometimes he's naked. Sometimes the girl is naked. Sometimes they're BOTH naked! Top that off with just plain dirty and awkward hand positions like breasts/butt-groping, face-in-crotch/butt/breasts and you have one lucky bastard (minus the fact he usually gets punished for it after).\\n\\n\r\nThen we have Yami the Golden Darkness. Yami for short. Yami is a quiet kuudere/dandere whose mission is to kill Yuuki Rito - although she doesn't really seem to want to do it. In the first two seasons, we didn't get much of her. She was just another character in the story for the most part. However, in this season it focuses on Yami and uncovering her past. This goes back to me saying that this show has a story!\\n\\n\r\nMea Kurosaki will be the first new character you'll be introduced to in this season. She is an assassin who was sent to earth by a master to monitor Yami's actions. By the way, Yami and Mea are sisters. They both have the ability to transform their hair into weapons and such. Although she appears to be nice (and sometimes curiously perverted) on the outside, she has a dark heart just like Yami. She's like the second best character in the show IMO. I really like her dirty schemes haha. You get to see more of that later on.\\n\\n\r\nNow...Momo Bella Deviluke. Oh my goodness...she is AMAZING.To me, she's the best character in TLRD. I even dare say she is one of the best female characters of 2012. Not many will agree simply because they don't know about the show but those who have watched To LOVE-Ru Darkness will agree. They have to! I mean, c'mon she's what fuels the fire in the season. The perverted tactician would be a suitable title for her. We mostly see the story from her perspective. Her main goal is to be with Yuuki Rito, but she's okay with Yuuki Rito ending up with every girl. Wait. She isn't just okay with it - she WANTS it to happen. She ACTIVELY pursues that goal! That's why she is so entertaining to watch. And just wait until you see her extremely perverted delusions. It's hilarious!\\n\\n\r\nI'd talk about the other characters but there isn't much to say. That is not to say they don't have any character development because they do. Run/Ren Elsie Jewelria is one good example of a character with good development. There are a few more characters that have yet to be introduced but I don't want to spoil it and say what happens so just watch the show!\\n\\n\r\n5) Enjoyment - 10/10\\n\\n\r\nLet me keep it brief: I enjoy this series so much. It is definitely the best ecchi/harem series I have watched in the past two years of my anime life. This show is so damn hilarious and entertaining to watch. I even end up watching it as soon as it comes out despite not having subs! All because I'm impatient and want to watch the show as soon as it comes out.\\n\\n\r\nIt's not that bad for me to watch it raw though because I'm up to date with the manga and know a bit of Japanese so I know what's going on. But anyways, 10/10!\\n\\n\r\n6) Overall - 8/10\\n\\n\r\nOverall, I find To LOVE-Ru Darkness to be refreshing. Even though the show does an extremely good job at it, ecchi is not the main reason why this show is good. The main reason why this show is good is because of the story, artwork, and characters. Without those three, the ecchi would lack a lot of substance. I know it's weird saying that because people think those who watch ecchi are pleased with just boobs and butts but NO. We want more! And where do we find it? In To LOVE-Ru!\\n\\n\r\nSo go ahead and watch To LOVE-Ru Darkness. I recommend it to anyone who enjoys a good ecchi show. Perhaps even those who don't watch ecchi that much but have an open-mind. Try it out and see.\\n\\n\\n\\n\\n\r\nThanks for reading my review. Thank you even more if you read everything I wrote and not just skim through it. Yes, I consider them two different situations. You know it's true. :)\\n\\n\r\nPlease hit the 'helpful'' if you find this review helpful.\\n\r\nEven if you didn't find it helpful, I appreciate you checking it out.\\n\\n\\n\r\n- DesolateOne\\n\\n\\n",
            "date": "2012-12-21T13:05:00+00:00",
            "helpful_count": 307,
            "mal_id": 80798,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/420150.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rezurrekt",
                "username": "Rezurrekt"
            },
            "url": "https://myanimelist.net/reviews.php?id=80798"
        },
        {
            "content": "There can only be one series that would be considered the forefront of a particular genre that currently gives it its own identity or face; that series in question would be To Love Ru. It has had a rough start in its adaptation to the original source material by not providing a coherent narrative to the manga. Eventually it has made a name for itself for being the aforementioned forefront of Ecchi thanks to the later seasons that are somewhat “reboots” in the pure sense of the word reboot. Now comes To Love Ru Darkness, which is a separate manga that continues the story ofTo Love Ru, to breathe new life to its characters and comedy. To put it bluntly, it is a triumphant sequel that exceeds all expectations.\\n\\n\r\n“That’s perfectly natural behavior for a living creature,” says Mea Kurosaki. This quote itself, in which the word “that” is supposed to signify sexual thoughts, is what encapsulates the entirety of To Love Ru Darkness’s charm as a whole. It tells us how we should view Darkness as nothing more but a fun joy ride through joyous comedy and beautiful girls through sexual feelings, but we shouldn’t be ashamed by this mere fact alone. That is one of the main selling points of the show, in that it lives off of making us feel excited through hilarious incidents of girls in suggestive situations without making it feel demeaning or deliberate to either of the sexes. This aspect alone that To Love Ru Darkness expresses should be an example that all Ecchi shows should follow in the near future, which sadly isn’t always the case.\\n\\n\r\nNow to express how all the things I mentioned in the previous paragraph work unlike in most shows in what Darkness follows, the one thing that absolutely works is how every character all carry the show with their likability despite their very cliched nature. Cliched in the sense that you have Yui Kotegawa who is the stereotypical tsundere who wants order in the classroom, Nana who’s another tsundere, Mikan the younger half-sister who loves him, Yami the Dandere psychopath, and Haruna who the protagonist has feelings for yet she so happens to be in love with him as well. Despite how many would view cliches as a negative term, however, the way how Darkness handles them is through sheer charm and personality that make them feel energetic and alive. You even feel contempt for them whenever drama happens between the characters even with their stereotypical archetypes. However if there is one character that must have one full paragraph alone to analyze would be the one and only Momo Deviluke.\\n\\n\r\nBecause of the fact that she is the new heroine of the series, replacing Lala, Momo is what makes Darkness so special and wonderful to experience. Thanks to the glorious voice of Aki Toyosaki, Momo’s sarcastic and devious personality makes her such a delight to see on-screen when she is having one of her humorous fantasies and her clever schemes to make the girls fall more in love with Rito. With these things in mind, you might think that Momo’s personality only give off this one-sided aspect of it, which is mostly being a devious pervert throughout the entire show. I would like to describe a scene that happens in the last episode involving her and Rito in a gym closet room. Momo is on top of Rito seducing him as usual until we suddenly see Rito finally give into his instincts and do the same things to her and then we suddenly see Momo in a very vulnerable state. It isn’t until later that we find out it was just another fantasy that Momo was imagining while on top of him. This fantasy she envisioned took her by surprise, something of which we never see her go through before. It wasn’t until Rito finally tries to stop her by putting his hand on her arm which suddenly surprises her and jumps away from him quickly in fear and respite with her constant breathing and blushing face. We now see Momo in a completely different light than we are used to seeing her before. It is this scene alone that makes Momo a three-dimensional character by not through general exposition, but through character interaction.\\n\\n\r\nSomething that has changed from previous installments of the series is the art direction. While all of the characters still look the same, everything is now colored in very bright overtones. While many can argue that Motto To Love Ru art looked more better in terms of how the characters looked, that should not disregard that Darkness’s art still looks great in keeping the traditional manga art in context with the show. One thing that I’ve always admired the series and more so in Darkness is how they’ve always drew the girls and their figures that actually look very gorgeous without overemphasizing anything on their body like many other ecchi shows tend to do. Thanks to this, the girls actually look like High School aged girls who have just hit their period of going through many changes in their body and not the other way around.\\n\\n\r\nTo Love Ru has not been widely known for having an impacting story to show forth underneath its charming fan-service; it wasn’t until Darkness where we actually do have one that fills this very gap. Generally most people will think that the writers wouldn’t bother with writing a competent story being the fact that it is an ecchi series and those typically don’t go so well. While Darkness doesn’t break any new ground in this aspect, it does have an interesting twist in the harem genre where the heroine is actually the one doing all the work to help our protagonist get all the girls. Like I mentioned with Momo’s schemes, her intentions on doing these are very well-handled in how it balances sweet romantic moments and pure fun comedy. There isn’t a sudden tonal shift between drama and comedy in an effort to make it edgy, thankfully. The plot might not be a deep one to experience, it doesn’t really try to be one in the first place and sticks with it which is very well appreciated.\\n\\n\r\nRito himself as a protagonist, I would say, can be grating at times in how slow they build him up to be a harem leader after years of seeing him constantly getting flustered over women falling over him. In Darkness, it still portrays Rito as if he hasn’t experienced a girl falling on him in a questionable position before even though we’ve seen him in the past in these types of position countless times before. You’d think he would get used to it by now and not be phased by it after all these months but nope. For what he’s worth, he still has some moments where he comes across as caring and likable to everyone he meets so there’s never really a moment where you think to yourself, “Why would any girl fall in love with this boy in the first place?”\\n\\n\r\nOnto the comedy itself, needless to say there will not be one person who is into suggestive comedies to be disappointed with Darkness at all. Almost every situation is handled with great comedic timing, whether it be a scene involving Rito and a girl bump into each other and, in true ecchi fashion, be in a very awkward position to the public to see or a scene that’s in a constant pace in showing jokes that involves hilarious dialogue between characters; a great example would be between Nana and Mea or Momo, or vice versa. Not all jokes hit the right notes throughout the entirety of the show’s duration but for what it’s worth, it will nevertheless entertain the masses who, like myself, love to engage in hilarious perverted comedy.\\n\\n\r\nNot only do the characters themselves make the show enjoyable to watch, but the voice acting is what gives them their absolutely endearing personality through the sheer talent that Darkness brings to the table. I’ve already mentioned Aki Toyosaki previously, but she’s not the only great Seiyuu in the casting. Kana Hanazawa plays wonderfully as an upstanding little sister for Rito and giving Mikan a clear voice that feels perfect for her. Nana and Momo prove to be one of the best sister duos in anime thanks to the great chemistry between Itou Kanae and Aki Toyosaki, who have previously worked together in a somewhat similar situation in Railgun. Only this time it’s Aki who plays the devious one instead of Kanae and it definitely shows that Aki’s voice really does fit with that archetype more than Kanae. Finally we have Kaori Nazuka as Yui Kotegawa, probably one of the best tsundere roles we have had in a long time. Her authoritative voice, combined with childlike embarrassment will surely make any man’s, no matter what age, heart burst with joy and pure ecstasy.\\n\\n\r\nWhat it all comes down to is that Darkness won’t win any new fans that aren’t into something like To Love Ru, but even with that said it is something that you should still at least try to see once to see if it pulls you in. Anyone who is in fact a fan will feel right at home with this new installment that has so much to offer for ecchi fans and people who are fans of the series for more than the fan-service. It will be funny and sometimes heartwarming in its romantic undertones for everyone who has followed the franchise since the beginning. That will ultimately lead to us hunger for more and for now with the OVAs coming out here and there to continue it. For now, Darkness is more than enough for us to enjoy while we wait for the next big anime installment for To Love Ru.\\n\\n\r\nGrade: A-\\n",
            "date": "2013-10-26T16:31:00+00:00",
            "helpful_count": 95,
            "mal_id": 118385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=118385"
        },
        {
            "content": "...and the reward for best Ecchi anime of 2012 goes to... To LOVE-Ru Darkness!!! \r\nThose of you who do not like Ecchi/fanservice anime might want to stop reading here. This anime focuses mainly on these two things and will most likely not be for you. Now for those who are in to Ecchi/fanservice, I will tell you why i think To LOVE-Ru Darkness is so great.\r\nTo LOVE-Ru Darkness is a sequel to the original To LOVE-Ru series. I highly suggest watching To LOVE-Ru, Motto To LOVE-Ru, and all the OVA's before you watch Darkness. For those who have watched and are familiar with the ToLOVE-Ru series, To LOVE-Ru Darkness continues straight off from where Motto To LOVE-Ru leaves off. It - believe it or not- actually has a plot to it that extends for more than one episode.\\n\\n\r\nThe story this time mostly focuses on the alien princess Momo and her harem plan for her beloved Yuuki Rito. We also get a some back story about Yami, who was a side character for most of the To LOVE-Ru series. The plot is nothing special, but it is still pretty good. We get random nonsensical episodes here and there, then we would be thrown back into the actual story. There is a good balance of serious scenes and comedic scenes that makes the series quite enjoyable even if you do not like Ecchi that much.\\n\\n\r\nAn important thing to remember is not to focus too much on the plot though. Like the other To LOVE-Ru series, the story should not be taken too seriously. The issues do not even get resolved by the last episode, so yes it is a cliff hanger ending. What truly carries this series is it's very appealing fanservice.\\n\\n\r\nThat brings us to the artwork. The backgrounds are extremely bright and colorful. The characters are beautifully drawn and very hot. If you are looking for an anime with a cast of very sexy girls doing borderline hentai stuff, then this is what you are looking for. The only problem is the bright lights of censorship, but those will be taken away in the blu-ray releases.\\n\\n\r\nThe characters are really nothing special though. Yes, they are all pretty, but their personalities are as generic as you can get in anime. The way i see it, you can split the characters in to two groups. One side has all of the girls who want the main character, Yuuki Rito , and will be all over him when ever they get screen time. The other side also likes Rito, but they are too shy to express their feelings. Pretty normal for a harem anime.\\n\\n\r\nDoes this mean that they are not fun to watch? Hell no. Watching their hilarious and erotic interactions with Rito has been great a experience. Many of these scenes are very risque, so it would be best to turn down the volumes and lock your bedroom doors. This is probably the best part of To LOVE-Ru Darkness. Some of the scenes might seem a bit cliche- like the classic falling over and groping a girl's chest scene- but it can still be very amusing. Enjoy To LOVE-Ru for the Ecchi/fanservice because that is where this show excels the most.\\n\\n\r\nSo what is my overall opinion of this anime? It's a great show, but definitely not perfect. Its ability to only attract a specific audience- the Ecchi/fanservice lovers- severely lowers it's potential. For those of us who do favor fanservice heavy shows, then this is like a treasure among treasures. Definitely give this a shot because you'll like what you see.",
            "date": "2012-12-31T14:35:00+00:00",
            "helpful_count": 40,
            "mal_id": 82140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1488843.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_Pro_At_Stuff",
                "username": "The_Pro_At_Stuff"
            },
            "url": "https://myanimelist.net/reviews.php?id=82140"
        },
        {
            "content": "To love ru darkness, brings up the new hope about how a harem anime which usually have negative comments can make all that comments gone. A common knowledge to all the anime lover that harem anime is usually is lack in the plot and story, since what makes harem anime interesting is fanservice and all beautiful or moe girl. If you have ever  seen The World God Only Knows then maybe you have seen a  good example how a harem anime can turn into from fun harem into a serious harem anime (in story aspects).\r\nBack to the To Love Ru darkness , ifyou have ever seen the previous season of To love ru darkness (To love ru and Motto to love ru), maybe you will realize the \"gap\" between this anime between the previous season. Not just from the score (which TLR darkness have bigger score than the two previous) but also from story aspects. if those previous seasons are TOTALLY random and doesnt have strong  plot or story then this anime was 180 degree between those  two. honestly, i really feel relieved since To love ru is getting better in each season, from the season 1 which is  really abstract and season 2 which like a gag anime and to  the season 3 (TLR darkness) which i felt like my effort for watching this series is paid off.\\n\\n\r\nTo love ru darkness or we can called TLR darkness, is focussing on Momo (Lala's sister) and Mae (Yami's sister) story. As for Mae, she is the new character that just appears in this season. Anyway, this anime has two main story, for the first one is Momo obssession to make a harem plan for Rito, since she thinks with the harem plan Rito can make all the girl happy, and for the second was about Mae and Yami (i am not gonna spoil it). So, what makes this season differences between those two previous season? First it was the story itself, So this series FINALLY have a story? YES IT IS! we have a main goal and know what this story about, and it obviously different with other season, like Motto To love ru, until i had finished Motto, i still dont know what the story about and it really like Shinyraku Ika Musume which have 3 different stories in each episode (I love Ika musume), but honestly it didnt fits well for a series like To love ru.\\n\\n\r\nBack again to TLR darkness, after the story lets talk about the art. This maybe the whole reason why people love to watch TLR darkness. I am not gonna exaggerate it but it was superbly amazing! my first impression was extremely colourful and, so bright. The lines for the character design is really have a high quality art, like from the each character's hair or body. If you comparing between the art quality between the season 1 or season 2 and this season, you wil realizel see how big the gap between those season. Not just from the art for the character itself, the background was suprisingly really well-made. It was colourful, beautiful, and gorgeous. My eyes were never tired to watching the quality of this anime, my suggestion is you must watch this anime in the highest quality to improve the enjoyness.\\n\\n\r\nThen, lets moving into the sound section, first lets talk about the opening songs. \"RAKUEN PROJECT\" by  Ray. Honestly i dont really care about the opening songs in every anime but then i thought i might give it a try. From the first i listen it, and its directly raping up my ears. I totally love it, what makes more awesome is the video clip in those opening, it was heartwarming (especially in the end of the songs when Mae and Momo hugs Rito) not just the video clip, the lyric is really describing on what TLR is about.  for me it was really fits with the anime and yet its a lovely song to hear. And for the ED, i didnt really paying attention to it, since it doesnt so special.\\n\\n\r\nFor the seiyuu,i dont find any negative things in here. Oh! For the new character, Mea which is being sounded by Yuka Iguchi (the seiyuu for Tsukihi from bakemonogatari and Maria from boku wa tomodachi) is really good, its really suitable with the Mea's traits which is taciturn and sometimes being naughty. as for the other main character in this series like Momo, Aki Toyosaki really did a good job for being a seiyuu for Momo. It was cute and easily grasp every viewer who're listening her voice.\\n\\n\r\nAnd, finally, the character section. The character in this series is probably what makes this anime so special. Since in this series we will have a good developments between each character and more, We have nearly 8 or more CUTE girls that appears in this series not to mention how lucky that Rito being loved by many cute girls. because of so many girls that appears in this anime, i will just describing the main character in this series.\\n\\n\r\nFor the first, we have Mea Kurosaki. The new character that appears in this season series. Mea is like Yami, she is an assasin who is being sent by \"master\" to look for Yami, like i said before Mea is Yami's sister, so they same kind of ability that can transform their body into a weapon.On the first impression, you will see her as a taciturn girl and emotionless, but as far as the story goes, she had developments in her characters and of course the \"love\" development between Rito and her. its harem anyway.\\n\\n\r\nThe Second one is Yami, as we know from the previous season, she appears to be a dandere girl , which is cool and taciturn. She is also a loner and more She states she hates \"ecchi\" people, and does not hesitate to assault a person who looks at her in an obscene way, and usually Rito is the victim of this. lol. For this series, we will see the development between Yami and her friends.\\n\\n\r\nThe third one is Momo Devilluke Belia, she is Lala's sister and Nana's twin, she appears to be a naughty girl which is usually tease Rito in her way, despite of her action, she really loves Rito even she makes a harem plan just for Rito and even she is always protect Rito from any dangers .The last one is Rito, our main character in this series. I dont have many words for him, one sentence for me, He is a lucky guy who is being liked by many cute girls!.\\n\\n\r\nI do really love with this series especially this season, because they had improve their quality like from the story and the art. But of course, there is nothing that perfect, so does this anime. Still there was unnecessary fanservice that really distrubing my eyes, Like how Rito is always trapped in such ecchi scenes (like he is usually grabbing boobs absently or how he trapped in Yami's panties without any logical reasons), but despite of that unnecessary scenes, i know that scenes were made to refresh our eyes. And of course its acceptable since this anime genre is Ecchi, honestly, although i found that unnecessary, as a man i must said it was kinda fun.\\n\\n\r\nAt the last, I must say i quite enjoyed this anime. I really surprise on how this anime can improve are, from such a fail anime turned into an amazing anime. of course, thanks to Momo and Mea as the new character that makes this anime more lively and fun.\\n\\n\r\nThe summary for this review :\\n\r\n+ Finally has a strong plot\\n\r\n+ This season have some improvement than the previous one\\n\r\n+ Amazing OP\\n\r\n+ A good developments between each characters\\n\\n\r\n- Unnecessary fanservice scenes that sometimes didnt really make a sense, but oh well. Its ecchi anime anyway\\n\r\n- There is still fillers episode\\n\\n\r\n*Thanks for reading my review! If you found this review was not helpful or doesnt good enough,please message me. I really appreciate any feedbacks*",
            "date": "2013-07-18T18:42:00+00:00",
            "helpful_count": 31,
            "mal_id": 105911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=105911"
        },
        {
            "content": "Happy New Year to all of you out there, ok so it's yet to be a new year here in Mexico but in a few moment from now it will be, so I'm preparing my little friend a Glock 9, yes here in some dark recess of Tijuana Mexico when we say we celebrate the New Year with a bang, we really do mean with a BANG!!! But enough of that, so let get down to business, so what we have here is a sequel from the season 2 of the parent anime \"To Love Ru,\" except this has more to do with Momo's planto organize Rito's harem, TBH this sequel has no story in it just a setting and a chaotic plot which was centered around Momo's plans for Rito's harem with a little bit of arcs that comes to Rito every now and then which is pretty usual from the season 2. And that's as good as it gets, oh, and there are still those unusual circumstances where the Rito get's into which always spells 'TROUBLE.\" So for the story I give it a \"Decent 4.\" because the chaotic plot was compensated by the comedy and ecchi genre.\\n\\n\r\nArt and sound: Mediocre 5.\\n\\n\r\nAs usual there is that boob flashing, close up panty shots and close up booty calling that are censored just like from it's previous sequel , so to be able to view this anime without the censored, it's advisable to wait about a 1 year after it's airing, since the links would now show this anime uncensored, but that still depends on the link that one might have access to. Co'z some links still maintains archive anime whose intense ecchi  genre are censored. as for the sound, I just don't have any comment about it.\\n\\n\r\nCharacter and Enjoyment: Fair 6.\\n\\n\r\nThought, this sequel goes against the Lala X Rito arc with Haruna on the side, it very clear that in this sequel one must now forget the Lala X Rito X Haruna arc and focus on the Momo X Rito arc with Mea on the side. The arc may contradict the usual arc of the 1st season, but here the new arc is not bad at all in fact it was nice that Rito gets to have something different, however I still hate it that Rito still hasn't got the balls to confess his feelings for Haruna.\\n\r\nNow, I do notice that Yami was supposed to be the main character here, but it kind of looks like that what she does is no different from what she usually does from season 2, the only that charge was the amount of aired time she has. It is quiet disappointing that   studio Xebec tends to mislead about that character set up, co'z it looks more like that Rito, Momo and Mea are the real main character's here  than Yami, besides wasn't this sequel titled \"To Love Ru: Darkness?\" In which we the audience were expecting that Yami was suppose to be the main protagonist here, but instead a new comer 'Mea\" is the one taking the spot light here as the antagonist, other than that nothing much has change about the other characters in this sequel. The enjoyment part is basically revolves around that ecchi and the comedy genre which was usual from season 1 to season 2. But, it was Momo who serves as the driving force of this sequels comedy aspect, thought it was also a disappointment that we the audience never get to see Mea's boss, with that and the chaotic plot I limit it to just 6. \\n\\n\r\nOverall: Poor 3.\\n\\n\r\nIt is probably safe to say that the 1st season was better than the 2nd and this 3rd season. Because in the 1st season thought it does share that same usual genre, the executions were different, season 1's plot basically follow an organize scenario while season 2's plot was based on a per episode basis, and in this sequel the plot is on Momo's harem plan for Rito, but generally everything is on Momo. Also, about this sequel's title  was a bit misleading co'z on paper it was titled \"To Love Ru: Darkness\", but it looks like studio Xebec unofficially titled it \"To Love Ru 3,\" now I can't say if the \"3\" in what we see as the last word for this anime's title is a Japanese katagana symbol for \"Ru\" or is it actually \"3\" as in the number 3. Then again who cares? Well, I wish everyone to have a prosperous year for 2013. \\n\\n\\n\r\nWell, the bullets for my Glock 9 have just arrive we'll be doing some aerial shooting once the clock hits 12 midnight to celebrate 2013, man I wish I could use it to shoot that MAL user that pisses me off, if I can locate him. If that SOB is reading this you know who you are.",
            "date": "2012-12-31T13:51:00+00:00",
            "helpful_count": 22,
            "mal_id": 82128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=82128"
        },
        {
            "content": "There is action in this 3rd season in 2 kinds of ways ;)\r\nThis 3rd season is the alot better than the other seasons were, in that it actually has a story going and that there is action in it. Some parts are intense and some parts are pretty funny\r\nI think they might make another season after this, but maybe the OVA will wrap it up. This season is mostly about Momo, Yami, Rito, and new girl Mea (she reason this season is intense)  Lala barely as a role at all this season so far.",
            "date": "2012-11-12T21:55:00+00:00",
            "helpful_count": 17,
            "mal_id": 77363,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1496221.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/LawlumBawlum",
                "username": "LawlumBawlum"
            },
            "url": "https://myanimelist.net/reviews.php?id=77363"
        },
        {
            "content": "So I've watched the whole series and I must say if you are a fan of echi/harem stuff then this IS the perfect anime for you.The course of action is quite hilarious as the plot advances and the characters develop around the protagonist. I had hoped for the action to circle around Rito and the three princesses,if you have seen the series you know what I mean,but it still enjoying to watch. I am still hoping to see the day when Rito fulfills his destiny and Momo's dreams come to reality, wouldn't that be quite a scene? All in all To LOVE-Ru is a seriesthat can compete with any other anime and has a great chance of winning",
            "date": "2012-12-31T00:07:00+00:00",
            "helpful_count": 14,
            "mal_id": 82080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=82080"
        },
        {
            "content": "So far To LOVE-Ru Darkness seems just fine to me. But that could be because I love ecchi and harem anime. The story although has become more compelling. Fan-service is huge in this anime, and when I say huge I mean the freaking empire state building. But again I love ecchi so that's a plus for me. Personally I like the sound track to the point where I would actually buy the CD. The characters don't change much from the last season, although you are introduced to some new characters. Rito is again constantly falling on girls in silly ways. But there was something aboutthis season that sent a different vibe down my back. I don't know, it's probably like the name suggest, a darker vibe. I always loved the art for to love ru and I still love it now. Oh and one more thing, BUMP ALL DAT CENSORSHIP, DA HELL, IT'S FREAKING ECCHI. I WANNA SEE SUM NIPPLES. \\n\r\nSo if you love ecchi like me wait until it's released on blue-ray. Otherwise, get used to random white lines and fog.",
            "date": "2012-10-31T19:44:00+00:00",
            "helpful_count": 14,
            "mal_id": 76365,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1373901.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/blakedueson",
                "username": "blakedueson"
            },
            "url": "https://myanimelist.net/reviews.php?id=76365"
        },
        {
            "content": "To Love-Ru Darkness is the third installment in 'To Love-Ru' series and as the previous two it tries to overload the viewer's reward system in the brain by flooding the screen with symmetrical breasts, symmetrical butts... and more breasts. Darkness rises above all other ecchi series so high that it's at the top of the ecchi grading scale. A story about a mushroom that grows up in a humid forest would get 0% whereas Darkness would be the polar opposite with 100% ecchiness present. Let me put it this way, if you put any more ecchi into an anime series the earth would collapse pastits schwarzschild radius and create a black hole. \\n\\n\r\nNow, let's describe darkness in detail. Firstly, the story progresses much further than in the previous two installments. Right off the bat, the characters and the plot are re-introduced to us, which surprised me pleasantly and I thought it was a good move on the part of the creators in case someone took a long break from To Love-Ru or anime in general. \\n\\n\r\nMomo, the third of the Deviluke sisters assumes the position of the main character along side Rito in this season. The plot focuses on her attempt at monopolising all the girls for Rito, solving the succession debacle and helping Rito awaken his carnal desires and taking his place as the rightful ruler of the galaxy. Sounds like something out of a Ming Dynasty documentary, but it is genuinely hilarious and guaranteed to raise an eye brow or two as Momo's actions often have adverse effects. The boys at the school have enough of Rito's shenanigans, the girls keep molesting him mercilessly and the principal is up to his old perverted tricks. All in all, a positively entertaining WTF-fest. \\n\\n\r\nApart from the usual, we're also introduced to a couple of new characters like Kurosaki Mea and Tearju Lunatique and their appearance starts answering some questions that were on the minds of no doubt many watchers at the conclusion of the second season. Despite the ecchi silliness and lots of \"what in the heck did I just watch?\" moments, the plot actually thickens, revolving around the past of the main characters and some of the issues they're struggling with.\\n\\n\r\nAs the previous two 'To Love-Ru' seasons, this one is inconclusive which means that we'll be seeing more of Rito's/[enter Devilukian princess name here] hot tail-licking action in the future. \\n\\n\r\nNow the sound and art both improve from the previous two seasons. The visual aspect here is absolutely mouth watering and attention has been paid to every detail - not only the girls. Buildings, trees, even the god damn pavements are sexy. Likewise, voice acting is spot on and the opening and ending songs nicely composed. Perhaps the only thing lacking in the sound department was the OST. It didn't have any songs that stood out or affected the viewer's emotions, it was rather plain and dull. Then again, it's hard to expect a good OST in an ecchi anime. \\n\\n\r\nSumming up, To Love-Ru Darkness is a very good continuation of the series and offers more in terms of the plot and character development. Of course, at the same time we get to laugh at the various bizarre mishaps that Rito and the others go through in their daily lives... and the tail fondling. Dear god. If anything, watch it for the tails. \\n\\n\r\nA solid 8 points from me. \\n\\n\\n\\n",
            "date": "2013-07-26T08:12:00+00:00",
            "helpful_count": 10,
            "mal_id": 106925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=106925"
        },
        {
            "content": "To love ru darkness is a direct sequel, but unlike it's pequel, it's focus more on the characters and the story.While some might say that the \"harem plan\" is stupid, it gives rito a chance to develop and give screen time to the girls who didn't get as much as before.\r\nThe story start as simple but very quickley we can see that there is a more \"mature\" tone to darkness than before-it's tries to bring an actual plotline, while focusing mainly about yami and her past, thus creating a very interesting plot. Although the shame is, that rito doesn't really feels like \"main character\" anymore,but I hope that as the series will progress we could see more about him.\\n\\n\r\nMost of the characters are likeable and the fanservice is simply great. We got pleny of girls we can root for and frankly, I hope for a harem end because it's very hard to decide which is \"the best\".\\n\r\nRito is likable MC because he is very nice and help the girls, the girls all have a unique trait of it's own.\\n\\n\r\nThe comedy is okay I guess, there are some very fun scenes and some are repetitive, but all in all it's ok.\\n\\n\r\nIt's a very fun series to look at if you are looking for some echii fanservice stuff, a great way to pass the time is by looking the almost naked girls in this show.",
            "date": "2015-04-08T15:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 185158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3677263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DanDan_Mushi",
                "username": "DanDan_Mushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185158"
        },
        {
            "content": "* * * THIS REVIEW COVERS BOTH DARKNESS AND DARKNESS 2ND * * *\r\nThe road to this point has been long and arduous. To LOVE-Ru’s first season was, by all accounts, total and complete dreck. The OVAs were mediocre at best. Motto was passable. But now—but now—after wading through 46 episodes of mostly vacuous blandness, it is time for something a little different. It is time for some honest to God, quality anime. Yes, to get straight to the point, To LOVE-Ru Darkness is good. And this is not some kind of run-of-the-mill goodness, no, this is genuine article high-quality content.\r\nBut wait, before I gettoo far ahead of myself, let me first clarify exactly what To LOVE-Ru Darkness is and how it differs from the original series. Though its title implies that it is a spinoff, in reality, Darkness (as it shall henceforth be called) is nothing more than an ordinary sequel to the original To LOVE-Ru manga. We need not let this be discouraging, however, because while it may technically be a sequel, Darkness is an entirely different beast from its low-quality predecessor. Though it features a mostly unchanged cast of characters in fairly similar scenarios, it manages nonetheless to be very distinct thanks to its extremely unserious tone, revamped plot, and a small selection of new key characters.\\n\\n\r\nOf these three distinctions, the first—that Darkness is less serious than the original series—may immediately seem the most suspect. After all, while To LOVE-Ru often failed spectacularly to be funny, it was at the very least intended to be a comedy-heavy harem ecchi show. In other words, to begin with, it never had any seriousness to speak of. Even so, Darkness somehow manages to top this. Not only does it not take its plot seriously, it doesn’t take anything about itself seriously. Whereas To LOVE-Ru often felt insecure—as though it kind of wanted to be a fanservice show, but also didn’t really want to offend anybody—Darkness feels like an older and worldlier sibling. It is content to throw all kinds of licentious filth in our faces and not feel the least bit ashamed about it. Though it may be strange to say this of a piece of television, Darkness could best be described as feeling like it has high self-esteem. It is self-aware of the kind of show it is, and rather than letting this get it down, it is completely forthright about it. This is what I mean when I say it feels less serious than its predecessor: it has the ability to not only laugh at its silly characters and plotlines but also to laugh it itself. Of course, if all it did was laugh at its problems rather than addressing them, Darkness would not be much better than the original. But Darkness doesn’t just laugh at its old flaws, to a certain extent, it also embraces them. \\n\\n\r\nIn order to really understand this point, it is important to first understand the three main ways a work can approach its problems. The first way—and this is mostly what the first season of To LOVE-Ru does—is to simply ignore them. The major advantage of this method is obviously that it is extremely easy for the creators since they don’t even have to make any meaningful changes to what they were already doing. On the other hand, it also has a major drawback in that, well, it doesn’t actually fix anything. The second, and perhaps most effective, action a creator can take is to buckle down and actively try to diminish the presence of the flaw in their work. Unfortunately, while it sounds very pleasant, going through with this method is rarely all that feasible considering problems usually exist precisely because they are difficult to eliminate. As a result of this difficulty, creators might try the third method of approaching a problem—addressing it without truly ridding their work of it. A common way to achieve this would be through acknowledgment, that is to say, calling attention to the existence of the problem without solving it. Effectively this is the author giving the audience a wink and a nod to show that they are as aware as anyone of the problems their work has. To LOVE-Ru did this from time to time when characters would mention something along the lines of, “Wow, Rito sure falls down on top of girls a lot…” showing us that the writers knew they were overusing that gag but were unwilling to go through the creative strain of coming up with a more inventive way of getting him into sexual situations. \\n\\n\r\nNoticeably, Darkness does not do any of these things. Rather, it employs the rarely used fourth way to approach problems that I mentioned earlier: by embracing them. Utilizing this method requires both subtlety and creativity to prevent the problems from merely being exacerbated, but I firmly believe that Darkness manages to achieve spectacular success. Almost none of the problems from the first season of To LOVE-Ru (and there are many) are really absent in Darkness—instead, they have been retooled to work in the show’s favor. For instance, take a look at some examples below.\\n\\n\\n\r\n1.\\n\\n\r\nThe problem - Out-of-whack romantic progression: Rito regularly gets into sexual situations with random girls, yet at the same time he can’t even muster up the courage to ask out the girl he has had a crush on for 46 episodes.\\n\\n\r\nThe expected solution - Have Rito make some kind of romantic progress with his dream girl or at the very least have him show some form of assertiveness.\\n\\n\r\nDarkness's solution - Make the romantic progression so impressively out-of-whack that it no longer bears any comparison with reality. No one can levy any criticism against it when it’s so far removed from anything real that they can’t even properly apply normal logic and reason to it.\\n\\n\\n\r\n2.\\n\\n\r\nThe problem - Rito falls on top of girls too frequently: Nearly every episode seems to rely on the same gag where Rito falls on top of a girl and touches them in some vaguely sexual manner, to the point that the joke becomes tired and hackneyed.\\n\\n\r\nThe expected solution - Create new gags and new ways of forcing fanservice so that the show doesn’t have to rely on the same thing happening over and over again.\\n\\n\r\nDarkness's solution - Turn Rito into the God of falling—a being whose ability to unintentionally sexually harass others is unparalleled among mere mortals. As Yami astutely observes at one point, “this man’s sexual harassment has reached the level of a superpower.” Rito is no longer a man, he is a fanservice deity.\\n\\n\\n\r\n3.\\n\\n\r\nThe problem - Over-reliance on panty shots: Too much of the show’s fanservice consists of little more than contrived situations that lead to the viewer being able to see a girl’s panties for one brief, joyous moment.\\n\\n\r\nThe expected solution - …Use fewer panty shots.\\n\\n\r\nDarkness's solution - Bring out the avant-garde camera work. Turn even the most mundane of conversations into a fanservice-fest by angling the camera so that the audience can see up the nearest girl’s skirt. After all, why waste time on a shot that has no fanservice when you can just tilt the camera?\\n\\n\\n\r\nIn this way, Darkness feels, more than anything, like a parody of itself. Of course, in order to joke about itself so effectively, it has to be completely self-aware. It knows exactly what it is and what it aspires to be and it announces this fact loudly and proudly at every passing opportunity: “I am a gross affront to taste and decency!” it says. “Behold, fanservice the likes of which you have never seen before!” it proclaims boldly. “I am the very distillation of debauchery in animated form!” it bellows assertively.\\n\\n\r\nWhile its unserious and parody-like treatment of itself may be wonderful, though, I do think that it would be rather reductive to suggest that the entirety of Darkness’s success comes from these facets. Even on a more conventional level, it puts the original to shame with its more cohesive and engaging plot. Yes, believe it or not, Darkness actually has a plot. Granted, it’s no work of timeless art or anything, but it certainly gets closer to art than I, or indeed, anyone, could reasonably expect the sequel to To LOVE-Ru to get.\\n\\n\r\nOn the most basic level, Darkness continues to follow our hapless protagonist, Yuuki Rito. Beyond this, however, it carries few traces of the plot (or lack thereof) present in the original series. Instead, the focus has shifted significantly from Rito and Lala’s haphazard romance to what I can only describe as the greatest plot idea to ever grace harem anime. An idea of such endless quality that it must surely have been the result of divine intervention: the so-called “harem plan.” Devised by Lala’s younger sister Momo (who I will describe in greater detail shortly), the end goal of this plan is simply to have Rito enter into a polygamous marriage with every single one of the countless girls that are attracted to him. That’s it. By and large, gone are the convoluted and pointless alien politics that sometimes clouded To LOVE-Ru, and gone are the tiresome and hopeless struggles of Rito to confess to Haruna, his dream girl. All that remains is a perennial quest to get as many girls as conceivably possible to join Rito’s harem. One can immediately see why such a plan is so ingenious an idea for this anime. For one thing, the seemingly unavoidable problem that plagues all harem anime—choosing a single girl to date at the end—is easily resolved now that the goal has become for Rito to marry them all. But beyond that, this plot is a resounding success for exactly the reasons described in my earlier point: it allows Darkness to be utterly unabashed about its ecchi harem nature. No nonsense. No excuses. Just an increasingly large number of sexy girls.\\n\\n\r\nThis is not to say, however, that all sexy girls enter the harem with the same degree of ease. For some, a few minutes of screen time dedicated to Rito performing some minor act of kindness is all it takes for them to fall hopelessly in love with him, but for others, entire episodes or even story arcs may be necessary. In particular, Konjiki no Yami—The Golden Darkness—(the dispassionate assassin who was at one point sent to kill Rito but now lives peacefully on earth) proves to be an unusually stubborn candidate. In fact, so much of the plot of Darkness is dedicated to her very belated entrance into the harem that she ends up being the titular character. I suppose there are more honorable things to have named after oneself than an ecchi anime, but at least she was lucky enough to get a good ecchi anime. Indeed, as someone who previously noted that “if there is one character in [To LOVE-Ru] who deserves to be a part of a better anime then it is surely the ‘Golden Darkness,’” the fact that she receives the brunt of the attention in this good anime surely makes me very happy. What is most astonishing to me about all this, though, is that Darkness, the most lowbrow of television, actually manages to develop her in a reasonably well-written way. Over the course of its 26 episodes, comprising two seasons and two special episodes, we gain insight about her mysterious backstory, see her come to terms with her tumultuous past, and watch as she finds herself entering into more meaningful relationships with the people around her, especially Rito’s sister Mikan. \\n\\n\r\nAll of Yami’s development builds masterfully towards the series’ stunning conclusion in which her master, a (sexy) girl called Nemesis, releases the “darkness” within Yami, turning her into a world-destroying, godlike being. Following this, there is a lengthy and dramatic action sequence wherein many girls’ clothing is destroyed but no real damage is caused. Eventually, Lala’s sister Momo reveals to Rito that there is only one way for this situation to resolve itself: he must rebel against his sex-averse nature and engage in some “lewd acts” with Yami. Though he is initially skeptical, he is urged on by an underclassman named Mea who informs him that his “shamelessness will save the world.” In the end, he subdues the now nearly omnipotent Yami by casually walking up to her, taking off most of his clothes, and then groping her a bunch. If that is not the very apotheosis of ecchi anime, I don’t know what is.\\n\\n\r\nAs beautiful as that may be, though, Darkness’s plot would not be able to achieve any real success unless its characters were there to support it. The “harem plan,” for instance, would be pointless and insubstantial without girls of sufficient sexiness and quality of personality to join its eponymous harem. And so, it is here, with the characters, that Darkness elevates itself the most beyond the intense mediocrity of To LOVE-Ru. Yes, despite being made up of largely the same characters, Darkness’s cast is vastly superior to that of the original. The new characters are more fresh and inventive than those from the original series, and the old characters are either given more proper character development than before or appear less frequently. Of particular note are the new additions of Lala’s younger twin sisters Momo and Nana. Though these two were technically first seen in the To LOVE-Ru OVAs, their real importance becomes apparent during Darkness when they (along with Yami) replace Lala and Haruna as the show’s main heroines to great success. But who exactly are these two sisters and what makes them so successful? Let’s look a little deeper.\\n\\n\\n\r\nThe Deviluke Twins\\n\\n\\n\r\nMomo Belia Deviluke: Momo is Lala’s younger sister who eventually decides to move in with, and attend the same school as, her sister (and Rito) on earth. Outwardly, she is a kind and gentle soul who immediately draws the admiration of her classmates, both male and female (but let’s be honest here, mostly male). Inwardly, however, she is an entirely different beast. Behind her cute façade, she is a dangerously creative schemer who harbors a deep-seated obsession with the erotic. Of course, regardless of how creative she may be, she still falls wildly in love with Rito before the viewers can say “fanservice.” Unlike her compatriots, however, she does not merely sit by and let that poor boy make a fool of himself with every girl in sight. Rather, she decides to take matters into her own hands and concoct the ingenious “harem plan” of which I have already written so highly. \\n\\n\r\nThe “harem plan” is really only one example of Momo’s escapades in action though. Throughout the show, she continuously makes her influence known, as she often goes out of her way to get Rito into lewd situations (much to his chagrin) in an attempt to expand the harem. These sorts of situations really go to show that Momo is exactly the kind of character this show needed. Her sexual-mindedness and conniving nature endow her with the ability to turn even the most mundane of situations into an entire fanservice-y pageantry. In fact, on the whole, Darkness owes a great deal of its success to Momo. Thanks to her salacious influence, it is able to bring about its fanservice far more gracefully than the contrived situations that were required in To LOVE-Ru. And it certainly seems that the writers were well aware of this fact because Momo appears with great frequency throughout Darkness—probably more than any single other character besides Rito himself.\\n\\n\r\nOverall, then, I do not think it would not be an exaggeration to say that Momo is not only the best character in Darkness but one of my favorite anime characters of all time. Honestly, even having written this entire section of the essay praising Darkness, it still astonishes me that a character of such quality could have graced a show like this one. It astonishes me that the writers had it in them to make a character this good yet still wasted my time with the congregation of clichés that made up To LOVE-Ru’s cast. In a sense, Momo is so perfect a character, so precisely crafted to target and fix the first season’s fundamental issues, that she makes the rest of the cast look even more incompetent than they already were by comparison. Regardless, her addition to Darkness is one of the show’s greatest assets in allowing it to become more than the generic harem farce of Motto.\\n\\n\\n\r\nNana Astar Deviluke: Nana is also Lala’s younger sister and also eventually decides to move in with, and attend the same school as, her sister. Unlike Momo, however, Nana makes no attempts at concealing her real personality. She is loud, easily angered, and takes great offense to Rito’s acts of unintentional sexual assault, regularly calling him a “beast.” Like most of the viewers, she finds it inconceivable that this man has amassed so substantial a harem, although in traditional To LOVE-Ru fashion, she does come around and eventually falls in love with him in a begrudged kind of way.\\n\\n\r\nIn comparison to her sister Momo, she is neither as plot significant nor, frankly, as interesting a character. Even so, Nana’s inclusion is by no means a misstep on the part of the writers. For one thing, her smaller-than-average boobs bring some much-needed balance to the average boob sizes among girls in this show. This may not sound very important, but the show feels the need to bring this fact up every few episodes just to make sure the viewers haven’t forgotten. Momo especially appears to believe that the matter of boobs is of such paramount importance that she acts as though Nana’s small ones constitute some sort of crippling disability. It’s really rather tragic. \\n\\n\r\nBeyond the realm of boobs, Nana generally serves as a strong contrast to her sister Momo, particularly with regards to her attitude towards Rito. Whereas Momo is uncontrollably in love with Rito from the show’s beginning, Nana acts spitefully towards him for most of its run. Even when she does eventually develop some feelings for him, she still treats him quite harshly. The most important effect of this is that she serves to keep Momo and Rito in check. I think if Momo were the only new character added, the show might quickly devolve into total debauchery, but with Nana present in the Rito household, there is always someone there to yell at one or both of them when they begin to take things too far. In essence, she exists to stop the show from veering into hentai territory. Of course, being the preventer of lewdness is certainly a thankless role and one that can be easy to hate from a viewer’s perspective, but I believe it is an integral one. This way, Momo can stay in character (exhibiting her usual constant desire for eroticism) and the show can still air on television.\\n\\n\\n\r\nAs I have hopefully demonstrated, Momo and Nana work together to great effect to form the backbone of Darkness. Add in the new and improved Yami, and we have a cast of central heroines that make To LOVE-Ru’s cast look like a ragtag band of clichés in comparison. Of course, Rito is still the same old sex-averse loser that he has always been, but surrounding him by such an excellent group of girls does undoubtedly serve to mitigate his problems—even if it cannot completely do away with them. Ultimately, as much as I have come to like this show and its characters, and as much as the changes that Darkness brings cause him to be less of a nuisance, I still do not really like Rito. Comparing Darkness’s Rito to the original’s Rito, though, is like comparing stubbing one’s toe to sticking one’s leg through a wood chipper. Neither are pleasant by any stretch of the imagination, but one is a mild inconvenience and the other is unbearably agonizing. By now, Rito’s greatest sin is really only that he is boring, and this is not a sin that bears much weight when he is able to play off of so many vastly more interesting characters around him.\\n\\n\r\nBesides characters, there is one more topic that I think is worth discussing before I finally stop rambling on about Darkness. This is a central topic which I have been ignoring for quite some time—the most important topic of all: the fanservice. Though I have mentioned it at various points throughout this portion of the essay and hinted strongly as to what I think of it, I have not outright stated what I think of Darkness’s fanservice. To put it clearly, the fanservice present in To LOVE-Ru Darkness is of extremely high quality. There is a little bit of everything here: from gender-bending to a girl being suggestively force-fed a popsicle while wearing a school swimsuit and yelling “master” repeatedly. I won’t deny that it is an acquired taste, but I firmly believe that this quality selection of ecchi moments pairs well with the excellent character designs and art-style in Darkness to make its fanservice a resounding success.\\n\\n\r\nIt’s also worth noting that Darkness blows its competition out of the water not only in quality but quantity of fanservice. I don’t think I have ever seen an anime with more fanservice than this one. Granted, I don’t pretend to be an infallible authority on all anime, but I have seen more than enough to know that Darkness has, to put it crassly, a fuckton of fanservice. The show might as well be titled Fanservice: The Animation. Every episode of this show is a non-stop barrage of lewdness—23 minutes of Rito and his endless erotic escapades. And I for one love it. I relish the feeling that every moment spent watching this show is one spent, as the weebs say, “straying further from the light of God.” I relish the feeling that every person I know, have ever known, or will ever know would be profoundly disappointed in me if they knew that I watched this show. But above all, I relish the feeling of catharsis from having suffered through so many hours of To LOVE-Ru’s pathetic excuses for ecchi moments and now—finally—seeing some of the fanservice I felt so robbed of. Nothing can truly make up for the time I squandered on the early parts of this series, but at the very least I received some vindication in the end. It is a sad, hollow sort of vindication—no doubt I would rather have avoided the first season of To LOVE-Ru entirely—but it’s something to show for this time that I once considered totally lost.\\n\\n\r\nIn the end, I have probably vastly overstated just how good To LOVE-Ru Darkness really is. Certainly, as much as I can praise it, this salacious celebration of sexy anime girls will never go down in history as one of the all-time greats. Even so, I will not soon forget this show. The feeling that overcame me as I watched its 26 episodes in the gloom of my room—as it slowly dawned on me at first with incredulity and later with mounting joy that this iteration of a series that I once execrated is actually good… the mixture of profound surprise and relieved elation that I felt then will stay with me forever.",
            "date": "2019-01-26T10:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 300051,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TGK94",
                "username": "TGK94"
            },
            "url": "https://myanimelist.net/reviews.php?id=300051"
        },
        {
            "content": "so i watched to love ru years ago when i dont really pay attention to the story and only been there for the ecchi. and now i decided to rewatch it again due to curiosity and of course, ecchi and welp i guess i know what i love this show so much back then.\r\nwelp the first to love ru maybe a bit boring and the art isnt that good but seeing the improvement from the first till now, damn im glad i endured the lack of animation back then (welp its from 2008 so i guess i cant complain). \r\ni was thinking of making areview after i finished the anime till darkness 2nd but i changed my mind bcs i feel like i need to make this season's own review.\\n\r\nthis season is so much better than the previous one, you know where the story is going to be, you have good fighting scene (i guess..) and of course, MOMO !\\n\r\ndamn im obsessed with momo. no kidding. i cant stop myself of wanting rito and momo be together.\\n\r\nthe animation is a blast. massive improvement from the first one.\\n\\n\r\ni guarantee ya, if you can endure the first one, it will be worth it to watch this one!\\n\r\nand last but not least, momo , damn you're cute",
            "date": "2019-01-18T20:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 299403,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5539672.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bakacheeto",
                "username": "bakacheeto"
            },
            "url": "https://myanimelist.net/reviews.php?id=299403"
        },
        {
            "content": "I wouldn't usually write a review for an ecchi/hentai/harem/porn/incest/whydon'tyoujustjackoffalready?-anime, but people are being driven crazy by this thing, it's already got a score of 7.99(at least when I wrote this) and the OVA basically is what they don't get to jack off to--I mean watch in the regular To Love Ru Darkness season, I mean, I get it, the show is good at getting your dick hard, good, and it can also make you have some giggles and good fun on the process? Great! But is it really a 10/10 show? No, it isn't.\r\nAnd if there is anyone who dares to say that is thebest anime they've ever watched, is because they probably mean it's the best porn they've ever watched, ask them to justify why it is the pinnacle of anime, and you'll see the anwser will be along the lines of \"Can't you see how brave this characters are? They dare to have a guy touch them when he is already semi-kind of engaged! Not in this world man\", \"The art is soooo good! Have you seen the way those watermelons dance?\", \"I came 3 times that day\", \"My penis pretty much typed this review\". And why? Why is it that all the people making reviews are getting so crazy about it? Well, that's because this is porn, what where they looking for when they watched this? Porn. The simple fact that they are looking at anime as a pure masturbation mean, makes them lose their criticism and can only say wonderfull things about it.\\n\\n\r\nNow, I'm gonna stop being a dick to all those people who are controlled by their sexual lust and are not able to be critical about anime because of this reason. \\n\\n\r\nStory (6): The story is not amazing, in Love-Ru we start off with the usual girl who falls in love with the main character and then they have a problem, and they have to fix it, they are given time, in that time more females are introduced, they all fall in love with the main character eventually, the problem comes back, and with enough -falling on their panties- moments, the problems comes back once again, and then it can either leave and come back later or end the problem and start something new. To Love-Ru is pretty much this, probably the only thing I've enjoyed in this new \"lets create a Harem\" deal, is the fact that Momo tries to get into Rito's mind and make him into a perverted playboy, wich adds somekind of psychological control, wich is a nice touch and I can appreciate it. I'd also like to add that Darkness probably beats the other To Love-Ru arcs, just for the fact that this might actually go somewhere, the character development is minimum but there is some of it...I think.\\n\\n\r\nArt (9): I don't really care that much about art to be sincere, cause I believe a lot of people tend to ignore other animes just for the fact that the art style is strange or different to their usually anime, so I don't think the art makes the anime, but it can obviously be appreciated mostly in a show where the way characters look is so important. Darkness has a pretty solid art style and has a nice look to it.\\n\\n\r\nSound (7): I've never really liked the music themes in the To Love-Ru franchise, but I guess there might be someone out there who enjoys them, but is nothing I would consider memorable or outstanding, the sound effects in the show are good in setting the atmosphere, maybe not the greatest, but good.\\n\\n\r\nCharacter (6): Well, maybe the part where most of the people might disagree with me, a lot of people can only say that the cast of characters is great, that they are all deep and amazing, original and well thought...this is one of those harem shows where the show is trying to make you pick which girl you like the most, there's nothing new to them, you can find them on other harem shows, where they try to introduce as many female personalities as possible (wich I wouldn't say is always bad -Kotegawa best girl) , the shy, the dumb, the responsible, the perverted, the athletic and then there's the one that's in love and the one that just wants some action under the sheets. Despite what must people may say, I think the characters don't have that much to them, they don't really seem to have motives in their lifes, they are always in the same mood until something happens to them, they don't really seem to be troubled with their every day problems, their personality just blends into the situation.\\n\\n\r\nOverall (6): But overall, I enjoy the show, not because of the plot, not because of the music, just because it has some ok comedy and is good at getting my dick hard, I can't deny that. In the ecchi category I could even consider that it stands out from the others, but if I'm really critical about it and look at it as anime as a whole, is not that incredible, the plot is ok, sound and art are nothing life changing, but is enjoyable. An overall 6 in my eyes.",
            "date": "2014-10-27T17:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 166447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3721255.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Coolingheaded",
                "username": "Coolingheaded"
            },
            "url": "https://myanimelist.net/reviews.php?id=166447"
        },
        {
            "content": "OVA Impressions at the end of this review.\r\nTo LOVE-Ru Darkness\r\n Wow…. I mean…. Wooooow….. or more like… YESSSSSSS!!!!!! And AHHHHHHHHHH HOLY CRAAAAAP WHHHHAAAAAA!!!! And then OH MY GAOOOOOO OH MY GAAUUUUUUUUUUU!!!!!\r\n………… That’s the best way to explain To LOVE-Ru Darkness; Season 3 of the To LOVE-Ru series, it once again changes the formula and oh man, is it good. After watching LOVE-Ru and Motto, I was rather curious on how Darkness would continue the series; not saying that Motto ends in a way where you can stop (Not at all), but rather, it’d get a little boring seeing Yuuki Rito continue to try and confessto Haruna. At the end of Motto, Rito is able to confess to Lala without much problem (About time, YAY!). He then tries to confess to Haruna, but he closes his eyes and stutters for far too long and she gets distracted by something else, when Rito say’s I like you, he actually says it to 4 other girls in his harem that happened to walk by!! A perfect way to end Motto and it’s the perfect way to start Darkness . Darkness starts off almost exactly the same that Motto did, Momo is in Rito’s bed, wearing nothing but a shirt and it’s oh so good.\\n\\n\r\n So what does Darkness try to do differently to continue holding the viewers’ attention? That’s really simple, if you looked at the art MAL uses to display To LOVE-Ru Darkness (or the Blu-ray for uncensored goodies), you’d have noticed that Yami and Momo are the prominent characters and that’s because they are! In Darkness, Momo has a plan to have Yuuki Rito create a harem, where all the girls become his concubine (or something similar to a hot polygamy) ; what an amazing plan! Momo is very much the Main in Darkness, as is Yami and a new girl named Mea. Yes, the other girls still show up, but don’t expect Lala or Haruna to appear as much, it’s the supporting cast of girls that get treatment this season and the way it’s all executed is perfect. Yami is unknown to us and Darkness does well to begin to explain who and what she is. Mea is just as interesting, even Makido-sensei gets some great exposition. I’m purposefully leaving out a secret person from the review because when she is introduced, you may get some feels! (I know I did). Even thinking about the other supports, Run-chan has an amazing episode, the way Mikan is shown throughout the season is fantastic [Redacted]! Having a large cast is seriously great for To LOVE-Ru Darkness, it gives us, the viewers, a lot to experience.\\n\\n\r\n Now the story in Darkness isn’t just a simple, let’s make all the girls lust for Yuuki Rito, oh no, it’s far more than that. Darkness, as the name of the season implies, has some pretty dark elements involved and if you’ve seen To LOVE-Ru and Motto, you may already have an idea as to whom it’s about, but stop right there! It’s 100% more interesting than you could ever imagine, I mean, ever ever ever imagine!!! I’ll just say, the way the plot unfolded itself was both quite natural and incredibly exciting; I was at the edge of my seat losing my mind (other reasons for that too) as I saw To LOVE-Ru Darkness.\\n\\n\r\n Ecchi……Oh gao… gao gau… Lewd…. Th-that’s really where Darkness goes full stop. The amount of oppai, pantsu, skin I’ve seen in Darkness is astounding, the immaculately drawn and superbly animated girls, it’s not just… it’s … more than…. Good or incredible…I can’t come up with words, I really can’t. Aside from the amount, it’s the way it’s shown to us, the stretching, the groping, the.. oh gau…. I’ve never seen lewd like this in anime before (strictly anime). It’s really insane, especially the last few episodes where everything gets propelled far beyond what our Solar System can handle, heck, the imaginations, the teasing, if you like lewds, please, do yourself a favor, watch this, just.. embrace it all. Don’t forget the popsicle scene either, that was….. well, it’s best not to speak of it,",
            "date": "2015-09-09T18:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 198241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568362.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_Arcadia0",
                "username": "_Arcadia0"
            },
            "url": "https://myanimelist.net/reviews.php?id=198241"
        },
        {
            "content": "While I was disenchanted with the first season since it was just a jumble of events, the past two seasons in the series have been steadily getting better. With Motto running true to the Manga and kind of having some plot flow it still fell a little short in storytelling. Darkness solved those errors and the only reason I gave it a 9 is because I am able to follow the sequence of events throughout this season without asking myself, \"Where did this come from?\" or \"Why is this even included?\". \r\nI am a fan of the fanservice and harem genre but I was lostbefore this season but I'm happy I stuck it out to get to watch this. Although I am a little disappointed by the fact that Haruna and Lala don't play prevalent roles, Momo makes up for it with her scheming. Overall it was definitely more enjoyable this season and I hope they build on this success going into Darkness 2.",
            "date": "2015-03-05T22:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 181799,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cboyes7",
                "username": "cboyes7"
            },
            "url": "https://myanimelist.net/reviews.php?id=181799"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 9\r\nIn this never-ending growth of enjoyable fanservice, To LOVE-Ru Darkness is the instalment in which the combination of both story and mindless fun takes form in a good way. What comes out of that is quite an alluring fractal I'd say. A phenomena that began progressing one day in the household of the once ordinary Rito.\r\nEver since girls from outer space (and Earth) started appearing all around the main boy, any chance of serenity and calmness was quickly trashed away. Poof! Never to be seen again. But it was not all in vain as itmeant meeting a group of likable girls with their own set of eccentric personalities. Darkness was no exception and this time, it actually had a pretty solid story with clear developments at its side. Revolving around the perverted, the silent, and the naughty, we enter Momo, Yami, and a new character by the name of Mea! With these three as the branches of the story, while not that groundbreaking, we were given a new depth in what had been a series mostly about fun entertainment. There were focus on backstories, giving more insight to the unseen situation away from Earth, in particular with those related to Yami and Mea. Fleshing out their characters, their feelings with the group of people they met along with their assasin side were shown. But what made Darkness so enjoyable was the fact that it mixed both seriousness and lightheartedness without breaking the flow of the story. Momo's amazing harem plan put in further spotlight on the other girl's relationship with Rito. Feelings gradually became more apparent and stronger, leading up to comedies that made them even more charming than before. You can definitely say Momo is taking strides in achieving her goal while pleasing the viewers at the same time. Cunning, foxy, crafty. Take your pick. She was a really entertaining strategist full of fun, devious schemes that worked for an ecchi and harem show like this. That said, lots of generic fanservice were still present which may get tiring due to ideas running out but nevertheless, they were amusing as each circumstances were slightly different.\\n\\n\r\nGrab the visuals from Motto To LOVE-Ru and reduce the amount of whitewash. That's basically how the art looked in Darkness. It still emitted some bright whiteness in the form of gradients but the colors this time were more saturated, which felt modern and in line with the setting. Design of the characters were adorable, having body figures that were reasonably realistic with their high school age. While action scenes weren't there that much, they had a nice choreography although it was nothing special considering it's still an ecchi show. The animation was slightly better than average. However, I noticed times when it felt really dull and toned down compared to its predecessors, especially in the earlier episodes. But for the ecchi scenes, Xebec placed in more effort and the result was there. They were definitely fluid. Bear in mind that we're talking about Momo and Mea here who were quite more special with their desires compared to the others. So these scenes were certainly even more steamier than before. So many turning the knob situations. And I won't lie, they were quite tense for me to watch yet still perfect for all the bigger ecchi fans out there. A bunch of new serious soundtracks played but overall, the whole show was still supported by a handful of cheery music. Each voice actress acted out their roles in a heart-lifting fashion to make you love your favorite characters even more. They really captured their personality well and that goes for the new characters too. The opening song by Ray was catchy, having a lighthearted quality along with a sense of seriousness fitting for this season.\\n\\n\r\nTo LOVE-Ru Darkness strikes in right with the blade of comedic ecchi, romance, and a fair amount of serious action. The introduction of a story gave a good enough rigid structure that didn't bleach out the fun enjoyment from before, only amplifying it even further. It managed to pull off a balanced entertainment with a similar premise from its previous seasons. This treasure of enchanting girls is awaiting you!",
            "date": "2018-04-06T08:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 277111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=277111"
        },
        {
            "content": "To LOVE-ru is not for everyone since this is one of the most ecchi anime in the ecchi world. It consistently have scenes which involves a blob of shadow blocking your view due the censorship.\r\n  So the story deserves a 8, since it's pretty good but not very meaningful in terms of actual plot like most other love/romance harems. But who cares, because everybody that watches to LOVE-ru is there for the ecchi scenes. \r\n Art is a perfect 10. They improves a lot compared to the first season. The linings of characters and the environment is just overall better than previous toLOVE-ru.\\n\\n\r\n  Sound, I gave it 9. The OP and ED was a little bit disappointing in my opinion. But the rest of the sounds in this anime was close to flawless to me.\\n\\n\r\n  Character, I gives it an 9 because each one of them is laid out very attractively and beautifully. Also, their personalities were captured really nicely.\\n\\n\r\n  I really enjoyed this anime watching ripped ones which doesn't have the censorships. It was honestly one of the best ecchi animes I've watched in a while. I'd say that it's equally good as the manga. In the end, to LOVE-ru earned a 9 as the average score. \\n\\n\r\n  Again! IT IS NOT FOR EVERYONE. Even with the censors, this anime is like at the border between R- and Rx(Hentai). BUT, Very good anime. #teammomo",
            "date": "2013-06-06T15:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 100049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1492537.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Harem-kun",
                "username": "Harem-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=100049"
        },
        {
            "content": "There's no doubt that this one was the best so far in the To Love-Ru series, but I feel extremely conflicted about multiple aspects of this show. There were some awesome things that they did, but also a lot that I really despised.\r\nStory: 7/10\r\nUnlike the first two series which followed a mini-ep format, this one actually does have an extended plot which is developed throughout all 12 episodes. There are some branch-offs here and there, but they actually contribute to plot movement or character development, so there's no wasted episodes here. This time we actually have a central conflict, but the comedic aspect is retainedas Momo hatches her very own plan, as you'll see when you start watching, so I'm definitely glad that they actually decided to make a plot this time...but I feel they didn't tell it very well. There are a lot of serious moments in TLR Darkness (much more  serious than any scenes in the previous two), but the seriousness was not developed enough to have the impact that it should have. There were inappropriate comedic scenes mixed into the serious scenes which diminished the serious tone, or the serious conflicts were not elaborated enough to get us viewers into the mood and fully understand the situation. It's quite hard to explain without me spoiling the plot, and you might not even notice the issues that I'm talking about since they're pretty subtle, which means TLR Darkness didn't have any blatant problems, which is good! But comparatively, TLR Darkness went through a major improvement from the first two (unless you really just enjoy filler comedy episodes), so it's definitely something to look forward to when you begin.\\n\\n\r\nArt: 10/10\\n\r\nThe show has come a long way since the first one; the art is top-notch.\\n\\n\r\nSound: 10/10\\n\r\nI've enjoyed all the opening and ending themes for all the series, and I don't think they disappointed with this one either.\\n\\n\r\nCharacter: 7/10\\n\r\nThis category is probably where my biggest ambivalence lies. On one hand, some of the characters really get developed like Yami, Kotegawa, Momo and Nana (Momo is actually listed as a main character here because she really is), while others nearly completely fall out of the picture like Haruna, Saki, and most regrettably, Lala.  Lala gets maybe 30 min screen time total in all 12 episodes, and that part really made me sad since I had always considered her the most entertaining character in the show. Part of it is because of the introduction of even more characters, as if Rito's harem wasn't already large enough, and the cramped 12 episodes instead of the 24 in the first one really didn't allow all of those characters to get the spotlight. \\n\r\nBut the characters that did get screen time go through some fantastic growth which was enjoyable to watch as we learn about Yami's past, Momo's true nature behind her devilish ideas, and explore Mikan and Rito's sibling bond even further. On top of individual development, the writers also did a great job developing the relationship between the characters since basically half of Rito's harem lives in his house now; we get to see how all of the girls in the house interact with one another.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI'll say it plainly: there wasn't enough Lala. That sounds extremely picky and trivial on my part, but why did we fall in love with this show in the first place? Sure, the fanservice may have initiated our interests, but fanservice can't sustain a viewer through 3 seasons. It was the highly interesting character of Lala Deviluke and her plans to make Rito fall in love with her as well as her quirky inventions that caused us to keep watching, and while the other characters are unique and intriguing in their own ways, the nearly complete disappearance of Lala made it feel like there was an enormous gap in the show. I only hope that they bring her back in the next season (I really hope there's a next season because the show has only been improving).\\n\\n\r\nOverall: 7/10 \\n\r\nEnormous improvement in almost all aspects, except for Lala's screen time, which in my opinion is key to this show. If you don't really mind that Lala goes behind the curtains in this installment, then TLR Darkness will definitely be a fun and enjoyable watch! \\n\r\nThanks a bunch for reading and do click helpful if you found it so :)\\n\\n",
            "date": "2014-04-24T19:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 141191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=141191"
        },
        {
            "content": "To LOVE-Ru Darkness is another harem/ecchi anime that is of course, not for everyone. It's a sequel to the previous Motto To Love-Ru and To Love-Ru.\r\n  - Story:\r\n  The plot of this sequel is very expected, like most other anime. The author(s) did not focus on trying to create an extraordinary story, but instead focus more on the art.\r\n  - Art:\r\n  This is why people mainly watch To Love-Ru Darkness and its prequels, the art and of course, the fan services. As I said in the \"Story\" section, the author(s) focused on this category. The art was perceived verywell and extremely detailed. I love it.\\n\\n\r\n  - Sound:\\n\\n\r\n  The sound effects in this anime is pretty well-done. Sometimes there are unnecessary effects, however there are times where the sound effects actually make you enjoy the anime more.\\n\\n\r\n  - Character:\\n\\n\r\n  This category goes with \"Art\", the artist(s) did a nice job with the character design, he successfully think in the boots of the viewers \"What kind of characters would I like to see in an ecchi/harem anime?\". Well done.\\n\\n\r\n  - Enjoyment:\\n\\n\r\n  Yes, I enjoy it a lot. The fan services brought together by the author(s) was at a conceivable level. Nothing too annoying. The humor was extremely good and well-perceived.\\n\\n\r\n  - Overall:\\n\\n\r\n  I would recommend this anime to any ecchi/harem viewer. Although keep it in mind that this anime contains a lot of adult contents and this anime is not for everyone.",
            "date": "2014-07-08T06:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 151033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/samkhoa",
                "username": "samkhoa"
            },
            "url": "https://myanimelist.net/reviews.php?id=151033"
        },
        {
            "content": "What seem to start off as just a little series that gave people a laugh turned into something new for the series. \r\nFor starters, Rito always seem to be put in situations that aren't entirely his fault and by this point everyone knows what happens. However, this season gives somewhat of a plot and cliffhanger for a new season which will lead further into it. \r\nThe one I didn't like about the series who Tear who was introduced in episode 10. Now don't get me wrong, it's not that shes a bad character in any way, it's just that you only get to see herfor only an episode's worth of time and probably would have been a main character otherwise. Another thing I was annoyed by how intense the fanserive got: this was a show that I came to laugh at because of all the shenanigans that Lala (who in season 3 is a side character!) brought into the show turned into just about borderline porn (at least in the characters heads). \\n\\n\r\nI felt that this season wasn't in touch with what it started with in season 1. Don't even start about how \"season 1 is not based off the manga\" BS because Motto (season 2) is the Exact Same Thing!",
            "date": "2014-08-12T12:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 156315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=156315"
        }
    ],
    [
        {
            "content": "First off, I want to say To LOVE-Ru Darkness is not for everyone.\r\nThis show is NOT for people who hate fanservice and/or harems. This show IS for people who love tons of ecchi, harems, and more ecchi. To top it off, To LOVE-Ru Darkness actually has... wait for it... a plot. *Gasp* Really?! Yes, it does. It's not just mindless fanservice (although that's cool too). You should definitely watch this show if ecchi is your thing.\r\n...But you all probably knew that since this is the third season of the To LOVE-Ru series and you've seen the first two seasons (To LOVE-Ru and Motto To LOVE-Ru,respectively). If you haven't, then there really is no point in reading this review! Go check out the first two seasons! \\n\\n\\n\\n\r\nNow, there are a few things I want to go over about this show:\\n\\n\\n\r\n1) Story - 7/10\\n\\n\r\nYou claim all ecchi shows have no plot? Think again! At first glance, the To LOVE-Ru series might seem that way, but in reality it has many arcs that keeps pointing in one direction. Sure, it's not going to be some mindblowing masterpiece like Death Note, but how can you even compare TLRD to something so different?! We have to realize that the main goal of the show is to make us go crazy over which heroine the male protagonist will choose in the end. So far, it has done that well.\\n\\n\r\nHowever, like I've said before this show does have a bit of a story. I mean, there are two girls from outerspace trying to accomplish different things with the male protagonist. Conflicting things, if I might add. Then you get to see many girls on earth who show interest in the male protagonist. Well, it doesn't stop there because in TLRD there are even more girls from outerspace trying to accomplish things with...you guessed it: the male protagonist.\\n\\n\r\nOf course, if you are Momo Bella Deviluke such troublesome things look more like a great opportunity. So for an ecchi-harem, To Love-Ru should please many (in more ways than one ;)).\\n\\n\r\nDon't get me wrong -- Yeah it does have a story but it's still considerably weak. It isn't anything compelling but there are moments where it leaves you wanting more. It's enjoyable nonetheless. I'll leave it at that.\\n\\n\\n\r\n2) Art - 10/10\\n\\n\r\nThe To LOVE-Ru series has come a long way in terms of artwork. In the first season, the visuals were great for its time. But damn, the second season and third season turned it up a level or two.  The scenery, the characters, even the small background objects look amazing. However, I remember reading forum posts and reviews criticizing the second and third season's artwork. You see... when the studio colored the characters, they added this shiny gloss to them to give the illusion of rounded body parts (i.e. the chin, elbows, knees). Not a lot of people liked it but personally I loved it. I think the studio made a good decision keeping the artwork for TLRD the same as the second season. \\n\\n\r\nSo overall, I think the show has beautiful art.\\n\\n\\n\r\n3) Sound - 8/10\\n\\n\r\nSince it has been a year or two since the last season finished airing, To LOVE-Ru Darkness may come as a surprise to you in the sound department. Beginning with the OP song, I found it to be very good. It's called \"RAKUEN PROJECT\" by Ray. It's sort of a mix of electronic/dance music with rock. It threw me off a bit because the first few seconds sounded like the last few seconds of an ED song. I literally said \"Damnit, this isn't the real version of the episode!\" However a few seconds later you get to the \"actual\" part of the song. It's a really good song. Kinda stuck in my head now...\\n\\n\r\nAbout the voice actors - You may find that you dislike the chosen voice actors for some of the characters in the show. I remember when I watched the first episode... I was wondering why the girls sounded so much younger than they looked. I thought for a second maybe they changed voice actors since the last season because I didn't remember them sounding like this. So I did a little research but found out they used the same voice actors as last season. I shrugged and decided to just watch through the first episode and hope that the voices grew on me. Well what do you know? By the end of the episode I wasn't thinking twice about having someone else voice the characters. You might appreciate the voices even more when you get to the \"naughty\" scenes ;).\\n\\n\r\nThe background music was very good too. Subtle, but good. There is usually a ballad playing when it gets to storytelling time and an upbeat soundtrack during the rare intense scenes (fighting, heated dialogues with enememies, etc.). There aren't many sound effects besides the occassional boob/ass grab. Even I found that hilariously good.\\n\\n\r\nI'm not particularly fond with the ED song. It's called \"Foul Play ni Kurari\" by Kanon Wakeshima. It is a fast-tempo song with a string orchestra. A good song, don't get me wrong but for an ending it's a bit too 'cutesy'. I would have preferred a rock song with a bit of a ballad-edge to it but this song is good, too.\\n\\n\r\n4) Characters - 9/10\\n\\n\r\nOne of the first things you will realize in To LOVE-Ru Darkness is the lack of Lala Satalin Deviluke. In the first two seasons, she was the main heroine but she has since dwindled into just another heroine subject to equal competition. Actually, she doesn't even get as much screentime now. I really miss her and I find myself happy just being able to see her even for a second.\\n\\n\r\nSadly, because of all the new characters the show has pretty much changed from being a harem that ends with a relationship between just two people into a harem that strictly aims to create a harem ending. I have mixed feelings about the change. On the one hand, I want Lala to win but on the other hand I'm starting to see myself change opinions because of the numerous interactions the other characters have with Rito.\\n\\n\r\nLet us begin with the male protagonist. Yuuki Rito. He's a pretty typical character. He's clumsy, thick-headed sometimes, but a good person inside. Many girls like that about him. What makes him stand out though is the fact he's notorious for getting into situations that end with him being on top or under a girl. Sometimes he's naked. Sometimes the girl is naked. Sometimes they're BOTH naked! Top that off with just plain dirty and awkward hand positions like breasts/butt-groping, face-in-crotch/butt/breasts and you have one lucky bastard (minus the fact he usually gets punished for it after).\\n\\n\r\nThen we have Yami the Golden Darkness. Yami for short. Yami is a quiet kuudere/dandere whose mission is to kill Yuuki Rito - although she doesn't really seem to want to do it. In the first two seasons, we didn't get much of her. She was just another character in the story for the most part. However, in this season it focuses on Yami and uncovering her past. This goes back to me saying that this show has a story!\\n\\n\r\nMea Kurosaki will be the first new character you'll be introduced to in this season. She is an assassin who was sent to earth by a master to monitor Yami's actions. By the way, Yami and Mea are sisters. They both have the ability to transform their hair into weapons and such. Although she appears to be nice (and sometimes curiously perverted) on the outside, she has a dark heart just like Yami. She's like the second best character in the show IMO. I really like her dirty schemes haha. You get to see more of that later on.\\n\\n\r\nNow...Momo Bella Deviluke. Oh my goodness...she is AMAZING.To me, she's the best character in TLRD. I even dare say she is one of the best female characters of 2012. Not many will agree simply because they don't know about the show but those who have watched To LOVE-Ru Darkness will agree. They have to! I mean, c'mon she's what fuels the fire in the season. The perverted tactician would be a suitable title for her. We mostly see the story from her perspective. Her main goal is to be with Yuuki Rito, but she's okay with Yuuki Rito ending up with every girl. Wait. She isn't just okay with it - she WANTS it to happen. She ACTIVELY pursues that goal! That's why she is so entertaining to watch. And just wait until you see her extremely perverted delusions. It's hilarious!\\n\\n\r\nI'd talk about the other characters but there isn't much to say. That is not to say they don't have any character development because they do. Run/Ren Elsie Jewelria is one good example of a character with good development. There are a few more characters that have yet to be introduced but I don't want to spoil it and say what happens so just watch the show!\\n\\n\r\n5) Enjoyment - 10/10\\n\\n\r\nLet me keep it brief: I enjoy this series so much. It is definitely the best ecchi/harem series I have watched in the past two years of my anime life. This show is so damn hilarious and entertaining to watch. I even end up watching it as soon as it comes out despite not having subs! All because I'm impatient and want to watch the show as soon as it comes out.\\n\\n\r\nIt's not that bad for me to watch it raw though because I'm up to date with the manga and know a bit of Japanese so I know what's going on. But anyways, 10/10!\\n\\n\r\n6) Overall - 8/10\\n\\n\r\nOverall, I find To LOVE-Ru Darkness to be refreshing. Even though the show does an extremely good job at it, ecchi is not the main reason why this show is good. The main reason why this show is good is because of the story, artwork, and characters. Without those three, the ecchi would lack a lot of substance. I know it's weird saying that because people think those who watch ecchi are pleased with just boobs and butts but NO. We want more! And where do we find it? In To LOVE-Ru!\\n\\n\r\nSo go ahead and watch To LOVE-Ru Darkness. I recommend it to anyone who enjoys a good ecchi show. Perhaps even those who don't watch ecchi that much but have an open-mind. Try it out and see.\\n\\n\\n\\n\\n\r\nThanks for reading my review. Thank you even more if you read everything I wrote and not just skim through it. Yes, I consider them two different situations. You know it's true. :)\\n\\n\r\nPlease hit the 'helpful'' if you find this review helpful.\\n\r\nEven if you didn't find it helpful, I appreciate you checking it out.\\n\\n\\n\r\n- DesolateOne\\n\\n\\n",
            "date": "2012-12-21T13:05:00+00:00",
            "helpful_count": 307,
            "mal_id": 80798,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/420150.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rezurrekt",
                "username": "Rezurrekt"
            },
            "url": "https://myanimelist.net/reviews.php?id=80798"
        },
        {
            "content": "There can only be one series that would be considered the forefront of a particular genre that currently gives it its own identity or face; that series in question would be To Love Ru. It has had a rough start in its adaptation to the original source material by not providing a coherent narrative to the manga. Eventually it has made a name for itself for being the aforementioned forefront of Ecchi thanks to the later seasons that are somewhat “reboots” in the pure sense of the word reboot. Now comes To Love Ru Darkness, which is a separate manga that continues the story ofTo Love Ru, to breathe new life to its characters and comedy. To put it bluntly, it is a triumphant sequel that exceeds all expectations.\\n\\n\r\n“That’s perfectly natural behavior for a living creature,” says Mea Kurosaki. This quote itself, in which the word “that” is supposed to signify sexual thoughts, is what encapsulates the entirety of To Love Ru Darkness’s charm as a whole. It tells us how we should view Darkness as nothing more but a fun joy ride through joyous comedy and beautiful girls through sexual feelings, but we shouldn’t be ashamed by this mere fact alone. That is one of the main selling points of the show, in that it lives off of making us feel excited through hilarious incidents of girls in suggestive situations without making it feel demeaning or deliberate to either of the sexes. This aspect alone that To Love Ru Darkness expresses should be an example that all Ecchi shows should follow in the near future, which sadly isn’t always the case.\\n\\n\r\nNow to express how all the things I mentioned in the previous paragraph work unlike in most shows in what Darkness follows, the one thing that absolutely works is how every character all carry the show with their likability despite their very cliched nature. Cliched in the sense that you have Yui Kotegawa who is the stereotypical tsundere who wants order in the classroom, Nana who’s another tsundere, Mikan the younger half-sister who loves him, Yami the Dandere psychopath, and Haruna who the protagonist has feelings for yet she so happens to be in love with him as well. Despite how many would view cliches as a negative term, however, the way how Darkness handles them is through sheer charm and personality that make them feel energetic and alive. You even feel contempt for them whenever drama happens between the characters even with their stereotypical archetypes. However if there is one character that must have one full paragraph alone to analyze would be the one and only Momo Deviluke.\\n\\n\r\nBecause of the fact that she is the new heroine of the series, replacing Lala, Momo is what makes Darkness so special and wonderful to experience. Thanks to the glorious voice of Aki Toyosaki, Momo’s sarcastic and devious personality makes her such a delight to see on-screen when she is having one of her humorous fantasies and her clever schemes to make the girls fall more in love with Rito. With these things in mind, you might think that Momo’s personality only give off this one-sided aspect of it, which is mostly being a devious pervert throughout the entire show. I would like to describe a scene that happens in the last episode involving her and Rito in a gym closet room. Momo is on top of Rito seducing him as usual until we suddenly see Rito finally give into his instincts and do the same things to her and then we suddenly see Momo in a very vulnerable state. It isn’t until later that we find out it was just another fantasy that Momo was imagining while on top of him. This fantasy she envisioned took her by surprise, something of which we never see her go through before. It wasn’t until Rito finally tries to stop her by putting his hand on her arm which suddenly surprises her and jumps away from him quickly in fear and respite with her constant breathing and blushing face. We now see Momo in a completely different light than we are used to seeing her before. It is this scene alone that makes Momo a three-dimensional character by not through general exposition, but through character interaction.\\n\\n\r\nSomething that has changed from previous installments of the series is the art direction. While all of the characters still look the same, everything is now colored in very bright overtones. While many can argue that Motto To Love Ru art looked more better in terms of how the characters looked, that should not disregard that Darkness’s art still looks great in keeping the traditional manga art in context with the show. One thing that I’ve always admired the series and more so in Darkness is how they’ve always drew the girls and their figures that actually look very gorgeous without overemphasizing anything on their body like many other ecchi shows tend to do. Thanks to this, the girls actually look like High School aged girls who have just hit their period of going through many changes in their body and not the other way around.\\n\\n\r\nTo Love Ru has not been widely known for having an impacting story to show forth underneath its charming fan-service; it wasn’t until Darkness where we actually do have one that fills this very gap. Generally most people will think that the writers wouldn’t bother with writing a competent story being the fact that it is an ecchi series and those typically don’t go so well. While Darkness doesn’t break any new ground in this aspect, it does have an interesting twist in the harem genre where the heroine is actually the one doing all the work to help our protagonist get all the girls. Like I mentioned with Momo’s schemes, her intentions on doing these are very well-handled in how it balances sweet romantic moments and pure fun comedy. There isn’t a sudden tonal shift between drama and comedy in an effort to make it edgy, thankfully. The plot might not be a deep one to experience, it doesn’t really try to be one in the first place and sticks with it which is very well appreciated.\\n\\n\r\nRito himself as a protagonist, I would say, can be grating at times in how slow they build him up to be a harem leader after years of seeing him constantly getting flustered over women falling over him. In Darkness, it still portrays Rito as if he hasn’t experienced a girl falling on him in a questionable position before even though we’ve seen him in the past in these types of position countless times before. You’d think he would get used to it by now and not be phased by it after all these months but nope. For what he’s worth, he still has some moments where he comes across as caring and likable to everyone he meets so there’s never really a moment where you think to yourself, “Why would any girl fall in love with this boy in the first place?”\\n\\n\r\nOnto the comedy itself, needless to say there will not be one person who is into suggestive comedies to be disappointed with Darkness at all. Almost every situation is handled with great comedic timing, whether it be a scene involving Rito and a girl bump into each other and, in true ecchi fashion, be in a very awkward position to the public to see or a scene that’s in a constant pace in showing jokes that involves hilarious dialogue between characters; a great example would be between Nana and Mea or Momo, or vice versa. Not all jokes hit the right notes throughout the entirety of the show’s duration but for what it’s worth, it will nevertheless entertain the masses who, like myself, love to engage in hilarious perverted comedy.\\n\\n\r\nNot only do the characters themselves make the show enjoyable to watch, but the voice acting is what gives them their absolutely endearing personality through the sheer talent that Darkness brings to the table. I’ve already mentioned Aki Toyosaki previously, but she’s not the only great Seiyuu in the casting. Kana Hanazawa plays wonderfully as an upstanding little sister for Rito and giving Mikan a clear voice that feels perfect for her. Nana and Momo prove to be one of the best sister duos in anime thanks to the great chemistry between Itou Kanae and Aki Toyosaki, who have previously worked together in a somewhat similar situation in Railgun. Only this time it’s Aki who plays the devious one instead of Kanae and it definitely shows that Aki’s voice really does fit with that archetype more than Kanae. Finally we have Kaori Nazuka as Yui Kotegawa, probably one of the best tsundere roles we have had in a long time. Her authoritative voice, combined with childlike embarrassment will surely make any man’s, no matter what age, heart burst with joy and pure ecstasy.\\n\\n\r\nWhat it all comes down to is that Darkness won’t win any new fans that aren’t into something like To Love Ru, but even with that said it is something that you should still at least try to see once to see if it pulls you in. Anyone who is in fact a fan will feel right at home with this new installment that has so much to offer for ecchi fans and people who are fans of the series for more than the fan-service. It will be funny and sometimes heartwarming in its romantic undertones for everyone who has followed the franchise since the beginning. That will ultimately lead to us hunger for more and for now with the OVAs coming out here and there to continue it. For now, Darkness is more than enough for us to enjoy while we wait for the next big anime installment for To Love Ru.\\n\\n\r\nGrade: A-\\n",
            "date": "2013-10-26T16:31:00+00:00",
            "helpful_count": 95,
            "mal_id": 118385,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/985071.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Gonzo-lewd",
                "username": "Gonzo-lewd"
            },
            "url": "https://myanimelist.net/reviews.php?id=118385"
        },
        {
            "content": "...and the reward for best Ecchi anime of 2012 goes to... To LOVE-Ru Darkness!!! \r\nThose of you who do not like Ecchi/fanservice anime might want to stop reading here. This anime focuses mainly on these two things and will most likely not be for you. Now for those who are in to Ecchi/fanservice, I will tell you why i think To LOVE-Ru Darkness is so great.\r\nTo LOVE-Ru Darkness is a sequel to the original To LOVE-Ru series. I highly suggest watching To LOVE-Ru, Motto To LOVE-Ru, and all the OVA's before you watch Darkness. For those who have watched and are familiar with the ToLOVE-Ru series, To LOVE-Ru Darkness continues straight off from where Motto To LOVE-Ru leaves off. It - believe it or not- actually has a plot to it that extends for more than one episode.\\n\\n\r\nThe story this time mostly focuses on the alien princess Momo and her harem plan for her beloved Yuuki Rito. We also get a some back story about Yami, who was a side character for most of the To LOVE-Ru series. The plot is nothing special, but it is still pretty good. We get random nonsensical episodes here and there, then we would be thrown back into the actual story. There is a good balance of serious scenes and comedic scenes that makes the series quite enjoyable even if you do not like Ecchi that much.\\n\\n\r\nAn important thing to remember is not to focus too much on the plot though. Like the other To LOVE-Ru series, the story should not be taken too seriously. The issues do not even get resolved by the last episode, so yes it is a cliff hanger ending. What truly carries this series is it's very appealing fanservice.\\n\\n\r\nThat brings us to the artwork. The backgrounds are extremely bright and colorful. The characters are beautifully drawn and very hot. If you are looking for an anime with a cast of very sexy girls doing borderline hentai stuff, then this is what you are looking for. The only problem is the bright lights of censorship, but those will be taken away in the blu-ray releases.\\n\\n\r\nThe characters are really nothing special though. Yes, they are all pretty, but their personalities are as generic as you can get in anime. The way i see it, you can split the characters in to two groups. One side has all of the girls who want the main character, Yuuki Rito , and will be all over him when ever they get screen time. The other side also likes Rito, but they are too shy to express their feelings. Pretty normal for a harem anime.\\n\\n\r\nDoes this mean that they are not fun to watch? Hell no. Watching their hilarious and erotic interactions with Rito has been great a experience. Many of these scenes are very risque, so it would be best to turn down the volumes and lock your bedroom doors. This is probably the best part of To LOVE-Ru Darkness. Some of the scenes might seem a bit cliche- like the classic falling over and groping a girl's chest scene- but it can still be very amusing. Enjoy To LOVE-Ru for the Ecchi/fanservice because that is where this show excels the most.\\n\\n\r\nSo what is my overall opinion of this anime? It's a great show, but definitely not perfect. Its ability to only attract a specific audience- the Ecchi/fanservice lovers- severely lowers it's potential. For those of us who do favor fanservice heavy shows, then this is like a treasure among treasures. Definitely give this a shot because you'll like what you see.",
            "date": "2012-12-31T14:35:00+00:00",
            "helpful_count": 40,
            "mal_id": 82140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1488843.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/The_Pro_At_Stuff",
                "username": "The_Pro_At_Stuff"
            },
            "url": "https://myanimelist.net/reviews.php?id=82140"
        },
        {
            "content": "To love ru darkness, brings up the new hope about how a harem anime which usually have negative comments can make all that comments gone. A common knowledge to all the anime lover that harem anime is usually is lack in the plot and story, since what makes harem anime interesting is fanservice and all beautiful or moe girl. If you have ever  seen The World God Only Knows then maybe you have seen a  good example how a harem anime can turn into from fun harem into a serious harem anime (in story aspects).\r\nBack to the To Love Ru darkness , ifyou have ever seen the previous season of To love ru darkness (To love ru and Motto to love ru), maybe you will realize the \"gap\" between this anime between the previous season. Not just from the score (which TLR darkness have bigger score than the two previous) but also from story aspects. if those previous seasons are TOTALLY random and doesnt have strong  plot or story then this anime was 180 degree between those  two. honestly, i really feel relieved since To love ru is getting better in each season, from the season 1 which is  really abstract and season 2 which like a gag anime and to  the season 3 (TLR darkness) which i felt like my effort for watching this series is paid off.\\n\\n\r\nTo love ru darkness or we can called TLR darkness, is focussing on Momo (Lala's sister) and Mae (Yami's sister) story. As for Mae, she is the new character that just appears in this season. Anyway, this anime has two main story, for the first one is Momo obssession to make a harem plan for Rito, since she thinks with the harem plan Rito can make all the girl happy, and for the second was about Mae and Yami (i am not gonna spoil it). So, what makes this season differences between those two previous season? First it was the story itself, So this series FINALLY have a story? YES IT IS! we have a main goal and know what this story about, and it obviously different with other season, like Motto To love ru, until i had finished Motto, i still dont know what the story about and it really like Shinyraku Ika Musume which have 3 different stories in each episode (I love Ika musume), but honestly it didnt fits well for a series like To love ru.\\n\\n\r\nBack again to TLR darkness, after the story lets talk about the art. This maybe the whole reason why people love to watch TLR darkness. I am not gonna exaggerate it but it was superbly amazing! my first impression was extremely colourful and, so bright. The lines for the character design is really have a high quality art, like from the each character's hair or body. If you comparing between the art quality between the season 1 or season 2 and this season, you wil realizel see how big the gap between those season. Not just from the art for the character itself, the background was suprisingly really well-made. It was colourful, beautiful, and gorgeous. My eyes were never tired to watching the quality of this anime, my suggestion is you must watch this anime in the highest quality to improve the enjoyness.\\n\\n\r\nThen, lets moving into the sound section, first lets talk about the opening songs. \"RAKUEN PROJECT\" by  Ray. Honestly i dont really care about the opening songs in every anime but then i thought i might give it a try. From the first i listen it, and its directly raping up my ears. I totally love it, what makes more awesome is the video clip in those opening, it was heartwarming (especially in the end of the songs when Mae and Momo hugs Rito) not just the video clip, the lyric is really describing on what TLR is about.  for me it was really fits with the anime and yet its a lovely song to hear. And for the ED, i didnt really paying attention to it, since it doesnt so special.\\n\\n\r\nFor the seiyuu,i dont find any negative things in here. Oh! For the new character, Mea which is being sounded by Yuka Iguchi (the seiyuu for Tsukihi from bakemonogatari and Maria from boku wa tomodachi) is really good, its really suitable with the Mea's traits which is taciturn and sometimes being naughty. as for the other main character in this series like Momo, Aki Toyosaki really did a good job for being a seiyuu for Momo. It was cute and easily grasp every viewer who're listening her voice.\\n\\n\r\nAnd, finally, the character section. The character in this series is probably what makes this anime so special. Since in this series we will have a good developments between each character and more, We have nearly 8 or more CUTE girls that appears in this series not to mention how lucky that Rito being loved by many cute girls. because of so many girls that appears in this anime, i will just describing the main character in this series.\\n\\n\r\nFor the first, we have Mea Kurosaki. The new character that appears in this season series. Mea is like Yami, she is an assasin who is being sent by \"master\" to look for Yami, like i said before Mea is Yami's sister, so they same kind of ability that can transform their body into a weapon.On the first impression, you will see her as a taciturn girl and emotionless, but as far as the story goes, she had developments in her characters and of course the \"love\" development between Rito and her. its harem anyway.\\n\\n\r\nThe Second one is Yami, as we know from the previous season, she appears to be a dandere girl , which is cool and taciturn. She is also a loner and more She states she hates \"ecchi\" people, and does not hesitate to assault a person who looks at her in an obscene way, and usually Rito is the victim of this. lol. For this series, we will see the development between Yami and her friends.\\n\\n\r\nThe third one is Momo Devilluke Belia, she is Lala's sister and Nana's twin, she appears to be a naughty girl which is usually tease Rito in her way, despite of her action, she really loves Rito even she makes a harem plan just for Rito and even she is always protect Rito from any dangers .The last one is Rito, our main character in this series. I dont have many words for him, one sentence for me, He is a lucky guy who is being liked by many cute girls!.\\n\\n\r\nI do really love with this series especially this season, because they had improve their quality like from the story and the art. But of course, there is nothing that perfect, so does this anime. Still there was unnecessary fanservice that really distrubing my eyes, Like how Rito is always trapped in such ecchi scenes (like he is usually grabbing boobs absently or how he trapped in Yami's panties without any logical reasons), but despite of that unnecessary scenes, i know that scenes were made to refresh our eyes. And of course its acceptable since this anime genre is Ecchi, honestly, although i found that unnecessary, as a man i must said it was kinda fun.\\n\\n\r\nAt the last, I must say i quite enjoyed this anime. I really surprise on how this anime can improve are, from such a fail anime turned into an amazing anime. of course, thanks to Momo and Mea as the new character that makes this anime more lively and fun.\\n\\n\r\nThe summary for this review :\\n\r\n+ Finally has a strong plot\\n\r\n+ This season have some improvement than the previous one\\n\r\n+ Amazing OP\\n\r\n+ A good developments between each characters\\n\\n\r\n- Unnecessary fanservice scenes that sometimes didnt really make a sense, but oh well. Its ecchi anime anyway\\n\r\n- There is still fillers episode\\n\\n\r\n*Thanks for reading my review! If you found this review was not helpful or doesnt good enough,please message me. I really appreciate any feedbacks*",
            "date": "2013-07-18T18:42:00+00:00",
            "helpful_count": 31,
            "mal_id": 105911,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1665261.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kynov",
                "username": "Kynov"
            },
            "url": "https://myanimelist.net/reviews.php?id=105911"
        },
        {
            "content": "Happy New Year to all of you out there, ok so it's yet to be a new year here in Mexico but in a few moment from now it will be, so I'm preparing my little friend a Glock 9, yes here in some dark recess of Tijuana Mexico when we say we celebrate the New Year with a bang, we really do mean with a BANG!!! But enough of that, so let get down to business, so what we have here is a sequel from the season 2 of the parent anime \"To Love Ru,\" except this has more to do with Momo's planto organize Rito's harem, TBH this sequel has no story in it just a setting and a chaotic plot which was centered around Momo's plans for Rito's harem with a little bit of arcs that comes to Rito every now and then which is pretty usual from the season 2. And that's as good as it gets, oh, and there are still those unusual circumstances where the Rito get's into which always spells 'TROUBLE.\" So for the story I give it a \"Decent 4.\" because the chaotic plot was compensated by the comedy and ecchi genre.\\n\\n\r\nArt and sound: Mediocre 5.\\n\\n\r\nAs usual there is that boob flashing, close up panty shots and close up booty calling that are censored just like from it's previous sequel , so to be able to view this anime without the censored, it's advisable to wait about a 1 year after it's airing, since the links would now show this anime uncensored, but that still depends on the link that one might have access to. Co'z some links still maintains archive anime whose intense ecchi  genre are censored. as for the sound, I just don't have any comment about it.\\n\\n\r\nCharacter and Enjoyment: Fair 6.\\n\\n\r\nThought, this sequel goes against the Lala X Rito arc with Haruna on the side, it very clear that in this sequel one must now forget the Lala X Rito X Haruna arc and focus on the Momo X Rito arc with Mea on the side. The arc may contradict the usual arc of the 1st season, but here the new arc is not bad at all in fact it was nice that Rito gets to have something different, however I still hate it that Rito still hasn't got the balls to confess his feelings for Haruna.\\n\r\nNow, I do notice that Yami was supposed to be the main character here, but it kind of looks like that what she does is no different from what she usually does from season 2, the only that charge was the amount of aired time she has. It is quiet disappointing that   studio Xebec tends to mislead about that character set up, co'z it looks more like that Rito, Momo and Mea are the real main character's here  than Yami, besides wasn't this sequel titled \"To Love Ru: Darkness?\" In which we the audience were expecting that Yami was suppose to be the main protagonist here, but instead a new comer 'Mea\" is the one taking the spot light here as the antagonist, other than that nothing much has change about the other characters in this sequel. The enjoyment part is basically revolves around that ecchi and the comedy genre which was usual from season 1 to season 2. But, it was Momo who serves as the driving force of this sequels comedy aspect, thought it was also a disappointment that we the audience never get to see Mea's boss, with that and the chaotic plot I limit it to just 6. \\n\\n\r\nOverall: Poor 3.\\n\\n\r\nIt is probably safe to say that the 1st season was better than the 2nd and this 3rd season. Because in the 1st season thought it does share that same usual genre, the executions were different, season 1's plot basically follow an organize scenario while season 2's plot was based on a per episode basis, and in this sequel the plot is on Momo's harem plan for Rito, but generally everything is on Momo. Also, about this sequel's title  was a bit misleading co'z on paper it was titled \"To Love Ru: Darkness\", but it looks like studio Xebec unofficially titled it \"To Love Ru 3,\" now I can't say if the \"3\" in what we see as the last word for this anime's title is a Japanese katagana symbol for \"Ru\" or is it actually \"3\" as in the number 3. Then again who cares? Well, I wish everyone to have a prosperous year for 2013. \\n\\n\\n\r\nWell, the bullets for my Glock 9 have just arrive we'll be doing some aerial shooting once the clock hits 12 midnight to celebrate 2013, man I wish I could use it to shoot that MAL user that pisses me off, if I can locate him. If that SOB is reading this you know who you are.",
            "date": "2012-12-31T13:51:00+00:00",
            "helpful_count": 22,
            "mal_id": 82128,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/442087.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Nasty001",
                "username": "Nasty001"
            },
            "url": "https://myanimelist.net/reviews.php?id=82128"
        },
        {
            "content": "There is action in this 3rd season in 2 kinds of ways ;)\r\nThis 3rd season is the alot better than the other seasons were, in that it actually has a story going and that there is action in it. Some parts are intense and some parts are pretty funny\r\nI think they might make another season after this, but maybe the OVA will wrap it up. This season is mostly about Momo, Yami, Rito, and new girl Mea (she reason this season is intense)  Lala barely as a role at all this season so far.",
            "date": "2012-11-12T21:55:00+00:00",
            "helpful_count": 17,
            "mal_id": 77363,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1496221.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/LawlumBawlum",
                "username": "LawlumBawlum"
            },
            "url": "https://myanimelist.net/reviews.php?id=77363"
        },
        {
            "content": "So I've watched the whole series and I must say if you are a fan of echi/harem stuff then this IS the perfect anime for you.The course of action is quite hilarious as the plot advances and the characters develop around the protagonist. I had hoped for the action to circle around Rito and the three princesses,if you have seen the series you know what I mean,but it still enjoying to watch. I am still hoping to see the day when Rito fulfills his destiny and Momo's dreams come to reality, wouldn't that be quite a scene? All in all To LOVE-Ru is a seriesthat can compete with any other anime and has a great chance of winning",
            "date": "2012-12-31T00:07:00+00:00",
            "helpful_count": 14,
            "mal_id": 82080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1920584.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Growler",
                "username": "Growler"
            },
            "url": "https://myanimelist.net/reviews.php?id=82080"
        },
        {
            "content": "So far To LOVE-Ru Darkness seems just fine to me. But that could be because I love ecchi and harem anime. The story although has become more compelling. Fan-service is huge in this anime, and when I say huge I mean the freaking empire state building. But again I love ecchi so that's a plus for me. Personally I like the sound track to the point where I would actually buy the CD. The characters don't change much from the last season, although you are introduced to some new characters. Rito is again constantly falling on girls in silly ways. But there was something aboutthis season that sent a different vibe down my back. I don't know, it's probably like the name suggest, a darker vibe. I always loved the art for to love ru and I still love it now. Oh and one more thing, BUMP ALL DAT CENSORSHIP, DA HELL, IT'S FREAKING ECCHI. I WANNA SEE SUM NIPPLES. \\n\r\nSo if you love ecchi like me wait until it's released on blue-ray. Otherwise, get used to random white lines and fog.",
            "date": "2012-10-31T19:44:00+00:00",
            "helpful_count": 14,
            "mal_id": 76365,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1373901.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/blakedueson",
                "username": "blakedueson"
            },
            "url": "https://myanimelist.net/reviews.php?id=76365"
        },
        {
            "content": "To Love-Ru Darkness is the third installment in 'To Love-Ru' series and as the previous two it tries to overload the viewer's reward system in the brain by flooding the screen with symmetrical breasts, symmetrical butts... and more breasts. Darkness rises above all other ecchi series so high that it's at the top of the ecchi grading scale. A story about a mushroom that grows up in a humid forest would get 0% whereas Darkness would be the polar opposite with 100% ecchiness present. Let me put it this way, if you put any more ecchi into an anime series the earth would collapse pastits schwarzschild radius and create a black hole. \\n\\n\r\nNow, let's describe darkness in detail. Firstly, the story progresses much further than in the previous two installments. Right off the bat, the characters and the plot are re-introduced to us, which surprised me pleasantly and I thought it was a good move on the part of the creators in case someone took a long break from To Love-Ru or anime in general. \\n\\n\r\nMomo, the third of the Deviluke sisters assumes the position of the main character along side Rito in this season. The plot focuses on her attempt at monopolising all the girls for Rito, solving the succession debacle and helping Rito awaken his carnal desires and taking his place as the rightful ruler of the galaxy. Sounds like something out of a Ming Dynasty documentary, but it is genuinely hilarious and guaranteed to raise an eye brow or two as Momo's actions often have adverse effects. The boys at the school have enough of Rito's shenanigans, the girls keep molesting him mercilessly and the principal is up to his old perverted tricks. All in all, a positively entertaining WTF-fest. \\n\\n\r\nApart from the usual, we're also introduced to a couple of new characters like Kurosaki Mea and Tearju Lunatique and their appearance starts answering some questions that were on the minds of no doubt many watchers at the conclusion of the second season. Despite the ecchi silliness and lots of \"what in the heck did I just watch?\" moments, the plot actually thickens, revolving around the past of the main characters and some of the issues they're struggling with.\\n\\n\r\nAs the previous two 'To Love-Ru' seasons, this one is inconclusive which means that we'll be seeing more of Rito's/[enter Devilukian princess name here] hot tail-licking action in the future. \\n\\n\r\nNow the sound and art both improve from the previous two seasons. The visual aspect here is absolutely mouth watering and attention has been paid to every detail - not only the girls. Buildings, trees, even the god damn pavements are sexy. Likewise, voice acting is spot on and the opening and ending songs nicely composed. Perhaps the only thing lacking in the sound department was the OST. It didn't have any songs that stood out or affected the viewer's emotions, it was rather plain and dull. Then again, it's hard to expect a good OST in an ecchi anime. \\n\\n\r\nSumming up, To Love-Ru Darkness is a very good continuation of the series and offers more in terms of the plot and character development. Of course, at the same time we get to laugh at the various bizarre mishaps that Rito and the others go through in their daily lives... and the tail fondling. Dear god. If anything, watch it for the tails. \\n\\n\r\nA solid 8 points from me. \\n\\n\\n\\n",
            "date": "2013-07-26T08:12:00+00:00",
            "helpful_count": 10,
            "mal_id": 106925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/491238.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Simonian",
                "username": "Simonian"
            },
            "url": "https://myanimelist.net/reviews.php?id=106925"
        },
        {
            "content": "To love ru darkness is a direct sequel, but unlike it's pequel, it's focus more on the characters and the story.While some might say that the \"harem plan\" is stupid, it gives rito a chance to develop and give screen time to the girls who didn't get as much as before.\r\nThe story start as simple but very quickley we can see that there is a more \"mature\" tone to darkness than before-it's tries to bring an actual plotline, while focusing mainly about yami and her past, thus creating a very interesting plot. Although the shame is, that rito doesn't really feels like \"main character\" anymore,but I hope that as the series will progress we could see more about him.\\n\\n\r\nMost of the characters are likeable and the fanservice is simply great. We got pleny of girls we can root for and frankly, I hope for a harem end because it's very hard to decide which is \"the best\".\\n\r\nRito is likable MC because he is very nice and help the girls, the girls all have a unique trait of it's own.\\n\\n\r\nThe comedy is okay I guess, there are some very fun scenes and some are repetitive, but all in all it's ok.\\n\\n\r\nIt's a very fun series to look at if you are looking for some echii fanservice stuff, a great way to pass the time is by looking the almost naked girls in this show.",
            "date": "2015-04-08T15:00:00+00:00",
            "helpful_count": 8,
            "mal_id": 185158,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3677263.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DanDan_Mushi",
                "username": "DanDan_Mushi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185158"
        },
        {
            "content": "* * * THIS REVIEW COVERS BOTH DARKNESS AND DARKNESS 2ND * * *\r\nThe road to this point has been long and arduous. To LOVE-Ru’s first season was, by all accounts, total and complete dreck. The OVAs were mediocre at best. Motto was passable. But now—but now—after wading through 46 episodes of mostly vacuous blandness, it is time for something a little different. It is time for some honest to God, quality anime. Yes, to get straight to the point, To LOVE-Ru Darkness is good. And this is not some kind of run-of-the-mill goodness, no, this is genuine article high-quality content.\r\nBut wait, before I gettoo far ahead of myself, let me first clarify exactly what To LOVE-Ru Darkness is and how it differs from the original series. Though its title implies that it is a spinoff, in reality, Darkness (as it shall henceforth be called) is nothing more than an ordinary sequel to the original To LOVE-Ru manga. We need not let this be discouraging, however, because while it may technically be a sequel, Darkness is an entirely different beast from its low-quality predecessor. Though it features a mostly unchanged cast of characters in fairly similar scenarios, it manages nonetheless to be very distinct thanks to its extremely unserious tone, revamped plot, and a small selection of new key characters.\\n\\n\r\nOf these three distinctions, the first—that Darkness is less serious than the original series—may immediately seem the most suspect. After all, while To LOVE-Ru often failed spectacularly to be funny, it was at the very least intended to be a comedy-heavy harem ecchi show. In other words, to begin with, it never had any seriousness to speak of. Even so, Darkness somehow manages to top this. Not only does it not take its plot seriously, it doesn’t take anything about itself seriously. Whereas To LOVE-Ru often felt insecure—as though it kind of wanted to be a fanservice show, but also didn’t really want to offend anybody—Darkness feels like an older and worldlier sibling. It is content to throw all kinds of licentious filth in our faces and not feel the least bit ashamed about it. Though it may be strange to say this of a piece of television, Darkness could best be described as feeling like it has high self-esteem. It is self-aware of the kind of show it is, and rather than letting this get it down, it is completely forthright about it. This is what I mean when I say it feels less serious than its predecessor: it has the ability to not only laugh at its silly characters and plotlines but also to laugh it itself. Of course, if all it did was laugh at its problems rather than addressing them, Darkness would not be much better than the original. But Darkness doesn’t just laugh at its old flaws, to a certain extent, it also embraces them. \\n\\n\r\nIn order to really understand this point, it is important to first understand the three main ways a work can approach its problems. The first way—and this is mostly what the first season of To LOVE-Ru does—is to simply ignore them. The major advantage of this method is obviously that it is extremely easy for the creators since they don’t even have to make any meaningful changes to what they were already doing. On the other hand, it also has a major drawback in that, well, it doesn’t actually fix anything. The second, and perhaps most effective, action a creator can take is to buckle down and actively try to diminish the presence of the flaw in their work. Unfortunately, while it sounds very pleasant, going through with this method is rarely all that feasible considering problems usually exist precisely because they are difficult to eliminate. As a result of this difficulty, creators might try the third method of approaching a problem—addressing it without truly ridding their work of it. A common way to achieve this would be through acknowledgment, that is to say, calling attention to the existence of the problem without solving it. Effectively this is the author giving the audience a wink and a nod to show that they are as aware as anyone of the problems their work has. To LOVE-Ru did this from time to time when characters would mention something along the lines of, “Wow, Rito sure falls down on top of girls a lot…” showing us that the writers knew they were overusing that gag but were unwilling to go through the creative strain of coming up with a more inventive way of getting him into sexual situations. \\n\\n\r\nNoticeably, Darkness does not do any of these things. Rather, it employs the rarely used fourth way to approach problems that I mentioned earlier: by embracing them. Utilizing this method requires both subtlety and creativity to prevent the problems from merely being exacerbated, but I firmly believe that Darkness manages to achieve spectacular success. Almost none of the problems from the first season of To LOVE-Ru (and there are many) are really absent in Darkness—instead, they have been retooled to work in the show’s favor. For instance, take a look at some examples below.\\n\\n\\n\r\n1.\\n\\n\r\nThe problem - Out-of-whack romantic progression: Rito regularly gets into sexual situations with random girls, yet at the same time he can’t even muster up the courage to ask out the girl he has had a crush on for 46 episodes.\\n\\n\r\nThe expected solution - Have Rito make some kind of romantic progress with his dream girl or at the very least have him show some form of assertiveness.\\n\\n\r\nDarkness's solution - Make the romantic progression so impressively out-of-whack that it no longer bears any comparison with reality. No one can levy any criticism against it when it’s so far removed from anything real that they can’t even properly apply normal logic and reason to it.\\n\\n\\n\r\n2.\\n\\n\r\nThe problem - Rito falls on top of girls too frequently: Nearly every episode seems to rely on the same gag where Rito falls on top of a girl and touches them in some vaguely sexual manner, to the point that the joke becomes tired and hackneyed.\\n\\n\r\nThe expected solution - Create new gags and new ways of forcing fanservice so that the show doesn’t have to rely on the same thing happening over and over again.\\n\\n\r\nDarkness's solution - Turn Rito into the God of falling—a being whose ability to unintentionally sexually harass others is unparalleled among mere mortals. As Yami astutely observes at one point, “this man’s sexual harassment has reached the level of a superpower.” Rito is no longer a man, he is a fanservice deity.\\n\\n\\n\r\n3.\\n\\n\r\nThe problem - Over-reliance on panty shots: Too much of the show’s fanservice consists of little more than contrived situations that lead to the viewer being able to see a girl’s panties for one brief, joyous moment.\\n\\n\r\nThe expected solution - …Use fewer panty shots.\\n\\n\r\nDarkness's solution - Bring out the avant-garde camera work. Turn even the most mundane of conversations into a fanservice-fest by angling the camera so that the audience can see up the nearest girl’s skirt. After all, why waste time on a shot that has no fanservice when you can just tilt the camera?\\n\\n\\n\r\nIn this way, Darkness feels, more than anything, like a parody of itself. Of course, in order to joke about itself so effectively, it has to be completely self-aware. It knows exactly what it is and what it aspires to be and it announces this fact loudly and proudly at every passing opportunity: “I am a gross affront to taste and decency!” it says. “Behold, fanservice the likes of which you have never seen before!” it proclaims boldly. “I am the very distillation of debauchery in animated form!” it bellows assertively.\\n\\n\r\nWhile its unserious and parody-like treatment of itself may be wonderful, though, I do think that it would be rather reductive to suggest that the entirety of Darkness’s success comes from these facets. Even on a more conventional level, it puts the original to shame with its more cohesive and engaging plot. Yes, believe it or not, Darkness actually has a plot. Granted, it’s no work of timeless art or anything, but it certainly gets closer to art than I, or indeed, anyone, could reasonably expect the sequel to To LOVE-Ru to get.\\n\\n\r\nOn the most basic level, Darkness continues to follow our hapless protagonist, Yuuki Rito. Beyond this, however, it carries few traces of the plot (or lack thereof) present in the original series. Instead, the focus has shifted significantly from Rito and Lala’s haphazard romance to what I can only describe as the greatest plot idea to ever grace harem anime. An idea of such endless quality that it must surely have been the result of divine intervention: the so-called “harem plan.” Devised by Lala’s younger sister Momo (who I will describe in greater detail shortly), the end goal of this plan is simply to have Rito enter into a polygamous marriage with every single one of the countless girls that are attracted to him. That’s it. By and large, gone are the convoluted and pointless alien politics that sometimes clouded To LOVE-Ru, and gone are the tiresome and hopeless struggles of Rito to confess to Haruna, his dream girl. All that remains is a perennial quest to get as many girls as conceivably possible to join Rito’s harem. One can immediately see why such a plan is so ingenious an idea for this anime. For one thing, the seemingly unavoidable problem that plagues all harem anime—choosing a single girl to date at the end—is easily resolved now that the goal has become for Rito to marry them all. But beyond that, this plot is a resounding success for exactly the reasons described in my earlier point: it allows Darkness to be utterly unabashed about its ecchi harem nature. No nonsense. No excuses. Just an increasingly large number of sexy girls.\\n\\n\r\nThis is not to say, however, that all sexy girls enter the harem with the same degree of ease. For some, a few minutes of screen time dedicated to Rito performing some minor act of kindness is all it takes for them to fall hopelessly in love with him, but for others, entire episodes or even story arcs may be necessary. In particular, Konjiki no Yami—The Golden Darkness—(the dispassionate assassin who was at one point sent to kill Rito but now lives peacefully on earth) proves to be an unusually stubborn candidate. In fact, so much of the plot of Darkness is dedicated to her very belated entrance into the harem that she ends up being the titular character. I suppose there are more honorable things to have named after oneself than an ecchi anime, but at least she was lucky enough to get a good ecchi anime. Indeed, as someone who previously noted that “if there is one character in [To LOVE-Ru] who deserves to be a part of a better anime then it is surely the ‘Golden Darkness,’” the fact that she receives the brunt of the attention in this good anime surely makes me very happy. What is most astonishing to me about all this, though, is that Darkness, the most lowbrow of television, actually manages to develop her in a reasonably well-written way. Over the course of its 26 episodes, comprising two seasons and two special episodes, we gain insight about her mysterious backstory, see her come to terms with her tumultuous past, and watch as she finds herself entering into more meaningful relationships with the people around her, especially Rito’s sister Mikan. \\n\\n\r\nAll of Yami’s development builds masterfully towards the series’ stunning conclusion in which her master, a (sexy) girl called Nemesis, releases the “darkness” within Yami, turning her into a world-destroying, godlike being. Following this, there is a lengthy and dramatic action sequence wherein many girls’ clothing is destroyed but no real damage is caused. Eventually, Lala’s sister Momo reveals to Rito that there is only one way for this situation to resolve itself: he must rebel against his sex-averse nature and engage in some “lewd acts” with Yami. Though he is initially skeptical, he is urged on by an underclassman named Mea who informs him that his “shamelessness will save the world.” In the end, he subdues the now nearly omnipotent Yami by casually walking up to her, taking off most of his clothes, and then groping her a bunch. If that is not the very apotheosis of ecchi anime, I don’t know what is.\\n\\n\r\nAs beautiful as that may be, though, Darkness’s plot would not be able to achieve any real success unless its characters were there to support it. The “harem plan,” for instance, would be pointless and insubstantial without girls of sufficient sexiness and quality of personality to join its eponymous harem. And so, it is here, with the characters, that Darkness elevates itself the most beyond the intense mediocrity of To LOVE-Ru. Yes, despite being made up of largely the same characters, Darkness’s cast is vastly superior to that of the original. The new characters are more fresh and inventive than those from the original series, and the old characters are either given more proper character development than before or appear less frequently. Of particular note are the new additions of Lala’s younger twin sisters Momo and Nana. Though these two were technically first seen in the To LOVE-Ru OVAs, their real importance becomes apparent during Darkness when they (along with Yami) replace Lala and Haruna as the show’s main heroines to great success. But who exactly are these two sisters and what makes them so successful? Let’s look a little deeper.\\n\\n\\n\r\nThe Deviluke Twins\\n\\n\\n\r\nMomo Belia Deviluke: Momo is Lala’s younger sister who eventually decides to move in with, and attend the same school as, her sister (and Rito) on earth. Outwardly, she is a kind and gentle soul who immediately draws the admiration of her classmates, both male and female (but let’s be honest here, mostly male). Inwardly, however, she is an entirely different beast. Behind her cute façade, she is a dangerously creative schemer who harbors a deep-seated obsession with the erotic. Of course, regardless of how creative she may be, she still falls wildly in love with Rito before the viewers can say “fanservice.” Unlike her compatriots, however, she does not merely sit by and let that poor boy make a fool of himself with every girl in sight. Rather, she decides to take matters into her own hands and concoct the ingenious “harem plan” of which I have already written so highly. \\n\\n\r\nThe “harem plan” is really only one example of Momo’s escapades in action though. Throughout the show, she continuously makes her influence known, as she often goes out of her way to get Rito into lewd situations (much to his chagrin) in an attempt to expand the harem. These sorts of situations really go to show that Momo is exactly the kind of character this show needed. Her sexual-mindedness and conniving nature endow her with the ability to turn even the most mundane of situations into an entire fanservice-y pageantry. In fact, on the whole, Darkness owes a great deal of its success to Momo. Thanks to her salacious influence, it is able to bring about its fanservice far more gracefully than the contrived situations that were required in To LOVE-Ru. And it certainly seems that the writers were well aware of this fact because Momo appears with great frequency throughout Darkness—probably more than any single other character besides Rito himself.\\n\\n\r\nOverall, then, I do not think it would not be an exaggeration to say that Momo is not only the best character in Darkness but one of my favorite anime characters of all time. Honestly, even having written this entire section of the essay praising Darkness, it still astonishes me that a character of such quality could have graced a show like this one. It astonishes me that the writers had it in them to make a character this good yet still wasted my time with the congregation of clichés that made up To LOVE-Ru’s cast. In a sense, Momo is so perfect a character, so precisely crafted to target and fix the first season’s fundamental issues, that she makes the rest of the cast look even more incompetent than they already were by comparison. Regardless, her addition to Darkness is one of the show’s greatest assets in allowing it to become more than the generic harem farce of Motto.\\n\\n\\n\r\nNana Astar Deviluke: Nana is also Lala’s younger sister and also eventually decides to move in with, and attend the same school as, her sister. Unlike Momo, however, Nana makes no attempts at concealing her real personality. She is loud, easily angered, and takes great offense to Rito’s acts of unintentional sexual assault, regularly calling him a “beast.” Like most of the viewers, she finds it inconceivable that this man has amassed so substantial a harem, although in traditional To LOVE-Ru fashion, she does come around and eventually falls in love with him in a begrudged kind of way.\\n\\n\r\nIn comparison to her sister Momo, she is neither as plot significant nor, frankly, as interesting a character. Even so, Nana’s inclusion is by no means a misstep on the part of the writers. For one thing, her smaller-than-average boobs bring some much-needed balance to the average boob sizes among girls in this show. This may not sound very important, but the show feels the need to bring this fact up every few episodes just to make sure the viewers haven’t forgotten. Momo especially appears to believe that the matter of boobs is of such paramount importance that she acts as though Nana’s small ones constitute some sort of crippling disability. It’s really rather tragic. \\n\\n\r\nBeyond the realm of boobs, Nana generally serves as a strong contrast to her sister Momo, particularly with regards to her attitude towards Rito. Whereas Momo is uncontrollably in love with Rito from the show’s beginning, Nana acts spitefully towards him for most of its run. Even when she does eventually develop some feelings for him, she still treats him quite harshly. The most important effect of this is that she serves to keep Momo and Rito in check. I think if Momo were the only new character added, the show might quickly devolve into total debauchery, but with Nana present in the Rito household, there is always someone there to yell at one or both of them when they begin to take things too far. In essence, she exists to stop the show from veering into hentai territory. Of course, being the preventer of lewdness is certainly a thankless role and one that can be easy to hate from a viewer’s perspective, but I believe it is an integral one. This way, Momo can stay in character (exhibiting her usual constant desire for eroticism) and the show can still air on television.\\n\\n\\n\r\nAs I have hopefully demonstrated, Momo and Nana work together to great effect to form the backbone of Darkness. Add in the new and improved Yami, and we have a cast of central heroines that make To LOVE-Ru’s cast look like a ragtag band of clichés in comparison. Of course, Rito is still the same old sex-averse loser that he has always been, but surrounding him by such an excellent group of girls does undoubtedly serve to mitigate his problems—even if it cannot completely do away with them. Ultimately, as much as I have come to like this show and its characters, and as much as the changes that Darkness brings cause him to be less of a nuisance, I still do not really like Rito. Comparing Darkness’s Rito to the original’s Rito, though, is like comparing stubbing one’s toe to sticking one’s leg through a wood chipper. Neither are pleasant by any stretch of the imagination, but one is a mild inconvenience and the other is unbearably agonizing. By now, Rito’s greatest sin is really only that he is boring, and this is not a sin that bears much weight when he is able to play off of so many vastly more interesting characters around him.\\n\\n\r\nBesides characters, there is one more topic that I think is worth discussing before I finally stop rambling on about Darkness. This is a central topic which I have been ignoring for quite some time—the most important topic of all: the fanservice. Though I have mentioned it at various points throughout this portion of the essay and hinted strongly as to what I think of it, I have not outright stated what I think of Darkness’s fanservice. To put it clearly, the fanservice present in To LOVE-Ru Darkness is of extremely high quality. There is a little bit of everything here: from gender-bending to a girl being suggestively force-fed a popsicle while wearing a school swimsuit and yelling “master” repeatedly. I won’t deny that it is an acquired taste, but I firmly believe that this quality selection of ecchi moments pairs well with the excellent character designs and art-style in Darkness to make its fanservice a resounding success.\\n\\n\r\nIt’s also worth noting that Darkness blows its competition out of the water not only in quality but quantity of fanservice. I don’t think I have ever seen an anime with more fanservice than this one. Granted, I don’t pretend to be an infallible authority on all anime, but I have seen more than enough to know that Darkness has, to put it crassly, a fuckton of fanservice. The show might as well be titled Fanservice: The Animation. Every episode of this show is a non-stop barrage of lewdness—23 minutes of Rito and his endless erotic escapades. And I for one love it. I relish the feeling that every moment spent watching this show is one spent, as the weebs say, “straying further from the light of God.” I relish the feeling that every person I know, have ever known, or will ever know would be profoundly disappointed in me if they knew that I watched this show. But above all, I relish the feeling of catharsis from having suffered through so many hours of To LOVE-Ru’s pathetic excuses for ecchi moments and now—finally—seeing some of the fanservice I felt so robbed of. Nothing can truly make up for the time I squandered on the early parts of this series, but at the very least I received some vindication in the end. It is a sad, hollow sort of vindication—no doubt I would rather have avoided the first season of To LOVE-Ru entirely—but it’s something to show for this time that I once considered totally lost.\\n\\n\r\nIn the end, I have probably vastly overstated just how good To LOVE-Ru Darkness really is. Certainly, as much as I can praise it, this salacious celebration of sexy anime girls will never go down in history as one of the all-time greats. Even so, I will not soon forget this show. The feeling that overcame me as I watched its 26 episodes in the gloom of my room—as it slowly dawned on me at first with incredulity and later with mounting joy that this iteration of a series that I once execrated is actually good… the mixture of profound surprise and relieved elation that I felt then will stay with me forever.",
            "date": "2019-01-26T10:00:00+00:00",
            "helpful_count": 2,
            "mal_id": 300051,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5047963.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TGK94",
                "username": "TGK94"
            },
            "url": "https://myanimelist.net/reviews.php?id=300051"
        },
        {
            "content": "so i watched to love ru years ago when i dont really pay attention to the story and only been there for the ecchi. and now i decided to rewatch it again due to curiosity and of course, ecchi and welp i guess i know what i love this show so much back then.\r\nwelp the first to love ru maybe a bit boring and the art isnt that good but seeing the improvement from the first till now, damn im glad i endured the lack of animation back then (welp its from 2008 so i guess i cant complain). \r\ni was thinking of making areview after i finished the anime till darkness 2nd but i changed my mind bcs i feel like i need to make this season's own review.\\n\r\nthis season is so much better than the previous one, you know where the story is going to be, you have good fighting scene (i guess..) and of course, MOMO !\\n\r\ndamn im obsessed with momo. no kidding. i cant stop myself of wanting rito and momo be together.\\n\r\nthe animation is a blast. massive improvement from the first one.\\n\\n\r\ni guarantee ya, if you can endure the first one, it will be worth it to watch this one!\\n\r\nand last but not least, momo , damn you're cute",
            "date": "2019-01-18T20:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 299403,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5539672.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/bakacheeto",
                "username": "bakacheeto"
            },
            "url": "https://myanimelist.net/reviews.php?id=299403"
        },
        {
            "content": "I wouldn't usually write a review for an ecchi/hentai/harem/porn/incest/whydon'tyoujustjackoffalready?-anime, but people are being driven crazy by this thing, it's already got a score of 7.99(at least when I wrote this) and the OVA basically is what they don't get to jack off to--I mean watch in the regular To Love Ru Darkness season, I mean, I get it, the show is good at getting your dick hard, good, and it can also make you have some giggles and good fun on the process? Great! But is it really a 10/10 show? No, it isn't.\r\nAnd if there is anyone who dares to say that is thebest anime they've ever watched, is because they probably mean it's the best porn they've ever watched, ask them to justify why it is the pinnacle of anime, and you'll see the anwser will be along the lines of \"Can't you see how brave this characters are? They dare to have a guy touch them when he is already semi-kind of engaged! Not in this world man\", \"The art is soooo good! Have you seen the way those watermelons dance?\", \"I came 3 times that day\", \"My penis pretty much typed this review\". And why? Why is it that all the people making reviews are getting so crazy about it? Well, that's because this is porn, what where they looking for when they watched this? Porn. The simple fact that they are looking at anime as a pure masturbation mean, makes them lose their criticism and can only say wonderfull things about it.\\n\\n\r\nNow, I'm gonna stop being a dick to all those people who are controlled by their sexual lust and are not able to be critical about anime because of this reason. \\n\\n\r\nStory (6): The story is not amazing, in Love-Ru we start off with the usual girl who falls in love with the main character and then they have a problem, and they have to fix it, they are given time, in that time more females are introduced, they all fall in love with the main character eventually, the problem comes back, and with enough -falling on their panties- moments, the problems comes back once again, and then it can either leave and come back later or end the problem and start something new. To Love-Ru is pretty much this, probably the only thing I've enjoyed in this new \"lets create a Harem\" deal, is the fact that Momo tries to get into Rito's mind and make him into a perverted playboy, wich adds somekind of psychological control, wich is a nice touch and I can appreciate it. I'd also like to add that Darkness probably beats the other To Love-Ru arcs, just for the fact that this might actually go somewhere, the character development is minimum but there is some of it...I think.\\n\\n\r\nArt (9): I don't really care that much about art to be sincere, cause I believe a lot of people tend to ignore other animes just for the fact that the art style is strange or different to their usually anime, so I don't think the art makes the anime, but it can obviously be appreciated mostly in a show where the way characters look is so important. Darkness has a pretty solid art style and has a nice look to it.\\n\\n\r\nSound (7): I've never really liked the music themes in the To Love-Ru franchise, but I guess there might be someone out there who enjoys them, but is nothing I would consider memorable or outstanding, the sound effects in the show are good in setting the atmosphere, maybe not the greatest, but good.\\n\\n\r\nCharacter (6): Well, maybe the part where most of the people might disagree with me, a lot of people can only say that the cast of characters is great, that they are all deep and amazing, original and well thought...this is one of those harem shows where the show is trying to make you pick which girl you like the most, there's nothing new to them, you can find them on other harem shows, where they try to introduce as many female personalities as possible (wich I wouldn't say is always bad -Kotegawa best girl) , the shy, the dumb, the responsible, the perverted, the athletic and then there's the one that's in love and the one that just wants some action under the sheets. Despite what must people may say, I think the characters don't have that much to them, they don't really seem to have motives in their lifes, they are always in the same mood until something happens to them, they don't really seem to be troubled with their every day problems, their personality just blends into the situation.\\n\\n\r\nOverall (6): But overall, I enjoy the show, not because of the plot, not because of the music, just because it has some ok comedy and is good at getting my dick hard, I can't deny that. In the ecchi category I could even consider that it stands out from the others, but if I'm really critical about it and look at it as anime as a whole, is not that incredible, the plot is ok, sound and art are nothing life changing, but is enjoyable. An overall 6 in my eyes.",
            "date": "2014-10-27T17:31:00+00:00",
            "helpful_count": 6,
            "mal_id": 166447,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3721255.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Coolingheaded",
                "username": "Coolingheaded"
            },
            "url": "https://myanimelist.net/reviews.php?id=166447"
        },
        {
            "content": "OVA Impressions at the end of this review.\r\nTo LOVE-Ru Darkness\r\n Wow…. I mean…. Wooooow….. or more like… YESSSSSSS!!!!!! And AHHHHHHHHHH HOLY CRAAAAAP WHHHHAAAAAA!!!! And then OH MY GAOOOOOO OH MY GAAUUUUUUUUUUU!!!!!\r\n………… That’s the best way to explain To LOVE-Ru Darkness; Season 3 of the To LOVE-Ru series, it once again changes the formula and oh man, is it good. After watching LOVE-Ru and Motto, I was rather curious on how Darkness would continue the series; not saying that Motto ends in a way where you can stop (Not at all), but rather, it’d get a little boring seeing Yuuki Rito continue to try and confessto Haruna. At the end of Motto, Rito is able to confess to Lala without much problem (About time, YAY!). He then tries to confess to Haruna, but he closes his eyes and stutters for far too long and she gets distracted by something else, when Rito say’s I like you, he actually says it to 4 other girls in his harem that happened to walk by!! A perfect way to end Motto and it’s the perfect way to start Darkness . Darkness starts off almost exactly the same that Motto did, Momo is in Rito’s bed, wearing nothing but a shirt and it’s oh so good.\\n\\n\r\n So what does Darkness try to do differently to continue holding the viewers’ attention? That’s really simple, if you looked at the art MAL uses to display To LOVE-Ru Darkness (or the Blu-ray for uncensored goodies), you’d have noticed that Yami and Momo are the prominent characters and that’s because they are! In Darkness, Momo has a plan to have Yuuki Rito create a harem, where all the girls become his concubine (or something similar to a hot polygamy) ; what an amazing plan! Momo is very much the Main in Darkness, as is Yami and a new girl named Mea. Yes, the other girls still show up, but don’t expect Lala or Haruna to appear as much, it’s the supporting cast of girls that get treatment this season and the way it’s all executed is perfect. Yami is unknown to us and Darkness does well to begin to explain who and what she is. Mea is just as interesting, even Makido-sensei gets some great exposition. I’m purposefully leaving out a secret person from the review because when she is introduced, you may get some feels! (I know I did). Even thinking about the other supports, Run-chan has an amazing episode, the way Mikan is shown throughout the season is fantastic [Redacted]! Having a large cast is seriously great for To LOVE-Ru Darkness, it gives us, the viewers, a lot to experience.\\n\\n\r\n Now the story in Darkness isn’t just a simple, let’s make all the girls lust for Yuuki Rito, oh no, it’s far more than that. Darkness, as the name of the season implies, has some pretty dark elements involved and if you’ve seen To LOVE-Ru and Motto, you may already have an idea as to whom it’s about, but stop right there! It’s 100% more interesting than you could ever imagine, I mean, ever ever ever imagine!!! I’ll just say, the way the plot unfolded itself was both quite natural and incredibly exciting; I was at the edge of my seat losing my mind (other reasons for that too) as I saw To LOVE-Ru Darkness.\\n\\n\r\n Ecchi……Oh gao… gao gau… Lewd…. Th-that’s really where Darkness goes full stop. The amount of oppai, pantsu, skin I’ve seen in Darkness is astounding, the immaculately drawn and superbly animated girls, it’s not just… it’s … more than…. Good or incredible…I can’t come up with words, I really can’t. Aside from the amount, it’s the way it’s shown to us, the stretching, the groping, the.. oh gau…. I’ve never seen lewd like this in anime before (strictly anime). It’s really insane, especially the last few episodes where everything gets propelled far beyond what our Solar System can handle, heck, the imaginations, the teasing, if you like lewds, please, do yourself a favor, watch this, just.. embrace it all. Don’t forget the popsicle scene either, that was….. well, it’s best not to speak of it,",
            "date": "2015-09-09T18:33:00+00:00",
            "helpful_count": 6,
            "mal_id": 198241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4568362.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/_Arcadia0",
                "username": "_Arcadia0"
            },
            "url": "https://myanimelist.net/reviews.php?id=198241"
        },
        {
            "content": "While I was disenchanted with the first season since it was just a jumble of events, the past two seasons in the series have been steadily getting better. With Motto running true to the Manga and kind of having some plot flow it still fell a little short in storytelling. Darkness solved those errors and the only reason I gave it a 9 is because I am able to follow the sequence of events throughout this season without asking myself, \"Where did this come from?\" or \"Why is this even included?\". \r\nI am a fan of the fanservice and harem genre but I was lostbefore this season but I'm happy I stuck it out to get to watch this. Although I am a little disappointed by the fact that Haruna and Lala don't play prevalent roles, Momo makes up for it with her scheming. Overall it was definitely more enjoyable this season and I hope they build on this success going into Darkness 2.",
            "date": "2015-03-05T22:36:00+00:00",
            "helpful_count": 6,
            "mal_id": 181799,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/cboyes7",
                "username": "cboyes7"
            },
            "url": "https://myanimelist.net/reviews.php?id=181799"
        },
        {
            "content": "STORY - 8\r\nART - 8\r\nSOUND - 8\r\nCHARACTER - 9\r\nENJOYMENT - 9\r\nIn this never-ending growth of enjoyable fanservice, To LOVE-Ru Darkness is the instalment in which the combination of both story and mindless fun takes form in a good way. What comes out of that is quite an alluring fractal I'd say. A phenomena that began progressing one day in the household of the once ordinary Rito.\r\nEver since girls from outer space (and Earth) started appearing all around the main boy, any chance of serenity and calmness was quickly trashed away. Poof! Never to be seen again. But it was not all in vain as itmeant meeting a group of likable girls with their own set of eccentric personalities. Darkness was no exception and this time, it actually had a pretty solid story with clear developments at its side. Revolving around the perverted, the silent, and the naughty, we enter Momo, Yami, and a new character by the name of Mea! With these three as the branches of the story, while not that groundbreaking, we were given a new depth in what had been a series mostly about fun entertainment. There were focus on backstories, giving more insight to the unseen situation away from Earth, in particular with those related to Yami and Mea. Fleshing out their characters, their feelings with the group of people they met along with their assasin side were shown. But what made Darkness so enjoyable was the fact that it mixed both seriousness and lightheartedness without breaking the flow of the story. Momo's amazing harem plan put in further spotlight on the other girl's relationship with Rito. Feelings gradually became more apparent and stronger, leading up to comedies that made them even more charming than before. You can definitely say Momo is taking strides in achieving her goal while pleasing the viewers at the same time. Cunning, foxy, crafty. Take your pick. She was a really entertaining strategist full of fun, devious schemes that worked for an ecchi and harem show like this. That said, lots of generic fanservice were still present which may get tiring due to ideas running out but nevertheless, they were amusing as each circumstances were slightly different.\\n\\n\r\nGrab the visuals from Motto To LOVE-Ru and reduce the amount of whitewash. That's basically how the art looked in Darkness. It still emitted some bright whiteness in the form of gradients but the colors this time were more saturated, which felt modern and in line with the setting. Design of the characters were adorable, having body figures that were reasonably realistic with their high school age. While action scenes weren't there that much, they had a nice choreography although it was nothing special considering it's still an ecchi show. The animation was slightly better than average. However, I noticed times when it felt really dull and toned down compared to its predecessors, especially in the earlier episodes. But for the ecchi scenes, Xebec placed in more effort and the result was there. They were definitely fluid. Bear in mind that we're talking about Momo and Mea here who were quite more special with their desires compared to the others. So these scenes were certainly even more steamier than before. So many turning the knob situations. And I won't lie, they were quite tense for me to watch yet still perfect for all the bigger ecchi fans out there. A bunch of new serious soundtracks played but overall, the whole show was still supported by a handful of cheery music. Each voice actress acted out their roles in a heart-lifting fashion to make you love your favorite characters even more. They really captured their personality well and that goes for the new characters too. The opening song by Ray was catchy, having a lighthearted quality along with a sense of seriousness fitting for this season.\\n\\n\r\nTo LOVE-Ru Darkness strikes in right with the blade of comedic ecchi, romance, and a fair amount of serious action. The introduction of a story gave a good enough rigid structure that didn't bleach out the fun enjoyment from before, only amplifying it even further. It managed to pull off a balanced entertainment with a similar premise from its previous seasons. This treasure of enchanting girls is awaiting you!",
            "date": "2018-04-06T08:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 277111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6649888.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/OVERPOWERED99",
                "username": "OVERPOWERED99"
            },
            "url": "https://myanimelist.net/reviews.php?id=277111"
        },
        {
            "content": "To LOVE-ru is not for everyone since this is one of the most ecchi anime in the ecchi world. It consistently have scenes which involves a blob of shadow blocking your view due the censorship.\r\n  So the story deserves a 8, since it's pretty good but not very meaningful in terms of actual plot like most other love/romance harems. But who cares, because everybody that watches to LOVE-ru is there for the ecchi scenes. \r\n Art is a perfect 10. They improves a lot compared to the first season. The linings of characters and the environment is just overall better than previous toLOVE-ru.\\n\\n\r\n  Sound, I gave it 9. The OP and ED was a little bit disappointing in my opinion. But the rest of the sounds in this anime was close to flawless to me.\\n\\n\r\n  Character, I gives it an 9 because each one of them is laid out very attractively and beautifully. Also, their personalities were captured really nicely.\\n\\n\r\n  I really enjoyed this anime watching ripped ones which doesn't have the censorships. It was honestly one of the best ecchi animes I've watched in a while. I'd say that it's equally good as the manga. In the end, to LOVE-ru earned a 9 as the average score. \\n\\n\r\n  Again! IT IS NOT FOR EVERYONE. Even with the censors, this anime is like at the border between R- and Rx(Hentai). BUT, Very good anime. #teammomo",
            "date": "2013-06-06T15:07:00+00:00",
            "helpful_count": 4,
            "mal_id": 100049,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1492537.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Harem-kun",
                "username": "Harem-kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=100049"
        },
        {
            "content": "There's no doubt that this one was the best so far in the To Love-Ru series, but I feel extremely conflicted about multiple aspects of this show. There were some awesome things that they did, but also a lot that I really despised.\r\nStory: 7/10\r\nUnlike the first two series which followed a mini-ep format, this one actually does have an extended plot which is developed throughout all 12 episodes. There are some branch-offs here and there, but they actually contribute to plot movement or character development, so there's no wasted episodes here. This time we actually have a central conflict, but the comedic aspect is retainedas Momo hatches her very own plan, as you'll see when you start watching, so I'm definitely glad that they actually decided to make a plot this time...but I feel they didn't tell it very well. There are a lot of serious moments in TLR Darkness (much more  serious than any scenes in the previous two), but the seriousness was not developed enough to have the impact that it should have. There were inappropriate comedic scenes mixed into the serious scenes which diminished the serious tone, or the serious conflicts were not elaborated enough to get us viewers into the mood and fully understand the situation. It's quite hard to explain without me spoiling the plot, and you might not even notice the issues that I'm talking about since they're pretty subtle, which means TLR Darkness didn't have any blatant problems, which is good! But comparatively, TLR Darkness went through a major improvement from the first two (unless you really just enjoy filler comedy episodes), so it's definitely something to look forward to when you begin.\\n\\n\r\nArt: 10/10\\n\r\nThe show has come a long way since the first one; the art is top-notch.\\n\\n\r\nSound: 10/10\\n\r\nI've enjoyed all the opening and ending themes for all the series, and I don't think they disappointed with this one either.\\n\\n\r\nCharacter: 7/10\\n\r\nThis category is probably where my biggest ambivalence lies. On one hand, some of the characters really get developed like Yami, Kotegawa, Momo and Nana (Momo is actually listed as a main character here because she really is), while others nearly completely fall out of the picture like Haruna, Saki, and most regrettably, Lala.  Lala gets maybe 30 min screen time total in all 12 episodes, and that part really made me sad since I had always considered her the most entertaining character in the show. Part of it is because of the introduction of even more characters, as if Rito's harem wasn't already large enough, and the cramped 12 episodes instead of the 24 in the first one really didn't allow all of those characters to get the spotlight. \\n\r\nBut the characters that did get screen time go through some fantastic growth which was enjoyable to watch as we learn about Yami's past, Momo's true nature behind her devilish ideas, and explore Mikan and Rito's sibling bond even further. On top of individual development, the writers also did a great job developing the relationship between the characters since basically half of Rito's harem lives in his house now; we get to see how all of the girls in the house interact with one another.\\n\\n\r\nEnjoyment: 6/10\\n\r\nI'll say it plainly: there wasn't enough Lala. That sounds extremely picky and trivial on my part, but why did we fall in love with this show in the first place? Sure, the fanservice may have initiated our interests, but fanservice can't sustain a viewer through 3 seasons. It was the highly interesting character of Lala Deviluke and her plans to make Rito fall in love with her as well as her quirky inventions that caused us to keep watching, and while the other characters are unique and intriguing in their own ways, the nearly complete disappearance of Lala made it feel like there was an enormous gap in the show. I only hope that they bring her back in the next season (I really hope there's a next season because the show has only been improving).\\n\\n\r\nOverall: 7/10 \\n\r\nEnormous improvement in almost all aspects, except for Lala's screen time, which in my opinion is key to this show. If you don't really mind that Lala goes behind the curtains in this installment, then TLR Darkness will definitely be a fun and enjoyable watch! \\n\r\nThanks a bunch for reading and do click helpful if you found it so :)\\n\\n",
            "date": "2014-04-24T19:37:00+00:00",
            "helpful_count": 4,
            "mal_id": 141191,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3397505.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kevstuf",
                "username": "Kevstuf"
            },
            "url": "https://myanimelist.net/reviews.php?id=141191"
        },
        {
            "content": "To LOVE-Ru Darkness is another harem/ecchi anime that is of course, not for everyone. It's a sequel to the previous Motto To Love-Ru and To Love-Ru.\r\n  - Story:\r\n  The plot of this sequel is very expected, like most other anime. The author(s) did not focus on trying to create an extraordinary story, but instead focus more on the art.\r\n  - Art:\r\n  This is why people mainly watch To Love-Ru Darkness and its prequels, the art and of course, the fan services. As I said in the \"Story\" section, the author(s) focused on this category. The art was perceived verywell and extremely detailed. I love it.\\n\\n\r\n  - Sound:\\n\\n\r\n  The sound effects in this anime is pretty well-done. Sometimes there are unnecessary effects, however there are times where the sound effects actually make you enjoy the anime more.\\n\\n\r\n  - Character:\\n\\n\r\n  This category goes with \"Art\", the artist(s) did a nice job with the character design, he successfully think in the boots of the viewers \"What kind of characters would I like to see in an ecchi/harem anime?\". Well done.\\n\\n\r\n  - Enjoyment:\\n\\n\r\n  Yes, I enjoy it a lot. The fan services brought together by the author(s) was at a conceivable level. Nothing too annoying. The humor was extremely good and well-perceived.\\n\\n\r\n  - Overall:\\n\\n\r\n  I would recommend this anime to any ecchi/harem viewer. Although keep it in mind that this anime contains a lot of adult contents and this anime is not for everyone.",
            "date": "2014-07-08T06:42:00+00:00",
            "helpful_count": 4,
            "mal_id": 151033,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/samkhoa",
                "username": "samkhoa"
            },
            "url": "https://myanimelist.net/reviews.php?id=151033"
        },
        {
            "content": "What seem to start off as just a little series that gave people a laugh turned into something new for the series. \r\nFor starters, Rito always seem to be put in situations that aren't entirely his fault and by this point everyone knows what happens. However, this season gives somewhat of a plot and cliffhanger for a new season which will lead further into it. \r\nThe one I didn't like about the series who Tear who was introduced in episode 10. Now don't get me wrong, it's not that shes a bad character in any way, it's just that you only get to see herfor only an episode's worth of time and probably would have been a main character otherwise. Another thing I was annoyed by how intense the fanserive got: this was a show that I came to laugh at because of all the shenanigans that Lala (who in season 3 is a side character!) brought into the show turned into just about borderline porn (at least in the characters heads). \\n\\n\r\nI felt that this season wasn't in touch with what it started with in season 1. Don't even start about how \"season 1 is not based off the manga\" BS because Motto (season 2) is the Exact Same Thing!",
            "date": "2014-08-12T12:58:00+00:00",
            "helpful_count": 4,
            "mal_id": 156315,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=156315"
        }
    ],
    [
        {
            "content": "I love me some big anime tiddies. every now and then to how should i put this use it as a pallet cleanser for when us western weebs get to caught up in the \"artistic merits of japaneese animation\" not to say there's any thing wrong with you know more how should i put this shows that are deeper then to love ru darkness, yes this show is shallow its the lowest common denomnator and yet i cant help but admire its simplicity its cliches its idiotic premises its shameless ness but lets get to what the real important part of this anime is \r\nthegirls there all smoldering hotter than the passion of 1000 white hot suns Yui is my favorite tho",
            "date": "2019-04-27T15:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 307272,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7061267.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kyoualter",
                "username": "kyoualter"
            },
            "url": "https://myanimelist.net/reviews.php?id=307272"
        },
        {
            "content": "While it was better than Motto because of its plot, I must say Darkness still fell far short of the comedic genius of the first season of To LOVE-Ru. In terms of ecchi, it is better than both prior seasons, and most ecchi anime in general. It still has the problems of simply rehashing the same jokes over and over, but this doesn't bother me as much given there is actually a plot to follow. However, therein lies the disappointment. There is no real finale. Not even really a cliffhanger. It gives the feeling of reading a book halfway through and stopping in the middleof a chapter. I understand it follows a manga, but it seems to me that either they should have waited longer so they could make a longer season (like the first season) or at least end at a good stopping point.\\n\\n\r\nHowever, despite my complaints, I did still find it more enjoyable than most anime to watch. I would recommend it to almost anyone, with some discretion considering the genre.",
            "date": "2013-12-06T13:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 122775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2831569.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Hraktuus",
                "username": "Hraktuus"
            },
            "url": "https://myanimelist.net/reviews.php?id=122775"
        },
        {
            "content": "Now let me start off with this to love ru darkness is not everybody's cup of tea it's a ecchi harem anime but even though it is that I enjoyed it and here is my review to let you know why.\r\nThe anime may be a ecchi harem but the story is actually pretty good. It may not be perfect but it was enough to entertain me to continue watching it for me to figure out what this darkness it that it mentions in the title. Well as I watched more I figured out why SPOILERS- The reason why is because of Yami's dark past, andMea's Darkness inside of her heart. Not convinced? Well let me say some more that may convince you to give this anime a try.\\n\\n\r\nThe characters in the anime have a variety of personalities to keep me entertained and to also relate to some of them. Also the girls personalities are so unique that I just can't hate any of them. I love momo because her perverted side makes the show have some funny moments here and there. Also Yami's Kuudere personality makes me curious about her and also like her also because there is a reason why she acts that way that makes me feel bad for her. I'm not joking one of the episodes when she was telling Rito her past made me cry a bit because of all the hard stuff she went to.\\n\\n\r\nBut there are also somethings that I like about it that doesn't involve the story. Mostly the characters like LaLa and Haruna. They don't really show up as much as the others which makes me wonder why? It comes to the point where they are in the middle to me because of how they are not as important as the others in my opinion. But my final  opinion is that I enjoy the anime for what it is a harem ecchi but with a good story to entertain me enough to finish it. I may go as far as to say that I will watch Darkness 2nd. Because I loved it that much. Will I recommend it for a new person to the anime community no. But will I re watch it yes.\\n\\n\r\nHere is my final score on this anime-\\n\\n\r\nStory:8\\n\r\nArt:9\\n\r\nSound:7\\n\r\nCharacter:8\\n\r\nEnjoyment:9\\n\r\nOverall:8",
            "date": "2016-01-03T11:46:00+00:00",
            "helpful_count": 3,
            "mal_id": 207659,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4774105.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/strawberrybubble",
                "username": "strawberrybubble"
            },
            "url": "https://myanimelist.net/reviews.php?id=207659"
        },
        {
            "content": "This anime is very good for those people who just want to watch random events occur to one particular male character that is surrounded by loads of women who have the hots for him. It does tend to focus more on fan service and doesn't focus on the story as much as other anime. If you like things like harems,school life,and a lot of nudity this is the anime for you.\r\nIf you are one of those people who likes anime to have a good,emotional story and likes to get attached to characters then you might not like this anime. I am someone who enjoys agood story and likes to see very good character development but I still love this anime.\\n\\n\r\nThis anime is a great anime to watch if you just want to watch something funny and that does not have a story that gets too dramatic at times. It is an anime that I definitely recommend you guys watch from beginning to end.",
            "date": "2013-10-27T16:53:00+00:00",
            "helpful_count": 3,
            "mal_id": 118519,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3281947.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/TheDumen",
                "username": "TheDumen"
            },
            "url": "https://myanimelist.net/reviews.php?id=118519"
        },
        {
            "content": "the first time i does not feel disappointed with echi anime\r\nof course this anime is recommended for man, there are only rito who take a role as a man character in this season, there no outrageous scene that make you disappointed\r\nstory (9/10)\r\nthe best story if compared with the other season, no stupid thing that rito do that makes the watcher feel irritated, but what make me feel bored is to many shower scene\r\nart(9/10)\r\ngreat background, great character design, rito body look more manly in this season different from the the other season where rito look like pitiful man\r\nenjoyment(8/10)\r\ndoesn't make to curious or bored, normal but enjoyto watch\\n\\n\r\nfeel disappointed with 2nd season? try the 3rd totally worth it\\n\r\nbut i feel disappointed because the main heroin in this season is momo and lala arc just take a little role\\n\r\nreally miss lala sound to say \"ritooo\"",
            "date": "2013-01-02T01:06:00+00:00",
            "helpful_count": 3,
            "mal_id": 82328,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1229325.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/rizkikim",
                "username": "rizkikim"
            },
            "url": "https://myanimelist.net/reviews.php?id=82328"
        },
        {
            "content": "It feels like, compared to To Love-Ru, the OVA, and Motto To Love-Ru, To Love-Ru: Darkness abandoned any sense of shame it had and fully embraced the ecchi scene. I don't think I've ever seen so much ecchi in a series before. There's so much nudity... So much. So, if you hate that kind of thing, this might not be for you. However, personally, I'm not a fan of fanservice either. That being said...\r\nStory: There's actually a pretty good story for To Love-Ru: Darkness. There are two major plots in the works so the series is always interesting.\r\nArt: While To Love-Ru's art was acceptable, ToLove-Ru: Darkness' art has become exceptionally good, even compared to Motto To Love-Ru.\\n\\n\r\nSound: Another change in the OST has definitely improved the music for the series.\\n\\n\r\nCharacter: I think it's a shame that Haruna and Lala have taken a step back from the main heroine roles, but... that's okay. Yami, Momo, and Mea are all great main heroines. Hell, to be honest, Momo's overly perverted ways really grew on me quickly, and I've come to consider her a very loveable character! \\n\\n\r\nEnjoyment: While TLR: Darkness is still very humorous, I think the series took a slight step back from the comedy role in favor of plot. That's a good thing though because it's like this show just gets better and better!",
            "date": "2018-09-21T21:56:00+00:00",
            "helpful_count": 1,
            "mal_id": 289634,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5700136.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Empyreanpain",
                "username": "Empyreanpain"
            },
            "url": "https://myanimelist.net/reviews.php?id=289634"
        },
        {
            "content": "I'm sure many of you think that this anime is nothing but ecchi-filled bullshit. But beware, as this has *no really* a GOOD story packaged in a lot of ecchi/harem nonsense that tends to sometimes go a bit over the top.\r\nTo LOVE-Ru Darkness! An anime following the events of Motto To LOVE-Ru where the main character isn't Rito this time, but Lala's younger sister Momo and/or Golden Darkness. You follow Darkness as they describe more into her background about who she is, and where she comes from. And Momo as she tries to make Rito a legit 'harem' to solve most of his \"Problems.\" \r\nAsfor the characters, well they add a few more characters into the already huge character roster, which is fine, but it get's overwhelming sometimes when I can't even remember someone's name. But with the well executed pacing this anime has, it isn't a huge problem and you get to know most of the new ones quite fast.\\n\\n\r\nI must admit that the opener/closer were both fantastic songs since they would be stuck in my head for hours after hearing them. The voice acting, as usual, is really good too.\\n\\n\r\nSo overall this anime is very good. But not for everyone. If you find a lot, and I mean A LOT of ecchi in an anime to be annoying, then do not watch this, it's as simple as that. But if you don't mind it, while enjoying a good story and moderately good characters, then you should have a great time watching this.",
            "date": "2018-02-16T19:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 271670,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=271670"
        },
        {
            "content": "Story (7/10) - In the first series of To LOVE-Ru we barely see any remnants of a plot. Motto was more about character development than anything else. And now, with the third installment, Darkness, I feel that the beginning of a story that was mostly forgotten, is starting to take shape again. Along with the usual, wacky adventures of this series, of course.\r\nArt (7/10) - Along with Motto, the art in Darkness has improved greatly since the first season.\r\nSound (6/10) - Thankfully, the intro scenes of the first series are in the distant past, the theme was a bit catchy though. The music this timearound was more or less as great as it was in Motto.\\n\\n\r\nCharacter (8/10) - As the second season of To LOVE-Ru was mainly about character development, we continue to still see it in this third installment.\\n\\n\r\nEnjoyment (7/10) - I've enjoyed this series so far more than I thought I would. I'm really interested to see how it'll end. \\n\\n\r\nOverall (7/10) - Even though this series starts out as your typical Ecchi, Harm-type anime, if you can make it this far, I don't think you'll be disappointed.",
            "date": "2017-11-08T08:42:00+00:00",
            "helpful_count": 1,
            "mal_id": 262797,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6331737.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SilentChameleon",
                "username": "SilentChameleon"
            },
            "url": "https://myanimelist.net/reviews.php?id=262797"
        },
        {
            "content": "To LOVE-Ru\r\nIf you feel like you ned to be a pervert and want what your wtching to still have comedy and a decent story long, The first season of To LOVE-Ru is one of those that you have to watch and then never watch again because of the genre it is in. \r\nEcchi... that means all the boobs, fluids and continuous and repeativitive sounds of woman having pleasure because of one virgin that is so thick that even I would of caught on to what these girls (And I was the most dense geek out there) \r\nFirst of, the storyline basicly starts through the first6 episodes and then comes back in the last 6 episodes (oh, it is a 24 episodes series) and the rest of them are full of boob grabbing and crotch face plants and the famous ice cream innuendo. everyone knows what I means with this. However in saying this, I not saying I didn't enjoy the series, I like the character development of Lala and how she grows through the series and there are a lot of funny parts that even don't involve a penis joke.\\n\\n\r\nThe overall art of an ecchi animation was good and *cough* detailed... but lets over look this with the general art was great and full of colours. The sounds, well... lets remove the amount of moaning in the series and that a third of of each epsiode full of dialoge which showed the averge vocie acting throughout. The character were a blast and full of life and laughs, again when you remove the sexual content throughout.\\n\\n\r\nFinal My overall enjoy of this series was as much fun as finding the media playing everytime someone walks into the room and hiding your pitched tent as the monster down stairs has its own mind and hearing the calls of a woman on heat (real or faking). But really it was a god anime and I really did enjoy it.\\n\\n\r\n7/10\\n\r\nDatrium Radium Entertainment Reviews",
            "date": "2016-06-08T02:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 220242,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4727563.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Datrium",
                "username": "Datrium"
            },
            "url": "https://myanimelist.net/reviews.php?id=220242"
        },
        {
            "content": "A good ecchi anime...... welp! Hell's balls have officially dropped. \r\nPremises is interesting to say the least... I've watched the original To-LoveRu series as a favor to a friend who stated \"Its different this time!\" excitedly about this particular show. Quite frankly..... i didn't find To-LoveRu to be that spectacular and don't understand it's initial popularity. \r\nThis sequel however, manages to catch my interest immediately with two factors. \r\nOne, *Gasp* it has a plot.\r\n Two, The art style is freaking beautiful.\r\nThis anime manages to squeeze in a reasonable plot and actually adds drama to a show that i found to be absolutely meaningless and quitefrankly a little bit obnoxious.  The characters have been given depth when originally the only purpose they served was to have a archetype base and serve as a walking fan-service machine. \\n\\n\r\nThe ecchi is still there, but it is less pretentious and obnoxious than it's predecessors. I found them to be well timed and some moments to actually be funny. They do cater to the fans of the original series with situations that only they would understand such as Rito's occasional impressive landings. \\n\\n\r\nI do not recommend this to ecchi haters but if you're interested in the genre this is a good place to begin. You hardly need a introduction to the characters, you can identify their archetypes almost immediately and the plot is solid enough to keep you invested. Overall its a fun little watch.\\n\\n\r\nStory: 7\\n\r\nArt: 9\\n\r\nSound: 8\\n\r\nCharacters: 7\\n\r\nEnjoyment: 8 \\n\r\nOverall: 8",
            "date": "2013-05-01T12:12:00+00:00",
            "helpful_count": 2,
            "mal_id": 95585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2504141.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/swc1098",
                "username": "swc1098"
            },
            "url": "https://myanimelist.net/reviews.php?id=95585"
        },
        {
            "content": "Well heres another anime from my list these 3 days.\r\nI was realy dissapoined in this season man ill just say it this season looks for me like hentai porn i mean in season 1 and 2 it had some perverted scenes like an usual kind of anime for this kind but in this season 3 they went with an idea of if he wants to have every girl that loves him and that they wont be sad he needs to make an harem Momo WTF they didnt need this. I didnt personaly read the manga or an novel if there is but still an haremWTF this story was going realy well and then perverted Momo wanted him to have every girl and her too.Man im so pissed.\\n\\n\r\nThat was the story basicly but im still intrested will the main character say to her after like 12 eps he doesent want that and Lala kicks Momos but out of his bed.I mean they made this that in this season Lala almost didnt show up that much.So i give an 7 to the story.Becouse i hope they fix this bullsh*it.\\n\\n\r\nArt,even if its almost like porn it looks realy good (not the Oppai and private places) the characters look realy good same for the environment.It gets an 9.\\n\\n\r\nSound,an 9 the music is nicly done and the voices are nicly done.\\n\\n\r\nCharacters,an 9 becouse they look  good and sound good but i give it an  9 becouse what they did with Momo hate it.\\n\\n\r\nEnjoyment,an 7 if you want to watch porn without sex then watch this but man i liked the 1 and 2 season becouse there was nothing of that stuff so i wanted to watch this too but i almost dropped it but i was intrested how willl they finish this season.\\n\\n\r\nOverall,an 8 im realy disapointed in this season that harem thing man it got to my heart and i almost broke my phone.Story bah,art is good,sound is good,characters are realy good acept Momo.enjoyed it kinda but i still liked the 1 and second season more.\\n\\n\r\nSorry for the typos and my rage over this review im still pissed a little.Thanks for reading and see ya.",
            "date": "2014-01-26T08:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 130347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3476755.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MrEpicMichael",
                "username": "MrEpicMichael"
            },
            "url": "https://myanimelist.net/reviews.php?id=130347"
        },
        {
            "content": "I finished this and thought: \"OH MAN, THAT WAS GOOD!!!\"\r\nThis anime is a perfect harem and succeeded where the prequel failed in plot development. In short, this may be not just the one of the best anime, but one of the best TV Series of all time. \r\nI like the speed of the plot, and whenever there was filler it was fun fan service where the great 'what if?' scenarios we all dreamed up became reality.\r\nI loved the animation. the animators created some of the most beautiful girls and the most detailed backdrops I have ever seen.\r\nNote to the viewers there is a lot ofEcchi in this show so if you are not comfortable with that then stay away from this show",
            "date": "2017-08-04T13:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 254695,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6373476.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Syndicate909",
                "username": "Syndicate909"
            },
            "url": "https://myanimelist.net/reviews.php?id=254695"
        },
        {
            "content": "Story. While you cant really expect strong plot from harem show, story side is enough to stick together fanservice and ecchi moments. Its hard to call it interesting or intriguing but enough to watch harem show.\r\nArt. Because it's not action-based show, you can't expect to see something innovative from the art point of view. However, characters and background were performed decently.\r\nSound. You should pay attention to opening and ending of this show. While ending is kinda lighthearted, opening has very intriguing sound. \r\nCharacters. If you compare it with previous to Love ru series you can see that focus is shifted toward other characters. These newcharacters are far more interesting than old ones (there are still episodes with them though). This simple trick rejuvenated whole show.\\n\r\nEnjoyment. There are many funny moments and episodes along with character developments. Heavy censorship in TV massacred most of the ecchi moments in anime, so you should wait for BDs if you're into them.\\n\r\nTo summarize up you have decent harem show, that brings something new into the old series. Its quite possible that we can see another season of it.",
            "date": "2013-01-20T23:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 84337,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/78679.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DragonFire",
                "username": "DragonFire"
            },
            "url": "https://myanimelist.net/reviews.php?id=84337"
        },
        {
            "content": "this anime is somewhat confusing for me, the plot little hard to follow\r\ni can't really said is this anime about 'harem plan' or about 'yami'\r\nthe chara are pretty good\r\nand there are a ton of ecchi everywhere so for someone who don't like ecchi better to not watch this",
            "date": "2013-01-01T10:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 82230,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932752.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/EteheralForm",
                "username": "EteheralForm"
            },
            "url": "https://myanimelist.net/reviews.php?id=82230"
        }
    ]
]