[
    [
        {
            "content": "Okay, I don't usually write reviews but this show has personally offended me in a way so I'll just give it a shot.\r\nLuck & Logic is an anime produced to promote a card game made by Bushiroad. Not that you would know that since this anime is not the way to promote anything because it's not interesting in the least.\r\nStory:\r\nThe basic story is very simple in itself. New Foreigner appears, team shows up and beats them up. Rinse and repeat. The first few episode also sprinkle some character focused episodes for our main girls (the Logicalists not the Goddesses but I get to that later)and in the end there is a big bad Foreigner they have to fight but that's it. Once you get what the hell they're saying then it's really easy to follow and the setting itself is pretty interesting. It's how it's presented where the problem lies.\\n\\n\r\nStarting with the fact that the show doesn't explain a damn thing. Having a first episode not explaining every detail is fine, it's to build suspense and make the viewer want to find out more about the show and characters. But throwing around words like Foreigners and Logic Cards around with literally no explanation doesn't create suspense, it just confuses people. Then you get an exposition dump in the second episode after which you are bound to forget some things unless you binge watch the entire show. And the pacing and structure only go downhill from there.\\n\\n\r\nSo to sum up, simple plot, interesting setting that's not set up well and pacing problems. All in all it's not horrible but it's definitely not good. 5 out of 10.\\n\\n\r\nArt:\\n\r\nSurprisingly enough it's not bad. The animation is nothing outstanding, no scenes that will blow you out of the water, but it's decent and nothing to sneeze at. The character designs are nice and pretty for the most part and I particularly like the use of 3D animation. \\n\\n\r\nI know a lot of people get upset when they use 3D models in anime but I personally didn't have anything against it, especially when it's for dancing or fighting sequences. The models are nicely made, fit well into the style of the show and the animation itself has enough energy to work well. Say what you will about 3D animation but animating a model to move in a way that feels like there's some real tension and energy in it is hard and I applaud the team for pulling it off so well.\\n\\n\r\nSure, the fights themselves are not exciting in any way but hey, good animation is good animation and I take what I get. 8 out of 10.\\n\\n\r\nSound:\\n\r\nAgain, surprisingly good. The soundtrack fits the story, for whatever it's worth, well and is good enough to stand on it's own. It's a mix of ochestral and electronic tracks that give the show an epic and futuristic flair even if the show itself is not. I even found myself listening to the ending and opening a lot to get myself pumped up and motivated for tasks. 8 out of 10.\\n\\n\r\nCharacters:\\n\r\nOh, the characters. So much potential which was wasted.\\n\\n\r\nI personally really like the cast. You got Yukine the hardworking leader, Chloe the hotheaded fighter, Mana the quiet mysterious one, Yukari the clumsy newbie, Veronica the strict commander and Olga who is... well, you will find out eventually. They all sound like cookie cutter anime stereotypes and to be fair, they kind of are, but each of them get decent enough development in their own character focused episode that I forgive them for that. They each get their motivations and back story explained and while there isn't really any character development going on it works well enough for a short series that I allow it.\\n\\n\r\nIt all starts to fall apart with our main protagonist Yoshi and how all the other characters relate to him. Or more like revolve around him because that's really all that's happening. Without taking too much away, almost every character focused episode ends with Yoshi swooping in and solving all their problems by doing or saying something inspirational. Which in itself is bad enough but then there's the fact that Yoshi is so boringly bland. \\n\\n\r\nHis motivations don't go beyond \"save everyone\", his personality is written inconsistent and he doesn't really do much besides react to situations the way it requires him to. Take any male protagonist from any slice of life or harem show and you would have yourself a more interesting main character than Yoshi. The first episode sets him up okay as a worrywart who wants nothing more than to protect the people around him even at the cost of his own life but by the next episode he is suddenly acting cold and hostile? Maybe it's change of circumstances but he keeps switching between different personality traits so fast I doubt he was written with a clear character in mind.\\n\\n\r\nAnd the Godesses I said I would get into? God, what's there to get into when they are side lined so hard you wonder if they are even still on the team. Valkyrie probably gets the worst of it, being introduced as Chloe's calm and rational partner to balance out her spunky recklessness and never being allowed to develop beyond that. Venus and Artemis are not much better, one acting as a supporting friend and the other as a mother figure to their partners Yukine and Mana but never allowed to have their own arcs or feelings explored. \\n\\n\r\nThe only one who gets to develop at all is Athena and even she gets the short end of the stick. She gets a decent amount of screen time and actually gets to interact with others without her partner but she is still only defined by her kind heart and love for Yoshi. Which is not bad if Yoshi was a good character and their relationship was actually explored but as you can guess it's not. \\n\\n\r\nThe high point of the characters is really Olga Breakchild who is by far my favorite character. Without spoiling, he's the only one who doesn't seem to worship the floor Yoshi walks on and actually stands up to him from time to time and it's wonderful. His arc, in contrast to the others, actually gets a set up and decent pay off which doesn't save the show in the character department but at least helps it a bit.\\n\\n\r\nSide characters are given one note personality traits but I found them alright, especially Yoshi's family which were entertaining enough in their own right to actually make me interested in them. \\n\\n\r\nAll in all, nice supporting cast, sidelining of supposed main characters, Olga Breakchild and an incredibly bland main protagonist. 4 out of 10.\\n\\n\r\nEnjoyment:\\n\r\nSeeing as I had harped on forever about how I dislike the story and the characters, I think it comes to little surprise that I didn't particularly enjoy this anime. And it wasn't for the sake of not trying either, I came into this show not expecting anything amazing but at least something that I could watch in a season where not much interested me but I didn't even get that. \\n\\n\r\nThe setting was interesting enough but the way it was written and presented just made it feel dragged out and sluggish. Hell, even the action felt uneccessarily strechted out to the point where it felt boring. How the hell do you make action boring? Luck & Logic managed it somehow and made every episode feel longer than it actually was. Really makes you wonder how a show can be so boring it seems to warp space-time itself. \\n\\n\r\nBesides Olga and some interesting character interactions I really didn't get much enjoyment out of this. And my burning hatred of Yoshi but that's just me. 3 out of 10.\\n\\n\r\nOverall:\\n\r\nIf you actually managed to read everything to this point I congratulate you. I know I get get pretty long winded about stuff like this and anyone who manages to read through anything I write is a hero in my eyes.\\n\\n\r\nNow, after 15+ paragraphs of me talking about this show, what do I think about it overall? Surprisingly enough, I don't find it horrible? Like, yeah, the story is weak and the characters, mainly Yoshi, are even weaker but overall it's pretty harmless. The music and art are nice and even if the episodes make you feel like your brain's leaking out it's not bad to just sit back and shut off your thoughts for a while and just let a show wash over you.\\n\\n\r\nThe main reason why I was so personally offended by the show was probably because I'm a huge fan of Bushiroad, especially their card games. And I know they can make good card game animes! Okay, as far as I can see, they have one good card game anime but that one is pretty darn good. And seeing them make such a bland show just kind of hurts my heart. I don't know how much say they have on the writing and characters but I like to believe they could have done better.\\n\\n\r\nThat's not to say that it's a good show. It's still boring and superficial at best. Even considering that this was just made to promote the card game it leaves a lot to be desired and doesn't even explain the card game aspect of it. At best it's a standard show with an interesting setting at worst it's a boring show that doesn't try to step out of it's bounds. 4 out of 10.",
            "date": "2016-05-16T09:26:00+00:00",
            "helpful_count": 73,
            "mal_id": 218697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/shadowmellow",
                "username": "shadowmellow"
            },
            "url": "https://myanimelist.net/reviews.php?id=218697"
        },
        {
            "content": "Luck and logic to me, is one of those series that knows what it wants to be, in that it is not supposed to be all that groundbreaking in any sense. Its a nice small show that is heavily cliched, with entertaining action and extremely easy to follow plot/story...\r\nSPEAKING OF...!\r\nStory (7)\r\nThere's not much to go on about here. Good guys defend the city from bad guys that come through these gates from hell or something like that, sprinkle all of this with personal dramatic character plots (each character gets an episode) and top it off with the biggest bad they have to fight at theend. Like i said, easy to grasp.\\n\\n\r\nArt(6)\\n\r\nThe art in general is standard fair, though there is quite a heavy use of 3D for the action scenes of which some might find jarring, it is kind of strange seeing the characters so still in 2D and then very kind rubbery ragdoll movement with 3D. \\n\r\nThere are some 2D scenes where you can see that the animators screwed up, like one scene at the end of episode 3 i think, it looked like the game was having server issues, but then i realized that this wasn't a game, it was an anime. \\n\r\nThe character designs were nice, all of the transformations were pretty neat which nicely fitted each of there personalities.\\n\r\nSome of the action scenes can seem rather lazy though, with the typical \"character performs attack shot\" and then switches to \"character getting hit shot\".\\n\\n\r\nSound(8)\\n\r\nPersonally, I quite like the BGM, I might even hunt it down somewhere soon. Its mostly the action scene BGM I like with its sci-fi orchestralish sound. I really like the OP too, it kept me from skipping it every episode, The ED however is not to my taste.\\n\\n\r\nCharacter(6)\\n\r\nThe characters are not very interesting, they are very cliched and i will list the main team of them here.\\n\r\nYoshichika tsurugi - The main character of the series and... well... thats it... he IS a main character. uses a shield as his weapon (tank).\\n\r\nTamaki Yurine - The intelligent leader type girl, uses a controlled ribbon thing and a wand as a weapon and also heals (healer)\\n\r\nChloe Maxwell - The energetic arrogant girl, uses a flaming broadsword and often charges into battle without second thought (DPS)\\n\r\nMana Asuha - The quiet mysterious girl with a troubled past, uses guns, mainly a sniper, and also sneaks around by turning invisible n stealthy n stuff. (support/ranger)\\n\r\nThe characters are all teamed up with goddesses that combine with them to transform, but these goddesses are the most disappointing characters in this series since there nearly completely shoved aside and we learn next to nothing about them. I'd say i wouldn't even notice if they were removed from the series altogether.\\n\\n\r\nEnjoyment(8)\\n\r\nFor what it is, I really enjoyed this series, it was something i could sit down and watch without getting so invested that it would consume my life. Its a cliched \"save the world show\" and it knows well. As a finished series, i would recommend this to anyone who's got nothing else to do and just wants a quick anime fix rather than re-watching a presumably better series.",
            "date": "2016-03-28T03:08:00+00:00",
            "helpful_count": 27,
            "mal_id": 214506,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4689516.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/StevyleSteve",
                "username": "StevyleSteve"
            },
            "url": "https://myanimelist.net/reviews.php?id=214506"
        },
        {
            "content": "Watching this anime felt like eating a double quarter pounder with soy sauce at sunnybank. It made me feel like i was watching darren eat hotpot while i was labouring outside in the hot sun.\r\nOverall the story is not bad but the situations are really forced. I was actually interested in the plot but it was so badly executed. It was a pretty nasty anime to watch. Sound is decent. Characters were cliche. I enjoyed it because i love to waste my time.\r\n10/10 would rewatch.\r\nNot the worst anime i watched.\r\nI would say this is a timekiller. I would not recommend this to anyone and youshouldn't watch it unless you are super bored",
            "date": "2016-05-23T03:25:00+00:00",
            "helpful_count": 19,
            "mal_id": 219157,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5426796.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/JustinChiu",
                "username": "JustinChiu"
            },
            "url": "https://myanimelist.net/reviews.php?id=219157"
        },
        {
            "content": "It guess it's \"logical\" I had no \"luck\" with Luck & Logic (off to a good start).\r\nWhile the story, or I should say the concept, isn't that bad. It's more about how it's presented. We're told about the relationships between humans and gods, but we get nothing out of that aside from what we see with our characters. I would've liked to see more of it, but that never happened. Also, for a series that's supposed to be about fighting monsters, a good portion of the series doesn't have it, and instead show our characters doing clichéd things we'd see in a slice-of-life story.\r\nCharacters areabout as bland as they can get. They have their one characteristic and stick with that until the very end. Our main protagonist doesn't really feel like one. He apparently has some past, which was only ever brought up in the first episode. It could've been nice to maybe see what that was like. Although our characters are with each other all the time, there's honestly no chemistry with any.\\n\\n\r\nThere isn't much to say about the animation besides it's average. Action sequences use CG models for the characters, which didn't stand out and blended with everything else. The only thing I sort of liked was the characters' \"battle outfits\".\\n\\n\r\nI would not recommend this series to anyone. This is one of those shows that did nothing for me, and got nothing out of it. Characters are bland and unforgettable, and the universe isn't fleshed out enough for me to care about the laws of it. I could end with another pun, but I;m having a \"card\" time doing so (because there's a card game based on this, you see).",
            "date": "2016-03-26T20:00:00+00:00",
            "helpful_count": 15,
            "mal_id": 214286,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AllenHavens92",
                "username": "AllenHavens92"
            },
            "url": "https://myanimelist.net/reviews.php?id=214286"
        },
        {
            "content": "This will be less of a review & more of a warning why you shouldn't waste your time watching this anime.\r\nStory: \r\nThe story is heavily cliched but not all that bad, the real problem is the execution. Even as the anime proceeds it doesn't explain one fucking thing about the trance, logic cards, etc etc and leaves a lot of unanswered question.\r\nArt & Animation:\r\nIt is good but fairly generic. I don't really like it but I don't have any complaints with it either.\r\nSound:\r\nThe soundtracks are fair, nothing that great or anything that would stick out but they fulfil their purpose.\r\nCharacter:\r\nThe characters are just perfect,,,, perfect1D characters. Just like everything in this anime they are the same cliched generic characters which you can see everywhere.\\n\\n\r\nEnjoyment & Overall:\\n\r\nThe anime is fairly enjoyably but its just fucking dumb. Its ok for a casual watch but there are far better anime out there so you don't need to bother yourself with this one.",
            "date": "2017-03-19T06:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 242955,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5919300.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/S_Class_weeb",
                "username": "S_Class_weeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=242955"
        },
        {
            "content": "*This contains a small spoiler, but that has been marked clearly*\r\nInternal logic and believable characters are two of the most important factors for me in any show. It doesn't matter how outlandish or surreal the setting and events might be, as long as the show attempts to provide some reason for these actions, I stay happy. This show attempts nothing of the kind. While some of these gaffes are understandable considering that they are limitations of the show being based on a TCG (trading card game), the vast majority are intolerable. I'll list my personal opinions of the show in order of what I likedmost:\\n\\n\r\nSound: 8/10\\n\r\nThe sound quality of this anime is actually quite good. The opening and ending sequences have great tracks that mesh fairly well with the story. I have no complaints about the OST either.\\n\\n\r\nArt: 7/10\\n\r\nThe animation is of decent quality, uses a bright palette, and has a moderate use of CG. There's nothing amazing or new about the art, but then again, there was never really a moment when I could complain.\\n\\n\r\nStory: 3/10\\n\r\nThis is definitely not an anime you want to watch for the plot. It's mostly structured like a harem anime, with an overperforming male MC surrounded by pretty little things that lather him with attention. There is no overall plot for the story; each episode is based around backstories and character development. While this could have been an interesting approach, it fails because of the horrible quality of said character development.\\n\\n\r\nThere are also several elements in the story that make no sense or are never explained properly. For example, they often mention that the bond made during a covenant is permanent, and yet they show us that both Chloe and Tamaki were bonded to different covenanters in the past. What happened to them? Also, even though the ALCA organisation has been fighting invasions for a long time before Yoshi joined this branch, why is there only one Foreigner (Enlil) in the vault from before Yoshi entered the story? In addition, what is the difference between killing and capturing the foreigners? Both actions seem to involve dealing heavy amounts of damage to them. For some reason, slicing them in half using a giant fire sword or blasting holes in them with a magical shotgun separates them from their trancejacked host, but attacking them with a whip kills the foreigner.\\n\\n\r\n<minor spoilers> \\n\r\nIn the Veronica episode, the Ice Belva that they're fighting against never trancejacked anyone, so how is it able to manifest its powers?\\n\r\nEvery time a foreigner trancejacks a human, they are suddenly visible on the radar for ALCA to see. So why does Lucifer remian invisible even though he keeps trancejacking humans left, right and center?\\n\r\n</minor spoilers>\\n\\n\r\nCharacters: 2/10\\n\r\nWhen you have an anime that is so focused on the character development, you are really hit hard when you realize the complete lack of attention placed on their personalities. To show my point, I'll need to go a little into depth for each character while avoiding spoilers:\\n\\n\r\n1. Yoshichika: The main character, he is another mostly faceless MC that's meant for the audience to relate to. However, his personality is clearly undefined. At times he's extremely self-centered - he stays up all night watching videos of himself fighting monsters, he believes he's too famous to go to school, he ignores introductions with the other girls because he's just too tired. At other times, he's a super-kind goody-two-shoes - he's always quick to apologise when someone criticises him, he believes the foreigners shouldn't be killed. But in situations where a team member is asked to kill a foreigner, he has no complaints.\\n\\n\r\n2. Athena: The female lead and Yoshichika's covenanter, she's also the only goddess who gets any real screen time. Even though she has never met Yoshichika, she has somehow decided he is her soulmate. Apart from her odd love for Yoshichika and weird trust in Lucifer, there is no other defining aspect of her personality.\\n\\n\r\n3. Chloe: The stereotypically \"American\" girl - loud, stubborn, strong, blonde, and very confrontational. Teamed up with Valkyrie, she forms the main attack force of the group. In the beginning she's portrayed as the dumbest of the group, and even fails a quiz of basic questions on the topic of their world. And yet later in the series, she's suddenly a brilliant detective with the deductive powers and resourcefulness of a CSI Miami cop. Additionally, she's always working out and worried about her diet, and yet when asked to cook she makes burgers and mystery junk food. And for some reason, in a show full of Japanese characters, the one American character is the one with the horrible English naming sense.\\n\\n\r\n4. Tamaki: The former leader of the group. She's supposed to be the perfectionist and overachiever, who feels threatened by the perfect MC. At the beginning she berates Yoshi for not immediately attacking a weak monster, but later she suffers from moral dilemmas when she's asked to kill one herself. Paired with Venus, she's normally only good for healing and support. However once she activates her logic drive, her whip suddenly becomes an overpowered one-hit-kill weapon, which makes no sense.\\n\\n\r\n5. Mana: The emo, silent, depressed girl - it is difficult to complain about her without spoiling her backstory. All I'll say is that her backstory makes no sense. Also, her resolution of her problems is one of the most contrived battles I've ever seen. \\n\\n\r\n6. Olga: Literally the only character in the entire show I even liked, and even that was completely destroyed by the convoluted character development in the final arc. For most of the show, he is the only voice of reason - always able to identify flaws in the other characters and point them in the right direction. In addition, his cocksure showy attitude is always shown as hiding his insecurities and failing confidence. He was a truly relatable character; so when all his convictions break down so drastically at the end, I was horrified.\\n\\n\r\nThe rest of the characters are all just minor side characters, barely getting any attention or screen time. Artemis, Valkyrie and Venus are pretty much completely ignored aside from their scant interactions with their partners. Veronica and Nemesis are characters I can't understand - they seem to have the greatest firepower among the group, and yet they almost always avoid taking part in battles. I'm not even sure what Yukari's point in the story is.\\n\\n\\n\\n\r\nFinally, one of the worst examples of naming sense I've seen in anime - ALCA, the Another Logic Counter Agency. Which makes me wonder, what happened to the first Logic Counter Agency?\\n\\n\r\nI didn't expect much coming into this anime, and yet it still managed to disappoint. The animation and sound were the only saving grace.",
            "date": "2016-08-10T17:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 226429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5597848.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GimmeDatDonut",
                "username": "GimmeDatDonut"
            },
            "url": "https://myanimelist.net/reviews.php?id=226429"
        },
        {
            "content": "This is an anime used to advertise a card game, or so I hear. As an ad for a card game, I feel like this anime falls flat. As a piece of entertainment, I say it was good. Yes, there were some parts where I was tempted to drop the anime, but Luck & Logic is not as bad as people like to say it is. It's still sub-par, but its not that below the average.\r\nIt was hard for me to get interested in the story. It essentially uses the \"retired badass comes out of retirement\" plot. It appears our protagonist mentally crippled himself ina past exploit that we will never hear about ever again. Don't get me wrong, I'm all for this retired badass story. It just feels like a let down. Potential gone.\\n\\n\r\nStory: 4/10\\n\\n\r\nArt wise, I'm no experienced critic in this aspect, so as long as it doesn't look like what OreTwi's TV animation looked like, then I'm generally lenient (don't get me wrong OreTwi is great in my opinion, but the animation was bad before they corrected it). \\n\\n\r\nHolographic bits an pieces looked cool, but some fight sequences looked a bit different from the normal animation. This threw me off a few times, especially in the later half of the anime.\\n\\n\r\nArt: 6/10\\n\\n\r\nSound. No expert on this either, but I thought it was great. The soundtrack is composed by Tatsuya Kato (I believe he did Shokugeki no Souma too). From experience, his work is usually something worth listening to. I liked it.\\n\\n\r\nSound: 8/10\\n\\n\r\nFor the characters, Yoshichika (MC), I feel is an exaggeration of the \"cookie cutter\" main character. Retired badass, check. Mysterious girl shows up offering a contract, check. Goes into first battle and begins to take command, check. Quick to jump to conclusions, check. I love his hair though.\\n\\n\r\nOlga is another character I find memorable enough to mention. He starts off looking like this sinister anti-villain/villain type character that everyone avoids mentioning. MC decides to pry then it is revealed that Olga just has a severe case of chuunibyou. The only thing he seems to be good for is his predictions, which are nearly always accurate. What I like him for is that he gets serves as the straight man to our crazy cast at times. Also, he gets massive development during the last arc. Good character in an average anime.\\n\\n\r\nOther characters are, like the MC, very \"cookie cutter\" style. Mysterious veteran squad leader. Formal, power by merit girl who gets shown up by MC in second episode. The \"Don't worry, Bros I got this\" character. Silent sniper. Immortal immaturity. The cute and cuddly girl. Other than MC and Olga, the characters seem to be very common fare, aside from the MC's family(fairly minor characters generally used for comedy).\\n\\n\r\nCharacters: 6/10 (because Olga carried this category)\\n\\n\r\nOverall, this anime is a fairly good. Your millage may vary though, due to the abusurd amount of stock/static characters, and fluctuation of plot. There is a harem anime joke in the middle of the anime that really caught my attention though. I like those types of jokes quite a bit, sadly that's the most memorable part of the third quarter of Luck & Logic.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\nMy thoughts. Again. It's not as bad as an anime could be. Scarred Rider Zechs was worse (Just the name of a random anime I dropped). Luck & Logic isn't unwatchable, per se. However, I've mentioned before that there are arcs that make you feel like you want to drop it. It was likeable.\\n\\n\r\nOVERALL: 7/10",
            "date": "2017-01-24T01:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 239001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5780048.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KiramekiSparkle",
                "username": "KiramekiSparkle"
            },
            "url": "https://myanimelist.net/reviews.php?id=239001"
        },
        {
            "content": "Good background noise if you really need it but lord does this Anime have that annoying \"Every conflict could be taken out by talking\" thing. \r\nThe premise is interesting enough if you look at the show like something like Bakugon (Who remembers that? I probably spelled it wrong but I don't have the energy to check), Yugioh or any other overarching merch show. BUT. The characters, my god the characters. They managed to explain things like the Lore\" of everything like Logic and such without being annoying but when it comes to the characters the anime just is downright irritating. \r\nI'll try not to spoilanything but everyone has a problem with not talking about things until later for exposition dumps. It might just be me but I hate when people hide stuff from others on a freaking team. Stop leaving someone to keep looking like an idiot when they try and find things out. \\n\\n\r\nAlso, don't do the \"killing these new creatures is wrong\" thing without showing a good side of the new creatures. Or at least make it clear that that idealistic person is a total nutjob. God, I like Chloe the best since she's over everyone's melodramatic crap. It's too early for all of this!",
            "date": "2018-01-01T16:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 267131,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820573.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PeachyOni",
                "username": "PeachyOni"
            },
            "url": "https://myanimelist.net/reviews.php?id=267131"
        },
        {
            "content": "(Spoiler-free) (Shorter ver. far down below)\r\nThis anime is boring. It's average. It's an anime that could be easily forgotten. It's cliched. It's nothing original. Watch this if you want to watch an anime while thinking of what anime to watch for the next few weeks. Even for me who doesn't mind cliche anime I still find it pretty boring. \r\nThe story is boring. I don't even think that this even have a story. Compared to HinaLogi, which is technically a sequel/alternate universe of this anime, it did a better job at SoL than this show here. Most importantly, the last arc is boring. It's whatyou can see from a lot of action/harem/shounen anime. Nothing is changed and nothing is added. So if you are thinking that this anime might be a character-driven show with interesting characters, read my next point.\\n\\n\r\nThe characters in this show is generic and bland. Although their backstories were told to us, but that still didn't change the fact that this is a carbon copy of the characters in other anime similar to this. Most importantly, the main character is boring as hell. His backstory is nothing original. Plus his screentime is so few compared to other female characters. \\n\\n\r\nThe BGM is non-existant. It doesn't stand out even in action scenes. The OP theme and sequence is pretty well done and I will give props to it. The ED theme is meh. The voice acting is sub-par. \\n\\n\r\nArt and animation is the only thing I can praise this anime for. It's beautiful, colorful and eye-catching. The character designs, although nothing original, are still pretty well drawn. However, the CG animation during battle scenes is only decently done. The action sequence is still pretty boring.\\n\\n\r\nMy enjoyment = 5. I watched this because I need to think of some anime to watch while watching an anime. So I picked this one to watch because of the art and animation and also the OP sequence. \\n\\n\r\nOverall, not recommended.\\n\\n\r\nPros:\\n\r\n1. Beautiful art\\n\r\n2. Good animation\\n\r\n3. OP sequence and theme suit the series well\\n\\n\r\nCons:\\n\r\n1. Boring\\n\r\n2. Too Cliche\\n\r\n3. Too serious",
            "date": "2017-09-21T07:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 258223,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=258223"
        },
        {
            "content": "LA doesn't even know if this show follows it's own logic!.\r\nThe anime follows a routine \"monster or Foreigner of the Week\" as Yoshichika warms up to the group of Girls and Goddess helping them although you can also say that Yoshichika pretty much solves the other cast members backstory or problems and he does for the most part, it's actually more of a Saturday Morning cartoon on how they deal with all this, talking about friendship to not outright killing the Foreigners instead taking them into captivity once the their episode is done and over with.\r\nWith this \"logic\", you can tell LA's favorite character isn'tYoshichika...he's kinda the \"omnipotent fixerupper\" and that kinda gets annoying at times, no LA's favourite character would have to have been the pair Tamaki Yurine voiced by ''Risa Taneda'' and Venus voiced by ''Nao Touyama'' as the anime developed her accidentally more than Yoshichika. \\n\\n\r\nThe anime really doesn't change it's format of \"Foreigner of the Week\" until episode 8 where the \"Big Bad\" appears and he outs to be a sympathetic villain in which LA actually agrees with to a certain point.\\n\\n\r\nThe plot twists are kinda predictable concerning what we're dealing with here but still the plot twists actually make this series better by the long run (as in by Episode 8). \\n\\n\r\nIn terms of animation by Doga Kobo, the character designs are decent enough and although there are 3D CGI when battle scenes occurs, it's consistent unlike another anime video game adaptation this season like ''Divine Gate''. \\n\\n\r\nLuck & Logic does bring up some plot holes to some of the plotlines at times concerning the characters and their motivations at times like with Yoshichika and Tamaki's argument as why would ALCA demote Tamaki who was team leader to put a newbie like Yoshichika as leader other than trying to bring up Tamaki's backstory?...like that doesn't make any sense.\\n\\n\r\nOnce episode 8 occurs, the subtle hints at the Big Bad comes and actually brings us an actual threat to care about the Big Bad's plan at hand and becomes rather more intriguing to watch. You just first need to slog through the \"Foreigner of the Week\" episodes just to get to it. \\n\\n\r\nThe ending did wrap everything from this season and although it was a bit of anti-climax, but nonetheless it was ok, but not \"great\", it was actually more cliched on it's execution.\\n\\n\r\n Luck & Logic has some logical errors concerning the plot and characters at times, however it's not outright horrible, LA sees it as charming how they are at least concerning the characters to a degree and what the main cast Logicalists are actually doing is influencing the plot and what with a sympathetic villain makes this anime adaptation of a trading card game actually competent even if it has the generic \"main protagonist fixes everything\". \\n\\n\r\nLuck & Logic...you got a few screws loose, but thankfully you get those screws back by the end of and not completely succumbed to the video game adaptation curse.",
            "date": "2016-03-26T14:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 214250,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=214250"
        },
        {
            "content": "Warning possible Spoilers\r\nMy time watching anime's has certainly made me find some really amazing ones, but there is that point where I do find some really bad or Godawful ones and this is definitely one of them.\r\nThe story is set on the human world of Septpia and they are being invaded by creatures called Majin's so a boy named Yoshichika Tsurugi and his other Logicalist teammates along with their Goddesses are sent in to handle and stop the threat.\r\nNow I've seen these type of stories quite a few times and every time they get less and less enjoyable, this was just a great big boreto get through the only interesting thing I got from this show was how their suits worked which was by using a Goddess from the world the Majin's are from with a logic card and combing them with a human that to me sounded pretty interesting, but the rest of the show was just awful I couldn't get excited at all and I mainly either groaned or shouted when something predictable or cliched happened and you know an anime is bad when it calls out it's own cliches.\\n\r\nIt gladly only 12 episodes, but for 12 episodes it certainly dragged on however despite being a bore fest there were some or one element that kept me going well just about.\\n\\n\r\nThe characters are possibly the only reason I didn't quit the show because they were at least half-decent well most of them.\\n\r\nThe main character Yoshichika is not really a great example of a character and I even watched this in dub and it was surprising to see that he was voiced by Nathan Sharp AKA Natewantstobattle now Nathan's acting wasn't the problem it was Yoshi himself, he was a very bland person and didn't even try to set himself apart from many harem protagonists that I have seen before and funny enough this isn't even a harem so how did the show mess this up.\\n\r\nThen there are the 3 main human female characters Chloe, Mana and Tamaki, now each of these girls had their quirk Chloe was actually pretty likeable from her upbeat and active personality, even Mana was likeable too since she was shy and had a bit of a dark backstory, then there is Tamaki she annoyed the hell out of me I just wanted her to shut up whenever she got into an argument with someone luckily that didn't last the whole series and she was pretty much settled down by the final episodes. \\n\r\nThe Godesse's are actually pretty bland since you don't really get to see them do much other than powering the suits the other's have to use and the names of the Godesse's are Atena, Venus, Valkyrie, Altemis and Nemesis there was really nothing to make these characters stand out apart from their appearances and their slight personality differences so they didn't really do much for me.\\n\r\nThere is some other supporting characters too like Yukari who felt like the lovable mascot of the team who gets everyone back on their feet and there is also Chief Veronica who is pretty much like every other female chief I have seen in these type of anime's.\\n\r\nFinally there is the villains who are Olga Breakchild who is pretty much a douchebag longing to become a proper Logicalist who of course gets the evil bad guy Lucifer as his Logicalist and both of these guys didn't feel menacing they just felt like an irritation really.\\n\\n\r\nNow the artstyle was poor I didn't like the combination of 2D and 3D when there were battle sequences it just didn't fit and the same can be said for the monsters too they just looked awful and some of them looked like they belonged in Pokemon which felt very weird and wrong.\\n\\n\r\nThe action was poor and didn't last very long which to be honest is a good thing since the suits abilities didn't feel incredible compared to many other anime's I've seen that use special powers or magic whichever you class this as plus the suit's themselves didn't look that great either, what also really caught me off guard and actually annoyed me in some way was the surprising amount of fanservice in the anime and it made me think why there wasn't an Ecchi tag hell there was a scene with Tamaki and Atena who are fully nude and they even show Tamaki's bare nips now I like my fanservice, but this just felt wrong and uncomfortable, I could also say the same for the transformations it was like the animators wanted to woo the Yuri and Yaoi fans with the way those transformations went.\\n\\n\r\nOverall this was a poor anime and I wouldn't recommend it unless you are that much of a fan of cute girls in mecha like suits then be my guest, but for those casual viewers avoid this.",
            "date": "2017-07-02T08:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 251748,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=251748"
        },
        {
            "content": "So even in anime, adaptations of games can be bad.\r\nI had no interest in this show, the only reason I watched this show was because of Nathan Sharp (yes I'm a fan of him) and overall I was left not just disappointed but angry that Nathan did this because he is a better musician than he is a voice actor.\r\nthe story is boring it feels generic and half way through with some of the characters it starts to feel like a Infinite Stratos rip off and a bad one at that. (in my opinion Ill admit I'm probably wrong just saying that)\r\nthe characters aren't engagingat all apart form Jad Saxtons character (Jad just has the ability to do well even in something as bad as this apart form Sena in Haganai), Nathan's character is bland, monotone and has one of the worst outfits I've ever seen in an anime (when he's fighting)\\n\\n\r\nthe soundtrack is forgettable I mean I barely remember it and I watched the show a month ago and the unnecessary fan service in episode 7 was enouth for me to give up watching the show but I continued (all be it while I was drunk).\\n\\n\r\nin the end the show sets up for a season 2 which I hope doesn't happen because everyone in this is capable of better and please if your a Nate Wants To Battle fan don't hate me for saying that he is better than this monotone performance in this garbage.\\n\\n\r\nWatch it if you want but don't say didn't warn you and if you enjoy it then all power to you.",
            "date": "2017-06-25T10:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 251005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6260136.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AntMan95",
                "username": "AntMan95"
            },
            "url": "https://myanimelist.net/reviews.php?id=251005"
        }
    ],
    [
        {
            "content": "Okay, I don't usually write reviews but this show has personally offended me in a way so I'll just give it a shot.\r\nLuck & Logic is an anime produced to promote a card game made by Bushiroad. Not that you would know that since this anime is not the way to promote anything because it's not interesting in the least.\r\nStory:\r\nThe basic story is very simple in itself. New Foreigner appears, team shows up and beats them up. Rinse and repeat. The first few episode also sprinkle some character focused episodes for our main girls (the Logicalists not the Goddesses but I get to that later)and in the end there is a big bad Foreigner they have to fight but that's it. Once you get what the hell they're saying then it's really easy to follow and the setting itself is pretty interesting. It's how it's presented where the problem lies.\\n\\n\r\nStarting with the fact that the show doesn't explain a damn thing. Having a first episode not explaining every detail is fine, it's to build suspense and make the viewer want to find out more about the show and characters. But throwing around words like Foreigners and Logic Cards around with literally no explanation doesn't create suspense, it just confuses people. Then you get an exposition dump in the second episode after which you are bound to forget some things unless you binge watch the entire show. And the pacing and structure only go downhill from there.\\n\\n\r\nSo to sum up, simple plot, interesting setting that's not set up well and pacing problems. All in all it's not horrible but it's definitely not good. 5 out of 10.\\n\\n\r\nArt:\\n\r\nSurprisingly enough it's not bad. The animation is nothing outstanding, no scenes that will blow you out of the water, but it's decent and nothing to sneeze at. The character designs are nice and pretty for the most part and I particularly like the use of 3D animation. \\n\\n\r\nI know a lot of people get upset when they use 3D models in anime but I personally didn't have anything against it, especially when it's for dancing or fighting sequences. The models are nicely made, fit well into the style of the show and the animation itself has enough energy to work well. Say what you will about 3D animation but animating a model to move in a way that feels like there's some real tension and energy in it is hard and I applaud the team for pulling it off so well.\\n\\n\r\nSure, the fights themselves are not exciting in any way but hey, good animation is good animation and I take what I get. 8 out of 10.\\n\\n\r\nSound:\\n\r\nAgain, surprisingly good. The soundtrack fits the story, for whatever it's worth, well and is good enough to stand on it's own. It's a mix of ochestral and electronic tracks that give the show an epic and futuristic flair even if the show itself is not. I even found myself listening to the ending and opening a lot to get myself pumped up and motivated for tasks. 8 out of 10.\\n\\n\r\nCharacters:\\n\r\nOh, the characters. So much potential which was wasted.\\n\\n\r\nI personally really like the cast. You got Yukine the hardworking leader, Chloe the hotheaded fighter, Mana the quiet mysterious one, Yukari the clumsy newbie, Veronica the strict commander and Olga who is... well, you will find out eventually. They all sound like cookie cutter anime stereotypes and to be fair, they kind of are, but each of them get decent enough development in their own character focused episode that I forgive them for that. They each get their motivations and back story explained and while there isn't really any character development going on it works well enough for a short series that I allow it.\\n\\n\r\nIt all starts to fall apart with our main protagonist Yoshi and how all the other characters relate to him. Or more like revolve around him because that's really all that's happening. Without taking too much away, almost every character focused episode ends with Yoshi swooping in and solving all their problems by doing or saying something inspirational. Which in itself is bad enough but then there's the fact that Yoshi is so boringly bland. \\n\\n\r\nHis motivations don't go beyond \"save everyone\", his personality is written inconsistent and he doesn't really do much besides react to situations the way it requires him to. Take any male protagonist from any slice of life or harem show and you would have yourself a more interesting main character than Yoshi. The first episode sets him up okay as a worrywart who wants nothing more than to protect the people around him even at the cost of his own life but by the next episode he is suddenly acting cold and hostile? Maybe it's change of circumstances but he keeps switching between different personality traits so fast I doubt he was written with a clear character in mind.\\n\\n\r\nAnd the Godesses I said I would get into? God, what's there to get into when they are side lined so hard you wonder if they are even still on the team. Valkyrie probably gets the worst of it, being introduced as Chloe's calm and rational partner to balance out her spunky recklessness and never being allowed to develop beyond that. Venus and Artemis are not much better, one acting as a supporting friend and the other as a mother figure to their partners Yukine and Mana but never allowed to have their own arcs or feelings explored. \\n\\n\r\nThe only one who gets to develop at all is Athena and even she gets the short end of the stick. She gets a decent amount of screen time and actually gets to interact with others without her partner but she is still only defined by her kind heart and love for Yoshi. Which is not bad if Yoshi was a good character and their relationship was actually explored but as you can guess it's not. \\n\\n\r\nThe high point of the characters is really Olga Breakchild who is by far my favorite character. Without spoiling, he's the only one who doesn't seem to worship the floor Yoshi walks on and actually stands up to him from time to time and it's wonderful. His arc, in contrast to the others, actually gets a set up and decent pay off which doesn't save the show in the character department but at least helps it a bit.\\n\\n\r\nSide characters are given one note personality traits but I found them alright, especially Yoshi's family which were entertaining enough in their own right to actually make me interested in them. \\n\\n\r\nAll in all, nice supporting cast, sidelining of supposed main characters, Olga Breakchild and an incredibly bland main protagonist. 4 out of 10.\\n\\n\r\nEnjoyment:\\n\r\nSeeing as I had harped on forever about how I dislike the story and the characters, I think it comes to little surprise that I didn't particularly enjoy this anime. And it wasn't for the sake of not trying either, I came into this show not expecting anything amazing but at least something that I could watch in a season where not much interested me but I didn't even get that. \\n\\n\r\nThe setting was interesting enough but the way it was written and presented just made it feel dragged out and sluggish. Hell, even the action felt uneccessarily strechted out to the point where it felt boring. How the hell do you make action boring? Luck & Logic managed it somehow and made every episode feel longer than it actually was. Really makes you wonder how a show can be so boring it seems to warp space-time itself. \\n\\n\r\nBesides Olga and some interesting character interactions I really didn't get much enjoyment out of this. And my burning hatred of Yoshi but that's just me. 3 out of 10.\\n\\n\r\nOverall:\\n\r\nIf you actually managed to read everything to this point I congratulate you. I know I get get pretty long winded about stuff like this and anyone who manages to read through anything I write is a hero in my eyes.\\n\\n\r\nNow, after 15+ paragraphs of me talking about this show, what do I think about it overall? Surprisingly enough, I don't find it horrible? Like, yeah, the story is weak and the characters, mainly Yoshi, are even weaker but overall it's pretty harmless. The music and art are nice and even if the episodes make you feel like your brain's leaking out it's not bad to just sit back and shut off your thoughts for a while and just let a show wash over you.\\n\\n\r\nThe main reason why I was so personally offended by the show was probably because I'm a huge fan of Bushiroad, especially their card games. And I know they can make good card game animes! Okay, as far as I can see, they have one good card game anime but that one is pretty darn good. And seeing them make such a bland show just kind of hurts my heart. I don't know how much say they have on the writing and characters but I like to believe they could have done better.\\n\\n\r\nThat's not to say that it's a good show. It's still boring and superficial at best. Even considering that this was just made to promote the card game it leaves a lot to be desired and doesn't even explain the card game aspect of it. At best it's a standard show with an interesting setting at worst it's a boring show that doesn't try to step out of it's bounds. 4 out of 10.",
            "date": "2016-05-16T09:26:00+00:00",
            "helpful_count": 73,
            "mal_id": 218697,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/shadowmellow",
                "username": "shadowmellow"
            },
            "url": "https://myanimelist.net/reviews.php?id=218697"
        },
        {
            "content": "Luck and logic to me, is one of those series that knows what it wants to be, in that it is not supposed to be all that groundbreaking in any sense. Its a nice small show that is heavily cliched, with entertaining action and extremely easy to follow plot/story...\r\nSPEAKING OF...!\r\nStory (7)\r\nThere's not much to go on about here. Good guys defend the city from bad guys that come through these gates from hell or something like that, sprinkle all of this with personal dramatic character plots (each character gets an episode) and top it off with the biggest bad they have to fight at theend. Like i said, easy to grasp.\\n\\n\r\nArt(6)\\n\r\nThe art in general is standard fair, though there is quite a heavy use of 3D for the action scenes of which some might find jarring, it is kind of strange seeing the characters so still in 2D and then very kind rubbery ragdoll movement with 3D. \\n\r\nThere are some 2D scenes where you can see that the animators screwed up, like one scene at the end of episode 3 i think, it looked like the game was having server issues, but then i realized that this wasn't a game, it was an anime. \\n\r\nThe character designs were nice, all of the transformations were pretty neat which nicely fitted each of there personalities.\\n\r\nSome of the action scenes can seem rather lazy though, with the typical \"character performs attack shot\" and then switches to \"character getting hit shot\".\\n\\n\r\nSound(8)\\n\r\nPersonally, I quite like the BGM, I might even hunt it down somewhere soon. Its mostly the action scene BGM I like with its sci-fi orchestralish sound. I really like the OP too, it kept me from skipping it every episode, The ED however is not to my taste.\\n\\n\r\nCharacter(6)\\n\r\nThe characters are not very interesting, they are very cliched and i will list the main team of them here.\\n\r\nYoshichika tsurugi - The main character of the series and... well... thats it... he IS a main character. uses a shield as his weapon (tank).\\n\r\nTamaki Yurine - The intelligent leader type girl, uses a controlled ribbon thing and a wand as a weapon and also heals (healer)\\n\r\nChloe Maxwell - The energetic arrogant girl, uses a flaming broadsword and often charges into battle without second thought (DPS)\\n\r\nMana Asuha - The quiet mysterious girl with a troubled past, uses guns, mainly a sniper, and also sneaks around by turning invisible n stealthy n stuff. (support/ranger)\\n\r\nThe characters are all teamed up with goddesses that combine with them to transform, but these goddesses are the most disappointing characters in this series since there nearly completely shoved aside and we learn next to nothing about them. I'd say i wouldn't even notice if they were removed from the series altogether.\\n\\n\r\nEnjoyment(8)\\n\r\nFor what it is, I really enjoyed this series, it was something i could sit down and watch without getting so invested that it would consume my life. Its a cliched \"save the world show\" and it knows well. As a finished series, i would recommend this to anyone who's got nothing else to do and just wants a quick anime fix rather than re-watching a presumably better series.",
            "date": "2016-03-28T03:08:00+00:00",
            "helpful_count": 27,
            "mal_id": 214506,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4689516.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/StevyleSteve",
                "username": "StevyleSteve"
            },
            "url": "https://myanimelist.net/reviews.php?id=214506"
        },
        {
            "content": "Watching this anime felt like eating a double quarter pounder with soy sauce at sunnybank. It made me feel like i was watching darren eat hotpot while i was labouring outside in the hot sun.\r\nOverall the story is not bad but the situations are really forced. I was actually interested in the plot but it was so badly executed. It was a pretty nasty anime to watch. Sound is decent. Characters were cliche. I enjoyed it because i love to waste my time.\r\n10/10 would rewatch.\r\nNot the worst anime i watched.\r\nI would say this is a timekiller. I would not recommend this to anyone and youshouldn't watch it unless you are super bored",
            "date": "2016-05-23T03:25:00+00:00",
            "helpful_count": 19,
            "mal_id": 219157,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5426796.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 4,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/JustinChiu",
                "username": "JustinChiu"
            },
            "url": "https://myanimelist.net/reviews.php?id=219157"
        },
        {
            "content": "It guess it's \"logical\" I had no \"luck\" with Luck & Logic (off to a good start).\r\nWhile the story, or I should say the concept, isn't that bad. It's more about how it's presented. We're told about the relationships between humans and gods, but we get nothing out of that aside from what we see with our characters. I would've liked to see more of it, but that never happened. Also, for a series that's supposed to be about fighting monsters, a good portion of the series doesn't have it, and instead show our characters doing clichéd things we'd see in a slice-of-life story.\r\nCharacters areabout as bland as they can get. They have their one characteristic and stick with that until the very end. Our main protagonist doesn't really feel like one. He apparently has some past, which was only ever brought up in the first episode. It could've been nice to maybe see what that was like. Although our characters are with each other all the time, there's honestly no chemistry with any.\\n\\n\r\nThere isn't much to say about the animation besides it's average. Action sequences use CG models for the characters, which didn't stand out and blended with everything else. The only thing I sort of liked was the characters' \"battle outfits\".\\n\\n\r\nI would not recommend this series to anyone. This is one of those shows that did nothing for me, and got nothing out of it. Characters are bland and unforgettable, and the universe isn't fleshed out enough for me to care about the laws of it. I could end with another pun, but I;m having a \"card\" time doing so (because there's a card game based on this, you see).",
            "date": "2016-03-26T20:00:00+00:00",
            "helpful_count": 15,
            "mal_id": 214286,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/AllenHavens92",
                "username": "AllenHavens92"
            },
            "url": "https://myanimelist.net/reviews.php?id=214286"
        },
        {
            "content": "This will be less of a review & more of a warning why you shouldn't waste your time watching this anime.\r\nStory: \r\nThe story is heavily cliched but not all that bad, the real problem is the execution. Even as the anime proceeds it doesn't explain one fucking thing about the trance, logic cards, etc etc and leaves a lot of unanswered question.\r\nArt & Animation:\r\nIt is good but fairly generic. I don't really like it but I don't have any complaints with it either.\r\nSound:\r\nThe soundtracks are fair, nothing that great or anything that would stick out but they fulfil their purpose.\r\nCharacter:\r\nThe characters are just perfect,,,, perfect1D characters. Just like everything in this anime they are the same cliched generic characters which you can see everywhere.\\n\\n\r\nEnjoyment & Overall:\\n\r\nThe anime is fairly enjoyably but its just fucking dumb. Its ok for a casual watch but there are far better anime out there so you don't need to bother yourself with this one.",
            "date": "2017-03-19T06:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 242955,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5919300.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 3,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/S_Class_weeb",
                "username": "S_Class_weeb"
            },
            "url": "https://myanimelist.net/reviews.php?id=242955"
        },
        {
            "content": "*This contains a small spoiler, but that has been marked clearly*\r\nInternal logic and believable characters are two of the most important factors for me in any show. It doesn't matter how outlandish or surreal the setting and events might be, as long as the show attempts to provide some reason for these actions, I stay happy. This show attempts nothing of the kind. While some of these gaffes are understandable considering that they are limitations of the show being based on a TCG (trading card game), the vast majority are intolerable. I'll list my personal opinions of the show in order of what I likedmost:\\n\\n\r\nSound: 8/10\\n\r\nThe sound quality of this anime is actually quite good. The opening and ending sequences have great tracks that mesh fairly well with the story. I have no complaints about the OST either.\\n\\n\r\nArt: 7/10\\n\r\nThe animation is of decent quality, uses a bright palette, and has a moderate use of CG. There's nothing amazing or new about the art, but then again, there was never really a moment when I could complain.\\n\\n\r\nStory: 3/10\\n\r\nThis is definitely not an anime you want to watch for the plot. It's mostly structured like a harem anime, with an overperforming male MC surrounded by pretty little things that lather him with attention. There is no overall plot for the story; each episode is based around backstories and character development. While this could have been an interesting approach, it fails because of the horrible quality of said character development.\\n\\n\r\nThere are also several elements in the story that make no sense or are never explained properly. For example, they often mention that the bond made during a covenant is permanent, and yet they show us that both Chloe and Tamaki were bonded to different covenanters in the past. What happened to them? Also, even though the ALCA organisation has been fighting invasions for a long time before Yoshi joined this branch, why is there only one Foreigner (Enlil) in the vault from before Yoshi entered the story? In addition, what is the difference between killing and capturing the foreigners? Both actions seem to involve dealing heavy amounts of damage to them. For some reason, slicing them in half using a giant fire sword or blasting holes in them with a magical shotgun separates them from their trancejacked host, but attacking them with a whip kills the foreigner.\\n\\n\r\n<minor spoilers> \\n\r\nIn the Veronica episode, the Ice Belva that they're fighting against never trancejacked anyone, so how is it able to manifest its powers?\\n\r\nEvery time a foreigner trancejacks a human, they are suddenly visible on the radar for ALCA to see. So why does Lucifer remian invisible even though he keeps trancejacking humans left, right and center?\\n\r\n</minor spoilers>\\n\\n\r\nCharacters: 2/10\\n\r\nWhen you have an anime that is so focused on the character development, you are really hit hard when you realize the complete lack of attention placed on their personalities. To show my point, I'll need to go a little into depth for each character while avoiding spoilers:\\n\\n\r\n1. Yoshichika: The main character, he is another mostly faceless MC that's meant for the audience to relate to. However, his personality is clearly undefined. At times he's extremely self-centered - he stays up all night watching videos of himself fighting monsters, he believes he's too famous to go to school, he ignores introductions with the other girls because he's just too tired. At other times, he's a super-kind goody-two-shoes - he's always quick to apologise when someone criticises him, he believes the foreigners shouldn't be killed. But in situations where a team member is asked to kill a foreigner, he has no complaints.\\n\\n\r\n2. Athena: The female lead and Yoshichika's covenanter, she's also the only goddess who gets any real screen time. Even though she has never met Yoshichika, she has somehow decided he is her soulmate. Apart from her odd love for Yoshichika and weird trust in Lucifer, there is no other defining aspect of her personality.\\n\\n\r\n3. Chloe: The stereotypically \"American\" girl - loud, stubborn, strong, blonde, and very confrontational. Teamed up with Valkyrie, she forms the main attack force of the group. In the beginning she's portrayed as the dumbest of the group, and even fails a quiz of basic questions on the topic of their world. And yet later in the series, she's suddenly a brilliant detective with the deductive powers and resourcefulness of a CSI Miami cop. Additionally, she's always working out and worried about her diet, and yet when asked to cook she makes burgers and mystery junk food. And for some reason, in a show full of Japanese characters, the one American character is the one with the horrible English naming sense.\\n\\n\r\n4. Tamaki: The former leader of the group. She's supposed to be the perfectionist and overachiever, who feels threatened by the perfect MC. At the beginning she berates Yoshi for not immediately attacking a weak monster, but later she suffers from moral dilemmas when she's asked to kill one herself. Paired with Venus, she's normally only good for healing and support. However once she activates her logic drive, her whip suddenly becomes an overpowered one-hit-kill weapon, which makes no sense.\\n\\n\r\n5. Mana: The emo, silent, depressed girl - it is difficult to complain about her without spoiling her backstory. All I'll say is that her backstory makes no sense. Also, her resolution of her problems is one of the most contrived battles I've ever seen. \\n\\n\r\n6. Olga: Literally the only character in the entire show I even liked, and even that was completely destroyed by the convoluted character development in the final arc. For most of the show, he is the only voice of reason - always able to identify flaws in the other characters and point them in the right direction. In addition, his cocksure showy attitude is always shown as hiding his insecurities and failing confidence. He was a truly relatable character; so when all his convictions break down so drastically at the end, I was horrified.\\n\\n\r\nThe rest of the characters are all just minor side characters, barely getting any attention or screen time. Artemis, Valkyrie and Venus are pretty much completely ignored aside from their scant interactions with their partners. Veronica and Nemesis are characters I can't understand - they seem to have the greatest firepower among the group, and yet they almost always avoid taking part in battles. I'm not even sure what Yukari's point in the story is.\\n\\n\\n\\n\r\nFinally, one of the worst examples of naming sense I've seen in anime - ALCA, the Another Logic Counter Agency. Which makes me wonder, what happened to the first Logic Counter Agency?\\n\\n\r\nI didn't expect much coming into this anime, and yet it still managed to disappoint. The animation and sound were the only saving grace.",
            "date": "2016-08-10T17:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 226429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5597848.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/GimmeDatDonut",
                "username": "GimmeDatDonut"
            },
            "url": "https://myanimelist.net/reviews.php?id=226429"
        },
        {
            "content": "This is an anime used to advertise a card game, or so I hear. As an ad for a card game, I feel like this anime falls flat. As a piece of entertainment, I say it was good. Yes, there were some parts where I was tempted to drop the anime, but Luck & Logic is not as bad as people like to say it is. It's still sub-par, but its not that below the average.\r\nIt was hard for me to get interested in the story. It essentially uses the \"retired badass comes out of retirement\" plot. It appears our protagonist mentally crippled himself ina past exploit that we will never hear about ever again. Don't get me wrong, I'm all for this retired badass story. It just feels like a let down. Potential gone.\\n\\n\r\nStory: 4/10\\n\\n\r\nArt wise, I'm no experienced critic in this aspect, so as long as it doesn't look like what OreTwi's TV animation looked like, then I'm generally lenient (don't get me wrong OreTwi is great in my opinion, but the animation was bad before they corrected it). \\n\\n\r\nHolographic bits an pieces looked cool, but some fight sequences looked a bit different from the normal animation. This threw me off a few times, especially in the later half of the anime.\\n\\n\r\nArt: 6/10\\n\\n\r\nSound. No expert on this either, but I thought it was great. The soundtrack is composed by Tatsuya Kato (I believe he did Shokugeki no Souma too). From experience, his work is usually something worth listening to. I liked it.\\n\\n\r\nSound: 8/10\\n\\n\r\nFor the characters, Yoshichika (MC), I feel is an exaggeration of the \"cookie cutter\" main character. Retired badass, check. Mysterious girl shows up offering a contract, check. Goes into first battle and begins to take command, check. Quick to jump to conclusions, check. I love his hair though.\\n\\n\r\nOlga is another character I find memorable enough to mention. He starts off looking like this sinister anti-villain/villain type character that everyone avoids mentioning. MC decides to pry then it is revealed that Olga just has a severe case of chuunibyou. The only thing he seems to be good for is his predictions, which are nearly always accurate. What I like him for is that he gets serves as the straight man to our crazy cast at times. Also, he gets massive development during the last arc. Good character in an average anime.\\n\\n\r\nOther characters are, like the MC, very \"cookie cutter\" style. Mysterious veteran squad leader. Formal, power by merit girl who gets shown up by MC in second episode. The \"Don't worry, Bros I got this\" character. Silent sniper. Immortal immaturity. The cute and cuddly girl. Other than MC and Olga, the characters seem to be very common fare, aside from the MC's family(fairly minor characters generally used for comedy).\\n\\n\r\nCharacters: 6/10 (because Olga carried this category)\\n\\n\r\nOverall, this anime is a fairly good. Your millage may vary though, due to the abusurd amount of stock/static characters, and fluctuation of plot. There is a harem anime joke in the middle of the anime that really caught my attention though. I like those types of jokes quite a bit, sadly that's the most memorable part of the third quarter of Luck & Logic.\\n\\n\r\nEnjoyment: 6/10\\n\\n\r\nMy thoughts. Again. It's not as bad as an anime could be. Scarred Rider Zechs was worse (Just the name of a random anime I dropped). Luck & Logic isn't unwatchable, per se. However, I've mentioned before that there are arcs that make you feel like you want to drop it. It was likeable.\\n\\n\r\nOVERALL: 7/10",
            "date": "2017-01-24T01:39:00+00:00",
            "helpful_count": 3,
            "mal_id": 239001,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5780048.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/KiramekiSparkle",
                "username": "KiramekiSparkle"
            },
            "url": "https://myanimelist.net/reviews.php?id=239001"
        },
        {
            "content": "Good background noise if you really need it but lord does this Anime have that annoying \"Every conflict could be taken out by talking\" thing. \r\nThe premise is interesting enough if you look at the show like something like Bakugon (Who remembers that? I probably spelled it wrong but I don't have the energy to check), Yugioh or any other overarching merch show. BUT. The characters, my god the characters. They managed to explain things like the Lore\" of everything like Logic and such without being annoying but when it comes to the characters the anime just is downright irritating. \r\nI'll try not to spoilanything but everyone has a problem with not talking about things until later for exposition dumps. It might just be me but I hate when people hide stuff from others on a freaking team. Stop leaving someone to keep looking like an idiot when they try and find things out. \\n\\n\r\nAlso, don't do the \"killing these new creatures is wrong\" thing without showing a good side of the new creatures. Or at least make it clear that that idealistic person is a total nutjob. God, I like Chloe the best since she's over everyone's melodramatic crap. It's too early for all of this!",
            "date": "2018-01-01T16:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 267131,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6820573.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PeachyOni",
                "username": "PeachyOni"
            },
            "url": "https://myanimelist.net/reviews.php?id=267131"
        },
        {
            "content": "(Spoiler-free) (Shorter ver. far down below)\r\nThis anime is boring. It's average. It's an anime that could be easily forgotten. It's cliched. It's nothing original. Watch this if you want to watch an anime while thinking of what anime to watch for the next few weeks. Even for me who doesn't mind cliche anime I still find it pretty boring. \r\nThe story is boring. I don't even think that this even have a story. Compared to HinaLogi, which is technically a sequel/alternate universe of this anime, it did a better job at SoL than this show here. Most importantly, the last arc is boring. It's whatyou can see from a lot of action/harem/shounen anime. Nothing is changed and nothing is added. So if you are thinking that this anime might be a character-driven show with interesting characters, read my next point.\\n\\n\r\nThe characters in this show is generic and bland. Although their backstories were told to us, but that still didn't change the fact that this is a carbon copy of the characters in other anime similar to this. Most importantly, the main character is boring as hell. His backstory is nothing original. Plus his screentime is so few compared to other female characters. \\n\\n\r\nThe BGM is non-existant. It doesn't stand out even in action scenes. The OP theme and sequence is pretty well done and I will give props to it. The ED theme is meh. The voice acting is sub-par. \\n\\n\r\nArt and animation is the only thing I can praise this anime for. It's beautiful, colorful and eye-catching. The character designs, although nothing original, are still pretty well drawn. However, the CG animation during battle scenes is only decently done. The action sequence is still pretty boring.\\n\\n\r\nMy enjoyment = 5. I watched this because I need to think of some anime to watch while watching an anime. So I picked this one to watch because of the art and animation and also the OP sequence. \\n\\n\r\nOverall, not recommended.\\n\\n\r\nPros:\\n\r\n1. Beautiful art\\n\r\n2. Good animation\\n\r\n3. OP sequence and theme suit the series well\\n\\n\r\nCons:\\n\r\n1. Boring\\n\r\n2. Too Cliche\\n\r\n3. Too serious",
            "date": "2017-09-21T07:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 258223,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4575451.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/EvanLoh",
                "username": "EvanLoh"
            },
            "url": "https://myanimelist.net/reviews.php?id=258223"
        },
        {
            "content": "LA doesn't even know if this show follows it's own logic!.\r\nThe anime follows a routine \"monster or Foreigner of the Week\" as Yoshichika warms up to the group of Girls and Goddess helping them although you can also say that Yoshichika pretty much solves the other cast members backstory or problems and he does for the most part, it's actually more of a Saturday Morning cartoon on how they deal with all this, talking about friendship to not outright killing the Foreigners instead taking them into captivity once the their episode is done and over with.\r\nWith this \"logic\", you can tell LA's favorite character isn'tYoshichika...he's kinda the \"omnipotent fixerupper\" and that kinda gets annoying at times, no LA's favourite character would have to have been the pair Tamaki Yurine voiced by ''Risa Taneda'' and Venus voiced by ''Nao Touyama'' as the anime developed her accidentally more than Yoshichika. \\n\\n\r\nThe anime really doesn't change it's format of \"Foreigner of the Week\" until episode 8 where the \"Big Bad\" appears and he outs to be a sympathetic villain in which LA actually agrees with to a certain point.\\n\\n\r\nThe plot twists are kinda predictable concerning what we're dealing with here but still the plot twists actually make this series better by the long run (as in by Episode 8). \\n\\n\r\nIn terms of animation by Doga Kobo, the character designs are decent enough and although there are 3D CGI when battle scenes occurs, it's consistent unlike another anime video game adaptation this season like ''Divine Gate''. \\n\\n\r\nLuck & Logic does bring up some plot holes to some of the plotlines at times concerning the characters and their motivations at times like with Yoshichika and Tamaki's argument as why would ALCA demote Tamaki who was team leader to put a newbie like Yoshichika as leader other than trying to bring up Tamaki's backstory?...like that doesn't make any sense.\\n\\n\r\nOnce episode 8 occurs, the subtle hints at the Big Bad comes and actually brings us an actual threat to care about the Big Bad's plan at hand and becomes rather more intriguing to watch. You just first need to slog through the \"Foreigner of the Week\" episodes just to get to it. \\n\\n\r\nThe ending did wrap everything from this season and although it was a bit of anti-climax, but nonetheless it was ok, but not \"great\", it was actually more cliched on it's execution.\\n\\n\r\n Luck & Logic has some logical errors concerning the plot and characters at times, however it's not outright horrible, LA sees it as charming how they are at least concerning the characters to a degree and what the main cast Logicalists are actually doing is influencing the plot and what with a sympathetic villain makes this anime adaptation of a trading card game actually competent even if it has the generic \"main protagonist fixes everything\". \\n\\n\r\nLuck & Logic...you got a few screws loose, but thankfully you get those screws back by the end of and not completely succumbed to the video game adaptation curse.",
            "date": "2016-03-26T14:24:00+00:00",
            "helpful_count": 4,
            "mal_id": 214250,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=214250"
        },
        {
            "content": "Warning possible Spoilers\r\nMy time watching anime's has certainly made me find some really amazing ones, but there is that point where I do find some really bad or Godawful ones and this is definitely one of them.\r\nThe story is set on the human world of Septpia and they are being invaded by creatures called Majin's so a boy named Yoshichika Tsurugi and his other Logicalist teammates along with their Goddesses are sent in to handle and stop the threat.\r\nNow I've seen these type of stories quite a few times and every time they get less and less enjoyable, this was just a great big boreto get through the only interesting thing I got from this show was how their suits worked which was by using a Goddess from the world the Majin's are from with a logic card and combing them with a human that to me sounded pretty interesting, but the rest of the show was just awful I couldn't get excited at all and I mainly either groaned or shouted when something predictable or cliched happened and you know an anime is bad when it calls out it's own cliches.\\n\r\nIt gladly only 12 episodes, but for 12 episodes it certainly dragged on however despite being a bore fest there were some or one element that kept me going well just about.\\n\\n\r\nThe characters are possibly the only reason I didn't quit the show because they were at least half-decent well most of them.\\n\r\nThe main character Yoshichika is not really a great example of a character and I even watched this in dub and it was surprising to see that he was voiced by Nathan Sharp AKA Natewantstobattle now Nathan's acting wasn't the problem it was Yoshi himself, he was a very bland person and didn't even try to set himself apart from many harem protagonists that I have seen before and funny enough this isn't even a harem so how did the show mess this up.\\n\r\nThen there are the 3 main human female characters Chloe, Mana and Tamaki, now each of these girls had their quirk Chloe was actually pretty likeable from her upbeat and active personality, even Mana was likeable too since she was shy and had a bit of a dark backstory, then there is Tamaki she annoyed the hell out of me I just wanted her to shut up whenever she got into an argument with someone luckily that didn't last the whole series and she was pretty much settled down by the final episodes. \\n\r\nThe Godesse's are actually pretty bland since you don't really get to see them do much other than powering the suits the other's have to use and the names of the Godesse's are Atena, Venus, Valkyrie, Altemis and Nemesis there was really nothing to make these characters stand out apart from their appearances and their slight personality differences so they didn't really do much for me.\\n\r\nThere is some other supporting characters too like Yukari who felt like the lovable mascot of the team who gets everyone back on their feet and there is also Chief Veronica who is pretty much like every other female chief I have seen in these type of anime's.\\n\r\nFinally there is the villains who are Olga Breakchild who is pretty much a douchebag longing to become a proper Logicalist who of course gets the evil bad guy Lucifer as his Logicalist and both of these guys didn't feel menacing they just felt like an irritation really.\\n\\n\r\nNow the artstyle was poor I didn't like the combination of 2D and 3D when there were battle sequences it just didn't fit and the same can be said for the monsters too they just looked awful and some of them looked like they belonged in Pokemon which felt very weird and wrong.\\n\\n\r\nThe action was poor and didn't last very long which to be honest is a good thing since the suits abilities didn't feel incredible compared to many other anime's I've seen that use special powers or magic whichever you class this as plus the suit's themselves didn't look that great either, what also really caught me off guard and actually annoyed me in some way was the surprising amount of fanservice in the anime and it made me think why there wasn't an Ecchi tag hell there was a scene with Tamaki and Atena who are fully nude and they even show Tamaki's bare nips now I like my fanservice, but this just felt wrong and uncomfortable, I could also say the same for the transformations it was like the animators wanted to woo the Yuri and Yaoi fans with the way those transformations went.\\n\\n\r\nOverall this was a poor anime and I wouldn't recommend it unless you are that much of a fan of cute girls in mecha like suits then be my guest, but for those casual viewers avoid this.",
            "date": "2017-07-02T08:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 251748,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=251748"
        },
        {
            "content": "So even in anime, adaptations of games can be bad.\r\nI had no interest in this show, the only reason I watched this show was because of Nathan Sharp (yes I'm a fan of him) and overall I was left not just disappointed but angry that Nathan did this because he is a better musician than he is a voice actor.\r\nthe story is boring it feels generic and half way through with some of the characters it starts to feel like a Infinite Stratos rip off and a bad one at that. (in my opinion Ill admit I'm probably wrong just saying that)\r\nthe characters aren't engagingat all apart form Jad Saxtons character (Jad just has the ability to do well even in something as bad as this apart form Sena in Haganai), Nathan's character is bland, monotone and has one of the worst outfits I've ever seen in an anime (when he's fighting)\\n\\n\r\nthe soundtrack is forgettable I mean I barely remember it and I watched the show a month ago and the unnecessary fan service in episode 7 was enouth for me to give up watching the show but I continued (all be it while I was drunk).\\n\\n\r\nin the end the show sets up for a season 2 which I hope doesn't happen because everyone in this is capable of better and please if your a Nate Wants To Battle fan don't hate me for saying that he is better than this monotone performance in this garbage.\\n\\n\r\nWatch it if you want but don't say didn't warn you and if you enjoy it then all power to you.",
            "date": "2017-06-25T10:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 251005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6260136.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AntMan95",
                "username": "AntMan95"
            },
            "url": "https://myanimelist.net/reviews.php?id=251005"
        }
    ]
]