[
    [
        {
            "content": "A series based on dating. Date a Live wastes no time adapting this concept by having Shido Itsuka date various girls/spirits, earn their feelings, and kiss them to seal the deal. As a harem show, you’d expect all the girls drooling over him. While that’s partially right, it also adds additional elements because those so-called girls aren’t actually normal as part of society. Instead, they are spirits, born with supernatural powers who are viewed as a threat to their world. Date a Live II continues directly after the events for season 1. It continues to mush around its formulation of dating and turns it intosome gimmicky show – dating becoming the solution to save the world.\\n\\n\r\nBased off the light novels written by Koishi Tachibana, one noticeable attribute to this adaption is the shortened length. Rather than a full one cour show (the typical 12-13 episodes), this sequel only focuses on 10 episodes adapting volumes 5-7. The main concern is rush and this should be expected. I confess to myself that the sequel is disappointing when it comes to adapting faithful material. The show decides to omit various parts to get more time for the main actors and actresses. In this case, it’s the spirits. After all, Date a Live II is a stardom for some new characters such as a pair of twins, new AST (Anti-Spirit Team) members, and even a rising idol. The catch is that some of the focus on other character are scrapped to replace their stardom.\\n\\n\r\nThe sequel is essentially divided into two halves although the first arc has slightly less material than the second. Still, Shidou remains the focus of the show as the bachelor as he tries to save spirits and the world. The first episode has mostly anime original material but this comes off as disappointing. There’s harem antics thrown in your face fused with a whirlwind of misunderstandings. To make matters worse, the show decides to add elements from classic soap operas to appeal to these misunderstandings to somehow make them more amusing. And this comes out as dishonest as Tohka falls for every single scenario she feasts her eyes on. Neither does the initial set up show any improvement with other characters as they still want to get into Shido’s pants such as Origami. On the other hand, Shido himself has become more confident. He finds adjustment to his new lifestyle now that Tohka, Yoshino, and Kotori are living together. His relationship with these girls/spirits almost feels like a family as they give him the same pleasure as he gives them. And while the show is still regarded as a harem, the feelings the characters show are more honest and innocent especially in the case for Tohka.\\n\\n\r\nComedy is indulged in this series with some welcoming aspects. While a lot of it seems repetitive, there are also other more refreshing parts such as a little gender bender not previously seen from season 1. The characters behave the way they should be with various personalities. Origami for instance is still her usual self and tries every single moment to get close to Shidou using some questionable yet amusing methods. Then, there’s the classic Date a Live gimmick: the multiple choice. While it is featured once again as a strategy to deal with runaway spirits, it has less prominence with some of the questions lacking flavor. Yet, it isn’t really what’s being asked that shows the humor but rather Shido’s way of responding.  It flirts with the idea of how Shido pretends to get attention of the spirits while methodically see how they react to them. While it makes its point effectively, it still falls under the wish fulfillment and generic tropes. By this time though, it should probably be something the audience should expect from Date a Live. Emphasis on the date.\\n\\n\r\nDirector Keitaro Motonaga crafts his ideas from behind the scenes. Known for some of other series in the harem genre such as Akane Iro ni Somaru Saka, Majikoi - Oh! Samurai Girls, and the first season of Date a Live, one might question the direction of this sequel. This can come as a hit or miss especially for fans who are familiar with the material, specifically from the light novels. As mentioned before, the pacing suffers with certain elements omitted whether it would be part of the plot, humorous gags, or even character cameos. But an important factor to take notice of is the way characters are depicted. For instance, while the Yamai twins retain their personalities, the focus on them seems to be shortened with other characters. Even though Shido is the main protagonist, the subtle relationships he develops with the spirits can feel crude and stereotypical. It doesn’t even attempt to hide itself whether it’s be the fan service (such as the classic beach episode) or the seductive poses characters throw into Shido’s face. In essence, Date a Live makes the show looks itself more like a mission, to accomplish a purpose and move on. This at least applies to most of the supporting characters in the form of conquests for Shido. It doesn’t necessary develop his character or even express his personification in any ample way. \\n\\n\r\nBut for someone like Shido, responsibility becomes part of his life. When there’s trouble, he needs to be prepared. While the first arc didn’t give Shido’s impression of this, the latter half sees an improvement with his strategies. He isn’t just more confident but also fights for beyond the scope of the mission. In retrospect, he becomes more mature and takes his job more seriously with even some admiration to see how far he goes when trying to save a friend. After all, the spirits gets stronger and his life becomes more in jeopardy. For the spirits, they offer diversity. We see a sharp contrast in their persona when comparing the first and second half of the story. Shido has to respond accordingly and think outside the box in order to prevail. He does get a little bit of help though from an unlikely ally, and one that fans adore from the first season with her yandere tendencies. \\n\\n\r\nTaking in the account of action, the show doesn’t cease to make this its way whether it’s aerial battles, ground level warfare, or even a battle of psychological integrity. Shido finds himself in moments of despair and desperation as events become more jeopardizing to peace. Even Kotori finds herself outmatched in some circumstances. And with new characters introduced such as Sir Issac and Ellen from the DEM industries (a military corporation for developing mecha units), you can expect a bit of clash of egos. Not only has that but characters such as Origami also found herself on the edge and in trouble throughout the season as she battles against her adversaries. Despite the mecha gears looking more suggestive though, there is credibility to the action with high caliber weapons in operation, superhuman maneuvers courtesy of the spirits, and even Shido’s risky moves. \\n\\n\r\nAs the majority of the cast returns to the sequel, you should be familiarized already with their personalities. Unfortunately, their development lacks in terms of characterization as the show focuses more on sealing the spirits and less so when Shido isn’t on dates.  Furthermore, the fan service never ceases as the first arc is saturated with ecchi. But again, this is Date a Live we’re talking about a – franchise that pokes at fun the concept of dating to add its own ‘save the world while you get to date girls’ trite. \\n\\n\r\nArtwork remains generally the same as characters returning from the first season hardly goes undergoes any significant physical changes. In other words, it still remains generic as hardly anything stands out with Shido’s character design. On the other hand, the new spirits such as the Yamai twins and the idol Miku has some attractive figures. Background visuals remains stale although more lively and natural when the series takes on a beach setting. But remember that fan service never ceases whether it’s be the traditional swimsuits or the libidinous camera angles. It doesn’t cease to hide the teasing either and tires honestly to appease itself with stupidity. There are some cute moments though and decorative outfits in particular with the show’s second half that is more colorful. But overall, it’s still lacking.\\n\\n\r\nAlthough soundtrack isn’t a powerhouse, it does improve more in this sequel whether it’d be the action scenes or emotional scenarios. The bittersweet moments are focused more intensely to bring out some credibility to character relationships. Some of the dialogues may also seem cheesy but offer humor with their speech mannerisms (i.e. the contrasting tones of the Yamai twins). On the other hand, Miku’s voice feels egoistic, lacks serenity, and in general aspect sounds like a spoiled brat with annoying tones. The song she sings aren’t attractive either with her soft but squeaking style. Thankfully, the OP and ED songs has more features that makes the franchise what it is.\\n\\n\r\n10 episodes and that’s how Date a Live II decides to adapt the second season. The disappointment of story development in terms of a more accurate adaptation puts a stain on this show. At the same time, the fan service is like a bed bug that infests itself at any opportunity it has the chance. The first half of the season focuses on this exclusively with the twins while the second part tries out a little different with a bit of gender bender. But still, the comedy can be pleasant if you’re into the show’s gimmicks. The characters also offers something new; contrasting greatly between the two arcs but still refreshing. There’s even a favorable character that makes her ultimate return with great anticipation. But if you’re anticipating to watch this sequel, just be ready for another journey of dating sim and shenanigans. \\n",
            "date": "2014-06-13T11:30:00+00:00",
            "helpful_count": 133,
            "mal_id": 146871,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=146871"
        },
        {
            "content": "Updated: 13, July 2016\r\nOnce again, the momentum of an ambitious premiere is carried straight into a brick wall. Although I reserved my expectations heading into this sequel, I certainly anticipated more than ten episodes of a disgrace. Date A Live II strayed away from the merits which put its prequel on the map, such as the charms of the vivacious heroines or remarkable humor tied to a spectrum of dating simulation choices. It was only yesterday that an udon shop launched an eventful assault on the core group (en route to a local hot spring). It was only yesterday that Shidou matched wits and fistsagainst true adversity, juggling a batch of pressing demands with everything on the line. It was only yesterday that players were ripe with presence and not confined to restrictions of a dismal cause.\\n\\n\r\nWhile Date A Live's strengths permeated well through a lively bunch headlining season one, there was no vibrancy to replicate that success in this second act. The Berserk twins were pure lighter fluid to one of the most staggering time sinks I have witnessed in this genre. Was it really too much to ask for with yin-yang personalities serving no purpose other than to get Shidou hot? And as for the Diva, I hated to see her unique sexual preference and tastes overshadowed by her foully variable and one-dimensional personality.\\n\\n\r\nThe premise for this sequel was collectively lacking in soul and impact. Most of, if not all the battles, were saturated with cheap chatter among combatants stirred together with a high concentration of pretentious drama. The most obvious misunderstandings were blown well out of proportion while new rivals and antagonist powerhouses seemingly made their appearances out of thin air. The more easygoing school events and concerts did little to support the effort or lighten the atmosphere.\\n\\n\r\nIt would be great if the upcoming movies, OVAs, and/or TV sequels can rebound and inject Live-liness back into this series. Nonetheless, the signature trademark of the glasses schoolgirl accurately sums up this installment. It really was that lame!",
            "date": "2014-06-17T04:02:00+00:00",
            "helpful_count": 101,
            "mal_id": 147331,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1123783.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/StyleF1re",
                "username": "StyleF1re"
            },
            "url": "https://myanimelist.net/reviews.php?id=147331"
        },
        {
            "content": "Still new at reviews but here I go.   Date A Live 2, continues the story about Shido, who is a boy who has the ability to seal spirits, thus preventing them from doing large-scale damage, through dating them and eventually kissing them.  In this second season, the story is slow to start, but it introduces the Twins spirits and the Diva spirit, along with an inverse version of an earlier spirit (no spoilers here lol). \r\nI enjoyed Date A Live because of the unusualness of the plot.  I mean, I haven't heard of a show where a person dates someone, andthen kisses them to seal their powers before, so of course it had my interest.  Season 2 has been a disappointment for the first few episodes, but finally it has gotten back to what it was known for, which is spirits fighting, mecha suit girls fighting, dates occurring, and other things of the sort.  The art style of the show is nice because it keeps things light-hearted and not too deep, although there are a few sad moments in the show, but those few moments, are kept short and are many of the times, resolved.\\n\\n\r\nSound wise, the music is great.  It's not 10/10 masterpiece by any standards, but its fitting and just sounds great, especially the opening theme.  The characters are easy to remember special in there own way.   Between the twin spirits, the Diva, Shido, the other spirits, etc. they are all memorable and in my opinion, likeable.  Personally, I like Kurumi because of her craziness and time control ability, but they each have their own little niche that they fill in character development.\\n\\n\r\nAs I said before, the story is unique in it's own respects, and I've enjoyed it, even though this season was much slower at starting than the previous one.  Since the show has picked up the pace and has shown more action, I've enjoyed it more and more, although when comparing this to the light novel, the anime is flying through the story, much faster than the LN ever did.  To some, this is an issue, while for others, it helps to cut the small details and get the main story.  I'm split on this but the LN is a good reads.\\n\\n\r\nAll in all, if you liked Date A Live, then you will like this but just hang in there if you think that it is slow.  This season was largely about introducing new characters and revealing new things about older characters.   If you haven't watched DAL and think that this show is weird, bad, confusing, etc. then give DAL a shot first",
            "date": "2014-06-02T06:21:00+00:00",
            "helpful_count": 83,
            "mal_id": 145509,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=145509"
        },
        {
            "content": "There comes a time while watching anime where you get this kind of 'itch' that can only be scratched by a very specific genre of show, for some people this itch could be an over-the-top action show like Black Lagoon. for others it could be a good mind-fuck show like Serial Experiments Lain or Evangelion. But for me and my easily-satisfied outlook on anime, this 'itch' is most commonly a dumb harem show with beautiful girls and a dash of action! So when I found out that one of my favourite harem was getting a sequel? Well that was all gravy for me!\r\nStory - 7/10:\r\nI'vegot to be honest, the story really isn't the strongest part of this show; which is pretty standard for the genre its from. It continues from shortly after where the first season left off, Shido is still the Spirit Pimp, Tohka is still annoying and the rest are just...there.\\n\r\nThe second season covers roughly volumes 5-7 of the Light Novel which means the introduction of two new Spirit types; the Hurricane Twins, Yuzuru and Kaguya Yamai and the Diva AKA Miku Izayoi. Of course the formula of 'Kiss the girl, save the world' doesn't change, but the story managed to break away from the formulaic first season thanks to the personalities of the two new additions.\\n\\n\r\nArt - 5-8/10:\\n\r\nI had to look this up to see if it was actually a Gonzo show because the art and animation varies so much its unbelievable, the first episode looked awful in regards to art style and the character styles in the OP urked me to the point i skipped it, i mean, what the hell was up with Kurumi? Nevermind. It seemed they focused their budget solely on the second half of the series once the new spirits where introduced and we could get into the real meat of the story. The fight scenes looked absolutely stunning with the wide range of colours creating some of the most satisfying and complimenting action scenes i have ever witnessed in a harem show (or is that not saying much? I don't know) however in the less interesting parts of the show they pulled an Evangelion and skimped wherever they could during scenes of dialogue. Another part that annoyed me was the lack of quality during Miku's live performances where her mouth wouldn't even come close to matching the sync of the song being played, its not that much of a problem as the song's themselves were amazing, but it was noticeable enough for me to mention it here.\\n\\n\r\nSound - 9/10:\\n\r\nAs a Japanese speaker myself, i can openly and happily say this dub was pretty strong, Kurumi's voice actress was brilliant at nailing her slightly Psychotic yet simultaneously adorable personality, where she could switch between the two on a whim. The OP sounded beautiful despite somewhat cheesy lyrics and the ED was also pretty strong if albeit containing nothing particularly noteworthy to mention. Miku's songs made specifically for this season were a nice treat as her final song in episode 10 was one of the best songs i've heard from within an anime show.\\n\\n\r\nCharacter - 7/10:\\n\r\nThe biggest strength and biggest problem of this show was the characters; the one's who got a lot of screen time were developed nicely despite the shortage of episodes, Miku's tsundere personality and view on men was a whole was a nice touch and amusing thing to watch considering what Shido must do to seal her powers. The Yamai twins were also great, with one having an unmoved, somewhat 'Rei ayanami/Yuki Nagato' personality- often submissive but very calm and collected, contrasting to her abnoxious and loud twin sister who is often very reckless.\\n\r\nThe characters who weren't developed at all or any further, however, was a HUGE problem for me. The most abvious lack of development was that of the character 'Jessica' who's motives and ambitions would have completely gone over my head if i hadn't already read the Light Novels, she was so poorly developed that i was becoming rather impatient that she was still a 'thing' almost 4 episodes after she was introduced. Another example of poor development was that of the fan-favourite loli, Yoshino, who spent the entire first half of the season at home, irrelevant, watching TV dramas that just so happen to either match the situation going on with the other characters or predicted the future. Finally, the antagonist of the story, Westcott, was also poorly developed, but considering he is probably going to be the antagonist of the recently-announced Date A Live movie, i can kind of forgive it and respect that they didn't rush him.\\n\\n\r\nEnjoyment - 8/10:\\n\r\nI consider a Date A Live franchise as one of my guilty pleasures, i'm aware that there's nothing really special to make me want to watch it, but I watch it anyway because its just pure mindless fun. The second season doesn't necessarily to as good a job as the first season but that all depends on what you expected from this show in the first place, at the time i watched this, i wasn't in the mood for anything thought-provoking and it was there to satisfy me. The character arcs were incredibly fun to watch, throwing in new twists to the typical 'win them over and kiss them' formula that was rather refreshing and i respect Tachibana-san (the mangaka) for not rehashing the same archetypes over and over again. the ending was slightly rushed but that's what I expected after the plot twist in episode 9 so its not really affected me - especially knowing more is to come.\\n\\n\r\nOverall - 7/10:\\n\r\nIt wasn't a clean-cut show, in fact its pacing and execution of the arcs were poor, however, like every harem, its the characters that matter; the characters that you can really get behind and root for and the second season did the job well for the ones it did bother to develop. The music and voice-acting was on point and the story was above average for the genre its from if albeit a little too ambitious and convoluted for a 10 episode series, the show does indeed scratch the itch of a dumb fun show, and really, what more could you ask from it?",
            "date": "2014-06-13T15:21:00+00:00",
            "helpful_count": 73,
            "mal_id": 146887,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3041927.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeikoHaran",
                "username": "LeikoHaran"
            },
            "url": "https://myanimelist.net/reviews.php?id=146887"
        },
        {
            "content": "Ok, where do I start with this massive disappointment. I'll start off with saying that I loved the first Date-A-Live anime and I do not consider myself the biggest fan of this series and I have not read the light novels but this sequel was so disappointing. If this sequel follows the light novel exactly then good job but this sequel pales so much in comparison to the first one because nothing new happens! Date-A-Live II feels like an exact copy and paste of what happened in the last anime but with new spirits. Yes I know it is a sequel or second season tobe more exact, but shouldn't sequels and especially second seasons be exploring the mysteries that the previous left behind? I'm going to stop ranting and get into the review.\\n\\n\r\nStory: 3\\n\r\n The story is exactly the same, but only with the introduction of new spirits and our previous spirits are living peacefully with Shido until the bad guys mess everything up. (I'm assuming everybody that is reading this has either heard the gist of the story in the last anime or has watched this series) I understand this is a second season so it should be similar in terms of story but this is almost an exact copy of the previous story. Now is the story bad, not exactly. This is a parody series so don't expect a great story and I honestly like the twist of instead of fighting the spirits, you date them. But it's the fact that  they did not do anything new other than introduce some new spirits that become pointless in the end. They could have focused more on the origins of the spirits or Shido's power, but instead we get the exact same thing as last time. I'm not sure if I made my point clear or not but I'm moving on. \\n\\n\r\nArt: 7\\n\r\nOne thing that is good about this series is the art. It has not changed too much from the first anime and I do like the fact it has not changed a lot because I really like the art. The colors are bright and vibrant yet dark and malevolent when need be. The characters are well drawn, and the battles are still amazing. Edit: I have just re-watched an episode and I noticed that the character designs do change slightly when shifting from different scenes for whatever, but not all the time. But still very annoying. I have bumped the score down to a 7 from an 8\\n\\n\r\nSound: 7\\n\r\nThe sound isn't too great. I loved the OP, it was very catchy but that's just my opinion. The ED was decent, it has been a while since I watched it so I can't remember the song but I do remember skipping the ED song so I personally didn't like it. As for the insert songs, nothing stood out but everything felt like it belonged, again it has been a while since I watched this so I may be wrong.\\n\\n\r\nCharacter: 6\\n\r\nI would give this score lower if only it was based only on the new characters introduced, but the old ones do appear quite frequently (I did like the previous spirits better but I do find Tohka and Tobiichi quite annoying at times) The new spirits that appear are the twins: Yuzuru and Kaguya both controlling the power of winds. I do like these two but I felt like there introduction and getting them into the harem took way too long. And finally we have the new spirit Miku. Just like Hatsune Miku her power is her voice, most notably singing. (Coincidence, I think not) As for her character, I found her very annoying and made me want to drop this series. And there is some noticeable change  within our main Hero and Heroine Shido and Tohka. Shido for some reason gets a huge power spike out of nowhere, it is implied that it comes from his power to seal spirits but we learn nothing of that, and Tohka becomes very clingy to Shido, and she was already pretty clingy before but it felt like it has been toned up a bit. Not to mention the fact that she seems very useless, as in weak for no apparent reason and now needs to depend on Shido for everything unlike before when she could haul ass and only need Shido for food. Back on track, new characters were okay, Tohka for some reason becomes very weak and Shido becomes overpowered. In short character related stuff was okay but could have been better. Oh yeah, and the new villains are cool but needs more explanation behind what they are doing and why they are doing it.\\n\\n\r\nEnjoyment: 5\\n\r\nThe copy and paste story was okay when I first started watching this, because I liked how it hasn't changed but became annoyed when I realized I am watching almost the exact same thing as last time. I know what I said was a bit contradictory but my underlying point is that I don't like watching the exact same thing especially when a sequel repeats what happens before just with different characters. Another thing I did not like about this is how many times they reused the jokes from the first season. The jokes were funny at first but they used it too many times that it just got annoying.  I do like how this season there was an actual villain, but the villains motive was never explained well. In short, this had a good start but lost momentum as it progressed.\\n\\n\r\nOverall: 6\\n\r\nWith a copy and paste story, boring spirits compared to the first season and a plot that loses steam as it progressed, it's surprising how it gets a 6 in my book. Well with the previous spirits occasionally making appearances, especially Kurumi (my favorite spirit) who plays a big roll in the final battle, good animation and a really catchy opening saves it from complete disaster. Also it was only 10 episode, thank god for that.\\n",
            "date": "2014-10-29T18:03:00+00:00",
            "helpful_count": 19,
            "mal_id": 166723,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2111431.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ryuu9876541",
                "username": "ryuu9876541"
            },
            "url": "https://myanimelist.net/reviews.php?id=166723"
        },
        {
            "content": "This is hard for me because I am a fan of the Date A Live light novel series. It really is hard. Date A Live II was the planned second season of Date A Live and it covers Light Novel volumes 5, 6, and 7. It was only 10 episodes long which in itself was already disappointing before the series even started. The story for Date A Live is silly. Even in the first season there isn't much, but it's much better than what we saw here in this second one. \r\nDate A Live II starts the season with filler which was a disaster sincethere were only 10 episodes and the episode itself is dreadful. It then proceeds to stumble all over itself for the next few episodes and never really gets going. The 5th volume was done fairly well, but it was just boring. 6 was terrible, and 7 was good. \\n\\n\\n\r\nOverall I can't say much about the story, but it's just dry. It lacks any punch and there is no driven plot until late in the series. I'll give it a 6/10 because though the last arc is predictable it offers some enjoyment. \\n\\n\r\nThe real problem here is the art and animation. I don't know where to begin. Date A Live season 1 had some of the best animation of any show of 2013; meanwhile, this series doesn't have any place in 2014. The mistakes in animation are just ghastly. There is no budget for this series at all . It looks terrible and that is very sad considering the tsunako designed characters are very appealing and easy on the eyes. To not be able to capture this was just sad and ruined the entire season for me. I can't go over 2/10 for art. \\n\\n\r\nThe sound is pretty good and soundtrack once again is pretty decent, but the use of music is extremely questionable. There are sometimes completely silent battles and it does not make sense. 7/10 for sound. \\n\\n\r\nNow in this season we meet a lot of a new characters, and I can't say you feel any attachment to any of them. Instead of building on what we already had in season 1 which was fairly likeable, most girls are barely even seen in favor of mediocre characters and bland plot lines. It's just not well done at all. 4/10 for character. \\n\\n\r\nOverall I didn't enjoy DAL II. It was one of those things that was just bad. And it's disappointing because I am a huge fan of the light novel series and the whole DAL franchise, and I love the story, but this was just done horribly. I couldn't believe it myself and I am extremely disappointed. 4/10 for enjoyment and an overall score of 5/10. \\n\\n\\n\r\nDate A Live II fails to capture the same feelings of Date A Live season 1 and loses it's own identity. It gets lost in a sea of mediocrity and just when it begins to try to pick itself up it ends. A regretfully poor experience. I just wish it had been better.",
            "date": "2014-06-13T18:15:00+00:00",
            "helpful_count": 18,
            "mal_id": 146901,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MasiTronXIII",
                "username": "MasiTronXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=146901"
        },
        {
            "content": "Harems, a category of anime that involves one person of a specific gender, being surrounded by three or more members of the opposite gender, in hopes that they become the lover of the one person.  While Harems aren't the most favorite out of all of the genres of anime, it doesn't always mean that there aren't some really good ones out there.  Date A Live II, an anime in which I can safely say, is one of those few.\r\nStory (7.89/10):  For those of you who haven't seen the first season, Date A Live is an anime series that revolves around our mainprotagonist Shidou, our sixteen year old main protagonist, who has the ability to seal these otherworldly beings called spirits, who just so happen to all look like attractive/adorable human females from this world.  The main idea of the series, is that our main protagonist must seal these spirits away peacefully by no other means than by making them fall in love with him, and sealing them with a kiss.  \\n\\n\r\nNow, from an idea standpoint, the story is as cliched and redone as it can get, as a similar series, called \"The World God Only Knows\" has done a similar sort of story focal point already.  As far as idea originality, this series gets a six point rating at best.  But why does the story get a higher rating you ask?  That my dear readers is in the story arcs.\\n\\n\r\nWhat makes this season in particular more interesting is the way the story was written out.  Compared to its predecessor, Date A Live II has a lot more focus on its characters rather than general fanservice that other harem anime do.  In fact, I personally can't even consider this as a true harem, as only a small fraction out of all of the girls in the series actually like the guy in that way.  Each of its two story arcs give growth to the new incoming characters to the series, and to our main protagonist, making them feel a bit more real and less platonic.  While the development did feel a bit rushed, it was commendable that the writers actually spent time on making the characters more in-depth and important rather than just one here, done, another, done with its characters.  \\n\\n\r\nAbove all, what separates this story from a good chunk of harems out there, is mystery.  THe series actually has a good mystery element that is sadly only really explored later on in the series.  There's a lot of interesting questions that need to be answered, and that intrigued me, as the story felt like it was evolving into something greater than it would've been at first glance.  \\n\\n\r\nAside from that, there were some downfalls of the series.  Number 1 is well, the first episode.  The first episode was quite a turnoff, as the actual story was really just a big misunderstanding that felt more like an OVA rather than a part of the main story.  It did introduce the first arc somewhat, but overall, felt really unessecary and probably turned off some of its fan base due to how excessively comedic (even by date a live standards) it was.  Number two is pacing.  Some of the episodes admittedly did feel a bit rushed in what they were trying to achieve, making some stuff to go along in order to advance the plot.  Given the small time frame of ten episodes, it was sad to see some details that could've used a little bit more explanation.\\n\\n\r\nThe ending itself felt a bit rushed.  I wish the final episode was sort of drawn out into two episodes because it felt really rushed.  It was a part of the series I was really itching to see, and to see the arc I anticipated so much become just a half episode standoff, it was quite disappointing really.\\n\\n\r\nAll in all, Date A Live II had a pretty decent story.  It built on what it had before and made the story a lot more deeper and in depth than its predecessor, which is always a plus.  On the other hand, there were some time issues with the series that just made it shine a little less than it could've.  \\n\\n\r\nOverview\\n\r\n+  Good story arcs\\n\r\n+  Great character development\\n\r\n+  Good mystery element\\n\r\n-   Disappointing final arc\\n\r\n-   10 episodes.  (The first season was 12.)\\n\\n\r\nCharacters (7.77/10):  The characters of this series is definitely a high point.  For every fan of this show, there is a girl that they love.  (Kurumi all the way.)  Of course, the series itself is a harem, so the gender ratios are well, a bit off.\\n\\n\r\nItsuka Shidou, our main protagonist of Date A Live who has the ability to seal these creatures called spirits with a kiss.  (This guy gets quite a bit of action.)  At first glance, one could call him just an average harem lead, a guy who's nice to everyone and doesn't want to hurt anyone's feelings, all the while with several girls after his D.  (In this case, two girls.)  So what sets him apart from many other harem leads?  For one thing, he's not dense.  He's actually fully aware of the love that some of the girls in the series give him, which makes the experience of watching not so hair-pulling worthy.  (Unlike Infinite Stratos)  As the series goes on, you can clearly see him prove his worth in the series as he shows himself to be very proactive in doing his job of protecting and saving spirits.  The comical dating sim choice thing that occurs regularly in the first series becomes obsolete due to the fact that he chooses and says his own words, making his character feel all the more better.  \\n\\n\r\nYatogami Tohka is the main female lead of this series.  While personally, I'm not that big of a fan of Tohka, I was a bit saddened to see her role become more of a supportive one rather than a more proactive one.  Throughout the series, Tohka served little more than the role of just being there and coming in at the right time to make stuff happen.  It wasn't until the final episode where her role really shined, only to be cut in half due to the small time frame. \\n\\n\r\nThe series on the other hand became quite focused on the three main spirits featured in this season; the Yamai sisters, and Miku.  What I can say is the fact that these three are some of the most animated and thought out characters that I've seen in Date A Live other than the main two characters.  The reason being is because their stories are quite thought out and detailed.  Their stories made the series better on account of the fact that they grew alongside out main protagonist in terms of character development, turning into three dimensional characters that have more to offer than at first glance.  \\n\\n\r\nAside from the more focused characters of the series, we have a whole slew of side characters that range from amount of screentime and importance in the series.  What I didn't like was the fact that so many characters in the series that had quite a bit of significance in the first season, had barely any significance in this season.  Kotori, who was a prominent character, was put in the backseat, along with Origami and my favorite spirit Kurumi, who had barely any screentime altogether.  While it didn't impact the series too much as a whole, I did wish I could see these characters a bit more in this season than what was given.  \\n\\n\r\nBut what I can say was a positive, was the fact that we now have established antagonists in the series.  This season gave us some pretty interesting antagonists with motives that weren't quite clear to the characters or us, adding into the ever growing mystery of this show that I like.  It was a good addition that could only really make the show grow even more.\\n\\n\r\nOverview:\\n\r\n+  Good character development\\n\r\n+  Good established antagonists\\n\r\n-   Important character demoted to supporting role\\n\r\n-   Lack of screentime for some more important side characters\\n\\n\r\nArt and Sound (8.00 and 8.01/10):  The art for the series was definitely stepped up.  The visuals of the series looked fantastic and glorious, the fight scenes were crisp, fluid and amazing.  Every character looked great; there wasn't any sort of screw ups for the look of the characters.  While the art did look good, there was one big flaw, and that is, darkness.  For a good portion of the series, the show looks like Another.  The entirety of the frame in some parts of the show looked completely black and made it really hard to see what was going on.  It didn't really feel like a good experience and took away parts of the show overall.  \\n\\n\r\nAnd the required section for any ecchi show, fanservice.  Date a live, with its cast of for the most part, largely chested females, has a quite significant amount of fanservice.  Any time a spirit gets her powers sealed, their astral dress will fade, thus baring everything to our main protagonist. (I told you this guy gets some.)  What I noticed is the fact that the fanservice seemed to be downgraded, as in there wasn't as much as there was in the first season.  Because they put so much time into the plot, there wasn't as much fanservice as there could've been, and that made the series, at least for me, a more pleasurable experience to watch.  Though there was some...unnecessary imagery that was used that I preferred not to have seen.  \\n\\n\r\nFor music, the series came with a set of new OP and ED tracks, to me, far exceeding the original series's tracks.  The opening sounded similar to the original OP, but different enough to make me like it even more.  While it was a memorable track to me, it didn't stick out as something for a long term favorite.  The ending on the other hand was a song in a storytelling sequence.  The lyrics were that of a fairytale about a hero saving the princess, making this personally my favorite track of the whole series, as it teased about the final arc of the season, that ended up to be quite disappointing.  \\n\\n\r\nAs for background tracks, the series reused practically all of them, from the quirky ones to the battle tracks, to my ever favorite mystical opera one that added suspense and mystery to the scene.  The background tracks are actually quite good and make Date A Live, Date a Live.\\n\\n\r\nOverview:\\n\r\n+  Upgraded visuals\\n\r\n+  Good new tracks\\n\r\n-  Unnecessary imagery in some fanservice scenes\\n\\n\r\nPersonal Enjoyment (9.89/10):  I'm not adding personal enjoyment to the overall average score for all categories, as it will skew the results.  I won't lie, this series is a favorite of mine.  It is my guilty pleasure anime, it was my friday afternoons, it was really the first series I marathoned in an entire night when the first season was finished airing.  When I first saw that Date a Live was getting a second season, I was ecstatic, itching for the spring season to come out, as this was my most anticipated series of the season.  Coming out of it now, I can say a few things seriously.  (I'm coming out of fanboy mode now.)  \\n\\n\r\nDate A Live is one of the better harems you'll find.  It's not the best one, but it's one of the better ones.  Date A Live isn't a masterpiece.  In fact, it has some negative feedback on some points on which I can agree on.  By harem standards, it's a good choice to watch.  By anime standards in general, you can find a lot of other things to watch.  This season did a lot of things well that made the series shine more than before, but at the same time, it did some things wrong.  If you don't mind fanservice or harems and like a decent plot that has mystery, action, and romance elements to it, then this series is for you.\\n\\n\r\nOverall Score: (7.91/10)",
            "date": "2014-06-13T15:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 146885,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=146885"
        },
        {
            "content": "Note: This review assumes you have seen the first season and might include spoilers for that season. \r\nDate A Live II continues the exploits of Shidou to seal off the spirits with a kiss. This time around the stakes are even higher and the conquests more difficult.\r\nThere is a huge problem with Date A Live II and that is they changed the formula of the show. It used to be a decent comedy with really good action sequences and now it's more of a show with decent action sequences with overused comedy. On top of that the \"Date\" part of the show is gone. Doyou remember when Shidou took the girls in S1 out on dates? Doesn't happen in S2.\\n\\n\r\nTo be fair one of the reasons there are not really dates it the difficulty in the conquests themselves this time around are more akin to the difficulty the entire cast had against Kurumi back in S1. The first conquest are twins, Kaguya and Yuzuru. The former being a tsundere and the other one of those quiet types. The other girl is Miku, whose gimmick is that she really hates men.\\n\\n\r\nAs for the rest of the cast nothing really changes. They make returns, but you might be surprised which ones actually get some of the spotlight. That said none of them make any types of growth. For the most part most things stay the same. This includes Kotori where the ending of S1 kinda made you feel like there would be some big revelation in this season. There isn't. You'll also notice I didn't even talk about the new characters in any detail. That's because what I told you is essentially their entire character. They are just kind of boring. In S1 the characters were one-dimensional but entertaining. Here they are one-dimensional and boring.\\n\\n\r\nNow let's get to the main villain, or for that matter all the villains. Like last season they don't show up until near the end of the anime but they are handled even more poorly. They don't really explain their motives or why they have to do what they are doing in the first place. That or they are simply extremely shallow.\\n\\n\\n\r\nNow for some good things. The animation is really good and flashy.Action sequences are pretty crisp, despite not being interesting. The anime also makes great use of sound effects. From a production stand point it has a lot of the flash.\\n\\n\r\nI know I might have seemed some what hard on the show but in all honesty it's not a terrible anime, but it is a pretty significant step down from a show that was only pretty good to begin with.",
            "date": "2015-06-23T01:35:00+00:00",
            "helpful_count": 15,
            "mal_id": 190991,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=190991"
        },
        {
            "content": "The sequel to anime series Date A Live aired this spring known as Date A Live II and bought with funny moments, tragic moments and more spirits for Shido's harem while keeping the other cast members in it but are seen less than in the previous season.\r\nStory - 8\r\nThe story of Date A Live II focuses more on Shido defending himself and the spirits against the DEM rather than his attempts to 'capture/save' the sprits which does have a more dramatic and interesting story to the series but in the end it felt like to me it drifted away from Shido attempting to seal thespirits but don't get me wrong that is still in there and is something to look forward to but it isn't as heavily focused on in this series but kind of felt rushed to me as the season was only 10 episodes.\\n\\n\r\nSound - 9\\n\r\nThe opening to this season was similar to opening from the first which was good thing as I enjoyed both and was one those opening that I never skipped and watched every time, however the ending song was not as impressive and was skipped every time but then again I rarely listen to ending songs in anime.\\n\\n\r\nCharacters - 7\\n\r\nAll your favourite characters from the first season will make an appearance in this one except with less screen time except from Tohka who appears just as much as the MC Shido does; with these characters their is very little character development so don't expect much from them but their are a few new characters introduced that are more eye catching and have more development which includes more spirits and DEM.\\n\\n\r\nEnjoyment - 10\\n\r\nI enjoyed it but is not in my top 5 of 2014 but maybe the top 10.",
            "date": "2014-06-14T14:47:00+00:00",
            "helpful_count": 14,
            "mal_id": 147005,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=147005"
        },
        {
            "content": "Expecting Date A Live II to improve was probably too much. It’s obvious from the pictures that something here is going to go wrong. We already have enough goofy characters. We don’t need more. We want to see more of Tohka, Yoshino, Tokisaki and Reinne – all entertaining personalities that tend to light up any scene they’re in. Tokisaki wasn’t really defeated in the previous season, so there’s clearly more to do with her. Why add more?\r\nThe additions are not that bad, but they’re bad in a very predictable way. It starts with the twins. The problem they introduce is different enough, but just lookat them. The character design is sexy, but it’s more sexy than pretty. The previous Spirits’ design tried to tell us more about their character than to make them sexually appealing. Tokisaki is the only one with an actual sexy design, but in this case it’s part of her character.\\n\\n\r\nIt’s not like they’re completely empty shells. They are pretty entertaining in the scenes they’re in, and the conflict they’re in could lead to a very interesting relationship. You quickly forget that they’re dressed for an S&M club because their antics come from the same creative mind that gave us Yoshino’s wide-eyed fear and Tokisaki’s creepiness. Their fights are just as fun as anything in the previous season.\\n\\n\r\nSadly, there is not enough of that. We spend two episodes with the twins and some embarrassing fanservice. The previous season never had that amount. What happens in these episodes feels like it came from those shows that just want to push the envelope. It’s not funny and it’s out of place. The show still rolls along mostly without ecchi – you’d expect the camera to linger on Reinne when she appears in a bikini, but you barely have time to register there’s a teddy bear between her breasts. What was the point of those awkward scenes in the bedrooms?\\n\\n\r\nMiku is a little better. There is something slightly off-putting in her design. Maybe it’s because she looks like Coco from Mermaid Melody with a new paint job. Still, her character is interesting and she provides a good conflict. Once you get over the over-sexualizing, the new Spirits offer problems that are different enough than the previous to show the creators haven’t run of new ideas.\\n\\n\r\nIn fact, they have too many ideas. We have a new antagonist who is interesting until the climax. Jessica appears, which could help add some depth to the whole wing of the AST. Ellen, the Bad Guy’s sidekick occasionally looks like there is an interesting personality underneath that cool hair. There is even a school festival that slides smoothly to the plot instead of feeling tokenistic.\\n\\n\r\nIt doesn’t build to anything. The climax is the real weak point of the series.. The previous climax was also messy, but Tokisaki lead it. It felt unhinged, out of control and unique to the series. Somewhere around the eight episode, the series becomes one extended action scene Shido mows down a lot of mooks, but the real causalties are the personalities.\\n\\n\r\nSome characters are already halfway to gone before the finale. Kotori and Yoshino are barely there, which makes no sense. The few times Yoshino appears, struggling with understanding a soap opera are what made the original so fun. The climax finally kills them all. Kotori and Yoshino go AWOL. The twins are pushed to the back, almost as if they were never there. Jessica is thrown into the action scene with a conclusion that deserved a much better build-up. Origami is still an unnecessary part of the harem. Miku becomes a tsundere. Bad Guy reveals he’s bad because he’s bad and Mana is still just as useless.\\n\\n\r\nTohka is the only one who’s given some room to do things. Her clinginess to Shido is pretty annoying, but there’s enough of the fish-out-of-water antics that make her fun. She eventually becomes the center. If so, why introduce the new Spirits, if they’re just pushed to the back in the end?\\n\\n\r\nWhy is this so generic? What happened to the bravery? The series used to flinch at violence, to question whether it’s a legitimate method to solve problems. It was its whole charm. It forced the hero to interact with the ‘bad guys’. Violence is frowned upon. Now Shido mows down faceless soldiers like he’s Sylvester Stallone in a generic building. There aren’t even cool visuals to accompany it. He just swings his sword and people fall down.\\n\\n\r\nSpeaking of Shido, he hasn’t changed. He’s still boring and has no charisma. He’s still given a lot of situations that can be great for character development, and he does nothing with it. How can you even write such a dull character? Asimov isn’t exactly the master of creating human beings, but he gives the game pieces (In Asimov, there are no characters, just game pieces) some traits that make them recognizable. Shido is nothing but a plot-mover. The story is clearly about him. He’s the star of the climax this time, so make him worthwhile. Alas, everything he does is just for convenience.\\n\\n\r\nIt’s not a problem of length. 10 episodes is a little too short, but there was enough time that was better spent on other things. We didn’t need all these fanservice and the finale could have been a bit more exciting than just killing faceless people. There is still some fuel in this franchise. Most of the new ideas that were introduced are pretty good. The new Spirits are a worthwhile addition. This season does even less with everything, and the result is just a shopping list of cool ideas. The series doesn’t deserve this as a swan song, but I worry that feature developments will stay, will, undeveloped.\\n\\n\r\n2 dates out of 5",
            "date": "2015-06-22T10:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 190926,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4632480.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheBrainintheJar",
                "username": "TheBrainintheJar"
            },
            "url": "https://myanimelist.net/reviews.php?id=190926"
        },
        {
            "content": "My avatar says it at all who is my favourite girl in Date A Live franchise. But neither way, let's talk about the latest season of Date A Live, Date A Live II.\r\nSo Date A Live II just follows the story from the first season. This sequel adapts the Light Novel's Volume 5-7 that only lasted for 10 episodes so the story is pretty rushed. And also, the first episode itself was a filler so basically, if you hate Tohka, just skip it to the second episode.\r\nKeitarou Motonaga still directs this season. Notably known for directing Legend of the Galactic Heroes, School Days and more,he did a good job for directing this series although there are some failures and sorts.\\n\\n\r\nI'm not kidding if I'll say the quality of the animation in this season was terrible. Sure, the fanservice scenes was kinda good but the action scene was poor animated. The last 2 episode's animation really proves that AIC Plus+ is really short in budget. So in short, the art was mediocre.\\n\\n\r\nA good thing about this season is the sound. Pretty comparable to Sidonia no Kishi's sounds but the main point here is when there's an action scene, I felt that it was an action scene because of the OST. sweet ARMS returns to perform the OP song \"Trust in You\". Kaori Sadohara (who is an actual member of sweet ARMS) performs the ED theme \"Day to Story\" which is pretty good and a reliever of the show.\\n\\n\r\nIf you'll ask about the voice acting. The casts from the first season returned but I'll pinpoint Marina Inoue here voicing Tohka. I thought that she gave justice to develop Tohka's voice in this season, maturing her voice and her song performance beats up Minori Chihara songs. And going to Minori, voicing Miku Izayoi not fits for her. The truth is, I'm pretty hyped for her voice but it turns out that it lacks something. Maaya Uchida and Sarah Emi Bridcut did a good job voicing the Yamai twins. But overall, I don't have any complaints besides Miku's voice.\\n\\n\r\nLets go to the characters. Well, Shido took a level to become a baddass which is a good character development for him. But same old as in the first season. Still oblivious and acting like an hero wanting to save a Princess and only relies to Kotori's orders. Either way, his baddassness is pretty good.\\n\\n\r\nTohka returns as your naive but a sweet Princess which I think also developed too in a way that she tries to understands Shido and its actually good for her to be honest and rather became a supporting character rather than the main character. She too, took a level to become a baddass and Episode 6 and Episode 10 managed to make her shine.\\n\\n\r\nOrigami, Yoshino, Kotori and Kurumi just pushed to a side to become supporting characters. But if you love Kurumi, she will appear later so don't rage about it. The three new Spirits will not be spoiled for you but they are still, added to Shido's harem.\\n\\n\r\nOverall, a simple 'very good' is my enjoyment in this series. There are a lot of pros and cons but still, Date A Live II is a heck of a ride for its fans and viewers. Let's wait and see the OVA and the Movie.",
            "date": "2014-06-13T20:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 146911,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2640243.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SweetCoconut",
                "username": "SweetCoconut"
            },
            "url": "https://myanimelist.net/reviews.php?id=146911"
        },
        {
            "content": "The comedy and the fan service has just increased with this season\r\nDate A Live II follow volumes 5-7 of the light novels. The first half of the show deals with these competitive Yamai Sisters, Kaguya and Yuzuru, who were the same spirit until one day the two were split up into two. Now they compete with each other to prove that they are the real Yamai. They have had 99 matches (25-25-49) and there last competition is to see who can seduce Shido and he would be the deciding factor. The second half of the show is Shido trying to save a spirit called \"Diva\",Miku Izayoi, but the problem is that she is bias against males because she use to be a pop star who got caught up in a false scandal after refusing to sleep with a TV producer. She later lost her voice due to psychogenic aphonia and made contact with a sprit named \"Phantom\", the same spirit that gave Kotori her spirit powers, and regained her voice to sing again. Aside from the spirits there is a new threat called Deus Ex Machina (DEM) and I'm going to be honest I forgot what their goal was, but I think it's on the lines of world conquest or something like that.\\n\\n\r\nLet's talk about the Yamai sisters. Kaguya is very childish and has an outspoken personality. Yuzuru speaks very robot like by stating her response and then giving the actual response. Like if I said, \"The Giants won the World Series\". She would more or less say \"Confirmation. The Giants did win the World Series.\" Miku is not only a pop star, but also she is attracted to those of the same sex making her fall for Shidou would prove to be quite the challenge.\\n\\n\r\nThere is one joke that is set up at the beginning of the show where you could see coming a mile away and you know it's coming, but you just want to see the reactions of the characters.\\n\\n\r\nOnce again the animation is pretty good.\\n\\n\r\nThe one downfall is the increase in fan service. I really don't mind fan service in general, but when the show has more fan service than it's previous season it gets awkward.\\n\\n\r\nDate A Live II is still a very good show. This show is just a guilty pleasure for me and once again it's a show that I could just sit down and just enjoy it and not think is it as good as others say it is. So my grade for Date A Live II is 8/10.",
            "date": "2014-11-04T10:50:00+00:00",
            "helpful_count": 9,
            "mal_id": 167407,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3886845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Anthony_DiGrande",
                "username": "Anthony_DiGrande"
            },
            "url": "https://myanimelist.net/reviews.php?id=167407"
        },
        {
            "content": "Date A Live II has been an enjoyable anime for me to watch. This anime doesn't really live up to the high expectations it was given but nonetheless it was still a good anime\r\nStory - It is obviously about Shido trying to save more spirits but I felt like there was a clearer antagonist in the story. The story progressed well in a way but I feel a lot more work should had been put in this anime.  \r\nArt - The art is kinda different and I feel it has downgraded a notch. the only one I found with an improvement on this TobiichiOrigami\\n\\n\r\nSound - It sounded fine. No real complaints on the sound\\n\\n\r\nCharacter - The characters are great as the first season and you will see a few new characters.\\n\\n\r\nEnjoyment - I enjoyed Date A Live II a lot and I hope they will have a season 3 regardless of having a very low chance of having it, I still enjoyed it a lot.\\n\\n\r\nI know many people are hating on this anime for numerous reasons but give the second season of Date A Live II a shot. It may not live to the same enjoyment as its predecessor but It is a good anime and I hope you watch it.",
            "date": "2014-06-17T08:03:00+00:00",
            "helpful_count": 9,
            "mal_id": 147341,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3849563.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ahrisato",
                "username": "Ahrisato"
            },
            "url": "https://myanimelist.net/reviews.php?id=147341"
        },
        {
            "content": "This anime is one of the best (if not the best) i have watched so far that has gotten me so easily intrigued in the story. I have never seen anything quite like it and I've tried to look in a lot of places since i like this anime so much and can't wait for the new movie that is coming out.\r\nWARNING may contain spoilers:\r\nAlthough this season has had quite a lot less dates if any it still managed to add in some new spirits and have romantic scenes. In this season The main character Shido has gained powers from some of the spirits hehas sealed the powers from making it so that a season 3 could have a lot more action in it and get even more interesting than this one!",
            "date": "2015-07-29T11:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 194623,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4778532.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ThisIsLelouch",
                "username": "ThisIsLelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=194623"
        },
        {
            "content": "This is my first review, so please don't hurt me. Also, this is my second time writing this due to the face >.(then an arrow pointing to the left) causing everything after it to be erased after submitting. Apologies on rushing.\r\nThis anime needs justice, and it needs it now.\r\nStory (8):\r\nAlright, so many parts were rushed due to the anime being only 10 episodes. The first 2 or so episodes were, in my opinion, crap. After that, the anime really got its sh*t together. First off, consider all the genres this anime has. Don't expect it to \r\nhave extremely good plot like other anime that don'tfocus on the genres this does. Now that we got that out of the way, onto my actual thoughts.\\n\\n\r\nSometimes, I would stop and think \"is that it?\". I myself have never read the light novel or read the manga. The manga hasn't actually progressed past Shido talking to Tohka for the first time (I believe). So I can't really say that the story was great. Nonetheless, it really good for what it is. I can't delve too much on this without spiling anything, so I'll just have to say that it was excellent.\\n\\n\r\nArt (10):\\n\\n\r\nCan anyone really argue that the art isn't anything short of amazing? All the girls have their own special and unique design with lots of colors. Nothing to complain about here. The scenery is also beautifully designed and never boring. Oh, and did I mention the girls? They are just absolutely beautiful. I doubt many people would disagree on me with this. No character designs look alike (except for the Yamai sisters which doesn't count).\\n\\n\r\nI just love it, can't get enough of the beautiful art.\\n\\n\r\nSound (9):\\n\\n\r\nIt was nice to have Diva actually voiced by the singer Chihara Minori. Some may think her voice can be too high pitched, but I'm completely fine with that. She sang the OPs (and EDs?) of Horizon in the Middle of Nowhere. \\n\\n\r\nThe OP,in my opinion was great and memorable. I find myself listening to it from time to time. As for the ED, I don't have much to say about it since I'm not a fan of music with that kind of tune.\\n\\n\r\nThe background music is never out of place and can describe the scene well. It can set the mood for certain yanderes or a funny scene. \\n\\n\r\nCharacter (7):\\n\\n\r\nDon't get me wrong, I love the characters. But there just wasn't enough time to get enough airtime for all the characters.for example, the Uamai Twins didn't get much development and I was a little disappointed. If only it got 2 more episodes or they didn't mess around in the first episode, maybe, just maybe, the characters could've been developed on much better. Just my 2 cents on that topic.\\n\\n\r\nThe characters are very love able (Kurumi is the best girl!) and can just be soooooooo cute. Kurumi is just one of the most awesome characters (and OP) in this series.\\n\\n\r\nAlso, drum roll please, our protagonist (Shido) grew some balls! Ironically he grew them while cross-dressing but it was a glorious moment. Can't go much more on that topic to prevent spoilers.\\n\\n\r\nEnjoyment:\\n\\n\r\nI found myself watching episodes 4-10 in a single sitting. I just couldn't tell myself to not watch the next episode. The suspence would've killed me! I slept at 5 AM just to finish the anime!\\n\\n\r\n Sometimeswe forget that anime is all about entertainment, and whether we enjoy it or not is what determines if it was good or not. It'd be like giving a hentai a bad review solely because the story was crap. It's so we can enjoy it, no matter what flaws it had. \\n\\n\r\nYes, I didn't touch up on the flaws, and it is you to decide whether you absolutely can't watch this anime with those flaws. But for me, this is my review and I'm sticking to it. \\n\\n\\n\r\nDate a Live II, an excellent anime.\\n\\n\r\nThis is LolCaptain signing out.\\n\\n\\n\\n\r\n*please excuse the rushed review, it's 2 AM and I really need to start watching my anime.*\\n",
            "date": "2014-06-22T01:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 147983,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3732035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LolCaptain",
                "username": "LolCaptain"
            },
            "url": "https://myanimelist.net/reviews.php?id=147983"
        },
        {
            "content": "Don't read this if you want to read a short review or one with a lot of positive stuff in it, I will mainly write about what I didn't like and it became quite long. Since it was quite long, I also couldn't be bothered to read it again to check for grammar or redundant parts. This might be interesting to read if you wonder about the flaws of the show from the point of view of someone who actually enjoyed watching it overall.\r\nA fatal flaw of this show is that while it’s kind of like a harem series and the very idea of makinggirls fall in love with you, at least to some extent(since “date” is even in the title and going on dates and trying to make people fall for you is most of what this thing is about) means the ending should be one in which he’s married to everyone, right? He should get all, or at least most, of the girls that he’s seducing. That’s the very point here, that’s what this is about or should be about. It’s not a story where he should romantically fancy just one or two people and decide upon who he likes the most. That’s not the deal here, or at least it shouldn’t be. But all too often, harem stories are just fake garbage, sadly. I don’t care whether or not it’s realistic to keep several girls with different personalities, love them all somewhat equally and for them to be satisfied with the situation. No, of course it’s not realistic irl. That, however, doesn’t mean it’s not perfectly plausible in a fantasy story, especially when the plot is far weirder and riddled with holes and chaos than something like having several wives could ever be. \\n\\n\r\nMonogamy and polygamy and the romance stories born from those settings are very different and comparing them is just, excuse my language, retarded. In monogamy, it’s about deep love with a single partner, in polygamy, it’s more about an unified love between several people and the beautiful bond all of them build as they pretty much become one big family, more focus should be put on the balance between all of them than deep, individual love. When you make a story like this and it somehow seems more like many of these girls just love you as a friend rather than lover and you, the mc, doesn’t love anyone for real, it’s just irritating, very much so. Especially when he seems to zoom in on just one person much more than others, which quite obviously is the first spirit he seduced(seems there's a law where the first girl introduced=most important). Am I asking for too much? Well, perhaps. I just hate it when authors write up several love interests and give all of them pretty much equal yet differing charm while feeding us the “he’s going to end up with a harem” idea from the very start, but seems to fail following through with it. Well, if the mc himself was actually a very likeable character that wasn’t something of an incompetent playboy that just wants to have everything but give nothing and decide upon nothing, I wouldn’t have minded that much in the first place. Even if he made it clear that he would only love one person, that would still be good enough. It’s that he keeps on seducing people and there’s this mood going on where he can’t commit to anything whatsoever, be it polygamy or monogamy, that pisses me off the most here.\\n\\n\r\nThe anime/novel also takes itself too seriously at times. Bringing too much tragedy or drama into a story that has no potential to ever be a serious, good story with a solid plot. This is NOT a truly great story by any means of the word. I like the relationships in the story and the characters, the interactions are fairly nice, but the story is a huge mess and the attempt to introduce excessive drama and plot into something that shouldn’t have one just feels alien to me. It doesn’t do the novel/anime any good, it’s just a detriment. How could I ever take a story seriously and enjoy the drama when the settings and story is all over the place and, quite frankly, subpar with holes everywhere. Hell, just the simple fact that he can spend dozens of seconds TALKING OUT LOUD to the empty air while chatting with the people on the ship giving him instructions or that he can wait for at least a dozen seconds before giving a reply is ridiculous enough, the girls freeze up as if they’re truly from a game while waiting for his reply, but that’s far from the only cringeworthy and stupid thing going on, things like only girls being able to use any of the combat gear with no explanations as to why that is(what? is it powered by girl power? Breast milk? something somehow only female humans have? If you tell me some bullsh*t like that, I’ll punch you, it’s just stupid) another one of many, well, we don’t actually know anything about any powers in this anime, it’s just left at it being “Fantasy, magic, ‘nuff said” level. Not saying I didn’t find the story fairly enjoyable, I just feel like the author tries to grasp for things he’s not capable of ever grasping, at least not with the basic settings and the previous “story” we have been presented with in this novel/anime. \\n\\n\r\nLet’s be perfectly honest here, this setting isn’t that good and saying it was meant to be serious is just a giant joke in and of itself. Writing a serious story with good drama and even tragedy, horror or anything else, takes a lot more thinking than just writing a random comedy with some elements you like. If the story isn’t solid, it’s never going to be good if it’s supposed to be serious and if you want it to be ridiculous, even cringeworthy, silly and utterly childish at times, you can’t just randomly put in serious drama whenever you feel like it. It doesn’t work like that. Not saying comedy can’t be combined with drama and tragedy, good lord, it can. Just not this type of comedy that relies on things being absurd and the setting being sketchy at best. So, my tip to you is to skip the obviously serious parts, it’s very easy. It’s really not an anime that goes on for long enough even with both seasons for it to matter if you skipped all serious parts that didn’t interest you. I recommend not to skip kurumi’s scenes though.\\n\\n\r\nWell, let’s add one more complaint to the list. Like in season 1, the mc is still a giant pushover who screams “friendship” and “sacrifice myself” all the time. He’s essentially just a chatterbox that talks and talks with passionate speeches and more often than not, he’s screaming the names of the girls whenever something happens while being able to do nothing yet he’s constantly rushing headlong to his death as if he has some weird masochistic suicidal urges. He also shows no will to increase his powers whatsoever, he seems content being a pushover that can do nothing but push his ideals and petty feelings around, trying to force everyone to accept it, this is despite the fact that he obviously has supernatural powers that he can use and should be able to harness with training, but he doesn’t care, as if it would all just happen by itself(which it obviously will, I guess). \\n\\n\r\nI mean, he’s not the worst japanese mc of his type, but he’s sure as hell not a good one either. Going with the flow and selfishly trying to save everyone while giving zero considerations to his own limitations or life, nor any consideration towards the feelings of everyone who loves him, seems to be his special skills, he's certainly not a smart guy, he's pretty damn stupid and never uses his head for anything noteworthy. It’s as if he’s trying his damn hardest to prove to the viewers that he’s such a goodie-two-shoes that cares so much about everyone that he puts them above his own life, as if that’s a desirable trait(it’s not, proving that you're a good guy by acting like a suicidal retard is never a good way, it just shows he's a moron who has no grasp on his own abilities or situation). Well, I guess no japanese fantasy woman can resist falling in love with anyone who willingly sacrifices themselves for them… Oh, wait, we’ve seen that happen with other characters too(in other manga/anime/novels), them sacrificing themselves for love, sadly they get nothing but a grateful nod or a few tears even if they die, sucks to not be the mc who has special protagonist pheromones that enchants any woman in their proximity. It’s amazing, you know, it’s like an on/off button. As soon as he gets too close to them, they suddenly become completely enamoured with him, there’s no gradual love development, they either love him with all their heart or doesn’t think anything much of him, there’s no middle points.\\n\\n\r\nIt doesn’t get better when he’s also a fool and pushover when it comes to following up on his actions and romance in general, he doesn’t truly fall in love with anyone, yet he seduces them and like any other japanese mc in works like these, he seems perfectly content pretending to be ignorant and not answering to any character’s feelings despite knowing perfectly well they love him, doing his utmost to push aside any event where they try to confirm his feelings. Tsk, I don’t know about you, but I often want mcs like these to be kicked to death by a horse. Sure, they’re nice guys, but their personalities are infuriating when put into a mc. It’s one thing to have side characters that are eager to die and has no grasp on the situation while being indecisive and reluctant to move on with anything at all, but the main character? I don’t see how it’s ever a good idea unless it’s a comedy manga/novel/anime and he’s SUPPOSED to be a hopeless cretin. Sure, some people won’t agree with me, we all have different preferences, but I honestly detest idiots like this mc. However, luckily enough, he wasn’t actually THAT bad, he was just annoying at times. Most of the times my feelings for him were kind of neutral, he wasn’t that infuriating most of the time, maybe because comedy was the main focus of this show despite a third being serious. The girls easily balanced the show up as well, generally possessing vibrant personalities that offset the mc’s foolishness and shallow personality.\\n\\n\r\nI liked this story a lot, but going above 7/10 is just not possible, that’s me being generous because I truly did enjoy big parts of this anime thanks to its relationships and the characters, most of whom felt alive and truly likeable. It’s enjoyable, but it has massive flaws as well. Disregarding my pure enjoyment and judging it just from how I view the show overall, I’d say 5/10 for average would be a fair score. I might make it look like I actually hate this show, but I just don’t have that much positive to write about it other than liking most of the characters and their interactions along with the mood and pace of the show, writing up the negative parts is much easier because that’s what caught my attention the most. By the way, the comedy in this anime is so-so, I can see where it tries to be funny while often ending up as cringeworthy, but sometimes it does manage to tickle my funny bone. Had I been several years younger, I might’ve bust a gut laughing at it at times, but after being through around fifteen years of thousands of works, be it manga, anime or novels, japanese, chinese or korean, I’ve become numb to most stuff. Just like when you’ve seen a certain thing or heard a joke too many times, I just don’t find it that funny anymore and I find it very easy to find flaws that I didn't find when I was younger. Well, being numb to it doesn't make it impossible to realize if something would be funny for other people. If you’re a teenager or at least not that experienced when it comes to these things, I can probably assure you that this is going to be hilarious for you and a truly awesome anime in more ways than one, well, that is if you’re into some fair amount of fan service and silly jokes often regarding juvenile topics, like ones regarding out of place and surreal eroticism.\\n\\n\r\nThat's all, sorry for the long review, you can have a cookie if you actually read it all.",
            "date": "2018-10-10T18:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 291447,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=291447"
        },
        {
            "content": "A good sequel to the first season.\r\nDAL II was alright compared to the first season, however did not measure up to the high bar that the first season set up for it. The soundtrack was great and both the first and second season's opening complimented each other greatly. The art stayed the same as the first season, which was fine, but could have done better as many other anime of that season had good art as well. The adaptation also could have done better as the second season only had enough time to spend on 2 girls / major arcs.\r\nI would only reccommend this animeif you enjoyed the first season. If the first season was an eh to you, then this anime should be considered but not prioritized.",
            "date": "2016-06-19T21:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 221257,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5488856.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inorichi",
                "username": "Inorichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=221257"
        },
        {
            "content": "**THIS REVIEW CONTAINS SPOILERS FROM SEASON 1, AND MINOR SPOILERS FROM SEASON 2**\r\n*Disclaimer: The review contains heavy language and imagery; not written for pure-hearted.*\r\nHave you ever been told to just \"shut your brain off and enjoy it for what it is\"? If you have been, then you must feel like you're probably missing out on something otherworldly, something you can't quite understand. Date A Live is, in short, a figurative abomination and requires aforementioned brain shutdown sequence to even get the slightest inkling of enjoyment. I entered searching for a quick time-killing fantasy action anime with some cute waifus & some harem, and I leftliterally feeling empty inside. There's nothing. All the cynicism I've been harboring inside my heart has been purged within 22 episodes. I have nothing unique to offer to the world anymore - except this review. \\n\\n\r\n*NOTE: This review encompasses both seasons, as well as the overall rating of two* \\n\\n\r\nShows like Evangelion, SeL, TLOGH, etc., are often put in that category of \"if you didn't like them, you didn't understand them\". I think Date A Live deserves a spot in that bubble, to be honest. I'm a firm believer that there's nothing in this world we can't understand, as long as we give it enough time and research. Yet, this show alone has broken me, has changed my very views on storytelling. This has got to be the biggest pile of massive shit the writer has ever taken on my brain since the inception of mankind. I've read hundreds of books, hundreds of fan-fiction short stories, watched hundreds of movies, TV shows & anime, and never once in my entire life did I want to put a massive fucking nuclear bomb between writer's eyes and then piss on his/hers corpse with all my might. This is a disgrace to writing. No, scratch that. This is the end of storytelling - this thing, right here. It has warranted the title of 'The Death of Storytelling' for being the biggest shitstorm in the history of mankind. \\n\\n\r\nI can overlook plotholes, I can overlook deus-ex machinas, I can overlook bullshit thrown in our faces for the sake of drama/comedy/horror, but this thing here goes beyond that. At this moment I'm angry with MAL because I'm unable to grade the \"story\" of this thing below zero, below the levels of sanity and any conceivable comprehension. Whoever wrote this thing, I beg you, kill yourself. I fucking beg you. If you want to, I'll kill myself with you so we can both leave this world. You don't deserve neither a pen nor a keyboard ever put in your hands. You are stupider than the main girl from Aho-girl. You reached levels that even the lowest of bacterial forms have surpassed millions of years ago. Yes, that's how bad the \"story\" is. It's as if you put the story of High School DxD on acid, heroin, cocaine, crocodile, massive doses of lithium, xanax, and virtually every conceivable drug in the universe, and then took a huge steaming dump all over it, and created this. This. Fuck this to the damning hell. Burn it. Burn it before it breeds. This is the lowest level of storytelling I have ever witnessed in my entire life. 50 shades of grey seems like a masterpiece now. Twilight is the 21st ct Shakespeare. End this. Bye. I'm not even going to bother jotting down the things I found to be abhorrent; if you didn't catch them yourself, or if you consider this to be a good story, you're as good as dead to me.\\n\\n\r\nArt & sound, for the first time in my life, are the only reason I was able to finish something - and you know what? I hate myself for it. I should have dropped this in the 4th episode of the 1st season and never looked back, but I always thought it'd get better. For the most part, animation is stiff and average, and even during some of the major battles I wouldn't expect much. It's colorful, yes, but it's nothing mind-blowing to be honest. It has some decent animation here and there, and I hate myself for giving props to this anime for any department, but I have to. \\n\r\nMusic is sparse, but some of it that's in there is quite good. There are 2 tracks that I still remember, and were the high point of this anime. Then why 4 to sound? Because of everything else. Sound effects were terrible, voice acting was near-unbearable, reaching dub-levels, and that randomly-thrown pop song by the end of the 2nd season sealed it for me. I'm done. \\n\\n\r\nNow we come to the characters. The only reason I gave 2 here is because I couldn't, in my right mind, even them out with the story, because they're not that bad - mind you, they're still dreadful, just not as bad as the story. Our main character is every harem lead in the history of everything, with 0 deviation from the norm. Why do these girls like him? Because they're fucking insane and mentally challenged, that's why. There's no other reason to like him. If girls fell in love with the first guy that told them \"I'll save you\" and \"I'll never reject you\", every low-life would have a girlfriend. This character gets no development for 22 episodes, nill, nothing. He's ever-shouting piece of plank that pathetic fuckers can \"relate to\" and \"immerse themselves with\" and he has no other purpose. You can literally switch him out with any generic harem lead and nothing would change. Abso-fucking-lutely nothing. \\n\\n\r\nOoh, you think other characters are better? Think again my friend. Have you ever watched harem anime? You must have. Everyone has. It's the most widespread genre in anime. So, if you did, you'll have recognized these girls the moment they appear on the screen. Why? Because all of these are by-the-book harem girls you've seen about a fucking bajlitionth time before, and if you aren't tired of them by now, then Lord Spaghetti help you. Energetic, shy, calm, weird, imouto, 2nd imouto because 1 wasn't enough, all these things may just as well be replaced by other things from other harems. There's so little development in this anime, that evolution of mankind was faster. You might say that every girl \"develops\" because at first they \"hate him\" and then they \"love him\". You know what? Fuck you. That's not development you uneducated ape. Go back to school. \\n\\n\r\nI've never seen such generic, insane and demeaning cast in any anime I've ever watched. No, not even Sky Wizards Academy (which is still worse, by the way, only because it has worse animation; rest is pretty much on par, I'd argue even better in certain places). Relinquish in this feast of stupidity and insanity, relinquish and join me in madness, for that is the only place the poor ones who've watched this belong. \\n\\n\r\nBelieve it or not, I gave season one 5. Why? Because it was, by all means, your average harem. It had some decent action, at times it was funny, and I didn't feel like I was marathoning LoTR Director's Cut Edition each time I watched an episode. First season felt like a set-up, kind of like HS DxD, and I was fine with that. Yet, second season tried to be more than it already is and, well, you already know the result. I hope to every manmade spiritual thingy that this thing never gets any more seasons. I feel sorry for animators who had to animate this. I feel sorry for everyone even remotely involved with this outside of the writer. I feel sorry for TV stations that had to air this. I feel sorry for new anime viewers who know nothing better. Ugh ... I'm done. \\n\\n\r\nThis is abomination. End. Disgrace. Everything that's supposed to be the backbone to a creation is instead a rotten piece of shit, born only to pollute the innocent minds. Fuck. This.",
            "date": "2015-12-10T12:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 205191,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=205191"
        },
        {
            "content": "This was actually a very disappointing series, especially after all the buildup from the first season. First thing that struck me was the change in art, which, for me, was very unwelcoming. The opening soundtrack was, undeniably very good (as expected from SWEET arms), and the closing wasn't bad either. \r\nThe second season was meant to be the general plot development season, however, the studio was too disorganized and couldn't notice that it was beyond their budget. They had to kill the story off right when the main plot twist was meant to happen and they spent too little time developing and concentrating on thedifferent characters, I read the light novel, and most of the details were left out.\\n\\n\r\nI heard that the studio is going to make a movie to finish it off, so if you ask me, just save this season for when the movie comes out.",
            "date": "2014-08-20T19:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 157333,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3777447.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JasonBFleece",
                "username": "JasonBFleece"
            },
            "url": "https://myanimelist.net/reviews.php?id=157333"
        },
        {
            "content": "Love is Strong\r\nStory 6:\r\nA Date to save the world? \r\nA man has so much power that he can seal the spirits powers by a kiss. \r\nArt 6:\r\nNothing special here, but the fan service was great lol\r\nSound 6: \r\nThe same tracks were played throughout each episode.\r\nCharacter 6:\r\nThey were cute and the fan service was great as I was saying before. \r\nThe twin scene at the bench, thats where it was at.\r\nEnjoyment 6:\r\nI didn't have that feeling where... I wanted to watch the next episode? \r\nIt was okay wasn't like I had to watch the other episode.  \r\nOverall 6:\r\nIt was okay better than the first seasonIMO\\n",
            "date": "2017-11-22T18:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 263781,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879361.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BCxER80",
                "username": "BCxER80"
            },
            "url": "https://myanimelist.net/reviews.php?id=263781"
        }
    ],
    [
        {
            "content": "A series based on dating. Date a Live wastes no time adapting this concept by having Shido Itsuka date various girls/spirits, earn their feelings, and kiss them to seal the deal. As a harem show, you’d expect all the girls drooling over him. While that’s partially right, it also adds additional elements because those so-called girls aren’t actually normal as part of society. Instead, they are spirits, born with supernatural powers who are viewed as a threat to their world. Date a Live II continues directly after the events for season 1. It continues to mush around its formulation of dating and turns it intosome gimmicky show – dating becoming the solution to save the world.\\n\\n\r\nBased off the light novels written by Koishi Tachibana, one noticeable attribute to this adaption is the shortened length. Rather than a full one cour show (the typical 12-13 episodes), this sequel only focuses on 10 episodes adapting volumes 5-7. The main concern is rush and this should be expected. I confess to myself that the sequel is disappointing when it comes to adapting faithful material. The show decides to omit various parts to get more time for the main actors and actresses. In this case, it’s the spirits. After all, Date a Live II is a stardom for some new characters such as a pair of twins, new AST (Anti-Spirit Team) members, and even a rising idol. The catch is that some of the focus on other character are scrapped to replace their stardom.\\n\\n\r\nThe sequel is essentially divided into two halves although the first arc has slightly less material than the second. Still, Shidou remains the focus of the show as the bachelor as he tries to save spirits and the world. The first episode has mostly anime original material but this comes off as disappointing. There’s harem antics thrown in your face fused with a whirlwind of misunderstandings. To make matters worse, the show decides to add elements from classic soap operas to appeal to these misunderstandings to somehow make them more amusing. And this comes out as dishonest as Tohka falls for every single scenario she feasts her eyes on. Neither does the initial set up show any improvement with other characters as they still want to get into Shido’s pants such as Origami. On the other hand, Shido himself has become more confident. He finds adjustment to his new lifestyle now that Tohka, Yoshino, and Kotori are living together. His relationship with these girls/spirits almost feels like a family as they give him the same pleasure as he gives them. And while the show is still regarded as a harem, the feelings the characters show are more honest and innocent especially in the case for Tohka.\\n\\n\r\nComedy is indulged in this series with some welcoming aspects. While a lot of it seems repetitive, there are also other more refreshing parts such as a little gender bender not previously seen from season 1. The characters behave the way they should be with various personalities. Origami for instance is still her usual self and tries every single moment to get close to Shidou using some questionable yet amusing methods. Then, there’s the classic Date a Live gimmick: the multiple choice. While it is featured once again as a strategy to deal with runaway spirits, it has less prominence with some of the questions lacking flavor. Yet, it isn’t really what’s being asked that shows the humor but rather Shido’s way of responding.  It flirts with the idea of how Shido pretends to get attention of the spirits while methodically see how they react to them. While it makes its point effectively, it still falls under the wish fulfillment and generic tropes. By this time though, it should probably be something the audience should expect from Date a Live. Emphasis on the date.\\n\\n\r\nDirector Keitaro Motonaga crafts his ideas from behind the scenes. Known for some of other series in the harem genre such as Akane Iro ni Somaru Saka, Majikoi - Oh! Samurai Girls, and the first season of Date a Live, one might question the direction of this sequel. This can come as a hit or miss especially for fans who are familiar with the material, specifically from the light novels. As mentioned before, the pacing suffers with certain elements omitted whether it would be part of the plot, humorous gags, or even character cameos. But an important factor to take notice of is the way characters are depicted. For instance, while the Yamai twins retain their personalities, the focus on them seems to be shortened with other characters. Even though Shido is the main protagonist, the subtle relationships he develops with the spirits can feel crude and stereotypical. It doesn’t even attempt to hide itself whether it’s be the fan service (such as the classic beach episode) or the seductive poses characters throw into Shido’s face. In essence, Date a Live makes the show looks itself more like a mission, to accomplish a purpose and move on. This at least applies to most of the supporting characters in the form of conquests for Shido. It doesn’t necessary develop his character or even express his personification in any ample way. \\n\\n\r\nBut for someone like Shido, responsibility becomes part of his life. When there’s trouble, he needs to be prepared. While the first arc didn’t give Shido’s impression of this, the latter half sees an improvement with his strategies. He isn’t just more confident but also fights for beyond the scope of the mission. In retrospect, he becomes more mature and takes his job more seriously with even some admiration to see how far he goes when trying to save a friend. After all, the spirits gets stronger and his life becomes more in jeopardy. For the spirits, they offer diversity. We see a sharp contrast in their persona when comparing the first and second half of the story. Shido has to respond accordingly and think outside the box in order to prevail. He does get a little bit of help though from an unlikely ally, and one that fans adore from the first season with her yandere tendencies. \\n\\n\r\nTaking in the account of action, the show doesn’t cease to make this its way whether it’s aerial battles, ground level warfare, or even a battle of psychological integrity. Shido finds himself in moments of despair and desperation as events become more jeopardizing to peace. Even Kotori finds herself outmatched in some circumstances. And with new characters introduced such as Sir Issac and Ellen from the DEM industries (a military corporation for developing mecha units), you can expect a bit of clash of egos. Not only has that but characters such as Origami also found herself on the edge and in trouble throughout the season as she battles against her adversaries. Despite the mecha gears looking more suggestive though, there is credibility to the action with high caliber weapons in operation, superhuman maneuvers courtesy of the spirits, and even Shido’s risky moves. \\n\\n\r\nAs the majority of the cast returns to the sequel, you should be familiarized already with their personalities. Unfortunately, their development lacks in terms of characterization as the show focuses more on sealing the spirits and less so when Shido isn’t on dates.  Furthermore, the fan service never ceases as the first arc is saturated with ecchi. But again, this is Date a Live we’re talking about a – franchise that pokes at fun the concept of dating to add its own ‘save the world while you get to date girls’ trite. \\n\\n\r\nArtwork remains generally the same as characters returning from the first season hardly goes undergoes any significant physical changes. In other words, it still remains generic as hardly anything stands out with Shido’s character design. On the other hand, the new spirits such as the Yamai twins and the idol Miku has some attractive figures. Background visuals remains stale although more lively and natural when the series takes on a beach setting. But remember that fan service never ceases whether it’s be the traditional swimsuits or the libidinous camera angles. It doesn’t cease to hide the teasing either and tires honestly to appease itself with stupidity. There are some cute moments though and decorative outfits in particular with the show’s second half that is more colorful. But overall, it’s still lacking.\\n\\n\r\nAlthough soundtrack isn’t a powerhouse, it does improve more in this sequel whether it’d be the action scenes or emotional scenarios. The bittersweet moments are focused more intensely to bring out some credibility to character relationships. Some of the dialogues may also seem cheesy but offer humor with their speech mannerisms (i.e. the contrasting tones of the Yamai twins). On the other hand, Miku’s voice feels egoistic, lacks serenity, and in general aspect sounds like a spoiled brat with annoying tones. The song she sings aren’t attractive either with her soft but squeaking style. Thankfully, the OP and ED songs has more features that makes the franchise what it is.\\n\\n\r\n10 episodes and that’s how Date a Live II decides to adapt the second season. The disappointment of story development in terms of a more accurate adaptation puts a stain on this show. At the same time, the fan service is like a bed bug that infests itself at any opportunity it has the chance. The first half of the season focuses on this exclusively with the twins while the second part tries out a little different with a bit of gender bender. But still, the comedy can be pleasant if you’re into the show’s gimmicks. The characters also offers something new; contrasting greatly between the two arcs but still refreshing. There’s even a favorable character that makes her ultimate return with great anticipation. But if you’re anticipating to watch this sequel, just be ready for another journey of dating sim and shenanigans. \\n",
            "date": "2014-06-13T11:30:00+00:00",
            "helpful_count": 133,
            "mal_id": 146871,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=146871"
        },
        {
            "content": "Updated: 13, July 2016\r\nOnce again, the momentum of an ambitious premiere is carried straight into a brick wall. Although I reserved my expectations heading into this sequel, I certainly anticipated more than ten episodes of a disgrace. Date A Live II strayed away from the merits which put its prequel on the map, such as the charms of the vivacious heroines or remarkable humor tied to a spectrum of dating simulation choices. It was only yesterday that an udon shop launched an eventful assault on the core group (en route to a local hot spring). It was only yesterday that Shidou matched wits and fistsagainst true adversity, juggling a batch of pressing demands with everything on the line. It was only yesterday that players were ripe with presence and not confined to restrictions of a dismal cause.\\n\\n\r\nWhile Date A Live's strengths permeated well through a lively bunch headlining season one, there was no vibrancy to replicate that success in this second act. The Berserk twins were pure lighter fluid to one of the most staggering time sinks I have witnessed in this genre. Was it really too much to ask for with yin-yang personalities serving no purpose other than to get Shidou hot? And as for the Diva, I hated to see her unique sexual preference and tastes overshadowed by her foully variable and one-dimensional personality.\\n\\n\r\nThe premise for this sequel was collectively lacking in soul and impact. Most of, if not all the battles, were saturated with cheap chatter among combatants stirred together with a high concentration of pretentious drama. The most obvious misunderstandings were blown well out of proportion while new rivals and antagonist powerhouses seemingly made their appearances out of thin air. The more easygoing school events and concerts did little to support the effort or lighten the atmosphere.\\n\\n\r\nIt would be great if the upcoming movies, OVAs, and/or TV sequels can rebound and inject Live-liness back into this series. Nonetheless, the signature trademark of the glasses schoolgirl accurately sums up this installment. It really was that lame!",
            "date": "2014-06-17T04:02:00+00:00",
            "helpful_count": 101,
            "mal_id": 147331,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1123783.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/StyleF1re",
                "username": "StyleF1re"
            },
            "url": "https://myanimelist.net/reviews.php?id=147331"
        },
        {
            "content": "Still new at reviews but here I go.   Date A Live 2, continues the story about Shido, who is a boy who has the ability to seal spirits, thus preventing them from doing large-scale damage, through dating them and eventually kissing them.  In this second season, the story is slow to start, but it introduces the Twins spirits and the Diva spirit, along with an inverse version of an earlier spirit (no spoilers here lol). \r\nI enjoyed Date A Live because of the unusualness of the plot.  I mean, I haven't heard of a show where a person dates someone, andthen kisses them to seal their powers before, so of course it had my interest.  Season 2 has been a disappointment for the first few episodes, but finally it has gotten back to what it was known for, which is spirits fighting, mecha suit girls fighting, dates occurring, and other things of the sort.  The art style of the show is nice because it keeps things light-hearted and not too deep, although there are a few sad moments in the show, but those few moments, are kept short and are many of the times, resolved.\\n\\n\r\nSound wise, the music is great.  It's not 10/10 masterpiece by any standards, but its fitting and just sounds great, especially the opening theme.  The characters are easy to remember special in there own way.   Between the twin spirits, the Diva, Shido, the other spirits, etc. they are all memorable and in my opinion, likeable.  Personally, I like Kurumi because of her craziness and time control ability, but they each have their own little niche that they fill in character development.\\n\\n\r\nAs I said before, the story is unique in it's own respects, and I've enjoyed it, even though this season was much slower at starting than the previous one.  Since the show has picked up the pace and has shown more action, I've enjoyed it more and more, although when comparing this to the light novel, the anime is flying through the story, much faster than the LN ever did.  To some, this is an issue, while for others, it helps to cut the small details and get the main story.  I'm split on this but the LN is a good reads.\\n\\n\r\nAll in all, if you liked Date A Live, then you will like this but just hang in there if you think that it is slow.  This season was largely about introducing new characters and revealing new things about older characters.   If you haven't watched DAL and think that this show is weird, bad, confusing, etc. then give DAL a shot first",
            "date": "2014-06-02T06:21:00+00:00",
            "helpful_count": 83,
            "mal_id": 145509,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666651.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/LawfulEngineer",
                "username": "LawfulEngineer"
            },
            "url": "https://myanimelist.net/reviews.php?id=145509"
        },
        {
            "content": "There comes a time while watching anime where you get this kind of 'itch' that can only be scratched by a very specific genre of show, for some people this itch could be an over-the-top action show like Black Lagoon. for others it could be a good mind-fuck show like Serial Experiments Lain or Evangelion. But for me and my easily-satisfied outlook on anime, this 'itch' is most commonly a dumb harem show with beautiful girls and a dash of action! So when I found out that one of my favourite harem was getting a sequel? Well that was all gravy for me!\r\nStory - 7/10:\r\nI'vegot to be honest, the story really isn't the strongest part of this show; which is pretty standard for the genre its from. It continues from shortly after where the first season left off, Shido is still the Spirit Pimp, Tohka is still annoying and the rest are just...there.\\n\r\nThe second season covers roughly volumes 5-7 of the Light Novel which means the introduction of two new Spirit types; the Hurricane Twins, Yuzuru and Kaguya Yamai and the Diva AKA Miku Izayoi. Of course the formula of 'Kiss the girl, save the world' doesn't change, but the story managed to break away from the formulaic first season thanks to the personalities of the two new additions.\\n\\n\r\nArt - 5-8/10:\\n\r\nI had to look this up to see if it was actually a Gonzo show because the art and animation varies so much its unbelievable, the first episode looked awful in regards to art style and the character styles in the OP urked me to the point i skipped it, i mean, what the hell was up with Kurumi? Nevermind. It seemed they focused their budget solely on the second half of the series once the new spirits where introduced and we could get into the real meat of the story. The fight scenes looked absolutely stunning with the wide range of colours creating some of the most satisfying and complimenting action scenes i have ever witnessed in a harem show (or is that not saying much? I don't know) however in the less interesting parts of the show they pulled an Evangelion and skimped wherever they could during scenes of dialogue. Another part that annoyed me was the lack of quality during Miku's live performances where her mouth wouldn't even come close to matching the sync of the song being played, its not that much of a problem as the song's themselves were amazing, but it was noticeable enough for me to mention it here.\\n\\n\r\nSound - 9/10:\\n\r\nAs a Japanese speaker myself, i can openly and happily say this dub was pretty strong, Kurumi's voice actress was brilliant at nailing her slightly Psychotic yet simultaneously adorable personality, where she could switch between the two on a whim. The OP sounded beautiful despite somewhat cheesy lyrics and the ED was also pretty strong if albeit containing nothing particularly noteworthy to mention. Miku's songs made specifically for this season were a nice treat as her final song in episode 10 was one of the best songs i've heard from within an anime show.\\n\\n\r\nCharacter - 7/10:\\n\r\nThe biggest strength and biggest problem of this show was the characters; the one's who got a lot of screen time were developed nicely despite the shortage of episodes, Miku's tsundere personality and view on men was a whole was a nice touch and amusing thing to watch considering what Shido must do to seal her powers. The Yamai twins were also great, with one having an unmoved, somewhat 'Rei ayanami/Yuki Nagato' personality- often submissive but very calm and collected, contrasting to her abnoxious and loud twin sister who is often very reckless.\\n\r\nThe characters who weren't developed at all or any further, however, was a HUGE problem for me. The most abvious lack of development was that of the character 'Jessica' who's motives and ambitions would have completely gone over my head if i hadn't already read the Light Novels, she was so poorly developed that i was becoming rather impatient that she was still a 'thing' almost 4 episodes after she was introduced. Another example of poor development was that of the fan-favourite loli, Yoshino, who spent the entire first half of the season at home, irrelevant, watching TV dramas that just so happen to either match the situation going on with the other characters or predicted the future. Finally, the antagonist of the story, Westcott, was also poorly developed, but considering he is probably going to be the antagonist of the recently-announced Date A Live movie, i can kind of forgive it and respect that they didn't rush him.\\n\\n\r\nEnjoyment - 8/10:\\n\r\nI consider a Date A Live franchise as one of my guilty pleasures, i'm aware that there's nothing really special to make me want to watch it, but I watch it anyway because its just pure mindless fun. The second season doesn't necessarily to as good a job as the first season but that all depends on what you expected from this show in the first place, at the time i watched this, i wasn't in the mood for anything thought-provoking and it was there to satisfy me. The character arcs were incredibly fun to watch, throwing in new twists to the typical 'win them over and kiss them' formula that was rather refreshing and i respect Tachibana-san (the mangaka) for not rehashing the same archetypes over and over again. the ending was slightly rushed but that's what I expected after the plot twist in episode 9 so its not really affected me - especially knowing more is to come.\\n\\n\r\nOverall - 7/10:\\n\r\nIt wasn't a clean-cut show, in fact its pacing and execution of the arcs were poor, however, like every harem, its the characters that matter; the characters that you can really get behind and root for and the second season did the job well for the ones it did bother to develop. The music and voice-acting was on point and the story was above average for the genre its from if albeit a little too ambitious and convoluted for a 10 episode series, the show does indeed scratch the itch of a dumb fun show, and really, what more could you ask from it?",
            "date": "2014-06-13T15:21:00+00:00",
            "helpful_count": 73,
            "mal_id": 146887,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3041927.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LeikoHaran",
                "username": "LeikoHaran"
            },
            "url": "https://myanimelist.net/reviews.php?id=146887"
        },
        {
            "content": "Ok, where do I start with this massive disappointment. I'll start off with saying that I loved the first Date-A-Live anime and I do not consider myself the biggest fan of this series and I have not read the light novels but this sequel was so disappointing. If this sequel follows the light novel exactly then good job but this sequel pales so much in comparison to the first one because nothing new happens! Date-A-Live II feels like an exact copy and paste of what happened in the last anime but with new spirits. Yes I know it is a sequel or second season tobe more exact, but shouldn't sequels and especially second seasons be exploring the mysteries that the previous left behind? I'm going to stop ranting and get into the review.\\n\\n\r\nStory: 3\\n\r\n The story is exactly the same, but only with the introduction of new spirits and our previous spirits are living peacefully with Shido until the bad guys mess everything up. (I'm assuming everybody that is reading this has either heard the gist of the story in the last anime or has watched this series) I understand this is a second season so it should be similar in terms of story but this is almost an exact copy of the previous story. Now is the story bad, not exactly. This is a parody series so don't expect a great story and I honestly like the twist of instead of fighting the spirits, you date them. But it's the fact that  they did not do anything new other than introduce some new spirits that become pointless in the end. They could have focused more on the origins of the spirits or Shido's power, but instead we get the exact same thing as last time. I'm not sure if I made my point clear or not but I'm moving on. \\n\\n\r\nArt: 7\\n\r\nOne thing that is good about this series is the art. It has not changed too much from the first anime and I do like the fact it has not changed a lot because I really like the art. The colors are bright and vibrant yet dark and malevolent when need be. The characters are well drawn, and the battles are still amazing. Edit: I have just re-watched an episode and I noticed that the character designs do change slightly when shifting from different scenes for whatever, but not all the time. But still very annoying. I have bumped the score down to a 7 from an 8\\n\\n\r\nSound: 7\\n\r\nThe sound isn't too great. I loved the OP, it was very catchy but that's just my opinion. The ED was decent, it has been a while since I watched it so I can't remember the song but I do remember skipping the ED song so I personally didn't like it. As for the insert songs, nothing stood out but everything felt like it belonged, again it has been a while since I watched this so I may be wrong.\\n\\n\r\nCharacter: 6\\n\r\nI would give this score lower if only it was based only on the new characters introduced, but the old ones do appear quite frequently (I did like the previous spirits better but I do find Tohka and Tobiichi quite annoying at times) The new spirits that appear are the twins: Yuzuru and Kaguya both controlling the power of winds. I do like these two but I felt like there introduction and getting them into the harem took way too long. And finally we have the new spirit Miku. Just like Hatsune Miku her power is her voice, most notably singing. (Coincidence, I think not) As for her character, I found her very annoying and made me want to drop this series. And there is some noticeable change  within our main Hero and Heroine Shido and Tohka. Shido for some reason gets a huge power spike out of nowhere, it is implied that it comes from his power to seal spirits but we learn nothing of that, and Tohka becomes very clingy to Shido, and she was already pretty clingy before but it felt like it has been toned up a bit. Not to mention the fact that she seems very useless, as in weak for no apparent reason and now needs to depend on Shido for everything unlike before when she could haul ass and only need Shido for food. Back on track, new characters were okay, Tohka for some reason becomes very weak and Shido becomes overpowered. In short character related stuff was okay but could have been better. Oh yeah, and the new villains are cool but needs more explanation behind what they are doing and why they are doing it.\\n\\n\r\nEnjoyment: 5\\n\r\nThe copy and paste story was okay when I first started watching this, because I liked how it hasn't changed but became annoyed when I realized I am watching almost the exact same thing as last time. I know what I said was a bit contradictory but my underlying point is that I don't like watching the exact same thing especially when a sequel repeats what happens before just with different characters. Another thing I did not like about this is how many times they reused the jokes from the first season. The jokes were funny at first but they used it too many times that it just got annoying.  I do like how this season there was an actual villain, but the villains motive was never explained well. In short, this had a good start but lost momentum as it progressed.\\n\\n\r\nOverall: 6\\n\r\nWith a copy and paste story, boring spirits compared to the first season and a plot that loses steam as it progressed, it's surprising how it gets a 6 in my book. Well with the previous spirits occasionally making appearances, especially Kurumi (my favorite spirit) who plays a big roll in the final battle, good animation and a really catchy opening saves it from complete disaster. Also it was only 10 episode, thank god for that.\\n",
            "date": "2014-10-29T18:03:00+00:00",
            "helpful_count": 19,
            "mal_id": 166723,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2111431.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ryuu9876541",
                "username": "ryuu9876541"
            },
            "url": "https://myanimelist.net/reviews.php?id=166723"
        },
        {
            "content": "This is hard for me because I am a fan of the Date A Live light novel series. It really is hard. Date A Live II was the planned second season of Date A Live and it covers Light Novel volumes 5, 6, and 7. It was only 10 episodes long which in itself was already disappointing before the series even started. The story for Date A Live is silly. Even in the first season there isn't much, but it's much better than what we saw here in this second one. \r\nDate A Live II starts the season with filler which was a disaster sincethere were only 10 episodes and the episode itself is dreadful. It then proceeds to stumble all over itself for the next few episodes and never really gets going. The 5th volume was done fairly well, but it was just boring. 6 was terrible, and 7 was good. \\n\\n\\n\r\nOverall I can't say much about the story, but it's just dry. It lacks any punch and there is no driven plot until late in the series. I'll give it a 6/10 because though the last arc is predictable it offers some enjoyment. \\n\\n\r\nThe real problem here is the art and animation. I don't know where to begin. Date A Live season 1 had some of the best animation of any show of 2013; meanwhile, this series doesn't have any place in 2014. The mistakes in animation are just ghastly. There is no budget for this series at all . It looks terrible and that is very sad considering the tsunako designed characters are very appealing and easy on the eyes. To not be able to capture this was just sad and ruined the entire season for me. I can't go over 2/10 for art. \\n\\n\r\nThe sound is pretty good and soundtrack once again is pretty decent, but the use of music is extremely questionable. There are sometimes completely silent battles and it does not make sense. 7/10 for sound. \\n\\n\r\nNow in this season we meet a lot of a new characters, and I can't say you feel any attachment to any of them. Instead of building on what we already had in season 1 which was fairly likeable, most girls are barely even seen in favor of mediocre characters and bland plot lines. It's just not well done at all. 4/10 for character. \\n\\n\r\nOverall I didn't enjoy DAL II. It was one of those things that was just bad. And it's disappointing because I am a huge fan of the light novel series and the whole DAL franchise, and I love the story, but this was just done horribly. I couldn't believe it myself and I am extremely disappointed. 4/10 for enjoyment and an overall score of 5/10. \\n\\n\\n\r\nDate A Live II fails to capture the same feelings of Date A Live season 1 and loses it's own identity. It gets lost in a sea of mediocrity and just when it begins to try to pick itself up it ends. A regretfully poor experience. I just wish it had been better.",
            "date": "2014-06-13T18:15:00+00:00",
            "helpful_count": 18,
            "mal_id": 146901,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 2,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/MasiTronXIII",
                "username": "MasiTronXIII"
            },
            "url": "https://myanimelist.net/reviews.php?id=146901"
        },
        {
            "content": "Harems, a category of anime that involves one person of a specific gender, being surrounded by three or more members of the opposite gender, in hopes that they become the lover of the one person.  While Harems aren't the most favorite out of all of the genres of anime, it doesn't always mean that there aren't some really good ones out there.  Date A Live II, an anime in which I can safely say, is one of those few.\r\nStory (7.89/10):  For those of you who haven't seen the first season, Date A Live is an anime series that revolves around our mainprotagonist Shidou, our sixteen year old main protagonist, who has the ability to seal these otherworldly beings called spirits, who just so happen to all look like attractive/adorable human females from this world.  The main idea of the series, is that our main protagonist must seal these spirits away peacefully by no other means than by making them fall in love with him, and sealing them with a kiss.  \\n\\n\r\nNow, from an idea standpoint, the story is as cliched and redone as it can get, as a similar series, called \"The World God Only Knows\" has done a similar sort of story focal point already.  As far as idea originality, this series gets a six point rating at best.  But why does the story get a higher rating you ask?  That my dear readers is in the story arcs.\\n\\n\r\nWhat makes this season in particular more interesting is the way the story was written out.  Compared to its predecessor, Date A Live II has a lot more focus on its characters rather than general fanservice that other harem anime do.  In fact, I personally can't even consider this as a true harem, as only a small fraction out of all of the girls in the series actually like the guy in that way.  Each of its two story arcs give growth to the new incoming characters to the series, and to our main protagonist, making them feel a bit more real and less platonic.  While the development did feel a bit rushed, it was commendable that the writers actually spent time on making the characters more in-depth and important rather than just one here, done, another, done with its characters.  \\n\\n\r\nAbove all, what separates this story from a good chunk of harems out there, is mystery.  THe series actually has a good mystery element that is sadly only really explored later on in the series.  There's a lot of interesting questions that need to be answered, and that intrigued me, as the story felt like it was evolving into something greater than it would've been at first glance.  \\n\\n\r\nAside from that, there were some downfalls of the series.  Number 1 is well, the first episode.  The first episode was quite a turnoff, as the actual story was really just a big misunderstanding that felt more like an OVA rather than a part of the main story.  It did introduce the first arc somewhat, but overall, felt really unessecary and probably turned off some of its fan base due to how excessively comedic (even by date a live standards) it was.  Number two is pacing.  Some of the episodes admittedly did feel a bit rushed in what they were trying to achieve, making some stuff to go along in order to advance the plot.  Given the small time frame of ten episodes, it was sad to see some details that could've used a little bit more explanation.\\n\\n\r\nThe ending itself felt a bit rushed.  I wish the final episode was sort of drawn out into two episodes because it felt really rushed.  It was a part of the series I was really itching to see, and to see the arc I anticipated so much become just a half episode standoff, it was quite disappointing really.\\n\\n\r\nAll in all, Date A Live II had a pretty decent story.  It built on what it had before and made the story a lot more deeper and in depth than its predecessor, which is always a plus.  On the other hand, there were some time issues with the series that just made it shine a little less than it could've.  \\n\\n\r\nOverview\\n\r\n+  Good story arcs\\n\r\n+  Great character development\\n\r\n+  Good mystery element\\n\r\n-   Disappointing final arc\\n\r\n-   10 episodes.  (The first season was 12.)\\n\\n\r\nCharacters (7.77/10):  The characters of this series is definitely a high point.  For every fan of this show, there is a girl that they love.  (Kurumi all the way.)  Of course, the series itself is a harem, so the gender ratios are well, a bit off.\\n\\n\r\nItsuka Shidou, our main protagonist of Date A Live who has the ability to seal these creatures called spirits with a kiss.  (This guy gets quite a bit of action.)  At first glance, one could call him just an average harem lead, a guy who's nice to everyone and doesn't want to hurt anyone's feelings, all the while with several girls after his D.  (In this case, two girls.)  So what sets him apart from many other harem leads?  For one thing, he's not dense.  He's actually fully aware of the love that some of the girls in the series give him, which makes the experience of watching not so hair-pulling worthy.  (Unlike Infinite Stratos)  As the series goes on, you can clearly see him prove his worth in the series as he shows himself to be very proactive in doing his job of protecting and saving spirits.  The comical dating sim choice thing that occurs regularly in the first series becomes obsolete due to the fact that he chooses and says his own words, making his character feel all the more better.  \\n\\n\r\nYatogami Tohka is the main female lead of this series.  While personally, I'm not that big of a fan of Tohka, I was a bit saddened to see her role become more of a supportive one rather than a more proactive one.  Throughout the series, Tohka served little more than the role of just being there and coming in at the right time to make stuff happen.  It wasn't until the final episode where her role really shined, only to be cut in half due to the small time frame. \\n\\n\r\nThe series on the other hand became quite focused on the three main spirits featured in this season; the Yamai sisters, and Miku.  What I can say is the fact that these three are some of the most animated and thought out characters that I've seen in Date A Live other than the main two characters.  The reason being is because their stories are quite thought out and detailed.  Their stories made the series better on account of the fact that they grew alongside out main protagonist in terms of character development, turning into three dimensional characters that have more to offer than at first glance.  \\n\\n\r\nAside from the more focused characters of the series, we have a whole slew of side characters that range from amount of screentime and importance in the series.  What I didn't like was the fact that so many characters in the series that had quite a bit of significance in the first season, had barely any significance in this season.  Kotori, who was a prominent character, was put in the backseat, along with Origami and my favorite spirit Kurumi, who had barely any screentime altogether.  While it didn't impact the series too much as a whole, I did wish I could see these characters a bit more in this season than what was given.  \\n\\n\r\nBut what I can say was a positive, was the fact that we now have established antagonists in the series.  This season gave us some pretty interesting antagonists with motives that weren't quite clear to the characters or us, adding into the ever growing mystery of this show that I like.  It was a good addition that could only really make the show grow even more.\\n\\n\r\nOverview:\\n\r\n+  Good character development\\n\r\n+  Good established antagonists\\n\r\n-   Important character demoted to supporting role\\n\r\n-   Lack of screentime for some more important side characters\\n\\n\r\nArt and Sound (8.00 and 8.01/10):  The art for the series was definitely stepped up.  The visuals of the series looked fantastic and glorious, the fight scenes were crisp, fluid and amazing.  Every character looked great; there wasn't any sort of screw ups for the look of the characters.  While the art did look good, there was one big flaw, and that is, darkness.  For a good portion of the series, the show looks like Another.  The entirety of the frame in some parts of the show looked completely black and made it really hard to see what was going on.  It didn't really feel like a good experience and took away parts of the show overall.  \\n\\n\r\nAnd the required section for any ecchi show, fanservice.  Date a live, with its cast of for the most part, largely chested females, has a quite significant amount of fanservice.  Any time a spirit gets her powers sealed, their astral dress will fade, thus baring everything to our main protagonist. (I told you this guy gets some.)  What I noticed is the fact that the fanservice seemed to be downgraded, as in there wasn't as much as there was in the first season.  Because they put so much time into the plot, there wasn't as much fanservice as there could've been, and that made the series, at least for me, a more pleasurable experience to watch.  Though there was some...unnecessary imagery that was used that I preferred not to have seen.  \\n\\n\r\nFor music, the series came with a set of new OP and ED tracks, to me, far exceeding the original series's tracks.  The opening sounded similar to the original OP, but different enough to make me like it even more.  While it was a memorable track to me, it didn't stick out as something for a long term favorite.  The ending on the other hand was a song in a storytelling sequence.  The lyrics were that of a fairytale about a hero saving the princess, making this personally my favorite track of the whole series, as it teased about the final arc of the season, that ended up to be quite disappointing.  \\n\\n\r\nAs for background tracks, the series reused practically all of them, from the quirky ones to the battle tracks, to my ever favorite mystical opera one that added suspense and mystery to the scene.  The background tracks are actually quite good and make Date A Live, Date a Live.\\n\\n\r\nOverview:\\n\r\n+  Upgraded visuals\\n\r\n+  Good new tracks\\n\r\n-  Unnecessary imagery in some fanservice scenes\\n\\n\r\nPersonal Enjoyment (9.89/10):  I'm not adding personal enjoyment to the overall average score for all categories, as it will skew the results.  I won't lie, this series is a favorite of mine.  It is my guilty pleasure anime, it was my friday afternoons, it was really the first series I marathoned in an entire night when the first season was finished airing.  When I first saw that Date a Live was getting a second season, I was ecstatic, itching for the spring season to come out, as this was my most anticipated series of the season.  Coming out of it now, I can say a few things seriously.  (I'm coming out of fanboy mode now.)  \\n\\n\r\nDate A Live is one of the better harems you'll find.  It's not the best one, but it's one of the better ones.  Date A Live isn't a masterpiece.  In fact, it has some negative feedback on some points on which I can agree on.  By harem standards, it's a good choice to watch.  By anime standards in general, you can find a lot of other things to watch.  This season did a lot of things well that made the series shine more than before, but at the same time, it did some things wrong.  If you don't mind fanservice or harems and like a decent plot that has mystery, action, and romance elements to it, then this series is for you.\\n\\n\r\nOverall Score: (7.91/10)",
            "date": "2014-06-13T15:01:00+00:00",
            "helpful_count": 17,
            "mal_id": 146885,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=146885"
        },
        {
            "content": "Note: This review assumes you have seen the first season and might include spoilers for that season. \r\nDate A Live II continues the exploits of Shidou to seal off the spirits with a kiss. This time around the stakes are even higher and the conquests more difficult.\r\nThere is a huge problem with Date A Live II and that is they changed the formula of the show. It used to be a decent comedy with really good action sequences and now it's more of a show with decent action sequences with overused comedy. On top of that the \"Date\" part of the show is gone. Doyou remember when Shidou took the girls in S1 out on dates? Doesn't happen in S2.\\n\\n\r\nTo be fair one of the reasons there are not really dates it the difficulty in the conquests themselves this time around are more akin to the difficulty the entire cast had against Kurumi back in S1. The first conquest are twins, Kaguya and Yuzuru. The former being a tsundere and the other one of those quiet types. The other girl is Miku, whose gimmick is that she really hates men.\\n\\n\r\nAs for the rest of the cast nothing really changes. They make returns, but you might be surprised which ones actually get some of the spotlight. That said none of them make any types of growth. For the most part most things stay the same. This includes Kotori where the ending of S1 kinda made you feel like there would be some big revelation in this season. There isn't. You'll also notice I didn't even talk about the new characters in any detail. That's because what I told you is essentially their entire character. They are just kind of boring. In S1 the characters were one-dimensional but entertaining. Here they are one-dimensional and boring.\\n\\n\r\nNow let's get to the main villain, or for that matter all the villains. Like last season they don't show up until near the end of the anime but they are handled even more poorly. They don't really explain their motives or why they have to do what they are doing in the first place. That or they are simply extremely shallow.\\n\\n\\n\r\nNow for some good things. The animation is really good and flashy.Action sequences are pretty crisp, despite not being interesting. The anime also makes great use of sound effects. From a production stand point it has a lot of the flash.\\n\\n\r\nI know I might have seemed some what hard on the show but in all honesty it's not a terrible anime, but it is a pretty significant step down from a show that was only pretty good to begin with.",
            "date": "2015-06-23T01:35:00+00:00",
            "helpful_count": 15,
            "mal_id": 190991,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/143607.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/WildNeptune",
                "username": "WildNeptune"
            },
            "url": "https://myanimelist.net/reviews.php?id=190991"
        },
        {
            "content": "The sequel to anime series Date A Live aired this spring known as Date A Live II and bought with funny moments, tragic moments and more spirits for Shido's harem while keeping the other cast members in it but are seen less than in the previous season.\r\nStory - 8\r\nThe story of Date A Live II focuses more on Shido defending himself and the spirits against the DEM rather than his attempts to 'capture/save' the sprits which does have a more dramatic and interesting story to the series but in the end it felt like to me it drifted away from Shido attempting to seal thespirits but don't get me wrong that is still in there and is something to look forward to but it isn't as heavily focused on in this series but kind of felt rushed to me as the season was only 10 episodes.\\n\\n\r\nSound - 9\\n\r\nThe opening to this season was similar to opening from the first which was good thing as I enjoyed both and was one those opening that I never skipped and watched every time, however the ending song was not as impressive and was skipped every time but then again I rarely listen to ending songs in anime.\\n\\n\r\nCharacters - 7\\n\r\nAll your favourite characters from the first season will make an appearance in this one except with less screen time except from Tohka who appears just as much as the MC Shido does; with these characters their is very little character development so don't expect much from them but their are a few new characters introduced that are more eye catching and have more development which includes more spirits and DEM.\\n\\n\r\nEnjoyment - 10\\n\r\nI enjoyed it but is not in my top 5 of 2014 but maybe the top 10.",
            "date": "2014-06-14T14:47:00+00:00",
            "helpful_count": 14,
            "mal_id": 147005,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3368757.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/vince1996",
                "username": "vince1996"
            },
            "url": "https://myanimelist.net/reviews.php?id=147005"
        },
        {
            "content": "Expecting Date A Live II to improve was probably too much. It’s obvious from the pictures that something here is going to go wrong. We already have enough goofy characters. We don’t need more. We want to see more of Tohka, Yoshino, Tokisaki and Reinne – all entertaining personalities that tend to light up any scene they’re in. Tokisaki wasn’t really defeated in the previous season, so there’s clearly more to do with her. Why add more?\r\nThe additions are not that bad, but they’re bad in a very predictable way. It starts with the twins. The problem they introduce is different enough, but just lookat them. The character design is sexy, but it’s more sexy than pretty. The previous Spirits’ design tried to tell us more about their character than to make them sexually appealing. Tokisaki is the only one with an actual sexy design, but in this case it’s part of her character.\\n\\n\r\nIt’s not like they’re completely empty shells. They are pretty entertaining in the scenes they’re in, and the conflict they’re in could lead to a very interesting relationship. You quickly forget that they’re dressed for an S&M club because their antics come from the same creative mind that gave us Yoshino’s wide-eyed fear and Tokisaki’s creepiness. Their fights are just as fun as anything in the previous season.\\n\\n\r\nSadly, there is not enough of that. We spend two episodes with the twins and some embarrassing fanservice. The previous season never had that amount. What happens in these episodes feels like it came from those shows that just want to push the envelope. It’s not funny and it’s out of place. The show still rolls along mostly without ecchi – you’d expect the camera to linger on Reinne when she appears in a bikini, but you barely have time to register there’s a teddy bear between her breasts. What was the point of those awkward scenes in the bedrooms?\\n\\n\r\nMiku is a little better. There is something slightly off-putting in her design. Maybe it’s because she looks like Coco from Mermaid Melody with a new paint job. Still, her character is interesting and she provides a good conflict. Once you get over the over-sexualizing, the new Spirits offer problems that are different enough than the previous to show the creators haven’t run of new ideas.\\n\\n\r\nIn fact, they have too many ideas. We have a new antagonist who is interesting until the climax. Jessica appears, which could help add some depth to the whole wing of the AST. Ellen, the Bad Guy’s sidekick occasionally looks like there is an interesting personality underneath that cool hair. There is even a school festival that slides smoothly to the plot instead of feeling tokenistic.\\n\\n\r\nIt doesn’t build to anything. The climax is the real weak point of the series.. The previous climax was also messy, but Tokisaki lead it. It felt unhinged, out of control and unique to the series. Somewhere around the eight episode, the series becomes one extended action scene Shido mows down a lot of mooks, but the real causalties are the personalities.\\n\\n\r\nSome characters are already halfway to gone before the finale. Kotori and Yoshino are barely there, which makes no sense. The few times Yoshino appears, struggling with understanding a soap opera are what made the original so fun. The climax finally kills them all. Kotori and Yoshino go AWOL. The twins are pushed to the back, almost as if they were never there. Jessica is thrown into the action scene with a conclusion that deserved a much better build-up. Origami is still an unnecessary part of the harem. Miku becomes a tsundere. Bad Guy reveals he’s bad because he’s bad and Mana is still just as useless.\\n\\n\r\nTohka is the only one who’s given some room to do things. Her clinginess to Shido is pretty annoying, but there’s enough of the fish-out-of-water antics that make her fun. She eventually becomes the center. If so, why introduce the new Spirits, if they’re just pushed to the back in the end?\\n\\n\r\nWhy is this so generic? What happened to the bravery? The series used to flinch at violence, to question whether it’s a legitimate method to solve problems. It was its whole charm. It forced the hero to interact with the ‘bad guys’. Violence is frowned upon. Now Shido mows down faceless soldiers like he’s Sylvester Stallone in a generic building. There aren’t even cool visuals to accompany it. He just swings his sword and people fall down.\\n\\n\r\nSpeaking of Shido, he hasn’t changed. He’s still boring and has no charisma. He’s still given a lot of situations that can be great for character development, and he does nothing with it. How can you even write such a dull character? Asimov isn’t exactly the master of creating human beings, but he gives the game pieces (In Asimov, there are no characters, just game pieces) some traits that make them recognizable. Shido is nothing but a plot-mover. The story is clearly about him. He’s the star of the climax this time, so make him worthwhile. Alas, everything he does is just for convenience.\\n\\n\r\nIt’s not a problem of length. 10 episodes is a little too short, but there was enough time that was better spent on other things. We didn’t need all these fanservice and the finale could have been a bit more exciting than just killing faceless people. There is still some fuel in this franchise. Most of the new ideas that were introduced are pretty good. The new Spirits are a worthwhile addition. This season does even less with everything, and the result is just a shopping list of cool ideas. The series doesn’t deserve this as a swan song, but I worry that feature developments will stay, will, undeveloped.\\n\\n\r\n2 dates out of 5",
            "date": "2015-06-22T10:04:00+00:00",
            "helpful_count": 14,
            "mal_id": 190926,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4632480.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/TheBrainintheJar",
                "username": "TheBrainintheJar"
            },
            "url": "https://myanimelist.net/reviews.php?id=190926"
        },
        {
            "content": "My avatar says it at all who is my favourite girl in Date A Live franchise. But neither way, let's talk about the latest season of Date A Live, Date A Live II.\r\nSo Date A Live II just follows the story from the first season. This sequel adapts the Light Novel's Volume 5-7 that only lasted for 10 episodes so the story is pretty rushed. And also, the first episode itself was a filler so basically, if you hate Tohka, just skip it to the second episode.\r\nKeitarou Motonaga still directs this season. Notably known for directing Legend of the Galactic Heroes, School Days and more,he did a good job for directing this series although there are some failures and sorts.\\n\\n\r\nI'm not kidding if I'll say the quality of the animation in this season was terrible. Sure, the fanservice scenes was kinda good but the action scene was poor animated. The last 2 episode's animation really proves that AIC Plus+ is really short in budget. So in short, the art was mediocre.\\n\\n\r\nA good thing about this season is the sound. Pretty comparable to Sidonia no Kishi's sounds but the main point here is when there's an action scene, I felt that it was an action scene because of the OST. sweet ARMS returns to perform the OP song \"Trust in You\". Kaori Sadohara (who is an actual member of sweet ARMS) performs the ED theme \"Day to Story\" which is pretty good and a reliever of the show.\\n\\n\r\nIf you'll ask about the voice acting. The casts from the first season returned but I'll pinpoint Marina Inoue here voicing Tohka. I thought that she gave justice to develop Tohka's voice in this season, maturing her voice and her song performance beats up Minori Chihara songs. And going to Minori, voicing Miku Izayoi not fits for her. The truth is, I'm pretty hyped for her voice but it turns out that it lacks something. Maaya Uchida and Sarah Emi Bridcut did a good job voicing the Yamai twins. But overall, I don't have any complaints besides Miku's voice.\\n\\n\r\nLets go to the characters. Well, Shido took a level to become a baddass which is a good character development for him. But same old as in the first season. Still oblivious and acting like an hero wanting to save a Princess and only relies to Kotori's orders. Either way, his baddassness is pretty good.\\n\\n\r\nTohka returns as your naive but a sweet Princess which I think also developed too in a way that she tries to understands Shido and its actually good for her to be honest and rather became a supporting character rather than the main character. She too, took a level to become a baddass and Episode 6 and Episode 10 managed to make her shine.\\n\\n\r\nOrigami, Yoshino, Kotori and Kurumi just pushed to a side to become supporting characters. But if you love Kurumi, she will appear later so don't rage about it. The three new Spirits will not be spoiled for you but they are still, added to Shido's harem.\\n\\n\r\nOverall, a simple 'very good' is my enjoyment in this series. There are a lot of pros and cons but still, Date A Live II is a heck of a ride for its fans and viewers. Let's wait and see the OVA and the Movie.",
            "date": "2014-06-13T20:09:00+00:00",
            "helpful_count": 11,
            "mal_id": 146911,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2640243.jpg",
                "scores": {
                    "animation": 5,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SweetCoconut",
                "username": "SweetCoconut"
            },
            "url": "https://myanimelist.net/reviews.php?id=146911"
        },
        {
            "content": "The comedy and the fan service has just increased with this season\r\nDate A Live II follow volumes 5-7 of the light novels. The first half of the show deals with these competitive Yamai Sisters, Kaguya and Yuzuru, who were the same spirit until one day the two were split up into two. Now they compete with each other to prove that they are the real Yamai. They have had 99 matches (25-25-49) and there last competition is to see who can seduce Shido and he would be the deciding factor. The second half of the show is Shido trying to save a spirit called \"Diva\",Miku Izayoi, but the problem is that she is bias against males because she use to be a pop star who got caught up in a false scandal after refusing to sleep with a TV producer. She later lost her voice due to psychogenic aphonia and made contact with a sprit named \"Phantom\", the same spirit that gave Kotori her spirit powers, and regained her voice to sing again. Aside from the spirits there is a new threat called Deus Ex Machina (DEM) and I'm going to be honest I forgot what their goal was, but I think it's on the lines of world conquest or something like that.\\n\\n\r\nLet's talk about the Yamai sisters. Kaguya is very childish and has an outspoken personality. Yuzuru speaks very robot like by stating her response and then giving the actual response. Like if I said, \"The Giants won the World Series\". She would more or less say \"Confirmation. The Giants did win the World Series.\" Miku is not only a pop star, but also she is attracted to those of the same sex making her fall for Shidou would prove to be quite the challenge.\\n\\n\r\nThere is one joke that is set up at the beginning of the show where you could see coming a mile away and you know it's coming, but you just want to see the reactions of the characters.\\n\\n\r\nOnce again the animation is pretty good.\\n\\n\r\nThe one downfall is the increase in fan service. I really don't mind fan service in general, but when the show has more fan service than it's previous season it gets awkward.\\n\\n\r\nDate A Live II is still a very good show. This show is just a guilty pleasure for me and once again it's a show that I could just sit down and just enjoy it and not think is it as good as others say it is. So my grade for Date A Live II is 8/10.",
            "date": "2014-11-04T10:50:00+00:00",
            "helpful_count": 9,
            "mal_id": 167407,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3886845.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Anthony_DiGrande",
                "username": "Anthony_DiGrande"
            },
            "url": "https://myanimelist.net/reviews.php?id=167407"
        },
        {
            "content": "Date A Live II has been an enjoyable anime for me to watch. This anime doesn't really live up to the high expectations it was given but nonetheless it was still a good anime\r\nStory - It is obviously about Shido trying to save more spirits but I felt like there was a clearer antagonist in the story. The story progressed well in a way but I feel a lot more work should had been put in this anime.  \r\nArt - The art is kinda different and I feel it has downgraded a notch. the only one I found with an improvement on this TobiichiOrigami\\n\\n\r\nSound - It sounded fine. No real complaints on the sound\\n\\n\r\nCharacter - The characters are great as the first season and you will see a few new characters.\\n\\n\r\nEnjoyment - I enjoyed Date A Live II a lot and I hope they will have a season 3 regardless of having a very low chance of having it, I still enjoyed it a lot.\\n\\n\r\nI know many people are hating on this anime for numerous reasons but give the second season of Date A Live II a shot. It may not live to the same enjoyment as its predecessor but It is a good anime and I hope you watch it.",
            "date": "2014-06-17T08:03:00+00:00",
            "helpful_count": 9,
            "mal_id": 147341,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3849563.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Ahrisato",
                "username": "Ahrisato"
            },
            "url": "https://myanimelist.net/reviews.php?id=147341"
        },
        {
            "content": "This anime is one of the best (if not the best) i have watched so far that has gotten me so easily intrigued in the story. I have never seen anything quite like it and I've tried to look in a lot of places since i like this anime so much and can't wait for the new movie that is coming out.\r\nWARNING may contain spoilers:\r\nAlthough this season has had quite a lot less dates if any it still managed to add in some new spirits and have romantic scenes. In this season The main character Shido has gained powers from some of the spirits hehas sealed the powers from making it so that a season 3 could have a lot more action in it and get even more interesting than this one!",
            "date": "2015-07-29T11:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 194623,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4778532.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/ThisIsLelouch",
                "username": "ThisIsLelouch"
            },
            "url": "https://myanimelist.net/reviews.php?id=194623"
        },
        {
            "content": "This is my first review, so please don't hurt me. Also, this is my second time writing this due to the face >.(then an arrow pointing to the left) causing everything after it to be erased after submitting. Apologies on rushing.\r\nThis anime needs justice, and it needs it now.\r\nStory (8):\r\nAlright, so many parts were rushed due to the anime being only 10 episodes. The first 2 or so episodes were, in my opinion, crap. After that, the anime really got its sh*t together. First off, consider all the genres this anime has. Don't expect it to \r\nhave extremely good plot like other anime that don'tfocus on the genres this does. Now that we got that out of the way, onto my actual thoughts.\\n\\n\r\nSometimes, I would stop and think \"is that it?\". I myself have never read the light novel or read the manga. The manga hasn't actually progressed past Shido talking to Tohka for the first time (I believe). So I can't really say that the story was great. Nonetheless, it really good for what it is. I can't delve too much on this without spiling anything, so I'll just have to say that it was excellent.\\n\\n\r\nArt (10):\\n\\n\r\nCan anyone really argue that the art isn't anything short of amazing? All the girls have their own special and unique design with lots of colors. Nothing to complain about here. The scenery is also beautifully designed and never boring. Oh, and did I mention the girls? They are just absolutely beautiful. I doubt many people would disagree on me with this. No character designs look alike (except for the Yamai sisters which doesn't count).\\n\\n\r\nI just love it, can't get enough of the beautiful art.\\n\\n\r\nSound (9):\\n\\n\r\nIt was nice to have Diva actually voiced by the singer Chihara Minori. Some may think her voice can be too high pitched, but I'm completely fine with that. She sang the OPs (and EDs?) of Horizon in the Middle of Nowhere. \\n\\n\r\nThe OP,in my opinion was great and memorable. I find myself listening to it from time to time. As for the ED, I don't have much to say about it since I'm not a fan of music with that kind of tune.\\n\\n\r\nThe background music is never out of place and can describe the scene well. It can set the mood for certain yanderes or a funny scene. \\n\\n\r\nCharacter (7):\\n\\n\r\nDon't get me wrong, I love the characters. But there just wasn't enough time to get enough airtime for all the characters.for example, the Uamai Twins didn't get much development and I was a little disappointed. If only it got 2 more episodes or they didn't mess around in the first episode, maybe, just maybe, the characters could've been developed on much better. Just my 2 cents on that topic.\\n\\n\r\nThe characters are very love able (Kurumi is the best girl!) and can just be soooooooo cute. Kurumi is just one of the most awesome characters (and OP) in this series.\\n\\n\r\nAlso, drum roll please, our protagonist (Shido) grew some balls! Ironically he grew them while cross-dressing but it was a glorious moment. Can't go much more on that topic to prevent spoilers.\\n\\n\r\nEnjoyment:\\n\\n\r\nI found myself watching episodes 4-10 in a single sitting. I just couldn't tell myself to not watch the next episode. The suspence would've killed me! I slept at 5 AM just to finish the anime!\\n\\n\r\n Sometimeswe forget that anime is all about entertainment, and whether we enjoy it or not is what determines if it was good or not. It'd be like giving a hentai a bad review solely because the story was crap. It's so we can enjoy it, no matter what flaws it had. \\n\\n\r\nYes, I didn't touch up on the flaws, and it is you to decide whether you absolutely can't watch this anime with those flaws. But for me, this is my review and I'm sticking to it. \\n\\n\\n\r\nDate a Live II, an excellent anime.\\n\\n\r\nThis is LolCaptain signing out.\\n\\n\\n\\n\r\n*please excuse the rushed review, it's 2 AM and I really need to start watching my anime.*\\n",
            "date": "2014-06-22T01:10:00+00:00",
            "helpful_count": 7,
            "mal_id": 147983,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3732035.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LolCaptain",
                "username": "LolCaptain"
            },
            "url": "https://myanimelist.net/reviews.php?id=147983"
        },
        {
            "content": "Don't read this if you want to read a short review or one with a lot of positive stuff in it, I will mainly write about what I didn't like and it became quite long. Since it was quite long, I also couldn't be bothered to read it again to check for grammar or redundant parts. This might be interesting to read if you wonder about the flaws of the show from the point of view of someone who actually enjoyed watching it overall.\r\nA fatal flaw of this show is that while it’s kind of like a harem series and the very idea of makinggirls fall in love with you, at least to some extent(since “date” is even in the title and going on dates and trying to make people fall for you is most of what this thing is about) means the ending should be one in which he’s married to everyone, right? He should get all, or at least most, of the girls that he’s seducing. That’s the very point here, that’s what this is about or should be about. It’s not a story where he should romantically fancy just one or two people and decide upon who he likes the most. That’s not the deal here, or at least it shouldn’t be. But all too often, harem stories are just fake garbage, sadly. I don’t care whether or not it’s realistic to keep several girls with different personalities, love them all somewhat equally and for them to be satisfied with the situation. No, of course it’s not realistic irl. That, however, doesn’t mean it’s not perfectly plausible in a fantasy story, especially when the plot is far weirder and riddled with holes and chaos than something like having several wives could ever be. \\n\\n\r\nMonogamy and polygamy and the romance stories born from those settings are very different and comparing them is just, excuse my language, retarded. In monogamy, it’s about deep love with a single partner, in polygamy, it’s more about an unified love between several people and the beautiful bond all of them build as they pretty much become one big family, more focus should be put on the balance between all of them than deep, individual love. When you make a story like this and it somehow seems more like many of these girls just love you as a friend rather than lover and you, the mc, doesn’t love anyone for real, it’s just irritating, very much so. Especially when he seems to zoom in on just one person much more than others, which quite obviously is the first spirit he seduced(seems there's a law where the first girl introduced=most important). Am I asking for too much? Well, perhaps. I just hate it when authors write up several love interests and give all of them pretty much equal yet differing charm while feeding us the “he’s going to end up with a harem” idea from the very start, but seems to fail following through with it. Well, if the mc himself was actually a very likeable character that wasn’t something of an incompetent playboy that just wants to have everything but give nothing and decide upon nothing, I wouldn’t have minded that much in the first place. Even if he made it clear that he would only love one person, that would still be good enough. It’s that he keeps on seducing people and there’s this mood going on where he can’t commit to anything whatsoever, be it polygamy or monogamy, that pisses me off the most here.\\n\\n\r\nThe anime/novel also takes itself too seriously at times. Bringing too much tragedy or drama into a story that has no potential to ever be a serious, good story with a solid plot. This is NOT a truly great story by any means of the word. I like the relationships in the story and the characters, the interactions are fairly nice, but the story is a huge mess and the attempt to introduce excessive drama and plot into something that shouldn’t have one just feels alien to me. It doesn’t do the novel/anime any good, it’s just a detriment. How could I ever take a story seriously and enjoy the drama when the settings and story is all over the place and, quite frankly, subpar with holes everywhere. Hell, just the simple fact that he can spend dozens of seconds TALKING OUT LOUD to the empty air while chatting with the people on the ship giving him instructions or that he can wait for at least a dozen seconds before giving a reply is ridiculous enough, the girls freeze up as if they’re truly from a game while waiting for his reply, but that’s far from the only cringeworthy and stupid thing going on, things like only girls being able to use any of the combat gear with no explanations as to why that is(what? is it powered by girl power? Breast milk? something somehow only female humans have? If you tell me some bullsh*t like that, I’ll punch you, it’s just stupid) another one of many, well, we don’t actually know anything about any powers in this anime, it’s just left at it being “Fantasy, magic, ‘nuff said” level. Not saying I didn’t find the story fairly enjoyable, I just feel like the author tries to grasp for things he’s not capable of ever grasping, at least not with the basic settings and the previous “story” we have been presented with in this novel/anime. \\n\\n\r\nLet’s be perfectly honest here, this setting isn’t that good and saying it was meant to be serious is just a giant joke in and of itself. Writing a serious story with good drama and even tragedy, horror or anything else, takes a lot more thinking than just writing a random comedy with some elements you like. If the story isn’t solid, it’s never going to be good if it’s supposed to be serious and if you want it to be ridiculous, even cringeworthy, silly and utterly childish at times, you can’t just randomly put in serious drama whenever you feel like it. It doesn’t work like that. Not saying comedy can’t be combined with drama and tragedy, good lord, it can. Just not this type of comedy that relies on things being absurd and the setting being sketchy at best. So, my tip to you is to skip the obviously serious parts, it’s very easy. It’s really not an anime that goes on for long enough even with both seasons for it to matter if you skipped all serious parts that didn’t interest you. I recommend not to skip kurumi’s scenes though.\\n\\n\r\nWell, let’s add one more complaint to the list. Like in season 1, the mc is still a giant pushover who screams “friendship” and “sacrifice myself” all the time. He’s essentially just a chatterbox that talks and talks with passionate speeches and more often than not, he’s screaming the names of the girls whenever something happens while being able to do nothing yet he’s constantly rushing headlong to his death as if he has some weird masochistic suicidal urges. He also shows no will to increase his powers whatsoever, he seems content being a pushover that can do nothing but push his ideals and petty feelings around, trying to force everyone to accept it, this is despite the fact that he obviously has supernatural powers that he can use and should be able to harness with training, but he doesn’t care, as if it would all just happen by itself(which it obviously will, I guess). \\n\\n\r\nI mean, he’s not the worst japanese mc of his type, but he’s sure as hell not a good one either. Going with the flow and selfishly trying to save everyone while giving zero considerations to his own limitations or life, nor any consideration towards the feelings of everyone who loves him, seems to be his special skills, he's certainly not a smart guy, he's pretty damn stupid and never uses his head for anything noteworthy. It’s as if he’s trying his damn hardest to prove to the viewers that he’s such a goodie-two-shoes that cares so much about everyone that he puts them above his own life, as if that’s a desirable trait(it’s not, proving that you're a good guy by acting like a suicidal retard is never a good way, it just shows he's a moron who has no grasp on his own abilities or situation). Well, I guess no japanese fantasy woman can resist falling in love with anyone who willingly sacrifices themselves for them… Oh, wait, we’ve seen that happen with other characters too(in other manga/anime/novels), them sacrificing themselves for love, sadly they get nothing but a grateful nod or a few tears even if they die, sucks to not be the mc who has special protagonist pheromones that enchants any woman in their proximity. It’s amazing, you know, it’s like an on/off button. As soon as he gets too close to them, they suddenly become completely enamoured with him, there’s no gradual love development, they either love him with all their heart or doesn’t think anything much of him, there’s no middle points.\\n\\n\r\nIt doesn’t get better when he’s also a fool and pushover when it comes to following up on his actions and romance in general, he doesn’t truly fall in love with anyone, yet he seduces them and like any other japanese mc in works like these, he seems perfectly content pretending to be ignorant and not answering to any character’s feelings despite knowing perfectly well they love him, doing his utmost to push aside any event where they try to confirm his feelings. Tsk, I don’t know about you, but I often want mcs like these to be kicked to death by a horse. Sure, they’re nice guys, but their personalities are infuriating when put into a mc. It’s one thing to have side characters that are eager to die and has no grasp on the situation while being indecisive and reluctant to move on with anything at all, but the main character? I don’t see how it’s ever a good idea unless it’s a comedy manga/novel/anime and he’s SUPPOSED to be a hopeless cretin. Sure, some people won’t agree with me, we all have different preferences, but I honestly detest idiots like this mc. However, luckily enough, he wasn’t actually THAT bad, he was just annoying at times. Most of the times my feelings for him were kind of neutral, he wasn’t that infuriating most of the time, maybe because comedy was the main focus of this show despite a third being serious. The girls easily balanced the show up as well, generally possessing vibrant personalities that offset the mc’s foolishness and shallow personality.\\n\\n\r\nI liked this story a lot, but going above 7/10 is just not possible, that’s me being generous because I truly did enjoy big parts of this anime thanks to its relationships and the characters, most of whom felt alive and truly likeable. It’s enjoyable, but it has massive flaws as well. Disregarding my pure enjoyment and judging it just from how I view the show overall, I’d say 5/10 for average would be a fair score. I might make it look like I actually hate this show, but I just don’t have that much positive to write about it other than liking most of the characters and their interactions along with the mood and pace of the show, writing up the negative parts is much easier because that’s what caught my attention the most. By the way, the comedy in this anime is so-so, I can see where it tries to be funny while often ending up as cringeworthy, but sometimes it does manage to tickle my funny bone. Had I been several years younger, I might’ve bust a gut laughing at it at times, but after being through around fifteen years of thousands of works, be it manga, anime or novels, japanese, chinese or korean, I’ve become numb to most stuff. Just like when you’ve seen a certain thing or heard a joke too many times, I just don’t find it that funny anymore and I find it very easy to find flaws that I didn't find when I was younger. Well, being numb to it doesn't make it impossible to realize if something would be funny for other people. If you’re a teenager or at least not that experienced when it comes to these things, I can probably assure you that this is going to be hilarious for you and a truly awesome anime in more ways than one, well, that is if you’re into some fair amount of fan service and silly jokes often regarding juvenile topics, like ones regarding out of place and surreal eroticism.\\n\\n\r\nThat's all, sorry for the long review, you can have a cookie if you actually read it all.",
            "date": "2018-10-10T18:18:00+00:00",
            "helpful_count": 2,
            "mal_id": 291447,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6452825.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Seregosa",
                "username": "Seregosa"
            },
            "url": "https://myanimelist.net/reviews.php?id=291447"
        },
        {
            "content": "A good sequel to the first season.\r\nDAL II was alright compared to the first season, however did not measure up to the high bar that the first season set up for it. The soundtrack was great and both the first and second season's opening complimented each other greatly. The art stayed the same as the first season, which was fine, but could have done better as many other anime of that season had good art as well. The adaptation also could have done better as the second season only had enough time to spend on 2 girls / major arcs.\r\nI would only reccommend this animeif you enjoyed the first season. If the first season was an eh to you, then this anime should be considered but not prioritized.",
            "date": "2016-06-19T21:30:00+00:00",
            "helpful_count": 5,
            "mal_id": 221257,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5488856.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inorichi",
                "username": "Inorichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=221257"
        },
        {
            "content": "**THIS REVIEW CONTAINS SPOILERS FROM SEASON 1, AND MINOR SPOILERS FROM SEASON 2**\r\n*Disclaimer: The review contains heavy language and imagery; not written for pure-hearted.*\r\nHave you ever been told to just \"shut your brain off and enjoy it for what it is\"? If you have been, then you must feel like you're probably missing out on something otherworldly, something you can't quite understand. Date A Live is, in short, a figurative abomination and requires aforementioned brain shutdown sequence to even get the slightest inkling of enjoyment. I entered searching for a quick time-killing fantasy action anime with some cute waifus & some harem, and I leftliterally feeling empty inside. There's nothing. All the cynicism I've been harboring inside my heart has been purged within 22 episodes. I have nothing unique to offer to the world anymore - except this review. \\n\\n\r\n*NOTE: This review encompasses both seasons, as well as the overall rating of two* \\n\\n\r\nShows like Evangelion, SeL, TLOGH, etc., are often put in that category of \"if you didn't like them, you didn't understand them\". I think Date A Live deserves a spot in that bubble, to be honest. I'm a firm believer that there's nothing in this world we can't understand, as long as we give it enough time and research. Yet, this show alone has broken me, has changed my very views on storytelling. This has got to be the biggest pile of massive shit the writer has ever taken on my brain since the inception of mankind. I've read hundreds of books, hundreds of fan-fiction short stories, watched hundreds of movies, TV shows & anime, and never once in my entire life did I want to put a massive fucking nuclear bomb between writer's eyes and then piss on his/hers corpse with all my might. This is a disgrace to writing. No, scratch that. This is the end of storytelling - this thing, right here. It has warranted the title of 'The Death of Storytelling' for being the biggest shitstorm in the history of mankind. \\n\\n\r\nI can overlook plotholes, I can overlook deus-ex machinas, I can overlook bullshit thrown in our faces for the sake of drama/comedy/horror, but this thing here goes beyond that. At this moment I'm angry with MAL because I'm unable to grade the \"story\" of this thing below zero, below the levels of sanity and any conceivable comprehension. Whoever wrote this thing, I beg you, kill yourself. I fucking beg you. If you want to, I'll kill myself with you so we can both leave this world. You don't deserve neither a pen nor a keyboard ever put in your hands. You are stupider than the main girl from Aho-girl. You reached levels that even the lowest of bacterial forms have surpassed millions of years ago. Yes, that's how bad the \"story\" is. It's as if you put the story of High School DxD on acid, heroin, cocaine, crocodile, massive doses of lithium, xanax, and virtually every conceivable drug in the universe, and then took a huge steaming dump all over it, and created this. This. Fuck this to the damning hell. Burn it. Burn it before it breeds. This is the lowest level of storytelling I have ever witnessed in my entire life. 50 shades of grey seems like a masterpiece now. Twilight is the 21st ct Shakespeare. End this. Bye. I'm not even going to bother jotting down the things I found to be abhorrent; if you didn't catch them yourself, or if you consider this to be a good story, you're as good as dead to me.\\n\\n\r\nArt & sound, for the first time in my life, are the only reason I was able to finish something - and you know what? I hate myself for it. I should have dropped this in the 4th episode of the 1st season and never looked back, but I always thought it'd get better. For the most part, animation is stiff and average, and even during some of the major battles I wouldn't expect much. It's colorful, yes, but it's nothing mind-blowing to be honest. It has some decent animation here and there, and I hate myself for giving props to this anime for any department, but I have to. \\n\r\nMusic is sparse, but some of it that's in there is quite good. There are 2 tracks that I still remember, and were the high point of this anime. Then why 4 to sound? Because of everything else. Sound effects were terrible, voice acting was near-unbearable, reaching dub-levels, and that randomly-thrown pop song by the end of the 2nd season sealed it for me. I'm done. \\n\\n\r\nNow we come to the characters. The only reason I gave 2 here is because I couldn't, in my right mind, even them out with the story, because they're not that bad - mind you, they're still dreadful, just not as bad as the story. Our main character is every harem lead in the history of everything, with 0 deviation from the norm. Why do these girls like him? Because they're fucking insane and mentally challenged, that's why. There's no other reason to like him. If girls fell in love with the first guy that told them \"I'll save you\" and \"I'll never reject you\", every low-life would have a girlfriend. This character gets no development for 22 episodes, nill, nothing. He's ever-shouting piece of plank that pathetic fuckers can \"relate to\" and \"immerse themselves with\" and he has no other purpose. You can literally switch him out with any generic harem lead and nothing would change. Abso-fucking-lutely nothing. \\n\\n\r\nOoh, you think other characters are better? Think again my friend. Have you ever watched harem anime? You must have. Everyone has. It's the most widespread genre in anime. So, if you did, you'll have recognized these girls the moment they appear on the screen. Why? Because all of these are by-the-book harem girls you've seen about a fucking bajlitionth time before, and if you aren't tired of them by now, then Lord Spaghetti help you. Energetic, shy, calm, weird, imouto, 2nd imouto because 1 wasn't enough, all these things may just as well be replaced by other things from other harems. There's so little development in this anime, that evolution of mankind was faster. You might say that every girl \"develops\" because at first they \"hate him\" and then they \"love him\". You know what? Fuck you. That's not development you uneducated ape. Go back to school. \\n\\n\r\nI've never seen such generic, insane and demeaning cast in any anime I've ever watched. No, not even Sky Wizards Academy (which is still worse, by the way, only because it has worse animation; rest is pretty much on par, I'd argue even better in certain places). Relinquish in this feast of stupidity and insanity, relinquish and join me in madness, for that is the only place the poor ones who've watched this belong. \\n\\n\r\nBelieve it or not, I gave season one 5. Why? Because it was, by all means, your average harem. It had some decent action, at times it was funny, and I didn't feel like I was marathoning LoTR Director's Cut Edition each time I watched an episode. First season felt like a set-up, kind of like HS DxD, and I was fine with that. Yet, second season tried to be more than it already is and, well, you already know the result. I hope to every manmade spiritual thingy that this thing never gets any more seasons. I feel sorry for animators who had to animate this. I feel sorry for everyone even remotely involved with this outside of the writer. I feel sorry for TV stations that had to air this. I feel sorry for new anime viewers who know nothing better. Ugh ... I'm done. \\n\\n\r\nThis is abomination. End. Disgrace. Everything that's supposed to be the backbone to a creation is instead a rotten piece of shit, born only to pollute the innocent minds. Fuck. This.",
            "date": "2015-12-10T12:54:00+00:00",
            "helpful_count": 5,
            "mal_id": 205191,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 6,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=205191"
        },
        {
            "content": "This was actually a very disappointing series, especially after all the buildup from the first season. First thing that struck me was the change in art, which, for me, was very unwelcoming. The opening soundtrack was, undeniably very good (as expected from SWEET arms), and the closing wasn't bad either. \r\nThe second season was meant to be the general plot development season, however, the studio was too disorganized and couldn't notice that it was beyond their budget. They had to kill the story off right when the main plot twist was meant to happen and they spent too little time developing and concentrating on thedifferent characters, I read the light novel, and most of the details were left out.\\n\\n\r\nI heard that the studio is going to make a movie to finish it off, so if you ask me, just save this season for when the movie comes out.",
            "date": "2014-08-20T19:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 157333,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3777447.jpg",
                "scores": {
                    "animation": 3,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/JasonBFleece",
                "username": "JasonBFleece"
            },
            "url": "https://myanimelist.net/reviews.php?id=157333"
        },
        {
            "content": "Love is Strong\r\nStory 6:\r\nA Date to save the world? \r\nA man has so much power that he can seal the spirits powers by a kiss. \r\nArt 6:\r\nNothing special here, but the fan service was great lol\r\nSound 6: \r\nThe same tracks were played throughout each episode.\r\nCharacter 6:\r\nThey were cute and the fan service was great as I was saying before. \r\nThe twin scene at the bench, thats where it was at.\r\nEnjoyment 6:\r\nI didn't have that feeling where... I wanted to watch the next episode? \r\nIt was okay wasn't like I had to watch the other episode.  \r\nOverall 6:\r\nIt was okay better than the first seasonIMO\\n",
            "date": "2017-11-22T18:09:00+00:00",
            "helpful_count": 2,
            "mal_id": 263781,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879361.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/BCxER80",
                "username": "BCxER80"
            },
            "url": "https://myanimelist.net/reviews.php?id=263781"
        }
    ],
    [
        {
            "content": "Date A Live was an awesome experience.\r\nThe music in this series is excellent! Each character has their own sinister track that fits them perfectly. The story is an incredibly cool twist of fate that manages to hinge on the humor of dating. The relationship bonds that develope are strong and standing. The character art is also very impressive and the action that ensues during battles is packed. This series will have you rolling in laughter with each episode. The only thing I have a problem with are a couple of aweful charcaters that were injected... If it weren't for the brat sister archetype and increadiblyawkward hyper-sexualized puppet child, this anime could have come very close to squeezing an impossible 10/10 from me. All in all, the fanservice, story, art, and music are rock solid. You must watch this.",
            "date": "2016-10-10T21:48:00+00:00",
            "helpful_count": 3,
            "mal_id": 231565,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5742500.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/GodBlessDXD",
                "username": "GodBlessDXD"
            },
            "url": "https://myanimelist.net/reviews.php?id=231565"
        },
        {
            "content": "I watched the first season and absolutely loved it. I was a little against the mecha genre, but this anime has a really good balance between mecha, school, and harem. With this second season, I enjoyed the advancement in the plot and relationships. Although the plot is nice, some of the major plot points came out of nowhere and still confuse me (introduction of characters, the cause of major plot points like the ending). I really enjoyed the music in the anime especially in the final scenes of the last episode. Overall, if you enjoyed the first season, then the second season is the same.I hope for some OVA or hint at a next season, because the last episode just drops a plot point and ends it right there.",
            "date": "2016-04-06T18:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 215719,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5214407.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ThePunzalan",
                "username": "ThePunzalan"
            },
            "url": "https://myanimelist.net/reviews.php?id=215719"
        },
        {
            "content": "Rarely do I say the second season was as good or even better than the first. Pleasantly surprised... Lets just hope the finishing movie I'm about to watch next follows suit...\r\nThe story is obviously how it continues from the first season (which I must say is also very good), when you read the plot in your head, understandably you might think \"what a shit story line\", but it only really starts to makes sense once you watch it, and although it is slightly ridiculous, you have to remember... This is a fucking anime. \r\nOverall I did enjoy the story although there is room for improvementto which I could drone on for hours about little niggly bits I wont bother, its fucking half 12 at night, I have work tomorrow and I'm knackered\\n\\n\r\nThe art work I cant really fault, but it would nicer if it was a tad more crisper and sleek, but hey ho I cant expect too much.\\n\\n\r\nI watched the dub because I'm not \"A Hardcore Anime enthusiast\", but fuck what people think about dub, It was licensed by funimation so its obviously going to be good. NOT GREAT. Just good. The voice acting was very good, but I did feel at certain points the should have been more sound, or at least a better sound in certain scenes, but this didn't bother me too much.\\n\\n\r\nThe Character development sort of tailed off from the first season, it didn't really expand too much on the new characters, but it was probably for the best, otherwise it would have gotten rather complex.\\n\\n\r\nOverall I have enjoyed this anime well; it nicely balanced comedy and ecchi scenes (some of which I think I enjoyed a little too much) and the super duper serious dramatic stuff, it had an interesting and ... different plot to say the least, but somehow it really does work, and lastly good sound and animation to execute it all quite nicely. I do look forward to watching the movie to finish it all off, although I am very scared of another shitty movie ending * cough Sora No Otoshimono cough cough*.",
            "date": "2016-04-16T16:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 216516,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5251593.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/KozuraKZO",
                "username": "KozuraKZO"
            },
            "url": "https://myanimelist.net/reviews.php?id=216516"
        },
        {
            "content": "*MINOR SPOILERS*\r\nAh this one, it's one of my favorites, and for good reason....\r\nSo starting with the story, it's pretty much an \"Addition\" to the first season, as Shido still tries to seal away more spirits. Toward the ending it ramps up, as Shido tries to stop the DEM and save Tohka. But, not much else \"Story\" wise here.\r\nThis, like many others, has a really nice artstyle and animation to it. Everything is so fluid and it's all so pleasing to the eye.\r\nThe OST is alright, i enjoy it, and the English Dub is also really well done, i love the how everyone sounds. But again,not much else to say here.\\n\\n\r\nSo here is where the anime shines. You have some characters that you may be familiar with, and then you have a few new ones. Now, this anime does a perfect job at having a diversity of personality from each character..and i love that. Being a harem anime, expect a lot of new girl characters and only one guy character, as far as i'm aware. But overall, the anime has a good diversity of personalities, and the characters are all very memorable.\\n\\n\r\nThe overall enjoyment for this anime is a 10/10, i loved every minute of this anime. Many won't agree with me, as they'll say things like, \"Oh well there's no story\", and i personally think that THESE type of anime, where it focuses HEAVILY on characters and not the story, and just has that fun, playful vibe, just makes it all the more enjoyable to watch. And i personally think it's good to just watch this type of anime to get a bigger diversity, and to take a break from the other story heavy anime that i have or am watching, again, this is all my opinion. I do however, hope they do make a season 3, i can see some more development there, as we don't know what Kurumi is going to do with Shido...anyways this is a good watch if you're ok with lackluster story, and memorable characters.",
            "date": "2016-09-01T19:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 228086,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5591814.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PixlReality",
                "username": "PixlReality"
            },
            "url": "https://myanimelist.net/reviews.php?id=228086"
        },
        {
            "content": "There will be no big difference from the 1st season of Date A Live series (the 1st season: Spring 2013, 12 eps + OVA, Studio AIC PLUS+ and the 2nd season: Spring 2014, 10 eps + OVA, Studio Production IMS). The story still tells about the spirits, whose destroying power are so damn dangerous for the future of the world. These women spirits then being haunted by the AST, somewhat futuristic organization with so many handy weapon to handle spirits, and even the missions to kill 'em. On the other hand, there is an organization called Ratatoskr whose mission to seal the spirit powers byluring them with \"a date.\"\\n\r\n    The one who carries the task of dating the spirits is Itsuka Shidou, As time passes, Shidou discovers the true form of his younger sister, Itsuka Kotori, as a spirit too. Itsuka Kotori is the one behind the Ratatoskr organization, the head of Fraxinus under Ratatoskr's command. Later, Shidou makes his move and successfully bring the spirit under control, sealing their powers by dating [Shidou makes them believe that they are precious and wanting by someone so they will learn how to love and embrace others rather than destroying living being with their unbelievable spirits power]. The 2nd season brings the same story, but with new characters to fill the scenes.\\n\\n\r\n​\\n\r\n    The show indeed silly and funny while the battle scenes are good. As the starter, the humour was very bad. Tohka powers are fluctuating due to her suspicion over Shidou and Origami affected by the television show she and Yoshino routinely watch. This and all jokes of story opening irritates me since it makes everything looks like silly coincidences, and it turns worse when analytically it happens just for the bridge to the main course of story.\\n\r\n    The detected Spirit power comes from Tohka makes her being targeted and immediately be pursued to get killed. Summary the silly television show raises Tohka's power and lead her into a mess faster. In the middle of our main course, we are entertained by new characters and so many fan services out of nowhere as  a downfall. I don't mind with fan services as long as it places right on certain situations like the 1st season. The 2nd season presented the ecchi-ness in such low level of beast.\\n\\n\\n\r\n    Due to many newcomers in this series, I can't identify clearly the development of characters. It feels like all of them forced to involve in every new conditions and troubles that lead to the main course but vaguely, weakly developed. The character introductions seem not natural anymore, the coincidental meetings are not making sense.\\n\r\n    If I should combine two aspects, animation and character development, then my opinion is the animation went so damn well but the story was in rush, it was not good since I could feel the tense of the fighting without the good story and development followed. From the story aspect, Date A Live II series is my guilty pleasure, an average but has a pretty nice animation. The enjoyment boosts a bit around the end of the show, two last episodes are such a blast! All hail war among AST & Spirits ⁽ˆ⁰ˆ⁾\\n\\n\r\n    The music is so-so. OP theme is sung by sweet ARMS \"Trust in you\" and ED theme is sung by Kaori Sadohara \"Day to Story\". Sadly the catchy character songs aren't my favorite either. Only the insert songs are quite nice, but just by the insert songs won't help much. What needs to be underlined is Kurumi's seiyuu scintillating voice, gives only Kurumi extra point in my sight. The mysterious, psychotic aura of Kurumi is increasing unstoppable whenever she speaks in absorbing tone.\\n\\n\\n\r\n    I still enjoy the series because of its graphic and intense fighting, especially last two episodes it's still burning in my brain. Feels like the story shows us the meaning of trusting someone and try the hardest even if others stop to looking at you. My rate is 7 only.\\n\r\nPros:\\n\r\nGood animation\\n\r\nIntense fighting scenes\\n\r\nCons:\\n\r\nOverwhelming amount of fan service\\n\r\nThe progress of story is somewhat so silly (like ecchiness only)",
            "date": "2016-07-22T16:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 224686,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224686"
        },
        {
            "content": "Never has a change in the animation studio been this apparent to me. That was essentially my first thought as I tried up to sum up my feelings about Date A Live. The main reason why I started watching this anime was because someone I know has it in her favorites list and I thought to myself 'eh. Why not.'... So I watched the first season and was pleasantly surprised. Harem anime have been some of my least favorite in the past, so I expected this one to be fairly similar... but honestly, the first season of this anime was really, really good. Mainly becauseit managed to escape quite a chunk of the normal things that harem anime go through, while still putting a spin on the things that it did do like almost every other harem out there. One scene that's still stuck with me is the Onsen episode in the first season, which was genuinly funny and was something I hadn't even remotely witnessed before. So after that first season, my expectations for the second season were quite high... and as you might've guessed from the very first sentence and my rating, I was thoroughly disappointed.\\n\\n\r\nSo why's that?? Well, mainly because the second season was missing both the cleverness and the heart of the first one... though it started out promising. The first episode felt just like something from the first season... but from the second episode onward, everything went straight down. Just like the first season, there was an Onsen episode here... but unlike back then, this one was just a plain, generic and unfun one, which would go on to set the tone for the remainder of the anime. The somewhat unique setting of the MC going on dates with characters and being 'supported' by a team of 'professionals', choosing his answers Visual Novel style was replaced by dull drama and fights that just weren't interesting whatsoever; the interesting characters of the first season (especially Yoshino) were put on the bench in favor of new characters that turned out to be as lively and engaging as a round of chess on a graveyard and the humor that gave the first season its charm was replaced by one-dimensional characters pretending to hav serious conversations during silly Mecha-suit fights... so in short, everything that made the first season stand out was switched out for generic things that are about as unique as water in Atlantis.\\n\\n\r\nThat said, it wasn't ALL bad (otherwise my score would've been even lower)... As mentioned above, the first episode was still really, really good and also there was a brief part during the beginning of the second arc where the humor of the first season flashed up again, when he had to dress up as and pretend to be a girl in order to get close to a spefic girl. Also on the rare occasions that the other characters from the first season DID show up, their personalities were kept intact, which was something I had feard would not be the case ('Dark Tohka' notwithstanding). Another thing that the second season did was make me realize just how good the first one had truly been, causing me to retroactively change my rating for that season from 7 to 8 points (which is something I almost never do. Once I've finished a season of an anime, I normally don't touch the score anymore).\\n\\n\r\nSo in the end, what I'm trying to get at here is that the second season was just completely lacking the heart, genius and charm of the first one and just felt like something that was thrown together with minimal effort just to rake in as much money as possible. Maybe it's just coincidential that there was this huge of a difference in quality once it was produced by a different studio, but I personally don't believe that. Especially since Production IMS is a studio that likes to put out low-effort harem anime (see also 'Hundred' and next season's 'Masou Gakuen HxH')\\n\\n\r\nSo... that was it for my first review here. To be honest, I've always wanted my first review to be either my favorite anime (Chuunibyou demo koi ga shitai) of all time or my least favorite one (Ookami Shoujo to Kuro Ouji), but the jarring difference in quality between these two seasons just made me want to open my stupid mouth in order to complain a bit. To anyone that's still reading this, thank you for doing so... and sorry for making you read this shit ^^'. Anyhow, have a wonderful day (or night, who knows) and make sure not to fall for scammers. Goodbye! :D",
            "date": "2016-06-27T08:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 222155,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4880339.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/dunkan85",
                "username": "dunkan85"
            },
            "url": "https://myanimelist.net/reviews.php?id=222155"
        },
        {
            "content": "*This review assumes you have watched the first season of Date A Live.*\r\nTl;dr\r\nPros:\r\n1. The Yamai sisters are a lot of fun.\r\n2. The amazing soundtrack from the first season makes a return, now with new and great additions.\r\nCons:\r\n1. The soundtrack is not used as well as in season 1.\r\n2. The story is pretty weak.\r\n3. The dating aspect is nonexistent this season.\r\nThis short season only encompasses the appearance of three Spirits, though a pair of them appear together as twins - the Yamai sisters. The Yamai sisters are the much more charming ones this season. Their designs are great, with complementary elements as seen in their AstralDresses, and sexy at that. The Spirits continue to be based on tropes this season, and the Yamai twins feature the chuunibyou Kaguya and the one who speaks in Touhou spell cards Yuzuru (yes I know she is just supposed to sound like a robot). However, what makes them more interesting is their squabbles which are quite entertaining.\\n\\n\r\nAnd on the topic of the Yamai twins, they bring with them a great addition to the Date A Live soundtrack: 'Hurricane'. It is a rearrangement of Ground Zero from season 1, and a fantastic one at that. The strings and vocals in 'Hurricane' create a very windy feel for the piece, and the rearranged melody gives a sense of power, ultimately resulting in a piece that befits the force of nature it is named after. There are also a few other new music pieces added, such as 'Gabriel Rondo' and the OP 'Trust in You' which all work out pretty well.\\n\\n\r\nThe soundtrack from the first season also makes a return, though it is not used as well as in the previous season, resulting in very silent intimate moments and battles where in the first season, they would be enhanced with the accompanying soundtrack. Given that the soundtrack was one of the highlights of season 1, the poor use of it this season made it much less impactful this time.\\n\\n\r\nThe first season also left big shoes to fill, and this season failed to do so. The story is far less memorable than season 1 despite some progression in the story at large. Likewise with the characters, even if I love the Yamai sisters. In fact, I only rewatched Date A Live because when I watched Mayuri Judgement recently, I'm just completely lost when the characters in this season showed up. Worse still, this already short season is still wasting precious airtime for filler and fanservice instead of touching up the story.\\n\\n\r\nLastly, the dating aspect with the three choices appear only a few times in the entire season and the options aren't as humourous as in season 1, to the extent that the choices are never on screen long enough for you to even read them. In fact the screen is often just used as a backdrop in the bridge of Fraxinus.\\n\\n\r\nIn conclusion, this season is a rather weak follow-up to the first season. The first season capitalised on its strengths to make it stand above the crowd, but this season took all those strengths and effectively threw them out the window. While I still enjoyed watching this season, it is sadly very lacking compared to the first season.",
            "date": "2019-03-04T22:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 302927,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7814224.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lunarstrom",
                "username": "Lunarstrom"
            },
            "url": "https://myanimelist.net/reviews.php?id=302927"
        },
        {
            "content": "A series of which I've had fond memories of, Date a Live II incorporates the main gimmick of dating to survive in the previous series and amps it up a notch.\r\nNew characters are introduced, which, although being pretty much a Harem Anime, I've realized I can still feel sympathy for their situations, rather the average Sword 'Ass' Online anime, Date a Live has many enjoyable scenes for those whom are interested in both the Plot and 'Plot' utilizing comedy to accentuate the characters motivations while also maintaining a relatively serious tone.\r\nDate a Live II makes multiple mistakes that the previous series had, but through furtherexplanation later in the story, those make sense, but since this is a review on the Second Series specifically, one would have to attempt to overlook these 'Hints' to the future, due to the lack of spoilers I must have in this review, I cannot explain what these are, however.\\n\\n\r\nCharacter wise, it still has the same cute and cool cast from the previous series with some new characters I originally thought would be borderline Sadists after seeing their outfits, thankfully, or for some, sadly, this wasn't the case, where their personalities give an overview that in reality these spirits, though having immense power, they are still young women and the emotions conveyed not only by these newcomers but by the old cast perfectly emphasizes the growth made as they are constantly fighting new threats, the only exception to the character growth in their personalities is the primary female protagonist, Tohka, whom still feels that she can't trust the main character even through all the S%@! they have been through, which to me, is only partially understandable, where the protagonist has multiple relationships, this would normally be a problem, except each girl is also friends with each other, so that, in reality is my primary gripe, but hey, one needs at least some tension or else their relationship would get stale, i guess.\\n\\n\r\nOverall, I rate it an 8/10, because I'm extremely harsh in my review, but I still enjoyed it thoroughly.",
            "date": "2019-02-15T05:21:00+00:00",
            "helpful_count": 1,
            "mal_id": 301703,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7768700.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kaglan_Bigscythe",
                "username": "Kaglan_Bigscythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=301703"
        },
        {
            "content": "Here we are with season two.\r\nIt starts a month after the previous and it seems things have gone back to normal, Tooka and Yoshino are living with Shidou in the complex Kotori had built for them all.\r\nThis season feels a little different from the other in the beginning but it all comes back together pretty quickly. \r\nWith two less episodes than the prior it feels a little rushed at some points and things seem to be just happening for the sake of filling episodes.\r\nThe comedy is the same as before, still decent amounts of panty shots and cute girls which are easy to like. \r\nThereis two new Spirits though, Yuzuru and Kaguya plus Miku. \\n\r\nI was hoping that with the new season it would continue on with Kurumi, learning more about her and seeing what happens with the desires she was for Shidou. So I was a bit disappointed that what seemed to be a main plot point was just brushed aside.\\n\\n\r\nTrying to put the two seasons together, it fits just because it's the same characters and they carried the main points of the story over, Shidou helping Spirits and the organizations involved, but from where the first season was going at the end and it being continued in this season, it really doesn't happen. I think the main feeling of that is the situation with Kurumi. It should have been a lot more prominent and then everything would have come together a lot better. \\n\\n\r\nHopefully with a third season that will all be addressed. \\n\r\nSaying all of that though, I did enjoy what it all built up to and I'll definitely watch more if there is another season. Just the disconnect ruined how much I enjoyed the first season compared to this sadly.",
            "date": "2016-12-31T04:25:00+00:00",
            "helpful_count": 2,
            "mal_id": 237067,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5526839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Mikame-",
                "username": "Mikame-"
            },
            "url": "https://myanimelist.net/reviews.php?id=237067"
        },
        {
            "content": "Now this was unexpected, I had totally forgotten that they were going to do a second season on this. Date a Live is apparently still alive and strong, returning with a second season and apparently an upcoming movie as well. This second season, which relies heavily on the first season for background information, is a more focused, action heavy show than its predecessor. Apparently, the harem in the first season was not large enough so now they're adding on three more girls. If you're watching this to try to fill some of the galaxy-wide plot or setting holes remaining from the first season you're goingto be disappointed, if anything the series just goes and introduces additional plot holes. If you're watching this to kill time and enjoy a story driven action/comedy/harem, then this is, admittedly, not that bad.\\n\\n\r\nAnimation:\\n\r\nThe animation styling is very similar to the original show. It has nice lighting and shading effects and a wide variety of scene locations. The second arc was a bit abusive in the CGI department but nothing atrocious. All the characters are all easily distinguishable though I must admit it took me an episode or so to catch up with the relevance of all the characters. Facial animation is only average and behaviors of some of the spirits are definitely not in the realistic category. Note that many of the supporting cast from the original return in only marginally-supportive roles, almost like slightly-extended cameos.\\n\\n\r\nThere is a good deal of action in this show. For the genre, it is definitely one of the more entertaining action pieces with lots of effects and decent choreography. The show is also, indeed, ecchi based so expect a very cliché onsen scene as well as plenty of scantily clad ladies. The ecchi is relatively innocent (intent-wise) as compared to other shows like Maken Ki or Mangaka-san.\\n\\n\r\nSound:\\n\r\nThe series opens with a fairly nice and purposeful sounding piece. The ED follows a similar vibe with a decent melody and similar instrumentation. The BGM didn't catch my attention as much as the original but it serves its purpose well. There are a few insert songs in the second arc, which can be good or bad depending on your take of the VA.\\n\\n\r\nThe strong VA cast in the original returns for the second season, though a large portion of the screen time is dedicated to new harem candidates. Nevertheless, Marina Inoue is always welcome and Asami Sanada's performance as Kurumi is instantly recognizable. I have no qualms with the first arc's VAs but Minori Chihara's voice just doesn't seem to sound that fitting for a diva role, especially the insert songs.\\n\\n\r\nStory:\\n\r\nThough the second season starts out a bit slow, it soon becomes pretty engaging despite the hilariously bonkers premise behind it all. The show is divided into two separate arcs, with the latter arc being slightly heavier weighted in terms of tension. Both arcs feature a good mix of plot twists, cliffhangers, comedic ecchi, and light romance play. Thus, if you're watching from a low involvement level, it's pretty good.\\n\\n\r\nHowever, taking a step back, you realize that the story is actually quite lacking compared to the first season. The original \"date\" concept and usefulness of Kotori and her gang are severely diminished, as are the role of many of the other girls from the original. In its place, the story focuses on the new characters and events. As mentioned earlier, the story doesn't address much in terms of open questions and only adds further mystery as the plot unfolds. So yes, they will probably sell plenty of copies of the material, but I don't feel that they advanced the actual underlying story very much. Likewise, the actual climax could be predicted episodes in advance, and yet still felt very artificially put together.\\n\\n\r\nAll in all, I'm very mixed here. I felt that the pacing and mixing of story elements was much improved over the original. However, they sacrificed a lot in doing so.\\n\\n\r\nCharacter:\\n\r\nThis is still the weakest category for this show. Never do you really feel that the spirits are human-like. Their seemingly unavoidable gravitation towards the protagonist's lack of charm is a bit disturbing, and their sudden realization that he supposedly cares for them is weak at best. While some interactions are enjoyable, you never really feel that Shidou has earned the right to be with, well anyone. In addition, there are still way too many supporting characters that do virtually nothing for the user except add confusion and distraction away from the character that matter (such as Jessica Bailey). In summary, my criticism from the first season still rings true here; too much character spamming with little meaningful development.\\n\\n\r\nValue:\\n\r\nOn the bright side, this is a rather short show. If you at least marginally enjoyed the first show, it won't take you long to make it through this one. Don't expect stellar characters but the entertaining plot should keep you engaged. Let's just hope they bridge some of those plot holes one day.",
            "date": "2015-11-05T00:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 202715,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4962414.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Zaku88",
                "username": "Zaku88"
            },
            "url": "https://myanimelist.net/reviews.php?id=202715"
        },
        {
            "content": "***THIS IS A SPOILER FREE REVIEW***\r\nIf you somehow find this show appealing to watch, I recommend you watch the first season before taking this one on.\r\nOk. *Takes a deep breath* Let's get this over with. Because of money, a new season of Date a Live is here and well if you were expecting more character development from the previous season's characters then well be prepared to be very, very disappointed.\r\nStory: 4/10\r\nIt's the same as the first season plot wise; mythical creature taming stud Shido has to go seal the powers of new female characters for the love of \"plot\". I cannot believe I am sayingthis...but I actually think that the first season did a better job with the pacing of the arcs than this new season. This season in my opinion had a lot of \"dead\" spots where I just didn't give any sh$%s for what was going on. And what the f$#^ leaving out some of the original characters almost entirely? Yoshino is pretty much sidelined and the only decent character Kurumi isn't utilized until the very end. All this season accomplished was putting new bait under Shido's belt and unfortunately I really did not like any of the new characters.\\n\\n\r\nAnimation: 6.5/10\\n\\n\r\nLooks pretty much the same as last time. It actually might have look better during some scenes but it really didn't wow me because it was obvious that they put the real mustard of effort during the ecchi scenes. It's a real shame because some of the fight scenes actually looked pretty decent.\\n\\n\r\nSound: 5/10\\n\\n\r\nAverage.\\n\\n\r\nCharacters: 3/10\\n\\n\r\n The newly added characters connected with me as much as a human's a$$ and a cactus. None of them seemed likeable and were actually quite annoying to watch. The decent ones from last season like I said before were pretty much sidelined and very under-utilized. Since this is a character driven harem show, if you do not end up liking the cast, it's going to be a sh#@ show.\\n\\n\r\nOverall: 4.6/10\\n\\n\r\nSay what you want, \"Oh you just hate the IP so much that you are not being unbiased in your review.\" If you think you are correct then by all means leave a comment below. I hoped that we would see more character development for the previous season's characters but nope a totally new fresh cast was handed the baton and they fumbled big time. I can only recommend this show if you were a fan of the first season.\\n\\n\r\nEnjoyment: 2.5/10\\n\\n\r\nThanks for reading my review! If you liked my writing style, would like to see some other reviews, or just want to talk, please stop by my page!\\n\\n\r\nSincerely,\\n\r\nAwesome Drummer",
            "date": "2017-05-15T23:12:00+00:00",
            "helpful_count": 1,
            "mal_id": 247805,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/407839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ImRingo",
                "username": "ImRingo"
            },
            "url": "https://myanimelist.net/reviews.php?id=247805"
        },
        {
            "content": "Here we are for the second season. I was looking forward to watching this since I liked the first season. I definitely was wanting more and I got more. So let's hop right in.\r\n Story: 7\r\nSo the second season wastes no time and jumps right back into it, giving fans one episode to refresh them on the way the plot works. The plot here works in two, VERY noticeable arcs. One is based around a school field trip and the other around a school festival. without giving away too much, the first arc feels more enjoyable while the second arc has more plot progession. Notto say there isn't any plot progression in the first arc, it's just that the new things you learn are things you figured were going to happen. And that's also not to say that the second arc isn't enjoyable, it's just that most of what the plot is centered around is unlikeable. Overall, a nice continuation but not as good as the first.\\n\\n\r\nArt: 7\\n\r\nA noticeable downgrade this time around. Ok not that noticeable but it is there. Characters still look nice and the backgrounds still feel a bit alive, it;s just that the animations a little lacking this time around.\\n\\n\r\nSound: 10\\n\r\nStill a great job by the sound team. The OST is great with the Op and Ending being two great highlights. the background pieces are also very nice with a few tracks returning from season 1. there is also a nice little effect that I liked with one of the new characters Miku. Whenever she used her power, there was a nice accompanying organ note that played along with it that I liked.\\n\\n\r\nCharacters: 8\\n\r\nSo like a mentioned there are a few new characters this time around, three of them being main characters. The first two, (whose names are excaping me right now and I don't fell like looking it up so shut up lol.) are met in the first arc. The last, Miku, is met in the second. Now if you have followed everything I've said up until now, you can probably figure out how I feel about Miku. She is a new problem I had with the series. I understand the reason why she acts the way she does (thank you guys for doing that this time), but she still comes off unlikeable and her coin flip of a personality doesn't help. Speaking of characters who needs their backstory explained, Origami is back and no, her back story is still not exlained. So we can sit here wondering some more. On a final note, Kurumi doesn't show up a lot and that is a problem lol. When she does it's great but that is for about two episodes. (#KurumiBestWaifu #NoShame lol)\\n\\n\r\nEnjoyment: 7\\n\r\nAt the end of the day, I will walk away from this season satisfied but not to the same level as season 1 left me. Season 2 was good in a lot of ways but opened up a new set of problems that show more this time around. I enjoyed it though so if you liked the first season, you can enjoy this one.\\n\\n\r\nOverall: 7\\n\\n\\n\r\nThis averages the series up till now to a 7.",
            "date": "2017-03-07T05:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 242050,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6061538.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DarkScribe492",
                "username": "DarkScribe492"
            },
            "url": "https://myanimelist.net/reviews.php?id=242050"
        },
        {
            "content": "Date A Live II\r\nOnce again after season 1,you never disappoint me. This had been one of my favourite anime! The story is outstanding! Shido still maintaining his duty to save all the spirits by dating them and make them fall for Shido!\r\nI love how they start the beginning of episode 1, flashback 30 years ago! And the new OP is WOW! Very enticing, they really had the beat going on!\r\nThe characters design were somehow I think improved if I say so myself. Honestly it's one of the best anime I ever watched!\r\nStarting from episode 9 really makes me chasing it! How he planned his nextmove. I also kinda shocked for what happen at the end. Must watch I must say!\\n\\n\r\nThanks for making Date A Live!",
            "date": "2015-12-03T06:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 204696,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5025350.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/FreedomTan",
                "username": "FreedomTan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204696"
        },
        {
            "content": "Strap in for Date A Live II, the anime sequel absolutely nobody asked for and progresses the plot in no way whatsoever, but still manages to entertain by being a dumb harem comedy show. It has lots of pretty colored lasers and those wonderful “pew pew” sounds that accompany the beams! An anime that introduces us to a bevy of characters while still focusing on a main character as flat as the plateau on which this anime doesn’t stand. Get ready for ten rousing episodes packed to the brim with all the things we were mildly amused by in the first season.\r\nIn all seriousness, DateA Live II is more entertaining than its predecessor. It only focuses on the conquering of three females (and two are technically one) while giving us a lot more action and a lot less stupid. Trust me, this anime is still stupid, but less so than the first season. Which could be because it’s mercifully shorter or because the show jams a lot more “plot” into the ten episodes than most shows of its’ length. That said, it’s still going nowhere fast and only serves to introduce characters rather than build on the cast already there, and also introduce bad guys who run away at the end, perhaps to return for a third season or the upcoming movie.\\n\\n\r\nThe anime picks up where the last season left off. The first episode is an ill foreboding of things to come. It attempts to remind us that Tohka is an idiot while also annoying us to death by retreading territory we’ve already seen. Thankfully, after that, the series gets much better. We are introduced to twins who are two parts of a whole, fighting to find out who will disappear and who will attain the title of the true spirit they belong to. Neither character is impressive at all as one is basically Tohka and the other is basically Origami.\\n\\n\r\nThe other introduction is the obligatory idol character. Named Miku. Never heard of an idol named Miku. She’s a lot like Kurumi to me. Very weird and manipulative. So as far as new characters, very little new ground is established. Everything’s a new face on someone we’ve met before.\\n\\n\r\nThe characters from the first season barely get any time or development. Kurumi returns and seems like a completely different character. Instead of the weird, crazy-ass yandere of the previous season, she’s a very moe lunatic. She helps Shido, the sort of thing I didn’t think a character trying to kill him only a season ago would do.\\n\\n\r\nWhile characters aren’t impressive, the plot is decent enough to keep it interesting. Evil organization. Fighting. Kidnapping. Pretty arbitrary plot devices that culminate in an uninspired ending followed by a quick epilogue punctuated by the obligatory original pop song by our idol.\\n\\n\r\nAnimation has been downgraded from season one. The budget is obviously cut and the team worked with what they had. It’s not that the animation is bad; it’s just not as crisp as it was before. And truthfully, the animation was probably the best thing Date A Live had going for it.\\n\\n\r\nI can’t fault this season for as much as I did the first one though. I thoroughly enjoyed everything beyond the first episode. It wasn’t smart by any means but its focus on two threads rather than three or four made it more bearable. The fact it was plot-centric over comedy-centric also made it more fun to watch. You do root for Shido and Tohka to get together and care about the finale even if the characters aren’t as three-dimensional as you like. But with all that, it sidelines the great characters of the first season. Yoshino’s just along for the ride. Origami is there but not at all as funny or interesting as she was in season one. We’re given a lot of the new rather than balancing that with the old. And even if the new meat is freaking adorable and Miku is a great addition (the twins, eh), you can’t sideline characters that a lot of fans came in to see more of. In that regard, it’s like a cocktease. You want Origami? Tohka? Kurumi? Too bad. Origami’s too busy not being in the show, Tohka getting kidnapped, and Kurumi is being a completely different character.\\n\\n\r\nI hate that I enjoyed this so much, but it’s one of those dumb harem/comedy shows that gets it right. While Ben-To and The Devil is a Part Timer stay stagnant because of one good idea and an inability to  expand upon it, Date A Live II’s open enough to allow for nonstop action and stupidity without it getting stale. Hell, this season doesn’t even use the idea of the folks on the ship deciding what Shido says to the girls but for twice. This is like a departure from everything that the first season had going for it, but it’s better because of that. It’s let loose the stupid and made me realize that maybe I don’t need Tohka or Origami to make Date A Live work. Maybe they were hindering the first season. Why else would this one work better for me? Maybe putting more focus on a smaller group of characters produced better results, even if the characters weren’t that memorable or well thought out.  Maybe focusing on a bad plot instead of underwhelming humor is a good thing. Even the few instances of humor this season managed to be funnier than anything season one produced.\\n\\n\r\nHuh.\\n\\n\r\nDate A Live II is sure to please fans of the first season, though they might find problems with the execution. I found it to be a much better, shorter, and more enticing product. Much as the second season of Chuunibyou did a better job of making me care about a series I cared little for, Date A Live II makes me somewhat excited to see what the future holds. It may not be great, but it’s good, dumb entertainment.",
            "date": "2015-05-22T11:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 188459,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3624303.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/ratchet573",
                "username": "ratchet573"
            },
            "url": "https://myanimelist.net/reviews.php?id=188459"
        },
        {
            "content": "Alright if your reading this review I can only assume you've watched the first season. Basically all of the plus's and minus of the 1st season are here too, you can find my review of date a Live, well everything in that goes for this too. Although fair warning, it's my opinion that the show has gone down hill in quality, their is more fan service then ever, though I guess that might be a plus for you, the story is even dumber and more contrived. On the plus side this season introduces a legitimately malicious villain. On the down side, one of the newcharacters Diva is kind of the worst and she isn't really punished for it. I mean I'm pretty sure she's a rapist and they don't really call her on it, probably because this shows not popular enough and she's a lesbian so I guess people find that sexy.",
            "date": "2019-02-13T16:29:00+00:00",
            "helpful_count": 0,
            "mal_id": 301606,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7783778.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/D0g0n2",
                "username": "D0g0n2"
            },
            "url": "https://myanimelist.net/reviews.php?id=301606"
        },
        {
            "content": "The second season has enlightened me of the appeal to Shiori Itsuka.\r\nBasically the same as the previous season, a harem story pasted onto a crappy dating-simulator setting which is accounted as \"original\". \r\nThe difference is that we get new girls this time, twins! Although none of them matter, as the only one that does is Tohka.\r\nArt is the same as usual, enough to satisfy someone's desires. But it is also used to express Tohka's purity and wholesome nature.\r\nSound is, once again, mediocre. Nothing I can say about it.\r\nThe whole entire show is about developing characters through a dating-simulator setting, but it somehow manages to simplyfit all the girls into the standard archetypes that only know how to be a harem. They really only learn how to love the main character, Shidou, and slowly degenerate in level of interest and common sense. I personally did not enjoy the characters acting as such. \\n\r\nTohka gets some drama though, and it builds onto her and shidou, and is highly appreciated.\\n\r\nMaximum Enjoyment derived from Tohka\\n\\n\r\nStory: 3 (Same as before but the antagonist isn't as good as Kurumi, simply poses a threat; also less interesting as the concept only seemed fresh in the first season, and that was the main things it had going for it)\\n\r\nArt: 7\\n\r\nSound: 7\\n\r\nCharacter: 3 (The amount of characters I can't really bare increased by 3)\\n\r\nEnjoyment: 10 (I'm human scum and I feed off of this)\\n\r\nOverall: 4 (Excludes Enjoyment)\\n",
            "date": "2018-04-01T23:09:00+00:00",
            "helpful_count": 0,
            "mal_id": 276470,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7115624.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/StaticCore360",
                "username": "StaticCore360"
            },
            "url": "https://myanimelist.net/reviews.php?id=276470"
        }
    ]
]