[
    [
        {
            "content": "About half a year ago I had the absolute pleasure of reading through the Seirei Tsukai no Blade Dance light novels, and after having caught up with them I consider it one of my favourite series to date. Consequently I was of course very much looking forward to this anime adaptation; however I still felt a bit awkward about it because as it is, Blade Dance is not really an amazing series from the very beginning. It isn't until a few volumes of content down the road that it starts getting exponentially better; however this mere 1-cour adaptation doesn't even reach that far into thestory. As a result, people watching this anime will most likely think of it as just yet another cliché harem series, which by itself isn't wrong but it's only scratching the surface of what Blade Dance truly is deep down.\\n\\n\r\nIn short, Seirei Tsukai no Blade Dance takes place in a fantasy world where magicians called Elementalers (or Elementalists if you prefer) form sacred contacts with elemental spirits in order to be allowed to wield their powers. However this privilege is only given to pure maidens of noble families who undergo training in order to become spirit contractors. This means that there are no male Elementalers... or at least there shouldn't be but *as it happens*, there is one exception to that, namely the story's protagonist Kazehaya Kamito. Consequently he's transferred to the rich girls' classy school as the only man in an ocean of girls. Sounds cliché and overused as hell I know, but I think it utilizes that premise better than most other such cases out there.\\n\\n\r\nNow undoubtedly the most important part of a harem series is the characters themselves, as if they're not likable then it will suck no matter what, so here's a rough draft of the most important ones:\\n\\n\\n\r\nName: Kazehaya Kamito\\n\r\nRole: Protagonist\\n\r\nDescription: Good natured, dark history, strong fighter\\n\r\nComment: Not a pervert, not a wimp, not dense. Actually a competent harem protag for once\\n\\n\\n\r\nName: Terminus Est\\n\r\nRole: Contracted spirit, bEst girl\\n\r\nColour: White\\n\r\nDescription: Ancient legendary sword spirit, expressionless, snarky\\n\r\nComment: One of the most nosebleed-inducing characters in existence, total moe overdose and perhaps the main reason to watch this series. Don't you dare drop this anime before she makes her first appearance (episode 3)\\n\\n\\n\r\nName: Restia Ashdoll\\n\r\nRole: Former contracted spirit\\n\r\nColour: Black\\n\r\nDescription: Antagonist(ish), motives surrounded in mystery\\n\r\nComment: Cute yet seductive character design, hard to figure out for sure what she's thinking or what her personal goals are most of the time\\n\\n\\n\r\nName: Claire Rouge\\n\r\nRole: Tsundere Ojou-sama #1, emphasis on the tsun\\n\r\nColour: Red\\n\r\nDescription: 95% tsun, 5% dere, Kamito's self-proclaimed \"Master\"\\n\r\nComment: Imagine Louise de la Vallière except without Kugimiya Rie and you won't be too far off the mark. Also a closet pervert though\\n\\n\\n\r\nName: Rinslet Laurenfrost\\n\r\nRole: Tsundere Ojou-sama #2, emphasis on the Ojou\\n\r\nColour: Yellow\\n\r\nDescription: 50% tsun, 50% dere, extreme rich-girl aura, Claire's childhood friend\\n\r\nComment: Without a doubt one of the most strikingly Ojou-esque characters out there\\n\\n\\n\r\nName: Ellis Fahrengart\\n\r\nRole: Tsundere Ojou-sama #3, emphasis on the... creative ways of insulting people\\n\r\nColour: Blue\\n\r\nDescription: 33% tsun, 66% dere, captain of the Sylphid Knights\\n\r\nComment: Strong sense of justice and a quite straightforward personality, but on the inside she really only wants to be treated like a girl\\n\\n\\n\r\nName: Fianna Ray Ordesia\\n\r\nRole: Perverted Ojou-sama\\n\r\nColour: Purple\\n\r\nDescription: Playful and teasing personality, frighteningly bad at cooking\\n\r\nComment: Aggressively seeks to seduce Kamito for her own reasons. She's good at teasing people but not so much at being teased herself. Also somewhat naïve\\n\\n\\n\r\nShort version would be that some characters are more likable than others, but there's bound to be at least *someone* everyone would like from the cast. Est is by far the most popular but Restia and Ellis have some sizable fanbases as well.\\n\\n\r\nAs far as the production value goes, the art style looks mostly like how I imagined it would and is quite pleasing for the eyes overall. The animation quality however is uneven at best. For panoramic sceneries and close-up character shots everything looks fine, but every so often during more distant shots the characters' faces will look completely distorted and just plain weird. It really feels like they skimped on the budget in that area and sadly it drags down the overall impression of the visuals quite a lot as it'll constantly nag you in the back of your mind.\\n\\n\r\nThe soundtrack however, the only aspect I had absolutely no expectations on whatsoever coming into this as a LN reader, sure as hell was the real surprise of this show. The OST is just soooooo catchy, I was so impressed with it and it really has its own feel to it. It's not particularly J-pop-esque, but rather gave me some East European or tribal vibes... I think \"wild\" might be a good word to describe it. Note that I'm not just talking about the OP (though this one is a bit more \"normal\" than the others) and the ED with this, but the soundtrack as a whole including the CD-only tracks (like Shukusai no Elementalia for example) that aren't in the anime itself are also fantastic and I'd recommend you to run to your nearest YouTube and check them out if you haven't. Also one does not simply mess with a group name as legit as Ni-Sokkususu (pronounced Knee Sockss) >.>\\n\\n\r\nMoving on, overall this is definitely not a show that would ever be labelled as \"deep\" or \"intelligent\" or \"artistic\" etcetera, but that's not what an ecchi harem show needs anyway. What it needs is cute girls and mindless fun, and as far as that part goes at least there's not much to complain about. Some people might get annoyed at Claire but she's only one among many, and there's bound to be at least someone that can carry the show for every viewer specifically. In the end, anime is simply entertainment media and for that purpose alone, Blade Dance does its job. That's all there is to it really.\\n\\n\r\nHowever as a final note, as someone who's read the novels I really want to get this message across: since no second season has yet been announced despite the anime being finished airing, combined with the fact that (to my knowledge) it didn't have the best BD sales in Japan, it’s worryingly likely that no more content will ever be adapted for this series. If that really does seem to be the case however, then I really recommend you to at least try out the LNs instead. I'm not going to be one of those hypocrites who keep yelling stuff like \"the source material is so much better, don't judge it by this anime\" etcetera, because that is definitely not the case. In fact I think this is a quite respectable adaptation as a whole; not perfect but good enough. Rather it's simply that the story improves immensely pretty much from the very moment at which the anime ends, and thus judging the full story merely from what these twelve episodes cover alone will give a quite unfair image for the series as a whole. This is essentially just the prologue. The main arc of the novels begins literally the second the last episode of the anime ends.\\n\\n\r\nThough if you're not quite that hardcore and simply want to watch a show casually for plain fun, then this adaptation on its own still does a good job at doing just that, and arguably that's really all you ever need to ask for when it comes to anime.",
            "date": "2014-10-13T10:55:00+00:00",
            "helpful_count": 215,
            "mal_id": 164685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=164685"
        },
        {
            "content": "The best way to describe Seirei Tsukai no Blade Dance is that it is basically a remake of Zero no Tsukaima with a few additional archetypes thrown in and a few intricacies removed.\r\nThe show is a very standard harem, somewhat in the vein of Infinite Stratos, where the main character is the only male elementaler in a school for female elementalers. Predictably, he quickly runs into a cast of about 5 girls who all have affections for him.\r\nWhat the show does well is pacing. Most harem shows have a few episodes of pointless stalling to focus on one individual girl and pretend that they aregoing to offer some romantic development. While some girls are more or less prominent in Blade Dance episodes, the story does continue to move forward each episode and there is very little in the way of wasted time (other than fight scenes that are perhaps too lengthy).\\n\\n\r\nWhat the show does poorly is originality. This is either going to comfort you if you like seeing the tropes that it will cascade one after the other or it is going to seriously annoy you if you were hoping to see something new here. We have \"you're not yet ready to fight me\" bosses, an average of two people fainting per episode, a main character that is constantly jumping into the paths of projectiles to save people, no developed male characters in the story, and girls who you've all seen before if you've watched one harem and played one or two JRPGs.\\n\\n\r\nFor me, I found it sort of disappointing. However, if you're looking for a story with a fantasy setting and can ignore its faults, this is a viable option.",
            "date": "2014-10-01T08:13:00+00:00",
            "helpful_count": 96,
            "mal_id": 163145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mirrored",
                "username": "Mirrored"
            },
            "url": "https://myanimelist.net/reviews.php?id=163145"
        },
        {
            "content": "Seirei Tsukai no Blade Dance or Blade dance for short is one of five anime adaptation of LN that simultaneously announced by MF Bunko J. For you who have watch many anime by synopsis alone you can see which direction this series will take. Yes this is harem romance comedy with fantasy setting and dash of action. Nothing new here but it's not like being unoriginal equal boring. Blade Dance is type of series that not try to hard to be deep or complicated series. Instead it achieve what it is trying to do becoming simple yet enjoyable series.\r\nNow we are talking about animation andart that is used here. Nothing groundbreaking or spectacular but it still have it's up and down. The best aspect here must be character design an important part on harem genre. Every character is drawn very attractive and very pleasing to the eyes. The downside here sometimes the background is not moving. But overall it is still good.\\n\\n\r\nAbout sound even though most of main cast played by rookie seiyuu but every one of them play good job and match the character they are playing. The best must be Yuuki Kana VA of Rinslet which bough up her ojou aura more than her LN counterpart. And about soundtrack it is decent but I still disappointed that Shukasai no Elementia the one used for PV is not used as ED or OP instead.\\n\\n\r\nNow the most important part of harem anime is character. We are starting with our main character first Kazehaya Kamito. As the only male spirit contractor in the series people are wary about him because in history the only male spirit contractor Demon King and as you can guess it create chaos in the past. He have good nature personality but is not above teasing his harem member. He is also competent fighter and neither wimp nor (really) dense character. Now move on to Claire. She is tsundere with heavy dose on tsun than dere. Thoughit can be annoying sometimes but over the time she really grow and become more likable. She also have rival and childhood friend named Rinslet. Rinslet like Claire is also tsundere but instead of tsundere to our male lead she is mostly tsundere to Claire. She is also have the most ojou appearance and voice in the series. Move to another character we have Ellis who is also tsundere who lean more on dere than tsun. She is serious and upstanding person. She is also act according to knight honor. We also have Fianna. She is princess also she is the tease on the series. As one of a few character that know Kamito secret she always take advantage on it. Next we have Est. The best character on the series. Bold, cute and charming. She is also very powerful spirit and Kamito trusted partner. The most defining trait of her character is that she like to wear nothing aside for knee socks. Now for the last we have Restia another spirit character. The most mysterious character on the series and the driving force behind the series. What she think and what she do is always mysterious.\\n\\n\r\nThis is relaxing and enjoyable series overall but since I've read the LN I know very well that Blade Dance haven't reach it's full potential yet. I'm definitely recommending this to you who like harem fantasy or who like lighthearted series in general.\\n\\n\r\nOn a side note the main story start right after anime end so for those who like this adaptation enough I'm strongly recommending read the LN. You can start at volume 4 where anime left off but I think it's better to read it from the start.",
            "date": "2014-09-29T05:47:00+00:00",
            "helpful_count": 42,
            "mal_id": 162879,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1187665.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeoAnkara",
                "username": "NeoAnkara"
            },
            "url": "https://myanimelist.net/reviews.php?id=162879"
        },
        {
            "content": "In every anime season there are always the usual category of shows that we expect.  There are those hyped shows that everyone wants to watch, there are the romance shows that prove to be either promising or not, and finally, we have that one show every season that you can tell, you can tell will be bad.  Seirei Tsukai no Blade Dance.\r\nStory (4.99/10): The story of Tsukai no Blade Dance revolves around a magical world.  In this world, there are spirits in which only women or girls, are able to make contracts with these spirits and use them as different weapons ofdifferent varieties and uses, better known as elemental waffes.  (Basically, Zanpaktou).  It is here where the only male elementaler (the term used to call the people who use the spirits) in the enrolls in the noble school of using learning how to use elemental spirits, so that he can finish a task in which the headmistress of the school has assigned.\\n\\n\r\nTo be completely 100% honest, this story is absolutely horrible in every way shape or form.  Tsukai is filled with so many plot holes that it makes SAO's two year timeskip seem minuscule, there is absolutely no focus on plot, pacing is a rushed nightmare, nothing is ever explained, and the ending is so unsatisfying that this show deserves to be shunned from anime history.  Maybe that's a bit harsh, but to say that this show has problems is an understatement.\\n\\n\r\nOne of the biggest flaws of the series I feel is its lack of explanation.  From episode one, Tsukai gives you its world, just straight up gives it to you without any backstory or explanation.  Kinda like getting a 2000 piece lego without any instructions on how to build it.  It basically expects you to already know what this world is and has to offer before minute one of the first episode is up, which is a very big no no if you want to get any sort of audience engaged with your plot.  As the series progresses, you do get some semblance as to what this magical world is, but it's so minuscule that it feels as though they shouldn't have even bothered at all.  They mention events within this world that apparently are very significant but are just so glossed over that it's really more of a fact than having really any effect on the plot in general.\\n\\n\r\nAnother big flaw of the series is how there is really little to no focus on plot.  Many ecchi shows have this flaw where the series tries to go all serious and explain something that's actually relevant and important, before switching gears completely and throwing a pair of breasts or pantsu at the screen to show that this guy is getting more attention than he should.  It's a really jarring transition because the show at some very rare points, actually makes itself sound interesting before going the complete opposite and talking about a loli with a bust complex. The series mostly focuses on an extremely clunky TWGOK style story where every \"arc\" features one of the main girls, solves their \"issue\", then absorbs them into the almighty harem of ever growing group of bitches.  \\n\\n\r\nIn addition, the pacing of the show is quite unbalanced as they mainly spend their runtime giving this one magical Infinite Stratos MC copycat five girls that literally throw themselves at them, whilst trying to \"maintain\" a serious sounding plot.  If you're going to make a show, go one way and not the other.  You can't do both.  \\n\\n\r\nAnd then we have the ending of the show.  Oh boy, was this a mess.  I'm that kind of person that always likes a satisfying ending to stuff.  Even if the plot itself isn't complete, as long as it resolves itself with at the minimum, most of the stuff getting wrapped up, I'm decently satisfied.  The main focus of this show was revolved around something called a blade dance, which is basically a teamfight between teams of people with contracted spirits.  They series ends literally right before the long awaited climax, which to be honest, is the worst way to end any series, period.  There is no resolution at all as it is all open to hell, they build all this \"tension\" of the importance of the blade dance in the twelve episode runtime just to shoot it all down with the credits rolling at the run to the what I assume to be the most critical part of the story, thus destroying whatever sort of credibility this show had because of just how much bullshit there was at the end.  And with that, it really just puts the nail in the coffin of just how bad this show is.\\n\\n\r\nOverview:\\n\r\n-  Swiss cheese story (cause of all the holes, get it?)\\n\r\n-  No focus on plot\\n\r\n-  Awful pacing\\n\r\n-  Worst...ending...ever. \\n\\n\r\nCharacters (5.00/10):  If the story is any indication as to how bad this series was, the characters will more or less reflect the same sort of detail and quality.  \\n\\n\r\nUp first is our main protagonist, Kazahaya Kamito.  As most harem MC's, you get your standard \"bread and butter\" copycat harem leader who is nice to everyone and gets all the bitches.  Aside from a few fairly decent traits such as not being reluctant to see girls naked, be a generic pervert, and having some actually good funny moments, he's not really much in terms of actual character.  He does have some good wit to him, but really, he's just your average harem protagonist.  This however gets much worse in terms of overall characters as he is the most detailed and most well-rounded character in this entire cast, which really isn't much. \\n\\n\r\nAnd then we have Claire Rouge, our token flat-chested, fiery, and tiny main female.  Plain and simple, this girl is your basic cardboard cutout tsundere who feels as though she \"needs to get stronger.\"  Literally, that's it.  There's nothing more to her character aside from saying her catchphrase \"burn in cinders!\" over and over again till is gets old like a broken record.  (You can get sick and tired of it from episode 1, I guarantee you.)  \\n\\n\r\nAnd then we have the rest of the female harem involving Rinslet and Ellis, both tsunderes (seriously, three tsunderes in one series?), Fianna, the walking pair of breasts with a pension to get Kamito's D, and Est, the kuudere sword spirit who will sleep beside you with practically no clothes on and follow your EVERY command despite looking like an 11 year old.  And then we have Carol, the maid who's only purpose is to act as Rinslet's dere side.\\n\\n\r\nApart from them, you have the supporting cast of random characters that I won't even bother mentioning since their appearances are so scarce and so varying (in addition, their names are freaking long), that I feel as though there is no point to them even being mentioned.  There are however a couple special cases in this cast that I feel deserve a little bit more insight on.\\n\\n\r\nThe first is the Calamity Queen.  This character just feels so useless to me as a character just in general.  For one thing, she never shows up in the series.  Not in person, only in flashbacks.  She's a part of Claire's character development (as small as that is), and is only ever really mentioned.  To me, this seems like a big waste considering how much they talked about her in the series, and never even did anything to make her seem any more important since the character apparently had some motivations to do what she did, but was never explored.\\n\\n\r\nAnd finally, what I feel was the biggest waste in the series was the character known as Restia.  This girl was by far the most mysterious character and was legitimately the most interesting character in this entire series.  It's shown in this series that she has a connection to Kamito and I felt as though that was the most defining moment this series had as it delved a bit more into the story and it really made something in this series, regardless of how small it was, shine.  I feel as though she was the most underused character in the series and it was really a shame since her motives were nicely shrouded and gave something nice that this series was seriously lacking.  In the end though, we got a character that basically appears out of nowhere, titters, then leaves mysteriously.  There was a lot of underused qualities that Restia had, and it's a shame she wasn't explored or used more than she was.\\n\\n\r\nOverview:\\n\r\n+/-  Meh MC\\n\r\n-  3 tsunderes\\n\r\n-  Completely forgettable supporting cast\\n\r\n-  Very underused character\\n\\n\r\nArt and Sound (7.11/10 and 6.06/10): The art of the series is actual a rather nice and aesthetically pleasing style.  There's no real standout moments for the actual animation as it's pretty standard/consistent all the way through, but the color scheme and the overall look of the show is rather nice.  (However, if you don't greatly dislike moe style characters, I suggest you stay away from this.)  \\n\\n\r\nWhile the art in general is nicely detailed and very nice-looking, there is one very big flaw that this series has, and that is its ecchi.  This show is very big on ecchi and basically strips its girls naked just to reveal to you that \"it's this kind of show.\"  (Hell, the opening scene for Claire is a scene of her bathing in a lake with Kamito \"peeping\" in.)  The ecchi for this show is quite extreme and they really don't hold back on flaunting their girls.  They even go to the extent of doing a close up shot of any single girl's chest or lower torso region during any transition between the first half and the second half of the show meaning, you're basically forced to watch an ecchi scene.  So if you really don't like eechi, this show is not for you.\\n\\n\r\nThe music for this series is meh.  There's nothing really noteworthy about it.  I don't like the opening, the ending is ok, there's nothing really much to say.  It's generic, it's ok to listen to, but it's not really a memorable track.\\n\\n\r\nOverview:\\n\r\n+  Decent looking art\\n\r\n+/-  \"Ok\" music\\n\r\n-   Ecchi get in the way of a lot of things\\n\\n\r\nPersonal Enjoyment (5.49/10): To be honest, I expected this show to be bad.  From the very beginning before it even aired, reading the synopsis, I knew that this series would be disappointing and basically, bad.  However, there was something that always pulled me to watch the next episode.  An almost unexplainable force pulling me back to watch more and more of this awfully created series.  Strange.  Anyway, off to the three questions.\\n\\n\r\nDid I like this series?\\n\\n\r\nNo.  Just straight up, no.  There were too many plot holes, there was absolutely no background explanation to give some semblance of what this magic world was, and to top it off, the characters were beyond bland and overused.  Not to mention the ending being one of the single worst endings I have ever seen.  But somehow, regardless of the horrendous amount of flaws, I continued watching with slight eager anticipation.  (I don't know why I did.)\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nApart from the rather decent looking art and fluid action, everything.  \\n\\n\r\nWould I recommend this series?  \\n\\n\r\nHonestly, no.  There are so many flaws with this show that it doesn't even make it a good fluff show.  In my opinion, there is nothing about this series that makes it stand out in any way, and I wouldn't recommend this to be put on anyone's list.  It's poorly written, there are no good characters (except the mysterious and underused Restia), and the plot points of this series were incredibly rushed and overall, just very jarring to watch.  \\n\\n\r\nOverall Score: 5.01/10",
            "date": "2014-10-18T21:51:00+00:00",
            "helpful_count": 21,
            "mal_id": 165241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=165241"
        },
        {
            "content": "It's been awhile I haven't done a review so I decided why not, fair warning this review is only for the anime I won't included aspect from the LN. I know alot of you won't like it, but stick with me ok, I'm a bit rusty.\r\nAnyways Seirei Tsukai no Blade Dance doesn't seem like an all out series, but for those who don't know this is all just the prologue, the actual story doesn't happen until a bit further on. But again I won't be getting into that, just saying for those who came from the LN and starting to watch this, don't expect anythingto great from it, anyways I'm prolonging now let me just get started, cause no one cares about introduction.\\n\\n\r\nStory: 6\\n\r\nSo this story is obviously that of a fantasy, includes magic, Demon Lords (Maou), and knights. These \"magicians\" aren't refer to mages like most magical anime, they are called \"elementalers\". Each Elementaler controls an element in the form of a contracted spirit. These elements as seen in the anime are in form of fire, water, wind, earth, and ice. One of these Elementalers is known as Kamito Kazehaya who meets a girl bathing in the forest, she is known as Claire Rouge a fire elementaler, from this they join into a team to compete in a tournament known as The Blade Dance. Without going into much summary, this story is pretty bland, Kamito is the only boy elementaler in the school, surrounded by a sea of girls. His goal is to win the Blade Dance to get his wish granted and to chase down his former contract spirit Restia. It's not a touchy story, it's more of an underdog type of story, those who come from troubled past with no power try to go against odd to achieve strength and victory.\\n\\n\r\nArt: 8\\n\r\nThe art was pretty good in this series, well drawn, the key animator of this series should give themselves a pat on the back for this. Background was aesthetically beautiful, and the characters were so well made, you can see that they aren't just based with model with different color hair and eyes, they put some effort into making each character structurally different, with no disproportional body parts. Hats off to you animators, job well done.\\n\\n\r\nSound: 5\\n\r\nSound pretty generic nothing very memorable as per say, the opening was ok and ending was decent but nothing that you will download into your mp3 of course. As for the voice actors, the main characters voices were well picked but Restia's voice (even though she wasn't a main) just was too kiddish, I understand they were aiming for a bit of a seductress voice, but it's a bit let down.\\n\\n\r\nCharacter: 8\\n\r\nI'll list each of the main characters so you guys have a generic idea of each of them:\\n\\n\r\nClaire Rouge-  A tsundere Flame Elementaler, her contrated spirit is a flame cat name Scarlett. As stated she is a heavy Tsundere, instead of seeing Kamito as her crush/friend she keeps stating that he is her \"slave spirit\" and like most tsundere out there she's flat chested and very insecure about it. Typical right?\\n\\n\r\nRinslet Laurenfrost- Also a tsundere, but an Ice Elementaler user, her contracted spirit is a ice wolf name Fenrir. She's a girl who never truly say what she means/want, so usually her maid translate for her. She is a very prideful noble, and a close friend of Claire, even if the 2 don't admit it.\\n\\n\r\nEllis Fahrengart- Another but yet very soft tsundere, she is a Wind Elementaler, her spirit is that of a Eagle name Simorgh. She is a knight who gets flustered around Kamito easily, a good cook too, and very impressionable too, she doesn't have a bad past like the others, but her present was getting a bit muggy\\n\\n\r\nFianna Ray Ordesia- No worries she's not a tsundere, she's just a playful teaser, even though she has meaning behind her flirts. She is a Light Elementaler her spirit is like a huge knight known as Georgios. She is a \"Lost Queen\" a forgotten princess due to the events before the series, She knows Kamito secret alias and sometimes use that as leverage against him.\\n\\n\r\nTerminus Est- The best girl in the series, ok personal opinion aside she is a spirit herself, a powerful sword spirit known as a demon slayer. She is more comedic relief and a bit of a fan service type character, suggested to have chocolate licked off of her, or having Kamito \"Eat her\" and always appearing naked, yet draws the line when asked about her kneesocks, which she refuses to remove. She is an ecchi but moe loli, and that's a win, I kidded of course.\\n\\n\r\nKamito Kazehaya- The main guy and one of those rare harem MC who isn't useless, not much to explain but to say this guy pretends to be dense, he just rubs off the girls antics. He is both a Dark and Light Elemantaler, Dark as for the event before the series, Light during the show, he controls Est. He's also known as a Demon Lord successor and a Demon Lord of the Bedroom.\\n\\n\r\nToo many tsundere characters however, so far warning, if you don't like that character trope, you'll get a little ticked off.\\n\\n\r\nEnjoyement: 7\\n\r\nIt was good, the ecchiness was pretty soft compare to most out there, because well that wasn't the focal point and they made sure to incorporate those moments at reasonable moments, same for the comedy. They kept the action with the action, kept comedy with the comedy, they rarely ever tried to intertwine with each other, giving each scene its own focus without taking anything away from that plot use. So very well balanced, and seeing that was a bliss to enjoy.\\n\\n\r\nOverall: 7\\n\r\nWow usually my personal rating and my review rating ever match but it seems this time it did. Again like I said at the beginning this story is just basically the \"prequel\" sort to say, so for those coming from the LN to watch it will probably be boring to you, but if you came to see Est animated than by all mean have fun. I don't really have a closing statement for this, but hope you guys got something out of this, and it was helpful. As always enjoy!",
            "date": "2015-04-13T15:31:00+00:00",
            "helpful_count": 15,
            "mal_id": 185557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3768051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/elementkg",
                "username": "elementkg"
            },
            "url": "https://myanimelist.net/reviews.php?id=185557"
        },
        {
            "content": "Seirei Tsukai no Blade Dance: light novel adaptation! Yeah! You know what that means? Deep, meaningful themes? Character Development? Great Dialogue? Hahahaha, hell no. As with most (if not all) light novel adaptations, Blade Dance is a romance/comedy/harem/fantasy anime catered to the otaku audience. My expectations for this anime were insanely low and all I expected was nothing but a generic, mindless fanservice anime and that's exactly what I got.\r\nStory (25%) - 2/10\r\nThe story is as generic as it can be. It's nothing but an obvious setup for a harem and there isn't much thought put into the setting. Now you may be thinking \"Sure,it's generic but 2 out of 10?? That's a bit harsh, don't you think?\" so allow me a chance to explain why. Usually, shows with no plot (i.e. slice of life) get an automatic 5 from me, a well-handled plot always scores higher; however, stories that have plots which only exist for empowerment fantasy/wish fulfillment and nothing else get a 1 point deduction. Blade Dance gets another point deduction for not doing a good job of explaining its setting or conflict. Restia's back-story and motives are never explained so she falls flat as a villain. It is also never explained why Kamito is the only boy with powers, which actually makes this show really weak as empowerment fantasy. Since the viewer is expected to step into the shoes of the MC, if it is never explained why the MC is special, then the viewer will not feel special (or \"empowered\") either. From a story-telling perspective, I see no reason why any random boy couldn't also gain powers and get chicks, it's not like anything is stopping them; thereby making Kamito look ordinary and not unique. Hell, even Infinite Stratos gave a reason as to why the MC is special. Sure, it makes no sense and is never explored, but at least it was there! Another point gets deducted for the fact that the sub-plots are so poorly managed. We are told that Claire's sister went rouge for some reason and Claire wants to get stronger to bring her back or something, but we are never told why. No flashbacks about their memories together, no reason to believe her sister is innocent, there is absolutely no motivation for the audience to care about her; simply telling us they're sisters isn't enough, you know. Have the writers never heard of Fullmetal Alchemist?\\n\\n\r\nArt (20%) - 6/10\\n\r\nThe art style is also very generic, it is extremely easy to confuse it with a hundred other shows. The animation is pretty decent, with the show being rather action-oriented. The CGI isn't bad at all, but nothing stands out in terms of art. It's only slightly better from what you would expect from modern anime.\\n\\n\r\nSound (20%) - 6/10\\n\r\nThe OP is sung in TERIBORU ENGURISU (yeah, it's really that bad) which drags the rest of the soundtrack down. It's a shame actually, the other songs weren't half bad and some pieces, particularly those that used the violin, were actually pretty good. Oh, well.\\n\\n\r\nCharacters (25%) - 3/10\\n\r\nI already mentioned the worst aspects of the characters in the Story section, so I won't bother to repeat them. Aside from those, the side characters are just so predictable and generic that I can't really find a reason to care about them. Their personalities can basically be described by their hair colour.\\n\\n\r\nRed=Tsundere; Blonde=Arrogant Ojou-sama; Blue=Cool Beauty; Light Blue=Quiet Stoic; Oh the originality!\\n\\n\r\nEnjoyment (10%) - 5/10\\n\r\nSince I am a male teenager, I can't exactly say I was bashing my head on the table while I was watching. It's enjoyable for what it is and as long as you keep your expectations low, you won't be disappointed. My main problem with it is that it's just so generic and predictable. I can hardly tell it apart from Seikoku no Dragonar and that only came out one season before this! Just watch Trinity Seven when it airs this fall. I read the manga and it's the same thing as this but better in every way. It has a better plot, a more OP protagonist, a bigger harem and after you watch it, I'm sure you'll forget all about Blade Dance. Don't waste your time with this anime and instead watch something meaningful like Ping Pong or whatever.",
            "date": "2014-10-02T01:17:00+00:00",
            "helpful_count": 13,
            "mal_id": 163245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4091451.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BlackPrism",
                "username": "BlackPrism"
            },
            "url": "https://myanimelist.net/reviews.php?id=163245"
        },
        {
            "content": "Ok, so what we've got was another one of those harem based fantasy anime, where it was some sort of \"Infinite Stratos\" kinda of thing where a school for girls was suddenly been invaded by a guy who can do what them girls can do kind of thing, soooooooooo, generally there is no story except a plot where a red head bitch was trying to have the guy all for herself because of what he can do and what he has so that she can win in the so called \"Blade Dance\" and the rest was the usual them girls competing for the guy's affection,which btw make the story \"Poor.\" ( Should I explain more? Mr. Mod) The art, well, what do I like about it.......FANSERVICE!!!!!!!Yep, seeing Claire and Fianna's pantyshot was good, there were also the moe that come with it when it comes to the girls attire that I find very cute, although, Claire and Fianna's naked scene were at bit regulated, seeing them in such naked glory was enough for me to give this anime's art a \"Good.\" The sound was good since I kinda like the opening theme and I also like the VA's who did Claire, Fianna, Rinslet and Est's voices, however Ellis and Velsaria's voices were a bit too matured, in fact it would have been better if Ellis's voice would have been better if done by Itou Kanade and Velsaria's voice should have been done by Hikasa Yoko. Character, I gave it a \"fair' co'z even though the characters where the usual cast that one would find in a usual harem theme anime, them characters had somehow proven to be different from the rest, co'z all four of the harem member where portrayed as fighters and needless to say there isn't that usual bimbo and one who has stays on the sides that come with every harem based genre, in fact everyone were competing for the guy's affection, also there is the part where I really hate Claire for being this bitchy lass that she is somewhat of a possessive girl who claims ownership of Kamito, I'm also disappointed of Kamito for not only being this usual harem guy, but being forgetful of Fianna  whom he save a couple of years back, but then again him getting cake on his face was pretty funny which was the enjoyable part where I give it  a 'Good\" coupled with the fanservice and moe, but overall imo this anime deserves a 6 though it was enjoyable it was still the usual and that all I have to say.\\n\\n\r\nMy ratings:\\n\\n\\n\r\nStory: Poor 3.\\n\\n\r\nCo'z it was the usual harem based fantasy anime.\\n\\n\r\nArt: Good 7. \\n\\n\r\nThe score was for the moe, fanservice and Claire's panty shot.\\n\\n\r\nSound: Good 7.\\n\\n\r\nIts for the opening and the VA's who did Claire, Fianna, Rinslet and Est's voices.\\n\\n\r\nCharacter: Fair 6.\\n\\n\r\nSince the harem members even though they're the usual harem, they were portrayed differently, but still imo it deserves a 6.\\n\\n\r\nEnjoyment: Good 7.\\n\\n\r\nSame explanation as the anime's art category.\\n\\n\r\nOverall : Fair 6.\\n\\n\r\nAs I've said, it maybe enjoyable, but it was still the usual. (Do I need to explain more? Mr/Miss Mod)\\n\\n",
            "date": "2014-10-01T11:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 163163,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2004376.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Baddie007",
                "username": "Baddie007"
            },
            "url": "https://myanimelist.net/reviews.php?id=163163"
        },
        {
            "content": "This show is what i would call the ultimate surprise. This show is something that comes out of no where. You just have to get through the cliche infested first episode\r\nStory wise the story itself is good, What makes this story great in my opinion is the back stories of every character and how they all seem to come together with each other. That is the main reason i personally love this story. Ren Ashebell win the blade dance years ago greatly influences all the female maidens at the school. Restias actions greatly influences Kamito and Greyworth. That to me is a great story, wheneverything connects with each other.\\n\\n\r\nCharacter wise i find this show to be fantastic. While the characters themselves may be a little cliche, i find that this show has some of the most intriguing back stories to date. Almost every character that we see has this back story that is full of depth and completely drives them towards their goal of the blade dance or their goals outside of blade dance. A person favourite thing about the characters are the female characters. You see this school teaches elementers the ways to use their powers, but all the elementers are female. So they haven't been around boys their age that much so when Kamito comes in it just brings up the funniest situations like when Ellis says in public that Kamito is her first yet by first she meant first boy she held hands with. It honestly was a shining part of the show.\\n\\n\r\nArt style is something i pride myself on. I take a huge look into art style i find this show to have one of my personal favourite. I like color and this show is full of it and there are some moments that just leave you in awe.\\n\\n\r\nMusic is bloody great. While the songs in the show are pretty good i find the OP to be amazing and the ED to be catchy as all hell.\\n\\n\\n\r\nOk im going to be honest. You have more then likely read most of this already. So im guessing that you should already know i enjoyed the hell out of this anime\\n\\n\r\nOverall this show came the hell out of no where. One reason i choose it was because of the art design and that it resembled Dragonar academy. I thought this anime would fall around the same score a 7 or 8. NOPE! This show has amazing characters, pretty damn good story and pretty damn good visuals and music\\n\\n\r\nSo it says ten because honestly id give it a ten\\n\r\nIs it a little over board? maybe\\n\r\nBut when i grade animes i grade heavily on enjoyment because in the end that is what matters the most",
            "date": "2014-10-01T03:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 163111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4056579.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Guru93",
                "username": "Guru93"
            },
            "url": "https://myanimelist.net/reviews.php?id=163111"
        },
        {
            "content": "You can’t be tricked into watching this show expecting it to be something different, the cover makes it very clear what it is, this isn’t a bad thing, but the content is.\r\nI always thought i was a sadist, but apparently i’m a masochist, since i made myself sit through this whole thing.\r\nSuper powerful teenager who’s the only character with a japanese name accidentally meets naked tsundere that proceeds to attack him. Holy shit doesn’t that sound like literally every single show in this genre? \r\nI don’t think using character archetypes is necessarily a bad thing, lot’s of shows have showed us that you can dogood things with them if you have some idea of what you’re doing. A character being a tsundere doesn’t immediately denies her of any possibility of being likeable or even a good and interesting character, archetypes appeal to a lot of people and they make writing a bit easier, that’s why they’re popular. However, STBD doesn’t even attempt to do anything with these characters, it actually makes then significantly worst because they are too present and toned up, to the point where they’ll be in a important fight, then Kamito protects one of then, and the others show that they’re jealous and start wanting to argue and change their positions in the battle, are you fucking serious? It’s not even fun or funny anymore, just annoying. Claire will take her whip out and say the most boring and predictable tsundere line ever, then they’ll drag the joke for some time, and repeat. Making a character sad and then happy again is not development, and being bad at cooking is not a personality trait. What makes me shocked is that this show didn’t even tried to make sad backstories for the character, Claire’s sister doing bad things doesn’t make Claire any more interesting, the same goes for Ellis. When you make every single important girl in the series fall in love with the MC you limit a lot the development those character’s can have, this is just outright bad writing. Imagine a series with this exact same setup, but the girls eventually go on and start dating other guys or even dating between themselves, wouldn’t that instantly make it more fun? This is a power fantasy, so it needs this bullshit, however, if you have watched Rakudai Kishi no Cavalry, you know you can make it into a decent show.\\n\\n\r\nThe power levels and magic system in this show are terribly poorly established, we know there’s a contract and that the contracted spirit has two forms, and that’s all. There’s some sort of magic, that only one character uses for the whole show and is never explained. The character’s strength is never made clear, the show starts with legit one of the worst, if not the worst action scene i have seen in my life, it’s super badly directed, choreographed and animated, Ren Ashbell does a jump, and then he wins. What do we learn by that? Nothing. Having two characters we don’t know fighting in a confusing scene for something we also don’t know is not a good idea. The spirits have elements to then, hence “of the elementals”, but it is actually never important and gets brought up just a couple of times in an attempt to make the fight to seen interesting or dangerous, of course our main girl has fire magic and her friend-not friend has ice magic. Rinslet actually isn’t important at all, she just appears and disappears whenever they need her and makes the same joke about the maid every single time, on a later fight she gets immobilized for a few seconds and says “I can’t move anymore” after she gets rescued, okay. Later on the series Kamito starts hack’n’slashing at max speed for no reason at all. They don’t even have the decency of showing us the actual fights to go up the ranks in the school, there’s not a attempt to make other kids be antagonists and no interest in showing their development, well, i guess there isn’t none, but the point is we just get told that they are getting better and going up, there isn’t even a still shot of the ladder or anything. The fights that do get shown are so incredibly badly executed that they can’t even establish the power levels with a loose soft magic system where the whole point is that the MC is overpowered, that’s how bad they are. Also, why does everything in this show sound like an explosion?\\n\\n\r\nRemember how people from Raven are supposed to be problematic? It isn’t surprising that that never is important either, we actually only see that once when they destroy Kamito’s small house, which seemed like more of a comedy scene than a serious one, since that's why he spends the rest of the show in Claire’s room. The supposedly problematic people from Raven (which are literally only the two of then) are the ones who go out saving people in the city because the school knight's are useless, what is surprising is that they never bring attention to that, why wouldn’t you? \\n\\n\r\nThe most likeable character was Jio Inzagi because he kicked every single annoying character’s ass he saw, but he still lost because Kamito with a wound that should have killed him is too strong, Restia even admits that he could win in that state.\\n\\n\r\nNow about the fanservice, it’s decent at best, aside from Est’s delicious legs everything is just mediocre.\\n\\n\r\nI could still go on about how Spiritual Authority is only created to make a bad scene of Claire being attacked by a slime, or how Ellis is a fucking knightess and needs extra classes to read the most basic magic fundamentals that even the viewer knows, well, actually, i just went through that.\\n\\n\r\nThe second best thing about this show is the ED, it doesn’t sound totally generic and tries to be action packed like all these OP’s try to, i really like the bagpipe sound and it’s kinda cheery, the girl’s illustration are also the best looking images in the whole show.\\n\\n\r\nAnd the best thing about this show is when it ends, because you’re relieved of the pain.\\n\\n\r\nFarewell stupid light novel adaptation, and i hope we never meet again.\\n\\n",
            "date": "2018-04-26T09:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 279058,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4977819.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Derykasd",
                "username": "Derykasd"
            },
            "url": "https://myanimelist.net/reviews.php?id=279058"
        },
        {
            "content": "I was pleasantly surprised by this one and it's quite a shame that it seems like it won't be getting a second season as lots of plot points are left unresolved. If you really value having closure and you are not willing to read on I would avoid this one, you will find no closure here.\r\nWhat we have seen so far of the plot is not particularly complicated. Kamito Kazehaya is a boy who can utilise magical powers that usually only girls can use. He attends an otherwise all female school and has a shady past.\r\nThis one is another good example of how to properlyexecute having a story alongside being an ecchi show. Lots of shows usually can’t get the balance between these factors down and end up being heavily weighted in one direction or another. This is not the case here and I can safely say that it's got the mix of Comedy, Action and Ecchi down almost perfectly as none of the aforementioned elements spent long enough in the spotlight for me to tire of them. \\n\\n\r\nI'm aware that there has been a little disagreement over the quality of the characterisation and voice acting when it comes to certain characters but as someone who has not read the LN, I feel as if they pull it off. I personally don't particularly enjoy fanservice of characters I'm not invested in but as far as I am concerned Blade Dance succeeds in giving the cast proper backstories / does not fall into the trap of having them be cutouts with slightly different bust sizes. A clear victory for those who like a little plot to go along with the 'plot'.\\n\\n\r\nAs far as characters go, special mention must be made to Ai Kakuma as Terminus Est who was just perfect / really stole the show. Easily my favourite character from this as nearly every moment Est was on screen was comedy gold. Having long silver hair, knee socks and that amazing voice helped a little as well.\\n\\n\r\nIt's not all roses however as certain sections of exposition can get a little cliché at times. I'd like to spotlight the scenes with the headmistress as these where about as subtle as a chainsaw. I was half expecting her to break out the Dr Evil pinky laugh whenever the show sloppily attempted to foreshadow her 'mysterious' plans. Keep in mind however that this is an action-comedy harem; cheesy moments and unintentional comedy are part of what you are signing up for! \\n\\n\r\nThe actual world that the story is set in could have done with a bit of fleshing out but it's sufficient. The majority of the story takes place in a small number of locations that, while nothing new, are well drawn and detailed. \\n\\n\r\nThe music compliments the show well, the incidentals are a little forgettable but they work well in context and the fight music is usually intense. (You get a pass despite blatantly ripping off the Pirates of the Caribbean theme for your main battle theme.)\\n\\n\r\nSpeaking of, the action scenes are really impressive when you take into account the budget. They aren’t treading any new ground with the effects or battle style but it executes all the old tropes well enough that you should still enjoy it. \\n\\n\r\nOverall this is a short, enjoyable romp through a rather basic setting with funny and interesting characters. Yes, it's walking the path well travelled as far as the plot goes but it walks it well.\\n",
            "date": "2014-10-25T10:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 166125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653305.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Doubleagent",
                "username": "Doubleagent"
            },
            "url": "https://myanimelist.net/reviews.php?id=166125"
        },
        {
            "content": "Seirei Tsukai no Blade Dance\r\nThis anime wasn't have a fantastic story that can make you hold breath during the show, but what makes me can still enjoy this anime..??.\r\nFirst character, character development in this anime is very nice, indeed not too influential to story, and so many tsundere character in this anime, but character in this anime have a charm of its own. and my favorite is Terminus Est and Ellis Fahrengart.\r\nTerminus Est is the best girl in this anime, loli who always melting situation, she is reported as a powerful sword spirit known as a demon slayer, she sometimes put a chocolate in herbody and ask Kamito to lick it, and she is always naked but she doesn't want to take off her kneesocks, pervert indeed but her childish personality which makes she is interesting.\\n\\n\r\nEllis a soft tsundere girl, and wind elementalers that have a eagle spirit named Simorgh, she is always shame and became awkward especially when it concerned with Kamito, but that's sweet side from Ellis.\\n\\n\r\nSecond music, i love music in this anime, moreover ending in this anime i love it.\\n\\n\r\nThird atmosphere, i don't know why but i comfy with atmosphere in this anime, and last art, art in this anime is pretty good. \\n\\n\r\nMaybe just that much i can give about what make this anime can enjoy by you, i tell you this anime wasn't have a fantastic story but you can still enjoy this anime.",
            "date": "2016-07-13T11:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 223928,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5199507.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hilvisa",
                "username": "hilvisa"
            },
            "url": "https://myanimelist.net/reviews.php?id=223928"
        },
        {
            "content": "Here, we face your typical harem anime. Normally, I put them down the moment I notice it's barely going very far from the genre, but I had faith. The first episode of this anime opened alright, with our male lead being pretty confident through the typical \"accidental\" situations you're used to in these anime. Take those quotations strongly, because every veteran harem fan knows why I put them there. Nothing is ever an accident in harems to the females.\r\nBecause of how rough this anime is to me, I don't even want to talk about it very much, because it barely does anything different from anotherharem, but I am a bit upset it has such a high score on this website, so I want to make sure it gets a strong amount of negativity somewhere for the more innocent anime viewer who will believe it is good. Normally, I want to start with positives since that's the part you are curious about, but sadly, they will be spaced as I go on. Most of this will be negative and I have no way to really make a separate positive section.\\n\\n\r\nLastly, I will only really go over all of the \"harem\" aspects, not the story. I feel sad to say, the story barely interested me because of how overshadowed it was by the genre it is in. If you want a review that covers it more, read one of the more positive ones. Then after you're done, come back here to read why the comedy rarely funny.\\n\\n\r\nWith all due respect, I know a lot of people enjoy abuse humor, but I do not know why you do. It's funny to me whenever there's a cause for it. Despite ironically enjoying random comedy a lot, where absurd things happen to even the most innocent characters, I never can bring myself to smile whenever an innocent character gets punished, though due to how often it happens to male characters, I actually do, darkly enough, laugh at innocent female characters getting punished. They deserve it way more in my book, so even if they're innocent, I usually get a laugh out of it since I'm not used to them being in trouble. I have special exceptions, though, if it's a female character with a very good personality.\\n\\n\r\nSo, let us begin. If you are a fan of the anime already reading more reviews to see how other people feel, please avoid mine. You will only get mad at me after you read it.\\n\\n\r\n(SPOILER WARNING)\\n\\n\r\nThe first episode opens very abruptly. Out of nowhere, we are immediately treated to a generic harem scene without any context. I am excluding the pre-opening part showcasing the battle since it's so subtle it's not worth mentioning at this point. But, anyway, you are thrown immediately into a standard harem scene, where the male happened to walk by a female bathing. I am fully aware I'm a broken record at this point, so I try to keep any discussion about these scenes brief, so I will get to the point. He stares, clearly not his fault, she gets angry and tries to punish him. Hahahah- not really.\\n\\n\r\nWhat is the standout for this particular scene, however, that made me feel the need to talk about it fairly long? Well she is trying to punish him, she accidentally breaks a tree behind her, which would have literally flattened her. After finishing this whole anime, I wish that tree killed her. But sadly, our male lead decided to save her. So, now you're expecting me to bring up how she's suddenly \"appreciative\" of him, right? No, it was apparently his fault for pouncing on her well she was naked and he is still punished. Yeah.\\n\\n\r\nRemember earlier, I said I had high expectations because the male lead was confident, which starts around here. He mentions she is wearing panties of a particular color (became a brief running gag during early episodes) and she corrects him, only to feel bashful. From there, he got a bit cockier and provoked her in adequately funny ways. It gave me hope this would be a harem more toward KonoSuba where the male lead has a bit of a backbone. Sadly, it dries out pretty quickly going forward.\\n\\n\r\nI am not even kidding, this anime feels the need to add a ton of these \"accidental\" scenes way more than it should, given the \"elaborate\" nature of its story. You can't take most of it seriously because it truly doesn't feel like there's any character development that is worthwhile besides the male lead's struggles. Most of the females introduced almost always find some way to \"have enough\" with the male character the moment they're even remotely confused. Please, don't think I'm exaggerating here, I do try to see the best in every anime I watch, but I could not with this one and its female characters.\\n\\n\r\nI will try to bring out the positives one first before I really get into this. Yes, positive \"one, you did read that as singular. Ellis Fahrengart, a female character who still fell victim to the \"I do not want to hear it\" harem trope of punishing the male lead, almost always apologized every time she did it, and whenever she did walk in, the situations actually were fairly worthy of being judged negatively. I mildly enjoyed her development, going off what this anime calls \"development\" that is, and I really wanted her to be the one to kiss Kamito. Er, more on that later. But, overall, she was the best female out of the entire cast. Her voice actor is talented at changing her tone though, as she has two unique tones in the anime for being serious and bashful. Had Est had more development, I would have talked about her as well, but she is probably the only other tolerable female character due to her stubbornness being more adorable than aggravating.\\n\\n\r\nThe other female characters aren't very lovable, but not horrible. Rinslet is just your typical pompous aristocrat who feels the need to talk down on everyone and gloat at how superior she is. Occasionally, she has pretty good lines of dialogue, such as when she was talking down on other nobles at one point, but overall, she's average. You can't like her very much, but also can't hate her.\\n\\n\r\nFianna is the female character designed to tease Kamito, and as you can expect, that means she has blackmail on him. She is the only one who knows of his former identity, \"Ren Ashbell\" which is the character seen fighting an unknown female combatant from the first scene of the anime and winning that takes place before the \"comical\" harem shenanigans began later. That was actually just Kamito in disguise. He met Fianna as a child, defeating an enemy that was about to kill her, but Fianna recognized the swordplay at work and figured out that Ren Ashbell was the alias for Kamito Kazehaya. So, they both made a promise that he would see her again in a few years. Needless to say, he never did that and also forgot about her, so she held it against him and decided to pick on him for the rest of the anime. Naturally, meaning anytime Kamito wanted to backtalk her, she threatened his identity. Claire never finds out he is Ren Ashbell, so yeah, you can just assume the worst in that she holds him on a leash for the rest of the series whenever there's \"comedy\" with her.\\n\\n\r\nHere we go, I can finally let loose with the female lead. Claire Rouge sucks. I really dislike this character and have no sympathy for her at all, no matter how \"tragic\" it is that she wants to find her sister. She is picked on a lot by other students of the school, but I enjoy these scenes because of how obnoxious her character is. The whole point of a \"warn down, depressed\" character is they get bullied, they feel sad and our male lead is here to comfort them. You feel for them when they don't have the strength to fight back anymore, but not when they let out their anger on other people. Now, I do know this is how some people handle this, but it bothers me when she gets mad at the people who do care for her. So, let's bring up that other scene I mentioned earlier.\\n\\n\r\nThe most positive scene I know of from this anime with Claire is when she is fighting Restia's creature from the netherworld. Kamito, the male lead, feels anxious to fight the creature due to facing negativity over seeing Restia again, his former contracted spirit. Claire, amazingly, felt bad for him during this and noticed that he was sad. Not knowing him very well, she only thought of one way to raise his spirits, though definitely in a way that I didn't expect. I assumed it was just going to be some positive reinforcement, or her apologizing for calling him a slave so often, but instead she just makes out with him for a bit. This is the only action Kamito gets in the whole anime and I actually admired how quickly she was to do this, as I expected her to be far more bashful about it due to the way she treated any \"intentional\" moment he shared with another female character. I expected a hug, if anything, when she approached him, but instead it was a full on kiss. It raised his spirits, and he was ready to fight. From here, I was a bit more optimistic about Claire and assumed she was now dating Kamito going forward.\\n\\n\r\nSo, they do fight the creature, and another surprising development occurred immediately. The characters have contracted spirits and Claire's is Scarlet, a \"fire-cat\" that can turn into a whip as a weapon for her, or \"elemental waffe\" as the anime calls it. The fire-cat is capable of fighting outside weapon form and attempted to save Claire from dying, only to be eaten alive by the demon in front of Claire's eyes. From here, well you know, I'm not completely heartless. Now, Claire has gone through hell by the school, wants to know the origin of her hated sister and has now lost her closest companion. I felt sad here for the first time in the whole anime, though also the only time. I was ready to believe her character would finally have some notable development right here, as Kamito now had a reason to be a spirit for her. Oh, but of course, it was wiped way not that long after as we found out Scarlet was still alive, albeit drained of power. And just like that, my old thoughts of Claire immediately came back.\\n\\n\r\nDespite the \"bonding\" moment she had with Kamito, she was very quick to go back to their old ways after that fight, as she once again wants to \"burn him to cinders\" whenever she misinterprets a situation. I told you before about Est briefly, how I considered her my second favorite female character as far as development goes. Earlier in the anime, she always sleeps in Kamito's bed with him. Kamito acquired her as a contracted spirit after saving Claire (yes, saves her twice in the same episode, many more times too, but she never respects him enough to not assume the worst of an accidental situation), but her non-elemental waffe form debuted a bit later. She is the youngest of the female characters, as far as appearance goes anyway, and is introduced being fully nude in Kamito's bed. She insists that her \"thighs\" are the most lewd part about her body and gets offended whenever Kamito brings up why she still wears thigh-highs, saying it is not as lewd as her being entirely naked above them. Mildly comical.\\n\\n\r\nSo, yeah, Claire walks in when this first happens, misinterprets \"I am going to burn you to cinders\" whatever. This same sequence happens a bit more than I wanted it to, with the only comical one being when Kamito wakes up and immediately opens his blanket to see Est is not there and sighs in relief. I actually mildly enjoyed this scene. I brought up the entire story of him meeting Est as the main point of the \"harem\" humor, usually being whenever a girl walks in on him in the bedroom and Claire, every single time, misinterprets it and punishes him with her power.\\n\\n\r\nHonestly, I knew this was standard already, but what really bothered me was one particular scene. Sadly, Ellis, despite the positive marks I gave her, has the worst one in the anime, even worse than all of Claire's combined, and that is why she is still not really a character I \"like\" a lot in the anime, but just appreciated she had some development. At one point, she invites Kamito over to her house, easily her worst scene in the whole anime. And the scene with her in the maid outfit really, really, really bothered me more than any other harem scene has in a while. She tells him that her friends told her men like maid outfits. He says that not all of them do, so...ugh. I really hate having to remember this again, give me a moment here before I type the rest of it. But, she actually manages to turn this into a negative scene. Without him saying anything else, she immediately judges him and assumes he wants her to wear something even worse, and is quick to put a sword to his neck for it and forces him to accept her maid outfit. Unlike the other scenes in the anime with threatened sword violence, she was not too slow to put the blade directly on his neck, implying he was literally going to die for this. This alone is why I can say I do not like her as a character. She did apologize for misinterpreting situations he was in, but keep in mind she still did the whole \"punishment\" thing every time, and this one was just the worst. Despite how much I hate it, however, I can't bring myself to give Claire a higher rank than her. Claire did this garbage the whole series, well Ellis did it a few times, I believe. I do say \"quality over quantity\" though, but most of what Claire did still barely outranks what Ellis did.\\n\\n\r\nWhoever wrote the humor in this anime, I want them fired for this scene alone, or at the very least, thrown into an anime where the goal is to displease the viewer, because they could easily write some dark humor. I try to see the best in a lot of people and respect their tastes, but if you enjoyed this scene, do not ever tell me. I will judge you for it subconsciously for a very long time, but at the same time, would be all the more curious as to how you could laugh at it. I don't want to sound antagonizing here, so if your really did enjoy this scene and want to tell me why, don't be afraid to approach me, despite what I said, with a PM explaining why. I am not completely heartless, I just had some rage venting right there well I was talking about it.\\n\\n\r\nSo, let's see. I brought up some of the worst negatives and, pretty much, the entire series' dynamic. As I said, didn't have much interest in the story itself. Restia showed up solely to laugh at everyone and never lifted a finger. Barely had enough deveopment for me to talk about her for longer than a few sentences. Oh yeah, there was another male character, Jio Inzagi. I like saying the name, but his role was just to be reminded that Kamito is the true demon lord, though Kamito himself doesn't defeat him, so this destroyed the whole context of that. Fianna did most of the work. I liked all of the abilities he had, though, and one of the strong moves hitting him had some of the best still frames in the anime, as I thought it looked pretty cool, and his scream was pretty exhilarating to listen to. The voice actor did a good job overall, but the anime itself is what made the character feel worthless. There was some other stuff too, like this elf-looking woman who was giving people curse seals near the end, but it was rushed. Greyworth was pretty attractive and had some comical banter with Kamito a few times. Yeah, I believe I ironed out most of my final thoughts. Ellis had an older sister, Velsaria, who was hyped up just to be disappointing at the end. I enjoyed her voice, though. She was the one fighting Ren Ashbell during the first scene of the anime. They actually bring this scene up quite a few times.\\n\\n\r\nOh, I almost forgot. Carol Nastassja is the best female in the anime. Her minor appearances made me scoff her because I had so much negativity welt up that I suppose it only made sense she wasn't in my mind earlier. She is the only one who did not negatively judge Kamito and was also the only one with the balls to mock the other females who were bashful toward him. There was one scene where the other females were upset over Est holding Kamito's arm, visibly glaring. Carol mentions his other arm is free, but then they tsundere-esquely say it's childish to do. She acknowledges it and immediately grabs his other arm, making them angrier, and I actually laughed at this. Not mildly, but almost loudly. It caught me off guard for an otherwise mediocre anime and I held very high respect for Carol ever since. The most notable scene she had in the anime besides this was when she accidentally fell on Kamito and his hands ended up in the wrong area. She felt a bit violated by it, but was simply scared and was actually apologizing for falling on him since she actually acknowledged it was her fault. She is a normal female character. A real shame that, at this time of writing, only one user has favorited her on MAL. Whoever you are, thank you. You have good taste in anime women.\\n\\n\r\nThis review is all over the place. Was more of me talking about the characters again. Sorry if it wasn't informative, but I mainly wrote it to let out my frustrations about the anime and how, amazingly, a few characters could negatively kill the whole experience for me. It is the first anime I have given the second-to-lowest score on this site, since it managed to have barely just a bit of comedy in it to make me laugh a literal few times throughout the entire thing, meaning I didn't think it was one of the worst things I ever saw. If the manga really is a lot better than this, I am sure as hell curious to give it a read. Maybe Carol has more appearances in it.",
            "date": "2019-02-14T07:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 301655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=301655"
        },
        {
            "content": "Story: so the story is pretty much like that this guy was in a blade dance 3 years ago as a girl he ends up meeting a girl named claire who he ends up meeting when she is bathing and than they get a seal wont spoil the rest\r\nArt: the art is pretty good nothing bad about it\r\nSound: the sound was very good also had a very nice ending theme song i liked\r\nCharacter: now the characters kinda are freaking good you do get a different variety of characters to this anime\r\nEnjoyment: now i freaking enjoyed the hell out of this anime for the ecchi toothe harem too all the comedic stuff that would end up happening to kamito just a funny as hell and the action was pretty decent \\n\\n\r\nOverall: im giving this a 9 for like what my enjoyment says just the comedy was over the top funny for me and everything else was aswell id so recommend this anime",
            "date": "2016-08-18T22:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 227092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=227092"
        },
        {
            "content": "Story:\r\nWhere to start with this story... Seirei Tsukai no Blade Dance tells the story of a special young man named Kazehaya Kamito (the only reason I know his name is because every freaking character whines his name at least a dozen times every episode). \r\nKamito lives in a magical world where wealthy members of society send their daughters to some school with other girls to master the art of contracting spirits for some reason. These spirits are used to fight each other for no particular purpose. The contracted spirits come in many forms, from elemental spirits to golems to even the MC, who, by theway, also happens to be the successor to the demon lord, because of course he is. \\n\\n\r\nLong story short, and without going into any potential spoilers, a kawaii red-headed animu grill for some reason manages to bind Kamito as her contracted spirit, cuz reasons, and takes him as a kind of servant. The MC is also sent to this special school, because obviously he's the only man with the ability to contract a spirit, i mean he is the successor to the demon lord, after all. Basically, it's zero no tsukaima meets infinite stratos, but with less fan service than the latter and somehow more shit than both.\\n\\n\r\nAnyways, every few years there's an event called the blade dance where all the pretty anime girls take their spirits and battle each other, the winner getting a wish of theirs granted or some shit somehow.  Also there's this mystery girl that is shown throughout who seems kind of like an antagonist. The only problem is that for there to be a true antagonist, there has to be an actual story.\\n\\n\r\nIn summary, there is basically zero action and literally no plot progression, aside from a rushed and out of the blue conclusion that didn't even address the main plot element that was being built up for the entirety of this slog-fest of a show. Surely this show was made with a season two in mind.\\n\\n\r\nEdit: Oh yeah, and MC also manages to contract the spirit of a sword, who of course is also a small, cute anime girl who appears to be about 8. She obviously is completely subservient to her master and insists on sleeping with her master in the nude, because of course she does.\\n\\n\r\nArt:\\n\\n\r\nThe art in this show was pretty solid. The animation was smooth and the picture was strong overall, even great at some points. The backgrounds and background characters were relatively well-done, as has come to be expected of Kadokawa (along with poor plots). The major characters were well-drawn and pretty kawaii imo, but their art styles made them appear to be a little young for my taste. All in all, the art looks quite nice, but it is nothing particularly memorable or that would stand out compared to other shows known for nice artistic flair.\\n\\n\r\nNote: If you are watching this show for the anime nips this is not the show for you. There is not a single nip shown, and i can probably count the number of panty-shots on one hand. This was the biggest letdown of the show, and what I was looking forward to the most when watching.\\n\\n\r\nSound:\\n\\n\r\nOn first hearing the OP, I quite literally wanted to vomit. The song starts with a few English lines that were horrifically distorted by an exaggerated Japanese accent. By the end of the show, however, I had come around to it and actually enjoyed it quite a lot.\\n\\n\r\nThe ED wasn't bad, and it contained a multitude of shots of cute anime booties, which is one of my favorite things, second only to cute anime nips. Because of this, I was more than able to enjoy and watch most of the ending without skipping it throughout the show. It wasn't horribly revealing, but hey I'm not complaining, I guess.\\n\\n\r\nCharacters:\\n\\n\r\nThe show consists of a number of stereotypical anime girls, all vying for the love of the MC.\\n\\n\r\nClair Rouge - red-headed girl who contracted MC to him for some reason. Sloppy noble who sees MC as a servant. She pretends not to like him, but gets defensive. She is cautious with flirty stuff, but she follows the lead of the bolder characters, because this is anime and of course she does.\\n\r\nBlonde Chick- Sorry I don't remember the names, but I just finished the show last night. She is an upright and proper noble who pretends not to like the MC. Blonde chick is objectively best grill, and I will personally fite anyone who says otherwise. The stereotypes don't stop here.\\n\r\nBlue Hair Chick- Noble with a firm sense of justice, basically the stereotypical equivalent of the \"leader of the disciplinary committee\" from so many other shows.\\n\r\nWhite Hair Chick- A girl who is also a sword and is contracted to the MC. She appears to be in about the fourth grade.\\n\\n\r\nEnjoyment:\\n\\n\r\nDespite all my complaints, I was able to watch the show in its entirety. There were times when I didn't want to continue. It's the kind of show that you don't pause when you get up to get dinner from the microwave, and the kind that doesn't really need to be actively watched. I still didn't hate it, but it's not like I enjoyed it or anything... baka.",
            "date": "2016-01-12T20:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 208396,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5097153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/STIDDmuffin",
                "username": "STIDDmuffin"
            },
            "url": "https://myanimelist.net/reviews.php?id=208396"
        },
        {
            "content": "This is my favorite series of all time(anime+novel), so maybe some parts may be just me. Okay let's start, this anime has been adapted from the Light Novel by the same name written by Shimizu Yuu, it has that cliche feel to it at the start but the story only gets better as it goes on, unlike most other harem series(zero no tsukaima, I'm talking to you), what I mean is that while this does not have that unique setting that most people want, there's actually a very big world built and it's very well used as the story goes on. \r\nNow let's talk aboutthe anime's individual parts.\\n\\n\r\nStory 9/10:\\n\r\nWhy I'm not giving 10 since I said the story is that great? It's because I'm rating the anime, not the novel, the anime cut off some parts from the novel, but it's nothing of a big deal.\\n\r\nSoooooo, the story starts with Kamito, male MC on the forest looking for the Areishia Spirit Academy, when he meets the most probably main love interest, Claire, she's a cute redhead, but she's tsundere. Kamito then gets to the school and soon meet the other girls of his Harem.\\n\r\nDoes not sound original does it? Yeah, does not but that's the start of the story only, if you think this would be just a magic school with harem, then you're deadly wrong and I'll explain why.\\n\r\nLots of times you'll see the antagonists points of view and they all have reasons and motives of their own to do what they do(though Eva Farengart does not get developed at all due to them having to cut less important stuff), even so sometimes it's predictable to know what will happen and sometimes it won't be.(Like when you would expect Kamito to beat Jio on their first encounter) with there's not much to talk about the Story in the anime as nothing much happens and Areishia Academy arc of the story is mainly just to develop the main characters and their relationship as well as introduzing the bases of the story.\\n\\n\r\nArt 9/10:\\n\r\nI'm not picky with Art, but Seirei I think it's really good, not as good as Boku no Hero or No Game no Life though, but the animation is top notch and really fits the anime.(Just hate the damm fog that won't let me see Claire at the first episode.)\\n\\n\r\nSound 9/10:\\n\r\nWell this . is much subejective, but I think the BGMs are all very good and really fits the anime. I also really love Shukusai no Elementalia and Holy Domain songs, I think they're supposed to be a second ending/opening? The actual op from the show is average though, it's that kind of type it's best enjoyed if you like the show. On the other hand the actual ending is very catchy and is my favorite anime ending of all time.\\n\r\nCharacters 9/10:\\n\r\nKamito Kazehaya: Male protagonist, he's a very capable Harem protag for once, I mean, he's not dense, not wimpy, not a pervert and is actually capable of fighting in combat, unlike many other Harem protags who can't fight that much. The only thing I do not like about him is that when he was 13 years old he cross-dressed and became a trap character. :|\\n\r\nClaire Rouge: Probably the main love interest and the first girl to join Kamito's Harem. She's an arrogant bitch ojou-sama that's awfully bad at cooking, but her love for Kamito is the most strong, but since she's Tsundere she won't show it. However Kamito does know that she and the other girls like him and he says later on the Light Novel that he can't correspond because he already like Restia and that if he takes them, they won't be able to use magic anymore. He talks that to himself though.\\n\r\nRinslet Laurenfrost:\\n\r\n\"You mean character from Harem the least developed?\"\\n\r\nGoogle about Rinslet.\\n\r\nJokes aside Rinslet is a ojou-sama, she's tsundere but not as much as claire, but she's really tsundere when it comes to Claire, since she won't admit she likes her as a friend and keeps telling they are enemies.\\n\r\nEllis Fahrengart:\\n\r\nEllis is the captain of Sylphid Knight and hates Kamito, but when he saves her from Jio later, she joins his Harem. She's not really tsundere but she does feel ashamed when weird stuff happens.\\n\r\nFianna Ordesia: The naughty princess that wants to make Kamito hers at all costs, she was once save by Kamito when she was 13 and is in love with him since then, when she joins Areishia Academy just to met Kamito she feels sad he does not remember her.\\n\r\nTerminus Est:\\n\r\nWell, you can't spell \"Best Girl\" without Est in it, she's Kamito contracted spirit and has a human form as a cute kuudere loli, she also does not care to be naked, as long she has her kneesocks on, to her she's only naked if her legs are exposed. She's really nice and don't you dare drop this anime before she appears. If you'll do, I'll know and you'll see what happens. hehehehe\\n\r\nOther characters:\\n\r\nGreyworth Ciel Mais: She's the Areishia Academy principal and a hot woman.\\n\r\nJio Inzagi: Best character of the anime. \\n\r\nRestia Ashdoll: Oops spoiler from the Light Novel.\\n\\n\r\nEnjoyment 10/10: \\n\r\nIt's my favorite.\\n\\n\r\nOverall 10/10:\\n\r\nI give my grades mostly on enjoyment and story, so I choose 10.",
            "date": "2017-09-15T10:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 257590,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6157033.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jio_Inzagi",
                "username": "Jio_Inzagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=257590"
        },
        {
            "content": "This is like a small remake of Zero no Tsukaima in a different time.\r\nThe anime overall is good, though its not because the story is so amazingly captivating. I feel that the story is the weakest part of the series. Its kind of meh, girls with magical powers that summon stuff that fights for them. Unique isn't it?\r\nThe most I like from this anime is how similar Claire is to Louise. But this requires you to have already watched or watching Zero no Tsukaima and also like it in order to like this one. IMO, this is the good part of the anime with thebitchy-spoiled girls that act like they own the world, but are all in denial and love about the \"special guy\".\\n\\n\r\nI kind of dig the male lead. More or less. He isn't weak in character and he doesn't get trashed by stupidity or sheer embarrassment. There is a decent amount of ecchi, but nothing too big or too great to call this amazing. \\n\\n\r\nThe anime is hilarious. The whole \"I'll burn you to cinders\" is the best catch phrase. And it happens quite often, so I got a good laugh.\\n\\n\r\nI recommend it, but only if you watched or like Zero no Tsukaima.\\n\r\nOtherwise, try it and see if you like it.",
            "date": "2015-03-04T02:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 181658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=181658"
        },
        {
            "content": "Zero no Tsukaima can be called as the first series which success the fantasy harem genre series. And now every series with the same genre in each season try to follow its success. One of them is Seirei Tsukai no Blade Dance (Blade Dance) for Summer 2014.\r\nBlade Dance is just your typical harem series. The MC is the only boy with the ability whose only girl can only wield, just like IS. And the story went as oh I found an enemy, let's the girls fight and I will help too. Oh, don't forget some unnatural ecchi scene. It's the same recipe. Even there aresome unfinished business at the end. Overall, the story is bad.\\n\\n\r\nThe art itself, though it's not really good. There are some blurry detail there. The animation isn't really good too, but it's still can be enjoyed. I won't bother with character design because it's your usual character design. I love the design of the monster though, it feels quite cool. (Edited) I find it's quite disappointing as they didn't use the 3DCG for all of their monster action. It's quite good to see the only 3DCG in the last episode.\\n\\n\r\nI like the OP and ED. They did a good job to bring the OP and ED song to be a quite easily remembered. The background song is quite matched with the daily day scene as well as the battle.\\n\\n\r\nFor the character, I love them though it's the usual recipe. The tsukomi MC and the innocent ladies. The antagonist girl in every episode but shrouded in mystery. Oh, and don't forget the Sword loli. She's the star. ;)\\n\\n\r\nAs the enjoyment, I found it's quite disturbing too see the art and ruin the enjoyment the most. As I reach the last episode, there are too many unfinished business. What a let down.\\n\\n\r\nAs I love the fantasy harem series, Blade Dance is your usual fantasy harem without any great difference between another series with the same genres. There are too many unfinished business which make the series need another season, but I'm pessimist if it's good enough to make one.\\n\\n\r\nThanks for your time to read this review.",
            "date": "2014-10-03T20:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 163485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452111.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xgunawan",
                "username": "xgunawan"
            },
            "url": "https://myanimelist.net/reviews.php?id=163485"
        },
        {
            "content": "This review will not have any spoilers(I'll try not too) and will just be me explaining on how I like/dislike the anime. The first thing I will talk about is the story. It is in the supernatural genre with the character controlling spirits with a contract. The story is good, but I did not like the ending as much since it left me on a cliffhanger. If you would want to see what happens next, you would have to read the manga or hope that they will make another season at some point, which isn't a high probability since it has been out for awhile.The art style was great, which bright colors and good backgrounds as well. The anime is only in japanese, but you would probably still like it even if you only watch animes in dubbed. The character developments are kind of wonky. One of the girls that is introduced mid-story shows to be part of the main characters past. For awhile, she is shown to be a big character, then she is not shown much afterwards. Another character at the beginning was not shown much until the end, where she was shown every other scene. Still, I liked the characters and how they interacted with each other. Overall, I enjoyed the anime and i wish that it would have continued longer, but I guess I can sit back and read some manga. The anime is 12 episodes long, so it will go by quick, so try to enjoy it as you watch. I would give the anime a 8 out of 10.",
            "date": "2014-10-24T01:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 165977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3762825.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TwofastSenpai",
                "username": "TwofastSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=165977"
        },
        {
            "content": "Describing this one of many shows that \"the anime industry spits out every season\" is somewhat of an injustice. You will find there is a lot more to Seirei Tsukai no Blade Dance than your everyday harem series.\r\nPlot:\r\nThis is an anime primarily about fighting and magic-wielding, which is nothing new, but it is more than enough to keep you interested for 12 episodes. The other main theme is harem/romance. What this show does well is prevent the two themes from conflicting with each other and therefore the plot feels serious yet the romance is sweet and entertaining, and compliments the story well as a formof comic relief. However, I feel like a lot of important plot elements involving the characters' pasts are poorly explained, possibly due to being only 12 episodes long. This is the type of series that could really do with a prequel more than a sequel. 7/10 for plot.\\n\\n\r\nArt:\\n\r\nCrisp, colourful candy for the eyes. The fluorescent artwork is what will keep you watching if nothing else does. The motion is smooth and the drawing is detailed. The characters themselves all look extremely cute and a joy to watch, all having distinctly coloured hair and eyes as standard. The uniform design is actually interesting for once which compensates for the fact that that is what they constantly wear (which unfortunately alludes to 90% of anime). The setting gives off a medieval vibe which suits the story well. All of the battles are well animated and feel intense - a 10/10 for art.\\n\\n\r\nSound:\\n\r\nThe soundtrack for Seirei Tsukai no Blade Dance is spot-on and fits the medieval setting perfectly. If the music is not stuck in your head, then at least it enhances your experience of every scene. The ED is undeniably catchy as well and not once have I skipped past it. On the other hand, the OP falls short and makes the show feel like low budget trash before it's even started. 9/10 for sound.\\n\\n\r\nCharacter:\\n\r\nFor a series that does declare itself a harem, you would expect a bit more in the character department.\\n\r\n    Kazehaya Kamito is a strong fighter with a troubled past that we know ABSOLUTELY NOTHING ABOUT (can we at least have an OVA to explain what's up with him?). A solid personality but annoyingly helpless when faced with any awkward situation. \\n\r\n    Claire Rouge is a short-tempered tsundere who can be undeniably cute during her soft moments. You are made to feel sorry for her as society shuns her for being the sister of the notorious Calamity Queen, but the intended sense of pity doesn't really reach the viewer. Sorry, Claire.\\n\r\n    Rinslet Laurenfrost is from a family of nobles, and certainly does give off that aura. However, encounters with her are so infrequent that you either forget about her or don't care about her. Hardly worth a mention. Sorry, Rinslet.\\n\r\n    Fianna Ray Ordesia is a \"perverted princess\" and is the only character in the series who openly epresses her feelings towards Kamito, which is rather refreshing compared to all those tsunderes. Again, we are made to feel sorry for her, having been unable to become a queen. Again, I couldn't care less.\\n\r\n    Ellis Fahrengart... what a delightful character. A knight with a strong sense of justice, yet at heart she is just a normal girl and scenes with her and Kamito are heartwarming.\\n\r\n    Est. Every time she says \"Praise me more\"; every time she gets patted on the head and says \"That feels good\"; every time she says \"I want parfait\"; every time Kamito wakes up to find her in his bed; every time words leave her lips as a soft monotonous lullaby... I feel at peace.\\n\\n\r\nAs for the interaction between the characters, real feelings are seldom shown (the exception being Fianna, but this is presented in a comedic way). The the pairing with the most romantic value is without a doubt Kamito and Ellis: you will enjoy the bond that develops between these two. 7/10 for character.\\n\\n\r\nConclusion:\\n\r\nWhile Blade Dance is by no means a technical masterpiece worthy of a 10/10, it is one of my favourite anime that I have had the delight to watch. Why? The fights are intense, the romance is sweet and fun to watch, Est is a bundle of joy, and all the way through the art and music are beautiful and a real treat for the senses. It alternates between plot and romance perfectly, not allowing either to drag on for too long and provides the right kind of entertainment at the right time. 10/10 for enjoyment and a 8/10 overall. I would recommend this anime to anyone.\\n",
            "date": "2015-12-27T19:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 207042,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4946973.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Appilesh",
                "username": "Appilesh"
            },
            "url": "https://myanimelist.net/reviews.php?id=207042"
        },
        {
            "content": "Seireri Tsukai no Blade Dance (Bladedance of Elementalers) is about females born of noble families that go to a school to become elementalers that form contracts with different kinds of spirits. Only females have really been known to do this and it changes things up for them when Kamito Kazehaya, a male elementaler, start going to the school. Kamito first meets Claire Rouge, who is attempting to form a contract with a powerful spirit. Kamito controls the spirit in order to save Claire's life and she forces him to become her slave for \"stealing\" her spirit.\r\nRight from the beginning, the story is incredibly confusing, Ihad no idea what was really going on until the 3rd of 4th episode. Like I said before, only females are known to attend this school, so the entire series is about Kamito Kazehaya surrounded by loli looking girls. There are a total of 2 guys that appear throughout this anime, one of them being Kamito. The rest of girls. Needless to say, it is a Harem anime. Aside from the story being confusing right from the beginning, I can't knock it entirely because it is a Fantasy anime and there's a lot of plot points that the viewer needs to understand. I can say thought that the anime does get better as you watch it and start understanding what's going on. I didn't start enjoying it until about halfway through. \\n\\n\r\nAll this anime is about is these students learn to control and make contract with spirits in order to use them in fights against other students in duels. They fight to earn their spot in a prestigious tournament called a Blade Dance, with the winner granted any wish they desire (I think?). The story is rather vague as a whole and leads me to believe the Manga is infinitely better than the Anime. I was left with a lot of questions at the end. There was a lot left to show by the end of the anime but to me it seems this anime wasn't popular enough to get a sequel season or that maybe it's just not a priority.\\n\\n\r\nThere wasn't anything particularly special about the characters. They all seemed pretty generic and cliche. None of them were by any means bad but I feel like I've seen these exact same characters in other anime. The art was bright and fine, pretty much just your average anime girls running around using spirits to do their bidding. Although the spirits weren't exactly exciting to see, there was a lot of variety in each girls spirit, which is nice to see. The one other guy besides Kamito in particular is actually pretty cool to see.\\n\\n\r\nAll and all, there wasn't anything special about this anime, it wasn't bad but it wasn't really good either, it was pretty average and fine. There are better anime to watch out there but if this one catches your eye, don't turn away from it. Judge it for yourself but I do believe the Manga would be better.\\n\\n\r\nLikes:\\n\r\n-All of the girls at the school call Kamito a \"Lewd Beast\" and \"Demon Lord of the Bedroom\" and it's hilarious because he's literally done nothing and always been in the wrong place at the wrong time.\\n\r\n-The spirits aren't really exciting but it's still cool to see. Also, Est gets a human form, is it because she's overpowered or can other spirits look human too?\\n\\n\r\nDislikes:\\n\r\n-So many cliches, it's hard to handle\\n\r\n-SPOILERS\\n\r\nThey beat Jio midway through the season and then he just disappears, they didn't kill him or anything (as far as I know), what happened to him?",
            "date": "2016-10-01T10:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 230794,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5586150.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Drevorn",
                "username": "Drevorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=230794"
        }
    ],
    [
        {
            "content": "About half a year ago I had the absolute pleasure of reading through the Seirei Tsukai no Blade Dance light novels, and after having caught up with them I consider it one of my favourite series to date. Consequently I was of course very much looking forward to this anime adaptation; however I still felt a bit awkward about it because as it is, Blade Dance is not really an amazing series from the very beginning. It isn't until a few volumes of content down the road that it starts getting exponentially better; however this mere 1-cour adaptation doesn't even reach that far into thestory. As a result, people watching this anime will most likely think of it as just yet another cliché harem series, which by itself isn't wrong but it's only scratching the surface of what Blade Dance truly is deep down.\\n\\n\r\nIn short, Seirei Tsukai no Blade Dance takes place in a fantasy world where magicians called Elementalers (or Elementalists if you prefer) form sacred contacts with elemental spirits in order to be allowed to wield their powers. However this privilege is only given to pure maidens of noble families who undergo training in order to become spirit contractors. This means that there are no male Elementalers... or at least there shouldn't be but *as it happens*, there is one exception to that, namely the story's protagonist Kazehaya Kamito. Consequently he's transferred to the rich girls' classy school as the only man in an ocean of girls. Sounds cliché and overused as hell I know, but I think it utilizes that premise better than most other such cases out there.\\n\\n\r\nNow undoubtedly the most important part of a harem series is the characters themselves, as if they're not likable then it will suck no matter what, so here's a rough draft of the most important ones:\\n\\n\\n\r\nName: Kazehaya Kamito\\n\r\nRole: Protagonist\\n\r\nDescription: Good natured, dark history, strong fighter\\n\r\nComment: Not a pervert, not a wimp, not dense. Actually a competent harem protag for once\\n\\n\\n\r\nName: Terminus Est\\n\r\nRole: Contracted spirit, bEst girl\\n\r\nColour: White\\n\r\nDescription: Ancient legendary sword spirit, expressionless, snarky\\n\r\nComment: One of the most nosebleed-inducing characters in existence, total moe overdose and perhaps the main reason to watch this series. Don't you dare drop this anime before she makes her first appearance (episode 3)\\n\\n\\n\r\nName: Restia Ashdoll\\n\r\nRole: Former contracted spirit\\n\r\nColour: Black\\n\r\nDescription: Antagonist(ish), motives surrounded in mystery\\n\r\nComment: Cute yet seductive character design, hard to figure out for sure what she's thinking or what her personal goals are most of the time\\n\\n\\n\r\nName: Claire Rouge\\n\r\nRole: Tsundere Ojou-sama #1, emphasis on the tsun\\n\r\nColour: Red\\n\r\nDescription: 95% tsun, 5% dere, Kamito's self-proclaimed \"Master\"\\n\r\nComment: Imagine Louise de la Vallière except without Kugimiya Rie and you won't be too far off the mark. Also a closet pervert though\\n\\n\\n\r\nName: Rinslet Laurenfrost\\n\r\nRole: Tsundere Ojou-sama #2, emphasis on the Ojou\\n\r\nColour: Yellow\\n\r\nDescription: 50% tsun, 50% dere, extreme rich-girl aura, Claire's childhood friend\\n\r\nComment: Without a doubt one of the most strikingly Ojou-esque characters out there\\n\\n\\n\r\nName: Ellis Fahrengart\\n\r\nRole: Tsundere Ojou-sama #3, emphasis on the... creative ways of insulting people\\n\r\nColour: Blue\\n\r\nDescription: 33% tsun, 66% dere, captain of the Sylphid Knights\\n\r\nComment: Strong sense of justice and a quite straightforward personality, but on the inside she really only wants to be treated like a girl\\n\\n\\n\r\nName: Fianna Ray Ordesia\\n\r\nRole: Perverted Ojou-sama\\n\r\nColour: Purple\\n\r\nDescription: Playful and teasing personality, frighteningly bad at cooking\\n\r\nComment: Aggressively seeks to seduce Kamito for her own reasons. She's good at teasing people but not so much at being teased herself. Also somewhat naïve\\n\\n\\n\r\nShort version would be that some characters are more likable than others, but there's bound to be at least *someone* everyone would like from the cast. Est is by far the most popular but Restia and Ellis have some sizable fanbases as well.\\n\\n\r\nAs far as the production value goes, the art style looks mostly like how I imagined it would and is quite pleasing for the eyes overall. The animation quality however is uneven at best. For panoramic sceneries and close-up character shots everything looks fine, but every so often during more distant shots the characters' faces will look completely distorted and just plain weird. It really feels like they skimped on the budget in that area and sadly it drags down the overall impression of the visuals quite a lot as it'll constantly nag you in the back of your mind.\\n\\n\r\nThe soundtrack however, the only aspect I had absolutely no expectations on whatsoever coming into this as a LN reader, sure as hell was the real surprise of this show. The OST is just soooooo catchy, I was so impressed with it and it really has its own feel to it. It's not particularly J-pop-esque, but rather gave me some East European or tribal vibes... I think \"wild\" might be a good word to describe it. Note that I'm not just talking about the OP (though this one is a bit more \"normal\" than the others) and the ED with this, but the soundtrack as a whole including the CD-only tracks (like Shukusai no Elementalia for example) that aren't in the anime itself are also fantastic and I'd recommend you to run to your nearest YouTube and check them out if you haven't. Also one does not simply mess with a group name as legit as Ni-Sokkususu (pronounced Knee Sockss) >.>\\n\\n\r\nMoving on, overall this is definitely not a show that would ever be labelled as \"deep\" or \"intelligent\" or \"artistic\" etcetera, but that's not what an ecchi harem show needs anyway. What it needs is cute girls and mindless fun, and as far as that part goes at least there's not much to complain about. Some people might get annoyed at Claire but she's only one among many, and there's bound to be at least someone that can carry the show for every viewer specifically. In the end, anime is simply entertainment media and for that purpose alone, Blade Dance does its job. That's all there is to it really.\\n\\n\r\nHowever as a final note, as someone who's read the novels I really want to get this message across: since no second season has yet been announced despite the anime being finished airing, combined with the fact that (to my knowledge) it didn't have the best BD sales in Japan, it’s worryingly likely that no more content will ever be adapted for this series. If that really does seem to be the case however, then I really recommend you to at least try out the LNs instead. I'm not going to be one of those hypocrites who keep yelling stuff like \"the source material is so much better, don't judge it by this anime\" etcetera, because that is definitely not the case. In fact I think this is a quite respectable adaptation as a whole; not perfect but good enough. Rather it's simply that the story improves immensely pretty much from the very moment at which the anime ends, and thus judging the full story merely from what these twelve episodes cover alone will give a quite unfair image for the series as a whole. This is essentially just the prologue. The main arc of the novels begins literally the second the last episode of the anime ends.\\n\\n\r\nThough if you're not quite that hardcore and simply want to watch a show casually for plain fun, then this adaptation on its own still does a good job at doing just that, and arguably that's really all you ever need to ask for when it comes to anime.",
            "date": "2014-10-13T10:55:00+00:00",
            "helpful_count": 215,
            "mal_id": 164685,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2513325.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/HaXXspetten",
                "username": "HaXXspetten"
            },
            "url": "https://myanimelist.net/reviews.php?id=164685"
        },
        {
            "content": "The best way to describe Seirei Tsukai no Blade Dance is that it is basically a remake of Zero no Tsukaima with a few additional archetypes thrown in and a few intricacies removed.\r\nThe show is a very standard harem, somewhat in the vein of Infinite Stratos, where the main character is the only male elementaler in a school for female elementalers. Predictably, he quickly runs into a cast of about 5 girls who all have affections for him.\r\nWhat the show does well is pacing. Most harem shows have a few episodes of pointless stalling to focus on one individual girl and pretend that they aregoing to offer some romantic development. While some girls are more or less prominent in Blade Dance episodes, the story does continue to move forward each episode and there is very little in the way of wasted time (other than fight scenes that are perhaps too lengthy).\\n\\n\r\nWhat the show does poorly is originality. This is either going to comfort you if you like seeing the tropes that it will cascade one after the other or it is going to seriously annoy you if you were hoping to see something new here. We have \"you're not yet ready to fight me\" bosses, an average of two people fainting per episode, a main character that is constantly jumping into the paths of projectiles to save people, no developed male characters in the story, and girls who you've all seen before if you've watched one harem and played one or two JRPGs.\\n\\n\r\nFor me, I found it sort of disappointing. However, if you're looking for a story with a fantasy setting and can ignore its faults, this is a viable option.",
            "date": "2014-10-01T08:13:00+00:00",
            "helpful_count": 96,
            "mal_id": 163145,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Mirrored",
                "username": "Mirrored"
            },
            "url": "https://myanimelist.net/reviews.php?id=163145"
        },
        {
            "content": "Seirei Tsukai no Blade Dance or Blade dance for short is one of five anime adaptation of LN that simultaneously announced by MF Bunko J. For you who have watch many anime by synopsis alone you can see which direction this series will take. Yes this is harem romance comedy with fantasy setting and dash of action. Nothing new here but it's not like being unoriginal equal boring. Blade Dance is type of series that not try to hard to be deep or complicated series. Instead it achieve what it is trying to do becoming simple yet enjoyable series.\r\nNow we are talking about animation andart that is used here. Nothing groundbreaking or spectacular but it still have it's up and down. The best aspect here must be character design an important part on harem genre. Every character is drawn very attractive and very pleasing to the eyes. The downside here sometimes the background is not moving. But overall it is still good.\\n\\n\r\nAbout sound even though most of main cast played by rookie seiyuu but every one of them play good job and match the character they are playing. The best must be Yuuki Kana VA of Rinslet which bough up her ojou aura more than her LN counterpart. And about soundtrack it is decent but I still disappointed that Shukasai no Elementia the one used for PV is not used as ED or OP instead.\\n\\n\r\nNow the most important part of harem anime is character. We are starting with our main character first Kazehaya Kamito. As the only male spirit contractor in the series people are wary about him because in history the only male spirit contractor Demon King and as you can guess it create chaos in the past. He have good nature personality but is not above teasing his harem member. He is also competent fighter and neither wimp nor (really) dense character. Now move on to Claire. She is tsundere with heavy dose on tsun than dere. Thoughit can be annoying sometimes but over the time she really grow and become more likable. She also have rival and childhood friend named Rinslet. Rinslet like Claire is also tsundere but instead of tsundere to our male lead she is mostly tsundere to Claire. She is also have the most ojou appearance and voice in the series. Move to another character we have Ellis who is also tsundere who lean more on dere than tsun. She is serious and upstanding person. She is also act according to knight honor. We also have Fianna. She is princess also she is the tease on the series. As one of a few character that know Kamito secret she always take advantage on it. Next we have Est. The best character on the series. Bold, cute and charming. She is also very powerful spirit and Kamito trusted partner. The most defining trait of her character is that she like to wear nothing aside for knee socks. Now for the last we have Restia another spirit character. The most mysterious character on the series and the driving force behind the series. What she think and what she do is always mysterious.\\n\\n\r\nThis is relaxing and enjoyable series overall but since I've read the LN I know very well that Blade Dance haven't reach it's full potential yet. I'm definitely recommending this to you who like harem fantasy or who like lighthearted series in general.\\n\\n\r\nOn a side note the main story start right after anime end so for those who like this adaptation enough I'm strongly recommending read the LN. You can start at volume 4 where anime left off but I think it's better to read it from the start.",
            "date": "2014-09-29T05:47:00+00:00",
            "helpful_count": 42,
            "mal_id": 162879,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1187665.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NeoAnkara",
                "username": "NeoAnkara"
            },
            "url": "https://myanimelist.net/reviews.php?id=162879"
        },
        {
            "content": "In every anime season there are always the usual category of shows that we expect.  There are those hyped shows that everyone wants to watch, there are the romance shows that prove to be either promising or not, and finally, we have that one show every season that you can tell, you can tell will be bad.  Seirei Tsukai no Blade Dance.\r\nStory (4.99/10): The story of Tsukai no Blade Dance revolves around a magical world.  In this world, there are spirits in which only women or girls, are able to make contracts with these spirits and use them as different weapons ofdifferent varieties and uses, better known as elemental waffes.  (Basically, Zanpaktou).  It is here where the only male elementaler (the term used to call the people who use the spirits) in the enrolls in the noble school of using learning how to use elemental spirits, so that he can finish a task in which the headmistress of the school has assigned.\\n\\n\r\nTo be completely 100% honest, this story is absolutely horrible in every way shape or form.  Tsukai is filled with so many plot holes that it makes SAO's two year timeskip seem minuscule, there is absolutely no focus on plot, pacing is a rushed nightmare, nothing is ever explained, and the ending is so unsatisfying that this show deserves to be shunned from anime history.  Maybe that's a bit harsh, but to say that this show has problems is an understatement.\\n\\n\r\nOne of the biggest flaws of the series I feel is its lack of explanation.  From episode one, Tsukai gives you its world, just straight up gives it to you without any backstory or explanation.  Kinda like getting a 2000 piece lego without any instructions on how to build it.  It basically expects you to already know what this world is and has to offer before minute one of the first episode is up, which is a very big no no if you want to get any sort of audience engaged with your plot.  As the series progresses, you do get some semblance as to what this magical world is, but it's so minuscule that it feels as though they shouldn't have even bothered at all.  They mention events within this world that apparently are very significant but are just so glossed over that it's really more of a fact than having really any effect on the plot in general.\\n\\n\r\nAnother big flaw of the series is how there is really little to no focus on plot.  Many ecchi shows have this flaw where the series tries to go all serious and explain something that's actually relevant and important, before switching gears completely and throwing a pair of breasts or pantsu at the screen to show that this guy is getting more attention than he should.  It's a really jarring transition because the show at some very rare points, actually makes itself sound interesting before going the complete opposite and talking about a loli with a bust complex. The series mostly focuses on an extremely clunky TWGOK style story where every \"arc\" features one of the main girls, solves their \"issue\", then absorbs them into the almighty harem of ever growing group of bitches.  \\n\\n\r\nIn addition, the pacing of the show is quite unbalanced as they mainly spend their runtime giving this one magical Infinite Stratos MC copycat five girls that literally throw themselves at them, whilst trying to \"maintain\" a serious sounding plot.  If you're going to make a show, go one way and not the other.  You can't do both.  \\n\\n\r\nAnd then we have the ending of the show.  Oh boy, was this a mess.  I'm that kind of person that always likes a satisfying ending to stuff.  Even if the plot itself isn't complete, as long as it resolves itself with at the minimum, most of the stuff getting wrapped up, I'm decently satisfied.  The main focus of this show was revolved around something called a blade dance, which is basically a teamfight between teams of people with contracted spirits.  They series ends literally right before the long awaited climax, which to be honest, is the worst way to end any series, period.  There is no resolution at all as it is all open to hell, they build all this \"tension\" of the importance of the blade dance in the twelve episode runtime just to shoot it all down with the credits rolling at the run to the what I assume to be the most critical part of the story, thus destroying whatever sort of credibility this show had because of just how much bullshit there was at the end.  And with that, it really just puts the nail in the coffin of just how bad this show is.\\n\\n\r\nOverview:\\n\r\n-  Swiss cheese story (cause of all the holes, get it?)\\n\r\n-  No focus on plot\\n\r\n-  Awful pacing\\n\r\n-  Worst...ending...ever. \\n\\n\r\nCharacters (5.00/10):  If the story is any indication as to how bad this series was, the characters will more or less reflect the same sort of detail and quality.  \\n\\n\r\nUp first is our main protagonist, Kazahaya Kamito.  As most harem MC's, you get your standard \"bread and butter\" copycat harem leader who is nice to everyone and gets all the bitches.  Aside from a few fairly decent traits such as not being reluctant to see girls naked, be a generic pervert, and having some actually good funny moments, he's not really much in terms of actual character.  He does have some good wit to him, but really, he's just your average harem protagonist.  This however gets much worse in terms of overall characters as he is the most detailed and most well-rounded character in this entire cast, which really isn't much. \\n\\n\r\nAnd then we have Claire Rouge, our token flat-chested, fiery, and tiny main female.  Plain and simple, this girl is your basic cardboard cutout tsundere who feels as though she \"needs to get stronger.\"  Literally, that's it.  There's nothing more to her character aside from saying her catchphrase \"burn in cinders!\" over and over again till is gets old like a broken record.  (You can get sick and tired of it from episode 1, I guarantee you.)  \\n\\n\r\nAnd then we have the rest of the female harem involving Rinslet and Ellis, both tsunderes (seriously, three tsunderes in one series?), Fianna, the walking pair of breasts with a pension to get Kamito's D, and Est, the kuudere sword spirit who will sleep beside you with practically no clothes on and follow your EVERY command despite looking like an 11 year old.  And then we have Carol, the maid who's only purpose is to act as Rinslet's dere side.\\n\\n\r\nApart from them, you have the supporting cast of random characters that I won't even bother mentioning since their appearances are so scarce and so varying (in addition, their names are freaking long), that I feel as though there is no point to them even being mentioned.  There are however a couple special cases in this cast that I feel deserve a little bit more insight on.\\n\\n\r\nThe first is the Calamity Queen.  This character just feels so useless to me as a character just in general.  For one thing, she never shows up in the series.  Not in person, only in flashbacks.  She's a part of Claire's character development (as small as that is), and is only ever really mentioned.  To me, this seems like a big waste considering how much they talked about her in the series, and never even did anything to make her seem any more important since the character apparently had some motivations to do what she did, but was never explored.\\n\\n\r\nAnd finally, what I feel was the biggest waste in the series was the character known as Restia.  This girl was by far the most mysterious character and was legitimately the most interesting character in this entire series.  It's shown in this series that she has a connection to Kamito and I felt as though that was the most defining moment this series had as it delved a bit more into the story and it really made something in this series, regardless of how small it was, shine.  I feel as though she was the most underused character in the series and it was really a shame since her motives were nicely shrouded and gave something nice that this series was seriously lacking.  In the end though, we got a character that basically appears out of nowhere, titters, then leaves mysteriously.  There was a lot of underused qualities that Restia had, and it's a shame she wasn't explored or used more than she was.\\n\\n\r\nOverview:\\n\r\n+/-  Meh MC\\n\r\n-  3 tsunderes\\n\r\n-  Completely forgettable supporting cast\\n\r\n-  Very underused character\\n\\n\r\nArt and Sound (7.11/10 and 6.06/10): The art of the series is actual a rather nice and aesthetically pleasing style.  There's no real standout moments for the actual animation as it's pretty standard/consistent all the way through, but the color scheme and the overall look of the show is rather nice.  (However, if you don't greatly dislike moe style characters, I suggest you stay away from this.)  \\n\\n\r\nWhile the art in general is nicely detailed and very nice-looking, there is one very big flaw that this series has, and that is its ecchi.  This show is very big on ecchi and basically strips its girls naked just to reveal to you that \"it's this kind of show.\"  (Hell, the opening scene for Claire is a scene of her bathing in a lake with Kamito \"peeping\" in.)  The ecchi for this show is quite extreme and they really don't hold back on flaunting their girls.  They even go to the extent of doing a close up shot of any single girl's chest or lower torso region during any transition between the first half and the second half of the show meaning, you're basically forced to watch an ecchi scene.  So if you really don't like eechi, this show is not for you.\\n\\n\r\nThe music for this series is meh.  There's nothing really noteworthy about it.  I don't like the opening, the ending is ok, there's nothing really much to say.  It's generic, it's ok to listen to, but it's not really a memorable track.\\n\\n\r\nOverview:\\n\r\n+  Decent looking art\\n\r\n+/-  \"Ok\" music\\n\r\n-   Ecchi get in the way of a lot of things\\n\\n\r\nPersonal Enjoyment (5.49/10): To be honest, I expected this show to be bad.  From the very beginning before it even aired, reading the synopsis, I knew that this series would be disappointing and basically, bad.  However, there was something that always pulled me to watch the next episode.  An almost unexplainable force pulling me back to watch more and more of this awfully created series.  Strange.  Anyway, off to the three questions.\\n\\n\r\nDid I like this series?\\n\\n\r\nNo.  Just straight up, no.  There were too many plot holes, there was absolutely no background explanation to give some semblance of what this magic world was, and to top it off, the characters were beyond bland and overused.  Not to mention the ending being one of the single worst endings I have ever seen.  But somehow, regardless of the horrendous amount of flaws, I continued watching with slight eager anticipation.  (I don't know why I did.)\\n\\n\r\nWhat didn't I like about this series?\\n\\n\r\nApart from the rather decent looking art and fluid action, everything.  \\n\\n\r\nWould I recommend this series?  \\n\\n\r\nHonestly, no.  There are so many flaws with this show that it doesn't even make it a good fluff show.  In my opinion, there is nothing about this series that makes it stand out in any way, and I wouldn't recommend this to be put on anyone's list.  It's poorly written, there are no good characters (except the mysterious and underused Restia), and the plot points of this series were incredibly rushed and overall, just very jarring to watch.  \\n\\n\r\nOverall Score: 5.01/10",
            "date": "2014-10-18T21:51:00+00:00",
            "helpful_count": 21,
            "mal_id": 165241,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=165241"
        },
        {
            "content": "It's been awhile I haven't done a review so I decided why not, fair warning this review is only for the anime I won't included aspect from the LN. I know alot of you won't like it, but stick with me ok, I'm a bit rusty.\r\nAnyways Seirei Tsukai no Blade Dance doesn't seem like an all out series, but for those who don't know this is all just the prologue, the actual story doesn't happen until a bit further on. But again I won't be getting into that, just saying for those who came from the LN and starting to watch this, don't expect anythingto great from it, anyways I'm prolonging now let me just get started, cause no one cares about introduction.\\n\\n\r\nStory: 6\\n\r\nSo this story is obviously that of a fantasy, includes magic, Demon Lords (Maou), and knights. These \"magicians\" aren't refer to mages like most magical anime, they are called \"elementalers\". Each Elementaler controls an element in the form of a contracted spirit. These elements as seen in the anime are in form of fire, water, wind, earth, and ice. One of these Elementalers is known as Kamito Kazehaya who meets a girl bathing in the forest, she is known as Claire Rouge a fire elementaler, from this they join into a team to compete in a tournament known as The Blade Dance. Without going into much summary, this story is pretty bland, Kamito is the only boy elementaler in the school, surrounded by a sea of girls. His goal is to win the Blade Dance to get his wish granted and to chase down his former contract spirit Restia. It's not a touchy story, it's more of an underdog type of story, those who come from troubled past with no power try to go against odd to achieve strength and victory.\\n\\n\r\nArt: 8\\n\r\nThe art was pretty good in this series, well drawn, the key animator of this series should give themselves a pat on the back for this. Background was aesthetically beautiful, and the characters were so well made, you can see that they aren't just based with model with different color hair and eyes, they put some effort into making each character structurally different, with no disproportional body parts. Hats off to you animators, job well done.\\n\\n\r\nSound: 5\\n\r\nSound pretty generic nothing very memorable as per say, the opening was ok and ending was decent but nothing that you will download into your mp3 of course. As for the voice actors, the main characters voices were well picked but Restia's voice (even though she wasn't a main) just was too kiddish, I understand they were aiming for a bit of a seductress voice, but it's a bit let down.\\n\\n\r\nCharacter: 8\\n\r\nI'll list each of the main characters so you guys have a generic idea of each of them:\\n\\n\r\nClaire Rouge-  A tsundere Flame Elementaler, her contrated spirit is a flame cat name Scarlett. As stated she is a heavy Tsundere, instead of seeing Kamito as her crush/friend she keeps stating that he is her \"slave spirit\" and like most tsundere out there she's flat chested and very insecure about it. Typical right?\\n\\n\r\nRinslet Laurenfrost- Also a tsundere, but an Ice Elementaler user, her contracted spirit is a ice wolf name Fenrir. She's a girl who never truly say what she means/want, so usually her maid translate for her. She is a very prideful noble, and a close friend of Claire, even if the 2 don't admit it.\\n\\n\r\nEllis Fahrengart- Another but yet very soft tsundere, she is a Wind Elementaler, her spirit is that of a Eagle name Simorgh. She is a knight who gets flustered around Kamito easily, a good cook too, and very impressionable too, she doesn't have a bad past like the others, but her present was getting a bit muggy\\n\\n\r\nFianna Ray Ordesia- No worries she's not a tsundere, she's just a playful teaser, even though she has meaning behind her flirts. She is a Light Elementaler her spirit is like a huge knight known as Georgios. She is a \"Lost Queen\" a forgotten princess due to the events before the series, She knows Kamito secret alias and sometimes use that as leverage against him.\\n\\n\r\nTerminus Est- The best girl in the series, ok personal opinion aside she is a spirit herself, a powerful sword spirit known as a demon slayer. She is more comedic relief and a bit of a fan service type character, suggested to have chocolate licked off of her, or having Kamito \"Eat her\" and always appearing naked, yet draws the line when asked about her kneesocks, which she refuses to remove. She is an ecchi but moe loli, and that's a win, I kidded of course.\\n\\n\r\nKamito Kazehaya- The main guy and one of those rare harem MC who isn't useless, not much to explain but to say this guy pretends to be dense, he just rubs off the girls antics. He is both a Dark and Light Elemantaler, Dark as for the event before the series, Light during the show, he controls Est. He's also known as a Demon Lord successor and a Demon Lord of the Bedroom.\\n\\n\r\nToo many tsundere characters however, so far warning, if you don't like that character trope, you'll get a little ticked off.\\n\\n\r\nEnjoyement: 7\\n\r\nIt was good, the ecchiness was pretty soft compare to most out there, because well that wasn't the focal point and they made sure to incorporate those moments at reasonable moments, same for the comedy. They kept the action with the action, kept comedy with the comedy, they rarely ever tried to intertwine with each other, giving each scene its own focus without taking anything away from that plot use. So very well balanced, and seeing that was a bliss to enjoy.\\n\\n\r\nOverall: 7\\n\r\nWow usually my personal rating and my review rating ever match but it seems this time it did. Again like I said at the beginning this story is just basically the \"prequel\" sort to say, so for those coming from the LN to watch it will probably be boring to you, but if you came to see Est animated than by all mean have fun. I don't really have a closing statement for this, but hope you guys got something out of this, and it was helpful. As always enjoy!",
            "date": "2015-04-13T15:31:00+00:00",
            "helpful_count": 15,
            "mal_id": 185557,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3768051.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/elementkg",
                "username": "elementkg"
            },
            "url": "https://myanimelist.net/reviews.php?id=185557"
        },
        {
            "content": "Seirei Tsukai no Blade Dance: light novel adaptation! Yeah! You know what that means? Deep, meaningful themes? Character Development? Great Dialogue? Hahahaha, hell no. As with most (if not all) light novel adaptations, Blade Dance is a romance/comedy/harem/fantasy anime catered to the otaku audience. My expectations for this anime were insanely low and all I expected was nothing but a generic, mindless fanservice anime and that's exactly what I got.\r\nStory (25%) - 2/10\r\nThe story is as generic as it can be. It's nothing but an obvious setup for a harem and there isn't much thought put into the setting. Now you may be thinking \"Sure,it's generic but 2 out of 10?? That's a bit harsh, don't you think?\" so allow me a chance to explain why. Usually, shows with no plot (i.e. slice of life) get an automatic 5 from me, a well-handled plot always scores higher; however, stories that have plots which only exist for empowerment fantasy/wish fulfillment and nothing else get a 1 point deduction. Blade Dance gets another point deduction for not doing a good job of explaining its setting or conflict. Restia's back-story and motives are never explained so she falls flat as a villain. It is also never explained why Kamito is the only boy with powers, which actually makes this show really weak as empowerment fantasy. Since the viewer is expected to step into the shoes of the MC, if it is never explained why the MC is special, then the viewer will not feel special (or \"empowered\") either. From a story-telling perspective, I see no reason why any random boy couldn't also gain powers and get chicks, it's not like anything is stopping them; thereby making Kamito look ordinary and not unique. Hell, even Infinite Stratos gave a reason as to why the MC is special. Sure, it makes no sense and is never explored, but at least it was there! Another point gets deducted for the fact that the sub-plots are so poorly managed. We are told that Claire's sister went rouge for some reason and Claire wants to get stronger to bring her back or something, but we are never told why. No flashbacks about their memories together, no reason to believe her sister is innocent, there is absolutely no motivation for the audience to care about her; simply telling us they're sisters isn't enough, you know. Have the writers never heard of Fullmetal Alchemist?\\n\\n\r\nArt (20%) - 6/10\\n\r\nThe art style is also very generic, it is extremely easy to confuse it with a hundred other shows. The animation is pretty decent, with the show being rather action-oriented. The CGI isn't bad at all, but nothing stands out in terms of art. It's only slightly better from what you would expect from modern anime.\\n\\n\r\nSound (20%) - 6/10\\n\r\nThe OP is sung in TERIBORU ENGURISU (yeah, it's really that bad) which drags the rest of the soundtrack down. It's a shame actually, the other songs weren't half bad and some pieces, particularly those that used the violin, were actually pretty good. Oh, well.\\n\\n\r\nCharacters (25%) - 3/10\\n\r\nI already mentioned the worst aspects of the characters in the Story section, so I won't bother to repeat them. Aside from those, the side characters are just so predictable and generic that I can't really find a reason to care about them. Their personalities can basically be described by their hair colour.\\n\\n\r\nRed=Tsundere; Blonde=Arrogant Ojou-sama; Blue=Cool Beauty; Light Blue=Quiet Stoic; Oh the originality!\\n\\n\r\nEnjoyment (10%) - 5/10\\n\r\nSince I am a male teenager, I can't exactly say I was bashing my head on the table while I was watching. It's enjoyable for what it is and as long as you keep your expectations low, you won't be disappointed. My main problem with it is that it's just so generic and predictable. I can hardly tell it apart from Seikoku no Dragonar and that only came out one season before this! Just watch Trinity Seven when it airs this fall. I read the manga and it's the same thing as this but better in every way. It has a better plot, a more OP protagonist, a bigger harem and after you watch it, I'm sure you'll forget all about Blade Dance. Don't waste your time with this anime and instead watch something meaningful like Ping Pong or whatever.",
            "date": "2014-10-02T01:17:00+00:00",
            "helpful_count": 13,
            "mal_id": 163245,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4091451.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/BlackPrism",
                "username": "BlackPrism"
            },
            "url": "https://myanimelist.net/reviews.php?id=163245"
        },
        {
            "content": "Ok, so what we've got was another one of those harem based fantasy anime, where it was some sort of \"Infinite Stratos\" kinda of thing where a school for girls was suddenly been invaded by a guy who can do what them girls can do kind of thing, soooooooooo, generally there is no story except a plot where a red head bitch was trying to have the guy all for herself because of what he can do and what he has so that she can win in the so called \"Blade Dance\" and the rest was the usual them girls competing for the guy's affection,which btw make the story \"Poor.\" ( Should I explain more? Mr. Mod) The art, well, what do I like about it.......FANSERVICE!!!!!!!Yep, seeing Claire and Fianna's pantyshot was good, there were also the moe that come with it when it comes to the girls attire that I find very cute, although, Claire and Fianna's naked scene were at bit regulated, seeing them in such naked glory was enough for me to give this anime's art a \"Good.\" The sound was good since I kinda like the opening theme and I also like the VA's who did Claire, Fianna, Rinslet and Est's voices, however Ellis and Velsaria's voices were a bit too matured, in fact it would have been better if Ellis's voice would have been better if done by Itou Kanade and Velsaria's voice should have been done by Hikasa Yoko. Character, I gave it a \"fair' co'z even though the characters where the usual cast that one would find in a usual harem theme anime, them characters had somehow proven to be different from the rest, co'z all four of the harem member where portrayed as fighters and needless to say there isn't that usual bimbo and one who has stays on the sides that come with every harem based genre, in fact everyone were competing for the guy's affection, also there is the part where I really hate Claire for being this bitchy lass that she is somewhat of a possessive girl who claims ownership of Kamito, I'm also disappointed of Kamito for not only being this usual harem guy, but being forgetful of Fianna  whom he save a couple of years back, but then again him getting cake on his face was pretty funny which was the enjoyable part where I give it  a 'Good\" coupled with the fanservice and moe, but overall imo this anime deserves a 6 though it was enjoyable it was still the usual and that all I have to say.\\n\\n\r\nMy ratings:\\n\\n\\n\r\nStory: Poor 3.\\n\\n\r\nCo'z it was the usual harem based fantasy anime.\\n\\n\r\nArt: Good 7. \\n\\n\r\nThe score was for the moe, fanservice and Claire's panty shot.\\n\\n\r\nSound: Good 7.\\n\\n\r\nIts for the opening and the VA's who did Claire, Fianna, Rinslet and Est's voices.\\n\\n\r\nCharacter: Fair 6.\\n\\n\r\nSince the harem members even though they're the usual harem, they were portrayed differently, but still imo it deserves a 6.\\n\\n\r\nEnjoyment: Good 7.\\n\\n\r\nSame explanation as the anime's art category.\\n\\n\r\nOverall : Fair 6.\\n\\n\r\nAs I've said, it maybe enjoyable, but it was still the usual. (Do I need to explain more? Mr/Miss Mod)\\n\\n",
            "date": "2014-10-01T11:47:00+00:00",
            "helpful_count": 9,
            "mal_id": 163163,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2004376.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Baddie007",
                "username": "Baddie007"
            },
            "url": "https://myanimelist.net/reviews.php?id=163163"
        },
        {
            "content": "This show is what i would call the ultimate surprise. This show is something that comes out of no where. You just have to get through the cliche infested first episode\r\nStory wise the story itself is good, What makes this story great in my opinion is the back stories of every character and how they all seem to come together with each other. That is the main reason i personally love this story. Ren Ashebell win the blade dance years ago greatly influences all the female maidens at the school. Restias actions greatly influences Kamito and Greyworth. That to me is a great story, wheneverything connects with each other.\\n\\n\r\nCharacter wise i find this show to be fantastic. While the characters themselves may be a little cliche, i find that this show has some of the most intriguing back stories to date. Almost every character that we see has this back story that is full of depth and completely drives them towards their goal of the blade dance or their goals outside of blade dance. A person favourite thing about the characters are the female characters. You see this school teaches elementers the ways to use their powers, but all the elementers are female. So they haven't been around boys their age that much so when Kamito comes in it just brings up the funniest situations like when Ellis says in public that Kamito is her first yet by first she meant first boy she held hands with. It honestly was a shining part of the show.\\n\\n\r\nArt style is something i pride myself on. I take a huge look into art style i find this show to have one of my personal favourite. I like color and this show is full of it and there are some moments that just leave you in awe.\\n\\n\r\nMusic is bloody great. While the songs in the show are pretty good i find the OP to be amazing and the ED to be catchy as all hell.\\n\\n\\n\r\nOk im going to be honest. You have more then likely read most of this already. So im guessing that you should already know i enjoyed the hell out of this anime\\n\\n\r\nOverall this show came the hell out of no where. One reason i choose it was because of the art design and that it resembled Dragonar academy. I thought this anime would fall around the same score a 7 or 8. NOPE! This show has amazing characters, pretty damn good story and pretty damn good visuals and music\\n\\n\r\nSo it says ten because honestly id give it a ten\\n\r\nIs it a little over board? maybe\\n\r\nBut when i grade animes i grade heavily on enjoyment because in the end that is what matters the most",
            "date": "2014-10-01T03:21:00+00:00",
            "helpful_count": 9,
            "mal_id": 163111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4056579.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Guru93",
                "username": "Guru93"
            },
            "url": "https://myanimelist.net/reviews.php?id=163111"
        },
        {
            "content": "You can’t be tricked into watching this show expecting it to be something different, the cover makes it very clear what it is, this isn’t a bad thing, but the content is.\r\nI always thought i was a sadist, but apparently i’m a masochist, since i made myself sit through this whole thing.\r\nSuper powerful teenager who’s the only character with a japanese name accidentally meets naked tsundere that proceeds to attack him. Holy shit doesn’t that sound like literally every single show in this genre? \r\nI don’t think using character archetypes is necessarily a bad thing, lot’s of shows have showed us that you can dogood things with them if you have some idea of what you’re doing. A character being a tsundere doesn’t immediately denies her of any possibility of being likeable or even a good and interesting character, archetypes appeal to a lot of people and they make writing a bit easier, that’s why they’re popular. However, STBD doesn’t even attempt to do anything with these characters, it actually makes then significantly worst because they are too present and toned up, to the point where they’ll be in a important fight, then Kamito protects one of then, and the others show that they’re jealous and start wanting to argue and change their positions in the battle, are you fucking serious? It’s not even fun or funny anymore, just annoying. Claire will take her whip out and say the most boring and predictable tsundere line ever, then they’ll drag the joke for some time, and repeat. Making a character sad and then happy again is not development, and being bad at cooking is not a personality trait. What makes me shocked is that this show didn’t even tried to make sad backstories for the character, Claire’s sister doing bad things doesn’t make Claire any more interesting, the same goes for Ellis. When you make every single important girl in the series fall in love with the MC you limit a lot the development those character’s can have, this is just outright bad writing. Imagine a series with this exact same setup, but the girls eventually go on and start dating other guys or even dating between themselves, wouldn’t that instantly make it more fun? This is a power fantasy, so it needs this bullshit, however, if you have watched Rakudai Kishi no Cavalry, you know you can make it into a decent show.\\n\\n\r\nThe power levels and magic system in this show are terribly poorly established, we know there’s a contract and that the contracted spirit has two forms, and that’s all. There’s some sort of magic, that only one character uses for the whole show and is never explained. The character’s strength is never made clear, the show starts with legit one of the worst, if not the worst action scene i have seen in my life, it’s super badly directed, choreographed and animated, Ren Ashbell does a jump, and then he wins. What do we learn by that? Nothing. Having two characters we don’t know fighting in a confusing scene for something we also don’t know is not a good idea. The spirits have elements to then, hence “of the elementals”, but it is actually never important and gets brought up just a couple of times in an attempt to make the fight to seen interesting or dangerous, of course our main girl has fire magic and her friend-not friend has ice magic. Rinslet actually isn’t important at all, she just appears and disappears whenever they need her and makes the same joke about the maid every single time, on a later fight she gets immobilized for a few seconds and says “I can’t move anymore” after she gets rescued, okay. Later on the series Kamito starts hack’n’slashing at max speed for no reason at all. They don’t even have the decency of showing us the actual fights to go up the ranks in the school, there’s not a attempt to make other kids be antagonists and no interest in showing their development, well, i guess there isn’t none, but the point is we just get told that they are getting better and going up, there isn’t even a still shot of the ladder or anything. The fights that do get shown are so incredibly badly executed that they can’t even establish the power levels with a loose soft magic system where the whole point is that the MC is overpowered, that’s how bad they are. Also, why does everything in this show sound like an explosion?\\n\\n\r\nRemember how people from Raven are supposed to be problematic? It isn’t surprising that that never is important either, we actually only see that once when they destroy Kamito’s small house, which seemed like more of a comedy scene than a serious one, since that's why he spends the rest of the show in Claire’s room. The supposedly problematic people from Raven (which are literally only the two of then) are the ones who go out saving people in the city because the school knight's are useless, what is surprising is that they never bring attention to that, why wouldn’t you? \\n\\n\r\nThe most likeable character was Jio Inzagi because he kicked every single annoying character’s ass he saw, but he still lost because Kamito with a wound that should have killed him is too strong, Restia even admits that he could win in that state.\\n\\n\r\nNow about the fanservice, it’s decent at best, aside from Est’s delicious legs everything is just mediocre.\\n\\n\r\nI could still go on about how Spiritual Authority is only created to make a bad scene of Claire being attacked by a slime, or how Ellis is a fucking knightess and needs extra classes to read the most basic magic fundamentals that even the viewer knows, well, actually, i just went through that.\\n\\n\r\nThe second best thing about this show is the ED, it doesn’t sound totally generic and tries to be action packed like all these OP’s try to, i really like the bagpipe sound and it’s kinda cheery, the girl’s illustration are also the best looking images in the whole show.\\n\\n\r\nAnd the best thing about this show is when it ends, because you’re relieved of the pain.\\n\\n\r\nFarewell stupid light novel adaptation, and i hope we never meet again.\\n\\n",
            "date": "2018-04-26T09:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 279058,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4977819.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 3,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Derykasd",
                "username": "Derykasd"
            },
            "url": "https://myanimelist.net/reviews.php?id=279058"
        },
        {
            "content": "I was pleasantly surprised by this one and it's quite a shame that it seems like it won't be getting a second season as lots of plot points are left unresolved. If you really value having closure and you are not willing to read on I would avoid this one, you will find no closure here.\r\nWhat we have seen so far of the plot is not particularly complicated. Kamito Kazehaya is a boy who can utilise magical powers that usually only girls can use. He attends an otherwise all female school and has a shady past.\r\nThis one is another good example of how to properlyexecute having a story alongside being an ecchi show. Lots of shows usually can’t get the balance between these factors down and end up being heavily weighted in one direction or another. This is not the case here and I can safely say that it's got the mix of Comedy, Action and Ecchi down almost perfectly as none of the aforementioned elements spent long enough in the spotlight for me to tire of them. \\n\\n\r\nI'm aware that there has been a little disagreement over the quality of the characterisation and voice acting when it comes to certain characters but as someone who has not read the LN, I feel as if they pull it off. I personally don't particularly enjoy fanservice of characters I'm not invested in but as far as I am concerned Blade Dance succeeds in giving the cast proper backstories / does not fall into the trap of having them be cutouts with slightly different bust sizes. A clear victory for those who like a little plot to go along with the 'plot'.\\n\\n\r\nAs far as characters go, special mention must be made to Ai Kakuma as Terminus Est who was just perfect / really stole the show. Easily my favourite character from this as nearly every moment Est was on screen was comedy gold. Having long silver hair, knee socks and that amazing voice helped a little as well.\\n\\n\r\nIt's not all roses however as certain sections of exposition can get a little cliché at times. I'd like to spotlight the scenes with the headmistress as these where about as subtle as a chainsaw. I was half expecting her to break out the Dr Evil pinky laugh whenever the show sloppily attempted to foreshadow her 'mysterious' plans. Keep in mind however that this is an action-comedy harem; cheesy moments and unintentional comedy are part of what you are signing up for! \\n\\n\r\nThe actual world that the story is set in could have done with a bit of fleshing out but it's sufficient. The majority of the story takes place in a small number of locations that, while nothing new, are well drawn and detailed. \\n\\n\r\nThe music compliments the show well, the incidentals are a little forgettable but they work well in context and the fight music is usually intense. (You get a pass despite blatantly ripping off the Pirates of the Caribbean theme for your main battle theme.)\\n\\n\r\nSpeaking of, the action scenes are really impressive when you take into account the budget. They aren’t treading any new ground with the effects or battle style but it executes all the old tropes well enough that you should still enjoy it. \\n\\n\r\nOverall this is a short, enjoyable romp through a rather basic setting with funny and interesting characters. Yes, it's walking the path well travelled as far as the plot goes but it walks it well.\\n",
            "date": "2014-10-25T10:29:00+00:00",
            "helpful_count": 7,
            "mal_id": 166125,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2653305.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Doubleagent",
                "username": "Doubleagent"
            },
            "url": "https://myanimelist.net/reviews.php?id=166125"
        },
        {
            "content": "Seirei Tsukai no Blade Dance\r\nThis anime wasn't have a fantastic story that can make you hold breath during the show, but what makes me can still enjoy this anime..??.\r\nFirst character, character development in this anime is very nice, indeed not too influential to story, and so many tsundere character in this anime, but character in this anime have a charm of its own. and my favorite is Terminus Est and Ellis Fahrengart.\r\nTerminus Est is the best girl in this anime, loli who always melting situation, she is reported as a powerful sword spirit known as a demon slayer, she sometimes put a chocolate in herbody and ask Kamito to lick it, and she is always naked but she doesn't want to take off her kneesocks, pervert indeed but her childish personality which makes she is interesting.\\n\\n\r\nEllis a soft tsundere girl, and wind elementalers that have a eagle spirit named Simorgh, she is always shame and became awkward especially when it concerned with Kamito, but that's sweet side from Ellis.\\n\\n\r\nSecond music, i love music in this anime, moreover ending in this anime i love it.\\n\\n\r\nThird atmosphere, i don't know why but i comfy with atmosphere in this anime, and last art, art in this anime is pretty good. \\n\\n\r\nMaybe just that much i can give about what make this anime can enjoy by you, i tell you this anime wasn't have a fantastic story but you can still enjoy this anime.",
            "date": "2016-07-13T11:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 223928,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5199507.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/hilvisa",
                "username": "hilvisa"
            },
            "url": "https://myanimelist.net/reviews.php?id=223928"
        },
        {
            "content": "Here, we face your typical harem anime. Normally, I put them down the moment I notice it's barely going very far from the genre, but I had faith. The first episode of this anime opened alright, with our male lead being pretty confident through the typical \"accidental\" situations you're used to in these anime. Take those quotations strongly, because every veteran harem fan knows why I put them there. Nothing is ever an accident in harems to the females.\r\nBecause of how rough this anime is to me, I don't even want to talk about it very much, because it barely does anything different from anotherharem, but I am a bit upset it has such a high score on this website, so I want to make sure it gets a strong amount of negativity somewhere for the more innocent anime viewer who will believe it is good. Normally, I want to start with positives since that's the part you are curious about, but sadly, they will be spaced as I go on. Most of this will be negative and I have no way to really make a separate positive section.\\n\\n\r\nLastly, I will only really go over all of the \"harem\" aspects, not the story. I feel sad to say, the story barely interested me because of how overshadowed it was by the genre it is in. If you want a review that covers it more, read one of the more positive ones. Then after you're done, come back here to read why the comedy rarely funny.\\n\\n\r\nWith all due respect, I know a lot of people enjoy abuse humor, but I do not know why you do. It's funny to me whenever there's a cause for it. Despite ironically enjoying random comedy a lot, where absurd things happen to even the most innocent characters, I never can bring myself to smile whenever an innocent character gets punished, though due to how often it happens to male characters, I actually do, darkly enough, laugh at innocent female characters getting punished. They deserve it way more in my book, so even if they're innocent, I usually get a laugh out of it since I'm not used to them being in trouble. I have special exceptions, though, if it's a female character with a very good personality.\\n\\n\r\nSo, let us begin. If you are a fan of the anime already reading more reviews to see how other people feel, please avoid mine. You will only get mad at me after you read it.\\n\\n\r\n(SPOILER WARNING)\\n\\n\r\nThe first episode opens very abruptly. Out of nowhere, we are immediately treated to a generic harem scene without any context. I am excluding the pre-opening part showcasing the battle since it's so subtle it's not worth mentioning at this point. But, anyway, you are thrown immediately into a standard harem scene, where the male happened to walk by a female bathing. I am fully aware I'm a broken record at this point, so I try to keep any discussion about these scenes brief, so I will get to the point. He stares, clearly not his fault, she gets angry and tries to punish him. Hahahah- not really.\\n\\n\r\nWhat is the standout for this particular scene, however, that made me feel the need to talk about it fairly long? Well she is trying to punish him, she accidentally breaks a tree behind her, which would have literally flattened her. After finishing this whole anime, I wish that tree killed her. But sadly, our male lead decided to save her. So, now you're expecting me to bring up how she's suddenly \"appreciative\" of him, right? No, it was apparently his fault for pouncing on her well she was naked and he is still punished. Yeah.\\n\\n\r\nRemember earlier, I said I had high expectations because the male lead was confident, which starts around here. He mentions she is wearing panties of a particular color (became a brief running gag during early episodes) and she corrects him, only to feel bashful. From there, he got a bit cockier and provoked her in adequately funny ways. It gave me hope this would be a harem more toward KonoSuba where the male lead has a bit of a backbone. Sadly, it dries out pretty quickly going forward.\\n\\n\r\nI am not even kidding, this anime feels the need to add a ton of these \"accidental\" scenes way more than it should, given the \"elaborate\" nature of its story. You can't take most of it seriously because it truly doesn't feel like there's any character development that is worthwhile besides the male lead's struggles. Most of the females introduced almost always find some way to \"have enough\" with the male character the moment they're even remotely confused. Please, don't think I'm exaggerating here, I do try to see the best in every anime I watch, but I could not with this one and its female characters.\\n\\n\r\nI will try to bring out the positives one first before I really get into this. Yes, positive \"one, you did read that as singular. Ellis Fahrengart, a female character who still fell victim to the \"I do not want to hear it\" harem trope of punishing the male lead, almost always apologized every time she did it, and whenever she did walk in, the situations actually were fairly worthy of being judged negatively. I mildly enjoyed her development, going off what this anime calls \"development\" that is, and I really wanted her to be the one to kiss Kamito. Er, more on that later. But, overall, she was the best female out of the entire cast. Her voice actor is talented at changing her tone though, as she has two unique tones in the anime for being serious and bashful. Had Est had more development, I would have talked about her as well, but she is probably the only other tolerable female character due to her stubbornness being more adorable than aggravating.\\n\\n\r\nThe other female characters aren't very lovable, but not horrible. Rinslet is just your typical pompous aristocrat who feels the need to talk down on everyone and gloat at how superior she is. Occasionally, she has pretty good lines of dialogue, such as when she was talking down on other nobles at one point, but overall, she's average. You can't like her very much, but also can't hate her.\\n\\n\r\nFianna is the female character designed to tease Kamito, and as you can expect, that means she has blackmail on him. She is the only one who knows of his former identity, \"Ren Ashbell\" which is the character seen fighting an unknown female combatant from the first scene of the anime and winning that takes place before the \"comical\" harem shenanigans began later. That was actually just Kamito in disguise. He met Fianna as a child, defeating an enemy that was about to kill her, but Fianna recognized the swordplay at work and figured out that Ren Ashbell was the alias for Kamito Kazehaya. So, they both made a promise that he would see her again in a few years. Needless to say, he never did that and also forgot about her, so she held it against him and decided to pick on him for the rest of the anime. Naturally, meaning anytime Kamito wanted to backtalk her, she threatened his identity. Claire never finds out he is Ren Ashbell, so yeah, you can just assume the worst in that she holds him on a leash for the rest of the series whenever there's \"comedy\" with her.\\n\\n\r\nHere we go, I can finally let loose with the female lead. Claire Rouge sucks. I really dislike this character and have no sympathy for her at all, no matter how \"tragic\" it is that she wants to find her sister. She is picked on a lot by other students of the school, but I enjoy these scenes because of how obnoxious her character is. The whole point of a \"warn down, depressed\" character is they get bullied, they feel sad and our male lead is here to comfort them. You feel for them when they don't have the strength to fight back anymore, but not when they let out their anger on other people. Now, I do know this is how some people handle this, but it bothers me when she gets mad at the people who do care for her. So, let's bring up that other scene I mentioned earlier.\\n\\n\r\nThe most positive scene I know of from this anime with Claire is when she is fighting Restia's creature from the netherworld. Kamito, the male lead, feels anxious to fight the creature due to facing negativity over seeing Restia again, his former contracted spirit. Claire, amazingly, felt bad for him during this and noticed that he was sad. Not knowing him very well, she only thought of one way to raise his spirits, though definitely in a way that I didn't expect. I assumed it was just going to be some positive reinforcement, or her apologizing for calling him a slave so often, but instead she just makes out with him for a bit. This is the only action Kamito gets in the whole anime and I actually admired how quickly she was to do this, as I expected her to be far more bashful about it due to the way she treated any \"intentional\" moment he shared with another female character. I expected a hug, if anything, when she approached him, but instead it was a full on kiss. It raised his spirits, and he was ready to fight. From here, I was a bit more optimistic about Claire and assumed she was now dating Kamito going forward.\\n\\n\r\nSo, they do fight the creature, and another surprising development occurred immediately. The characters have contracted spirits and Claire's is Scarlet, a \"fire-cat\" that can turn into a whip as a weapon for her, or \"elemental waffe\" as the anime calls it. The fire-cat is capable of fighting outside weapon form and attempted to save Claire from dying, only to be eaten alive by the demon in front of Claire's eyes. From here, well you know, I'm not completely heartless. Now, Claire has gone through hell by the school, wants to know the origin of her hated sister and has now lost her closest companion. I felt sad here for the first time in the whole anime, though also the only time. I was ready to believe her character would finally have some notable development right here, as Kamito now had a reason to be a spirit for her. Oh, but of course, it was wiped way not that long after as we found out Scarlet was still alive, albeit drained of power. And just like that, my old thoughts of Claire immediately came back.\\n\\n\r\nDespite the \"bonding\" moment she had with Kamito, she was very quick to go back to their old ways after that fight, as she once again wants to \"burn him to cinders\" whenever she misinterprets a situation. I told you before about Est briefly, how I considered her my second favorite female character as far as development goes. Earlier in the anime, she always sleeps in Kamito's bed with him. Kamito acquired her as a contracted spirit after saving Claire (yes, saves her twice in the same episode, many more times too, but she never respects him enough to not assume the worst of an accidental situation), but her non-elemental waffe form debuted a bit later. She is the youngest of the female characters, as far as appearance goes anyway, and is introduced being fully nude in Kamito's bed. She insists that her \"thighs\" are the most lewd part about her body and gets offended whenever Kamito brings up why she still wears thigh-highs, saying it is not as lewd as her being entirely naked above them. Mildly comical.\\n\\n\r\nSo, yeah, Claire walks in when this first happens, misinterprets \"I am going to burn you to cinders\" whatever. This same sequence happens a bit more than I wanted it to, with the only comical one being when Kamito wakes up and immediately opens his blanket to see Est is not there and sighs in relief. I actually mildly enjoyed this scene. I brought up the entire story of him meeting Est as the main point of the \"harem\" humor, usually being whenever a girl walks in on him in the bedroom and Claire, every single time, misinterprets it and punishes him with her power.\\n\\n\r\nHonestly, I knew this was standard already, but what really bothered me was one particular scene. Sadly, Ellis, despite the positive marks I gave her, has the worst one in the anime, even worse than all of Claire's combined, and that is why she is still not really a character I \"like\" a lot in the anime, but just appreciated she had some development. At one point, she invites Kamito over to her house, easily her worst scene in the whole anime. And the scene with her in the maid outfit really, really, really bothered me more than any other harem scene has in a while. She tells him that her friends told her men like maid outfits. He says that not all of them do, so...ugh. I really hate having to remember this again, give me a moment here before I type the rest of it. But, she actually manages to turn this into a negative scene. Without him saying anything else, she immediately judges him and assumes he wants her to wear something even worse, and is quick to put a sword to his neck for it and forces him to accept her maid outfit. Unlike the other scenes in the anime with threatened sword violence, she was not too slow to put the blade directly on his neck, implying he was literally going to die for this. This alone is why I can say I do not like her as a character. She did apologize for misinterpreting situations he was in, but keep in mind she still did the whole \"punishment\" thing every time, and this one was just the worst. Despite how much I hate it, however, I can't bring myself to give Claire a higher rank than her. Claire did this garbage the whole series, well Ellis did it a few times, I believe. I do say \"quality over quantity\" though, but most of what Claire did still barely outranks what Ellis did.\\n\\n\r\nWhoever wrote the humor in this anime, I want them fired for this scene alone, or at the very least, thrown into an anime where the goal is to displease the viewer, because they could easily write some dark humor. I try to see the best in a lot of people and respect their tastes, but if you enjoyed this scene, do not ever tell me. I will judge you for it subconsciously for a very long time, but at the same time, would be all the more curious as to how you could laugh at it. I don't want to sound antagonizing here, so if your really did enjoy this scene and want to tell me why, don't be afraid to approach me, despite what I said, with a PM explaining why. I am not completely heartless, I just had some rage venting right there well I was talking about it.\\n\\n\r\nSo, let's see. I brought up some of the worst negatives and, pretty much, the entire series' dynamic. As I said, didn't have much interest in the story itself. Restia showed up solely to laugh at everyone and never lifted a finger. Barely had enough deveopment for me to talk about her for longer than a few sentences. Oh yeah, there was another male character, Jio Inzagi. I like saying the name, but his role was just to be reminded that Kamito is the true demon lord, though Kamito himself doesn't defeat him, so this destroyed the whole context of that. Fianna did most of the work. I liked all of the abilities he had, though, and one of the strong moves hitting him had some of the best still frames in the anime, as I thought it looked pretty cool, and his scream was pretty exhilarating to listen to. The voice actor did a good job overall, but the anime itself is what made the character feel worthless. There was some other stuff too, like this elf-looking woman who was giving people curse seals near the end, but it was rushed. Greyworth was pretty attractive and had some comical banter with Kamito a few times. Yeah, I believe I ironed out most of my final thoughts. Ellis had an older sister, Velsaria, who was hyped up just to be disappointing at the end. I enjoyed her voice, though. She was the one fighting Ren Ashbell during the first scene of the anime. They actually bring this scene up quite a few times.\\n\\n\r\nOh, I almost forgot. Carol Nastassja is the best female in the anime. Her minor appearances made me scoff her because I had so much negativity welt up that I suppose it only made sense she wasn't in my mind earlier. She is the only one who did not negatively judge Kamito and was also the only one with the balls to mock the other females who were bashful toward him. There was one scene where the other females were upset over Est holding Kamito's arm, visibly glaring. Carol mentions his other arm is free, but then they tsundere-esquely say it's childish to do. She acknowledges it and immediately grabs his other arm, making them angrier, and I actually laughed at this. Not mildly, but almost loudly. It caught me off guard for an otherwise mediocre anime and I held very high respect for Carol ever since. The most notable scene she had in the anime besides this was when she accidentally fell on Kamito and his hands ended up in the wrong area. She felt a bit violated by it, but was simply scared and was actually apologizing for falling on him since she actually acknowledged it was her fault. She is a normal female character. A real shame that, at this time of writing, only one user has favorited her on MAL. Whoever you are, thank you. You have good taste in anime women.\\n\\n\r\nThis review is all over the place. Was more of me talking about the characters again. Sorry if it wasn't informative, but I mainly wrote it to let out my frustrations about the anime and how, amazingly, a few characters could negatively kill the whole experience for me. It is the first anime I have given the second-to-lowest score on this site, since it managed to have barely just a bit of comedy in it to make me laugh a literal few times throughout the entire thing, meaning I didn't think it was one of the worst things I ever saw. If the manga really is a lot better than this, I am sure as hell curious to give it a read. Maybe Carol has more appearances in it.",
            "date": "2019-02-14T07:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 301655,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=301655"
        },
        {
            "content": "Story: so the story is pretty much like that this guy was in a blade dance 3 years ago as a girl he ends up meeting a girl named claire who he ends up meeting when she is bathing and than they get a seal wont spoil the rest\r\nArt: the art is pretty good nothing bad about it\r\nSound: the sound was very good also had a very nice ending theme song i liked\r\nCharacter: now the characters kinda are freaking good you do get a different variety of characters to this anime\r\nEnjoyment: now i freaking enjoyed the hell out of this anime for the ecchi toothe harem too all the comedic stuff that would end up happening to kamito just a funny as hell and the action was pretty decent \\n\\n\r\nOverall: im giving this a 9 for like what my enjoyment says just the comedy was over the top funny for me and everything else was aswell id so recommend this anime",
            "date": "2016-08-18T22:56:00+00:00",
            "helpful_count": 5,
            "mal_id": 227092,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106026.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AnimeFan48",
                "username": "AnimeFan48"
            },
            "url": "https://myanimelist.net/reviews.php?id=227092"
        },
        {
            "content": "Story:\r\nWhere to start with this story... Seirei Tsukai no Blade Dance tells the story of a special young man named Kazehaya Kamito (the only reason I know his name is because every freaking character whines his name at least a dozen times every episode). \r\nKamito lives in a magical world where wealthy members of society send their daughters to some school with other girls to master the art of contracting spirits for some reason. These spirits are used to fight each other for no particular purpose. The contracted spirits come in many forms, from elemental spirits to golems to even the MC, who, by theway, also happens to be the successor to the demon lord, because of course he is. \\n\\n\r\nLong story short, and without going into any potential spoilers, a kawaii red-headed animu grill for some reason manages to bind Kamito as her contracted spirit, cuz reasons, and takes him as a kind of servant. The MC is also sent to this special school, because obviously he's the only man with the ability to contract a spirit, i mean he is the successor to the demon lord, after all. Basically, it's zero no tsukaima meets infinite stratos, but with less fan service than the latter and somehow more shit than both.\\n\\n\r\nAnyways, every few years there's an event called the blade dance where all the pretty anime girls take their spirits and battle each other, the winner getting a wish of theirs granted or some shit somehow.  Also there's this mystery girl that is shown throughout who seems kind of like an antagonist. The only problem is that for there to be a true antagonist, there has to be an actual story.\\n\\n\r\nIn summary, there is basically zero action and literally no plot progression, aside from a rushed and out of the blue conclusion that didn't even address the main plot element that was being built up for the entirety of this slog-fest of a show. Surely this show was made with a season two in mind.\\n\\n\r\nEdit: Oh yeah, and MC also manages to contract the spirit of a sword, who of course is also a small, cute anime girl who appears to be about 8. She obviously is completely subservient to her master and insists on sleeping with her master in the nude, because of course she does.\\n\\n\r\nArt:\\n\\n\r\nThe art in this show was pretty solid. The animation was smooth and the picture was strong overall, even great at some points. The backgrounds and background characters were relatively well-done, as has come to be expected of Kadokawa (along with poor plots). The major characters were well-drawn and pretty kawaii imo, but their art styles made them appear to be a little young for my taste. All in all, the art looks quite nice, but it is nothing particularly memorable or that would stand out compared to other shows known for nice artistic flair.\\n\\n\r\nNote: If you are watching this show for the anime nips this is not the show for you. There is not a single nip shown, and i can probably count the number of panty-shots on one hand. This was the biggest letdown of the show, and what I was looking forward to the most when watching.\\n\\n\r\nSound:\\n\\n\r\nOn first hearing the OP, I quite literally wanted to vomit. The song starts with a few English lines that were horrifically distorted by an exaggerated Japanese accent. By the end of the show, however, I had come around to it and actually enjoyed it quite a lot.\\n\\n\r\nThe ED wasn't bad, and it contained a multitude of shots of cute anime booties, which is one of my favorite things, second only to cute anime nips. Because of this, I was more than able to enjoy and watch most of the ending without skipping it throughout the show. It wasn't horribly revealing, but hey I'm not complaining, I guess.\\n\\n\r\nCharacters:\\n\\n\r\nThe show consists of a number of stereotypical anime girls, all vying for the love of the MC.\\n\\n\r\nClair Rouge - red-headed girl who contracted MC to him for some reason. Sloppy noble who sees MC as a servant. She pretends not to like him, but gets defensive. She is cautious with flirty stuff, but she follows the lead of the bolder characters, because this is anime and of course she does.\\n\r\nBlonde Chick- Sorry I don't remember the names, but I just finished the show last night. She is an upright and proper noble who pretends not to like the MC. Blonde chick is objectively best grill, and I will personally fite anyone who says otherwise. The stereotypes don't stop here.\\n\r\nBlue Hair Chick- Noble with a firm sense of justice, basically the stereotypical equivalent of the \"leader of the disciplinary committee\" from so many other shows.\\n\r\nWhite Hair Chick- A girl who is also a sword and is contracted to the MC. She appears to be in about the fourth grade.\\n\\n\r\nEnjoyment:\\n\\n\r\nDespite all my complaints, I was able to watch the show in its entirety. There were times when I didn't want to continue. It's the kind of show that you don't pause when you get up to get dinner from the microwave, and the kind that doesn't really need to be actively watched. I still didn't hate it, but it's not like I enjoyed it or anything... baka.",
            "date": "2016-01-12T20:28:00+00:00",
            "helpful_count": 6,
            "mal_id": 208396,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5097153.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/STIDDmuffin",
                "username": "STIDDmuffin"
            },
            "url": "https://myanimelist.net/reviews.php?id=208396"
        },
        {
            "content": "This is my favorite series of all time(anime+novel), so maybe some parts may be just me. Okay let's start, this anime has been adapted from the Light Novel by the same name written by Shimizu Yuu, it has that cliche feel to it at the start but the story only gets better as it goes on, unlike most other harem series(zero no tsukaima, I'm talking to you), what I mean is that while this does not have that unique setting that most people want, there's actually a very big world built and it's very well used as the story goes on. \r\nNow let's talk aboutthe anime's individual parts.\\n\\n\r\nStory 9/10:\\n\r\nWhy I'm not giving 10 since I said the story is that great? It's because I'm rating the anime, not the novel, the anime cut off some parts from the novel, but it's nothing of a big deal.\\n\r\nSoooooo, the story starts with Kamito, male MC on the forest looking for the Areishia Spirit Academy, when he meets the most probably main love interest, Claire, she's a cute redhead, but she's tsundere. Kamito then gets to the school and soon meet the other girls of his Harem.\\n\r\nDoes not sound original does it? Yeah, does not but that's the start of the story only, if you think this would be just a magic school with harem, then you're deadly wrong and I'll explain why.\\n\r\nLots of times you'll see the antagonists points of view and they all have reasons and motives of their own to do what they do(though Eva Farengart does not get developed at all due to them having to cut less important stuff), even so sometimes it's predictable to know what will happen and sometimes it won't be.(Like when you would expect Kamito to beat Jio on their first encounter) with there's not much to talk about the Story in the anime as nothing much happens and Areishia Academy arc of the story is mainly just to develop the main characters and their relationship as well as introduzing the bases of the story.\\n\\n\r\nArt 9/10:\\n\r\nI'm not picky with Art, but Seirei I think it's really good, not as good as Boku no Hero or No Game no Life though, but the animation is top notch and really fits the anime.(Just hate the damm fog that won't let me see Claire at the first episode.)\\n\\n\r\nSound 9/10:\\n\r\nWell this . is much subejective, but I think the BGMs are all very good and really fits the anime. I also really love Shukusai no Elementalia and Holy Domain songs, I think they're supposed to be a second ending/opening? The actual op from the show is average though, it's that kind of type it's best enjoyed if you like the show. On the other hand the actual ending is very catchy and is my favorite anime ending of all time.\\n\r\nCharacters 9/10:\\n\r\nKamito Kazehaya: Male protagonist, he's a very capable Harem protag for once, I mean, he's not dense, not wimpy, not a pervert and is actually capable of fighting in combat, unlike many other Harem protags who can't fight that much. The only thing I do not like about him is that when he was 13 years old he cross-dressed and became a trap character. :|\\n\r\nClaire Rouge: Probably the main love interest and the first girl to join Kamito's Harem. She's an arrogant bitch ojou-sama that's awfully bad at cooking, but her love for Kamito is the most strong, but since she's Tsundere she won't show it. However Kamito does know that she and the other girls like him and he says later on the Light Novel that he can't correspond because he already like Restia and that if he takes them, they won't be able to use magic anymore. He talks that to himself though.\\n\r\nRinslet Laurenfrost:\\n\r\n\"You mean character from Harem the least developed?\"\\n\r\nGoogle about Rinslet.\\n\r\nJokes aside Rinslet is a ojou-sama, she's tsundere but not as much as claire, but she's really tsundere when it comes to Claire, since she won't admit she likes her as a friend and keeps telling they are enemies.\\n\r\nEllis Fahrengart:\\n\r\nEllis is the captain of Sylphid Knight and hates Kamito, but when he saves her from Jio later, she joins his Harem. She's not really tsundere but she does feel ashamed when weird stuff happens.\\n\r\nFianna Ordesia: The naughty princess that wants to make Kamito hers at all costs, she was once save by Kamito when she was 13 and is in love with him since then, when she joins Areishia Academy just to met Kamito she feels sad he does not remember her.\\n\r\nTerminus Est:\\n\r\nWell, you can't spell \"Best Girl\" without Est in it, she's Kamito contracted spirit and has a human form as a cute kuudere loli, she also does not care to be naked, as long she has her kneesocks on, to her she's only naked if her legs are exposed. She's really nice and don't you dare drop this anime before she appears. If you'll do, I'll know and you'll see what happens. hehehehe\\n\r\nOther characters:\\n\r\nGreyworth Ciel Mais: She's the Areishia Academy principal and a hot woman.\\n\r\nJio Inzagi: Best character of the anime. \\n\r\nRestia Ashdoll: Oops spoiler from the Light Novel.\\n\\n\r\nEnjoyment 10/10: \\n\r\nIt's my favorite.\\n\\n\r\nOverall 10/10:\\n\r\nI give my grades mostly on enjoyment and story, so I choose 10.",
            "date": "2017-09-15T10:50:00+00:00",
            "helpful_count": 2,
            "mal_id": 257590,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6157033.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jio_Inzagi",
                "username": "Jio_Inzagi"
            },
            "url": "https://myanimelist.net/reviews.php?id=257590"
        },
        {
            "content": "This is like a small remake of Zero no Tsukaima in a different time.\r\nThe anime overall is good, though its not because the story is so amazingly captivating. I feel that the story is the weakest part of the series. Its kind of meh, girls with magical powers that summon stuff that fights for them. Unique isn't it?\r\nThe most I like from this anime is how similar Claire is to Louise. But this requires you to have already watched or watching Zero no Tsukaima and also like it in order to like this one. IMO, this is the good part of the anime with thebitchy-spoiled girls that act like they own the world, but are all in denial and love about the \"special guy\".\\n\\n\r\nI kind of dig the male lead. More or less. He isn't weak in character and he doesn't get trashed by stupidity or sheer embarrassment. There is a decent amount of ecchi, but nothing too big or too great to call this amazing. \\n\\n\r\nThe anime is hilarious. The whole \"I'll burn you to cinders\" is the best catch phrase. And it happens quite often, so I got a good laugh.\\n\\n\r\nI recommend it, but only if you watched or like Zero no Tsukaima.\\n\r\nOtherwise, try it and see if you like it.",
            "date": "2015-03-04T02:04:00+00:00",
            "helpful_count": 4,
            "mal_id": 181658,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4488989.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/daimonfo",
                "username": "daimonfo"
            },
            "url": "https://myanimelist.net/reviews.php?id=181658"
        },
        {
            "content": "Zero no Tsukaima can be called as the first series which success the fantasy harem genre series. And now every series with the same genre in each season try to follow its success. One of them is Seirei Tsukai no Blade Dance (Blade Dance) for Summer 2014.\r\nBlade Dance is just your typical harem series. The MC is the only boy with the ability whose only girl can only wield, just like IS. And the story went as oh I found an enemy, let's the girls fight and I will help too. Oh, don't forget some unnatural ecchi scene. It's the same recipe. Even there aresome unfinished business at the end. Overall, the story is bad.\\n\\n\r\nThe art itself, though it's not really good. There are some blurry detail there. The animation isn't really good too, but it's still can be enjoyed. I won't bother with character design because it's your usual character design. I love the design of the monster though, it feels quite cool. (Edited) I find it's quite disappointing as they didn't use the 3DCG for all of their monster action. It's quite good to see the only 3DCG in the last episode.\\n\\n\r\nI like the OP and ED. They did a good job to bring the OP and ED song to be a quite easily remembered. The background song is quite matched with the daily day scene as well as the battle.\\n\\n\r\nFor the character, I love them though it's the usual recipe. The tsukomi MC and the innocent ladies. The antagonist girl in every episode but shrouded in mystery. Oh, and don't forget the Sword loli. She's the star. ;)\\n\\n\r\nAs the enjoyment, I found it's quite disturbing too see the art and ruin the enjoyment the most. As I reach the last episode, there are too many unfinished business. What a let down.\\n\\n\r\nAs I love the fantasy harem series, Blade Dance is your usual fantasy harem without any great difference between another series with the same genres. There are too many unfinished business which make the series need another season, but I'm pessimist if it's good enough to make one.\\n\\n\r\nThanks for your time to read this review.",
            "date": "2014-10-03T20:32:00+00:00",
            "helpful_count": 4,
            "mal_id": 163485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3452111.jpg",
                "scores": {
                    "animation": 6,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/xgunawan",
                "username": "xgunawan"
            },
            "url": "https://myanimelist.net/reviews.php?id=163485"
        },
        {
            "content": "This review will not have any spoilers(I'll try not too) and will just be me explaining on how I like/dislike the anime. The first thing I will talk about is the story. It is in the supernatural genre with the character controlling spirits with a contract. The story is good, but I did not like the ending as much since it left me on a cliffhanger. If you would want to see what happens next, you would have to read the manga or hope that they will make another season at some point, which isn't a high probability since it has been out for awhile.The art style was great, which bright colors and good backgrounds as well. The anime is only in japanese, but you would probably still like it even if you only watch animes in dubbed. The character developments are kind of wonky. One of the girls that is introduced mid-story shows to be part of the main characters past. For awhile, she is shown to be a big character, then she is not shown much afterwards. Another character at the beginning was not shown much until the end, where she was shown every other scene. Still, I liked the characters and how they interacted with each other. Overall, I enjoyed the anime and i wish that it would have continued longer, but I guess I can sit back and read some manga. The anime is 12 episodes long, so it will go by quick, so try to enjoy it as you watch. I would give the anime a 8 out of 10.",
            "date": "2014-10-24T01:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 165977,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3762825.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/TwofastSenpai",
                "username": "TwofastSenpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=165977"
        },
        {
            "content": "Describing this one of many shows that \"the anime industry spits out every season\" is somewhat of an injustice. You will find there is a lot more to Seirei Tsukai no Blade Dance than your everyday harem series.\r\nPlot:\r\nThis is an anime primarily about fighting and magic-wielding, which is nothing new, but it is more than enough to keep you interested for 12 episodes. The other main theme is harem/romance. What this show does well is prevent the two themes from conflicting with each other and therefore the plot feels serious yet the romance is sweet and entertaining, and compliments the story well as a formof comic relief. However, I feel like a lot of important plot elements involving the characters' pasts are poorly explained, possibly due to being only 12 episodes long. This is the type of series that could really do with a prequel more than a sequel. 7/10 for plot.\\n\\n\r\nArt:\\n\r\nCrisp, colourful candy for the eyes. The fluorescent artwork is what will keep you watching if nothing else does. The motion is smooth and the drawing is detailed. The characters themselves all look extremely cute and a joy to watch, all having distinctly coloured hair and eyes as standard. The uniform design is actually interesting for once which compensates for the fact that that is what they constantly wear (which unfortunately alludes to 90% of anime). The setting gives off a medieval vibe which suits the story well. All of the battles are well animated and feel intense - a 10/10 for art.\\n\\n\r\nSound:\\n\r\nThe soundtrack for Seirei Tsukai no Blade Dance is spot-on and fits the medieval setting perfectly. If the music is not stuck in your head, then at least it enhances your experience of every scene. The ED is undeniably catchy as well and not once have I skipped past it. On the other hand, the OP falls short and makes the show feel like low budget trash before it's even started. 9/10 for sound.\\n\\n\r\nCharacter:\\n\r\nFor a series that does declare itself a harem, you would expect a bit more in the character department.\\n\r\n    Kazehaya Kamito is a strong fighter with a troubled past that we know ABSOLUTELY NOTHING ABOUT (can we at least have an OVA to explain what's up with him?). A solid personality but annoyingly helpless when faced with any awkward situation. \\n\r\n    Claire Rouge is a short-tempered tsundere who can be undeniably cute during her soft moments. You are made to feel sorry for her as society shuns her for being the sister of the notorious Calamity Queen, but the intended sense of pity doesn't really reach the viewer. Sorry, Claire.\\n\r\n    Rinslet Laurenfrost is from a family of nobles, and certainly does give off that aura. However, encounters with her are so infrequent that you either forget about her or don't care about her. Hardly worth a mention. Sorry, Rinslet.\\n\r\n    Fianna Ray Ordesia is a \"perverted princess\" and is the only character in the series who openly epresses her feelings towards Kamito, which is rather refreshing compared to all those tsunderes. Again, we are made to feel sorry for her, having been unable to become a queen. Again, I couldn't care less.\\n\r\n    Ellis Fahrengart... what a delightful character. A knight with a strong sense of justice, yet at heart she is just a normal girl and scenes with her and Kamito are heartwarming.\\n\r\n    Est. Every time she says \"Praise me more\"; every time she gets patted on the head and says \"That feels good\"; every time she says \"I want parfait\"; every time Kamito wakes up to find her in his bed; every time words leave her lips as a soft monotonous lullaby... I feel at peace.\\n\\n\r\nAs for the interaction between the characters, real feelings are seldom shown (the exception being Fianna, but this is presented in a comedic way). The the pairing with the most romantic value is without a doubt Kamito and Ellis: you will enjoy the bond that develops between these two. 7/10 for character.\\n\\n\r\nConclusion:\\n\r\nWhile Blade Dance is by no means a technical masterpiece worthy of a 10/10, it is one of my favourite anime that I have had the delight to watch. Why? The fights are intense, the romance is sweet and fun to watch, Est is a bundle of joy, and all the way through the art and music are beautiful and a real treat for the senses. It alternates between plot and romance perfectly, not allowing either to drag on for too long and provides the right kind of entertainment at the right time. 10/10 for enjoyment and a 8/10 overall. I would recommend this anime to anyone.\\n",
            "date": "2015-12-27T19:29:00+00:00",
            "helpful_count": 4,
            "mal_id": 207042,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4946973.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Appilesh",
                "username": "Appilesh"
            },
            "url": "https://myanimelist.net/reviews.php?id=207042"
        },
        {
            "content": "Seireri Tsukai no Blade Dance (Bladedance of Elementalers) is about females born of noble families that go to a school to become elementalers that form contracts with different kinds of spirits. Only females have really been known to do this and it changes things up for them when Kamito Kazehaya, a male elementaler, start going to the school. Kamito first meets Claire Rouge, who is attempting to form a contract with a powerful spirit. Kamito controls the spirit in order to save Claire's life and she forces him to become her slave for \"stealing\" her spirit.\r\nRight from the beginning, the story is incredibly confusing, Ihad no idea what was really going on until the 3rd of 4th episode. Like I said before, only females are known to attend this school, so the entire series is about Kamito Kazehaya surrounded by loli looking girls. There are a total of 2 guys that appear throughout this anime, one of them being Kamito. The rest of girls. Needless to say, it is a Harem anime. Aside from the story being confusing right from the beginning, I can't knock it entirely because it is a Fantasy anime and there's a lot of plot points that the viewer needs to understand. I can say thought that the anime does get better as you watch it and start understanding what's going on. I didn't start enjoying it until about halfway through. \\n\\n\r\nAll this anime is about is these students learn to control and make contract with spirits in order to use them in fights against other students in duels. They fight to earn their spot in a prestigious tournament called a Blade Dance, with the winner granted any wish they desire (I think?). The story is rather vague as a whole and leads me to believe the Manga is infinitely better than the Anime. I was left with a lot of questions at the end. There was a lot left to show by the end of the anime but to me it seems this anime wasn't popular enough to get a sequel season or that maybe it's just not a priority.\\n\\n\r\nThere wasn't anything particularly special about the characters. They all seemed pretty generic and cliche. None of them were by any means bad but I feel like I've seen these exact same characters in other anime. The art was bright and fine, pretty much just your average anime girls running around using spirits to do their bidding. Although the spirits weren't exactly exciting to see, there was a lot of variety in each girls spirit, which is nice to see. The one other guy besides Kamito in particular is actually pretty cool to see.\\n\\n\r\nAll and all, there wasn't anything special about this anime, it wasn't bad but it wasn't really good either, it was pretty average and fine. There are better anime to watch out there but if this one catches your eye, don't turn away from it. Judge it for yourself but I do believe the Manga would be better.\\n\\n\r\nLikes:\\n\r\n-All of the girls at the school call Kamito a \"Lewd Beast\" and \"Demon Lord of the Bedroom\" and it's hilarious because he's literally done nothing and always been in the wrong place at the wrong time.\\n\r\n-The spirits aren't really exciting but it's still cool to see. Also, Est gets a human form, is it because she's overpowered or can other spirits look human too?\\n\\n\r\nDislikes:\\n\r\n-So many cliches, it's hard to handle\\n\r\n-SPOILERS\\n\r\nThey beat Jio midway through the season and then he just disappears, they didn't kill him or anything (as far as I know), what happened to him?",
            "date": "2016-10-01T10:38:00+00:00",
            "helpful_count": 3,
            "mal_id": 230794,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5586150.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Drevorn",
                "username": "Drevorn"
            },
            "url": "https://myanimelist.net/reviews.php?id=230794"
        }
    ],
    [
        {
            "content": "Already imagine how this anime turns into? Well if you guess it will be a harem, yeah it is, with lolis and kawaii characters everywhere.\r\nBut don't worry for the ecchi-ness contents, it isn't too much and this anime is not a waste for your time.\r\n    The story centers around Kazehaya Kamito--the hero-who is the candidate of The Demon Lord in a world where spirit can only controlled by pure maidens. Those maidens are studying at Areishia Spirit Academy which purpose is to educate them to be an Elementalist. The storyline is quite difficult to resume and if I try to resume it,I'm afraid that it'll be just a spoiler for those who haven't watched it yet. So this far my brief explanation for the story.\\n\\n\r\n    Next, I will start to give my interpretation. According to somewhat complicated storyline, the anime doesn't rush its story. It goes gently so we won't get upset for the first time. It brings cute dokidoki battle feeling. By those words, I mean, since the characters are all girls except the hero, we can get attracted by female elementalists who specialist and elements are vary.\\n\\n\r\n    The colouring for this series is not too eyesore eventho' it's using bright colours--well it's fantasy surely. The detailed movements are showing us how the battle goes. The characters aren't so new, there are lolis, aggresive, tsundere, and ojou-sama type. Still it's fun how each characters got their portion fairly, and damn fit the seiyuus voice w/ the personality of those maidens.\\n\\n\r\n    For the themes, I both like it but my favorite is no doubt the opening theme. Sang by Hitomi Harada, the title is Kyoumei no True Force. Energetic and fascinating. For the ending theme, in my point of view, the genre is quite cute, I rarely attached to those genre.\\n\\n\\n\r\nGood work, 8 rate! <3\\n\r\nPros:\\n\r\nStoryline and how it goes\\n\r\nNice artwork\\n\r\nEnergetic OP theme and unique ED theme\\n\\n\r\nCons:\\n\r\nQuite bright colours\\n\r\nCommon characters personality",
            "date": "2016-07-23T23:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 224814,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4796434.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yuu_Masuhara",
                "username": "Yuu_Masuhara"
            },
            "url": "https://myanimelist.net/reviews.php?id=224814"
        },
        {
            "content": "I just started in MAL in the end month of 2014 so I am not yet literally adept in making sensible or top notch reviews yet but I will continue to write anime review as much as possible. I have watched more than 200+ anime series over the pass decade so I want to speak up what I can say about anime series, movies, ova and special up to date.\r\nAnime Series Review No.2\r\nThis is going to be my 2nd anime series review since my first review is the anime series black bullet which is good anime but not worth to mention or a recommendation. SeireiTsukai No Blade Dance a anime series adapted from a light novel series which it's plot revolved around the quest of the main male protagonist in achieving his goal in the tournament called \"Blade Dance\" where he wants his own wish to be granted.\\n\\n\r\nThe anime series is a typical stereotype of harem, magic, action and fantasy series which give me a expectation of massive fan service and moe girl characters hooking in the single male protagonist. As expected the series did do that making me suffer in the first episodes but as the story progress from episode 8 I actually enjoyed the series plot even it is a harem which I rate 4 while the art blends well in the theme I give it a 4. Sound nothing worth to start a beat but still the music blends also with the series theme so I give a 3. Characters are generic for if you watch a harem series a lot the girls personality will be almost the same but still I enjoyed Fianna debut and ellis character development and claire is becoming less annoying which I give 3. Enjoyment well I like a few character trait and I got interested with the plot story line so my level of enjoyment is 4/10 and as a result the overall feedback I give this anime is 4/10. I only like 40% of the entire material concept the rest of the 60% is idiotically senseless and annoying.",
            "date": "2015-06-22T23:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 190976,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4310383.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 3,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ezekiel_01",
                "username": "Ezekiel_01"
            },
            "url": "https://myanimelist.net/reviews.php?id=190976"
        },
        {
            "content": "Blade dance is an underrated harem that has its faults but counters by overcoming common issues within its genre. I have watched a plethora of harem anime and the bad ones usually have poor pacing as well as a lack of character progression. The question every director of a harem series has to determine is how do you balance the amount of fanservice and harem humour with actual plot progression. I have seen a number of other harem anime where a whole episode is spent on harem cliches. For example an entire episode could be spent randomly going to a beachwhile the world is falling apart. However in Blade Dance the director smartly puts the focus on the plot when needed. Each episode has a healthy dose of fanservice and plot progression to a point where I didn’t feel dissatisfied with either. I would say Blade Dance is about average when it comes to fan service. This is surprising considering the fact that the director Tetsuya Yanagisawa is also the director of Highschool DxD which is the epitome of excessive fan service. The fan service is not too extreme where it feels out of place. The only exception is after an intense battle where the protagonist becomes unconscious, wakes up and usually finds a girl in his bed. That happens a lot, but oddly it acted as a breather for the audience after intense action so in retrospect it does seem to have worked. And if you have to put it somewhere, it’s a smart place to put it. \\n\\n\r\n    The characters on the show can be hit or miss, both in the characters themselves and how a viewer perceives a character. If you look at popular tv shows with many seasons like the Walking Dead there are well developed characters who grow. In a harem show it is near impossible to provide adequate character progression to all the girls as well as the protagonist while balancing plot progression and harem fanservice in only 12 episodes. Therefore sacrifices have to be made. Most of the shows character growth comes from the female lead Claire as well as the male protagonist Kamito. This makes sense because they are the first characters introduced in the show while the other girls are introduced later. The sacrifice is that while the other girls in the harem are developed in term of breast size, they are not as lucky in terms of character growth. This is fine but it bothers me when one girl in the harem, Rinslet,  inexplicably is not there and randomly shows up when it is convenient. We learn nothing about her, even her personality is very similar to another girl in the harem which makes her entirely forgettable.\\n\\n\r\n    I would say the protagonist is above average. He is clueless like every other harem lead, but he is not a wimp and is competent even though he is emotionally scarred. He is still an enigma both to himself and to the audience, we don’t know what exactly happened to him. However it doesn’t matter because we see his faults and insecurities and can see his growth. The real x factor is the female lead Claire Rouge. Either you love her or you hate her. For a while I hated her, she was whiney and possessive, her traits made her cute at times but at other times she was annoying. However by the end of the show her character changes completely. Personally I believe that actions and decisions make a person. At one point I was thinking, “Here we go again…” but surprisingly Claire makes the right decision and changes completely. Whether this change was rightly deserved is up to the viewer, but I thought this change was refreshing. Looking back her character was a foil to the other characters on the show and even helped to galvanize their own character growth. She literally talked some sense into another character a number of times. Both Claire and Kamito are similar in that they both felt alone, the person they loved abandoned them, but the two learn to lean on each other and others for help which I thought was a well executed theme.\\n\\n\r\n    The show does have its faults. There are times when things just do not make logical sense or when a character seems to contradict themselves. They often seem to break the rules of the world it set up. The art and sound is average for a harem anime. The opening and ending became catchy over time but they are standard jpop tunes and are not exceptional. If this was a stand alone series I think some characters like Rinslet shouldn’t have existed. It felt like she was there simply because they needed a blonde girl in the harem. However this is based on a light novel so I think she had to be there for the sake of the franchise. Considering this fact, the ending while predictable was very satisfying. There are still more questions, the blade dance (battle) between different schools has yet to happen. Will the other girls in the harem figure out the MC’s former identity? What is this demon lord business? What happened 3 years ago to the protagonist and his partnered contract? The show exemplifies a director making the most of what he could in the 12 episodes he was given. I don’t blame him for not trying to fit everything in because it would feel rushed. It is satisfying because the central themes introduced at the start were brought full circle and resolved with characters who smartened up. It felt like the first book of a book series like Harry Potter, even though there is more plot to discover it ended on good note which made logical sense. It is unlikely a sequel will come to fruition but if it did I would want to watch it because I want to know what happens next. If you decide to watch this series you will be surprised by how fast the episodes fly by and how invested you become to the story and characters. \\n\\n\r\nStory: 8.25/10\\n\\n\r\nArt/Animation: 6/10\\n\\n\r\nSound: 6/10\\n\\n\r\nCharacter: 7/10\\n\\n\r\nExecution: 9/10\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nOverall: 7.5/10\\n",
            "date": "2016-04-22T17:58:00+00:00",
            "helpful_count": 3,
            "mal_id": 216906,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1034831.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seal308",
                "username": "seal308"
            },
            "url": "https://myanimelist.net/reviews.php?id=216906"
        },
        {
            "content": "Light novel adaptions are a weird thing. Sometimes they’re incredibly rushed by trying to put so much information into so little time. Sometimes they're incredibly slow and take their time, doing absolutely nothing interesting in their time span. I came into Seirei Tsukai no Blade Dance knowing this, without having any high expectations for the show. Did my moderate expectations bring disappointment? No, not quite, but Seirei Tsukai no Blade Dance certainly didn’t completely live up to them.  \r\nBlade Dance takes place in a world where humans can become spirit contractors that use “spirits” for things such as battling. However, only young girls canbecome spirit contractors. As such, an academy exists for these young, special ojousamas to train and sharpen their abilities as a spirit contractor. One day, our typical male protagonist, Kamito, meets with a naked young girl who he assumes is a loli at first, but is later shocked to find out that she’s 16. This naked young girl proudly declares herself as Claire Rouge and states that she’s looking around to find a stronger spirit to form a contract with. Kamito decides to follow along with Claire, but “accidentally” forms a contract with her intended spirit instead. Kamito must now attend the all girls academy with his supposed new attribute of being the only male spirit contractor in a while. \\n\\n\r\nSo basically your typical setup for a harem anime.\\n\\n\r\nBut is this necessarily bad?  No, not always. In the case of Blade Dance, however, it never really makes a stance of itself. Blade Dance never evolves as something more than average, but it never deteriorates itself into something remarkably offensive, or into something that’s bottom of the barrel. \\n\\n\r\nBlade Dance has something going for it, and that’s it’s world-building, but it never managed to catch my complete interest. Blade Dance throws around some past events. which most characters seem to be connected to, and various concepts of the act of being a spirit contractor as well as some shady antagonists who do seem to have an end goal and motivation, but that’s all it does. It just throws them around, it never really expands on any of this, essentially serving the purpose of just filling up some empty space that might be in the world-building.  Which is a shame, since if expanded upon and executed wisely, it would have been a pretty good anime. \\n\\n\r\nInstead of ever elaborating on some plot points, Blade Dance instead primarily focuses characterization of its main character, several harem members, and a few minor characters who play some roles behind the scenes, and to be honest, it actually does a pretty decent job. Most notably, Claire Rouge, the main girl of the anime, starts off as a typical tsundere archetype only for the anime to later delve deeper into her character, showing her motivations and thought process, and finally develops her into a decent character who actually learns from her mistakes. Kamito, the main protagonist, doesn’t really change much during the duration of episode 1 to 12, but we do learn that this man has some regrets in his life that he definitely wants to either forget or fix. Other characters start similarly as archetypes like Claire and change a little to stand out more than tsundere #142, and others simply stay as archetypes and nothing more.\\n\\n\r\nThis isn’t to say Blade Dance doesn’t have one big narrative because it does. And it goes back to the world-building. Our main character wants a wish granted for whatever reason, whether it’s to fix something in the past or gain some new desires. To get this wish granted, he must participate in a tournament known as the “Blade Dance” (hence the title of the anime) \\n\\n\r\nThe Blade Dance itself, however, doesn’t really ever become relevant until the near end of the anime.The entire anime itself feels like an entire set up for the rest of the story, even ending a rather large opening ending that feels like the beginning of something greater. The 12 episodes of Blade Dance are, essentially, a blueprint for the rest of the events that lead up after the anime, basically screaming out “Want to join these characters’ adventures more? Buy the light novels now!” \\n\\n\r\nSo, does Seirei Tsukai no Blade Dance work as an advertisement for the light novels? It does a rather decent job, I’d say.",
            "date": "2016-02-29T15:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 211975,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4332589.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Todokete",
                "username": "Todokete"
            },
            "url": "https://myanimelist.net/reviews.php?id=211975"
        },
        {
            "content": "This anime is undoubtedly an enjoyable experience. The story itself is fairly interesting. It follows Kamito and the girls whom he befriends at the academy he is whisked to. The characters are lovable, and each has their own backstory, filled with rich events and overflowing with mystery, captivating the interest of the audience. The only flaws in this anime would be the producers and the excess of fa nservice. As far as pacing goes, it seems to be flowing nicely along, up until the last few episodes. The last episodes feel rushed, and parts of the original manga is left out. The fan serviceseems to be forced, strained. Aside from this, the overall anime is entertaining, the art is pleasing, and the music is fitting.",
            "date": "2014-12-06T16:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 171263,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4245477.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kaou",
                "username": "Kaou"
            },
            "url": "https://myanimelist.net/reviews.php?id=171263"
        },
        {
            "content": "After watching the whole series, I can tell that the show is not really worth your time. \r\nFilled with lots of fanservice (which is expected from a harem anime like this one), the show is visually appealing. The opening is really generic and overall there's nothing from the OST that especially stands out. \r\nIt all ends right before the story gets started, and as such any of the questions the anime presents to us are answered. \r\nThis anime is way too generic - it is in the fight for being the utmost bland production of the past summer. Besides the art, the characters are stereotypical,the story is rough. \\n\r\nI cannot suggest this anime to anyone, the whole thing is just a huge cock tease. This is not the best choice, even if all you want is a mindless harem anime",
            "date": "2015-06-24T02:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 191111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4631492.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/sykhro",
                "username": "sykhro"
            },
            "url": "https://myanimelist.net/reviews.php?id=191111"
        },
        {
            "content": "Seirei tsukai no blade dance ... I could\r\n describe it quite and in many ways\r\nLeaving aside that the first anime ecchi that I had seen six years ago was Strike the blood, when I did not even know it was an anime, it would be the first one. I've seen thousands of Previews of anime ecchi, and they all seemed more and more of the same, with a theme that what gives more importance is the ecchi (Well, I'm not saying that this is at all an exception, with a boy in a girls academy etc etc, but I see it better ... Yes) Examples: Highschool DxD, Mahou no testament or as you say (No offense to the fans). I really liked it a lot and I say it for many things, the protagonist is not completely a pervert (If things happen to him like that Est is put naked in his bed or things like that, but Kamito is not seen doing perverted things or even an insentient The best? Kamito is not a character \"Princes\", is one of the best characterized male characters (Like a Kazuma of Kono subrashii shinkufuku wo)\\n\r\nArt:10/10 The design of the characters is varied but very nice, I liked the truth\\n\\n\r\nHistory: 9/10 The story is not just about a tournament, although it is what it shows in the anime, but it's just a matter of the two or three that there are, leaving aside the ecchi scenes, (Let's go, it's not so much) it's pretty good\\n\\n\r\nCharacters: 10/10 Kamito could be my favorite anime character, Claire is pretty well characterized, Rinslet is pretty good, not to mention Restia,(Terminus Est causes me grace)\\n\\n\r\nSound: 10/10 Most of the music combined with the anime, quite good, the Opening, the battle ost, both were my favorites (Go the battle ost is one of my favorite ost animes), the ending it's not bad at all\\n\\n\r\nEnjoy: 10/10 The truth made me laugh a lot, the characters interact well, it will have its moments ecchi (Although I would take it Soft-ecchi thanks to Kamito) I really do not have much to complain about is an anime that has everything of an anime common, and with its fan service classics\\n\\n\r\nOverall: Well, if you are the person who is used to not see fan service ecchi, or just fan service and you like to watch 85% of the romance anime with princess protagonists then you will not like it. If you are able to support everything and see it it is super recommended, I would read it and see it until the end and I may do it many times, a very well deserved 10/10\\n",
            "date": "2017-11-18T20:15:00+00:00",
            "helpful_count": 1,
            "mal_id": 263515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6396090.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Hiroshi_Saito",
                "username": "Hiroshi_Saito"
            },
            "url": "https://myanimelist.net/reviews.php?id=263515"
        },
        {
            "content": "Unlike most reviewers, I'll put the \"overall\" of my review first so those who don't wanna scroll for very long can read what I have to say.. This is a spoiler-free review.\r\nSummary-6\r\nThis is not a bad anime by any stretch. There is nothing truly awful about it. Its just lacking everything that makes an anime great. It lacks any dynamic story elements or characters, and just falls into enjoyable mediocrity. Basically, its better than your average school fan-service harem anime, and the fight scenes are actually pretty good, but it is still very lacking. Remember, 5 is the \"average\" score, so a 6 is stillokay. Now, on to the more detailed portions of the review!\\n\\n\r\nStory-7\\n\r\nThis setting is pretty common in anime. Put simply, its a magical academy. The students here can tame elemental spirits and use them as partners in battle. The catch is that only females are known to be able to use these spirits. That's where the HAREM tag falls into place. Our main character is a male who can use a spirit elemental, therefore is inducted into our academy of only female spirit users.. While the story does follow the typical, \"boy surrounded by girls and misunderstandings ensue\" format, there are a few interesting elements that I don't want to spoil here. The problem is that those interesting elements are never expounded upon, and it ends up just being good instead of great. 7 of 10\\n\\n\r\nArt-8\\n\r\nThe art is pretty nice. Its not outstanding but it is great. the character designs are pretty good and the battle scenes are animated well. The elemental spirits also look pretty cool. The fan-service, while abundant, is still pleasing to look at. 8 of 10\\n\\n\r\nSound-6\\n\r\nThe sound is decent. The OP and ED are typical, and the rest of the OST does its job, but nothing stands out or is spectacular. 6 of 10\\n\\n\r\nCharacters-4\\n\r\nThis is the series' biggest downfall. there are MAYBE three decent characters. The rest are incredibly average harem tropes, some well below average in fact. Nobody sticks out at all. And most of all, these characters are very annoying. Most characters are very unintelligent, and are uninteresting. Its sad to see the few interesting characters overshadowed by the mass of largely boring characters.\\n\\n\r\nEnjoyment-7\\n\r\nIn spite of fairly uninteresting and annoying characters, this anime was enjoyable. It entertained me, the comedy based around fan service was pretty decent (even though I never really laughed hard), and the fighting was pretty good. while I won't remember this anime for very long, it was a decent distraction from the heavier stuff I usually watch. I'd recommend it to people who like typical harems, but don't expect this anime to blow you away.",
            "date": "2016-05-17T00:42:00+00:00",
            "helpful_count": 2,
            "mal_id": 218740,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5012772.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/KokoSugu",
                "username": "KokoSugu"
            },
            "url": "https://myanimelist.net/reviews.php?id=218740"
        },
        {
            "content": "Seireitsukai no Blade Dance (I'll refer to it as Blade Dance from now), is one of those few harem anime that have more rights than wrongs. It has a somewhat great MC, good supporting characters and a great plot holding it up together.\r\nStory: 8/10\r\nA strong and inviting Isekai story for a harem? It'll definitely get a 6 right? No. Blade Dance is an exception to that case. It's story is such that every part of the current situation has something to do with the past, a feature most Isekai anime have problems crossing over. The story takes it's time to get it's gears going (ataround half the point) but it doesn't disappoint. The first part could be regarded fanservice while the second is the actual story. And so both sides are equally good. It allows the viewers to slowly understand the story too, so the presentation is excellent.\\n\\n\r\nArt: 7/10\\n\\n\r\nThe art is great. I especially love the way the hair is colored for most characters, namely Ren and Ellis. Their hair looks so great thanks to the art style! Character design is great although not too detailed (which for me is a bit of a problem) but otherwise fine.\\n\\n\r\nSound: 6/10\\n\\n\r\nPretty forgettable. The OP/ED were massive disappointments. The horrible English mixed with a forgettable tune in both made it so horrible. Certainly not my favorite. The characters sounded pretty generic too (except maybe for Ren and Ellis). The sound aspect was a place the anime certainly didn't succeed in winning me over, which is quite strange because in almost every other anime I've reviewed the sound section always did great, but there's a first for everything...\\n\\n\r\nCharacter: 7/10\\n\\n\r\nCharacter development was okay. Albeit slow at first, it caught up later on and was pretty fun to watch too. I cried tears of joy that the MC wasn't the wimp we see nowadays in Harem anime. Although I was disappointed in our second main character (Rouge) another character more than made up for it (Ellis)\\n\\n\r\nRen/Kamito: Our MC, he was previously known as the legendary Ren Ashbell (not a spoiler as you'll know that right off the bat) but is now known as Kamito. Thankfully he isn't a wimp or one of those characters who get beaten up by the women every single time (it's scaled down, but still present). His development was really good even from my expectations (which were low as it was a harem).\\n\\n\r\nClaire Rouge: Another harem, another Tsundere disappointment. Claire Rouge is how NOT to make a Tsundere appealing. It's agreeable that there is no certain amount of 'tsun' or 'dere' but she had more tsun than dere and it felt like she just wanted to be called his master. And to make matters worse the way she behaves is also a major irritating factor which lead me (a person who likes the Tsundere archetype) hate her throughout the course of the anime. I don't even understand WHY she liked Kamito. Needless to say, she would have certainly been the anime down if not for another girl who saved the day.\\n\\n\r\nEllis Fahrengart: The girl who sould have been the MC (in my opinion), she has sensible reasons to like Kamito and her personality had MC written all over it. She developed far more than resident Tsundere Rouge and also improved my view of the anime in doing so. I liked her kind loyal personality a lot and although her tsun side was small, it was worthwhile.\\n\\n\r\nEnjoyment: 8/10\\n\\n\r\nBlade dance was fun. I enjoyed watching it and despite the fact the comedy was lame and had the image of a stale piece of bread, the story and romance (?) made up for it. It was great watching Blade Dance as it successfully exceeded my expectations and was overall a worthwhile experience.\\n\\n\r\nOverall: 7/10\\n\\n\r\nI was confused with whether to give it a 7 or an 8 and left to the mean value to decide and so it is a 7. The reason being is it felt like a 7.5 but that doesn't exist and so the above story happened. Blade Dance is an anime that you'd rather watch when you have nothing better to watch and if you wanna kill time. I don't think you'd have too much fun watching this if you're not a big Harem fan but to all harem fans and newbies to the genre Blade Dance is an excellent place to start watching harems from. A recommendable starter harem anime for all those interested to dip in to the genre!\\n\\n\r\nP.S: It was quite the battle for me to decide who's the best girl between Fianna and Ellis (the only great girls in the anime) and I've decided: Ellis is best girl <3",
            "date": "2017-09-05T07:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 256956,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5694873.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yasaal",
                "username": "Yasaal"
            },
            "url": "https://myanimelist.net/reviews.php?id=256956"
        },
        {
            "content": "There's really nothing special about the plot because I have seen plenty of other anime with the same genre as this and there are very similar elements too. The character development is very nice and also the main character is typically dense. The setting is something like Infinite Stratos and Saijaku Muhai no Bahamut wherein the main character is the only male student in the whole campus and that leads to the whole other cliche \"incidents\" that happen in this type of genre. I hope there will be a sequel because there are a lot of unexplained backgrounds of some characters.",
            "date": "2017-09-03T01:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 256788,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6176574.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Midget_King",
                "username": "Midget_King"
            },
            "url": "https://myanimelist.net/reviews.php?id=256788"
        },
        {
            "content": "tl; dr\r\nThis is my very first anime review so  it might not be good for other people to read, in that case, you have my apology. This review is based only on the anime since I haven't read the light novel. As a result, I will not discuss any point regarding the completeness as well as consistency between different media.\r\nStory: 6/10\r\nAt first glance, the story development is no different than other anime from the same genre. You have a bunch of elementalers (some sorts of wizards, witch but with fighting skills like swords, spear, bows, you name it) attending a magic academy and aimingto win a tournament for certain goal (since I dont want to spoil anything, I will not say the detail specificly) While that is not anything bad, the anime itself has little to offer in terms of its own characteristic. The setting can be found in various anime. Part of the reason is the first season didn't explain well the idea, story behind the MC. Yes the motives of the anime is justifiable but anyone who watch can agree that it is there not be be questioned, because there is little to non original idea or development relating to the \"goal\" of the MC (it is simply there, it is not like you have different plots with overcoming one opening the others). Overall, I feel dissatisfied  in the way the story developed. That being said, the anime still offer a solid \"average\" story to consider acceptable.\\n\\n\r\nArt: 8/10\\n\\n\r\nFirst of all, it is an ecchi genre, so you got what I want to tell. The fanservice is there for good reason even though it might not have anything to do with the story. Besides that, in my opinion, the art has been executed well. Not the best, scintillating anime I have ever seen, but definitely not any where considered bad. the color is bright, the scenery is very good. Not only does it suit the anime theme and story but the details are pretty great as well. For example the food, the weapons, the blushes, the ecchi scenes.  Since I am not any art expert, that is all I can tell.\\n\\n\r\nSound: 6/10\\n\\n\r\nmusic, soundtrack ratings are purely personal opinions. That being said, you know they are good when you experience your mood change. For this anime, I can only say that the music did its job just fine with no annoyance. But there is hardly any scene I feel compassionate with the overall scene+music effect. As a result, I can only give 6/10.\\n\\n\r\nCharacter: 3/10\\n\\n\r\nThis is where the anime fails to deliver the most. I would never say tsundere is a bad type, in fact, I am a tsundere fan. However, 3 tsundere girls are too much. Did I enjoy those tsundere? Yes, I did. But it doesn't mean we need 3 of them to make the anime good. I feel there exists lack of variation in characteristics. It makes all the awkward situations feel the same. Moreover, we understand little to nothing the reason why those characters act like that, interestingly with an admittedly not bad back story of each one of them, I expect more \"personality\" from each character than it is shown. That is to say nothing of the character development. \\n\\n\r\nEnjoyment: 7/10\\n\\n\r\nI give it 7/10 even with the previous criticism simply because I enjoy this genre. Rom-com ecchi mixing with action, and supernatural is what I am looking for (didn't I say I am a tsundere fan already) At the very least, the anime is among the average of what the genre can offer.\\n\\n\r\nOverall: 6/10",
            "date": "2018-02-23T08:15:00+00:00",
            "helpful_count": 0,
            "mal_id": 272242,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6993875.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DinoSon",
                "username": "DinoSon"
            },
            "url": "https://myanimelist.net/reviews.php?id=272242"
        }
    ]
]