[
    [
        {
            "content": "Comforting lies or a bitter truth. Which is better?\r\nThe above dichotomy is perhaps one of the most enduring through all of fiction. Many stories that tackle it end up siding with the truth, only to end up cushioning the blow through all sorts of contrivances; making the bitterness of the truth not as bad as initially thought. \r\nEnter UN-GO: an 11-episode anime series by Studio BONES which tackles this theme by pouring it in the format of a buddy-detective show, following cynical detective Shinjuurou Yuuki and his quirky assistant Inga as they tackle cases in a Japan that's recovering in the aftermath of a devastatingwar. The end result is something that thematically feels less like the typical mystery anime and more like a sci-fi spin on the British crime-drama Foyle's War. \\n\\n\r\nLet's get one thing clear: UN-GO isn't very good when taken as a pure detective story. Most of the cases involve genre staples such as blackmail or crimes of passion. Worse yet is that it seldom feels like the main characters are running an investigation. Whenever a crime occurs, the main duo briefly scans the scene and talks with (read: introduces) the people involved, this is followed  by some brief speculating after which Shinjuurou will deduce the big picture, only to have Inga swoop in with a magical power that literally forces people to spill the beans. And seeing as the majority of the cases last only one episode, it all ends up feeling very rushed. By rights, UN-GO should be a complete disaster, yet it ends up worthwhile by being a show about detectives solving mysteries that isn't really about the mysteries.\\n\\n\r\nThis is where the contrast between sweet lies and bitter truth comes into play.\\n\\n\r\nThe story, as previously mentioned, takes place in a Japan that's licking its wounds in the aftermath of a war. The government has restricted people's freedoms and control the flow of information as much as possible.  In-story avatar of these policies is Rinroku Kaishou, the chairman of the company that holds the monopoly on Tokyo's communication infrastructure. A charismatic, intelligent man who uses the system to his advantage. This in stark contrast to our hero Shinjuurou, a self-proclaimed seeker of truth whose insistence on uncovering shady practices earns him the hatred of officials and the people alike.\\n\\n\r\nThe contrast between these two is the thematic driving point of UN-GO as well as one of its greatest strengths. What seems like a derivative tale of the well-respected villain vs a misunderstood hero becomes a n of how people will shape events in ways that best suits them. Terrorism, blind patriotism and greed are among the themes that come by throughout the episodes, and the show consistently surprises in how it ties them into its truth-vs-lies dichotomy. Interesting to note is that the show doesn't really pick a side between Shinjuurou and Rinroku. While the former's desire to uncover the truth is presented as an admirable quality, his complete lack of tact and almost suffocating cynicism are presented not as harmless quirks but as defense mechanisms born out of desperation. Rinroku's shady practices are in no way glossed over, but the narrative also makes it clear that he views himself as a lesser evil rather than a greater good. \\n\\n\r\nIt's a shame then, that other characters don't fare as well. Recurring and one-shot characters alike usually fall into easily recognizable archetypes who play their roles as puppets of the plot competently. Standard detective fiction fare. A bigger shame is that the dynamic between Shinjuurou and Inga isn't fleshed out. It would've been interesting to see the more sinister undertones in their relationship elaborated upon, particularly the part where Inga feeds on truths as a substitute for souls. The dynamic as it is feels interesting if underdeveloped. Though it doesn't hurt the story proper in any significant manner.\\n\\n\r\nThe visuals are what you'd expect of a competently produced TV-anime. The animation is nothing remarkable across the board, though key scenes are brilliantly animated. The music is nothing memorable in and of itself but always does an excellent job enhancing the mood of scenes. On the voice-acting side of things some praise is in order for Aki Toyosaki, who showcases surprising range in her role as the quirky yet mysterious Inga. Director  Seiji Mizishima (Fullmetal Alchemist '03, Dai-Guard) once again proves himself to be highly capable,  turning several aspects – many of which vary in quality and aren't always compatible - into a compelling whole. And it would be no exaggeration to say that UN-GO might not have turned out so well had someone else been at the helm.\\n\\n\r\nUltimately, UN-GO is the best kind of bait-and-switch, providing the tale of a man seeking truth in a sea of deceit, under the guise of a detective story. Anyone intrigued by the premise and willing to be surprised would do well to give it a look.",
            "date": "2011-12-24T04:03:00+00:00",
            "helpful_count": 133,
            "mal_id": 49993,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/141673.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Uriel1988",
                "username": "Uriel1988"
            },
            "url": "https://myanimelist.net/reviews.php?id=49993"
        },
        {
            "content": "=updated after episode 11=\r\nIf you were to ask me what I though about Un-Go after watching the first few episodes I probably would've said \"boring, horrible character development, terrible pacing and lack of a plot. If you were to ask me now after seeing all the episodes I would say \"brilliant, unique storytelling and interesting characters\".\r\nUn-Go starts off from the generic 'future Japan' setting, using guess work you try to make sense of the plot and characters which is difficult and leaves you feeling like it's taking off from a prequel series. Though the backstory shines through little by little each episode and you canpiece it together (which fits into the detective mystery genre nicely).\\n\\n\r\nThe main issue i had with the early episodes of Un-Go was pacing. It felt as if they were cramming in two-parters into one episode which left a long path of plot holes along the way. At the end of the episode, you'd be thinking \"what just happened\" \"is that the ending?\" \"Why don't I just drop this crap\" but thankfully this issue is resolved later on.        \\n\\n\r\nI first thought the characters were really boring and bland, probably because the character development was nearly non-existent among the confusing plots and side characters in the first few episodes. Though you soon get attached to them, well most of them anyway.\\n\\n\r\nThe art style is interesting and the character designs aren't too bad, though I really hated the design for 'that woman' (call her this to avoid spoilers). She looked like some out of proportion alien thing.\\n\\n\r\nI liked the OP and the ED wasn't that bad. The voice acting is average.\\n\\n\r\nOverall, Un-Go has it's flaws through features the 'detective/mystery' genre at it's best. It starts off as a terrible anime, filled with poor character development, plot holes and pacing issues though finishes off with a nicely polished interesting series which leaves you wanting more.",
            "date": "2011-12-02T04:33:00+00:00",
            "helpful_count": 68,
            "mal_id": 48449,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/470868.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Miharu-Kun",
                "username": "Miharu-Kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=48449"
        },
        {
            "content": "Story - Poor. Normally I watch a mystery anime for two things. A sense of resolution, or the satisfaction of a mystery solved. Even the most amateur mystery story can be enjoyable once the tricks are revealed. \r\nBut Un-go is different. None of the stories have a decent resolution, because while the mysteries are always solved, they were always covered up. Which defeats the purpose of mystery genre completely. The true genre of Un-Go is waste of time. Because that is what the characters are doing. Searching for truth, but have no real interest in revealing the truth. Hence wasting time. \r\nFurthermore, the plot isweak. In the first story, the victim was killed so that he died a hero, while he really was not. But after the killer was found, it was announced that he was a hero anyway to protect his name. There was no point in killing him in the first place. In the second story, the victim was killed because her daughter wanted to be a singer and the victim did not permit her. But the daughter was unable to become a singer anyway because of some random conspiracy by the government against idol bands. Which she was never a part of. So she killed her mother for no reason. In the third story, \"omg, the only other person in the room is not the killer, its a curse.\" How stupid is that? And when the story goes on, it is revealed the victim was killed because he was a spy and broke into the house. But of course the killer was guilty of... self defense and was arrested anyway. And for a crime they did not have proof of. Aside from the detective saying \"he did it.\" \\n\\n\r\nFor the three stories shown so far, not a single character has become better off. Not the victim, not the killer, not the victim's family, nor the killer's family. All three crimes can be described as unnecessary. The fact that the crime was done has in no way changed the lives of any of the characters. I'm not even sure if the first 2 killers were arrested because the police told them that the crime is going to be attributed to an innocent scapegoat, for the reason that... no reason. And the 3rd killer was arrested, even when no real proof was linked to him. No, circumstantial evidence, even when strong, is not the same thing. There is NO link at all. \\n\\n\r\nAside from these, there is no satisfaction in watching the mystery being solved... because OMG OMG there is MAGIC in a futuristic, scientific, post apocalyptic world. But the catch is, only the main character has access to it. And no one even notices it, and just accepts the sudden random confessions. And ignores the random \"I want to eat him/eat his soul\" comments. There is nothing to make you think, \"oh so that's why the main character caught the culprit,\" or \"oh so that's why he's even suspected in the first place.\" Although it's not hard to point the real killer within 5 minutes of the show for the first 2 stories, because they're both cliched. \\n\\n\r\nThe police are bumbling idiots, and the only other detective aside from the main character is a meddling civilian, whom, when the police ask \"how can we identify the corpse,\" answers \"do a DNA test.\" Duh. \\n\\n\r\nCharacters - Shit. Main character is an expressionless background character. And his most memorable line is \"there is no use in lying, no one can evade answering [my assistant because he has magic].\" Big whoop. And he doesn't seem to care one way or another about the truth which is a rather odd trait for a detective. He butts his way into a case, wastes his entire day being a background character, miraculously solves the case, and let the lie be accepted as the truth anyway. Then he closes off each case with \"people are ugly inside.\" End. \\n\\n\r\nThe other main character is an annoying brat. He does random stuff that only serves to distract you from the story. He should have been arrested 20x in 4 episodes just for tampering with evidence. And making physically impossible postures just to make the show creepier. But he changes into a woman who can force the truth out of someone. And eat souls. \\n\\n\r\nAll the other characters are just as flat. A civilian meddler who is the \"best detective,\" but he hasn't actually solved a single case. Only covered everything with his lies to protect the... Dunno what. And his daughter who's single trait is contrariness. Tell her to do something and she won't. \\n\\n\r\nAnd the police who knows the main character actually solves cases look down on him because of it. Why should we respect a detective who actually solves cases? No, we must support the meddler who covers everything up because he is more popular. Let us not make the strong-arm police/detective who think he's always right. It's so cliche. Instead, let's just make her have a serious fan-girl adoration of someone who she knows is wrong all the time. Oh, and as I mentioned earlier, how DO you identify someone? By DNA duh. \\n\\n\r\nGive me goth lolis any day. At least they actually have a personality. Even a stock character is better than a main character who is actually a background character. Even those annoying cicadas on trees they show every other episode in slice of lifes are more interesting. \\n\\n\r\nArt/Sound - Annoying. I normally don't comment on art and sound, because story/character/enjoyment are the things I find important. But the sound is ANNOYING. Whenever \"magic truth time\" starts, the background music suddenly becomes jarring. The first time, I thought my speaker broke. It's really annoying, distracting, and did I mention annoying?\\n\\n\r\nEnjoyment - Blah. I'd rather go to sleep than continue to watch this anime. \\n\\n\r\nOverall - Many words can be used to describe this anime. But the one that defines this the most is... ANNOYING. Annoying story, annoying plot, annoying characters, annoying background music. The fact that they use magic in a detective mystery is annoying. I normally watch a series even when its not that good, but I'm gonna drop this because it actually pisses me off.",
            "date": "2011-11-10T22:14:00+00:00",
            "helpful_count": 63,
            "mal_id": 47247,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/paksheet",
                "username": "paksheet"
            },
            "url": "https://myanimelist.net/reviews.php?id=47247"
        },
        {
            "content": "My expectations for this show was more-or-less like a Japanese equivalent to a BBC Miss Marple or Sherlock Holmes special. And, in a way, it is, but it's so much more than a simple adaptation. \r\nWhile UN-GO is based upon the writing of Ango Sakaguchi (hence, the title) the mysteries are carried out in a very different setting than the original stories. However, it never feels strange or forced in it's new setting of post WWIII Tokyo. \r\nIf you're expecting a supernatural horror anime, look elsewhere. The supernatural aspects of this show are kept to a bare minimum. In fact there are only two aspectsof this show which are supernatural, one being the nature of Inga, and the other is little more than a magic tool. Other than these two anomalies, Un-go has more in common with the Science Fiction genre. It has cool futuristic technology, hints of a dystopian future, and it even poses the question of how far can artificial intelligence evolve by itself and whether or not it is even right to treat them as machines at that point. \\n\\n\r\nWhat amazed me about UN-GO was just how tight the story was. Sure, it masquerades as a Perry Mason-esque mystery-of-the-week show, but when you look back you see that every episode was necessary to get from each story to the other. You learn the essentials of understanding how the world that Shinjuurou and Inga live in works and its history from each episode while still remaining entertaining.\\n\\n\r\nThe relationship of our detective duo is straight-forward, especially if you've seen Majin Tantei, yet the nuances of their relationship are very subtle and they are great foils for each other. Shinjuurou is very serious, mature and he steadfastly holds onto his beliefs and his interpretation of justice, but he is also surprisingly compassionate and does show affection for Inga in spite of what he/she is. Inga on the other hand is childish in its boy form, but in its female form she is seductive and in some ways just as serious and mature as Shinjuurou. She shows a deep respect and admiration for him, but male and female Inga both don't mind messing with him. However both of Inga's forms are very savage and determined and they don't mind hurting Shinjuurou if he is getting in the way of a potential meal. \\n\\n\r\nI can't say much about the sound design other than it's great, just great. The music is cool and some tracks are catchy and the voice actors deliver really great performances, namely Inga's voice actress, Toyosaki Aki. I have to admit I didn't expect much from her when I heard she was in K-On, but she played a very dynamic Inga. She was able to cycle from innocently childish to frightening and creepy. She also accomplished the hardest thing for a voice actor; she was able to give emotional depth subtly through her voice. \\n\\n\r\nThe animation is very smooth and rather colourful and stylish for a post-war setting, especially in the opening and ending sequences (which have awesome music by the way). My only complaint is that Shinjuurou's face in particular can look a little lazily drawn in places. I believe this is mainly due to one of the character designers', Pako's, distinctive style which is a little more suited to an otome game than it is an anime. \\n\\n\r\nUN-GO is a modest little series. It does not strive to be ground-breaking but in its own little way it challenges your viewpoints on subjects like self-sacrifice and the psychological effects of war and terrorism. This is one of the only shows I have ever seen which was able to show diversity in ideologies. But, as I said, it does not strive to be a masterpiece and thus I feel reluctant to rate it as one. Everything is very low-key and not a lot of risks were taken other than the major change in setting. But, the fact still remains that UN-GO is a great show that feels bigger than it is, and for that I cannot recommend it enough. \\n\\n\r\nBut note that if you want to truly enjoy this show you must watch UN-GO episode:0 Inga-ron either before or immediately after watching the series. Every single question you could have about UN-GO at the end of the series is answered in Inga-ron. With UN-GO and Inga-ron together the series is this neat little package which has one of the most satisfying endings of any anime series.",
            "date": "2012-06-11T00:36:00+00:00",
            "helpful_count": 53,
            "mal_id": 63145,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aria34",
                "username": "Aria34"
            },
            "url": "https://myanimelist.net/reviews.php?id=63145"
        },
        {
            "content": "Not your traditional mystery anime.\r\n[contains some generalized spoilers, suggestive humor and language]\r\nUN-GO is by no means a traditional “mystery anime”. If you view it only from that perspective, then UN-GO is relatively mediocre as a whole. What makes UN-GO a “good” anime is the hidden mystery behind all the concurrent “traditional” mysteries. \r\nNow, what exactly defines a “traditional mystery” and what sets UN-GO apart from being one? Well a traditional mystery is “best” mediocrely defined as going from the crime scene to interrogating the suspects, to finding the verdict by the end of the episode, this is best comparable to anime like Gosick. UN-GO onthe other hand incorporates a different element. It's the type of behind the scene mystery that's blatant after you learn about it, but rather difficult to discern when you're watching it initially; it's an enjoyable treat. But, it is arguable on whether or not it was actually done well.\\n\\n\r\nUnfortunately, UN-GO does suffers from mediocre characters. The entire cast is relatively linear, there's little to no character development. But, strangely enough, the characters aren't generic, they all surprisingly have something that sets them apart from any given cliché archetype. That could be positive or negative depending on how you view it, but you do have to inevitably assume their pasts (although episode zero should answer some questions). But, one character does stand out from the rest, possibly the worst character this season. It's the transvestite heroine addict that stays in the back until she needs her fix at the end of every case, whether he's needed or not. Now, what exactly does he do? Well, she's basically a cheat code. He possesses the ability to make her “victim” answer truthfully once to any of her questions (she does this by essentially sexually harassing his victim and giving them whiplash or something similar). Now, his ability wouldn't be so irritating if the show used his ability logically. Unfortunately, the main character decides to ask some of the most redundant questions using her,  it often does aid the case, but there's probably a list of so many other better questions you could have asked (It's like asking do you own this knife rather than do you know who killed the dude in the corner). \\n\\n\r\nThat being said, UN-GO would definitely be better if it was longer than eleven episodes. There's just too much content to cram into such a short frame of time. Watching this weekly often leads the viewer confused on the previous events. Many of the mysteries take up two episodes, it's a pain to recollect after a week. The maximum experience would probably be catalyzed by watching it after airs, in one or two sittings at the most. \\n\\n\r\nObjective Score: 6/10. You'll probably enjoy UN-GO more if you analyze it. On the surface, it's mediocre. The mysteries aren't that good, and the characters are mediocre. But what it does offer is an atmosphere that's relatively rare in anime. The setting of UN-GO and the behind the scenes occurring ultimately adds to the overall “mystery” of the anime. \\n\\n\r\nSubjective Score: 4/10: It's pretty bad if you watch it expecting for the obvious mystery. It's riddled with lapses of logic, and the storyline is sporadic. It wasn't really meant to be adapted in eleven episodes, it's way too short. But UN-GO does offer one of the best ED transitions since The Tatami Galaxy.",
            "date": "2011-12-22T10:23:00+00:00",
            "helpful_count": 22,
            "mal_id": 49803,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/525509.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mdz",
                "username": "mdz"
            },
            "url": "https://myanimelist.net/reviews.php?id=49803"
        },
        {
            "content": "Story: 7\r\nThe thing I love most about mystery shows is the part where they take all the clues and information and sum it all up in a genius scene. UN-GO was able to take the most confusing scenarios and still explain them, leaving you with no questions left to ask. And it still managed to remain almost completely unpredictable. \r\nThe episodes were well paced. Although during the beginning of the anime mysteries really only lasted one episode each, they eventually started taking longer and longer to solve. By the third episode of the show the cases got so hard to decipher I couldn't stop watchingand actually finished the whole anime in one sitting. I do wish it had been a little longer.\\n\\n\r\nI wanted to give UN-GO's story a 9, but there was one thing holding it back. It tended to be a little repetitive. Each time something happened, it was generally the same thing. The case would be presented to both Mr Kaishou and Shinjuurou, Kaishou would make his presumption, then Shinjuurou would prove him wrong with a little help from Inga, and it would all get covered up by the government. While repetitive cases are to be expected in a tv show revolving around a detective, I was still a little disappointed that UN-GO followed the same suit.\\n\\n\r\nArt: 7\\n\r\nIt's definitely a show with pretty art. To me that's a generally a big deal, because if you're like me at all the art can literally make or break a show, regardless of how great anything else in the anime is. But there isn't much to say here, this time. The art was really clean and well drawn. The backgrounds were nice. And I really loved the way hair and eyes were drawn in this style.\\n\\n\r\nSound: 8\\n\r\nAlthough I've said before that I don't normally pay attention to this category quite as much as the others, I was very impressed with UN-GO's soundtrack. The music was great, including all the background themes, and the ending song was super catchy.\\n\\n\r\nAs for the dialogue, while I can't speak for the original Japanese, I do think they did a fantastic job with the dub. Far too many anime really flop when they make an English version, but the lines in UN-GO were excellently translated in a way that sounded natural but still got the original point across. \\n\\n\r\nCharacter: 6/8?\\n\r\nI was so conflicted with this category's rating. On one side, the characters were so likable. And they had great designs. All of them looked nice, even the more regular looking characters weren't too boring. There weren't really any over the top designs, either, with the exception of Inga's female self. And even then, her flashy design worked perfectly with her personality, and it wasn't like you had to look at her like that all the time. \\n\\n\r\nBut on the other hand, there was very little character development. Especially Shinjuurou, who stays pretty much the same through-out the whole anime, including the extended 0th episode. I found it hard to keep liking him when he just kept acting so calm and reserved throughout each investigation, until the very end.\\n\\n\r\nEnjoyment: 7\\n\r\nStill, regardless of little growth, I really enjoyed this series as a whole. It kept me eager for the next episode the entire time. Definitely worth the time for fan art! I recommend it for sure.\\n\\n\r\nI probably will not re-watch it.",
            "date": "2014-11-17T20:43:00+00:00",
            "helpful_count": 13,
            "mal_id": 169015,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3753839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tiri",
                "username": "Tiri"
            },
            "url": "https://myanimelist.net/reviews.php?id=169015"
        },
        {
            "content": "2011 is definitely one of those detective anime years, and then... there's Un-Go.\r\nStory - 6/10\r\nStory? Plot? Do those exist in this series? So far, all I understand from watching 8 episodes is that Inga, one of the main characters, is some sort of boy/woman who feasts on souls by obtaining truth from others. Which is almost what they implied in the summary of the show. Other than that, the story has BARELY progressed at all since the beginning.\r\nArt - 7/10\r\nMediocre good fine art. Nothing to comment on here, but the pointy chins did annoy me at first, but I got used to it.\r\nSound - 6/10\r\nNothingspecial, except for the opening and endings which are good.\\n\\n\r\nCharacter - 6/10\\n\\n\r\nTo make more of an understanding, I'll list my thoughts on each character:\\n\\n\r\nShinjuurou Yuuji - The 'Defeated Detective', according to the other characters. To me, he's a statue. His character has not progressed or developed at ALL (same with the other characters, may I point out). His blunt and emotionless attitude can get on the nerves of some people at times.\\n\\n\r\nInga - To me, the best aspect of the show, and the only reason I'm continuing with it. Inga is nothing THAT special, don't take me like that, but the boy Inga character design is nice to the eyes, I'd give that. Same with the seiyuu, of course. Other than that... what is Inga? No development, yet again.\\n\\n\r\nRie - The detective's daughter. Her job? To annoy the main characters to no extent. She is an ok character, nothing new. Typical.\\n\\n\r\nKazamori - Surprisingly easier to deal with that most of the other characters. She's the typical 'loli' in anime. You just have to have one in a series.\\n\\n\r\nEnjoyment - 6/10\\n\\n\r\nWhen a new episode comes out, I watch it depending on my mood. Seriously. If I'm actually interested in an anime, I'd be looking forward to every week, waiting for it to be put up. Un-Go? Not really... Still, Inga's antics and Kazamori keep me going.\\n\\n\r\nOverall - 6/10\\n\\n\r\nMediocre show. If you're going to watch it for the 'detective mystery' aspect (which actually happens to be one of my favorite genre), then don't. It won't meet up to your expectations on that field.\\n",
            "date": "2011-12-03T04:44:00+00:00",
            "helpful_count": 13,
            "mal_id": 48513,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/280922.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kurimu-chan",
                "username": "Kurimu-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=48513"
        },
        {
            "content": "Un-Go is the story of a detective and his hyperactive assistant, and their misadventures solving mysteries. This review is based off of the first four episodes. I will update as the series progresses. I'm writing this review to hopefully help others decide if they would like to watch this show. I, myself, for reasons that will be explained in this review, quite enjoy this show.\r\nStory - 5\r\nUnforunately, the story scores really low, and I was hoping for better by Bones. Their previous show, No. 6, which had the same amount of episodes as this, had a fairly good, engaging plotline. Granted it wasn't amazing, itwas pretty good. Anywhere from a seven to a nine. However, the story falls more then a bit short for Un-Go. \\n\r\nThe plot is simple, It revolves around Yuuki Shinjuurou, a famous (or a bit infamous) detective, known as the Defeated Detective, and his assistant Inga. Shinjuurou is excellent at solving crimes, however, even though he manages to find the culprit, most of the cases he solves are covered up. Making him appear like he's always incorrect. Helping him is his hyperactive assistant: a young boy named Inga, who seems to have a mysterious power. Together they solve cases together. In general, that is the plot. \\n\r\nThis wouldn't be too bad - but the execution is poor.\\n\r\nThey tend to do one episode mysteries. (They have had one, two episode mystery) Which tend to end quickly. The point of a mystery show is to the mystery effect, which is ruined a bit if there isn't much mystery in the show itself.\\n\r\nAlso, you might notice that people have called the mysteries predictable. I don't find them entirely predictable, but they aren't difficult to solve. I might just be stupid though.\\n\\n\r\nArt - 8:\\n\\n\r\nThe art is nice- don't mistake me. It's not amazing or outstanding by any means. However, it's very clean, and well done. Some people do get annoyed with the really pointy chins that the characters have though. If you don't like pointy chins- it'll get on your nerves. \\n\r\nAnyways, I really enjoy the art. It's something different, it's not your standard art style. I enjoy that in my shows- unique art styles.\\n\\n\r\nSound - 9:\\n\\n\r\nOne of my personal highlights of the show is it's OST. I'm planning on downloading it when it becomes available. The OST really fits the show, and flows nicely. It usually fits the mood, and it's unique and different. I really love the opening song as well, it's very catchy, and gets me pumped up for the show. I don't know how well it fits, but it doesn't necessarily contrast the show, which is good.\\n\\n\r\nCharacter - 9:\\n\\n\r\nSome people really hate this- this is the reason why I watch the show. The characters are weak. Don't get me wrong. However, there's something about them I really like. I'll just talk about the protagonists. Yuuki Shinjuurou is the main protagonist. He is rather quiet and boring. However, he isn't really unlikeable. He seems friendly, rather patient, and intelligent. Both his design and personality aren't anything too special, however, they aren't too boring. While they're nothing to write home about, they are fairly nice, well designed, and he doesn't have a too cookie-cutter personality. \\n\r\nThe other protagonist is Inga, who I love. He is a wonderful foil to Shinjuurou. He's cute, hyperactive, friendly, random, and also really really creepy. He has the amazing talent to be able to switch from cute to creepy really quickly. He also has the ability to turn into an older, busty woman, who can force an answer to any one question out of anyone. He is also really interesting, and mysterious. I'm looking forward to learning more about him. As a side note, his character design, I really enjoy. It's unique, and different, without being /too/ outgoing.\\n\\n\r\nEnjoyment - 9:\\n\\n\r\nUn-Go is the highlight of my week. Aside from Guilty Crown, Mirai Nikki, and Boku Wa Tomodachi- Un-Go will always be the one I want to watch first. The mix of nice, contrasting characters, great music, and mediocre, but alright plot makes for a pleasant show that I enjoy watching. \\n\\n\r\nOverall - 8:\\n\\n\r\nI- personally, really enjoy this show. But I realize it has many flaws, and not everyone will like it. If you think you would enjoy a supernatural, mystery show- with a genius, stoic, but somewhat friendly detective, and a gender-changing shota boy who wears a panda hat who solve mysteries. This is a great show for you. If you don't like simple mysteries, or really enjoy strong stories and characters- this show may not be great for you.",
            "date": "2011-11-09T17:47:00+00:00",
            "helpful_count": 12,
            "mal_id": 47179,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/697101.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Flying-Rowboats",
                "username": "Flying-Rowboats"
            },
            "url": "https://myanimelist.net/reviews.php?id=47179"
        },
        {
            "content": "Ambition and personality can often build up the most impressive narratives, but they can’t sustain them for long without help. That… actually sums up my feelings on UN-GO pretty nicely. But this wouldn’t be much of a post if I just left it at that without giving my reasoning, so here’re the rest of my thoughts on UN-GO.\r\nFrom the start, UN-GO was a series laden with problems. It had that curious noitaminA problem of trying to fit a tome’s worth of content (We’re talking around the length of The Stand) into a single cour, doing an admirable job at developing things until one final plotlinethrew all that careful planning out the window in order to wrap the series up in a characteristically unsatisfying way. While the last arc was wonderfully written and a far cry from wasp cyclones, I hardly felt attached to any of the events, something that points toward a decided failure.\\n\\n\r\nEven though the length is its biggest handicap, it could have easily been worked around if the characters had personalities and conflicts to make the show interesting. Usagi Drop’s a perfect example of a show that did wonderful things with its restraints, even if it was adapted from, rather than based off of a previously established story. So while it could have been much longer and allowed us to immerse ourselves in the vaguely dystopic world of post-terrorist attack Japan, it had bigger issues with giving the audience a reason to form an attachment to the characters and conflicts presented. \\n\\n\r\nMuch like the rest of the world around him, we’re left watching from a distance as Shinjuurou reasons and deducts his way through the cases presented, and our attachment to him doesn’t grow any closer. Despite presenting various interesting cases (Including one involving previously illegalized androids and a murder case vaguely reminiscent of I, Robot), there’s hardly anything left to the imagination as the events are regaled with the help of Shinjuurou’s ever-present explanations. It’s not a hallmark of a great mystery series when everything is explained to you right away, leaving nothing to think about. \\n\\n\r\nThis issue persists for the entire series, but lets up just enough to let the second half, which could have been directed by the late great Satoshi Kon with how much it integrated the supernatural and the psychological into one strange amalgamation over the course of two arcs. It’s this second half that convinced me UN-GO had something up its sleeve, but just as I was getting engrossed it pulled me right out of the action in time to close up shop. And thus I came out of it unsatisfied and slightly bitter, wondering just what the hell happened.\\n\\n\r\nAside from the last two mysteries, nothing is really strong enough on its own, each disparate element clashing with another as I’m left with question after question regarding some issue that should have been resolved or at least brought up several episodes earlier. However, if there’s one area where UN-GO shines above its competition, it’s in setting the mood. Despite each case not being amazing on its own, it all adds up to a surprisingly fleshed out setting, painting the world of post-terrorist attack Japan as one that’s still recovering. \\n\\n\r\nFrom the android boom several years earlier to a mysteriously banned wartime song, the elements that lead up to each of the show’s mysteries prove much more fascinating than the mysteries themselves. This mood is helped by stylized animation and a soundtrack that fits like a glove, making it by far one of the most fully realized settings that’s ever come about in an eleven episode series.\\n\\n\r\nHowever, there were still several questions that I felt would be answered, but were instead only given knowing nods toward and never brought up again. What is Inga’s significance, aside from being a Get Out of Jail Free Card for Shinjuurou? Why the sudden bent toward the supernatural when the science fiction setting was being so deftly established? Why everything else?\\n\\n\r\nMy experience with UN-GO wasn’t always the best. There were some weeks, especially early on when the series was just finding its niche, where I wanted to drop it. Hell, I often scheduled it just after each weekly episode of Penguindrum so I’d be able to ride that high long enough to get through the drudgery of science fiction mysteries. \\n\\n\r\nIn the end, UN-GO was the best kind of failure. It tried to be something fresh and different and it very nearly succeeded at what it set out to do, even if none of the elements came together into anything spectacular. If it ran at around twice the length, it would have easily been one of the best shows of the year. Sadly, it was a high concept that was let down by too little room to work its magic in, and that’s how I’ll remember it: Not going out with a blaze of glory, but with a squelch that attempted class. I enjoyed it well enough, but it had way too many flaws for its own good.",
            "date": "2012-01-06T03:07:00+00:00",
            "helpful_count": 9,
            "mal_id": 51063,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=51063"
        },
        {
            "content": "Well, I'm not a fan of detectives series, but after watching Kami-sama no memo chou (wich one I liked) I decided to give it a chance to Bones' one.\r\nThe Story, well you know, those type of very weirdo cases that nobody can solve, but we 'got the \"freelance bad*ss\" detective who can, and if he can't, he has those friends-henchmen that helps him. Everybody knows that henchmen (secundary characters) on anime are more cool than the protagonist, so you can know where the story goes with this.\r\nArt: At first, it reminds me to Mawaru Penguindrum, and I loved that, Pako and Yun made a perfectjob. They keep it simple but awesome. For the scenarios, to be honest i didn't pay attention.\\n\\n\r\nSound: I love that \"spanish flamenco\" background music that sounds when we get to the climax of every episode, I really want to get the OST for this one. for the Opening and Ending, well. The electro-pop of LAMA it's perfect and being honest I met School Food Punishment with the Opening, but I liked it.\\n\\n\r\nCharacters: Just Inga, Everybody (yeah, even you) loves Aki Toyosaki's voice, I think this one is one of her best characters (after Yui, of course). Sasa it's pretty original, liked that. Rie, the classic female character who becomes my Waifu. Shinju, the badass... yeap.\\n\\n\r\nEnjoyment: The first cases (episodes) are so easy to discover who's the guilty (crown... NOT) but after the first episodes (I know that you hear that a lot) it gets pretty cool.\\n\\n",
            "date": "2011-12-22T22:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 49873,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/502821.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dannyzam",
                "username": "dannyzam"
            },
            "url": "https://myanimelist.net/reviews.php?id=49873"
        },
        {
            "content": "After the initial few episodes to this Noitamina series, Un-Go was quite the disappointment; the mysteries outright sucked, the characters weren’t fleshed out very well, and the pacing was awful. It was a terrible way to start off a series, but I never thought I would end up saying the exact opposite in the weeks afterwards.\r\nUn-go manages to impress well after it’s initial few episodes, where it takes on a brilliant narrative that is much more deeply focused upon it’s characters and ruinous setting, rather than the mysteries themselves. In other words, on the surface Un-go appears to be a mediocre series with bad mysteries,but as you explore the characters and setting, the story takes on a intrigue heavy atmosphere that integrates the war-torn setting almost perfectly. The setting itself is post-apocalyptic, and the story does an excellent job with taking advantage of the setting’s unique traits.\\n\\n\r\nIt’s amazing just how well the story integrates it’s main cast and setting, where the story explores in depth just how much the setting has come to haunt the very fabric of society in Un-go, everything from pop idols to politics. The character dynamics are superb as well, with the characterizations of Yuuki Shinjurou and Kaishou Rinroku being handled quite gracefully. The dialogue between the two was at many times sharp and witty, and contributed a lot to providing deeper insights into the main cast (as well as their traumas). Admittingly, Un-go still wasn’t exactly the best with it’s mysteries, but that improved significantly as the series went on.\\n\\n\r\nThe production values, unfortunately, are nothing to really rave about, but I do feel the character designs worked quite well with the overall intrigue-heavy atmosphere. I would like to note that the ending theme song was excellent, and was a very good way to transition into the credits. Oh yea, and the soundtrack for this series was also quite good. There are more than a few memorable tracks throughout this series, and did well in adding to the atmosphere of this show.\\n\\n\r\nAll that being said, I do believe Un-go suffered because it was set to be only 11 episodes. The short length ended up making certain aspects to the show feel very rushed, with the ideas that the story was trying to convey getting lost sometimes. But when Un-go nailed an arc, it was honestly brilliant. It was witty, clever, mature, and smart about how it went about it’s story and cast. And of course, the stories were genuinely deep and thought provoking.\\n\\n\r\nAnimation/Art: 8.0/10\\n\\n\r\nMusic: 8.5/10\\n\\n\r\nSetting: 9.0/10\\n\\n\r\nCharacters: 9.0/10\\n\\n\r\nStory: 8.5/10\\n\\n\r\nOverall Enjoyment: 8.6/10 (rounded up to a 9 on MAL)",
            "date": "2011-12-24T06:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 50003,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/217341.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kuro4735",
                "username": "Kuro4735"
            },
            "url": "https://myanimelist.net/reviews.php?id=50003"
        },
        {
            "content": "This show is pretty great.\r\nUN-GO is a detective show, something I haven't seen a whole lot of recently (then again, I don't watch everything that comes out, so what do I know).\r\nThe art and animation are pretty consistently good. The only art issue I would have with this show was the main character's design, but I've seen a lot worse (C control anyone?). This show does also use CGI for vehicles, but most of the time it's not noticeable.\r\nThe place where this show really shines (shines brighter?) is the story. One of the things that really sticks out to me is how connected this showis. Very little that is introduced is without purpose. Miss a couple episodes and you'll likely end up confused. Not only that, but elements introduced ultimately become an important part of the conclusion. There's generally a sense that the series is going somewhere, and it doesn't disappoint in this regard.\\n\\n\r\nOne of the things that appealed to me was it's cyberpunk tendencies. While a few of the show's core elements are supernatural, there's also a lot of really cool sci-fi concepts involved, and it all works together.\\n\\n\r\nI highly recommend checking this one out.",
            "date": "2012-01-28T21:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 52767,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Randomman",
                "username": "Randomman"
            },
            "url": "https://myanimelist.net/reviews.php?id=52767"
        },
        {
            "content": "SPOILER FREE\r\nGenre Mystery:\r\n I have a bad habit of rating highly, but I can't give this anime an 8. I pride myself on being able to duduce a srory and figure out what will happen, but I simply couldn't. Unlike anime like Gurren Lagonn it has a fitting satisfing unexpected ending that tyed up the story, and left no plot holes. I genuinly enjoyed this series and would bet all my credibility that you will too.\r\nCharacters : 7, The characters fit the series well, but were by no means as good as Onepiece or Bakuman. Keep in mind however this is a story driven series.\r\nPlot:10, The plot was well explained, unpredictable, as well as not slow. A very episodic series, keeps you very engaged.\\n\\n\r\nMusic: 8, fitting, I enjoyed the opening and ending. completed the mood well.\\n\\n\r\nAnimation: 10, beautiful \\n\\n\r\nOverall: 9, No complaints, all loose ends tyed, would recommend to friends, and very enjoyable. \\n\\n",
            "date": "2014-03-08T18:58:00+00:00",
            "helpful_count": 7,
            "mal_id": 135131,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2785297.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Extrapain",
                "username": "Extrapain"
            },
            "url": "https://myanimelist.net/reviews.php?id=135131"
        },
        {
            "content": "I never liked another series just having same theme as another anime but it is what it is. I liked the story but how they planned the anime wasn't just right. The intro was bland due to many animes having the same intro as this one. Sounds was pretty good because the voice acting were great and the background noises. Enjoyment.. eh not really because of the Bland part there wasn't anything exciting to be excited about. Overall 6 since all of them equals a total score of 5.8.. so rounding it would be good. To be exact this anime may be liking to somepeople but It's just not my taste. I love to be excited for certain events throughout any story but this just didn't have one to be precise.",
            "date": "2019-04-21T00:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 306805,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7343594.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MikaDucky",
                "username": "MikaDucky"
            },
            "url": "https://myanimelist.net/reviews.php?id=306805"
        },
        {
            "content": "\"I want to love people. I want to know their beauty. And because of that, I expose souls.\"\r\nFirst thing is first, if you are considering watching this, watch episode 0 first, Un-Go: Inga-ron\r\nUn-Go is very unique in one sense. While it does fall into your sort of basic mystery show mold, that is not really what the show is about. Sure, the main character is a detective, but he is not doing this because he enjoys solving mysteries or anything, it is deeper. He is trying to get a glimpse into the souls of humans. \r\nStory -8-: As stated above, this certainly falls into amystery show mold, but as also stated that really is not the point of the show. The mystery really are not the cases themselves, but the people involved in the cases. With that said, if you want a really good detective show, you may be disappointed with this one. The story for the most part follows your usual episodic story where it is 1 case per episode, and the cases really do not have much to do with each other (this changes towards the end when it gets to the \"big\" mystery). I am really hesitant to say too much about the story because I fear this will just turn into a long analysis of the movie. \\n\\n\r\nSound/Art -9/8- Can we just take a minute here to appreciate how beautiful the ED for this show is? Anyway I loved the soundtrack to this show, I might honestly say this is my favorite OST that was not produced by Yoko Kanno (Cowboy Bebop, Macross, GiTS Stand Alone). While most of the songs themselves are kind of basic, there are a few that stick out. Not only this, but they just go perfect with the show and fit seamlessly. Definitely take the time to listen to Fantasy and Light off the soundtrack even if you are not planning to watch the show. \\n\r\nWhen it comes to the animation is not really anything too special, but it is still beautiful. Some of the scenes with Inga just left a very pleasant taste in my mouth. I do not have much to say, but it is colorful when it needs to be, dark when it needs to be, and it is just overall good.\\n\\n\r\nCharacter -7-: First off, I want to state while a 7 is not bad I did lower the score because I feel as a standalone series the character development is not too great for your 2 MCs. IF the OVA (Movie) was technically in the same series it would have been a 9. I am not going to write any specifics about the characters because their development and what you learn about them is part of the mystery to the show.  \\n\\n\r\nOverall I loved this series. If I was rating it purely on enjoyment it would be a 10. It is no where near to being the best anime I have seen, but it makes top 5 in ones I have loved. There is just something about this show that pulled me in and left me wanting for more.",
            "date": "2015-02-23T15:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 181078,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3535539.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EmpireAnt",
                "username": "EmpireAnt"
            },
            "url": "https://myanimelist.net/reviews.php?id=181078"
        },
        {
            "content": "I suppose I should begin this post by saying something to prevent misunderstandings from anyone who may decide to watch UN-GO. Despite its appearance and the main character's profession, UN-GO is not a mystery anime, or at least not in the traditional sense. The mysteries presented in the show serve not to make the viewer surprised or intrigued at the hints and such leading to the capture of the true culprit. Instead, they provide a means for the show to introduce and unravel various aspects of Japan's state as it has become in the future that UN-GO presents.\r\nThe formula is about the same for eachcase. The important players in each plot the protagonist, Shinjuurou, encounters are introduced as they appear on the surface - a sort of civilian's perspective of the situation. As the case rolls on, the truths that surround it are revealed, at first by Shinjuurou's analysis, sometimes by Rinroku's intervention, and almost always a single truth given by Inga's power. This simple series of events allows the show to move very quickly through the content it wants to cover so that the political intrigue can be fleshed out well.\\n\\n\r\nThe story is complimented well by the environments, which are consistently interesting and detailed. The viewer is treated to a fairly thorough post-war Japan, and that setting with all of its implications are never forgotten when presenting the world. Not much obvious attention is given to the physical setting by the characters, but their adaptation to it to the point where it is (almost) the norm in their daily lives is made clear during many scenes. In particular, it is interesting to compare the differences in lifestyle between a well-off character such as Kaishou Rie to the practically homeless protagonists, Shinjuurou and Inga.\\n\\n\r\nOn the topic of comparing characters, the clear contrast in both ambition and execution between Kaishou Rinroku and Shinjuurou is one of the strongest, most interesting components of UN-GO. To an outsider, it seems like they have the same goal - to find the truth behind mysetious circumstances. However, Rinroku aims to create convenient truths to move forward, whereas Shinjuurou wants the unadulterated facts. To the public, Rinroku is the genius, and Shinjuurou is the \"Defeated Detective.\" This reflects well the way Japan's society works in UN-GO, which makes Rinroku a perfect character for this show's purposes.\\n\\n\r\nIt also speaks well for the show, then, that despite how black and white UN-GO could have presented these contrasting characters, it is not actually all that easy. Shinjuurou is not the hero one might think he could be from his love of the truth. He is actually quite selfish, not usually wanting to change much with his knowledge, only wanting to acquire it. Rinroku, then, is not the scheming, evil government official. He is simply a man who isn't afraid to manipulate people or facts to advance toward a greater goal.\\n\\n\r\nUN-GO's worth is more than the sum of its parts. It never excels at any one aspect at any given section of the story it tells, but luckily it is carefully constructed to create a compelling whole.",
            "date": "2012-04-02T15:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 57717,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/283217.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NavyCherub",
                "username": "NavyCherub"
            },
            "url": "https://myanimelist.net/reviews.php?id=57717"
        },
        {
            "content": "Sometimes a good character in anime is one who develops from humble origins into the defining aspects of a protagonist. Other times their development is never enduring any drastic changes. The latter is true for UN-GO, a simple yet enjoyable supernatural mystery that takes place in a futuristic dystopian Tokyo. UN-GO doesn't take many risks, leaving it somewhat generic but certainly not unwatchable.\r\nThe things that I found enjoyable were the characters and the story. Yuuki Shinjuurou is a solid protagonist, with the right foundations that makes a good character. He's both astute and deeply flawed, and can acknowledge that. His supporting cast compliments the storywell, albeit at times his sidekick Inga's supernatural affinity feels out of place. The story remains mostly consistent, and doesn't leave anything too wide open at the end. \\n\\n\r\nUN-GO doesn't do everything well, however. The story abruptly gets weird with larger-than-life characters that assumes control of the story. The animation and music are also pretty forgettable, but not particularly terrible. My only major complaint is that it felt too short.\\n\\n\r\nAll in all, UN-GO is a good anime and is worth taking a look at, especially if you like mysteries or shows with witty characters. It doesn't set the tone or redefine what makes a great mystery, but it's certainly enjoyable. And at the end when Shinjuurou was given the opportunity to forgo his life as a lone wolf, he decided to move on and stay true to his character.",
            "date": "2018-01-21T21:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 269297,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3625257.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aestris",
                "username": "Aestris"
            },
            "url": "https://myanimelist.net/reviews.php?id=269297"
        },
        {
            "content": "un-go is not your standard detective anime.\r\nit has a realy good story. the fact they can fool you to think you know the truth, and then expose another truth beyond the truth is realy amazing.\r\ni realy liked the sound tracks realy calming and mysterious wich fitted perfectly to the characters aswel giveing them a great \"boost\" in personalty \r\noveral i enjoyed it and would watch it again\r\nif you like a good plot unraffeling detective story whit a bit of paranormal assistence\r\ni would realy reccomend this for you\r\nGreetz, d3ullist",
            "date": "2011-12-22T14:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 49831,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1065143.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/d3ullist",
                "username": "d3ullist"
            },
            "url": "https://myanimelist.net/reviews.php?id=49831"
        },
        {
            "content": "This series is good for a change.\r\nIt's short and it doesn't really have a complex plot as such.\r\nIt is basically the 'Defeated' detective Yuuki Shinjurou and his assistant/boss Inga solving mysteries.\r\nThe first few episodes are quite boring from the mystery point of view and are more into introducing the characters. In these few episodes, the culprit seems quite obvious and the only reason to watch them is to be able to understand the final few episodes.\r\nEpisode 7 onwards(if I remember correctly), the main plot involving the Bettenou is revealed. These last 5 episodes were the reason why I liked UN-GO as a mystery genre animebecause these were the ones where the culprit wasn't so obvious and with his assistant/boss not by his side anymore, Yuuki Shinjurou was completely dependant on his own skill to figure out everything.\\n\\n\r\nOverall, this anime could have been a lot better if it had a better plot and not-so-obvious culprits. (However, it might be that I was able to figure out who the culprit was, after having read so many mystery novels XD)\\n\\n\r\nBut jokes apart, it was not as good as the other mystery genre animes I have watched so far. I would recommend you to watch this before starting any mystery series because this one doesn't have a very complex story line like the other mystery genre animes out there. \\n",
            "date": "2013-01-13T06:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 83539,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2029361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SAM10795",
                "username": "SAM10795"
            },
            "url": "https://myanimelist.net/reviews.php?id=83539"
        },
        {
            "content": "“Tell me. Why do you search for the truth?”\r\n“For souls!”\r\nThe above question is asked by the ‘Great Detective’, Kaishou Rinroku. He gets the lively reply from the assistant of the ‘Defeated Detective’, Inga.\r\nThat pretty much sums up the plot of Un-Go – an anime based on Sakaguchi Ango’s novel “Meiji Kaika Ango Torimonocho” (which I have not read) made by the studio Bones in 2011.\r\nBefore I get to the actual review, I must first talk about how I found Un-Go in the first place. I was searching for a random anime to download from a rather long list. As I quickly scrolled down skimming throughthe various names, Un-Go caught my eye with it’s bizarre name. Without even taking a look at the synopsis, I downloaded and watched it in one go.\\n\\n\r\nNow when I say that I binged it in a single night, I don’t mean that Un-Go is utterly fantastic or anything like that. It’s an above average show. When I saw the name of the studio (Bones – as stated above), I thought to myself that I was in for a treat. I was supposed to get a creamy chocolate sponge cake but, unfortunately, all I got was the cream instead. So sad.\\n\\n\r\nI immensely enjoy the mystery genre. I’m not a huge fan or anything of the sort. What I mean is that detective stories always fascinate me. Un-Go’s approach to the genre is somewhat… fresh, I have to say. It’s quite different from most offerings. So, I had fun watching it. But, being different doesn’t necessarily mean that Un-Go is really good. It’s kind of a mess.\\n\\n\r\nLet me explain. The world-building is atrocious. I know. I know! World-building doesn’t really have much significance in the mystery genre as you’re supposed to keep at least some things in the dark at the end of the story. The problem with Un-Go is that a huge war of some kind has occurred and concluded. OK. That means things are bad and we have a lot of people committing crimes. Motivation for criminal activities. Nice. But, Un-Go does not tell you why the war has exactly happened, when has it ended, whose victory was it (Japan’s loss is subtly hinted at), and who was it fought against. No clue whatsoever. For a show in which ALL of the cases have a connection the war, the answers to these questions are very important! People won’t enjoy the story if they’re too busy worrying about the Goddamned war. The way I see it, it’s just lazy writing. And that is very bad.\\n\\n\r\nAnyways, the show is basically about Yuuki in denial as to why he wants to reveal the truth (solve cases) and his goal of revealing the supposed crimes of Kaishou, his rival. All the different cases involve these two guys.\\n\\n\r\nTo the cases themselves!\\n\\n\r\nI won’t go into details about the cases because, uh, well that would defeat the purpose of watching the show. What I will say is that the pace at which the cases are solved at are really fast. I don’t have a problem with that. I’m used to quick dialogue and bad directing (1.5x playback speed!) But, others might. People like to take jabs at solving the cases themselves in detective stories. It’s part of the fun. If you have jumping scenes and dialogue with a lot of technical followed the problems brought forward with the non-presentation of information about the war in the show: people can’t do that!\\n\\n\r\nAnother problem is that when the cases get solved by Yuuki, the truth is all hushed up by Kaishou. Wow. After the first few cases, you begin wondering why Yuuki even bothers at all. You don’t get an answer. The show has an open ending. Nice~ Things are silenced for the greater good. I get that. Surely, Yuuki does to. But, seeing as Yuuki has seen some shit and has a somewhat cynical outlook he should at least try for no cover-ups. He doesn’t though and that, my friend, is bad characterization.\\n\\n\r\nSpeaking of which, most of the recurring characters in Un-Go are pretty one-dimensional. Well, they seem like that to me. Except for Yuuki and Kaishou, everyone else seem like beautifully crafted cardboard cutouts. Won’t talk about Kaishou much because that would spoil the anime. Can’t talk about Yuuki more than what I’ve already said because, even by the end, we still don’t know his past nor how he and Inga, his assistant, gain fame as detectives.\\n\\n\r\nSpeaking of Inga, Un-Go has supernatural elements in it. Inga is a… monster(?) of some sort. I say ‘some sort’ it’s never revealed what she actually is. How she meets Yuuki is literally the last few lines of the show. Jesus. Another thing kept in the dark. At one point, I began to think everything and everyone except for Yuuki and Kaishou was a fucking plot advancing tool.\\n\\n\r\nAnother thing that irks me that Yuuki isn’t all that great a detective anyway. In fact, the way he solves crimes, it might even be considered entrapment. Inga can make people answer one question. It’s a power of hers. And so, when she asks a question, people confess. Good Lord!\\n\\n\r\nAnimation is crisp, clean, and colorful. Just how I like it. The character designs are rather different than what you usually see and that’s a good thing too. Though, sometimes, I think everybody looks a bit too tall???\\n\\n\r\nNothing to say about the voice acting.\\n\\n\r\nThe music is also nothing special. The Opening was headache inducing. The background music wasn’t anything I’d praise. Well, I guess that guitar track was pretty good. The Ending… Wow. The Ending song was marvelous and the visuals were spectacular. Already listening to the full version as I write this.\\n\\n\r\nOverall, I give Un-Go a 7/10. It’s a decent show. It deserves a 5, actually. But, it tried to do something new-ish (at the time) so I’m not going to shame it for that.\\n\\n\r\nRecommended for mystery and detective fans only.\\n",
            "date": "2016-06-19T16:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 221220,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3356717.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ReJaKted",
                "username": "ReJaKted"
            },
            "url": "https://myanimelist.net/reviews.php?id=221220"
        }
    ],
    [
        {
            "content": "Comforting lies or a bitter truth. Which is better?\r\nThe above dichotomy is perhaps one of the most enduring through all of fiction. Many stories that tackle it end up siding with the truth, only to end up cushioning the blow through all sorts of contrivances; making the bitterness of the truth not as bad as initially thought. \r\nEnter UN-GO: an 11-episode anime series by Studio BONES which tackles this theme by pouring it in the format of a buddy-detective show, following cynical detective Shinjuurou Yuuki and his quirky assistant Inga as they tackle cases in a Japan that's recovering in the aftermath of a devastatingwar. The end result is something that thematically feels less like the typical mystery anime and more like a sci-fi spin on the British crime-drama Foyle's War. \\n\\n\r\nLet's get one thing clear: UN-GO isn't very good when taken as a pure detective story. Most of the cases involve genre staples such as blackmail or crimes of passion. Worse yet is that it seldom feels like the main characters are running an investigation. Whenever a crime occurs, the main duo briefly scans the scene and talks with (read: introduces) the people involved, this is followed  by some brief speculating after which Shinjuurou will deduce the big picture, only to have Inga swoop in with a magical power that literally forces people to spill the beans. And seeing as the majority of the cases last only one episode, it all ends up feeling very rushed. By rights, UN-GO should be a complete disaster, yet it ends up worthwhile by being a show about detectives solving mysteries that isn't really about the mysteries.\\n\\n\r\nThis is where the contrast between sweet lies and bitter truth comes into play.\\n\\n\r\nThe story, as previously mentioned, takes place in a Japan that's licking its wounds in the aftermath of a war. The government has restricted people's freedoms and control the flow of information as much as possible.  In-story avatar of these policies is Rinroku Kaishou, the chairman of the company that holds the monopoly on Tokyo's communication infrastructure. A charismatic, intelligent man who uses the system to his advantage. This in stark contrast to our hero Shinjuurou, a self-proclaimed seeker of truth whose insistence on uncovering shady practices earns him the hatred of officials and the people alike.\\n\\n\r\nThe contrast between these two is the thematic driving point of UN-GO as well as one of its greatest strengths. What seems like a derivative tale of the well-respected villain vs a misunderstood hero becomes a n of how people will shape events in ways that best suits them. Terrorism, blind patriotism and greed are among the themes that come by throughout the episodes, and the show consistently surprises in how it ties them into its truth-vs-lies dichotomy. Interesting to note is that the show doesn't really pick a side between Shinjuurou and Rinroku. While the former's desire to uncover the truth is presented as an admirable quality, his complete lack of tact and almost suffocating cynicism are presented not as harmless quirks but as defense mechanisms born out of desperation. Rinroku's shady practices are in no way glossed over, but the narrative also makes it clear that he views himself as a lesser evil rather than a greater good. \\n\\n\r\nIt's a shame then, that other characters don't fare as well. Recurring and one-shot characters alike usually fall into easily recognizable archetypes who play their roles as puppets of the plot competently. Standard detective fiction fare. A bigger shame is that the dynamic between Shinjuurou and Inga isn't fleshed out. It would've been interesting to see the more sinister undertones in their relationship elaborated upon, particularly the part where Inga feeds on truths as a substitute for souls. The dynamic as it is feels interesting if underdeveloped. Though it doesn't hurt the story proper in any significant manner.\\n\\n\r\nThe visuals are what you'd expect of a competently produced TV-anime. The animation is nothing remarkable across the board, though key scenes are brilliantly animated. The music is nothing memorable in and of itself but always does an excellent job enhancing the mood of scenes. On the voice-acting side of things some praise is in order for Aki Toyosaki, who showcases surprising range in her role as the quirky yet mysterious Inga. Director  Seiji Mizishima (Fullmetal Alchemist '03, Dai-Guard) once again proves himself to be highly capable,  turning several aspects – many of which vary in quality and aren't always compatible - into a compelling whole. And it would be no exaggeration to say that UN-GO might not have turned out so well had someone else been at the helm.\\n\\n\r\nUltimately, UN-GO is the best kind of bait-and-switch, providing the tale of a man seeking truth in a sea of deceit, under the guise of a detective story. Anyone intrigued by the premise and willing to be surprised would do well to give it a look.",
            "date": "2011-12-24T04:03:00+00:00",
            "helpful_count": 133,
            "mal_id": 49993,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/141673.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Uriel1988",
                "username": "Uriel1988"
            },
            "url": "https://myanimelist.net/reviews.php?id=49993"
        },
        {
            "content": "=updated after episode 11=\r\nIf you were to ask me what I though about Un-Go after watching the first few episodes I probably would've said \"boring, horrible character development, terrible pacing and lack of a plot. If you were to ask me now after seeing all the episodes I would say \"brilliant, unique storytelling and interesting characters\".\r\nUn-Go starts off from the generic 'future Japan' setting, using guess work you try to make sense of the plot and characters which is difficult and leaves you feeling like it's taking off from a prequel series. Though the backstory shines through little by little each episode and you canpiece it together (which fits into the detective mystery genre nicely).\\n\\n\r\nThe main issue i had with the early episodes of Un-Go was pacing. It felt as if they were cramming in two-parters into one episode which left a long path of plot holes along the way. At the end of the episode, you'd be thinking \"what just happened\" \"is that the ending?\" \"Why don't I just drop this crap\" but thankfully this issue is resolved later on.        \\n\\n\r\nI first thought the characters were really boring and bland, probably because the character development was nearly non-existent among the confusing plots and side characters in the first few episodes. Though you soon get attached to them, well most of them anyway.\\n\\n\r\nThe art style is interesting and the character designs aren't too bad, though I really hated the design for 'that woman' (call her this to avoid spoilers). She looked like some out of proportion alien thing.\\n\\n\r\nI liked the OP and the ED wasn't that bad. The voice acting is average.\\n\\n\r\nOverall, Un-Go has it's flaws through features the 'detective/mystery' genre at it's best. It starts off as a terrible anime, filled with poor character development, plot holes and pacing issues though finishes off with a nicely polished interesting series which leaves you wanting more.",
            "date": "2011-12-02T04:33:00+00:00",
            "helpful_count": 68,
            "mal_id": 48449,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/470868.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Miharu-Kun",
                "username": "Miharu-Kun"
            },
            "url": "https://myanimelist.net/reviews.php?id=48449"
        },
        {
            "content": "Story - Poor. Normally I watch a mystery anime for two things. A sense of resolution, or the satisfaction of a mystery solved. Even the most amateur mystery story can be enjoyable once the tricks are revealed. \r\nBut Un-go is different. None of the stories have a decent resolution, because while the mysteries are always solved, they were always covered up. Which defeats the purpose of mystery genre completely. The true genre of Un-Go is waste of time. Because that is what the characters are doing. Searching for truth, but have no real interest in revealing the truth. Hence wasting time. \r\nFurthermore, the plot isweak. In the first story, the victim was killed so that he died a hero, while he really was not. But after the killer was found, it was announced that he was a hero anyway to protect his name. There was no point in killing him in the first place. In the second story, the victim was killed because her daughter wanted to be a singer and the victim did not permit her. But the daughter was unable to become a singer anyway because of some random conspiracy by the government against idol bands. Which she was never a part of. So she killed her mother for no reason. In the third story, \"omg, the only other person in the room is not the killer, its a curse.\" How stupid is that? And when the story goes on, it is revealed the victim was killed because he was a spy and broke into the house. But of course the killer was guilty of... self defense and was arrested anyway. And for a crime they did not have proof of. Aside from the detective saying \"he did it.\" \\n\\n\r\nFor the three stories shown so far, not a single character has become better off. Not the victim, not the killer, not the victim's family, nor the killer's family. All three crimes can be described as unnecessary. The fact that the crime was done has in no way changed the lives of any of the characters. I'm not even sure if the first 2 killers were arrested because the police told them that the crime is going to be attributed to an innocent scapegoat, for the reason that... no reason. And the 3rd killer was arrested, even when no real proof was linked to him. No, circumstantial evidence, even when strong, is not the same thing. There is NO link at all. \\n\\n\r\nAside from these, there is no satisfaction in watching the mystery being solved... because OMG OMG there is MAGIC in a futuristic, scientific, post apocalyptic world. But the catch is, only the main character has access to it. And no one even notices it, and just accepts the sudden random confessions. And ignores the random \"I want to eat him/eat his soul\" comments. There is nothing to make you think, \"oh so that's why the main character caught the culprit,\" or \"oh so that's why he's even suspected in the first place.\" Although it's not hard to point the real killer within 5 minutes of the show for the first 2 stories, because they're both cliched. \\n\\n\r\nThe police are bumbling idiots, and the only other detective aside from the main character is a meddling civilian, whom, when the police ask \"how can we identify the corpse,\" answers \"do a DNA test.\" Duh. \\n\\n\r\nCharacters - Shit. Main character is an expressionless background character. And his most memorable line is \"there is no use in lying, no one can evade answering [my assistant because he has magic].\" Big whoop. And he doesn't seem to care one way or another about the truth which is a rather odd trait for a detective. He butts his way into a case, wastes his entire day being a background character, miraculously solves the case, and let the lie be accepted as the truth anyway. Then he closes off each case with \"people are ugly inside.\" End. \\n\\n\r\nThe other main character is an annoying brat. He does random stuff that only serves to distract you from the story. He should have been arrested 20x in 4 episodes just for tampering with evidence. And making physically impossible postures just to make the show creepier. But he changes into a woman who can force the truth out of someone. And eat souls. \\n\\n\r\nAll the other characters are just as flat. A civilian meddler who is the \"best detective,\" but he hasn't actually solved a single case. Only covered everything with his lies to protect the... Dunno what. And his daughter who's single trait is contrariness. Tell her to do something and she won't. \\n\\n\r\nAnd the police who knows the main character actually solves cases look down on him because of it. Why should we respect a detective who actually solves cases? No, we must support the meddler who covers everything up because he is more popular. Let us not make the strong-arm police/detective who think he's always right. It's so cliche. Instead, let's just make her have a serious fan-girl adoration of someone who she knows is wrong all the time. Oh, and as I mentioned earlier, how DO you identify someone? By DNA duh. \\n\\n\r\nGive me goth lolis any day. At least they actually have a personality. Even a stock character is better than a main character who is actually a background character. Even those annoying cicadas on trees they show every other episode in slice of lifes are more interesting. \\n\\n\r\nArt/Sound - Annoying. I normally don't comment on art and sound, because story/character/enjoyment are the things I find important. But the sound is ANNOYING. Whenever \"magic truth time\" starts, the background music suddenly becomes jarring. The first time, I thought my speaker broke. It's really annoying, distracting, and did I mention annoying?\\n\\n\r\nEnjoyment - Blah. I'd rather go to sleep than continue to watch this anime. \\n\\n\r\nOverall - Many words can be used to describe this anime. But the one that defines this the most is... ANNOYING. Annoying story, annoying plot, annoying characters, annoying background music. The fact that they use magic in a detective mystery is annoying. I normally watch a series even when its not that good, but I'm gonna drop this because it actually pisses me off.",
            "date": "2011-11-10T22:14:00+00:00",
            "helpful_count": 63,
            "mal_id": 47247,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/paksheet",
                "username": "paksheet"
            },
            "url": "https://myanimelist.net/reviews.php?id=47247"
        },
        {
            "content": "My expectations for this show was more-or-less like a Japanese equivalent to a BBC Miss Marple or Sherlock Holmes special. And, in a way, it is, but it's so much more than a simple adaptation. \r\nWhile UN-GO is based upon the writing of Ango Sakaguchi (hence, the title) the mysteries are carried out in a very different setting than the original stories. However, it never feels strange or forced in it's new setting of post WWIII Tokyo. \r\nIf you're expecting a supernatural horror anime, look elsewhere. The supernatural aspects of this show are kept to a bare minimum. In fact there are only two aspectsof this show which are supernatural, one being the nature of Inga, and the other is little more than a magic tool. Other than these two anomalies, Un-go has more in common with the Science Fiction genre. It has cool futuristic technology, hints of a dystopian future, and it even poses the question of how far can artificial intelligence evolve by itself and whether or not it is even right to treat them as machines at that point. \\n\\n\r\nWhat amazed me about UN-GO was just how tight the story was. Sure, it masquerades as a Perry Mason-esque mystery-of-the-week show, but when you look back you see that every episode was necessary to get from each story to the other. You learn the essentials of understanding how the world that Shinjuurou and Inga live in works and its history from each episode while still remaining entertaining.\\n\\n\r\nThe relationship of our detective duo is straight-forward, especially if you've seen Majin Tantei, yet the nuances of their relationship are very subtle and they are great foils for each other. Shinjuurou is very serious, mature and he steadfastly holds onto his beliefs and his interpretation of justice, but he is also surprisingly compassionate and does show affection for Inga in spite of what he/she is. Inga on the other hand is childish in its boy form, but in its female form she is seductive and in some ways just as serious and mature as Shinjuurou. She shows a deep respect and admiration for him, but male and female Inga both don't mind messing with him. However both of Inga's forms are very savage and determined and they don't mind hurting Shinjuurou if he is getting in the way of a potential meal. \\n\\n\r\nI can't say much about the sound design other than it's great, just great. The music is cool and some tracks are catchy and the voice actors deliver really great performances, namely Inga's voice actress, Toyosaki Aki. I have to admit I didn't expect much from her when I heard she was in K-On, but she played a very dynamic Inga. She was able to cycle from innocently childish to frightening and creepy. She also accomplished the hardest thing for a voice actor; she was able to give emotional depth subtly through her voice. \\n\\n\r\nThe animation is very smooth and rather colourful and stylish for a post-war setting, especially in the opening and ending sequences (which have awesome music by the way). My only complaint is that Shinjuurou's face in particular can look a little lazily drawn in places. I believe this is mainly due to one of the character designers', Pako's, distinctive style which is a little more suited to an otome game than it is an anime. \\n\\n\r\nUN-GO is a modest little series. It does not strive to be ground-breaking but in its own little way it challenges your viewpoints on subjects like self-sacrifice and the psychological effects of war and terrorism. This is one of the only shows I have ever seen which was able to show diversity in ideologies. But, as I said, it does not strive to be a masterpiece and thus I feel reluctant to rate it as one. Everything is very low-key and not a lot of risks were taken other than the major change in setting. But, the fact still remains that UN-GO is a great show that feels bigger than it is, and for that I cannot recommend it enough. \\n\\n\r\nBut note that if you want to truly enjoy this show you must watch UN-GO episode:0 Inga-ron either before or immediately after watching the series. Every single question you could have about UN-GO at the end of the series is answered in Inga-ron. With UN-GO and Inga-ron together the series is this neat little package which has one of the most satisfying endings of any anime series.",
            "date": "2012-06-11T00:36:00+00:00",
            "helpful_count": 53,
            "mal_id": 63145,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/24497.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aria34",
                "username": "Aria34"
            },
            "url": "https://myanimelist.net/reviews.php?id=63145"
        },
        {
            "content": "Not your traditional mystery anime.\r\n[contains some generalized spoilers, suggestive humor and language]\r\nUN-GO is by no means a traditional “mystery anime”. If you view it only from that perspective, then UN-GO is relatively mediocre as a whole. What makes UN-GO a “good” anime is the hidden mystery behind all the concurrent “traditional” mysteries. \r\nNow, what exactly defines a “traditional mystery” and what sets UN-GO apart from being one? Well a traditional mystery is “best” mediocrely defined as going from the crime scene to interrogating the suspects, to finding the verdict by the end of the episode, this is best comparable to anime like Gosick. UN-GO onthe other hand incorporates a different element. It's the type of behind the scene mystery that's blatant after you learn about it, but rather difficult to discern when you're watching it initially; it's an enjoyable treat. But, it is arguable on whether or not it was actually done well.\\n\\n\r\nUnfortunately, UN-GO does suffers from mediocre characters. The entire cast is relatively linear, there's little to no character development. But, strangely enough, the characters aren't generic, they all surprisingly have something that sets them apart from any given cliché archetype. That could be positive or negative depending on how you view it, but you do have to inevitably assume their pasts (although episode zero should answer some questions). But, one character does stand out from the rest, possibly the worst character this season. It's the transvestite heroine addict that stays in the back until she needs her fix at the end of every case, whether he's needed or not. Now, what exactly does he do? Well, she's basically a cheat code. He possesses the ability to make her “victim” answer truthfully once to any of her questions (she does this by essentially sexually harassing his victim and giving them whiplash or something similar). Now, his ability wouldn't be so irritating if the show used his ability logically. Unfortunately, the main character decides to ask some of the most redundant questions using her,  it often does aid the case, but there's probably a list of so many other better questions you could have asked (It's like asking do you own this knife rather than do you know who killed the dude in the corner). \\n\\n\r\nThat being said, UN-GO would definitely be better if it was longer than eleven episodes. There's just too much content to cram into such a short frame of time. Watching this weekly often leads the viewer confused on the previous events. Many of the mysteries take up two episodes, it's a pain to recollect after a week. The maximum experience would probably be catalyzed by watching it after airs, in one or two sittings at the most. \\n\\n\r\nObjective Score: 6/10. You'll probably enjoy UN-GO more if you analyze it. On the surface, it's mediocre. The mysteries aren't that good, and the characters are mediocre. But what it does offer is an atmosphere that's relatively rare in anime. The setting of UN-GO and the behind the scenes occurring ultimately adds to the overall “mystery” of the anime. \\n\\n\r\nSubjective Score: 4/10: It's pretty bad if you watch it expecting for the obvious mystery. It's riddled with lapses of logic, and the storyline is sporadic. It wasn't really meant to be adapted in eleven episodes, it's way too short. But UN-GO does offer one of the best ED transitions since The Tatami Galaxy.",
            "date": "2011-12-22T10:23:00+00:00",
            "helpful_count": 22,
            "mal_id": 49803,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/525509.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/mdz",
                "username": "mdz"
            },
            "url": "https://myanimelist.net/reviews.php?id=49803"
        },
        {
            "content": "Story: 7\r\nThe thing I love most about mystery shows is the part where they take all the clues and information and sum it all up in a genius scene. UN-GO was able to take the most confusing scenarios and still explain them, leaving you with no questions left to ask. And it still managed to remain almost completely unpredictable. \r\nThe episodes were well paced. Although during the beginning of the anime mysteries really only lasted one episode each, they eventually started taking longer and longer to solve. By the third episode of the show the cases got so hard to decipher I couldn't stop watchingand actually finished the whole anime in one sitting. I do wish it had been a little longer.\\n\\n\r\nI wanted to give UN-GO's story a 9, but there was one thing holding it back. It tended to be a little repetitive. Each time something happened, it was generally the same thing. The case would be presented to both Mr Kaishou and Shinjuurou, Kaishou would make his presumption, then Shinjuurou would prove him wrong with a little help from Inga, and it would all get covered up by the government. While repetitive cases are to be expected in a tv show revolving around a detective, I was still a little disappointed that UN-GO followed the same suit.\\n\\n\r\nArt: 7\\n\r\nIt's definitely a show with pretty art. To me that's a generally a big deal, because if you're like me at all the art can literally make or break a show, regardless of how great anything else in the anime is. But there isn't much to say here, this time. The art was really clean and well drawn. The backgrounds were nice. And I really loved the way hair and eyes were drawn in this style.\\n\\n\r\nSound: 8\\n\r\nAlthough I've said before that I don't normally pay attention to this category quite as much as the others, I was very impressed with UN-GO's soundtrack. The music was great, including all the background themes, and the ending song was super catchy.\\n\\n\r\nAs for the dialogue, while I can't speak for the original Japanese, I do think they did a fantastic job with the dub. Far too many anime really flop when they make an English version, but the lines in UN-GO were excellently translated in a way that sounded natural but still got the original point across. \\n\\n\r\nCharacter: 6/8?\\n\r\nI was so conflicted with this category's rating. On one side, the characters were so likable. And they had great designs. All of them looked nice, even the more regular looking characters weren't too boring. There weren't really any over the top designs, either, with the exception of Inga's female self. And even then, her flashy design worked perfectly with her personality, and it wasn't like you had to look at her like that all the time. \\n\\n\r\nBut on the other hand, there was very little character development. Especially Shinjuurou, who stays pretty much the same through-out the whole anime, including the extended 0th episode. I found it hard to keep liking him when he just kept acting so calm and reserved throughout each investigation, until the very end.\\n\\n\r\nEnjoyment: 7\\n\r\nStill, regardless of little growth, I really enjoyed this series as a whole. It kept me eager for the next episode the entire time. Definitely worth the time for fan art! I recommend it for sure.\\n\\n\r\nI probably will not re-watch it.",
            "date": "2014-11-17T20:43:00+00:00",
            "helpful_count": 13,
            "mal_id": 169015,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3753839.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Tiri",
                "username": "Tiri"
            },
            "url": "https://myanimelist.net/reviews.php?id=169015"
        },
        {
            "content": "2011 is definitely one of those detective anime years, and then... there's Un-Go.\r\nStory - 6/10\r\nStory? Plot? Do those exist in this series? So far, all I understand from watching 8 episodes is that Inga, one of the main characters, is some sort of boy/woman who feasts on souls by obtaining truth from others. Which is almost what they implied in the summary of the show. Other than that, the story has BARELY progressed at all since the beginning.\r\nArt - 7/10\r\nMediocre good fine art. Nothing to comment on here, but the pointy chins did annoy me at first, but I got used to it.\r\nSound - 6/10\r\nNothingspecial, except for the opening and endings which are good.\\n\\n\r\nCharacter - 6/10\\n\\n\r\nTo make more of an understanding, I'll list my thoughts on each character:\\n\\n\r\nShinjuurou Yuuji - The 'Defeated Detective', according to the other characters. To me, he's a statue. His character has not progressed or developed at ALL (same with the other characters, may I point out). His blunt and emotionless attitude can get on the nerves of some people at times.\\n\\n\r\nInga - To me, the best aspect of the show, and the only reason I'm continuing with it. Inga is nothing THAT special, don't take me like that, but the boy Inga character design is nice to the eyes, I'd give that. Same with the seiyuu, of course. Other than that... what is Inga? No development, yet again.\\n\\n\r\nRie - The detective's daughter. Her job? To annoy the main characters to no extent. She is an ok character, nothing new. Typical.\\n\\n\r\nKazamori - Surprisingly easier to deal with that most of the other characters. She's the typical 'loli' in anime. You just have to have one in a series.\\n\\n\r\nEnjoyment - 6/10\\n\\n\r\nWhen a new episode comes out, I watch it depending on my mood. Seriously. If I'm actually interested in an anime, I'd be looking forward to every week, waiting for it to be put up. Un-Go? Not really... Still, Inga's antics and Kazamori keep me going.\\n\\n\r\nOverall - 6/10\\n\\n\r\nMediocre show. If you're going to watch it for the 'detective mystery' aspect (which actually happens to be one of my favorite genre), then don't. It won't meet up to your expectations on that field.\\n",
            "date": "2011-12-03T04:44:00+00:00",
            "helpful_count": 13,
            "mal_id": 48513,
            "reviewer": {
                "episodes_seen": 8,
                "image_url": "https://cdn.myanimelist.net/images/userimages/280922.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kurimu-chan",
                "username": "Kurimu-chan"
            },
            "url": "https://myanimelist.net/reviews.php?id=48513"
        },
        {
            "content": "Un-Go is the story of a detective and his hyperactive assistant, and their misadventures solving mysteries. This review is based off of the first four episodes. I will update as the series progresses. I'm writing this review to hopefully help others decide if they would like to watch this show. I, myself, for reasons that will be explained in this review, quite enjoy this show.\r\nStory - 5\r\nUnforunately, the story scores really low, and I was hoping for better by Bones. Their previous show, No. 6, which had the same amount of episodes as this, had a fairly good, engaging plotline. Granted it wasn't amazing, itwas pretty good. Anywhere from a seven to a nine. However, the story falls more then a bit short for Un-Go. \\n\r\nThe plot is simple, It revolves around Yuuki Shinjuurou, a famous (or a bit infamous) detective, known as the Defeated Detective, and his assistant Inga. Shinjuurou is excellent at solving crimes, however, even though he manages to find the culprit, most of the cases he solves are covered up. Making him appear like he's always incorrect. Helping him is his hyperactive assistant: a young boy named Inga, who seems to have a mysterious power. Together they solve cases together. In general, that is the plot. \\n\r\nThis wouldn't be too bad - but the execution is poor.\\n\r\nThey tend to do one episode mysteries. (They have had one, two episode mystery) Which tend to end quickly. The point of a mystery show is to the mystery effect, which is ruined a bit if there isn't much mystery in the show itself.\\n\r\nAlso, you might notice that people have called the mysteries predictable. I don't find them entirely predictable, but they aren't difficult to solve. I might just be stupid though.\\n\\n\r\nArt - 8:\\n\\n\r\nThe art is nice- don't mistake me. It's not amazing or outstanding by any means. However, it's very clean, and well done. Some people do get annoyed with the really pointy chins that the characters have though. If you don't like pointy chins- it'll get on your nerves. \\n\r\nAnyways, I really enjoy the art. It's something different, it's not your standard art style. I enjoy that in my shows- unique art styles.\\n\\n\r\nSound - 9:\\n\\n\r\nOne of my personal highlights of the show is it's OST. I'm planning on downloading it when it becomes available. The OST really fits the show, and flows nicely. It usually fits the mood, and it's unique and different. I really love the opening song as well, it's very catchy, and gets me pumped up for the show. I don't know how well it fits, but it doesn't necessarily contrast the show, which is good.\\n\\n\r\nCharacter - 9:\\n\\n\r\nSome people really hate this- this is the reason why I watch the show. The characters are weak. Don't get me wrong. However, there's something about them I really like. I'll just talk about the protagonists. Yuuki Shinjuurou is the main protagonist. He is rather quiet and boring. However, he isn't really unlikeable. He seems friendly, rather patient, and intelligent. Both his design and personality aren't anything too special, however, they aren't too boring. While they're nothing to write home about, they are fairly nice, well designed, and he doesn't have a too cookie-cutter personality. \\n\r\nThe other protagonist is Inga, who I love. He is a wonderful foil to Shinjuurou. He's cute, hyperactive, friendly, random, and also really really creepy. He has the amazing talent to be able to switch from cute to creepy really quickly. He also has the ability to turn into an older, busty woman, who can force an answer to any one question out of anyone. He is also really interesting, and mysterious. I'm looking forward to learning more about him. As a side note, his character design, I really enjoy. It's unique, and different, without being /too/ outgoing.\\n\\n\r\nEnjoyment - 9:\\n\\n\r\nUn-Go is the highlight of my week. Aside from Guilty Crown, Mirai Nikki, and Boku Wa Tomodachi- Un-Go will always be the one I want to watch first. The mix of nice, contrasting characters, great music, and mediocre, but alright plot makes for a pleasant show that I enjoy watching. \\n\\n\r\nOverall - 8:\\n\\n\r\nI- personally, really enjoy this show. But I realize it has many flaws, and not everyone will like it. If you think you would enjoy a supernatural, mystery show- with a genius, stoic, but somewhat friendly detective, and a gender-changing shota boy who wears a panda hat who solve mysteries. This is a great show for you. If you don't like simple mysteries, or really enjoy strong stories and characters- this show may not be great for you.",
            "date": "2011-11-09T17:47:00+00:00",
            "helpful_count": 12,
            "mal_id": 47179,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/697101.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Flying-Rowboats",
                "username": "Flying-Rowboats"
            },
            "url": "https://myanimelist.net/reviews.php?id=47179"
        },
        {
            "content": "Ambition and personality can often build up the most impressive narratives, but they can’t sustain them for long without help. That… actually sums up my feelings on UN-GO pretty nicely. But this wouldn’t be much of a post if I just left it at that without giving my reasoning, so here’re the rest of my thoughts on UN-GO.\r\nFrom the start, UN-GO was a series laden with problems. It had that curious noitaminA problem of trying to fit a tome’s worth of content (We’re talking around the length of The Stand) into a single cour, doing an admirable job at developing things until one final plotlinethrew all that careful planning out the window in order to wrap the series up in a characteristically unsatisfying way. While the last arc was wonderfully written and a far cry from wasp cyclones, I hardly felt attached to any of the events, something that points toward a decided failure.\\n\\n\r\nEven though the length is its biggest handicap, it could have easily been worked around if the characters had personalities and conflicts to make the show interesting. Usagi Drop’s a perfect example of a show that did wonderful things with its restraints, even if it was adapted from, rather than based off of a previously established story. So while it could have been much longer and allowed us to immerse ourselves in the vaguely dystopic world of post-terrorist attack Japan, it had bigger issues with giving the audience a reason to form an attachment to the characters and conflicts presented. \\n\\n\r\nMuch like the rest of the world around him, we’re left watching from a distance as Shinjuurou reasons and deducts his way through the cases presented, and our attachment to him doesn’t grow any closer. Despite presenting various interesting cases (Including one involving previously illegalized androids and a murder case vaguely reminiscent of I, Robot), there’s hardly anything left to the imagination as the events are regaled with the help of Shinjuurou’s ever-present explanations. It’s not a hallmark of a great mystery series when everything is explained to you right away, leaving nothing to think about. \\n\\n\r\nThis issue persists for the entire series, but lets up just enough to let the second half, which could have been directed by the late great Satoshi Kon with how much it integrated the supernatural and the psychological into one strange amalgamation over the course of two arcs. It’s this second half that convinced me UN-GO had something up its sleeve, but just as I was getting engrossed it pulled me right out of the action in time to close up shop. And thus I came out of it unsatisfied and slightly bitter, wondering just what the hell happened.\\n\\n\r\nAside from the last two mysteries, nothing is really strong enough on its own, each disparate element clashing with another as I’m left with question after question regarding some issue that should have been resolved or at least brought up several episodes earlier. However, if there’s one area where UN-GO shines above its competition, it’s in setting the mood. Despite each case not being amazing on its own, it all adds up to a surprisingly fleshed out setting, painting the world of post-terrorist attack Japan as one that’s still recovering. \\n\\n\r\nFrom the android boom several years earlier to a mysteriously banned wartime song, the elements that lead up to each of the show’s mysteries prove much more fascinating than the mysteries themselves. This mood is helped by stylized animation and a soundtrack that fits like a glove, making it by far one of the most fully realized settings that’s ever come about in an eleven episode series.\\n\\n\r\nHowever, there were still several questions that I felt would be answered, but were instead only given knowing nods toward and never brought up again. What is Inga’s significance, aside from being a Get Out of Jail Free Card for Shinjuurou? Why the sudden bent toward the supernatural when the science fiction setting was being so deftly established? Why everything else?\\n\\n\r\nMy experience with UN-GO wasn’t always the best. There were some weeks, especially early on when the series was just finding its niche, where I wanted to drop it. Hell, I often scheduled it just after each weekly episode of Penguindrum so I’d be able to ride that high long enough to get through the drudgery of science fiction mysteries. \\n\\n\r\nIn the end, UN-GO was the best kind of failure. It tried to be something fresh and different and it very nearly succeeded at what it set out to do, even if none of the elements came together into anything spectacular. If it ran at around twice the length, it would have easily been one of the best shows of the year. Sadly, it was a high concept that was let down by too little room to work its magic in, and that’s how I’ll remember it: Not going out with a blaze of glory, but with a squelch that attempted class. I enjoyed it well enough, but it had way too many flaws for its own good.",
            "date": "2012-01-06T03:07:00+00:00",
            "helpful_count": 9,
            "mal_id": 51063,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/372606.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Inushinde",
                "username": "Inushinde"
            },
            "url": "https://myanimelist.net/reviews.php?id=51063"
        },
        {
            "content": "Well, I'm not a fan of detectives series, but after watching Kami-sama no memo chou (wich one I liked) I decided to give it a chance to Bones' one.\r\nThe Story, well you know, those type of very weirdo cases that nobody can solve, but we 'got the \"freelance bad*ss\" detective who can, and if he can't, he has those friends-henchmen that helps him. Everybody knows that henchmen (secundary characters) on anime are more cool than the protagonist, so you can know where the story goes with this.\r\nArt: At first, it reminds me to Mawaru Penguindrum, and I loved that, Pako and Yun made a perfectjob. They keep it simple but awesome. For the scenarios, to be honest i didn't pay attention.\\n\\n\r\nSound: I love that \"spanish flamenco\" background music that sounds when we get to the climax of every episode, I really want to get the OST for this one. for the Opening and Ending, well. The electro-pop of LAMA it's perfect and being honest I met School Food Punishment with the Opening, but I liked it.\\n\\n\r\nCharacters: Just Inga, Everybody (yeah, even you) loves Aki Toyosaki's voice, I think this one is one of her best characters (after Yui, of course). Sasa it's pretty original, liked that. Rie, the classic female character who becomes my Waifu. Shinju, the badass... yeap.\\n\\n\r\nEnjoyment: The first cases (episodes) are so easy to discover who's the guilty (crown... NOT) but after the first episodes (I know that you hear that a lot) it gets pretty cool.\\n\\n",
            "date": "2011-12-22T22:30:00+00:00",
            "helpful_count": 8,
            "mal_id": 49873,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/502821.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/dannyzam",
                "username": "dannyzam"
            },
            "url": "https://myanimelist.net/reviews.php?id=49873"
        },
        {
            "content": "After the initial few episodes to this Noitamina series, Un-Go was quite the disappointment; the mysteries outright sucked, the characters weren’t fleshed out very well, and the pacing was awful. It was a terrible way to start off a series, but I never thought I would end up saying the exact opposite in the weeks afterwards.\r\nUn-go manages to impress well after it’s initial few episodes, where it takes on a brilliant narrative that is much more deeply focused upon it’s characters and ruinous setting, rather than the mysteries themselves. In other words, on the surface Un-go appears to be a mediocre series with bad mysteries,but as you explore the characters and setting, the story takes on a intrigue heavy atmosphere that integrates the war-torn setting almost perfectly. The setting itself is post-apocalyptic, and the story does an excellent job with taking advantage of the setting’s unique traits.\\n\\n\r\nIt’s amazing just how well the story integrates it’s main cast and setting, where the story explores in depth just how much the setting has come to haunt the very fabric of society in Un-go, everything from pop idols to politics. The character dynamics are superb as well, with the characterizations of Yuuki Shinjurou and Kaishou Rinroku being handled quite gracefully. The dialogue between the two was at many times sharp and witty, and contributed a lot to providing deeper insights into the main cast (as well as their traumas). Admittingly, Un-go still wasn’t exactly the best with it’s mysteries, but that improved significantly as the series went on.\\n\\n\r\nThe production values, unfortunately, are nothing to really rave about, but I do feel the character designs worked quite well with the overall intrigue-heavy atmosphere. I would like to note that the ending theme song was excellent, and was a very good way to transition into the credits. Oh yea, and the soundtrack for this series was also quite good. There are more than a few memorable tracks throughout this series, and did well in adding to the atmosphere of this show.\\n\\n\r\nAll that being said, I do believe Un-go suffered because it was set to be only 11 episodes. The short length ended up making certain aspects to the show feel very rushed, with the ideas that the story was trying to convey getting lost sometimes. But when Un-go nailed an arc, it was honestly brilliant. It was witty, clever, mature, and smart about how it went about it’s story and cast. And of course, the stories were genuinely deep and thought provoking.\\n\\n\r\nAnimation/Art: 8.0/10\\n\\n\r\nMusic: 8.5/10\\n\\n\r\nSetting: 9.0/10\\n\\n\r\nCharacters: 9.0/10\\n\\n\r\nStory: 8.5/10\\n\\n\r\nOverall Enjoyment: 8.6/10 (rounded up to a 9 on MAL)",
            "date": "2011-12-24T06:53:00+00:00",
            "helpful_count": 7,
            "mal_id": 50003,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/217341.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kuro4735",
                "username": "Kuro4735"
            },
            "url": "https://myanimelist.net/reviews.php?id=50003"
        },
        {
            "content": "This show is pretty great.\r\nUN-GO is a detective show, something I haven't seen a whole lot of recently (then again, I don't watch everything that comes out, so what do I know).\r\nThe art and animation are pretty consistently good. The only art issue I would have with this show was the main character's design, but I've seen a lot worse (C control anyone?). This show does also use CGI for vehicles, but most of the time it's not noticeable.\r\nThe place where this show really shines (shines brighter?) is the story. One of the things that really sticks out to me is how connected this showis. Very little that is introduced is without purpose. Miss a couple episodes and you'll likely end up confused. Not only that, but elements introduced ultimately become an important part of the conclusion. There's generally a sense that the series is going somewhere, and it doesn't disappoint in this regard.\\n\\n\r\nOne of the things that appealed to me was it's cyberpunk tendencies. While a few of the show's core elements are supernatural, there's also a lot of really cool sci-fi concepts involved, and it all works together.\\n\\n\r\nI highly recommend checking this one out.",
            "date": "2012-01-28T21:06:00+00:00",
            "helpful_count": 7,
            "mal_id": 52767,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Randomman",
                "username": "Randomman"
            },
            "url": "https://myanimelist.net/reviews.php?id=52767"
        },
        {
            "content": "SPOILER FREE\r\nGenre Mystery:\r\n I have a bad habit of rating highly, but I can't give this anime an 8. I pride myself on being able to duduce a srory and figure out what will happen, but I simply couldn't. Unlike anime like Gurren Lagonn it has a fitting satisfing unexpected ending that tyed up the story, and left no plot holes. I genuinly enjoyed this series and would bet all my credibility that you will too.\r\nCharacters : 7, The characters fit the series well, but were by no means as good as Onepiece or Bakuman. Keep in mind however this is a story driven series.\r\nPlot:10, The plot was well explained, unpredictable, as well as not slow. A very episodic series, keeps you very engaged.\\n\\n\r\nMusic: 8, fitting, I enjoyed the opening and ending. completed the mood well.\\n\\n\r\nAnimation: 10, beautiful \\n\\n\r\nOverall: 9, No complaints, all loose ends tyed, would recommend to friends, and very enjoyable. \\n\\n",
            "date": "2014-03-08T18:58:00+00:00",
            "helpful_count": 7,
            "mal_id": 135131,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2785297.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Extrapain",
                "username": "Extrapain"
            },
            "url": "https://myanimelist.net/reviews.php?id=135131"
        },
        {
            "content": "I never liked another series just having same theme as another anime but it is what it is. I liked the story but how they planned the anime wasn't just right. The intro was bland due to many animes having the same intro as this one. Sounds was pretty good because the voice acting were great and the background noises. Enjoyment.. eh not really because of the Bland part there wasn't anything exciting to be excited about. Overall 6 since all of them equals a total score of 5.8.. so rounding it would be good. To be exact this anime may be liking to somepeople but It's just not my taste. I love to be excited for certain events throughout any story but this just didn't have one to be precise.",
            "date": "2019-04-21T00:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 306805,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7343594.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MikaDucky",
                "username": "MikaDucky"
            },
            "url": "https://myanimelist.net/reviews.php?id=306805"
        },
        {
            "content": "\"I want to love people. I want to know their beauty. And because of that, I expose souls.\"\r\nFirst thing is first, if you are considering watching this, watch episode 0 first, Un-Go: Inga-ron\r\nUn-Go is very unique in one sense. While it does fall into your sort of basic mystery show mold, that is not really what the show is about. Sure, the main character is a detective, but he is not doing this because he enjoys solving mysteries or anything, it is deeper. He is trying to get a glimpse into the souls of humans. \r\nStory -8-: As stated above, this certainly falls into amystery show mold, but as also stated that really is not the point of the show. The mystery really are not the cases themselves, but the people involved in the cases. With that said, if you want a really good detective show, you may be disappointed with this one. The story for the most part follows your usual episodic story where it is 1 case per episode, and the cases really do not have much to do with each other (this changes towards the end when it gets to the \"big\" mystery). I am really hesitant to say too much about the story because I fear this will just turn into a long analysis of the movie. \\n\\n\r\nSound/Art -9/8- Can we just take a minute here to appreciate how beautiful the ED for this show is? Anyway I loved the soundtrack to this show, I might honestly say this is my favorite OST that was not produced by Yoko Kanno (Cowboy Bebop, Macross, GiTS Stand Alone). While most of the songs themselves are kind of basic, there are a few that stick out. Not only this, but they just go perfect with the show and fit seamlessly. Definitely take the time to listen to Fantasy and Light off the soundtrack even if you are not planning to watch the show. \\n\r\nWhen it comes to the animation is not really anything too special, but it is still beautiful. Some of the scenes with Inga just left a very pleasant taste in my mouth. I do not have much to say, but it is colorful when it needs to be, dark when it needs to be, and it is just overall good.\\n\\n\r\nCharacter -7-: First off, I want to state while a 7 is not bad I did lower the score because I feel as a standalone series the character development is not too great for your 2 MCs. IF the OVA (Movie) was technically in the same series it would have been a 9. I am not going to write any specifics about the characters because their development and what you learn about them is part of the mystery to the show.  \\n\\n\r\nOverall I loved this series. If I was rating it purely on enjoyment it would be a 10. It is no where near to being the best anime I have seen, but it makes top 5 in ones I have loved. There is just something about this show that pulled me in and left me wanting for more.",
            "date": "2015-02-23T15:59:00+00:00",
            "helpful_count": 6,
            "mal_id": 181078,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3535539.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/EmpireAnt",
                "username": "EmpireAnt"
            },
            "url": "https://myanimelist.net/reviews.php?id=181078"
        },
        {
            "content": "I suppose I should begin this post by saying something to prevent misunderstandings from anyone who may decide to watch UN-GO. Despite its appearance and the main character's profession, UN-GO is not a mystery anime, or at least not in the traditional sense. The mysteries presented in the show serve not to make the viewer surprised or intrigued at the hints and such leading to the capture of the true culprit. Instead, they provide a means for the show to introduce and unravel various aspects of Japan's state as it has become in the future that UN-GO presents.\r\nThe formula is about the same for eachcase. The important players in each plot the protagonist, Shinjuurou, encounters are introduced as they appear on the surface - a sort of civilian's perspective of the situation. As the case rolls on, the truths that surround it are revealed, at first by Shinjuurou's analysis, sometimes by Rinroku's intervention, and almost always a single truth given by Inga's power. This simple series of events allows the show to move very quickly through the content it wants to cover so that the political intrigue can be fleshed out well.\\n\\n\r\nThe story is complimented well by the environments, which are consistently interesting and detailed. The viewer is treated to a fairly thorough post-war Japan, and that setting with all of its implications are never forgotten when presenting the world. Not much obvious attention is given to the physical setting by the characters, but their adaptation to it to the point where it is (almost) the norm in their daily lives is made clear during many scenes. In particular, it is interesting to compare the differences in lifestyle between a well-off character such as Kaishou Rie to the practically homeless protagonists, Shinjuurou and Inga.\\n\\n\r\nOn the topic of comparing characters, the clear contrast in both ambition and execution between Kaishou Rinroku and Shinjuurou is one of the strongest, most interesting components of UN-GO. To an outsider, it seems like they have the same goal - to find the truth behind mysetious circumstances. However, Rinroku aims to create convenient truths to move forward, whereas Shinjuurou wants the unadulterated facts. To the public, Rinroku is the genius, and Shinjuurou is the \"Defeated Detective.\" This reflects well the way Japan's society works in UN-GO, which makes Rinroku a perfect character for this show's purposes.\\n\\n\r\nIt also speaks well for the show, then, that despite how black and white UN-GO could have presented these contrasting characters, it is not actually all that easy. Shinjuurou is not the hero one might think he could be from his love of the truth. He is actually quite selfish, not usually wanting to change much with his knowledge, only wanting to acquire it. Rinroku, then, is not the scheming, evil government official. He is simply a man who isn't afraid to manipulate people or facts to advance toward a greater goal.\\n\\n\r\nUN-GO's worth is more than the sum of its parts. It never excels at any one aspect at any given section of the story it tells, but luckily it is carefully constructed to create a compelling whole.",
            "date": "2012-04-02T15:52:00+00:00",
            "helpful_count": 5,
            "mal_id": 57717,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/283217.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/NavyCherub",
                "username": "NavyCherub"
            },
            "url": "https://myanimelist.net/reviews.php?id=57717"
        },
        {
            "content": "Sometimes a good character in anime is one who develops from humble origins into the defining aspects of a protagonist. Other times their development is never enduring any drastic changes. The latter is true for UN-GO, a simple yet enjoyable supernatural mystery that takes place in a futuristic dystopian Tokyo. UN-GO doesn't take many risks, leaving it somewhat generic but certainly not unwatchable.\r\nThe things that I found enjoyable were the characters and the story. Yuuki Shinjuurou is a solid protagonist, with the right foundations that makes a good character. He's both astute and deeply flawed, and can acknowledge that. His supporting cast compliments the storywell, albeit at times his sidekick Inga's supernatural affinity feels out of place. The story remains mostly consistent, and doesn't leave anything too wide open at the end. \\n\\n\r\nUN-GO doesn't do everything well, however. The story abruptly gets weird with larger-than-life characters that assumes control of the story. The animation and music are also pretty forgettable, but not particularly terrible. My only major complaint is that it felt too short.\\n\\n\r\nAll in all, UN-GO is a good anime and is worth taking a look at, especially if you like mysteries or shows with witty characters. It doesn't set the tone or redefine what makes a great mystery, but it's certainly enjoyable. And at the end when Shinjuurou was given the opportunity to forgo his life as a lone wolf, he decided to move on and stay true to his character.",
            "date": "2018-01-21T21:28:00+00:00",
            "helpful_count": 2,
            "mal_id": 269297,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3625257.jpg",
                "scores": {
                    "animation": 5,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Aestris",
                "username": "Aestris"
            },
            "url": "https://myanimelist.net/reviews.php?id=269297"
        },
        {
            "content": "un-go is not your standard detective anime.\r\nit has a realy good story. the fact they can fool you to think you know the truth, and then expose another truth beyond the truth is realy amazing.\r\ni realy liked the sound tracks realy calming and mysterious wich fitted perfectly to the characters aswel giveing them a great \"boost\" in personalty \r\noveral i enjoyed it and would watch it again\r\nif you like a good plot unraffeling detective story whit a bit of paranormal assistence\r\ni would realy reccomend this for you\r\nGreetz, d3ullist",
            "date": "2011-12-22T14:10:00+00:00",
            "helpful_count": 4,
            "mal_id": 49831,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1065143.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/d3ullist",
                "username": "d3ullist"
            },
            "url": "https://myanimelist.net/reviews.php?id=49831"
        },
        {
            "content": "This series is good for a change.\r\nIt's short and it doesn't really have a complex plot as such.\r\nIt is basically the 'Defeated' detective Yuuki Shinjurou and his assistant/boss Inga solving mysteries.\r\nThe first few episodes are quite boring from the mystery point of view and are more into introducing the characters. In these few episodes, the culprit seems quite obvious and the only reason to watch them is to be able to understand the final few episodes.\r\nEpisode 7 onwards(if I remember correctly), the main plot involving the Bettenou is revealed. These last 5 episodes were the reason why I liked UN-GO as a mystery genre animebecause these were the ones where the culprit wasn't so obvious and with his assistant/boss not by his side anymore, Yuuki Shinjurou was completely dependant on his own skill to figure out everything.\\n\\n\r\nOverall, this anime could have been a lot better if it had a better plot and not-so-obvious culprits. (However, it might be that I was able to figure out who the culprit was, after having read so many mystery novels XD)\\n\\n\r\nBut jokes apart, it was not as good as the other mystery genre animes I have watched so far. I would recommend you to watch this before starting any mystery series because this one doesn't have a very complex story line like the other mystery genre animes out there. \\n",
            "date": "2013-01-13T06:35:00+00:00",
            "helpful_count": 4,
            "mal_id": 83539,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2029361.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SAM10795",
                "username": "SAM10795"
            },
            "url": "https://myanimelist.net/reviews.php?id=83539"
        },
        {
            "content": "“Tell me. Why do you search for the truth?”\r\n“For souls!”\r\nThe above question is asked by the ‘Great Detective’, Kaishou Rinroku. He gets the lively reply from the assistant of the ‘Defeated Detective’, Inga.\r\nThat pretty much sums up the plot of Un-Go – an anime based on Sakaguchi Ango’s novel “Meiji Kaika Ango Torimonocho” (which I have not read) made by the studio Bones in 2011.\r\nBefore I get to the actual review, I must first talk about how I found Un-Go in the first place. I was searching for a random anime to download from a rather long list. As I quickly scrolled down skimming throughthe various names, Un-Go caught my eye with it’s bizarre name. Without even taking a look at the synopsis, I downloaded and watched it in one go.\\n\\n\r\nNow when I say that I binged it in a single night, I don’t mean that Un-Go is utterly fantastic or anything like that. It’s an above average show. When I saw the name of the studio (Bones – as stated above), I thought to myself that I was in for a treat. I was supposed to get a creamy chocolate sponge cake but, unfortunately, all I got was the cream instead. So sad.\\n\\n\r\nI immensely enjoy the mystery genre. I’m not a huge fan or anything of the sort. What I mean is that detective stories always fascinate me. Un-Go’s approach to the genre is somewhat… fresh, I have to say. It’s quite different from most offerings. So, I had fun watching it. But, being different doesn’t necessarily mean that Un-Go is really good. It’s kind of a mess.\\n\\n\r\nLet me explain. The world-building is atrocious. I know. I know! World-building doesn’t really have much significance in the mystery genre as you’re supposed to keep at least some things in the dark at the end of the story. The problem with Un-Go is that a huge war of some kind has occurred and concluded. OK. That means things are bad and we have a lot of people committing crimes. Motivation for criminal activities. Nice. But, Un-Go does not tell you why the war has exactly happened, when has it ended, whose victory was it (Japan’s loss is subtly hinted at), and who was it fought against. No clue whatsoever. For a show in which ALL of the cases have a connection the war, the answers to these questions are very important! People won’t enjoy the story if they’re too busy worrying about the Goddamned war. The way I see it, it’s just lazy writing. And that is very bad.\\n\\n\r\nAnyways, the show is basically about Yuuki in denial as to why he wants to reveal the truth (solve cases) and his goal of revealing the supposed crimes of Kaishou, his rival. All the different cases involve these two guys.\\n\\n\r\nTo the cases themselves!\\n\\n\r\nI won’t go into details about the cases because, uh, well that would defeat the purpose of watching the show. What I will say is that the pace at which the cases are solved at are really fast. I don’t have a problem with that. I’m used to quick dialogue and bad directing (1.5x playback speed!) But, others might. People like to take jabs at solving the cases themselves in detective stories. It’s part of the fun. If you have jumping scenes and dialogue with a lot of technical followed the problems brought forward with the non-presentation of information about the war in the show: people can’t do that!\\n\\n\r\nAnother problem is that when the cases get solved by Yuuki, the truth is all hushed up by Kaishou. Wow. After the first few cases, you begin wondering why Yuuki even bothers at all. You don’t get an answer. The show has an open ending. Nice~ Things are silenced for the greater good. I get that. Surely, Yuuki does to. But, seeing as Yuuki has seen some shit and has a somewhat cynical outlook he should at least try for no cover-ups. He doesn’t though and that, my friend, is bad characterization.\\n\\n\r\nSpeaking of which, most of the recurring characters in Un-Go are pretty one-dimensional. Well, they seem like that to me. Except for Yuuki and Kaishou, everyone else seem like beautifully crafted cardboard cutouts. Won’t talk about Kaishou much because that would spoil the anime. Can’t talk about Yuuki more than what I’ve already said because, even by the end, we still don’t know his past nor how he and Inga, his assistant, gain fame as detectives.\\n\\n\r\nSpeaking of Inga, Un-Go has supernatural elements in it. Inga is a… monster(?) of some sort. I say ‘some sort’ it’s never revealed what she actually is. How she meets Yuuki is literally the last few lines of the show. Jesus. Another thing kept in the dark. At one point, I began to think everything and everyone except for Yuuki and Kaishou was a fucking plot advancing tool.\\n\\n\r\nAnother thing that irks me that Yuuki isn’t all that great a detective anyway. In fact, the way he solves crimes, it might even be considered entrapment. Inga can make people answer one question. It’s a power of hers. And so, when she asks a question, people confess. Good Lord!\\n\\n\r\nAnimation is crisp, clean, and colorful. Just how I like it. The character designs are rather different than what you usually see and that’s a good thing too. Though, sometimes, I think everybody looks a bit too tall???\\n\\n\r\nNothing to say about the voice acting.\\n\\n\r\nThe music is also nothing special. The Opening was headache inducing. The background music wasn’t anything I’d praise. Well, I guess that guitar track was pretty good. The Ending… Wow. The Ending song was marvelous and the visuals were spectacular. Already listening to the full version as I write this.\\n\\n\r\nOverall, I give Un-Go a 7/10. It’s a decent show. It deserves a 5, actually. But, it tried to do something new-ish (at the time) so I’m not going to shame it for that.\\n\\n\r\nRecommended for mystery and detective fans only.\\n",
            "date": "2016-06-19T16:28:00+00:00",
            "helpful_count": 3,
            "mal_id": 221220,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3356717.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ReJaKted",
                "username": "ReJaKted"
            },
            "url": "https://myanimelist.net/reviews.php?id=221220"
        }
    ],
    [
        {
            "content": "I just finished watching the English dub of this about 5 or 10 minutes ago, during the time I'm typing this, and I believe this may be the best anime I have watched so far this summer. Well, I've only watched Shinsekai Yori (which is another great anime I would highly recommend to anyone who liked more, if I daresay, adventurous anime series) so far this summer so I probably shouldn't say that. \r\nThe reason I say it's such a great anime is because the main character isn't completely steriotypical and the other characters introduced have very interesting personality traits. It also has a smallamount of humour, in my eyes, that, if you're a fan of Inga, you should be able to get some laughs out of. \\n\\n\r\nThe second second reason I find this as such a great anime is because of the way they dealt with the concept of the \"truth.\" Most animes I've heard of dealing with the \"truth\" don't exactly show both sides, but UN-GO does. By that I mean, some show both sides but are definite about the truth and how the truth is always what the main character thinks. In UN-GO it just straight out says something along the lines of \"different people have different truths and those truths aren't always correct.\" \\n\\n\r\n(I'm sorry if I sounded crazy with the way I explained things but it's really early in the morning and I haven't slept since yesterday. Thank you for reading this and, once again, my apologies for probably sounding dumb or stupid)",
            "date": "2016-06-03T00:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 219885,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4973210.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Rei-ncarnate",
                "username": "Rei-ncarnate"
            },
            "url": "https://myanimelist.net/reviews.php?id=219885"
        },
        {
            "content": "Un-Go can particularity be characterized as one of by biggest disappointments right along with Toradora!, Shinrei Tantei Yakumo and Eden of the East movies.\r\nThe story of this anime is solid (at least in the beginning)  and the futurism appeals to me. The protagonist knack for solving mysteries and the unfairness of others stealing his credit was all very interesting. However the pacing, of the reveal and generally of the anime, killed it. By the end the story just didn't make sense and it felt like there was no real progress made from the promising beginning. \r\nI expected Un-Go to be a mix between MajinTantei and Eden of the East, however it ended up being Shinrei Tantei Yakumo, a promising story and characters without following through. Truly a wasted potential. \\n\\n\r\nHowever, as in any disappointing anime, perhaps it was the subjective feeling of expecting too much that really got to me. The art was good and the sound even better, Blue Light Yokohama stuck in my head for the whole month! Still, as I stated, and will again, no art or sound can compensate for lacking in story and characters. I was truly disappointed. \\n\\n",
            "date": "2015-10-06T13:33:00+00:00",
            "helpful_count": 3,
            "mal_id": 200656,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4907742.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/windsweapt",
                "username": "windsweapt"
            },
            "url": "https://myanimelist.net/reviews.php?id=200656"
        },
        {
            "content": "While some people say it's very thin in terms of giving you a backstory but I feel that it's part of the show, that you get given glimpses of the past (similar to some of the side characters). It's true though that the first few episodes are really just down to guesswork, but as the show progresses the puzzles and clues start to up their game. The soundtrack is very nice along with the art, the ending credits feature a song from the re-formation of the band Supercar, the song being incredibly fitting towards the rest of the show.\r\nIt must be said, however, that thisanime's biggest flaw is that it feels incomplete; the plot of the past is missing, even after finishing the show. Again though, this is more of a 'human' issue than a 'critic' issue in that the problem is how short it is, thus leaving you with a desire for more.",
            "date": "2011-12-23T13:49:00+00:00",
            "helpful_count": 3,
            "mal_id": 49945,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DARKNESSxEAGLE",
                "username": "DARKNESSxEAGLE"
            },
            "url": "https://myanimelist.net/reviews.php?id=49945"
        },
        {
            "content": "The plots of the different mysteries could use some improvement, but it's not that bad...\r\n... AND BOTH PROTAGONISTS OOZE SUCH AWESOMENESS... that I'd forgive much, much weaker plots.\r\nIn the end, I loved this series for the post-war & government conspiracy atmosphere, and for the protagonists : Shinjurou, indifferent to his poor reputation, conflicted between his faith in and his disgust of humanity. And Inga, mysterious and  delightfully terrifying character. I also love their relationship, between dependence, complicity, intimacy even... and domination/subordination...\r\nI absolutely loved those two. Rinroku, as the 'chessmaster' behind (at least part of) the conspiracy, is an extremely interesting character as well, witha lot of potential. Kazamori, very true in her/his/its persona of artificial being that somehow 'grows' a soul because of her/his/its 'almost human' state of existence is also a very enjoyable character.\\n\\n\r\nI must confess, the other few recurring characters either get on my nerves (Rie) or are a bit useless (police people). But with such great main characters, that's really not much of a concern. (If they could get rid of Rie, I would be thankful, though...)\\n\\n\r\nIn the end, I had a lot of fun watching this series, and I really really really REALLY hope there's gonna be a sequel... ;D",
            "date": "2012-09-01T15:19:00+00:00",
            "helpful_count": 2,
            "mal_id": 71353,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1346651.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Pebble_",
                "username": "Pebble_"
            },
            "url": "https://myanimelist.net/reviews.php?id=71353"
        },
        {
            "content": "Minor spoiler alert idk if they really count as spoilers though\r\nWhen I read the summary for this anime I was really confused so lets get a few things straight that may have just been me but I'll say it anyways. 1. Yukki is the MC with his assistant Inga 2. He's basically known as the \"Defeated Detective\" because publicly he's always wrong 3. His assistant isn't uniquely talented it's something different. She's not like a genius or something even though she is smart \r\nStory: It was pretty good though the mysteries often rushed the resolution. If anyone has ever watched Detective Conan or Case Closedthey had the crime happen pretty quickly in the first 5-10 minutes and quickly got to clue gathering and there's a more in depth explanation and the audience can really feel the mystery. This anime doesn't really do that it's more like discover and solution at the same time. However, there was a nice little plot twist at the end though it kinda turned into DBZ & TG mix for a minute. \\n\\n\r\nArt: It was pretty average. At first I couldn't stand Yukki's face but then afterwards I got used to it. \\n\\n\r\nSound: I really enjoyed the mystery solving soundtrack that always made me excited and reminded me of when my computer spazzes out lol. The beginning and end theme were nice too and the voice actors did a good job. \\n\\n\r\nCharacter: I didn't really get attached to them. Yukki's a little bit of a sore loser and Rie is changes her mind about him so often it annoys me. The short hair investigator is kinda obsessed with Kaishou and that was a little irritating too. They don't really grow or show development and when they start revealing one of them's past the scene changes -_- \\n\\n\r\nOverall: The story was so-so, the art was so-so, the sound was good I liked it, and the characters were meh. I've said so many bad things about it, but I couldn't bring myself to dislike it because of the very end twist and I really liked what Yukki said about humans. The mysteries weren't that bad even though they were rushed. It was all unexpected so that was good. They could've done better with the pacing and a little bit of the character but overall it was pretty good. This is a hit or miss anime. There's nothing great about if some of its charm really struck a chord with me and I think I used that wrong oh well. You just have to wait a little for serious plot action to happen. I think they realized they rushed things and slowed the mysteries down at the little because at the end I was totally absorbed. \\n\\n\r\nSo if you like an oddly paced anime with strange but somewhat lovable characters (Ingaaaa) and great sountracks I think you'll like it. \\n\\n\r\nSorry that review was so bad lol.\\n\\n\r\nThat's all thanks for reading ^~^",
            "date": "2016-04-07T19:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 215785,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5292091.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kittycats468",
                "username": "kittycats468"
            },
            "url": "https://myanimelist.net/reviews.php?id=215785"
        },
        {
            "content": "As of this review, I have just finished this series and decided to give it my own review. I would like to keep it brief and, although it will be opinionated, concise as possible. Without further adieu, lets get into.\r\nStory: 6\r\nYou read the synopsis just as well as I so you should sort've know what you're in for. The storytelling, albeit fast-paced, is actually written decently in my opinion. While each mystery was fun to solve in it's own right (fan of the mystery genre), until the later half of the series, they are all somewhat predictable; effectively causing the reveals to be little morethan explanations for those who couldn't figure it out. All in all, as a mystery piece is wasn't too bad and as a story overall, I believe you'll be drawn to it if you stick around for episode 5+.\\n\\n\r\nArt: 7\\n\r\nLong story short, the art was better than average and aside from the pointy chins, as others have pointed out, it was well animated and had some very nice sequences towards the finale.\\n\\n\r\nSound: 8\\n\r\nSo the soundtrack, which for me consisted of the opening theme, ending theme, and the climax theme (Spanish flamenco as one user put it), was well done. I'm a huge fan of the ending theme for being catchy despite my american tongue falling over the lyrics to it. As for the climax theme, the little tune was literally my favorite part of the show and the only part i paid attention to during the first few episodes. Again, all in all, wonderfully scored.\\n\\n\r\nCharacter: 5\\n\r\nSimplified and to the point, aside from Inga and Kazamori, the rest of the characters were either bland with no development or developed into something cliche. Without providing spoilers, most are very cliche in their roles for the plot and aside from the last 3 episodes I was very bored with their development as a whole. Despite that last sentence, I found nearly everyone of them like-able in their respective roles.\\n\\n\r\nEnjoyment: 7\\n\r\nAs you can tell so far ( at least I hope), despite how the review came off, I thoroughly enjoyed this series. It captivated me with its music, intriguing way of spinning the stories each episode was based off of and overall telling of the conflict between the searching of necessary  truth and the telling of necessary lies.\\n\\n\r\nSo overall the show gets a 6.6 from me, which rounds to a 7 here. Give it a chance. You just may find yourself captivated by the more underlying themes I failed to mention in this review! :P",
            "date": "2016-01-11T19:32:00+00:00",
            "helpful_count": 2,
            "mal_id": 208308,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5122572.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Shadowleone",
                "username": "Shadowleone"
            },
            "url": "https://myanimelist.net/reviews.php?id=208308"
        },
        {
            "content": "So I've been on this site for awhile, and have spent most of my free time watching anime non-stop...I've seen alot that were ok, but recently, upon a friend's suggestion, completed Un-Go.  This is the first time I have ever taken a moment's pause to say \"Wow, this is the best anime I've ever fuckin seen\".  Not since my first experience with anime, Akira, have I ever had my breath taken away by an anime.\r\nFirst the art style...This anime is reminiscent of Aeon Flux, with it's elongated profile and features.  Immediately, I was captivated by the depth of the animation style, everyframe could be considered art.  Attention is drawn to these elongated features, not to distort the human form, but to draw the viewer further into the immerse plot and character development (which is mysterious and vague, further enticing the viewer to watch future episodes to figure out just what the hell is going on).\\n\\n\r\nSecond the plot...I was on episode 4 before I realized, \"I have no fucking idea what is going on.\"  It was a much needed diversion from the stereotypical ecchi anime I've grown accustomed to, with their contrived plot and fan-service \"bathing/swimsuit\" episodes (not that I'm complaining).  Character development is vague. But that doesn't take away from the story, but serves as a mechanic to draw the viewer into the series.  What is the relationship between the \"defeated\" detective and his assistant?, how do they relate to society, how does their timeline relate to the timeline of the anime.  These questions drove me to devour this series and left me wanting more.\\n\\n\r\nThird, the characters...I'm use to pretty 2 dimensional characters; the protagonist has a problem, he/she has some ability/power that gives insight into problem; he/she is surrounded by supporting characters that lend insight into how to solve protagonist's problem.  However, Un-Go series acts like it is some inside joke that we, as viewers, are not privy to.  The first episode seems to start where normal anime would start mid series.  Rather than frustrating, I found this to be a refreshing \"breath of fresh air\" in a world of contrived and repeated plots.  I was always at the edge of my seat, trying to guess what would happen next and often being proved wrong.\\n\\n\r\nBottom line...I have recommended this anime to everyone who will take a  moment to listen to my praise.  Give this series a shot.  There is a 40 minute OVA prequel that is supposed to explain a little of the back-story. I'm frantically looking for it now.  I recommend you watch the series first to get hooked, then join me in my obsessive quest to learn everything you can about Un-Go",
            "date": "2015-03-05T16:45:00+00:00",
            "helpful_count": 2,
            "mal_id": 181775,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4347049.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LincolnsLuck",
                "username": "LincolnsLuck"
            },
            "url": "https://myanimelist.net/reviews.php?id=181775"
        },
        {
            "content": "****SPOILER FREE****\r\nTo use a culinary simile, UN-GO is a show that's like a Chilli Bowl challenge. You go into it thinking it's going to be really hot and spicy, after a few spoonfuls you realize it's not that spicy, then suddenly the heat creeps up on you and gives you a kick in the taste-buds and by the end you're left with a feeling that the challenge was not quite up to your expectations, but it wasn't a disappointment either. \r\nUN-GO takes place in Japan after the end of a war that has left the country devastated (as if this theme hadn't been used enoughalready). The current period of uneasy peace is kept in check by the Prosecutors Office working in conjunction with JJ Systems, that control and monitor all forms of digital information and data-sharing throughout the country. In this Orwellian nightmare we find our protagonist \"The defeated detective\" Shinjuurou and his partner/boss Inga, solving crimes that have left authorities baffled (which happens surprisingly often) with a mix of clever deduction and a touch of the supernatural. \\n\\n\r\nIn my opinion, UN-GO presents a solid premise for a good Paranormal/Mystery show but gets lost in translation somewhere along the way. At times the elements revolving around clever detective work are the focus of the episode and sometimes it's only about the paranormal elements. The only time both elements are perfectly balanced are in episodes 7 & 8 and as a result, those two episodes are by far the highlight of the series. In fact, the opening episodes are your average mystery-of-the-week stories which certainly tax your patience. However, from episode 7, the show really comes into it's own and the imbalance between Mystery and Paranormal elements is greatly improved. \\n\\n\r\nI have not as yet seen Episode 0: Inga Chapter, which is a prequel to the series, but currently my biggest criticism for the show is that dynamics and interdepartmental tension between various governmental organizations is never fully explored nor explained. Everybody seems to be weary about who/what they talk about in this post-war period, but adequate explanation isn't provided except for the fact that certain people/topics (and in one case a Girl-band) should not be discussed publicly and especially not on social-media lest you get a visit from the people in the Prosecutor's office, brandishing hand-cuffs. I hope Episode 0 will shine some light on this matter and elevate my opinion of the show somewhat.  \\n",
            "date": "2017-07-04T04:24:00+00:00",
            "helpful_count": 1,
            "mal_id": 251909,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5006740.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DemonKingRavan",
                "username": "DemonKingRavan"
            },
            "url": "https://myanimelist.net/reviews.php?id=251909"
        }
    ]
]