[
    [
        {
            "content": "This review is going to be based from the point of view of someone who has already seen season one. I have already written a review for season one that you should read if you are new to Dog Days. If you are just going to be getting into Dog Days for the first time, please make sure to watch season one first. You may think this is obvious, but because of the weird naming scheme of the show and it's current streaming conditions in the west, it can really be confusing to newcomers. Season one is called \"Dog Days\" and season two is \"DogDays'\" or \"Dog Days Dash\". As of this writing, there is no legal way to watch season one streaming, as Crunchyroll is only streaming season two. I feel as if many reviewers are going to watch season two thinking that it is a fresh new anime series and are going to be confused by who these characters are and what is going on. \\n\\n\r\nPlease, if you want to get into the franchise and don't want to download fansubs or import the blurays (they do come with English subtitles), don't just get impatient and skip season one. Make sure to let Crunchyroll know how bad you want season one streaming, and let Aniplex, Funimation, or whoever know you want it in a domestic boxset. It's a fantastic franchise and the lack of a legal season one stream is very disappointing and is only hurting the revenue and chances for future seasons.\\n\\n\\n\r\nSTORY:\\n\\n\r\nSeason two starts off where season one left off. Shinku gets summoned back to Flonyard but this time thinks it's a great idea to take his friend Becky along, and Nanami gets summoned by Galette and taken to Flonyard. \\n\\n\r\nRight off the bat the first arc is all one giant battle. Shinku fights for the Biscotti Republic, Nanami fights for Galette as their new hero, and then Becky is abducted by the new country of squirrel people called \"Pastillage\" to be their hero. The battles are just like last season with countries receiving points for knockouts and clothes-ripping hits, but this time with three countries instead of two, and three heroes instead of one. The season is filled with random adventures and lots of magic as well as new characters and mahou shounen/shoujo super moves.\\n\\n\r\nIn the Dog Days fandom, there seems to be two types of people: those who liked season one because it had over-arcing conflict (Shinku not knowing if he can get back to Earth, as well as the giant monster at the end), and those who feel that the first season was slightly ruined by the forced drama of the tacked-on monster and just wanted to have wacky Flonyard hi-jinx. People who just want wacky hi-jinx and battles are really in for a treat with season two. When there aren't battle episodes, the series is filled with self-contained episodes that have a small conflict and is usually resolved quickly. There is no real conflict, and the only drama in the season is one episode featuring  Eclair questioning her and Shinku's relationship and whether she should confess or not. There is still no fear of death. People following the show initially thought that they would be introducing a big bad character mid-season due to the character's portrait being shadowed in the opening, but that character turned out to not be so bad after all. If you are watching Dog Days Dash hoping for edgy drama or conflict, you will be disappointed. \\n\\n\r\nSeason two is all about world-building, new characters, and battles. Masaki Tsuzuki more than likely knew when he was writing up season two that he was approved for a season three already and decided to use season two to be light-hearted and build into a more serious third season.\\n\\n\r\nEveryone in Flonyard is still nice, the monsters are mischievous, the giant birds still look like chocobos, and the story is still about fun and excitement and not about being dark. \\n\\n\\n\r\nART AND ANIMATION:\\n\\n\r\nSevenArcs did a pretty decent job. Action sequences are really fast-paced and exciting and the art is good when it needs to be. Season one had an absolutely amazing concert scene late in the season that I was hoping we would see more of in this season, but sadly even though we got two concerts both were lackluster. \\n\\n\r\nSeason two gets a mahou shoujo transformation scene with animation by Kou Yoshinari and Studio Silver. The scene blew me away the first time I saw it as it felt so out of place with the rest of the episode. Sadly, while much of the sequence was amazing, it was also filled with quite apparent CG, and some fans including myself felt that the scene was too overly sexual to put in a show like Dog Days. Still, that sequence, coupled with a short sequence of fighting between Eclair and Leo later in the season, were my favorite sequences. \\n\\n\r\nThere are many frames where if you stop and pay attention to the background characters, they are drawn so terribly, you can't help but laugh. Also, season one's generic-faced soldiers return, and you can see copy-pasted people in several panning shots. I watched most of the high-action sequences at 25% speed so I could catch frames both good and bad. There are many really interesting and truly gorgeous key frames in many of the sequences, but just as many hilariously bad inbetweens. They have some work to do for the bluray release.\\n\\n\r\nAs far as character design and costumes go, Dog Days is absolutely stunning. All the characters are really unique and well thought out. We get a new race of squirrel people, and they all have big bushy squirrel tails as they should. Nanami and Becky's hero outfits/barrier jackets are stunningly designed with really cool colors, and even the generic soldiers even have neat looking uniforms. The characters even get turned into their younger/older selves in an episode and they are all given new clothes and look appropriate. Whoever did the costume design for this series is a genius. As someone who has watched Nanoha, you can really tell the Nanoha-esque resemblance in the designs. I cannot think of a single costume or humanoid character design from the second season that I dislike...except the catgirl-god from episode eight. She was just ugly on all fronts.\\n\\n\r\nAs far as the monsters and animals in Flonyard go, they are just passable. Season two sees the return of Brioche and Yukikaze's group of ninja-dogs, but many times when they are on screen they are drawn poorly. We get a new giant dragon that is honestly rather underwhelming as he's a boring grey color and looks like one of the Weapon-type monsters from Final Fantasy. We get new giant birds that this time fly and they just look like giant canaries and make cute squeaky bird noises. We even get a race of monster rabbits that just look like really chubby stuffed rabbits.\\n\\n\r\nSeason two kept up the unique art direction season one had, and the bright shiny colors kept me smiling and feeling that the brightness was very appropriate for an anime where everything is happy. Overall, the art was very good.\\n\\n\\n\r\nSOUND:\\n\\n\r\nThe opening is done by Nana Mizuki who voices one of the new heroes and Ricotta. The ending is done by Yui Horie who voices Millhiore. Millhiore also has two concert songs this season. They really aren't trying to hide the fact that Dog Days is a show to help promote album sales. Still, Fearless Hero is an amazing track that compliments that opening animation and let's you know this is a show with plenty of action and adventure. Yui Horie's song is simply played as the ED over a scrolling cast of chibi characters.\\n\\n\r\nThe rest of the soundtrack is just there. Most of the music I remember hearing in season one is back, which isn't particularly a bad thing because the music they play when the action gets going is very hot-blooded and fun.\\n\\n\r\nThere are absolutely no complaints about the voice cast. The all-star cast from season one returns, and on top of that we get Aoi Yuki as the new squirrel princess, as well as Eri Kitamura, Kousuke Toriumi, and others. Aoi does an amazing job being the high-pitched annoying excitable squirrel, as you would expect from a small rodent. Nana Mizuki returns as Ricotta and continues to make me smile every time she says \"de arimasu~\" after a sentence. Eri voices a new older character that says \"nanodesu~\" quite often. The voices are an absolute pleasure to listen to and I'm curious as to what talent they will get for season three.\\n\\n\\n\r\nCHARACTERS:\\n\\n\r\n If you loved season one's characters, you will love them all over again. Shinku is still a hotblooded athletic hero that just wants to have fun, Millhiore is still the cute princess, Leo is still a warrior-queen, Brioche is still a refined older lady, Yukki is still cheery and has giant breasts, Ricotta is still a wacky genius, etc. \\n\\n\r\nThe new characters are hit or miss. Becky and Nanami I initially thought were going to be terrible characters. I thought Backy was going to be the jealous third-wheel, and Nanami was going to be Miss Perfect. Surprisingly, I really enjoyed both of them. Nanami in her hero form fights with ice/water skates and a staff and has an absolutely amazing costume. She really reminds me of Subaru from Nanoha StrikerS. Becky becomes sort of a witch and rides around on a magical broom and shoots magical spellcards like in Touhou. Becky's costume is also really neatly designed (I'm a sucker for orange).\\n\\n\r\nWith the introduction of a new country of squirrels comes a new squirrel princess. She seems to always be constantly bored and looking for other people's business to butt into and drags her soldiers into other people's battles and generally gets in trouble. She has two main soldiers with her, Caraway and Riselle, who while seemed to be really neat characters when they were in the initial battle, were hardly on screen past that.\\n\\n\r\nThere's also an ancient human Hero King, Adelaide, that is actually a woman voiced by Eri Kitamura who fights with a magic pistol and sword. She is accompanied by a demon king named Valerie and the two of them are sort of a couple, possibly even going as far as being married. Adele is the typical jealous girl character that hates when her significant other looks at other women, which happens often because Valerie is a pervert. She threatens him with violence, and the schtick gets really old after the second time. Adele has sort of a neat white and yellow color scheme with blonde hair and star-shaped pupils, while Valerie is a big tall super-muscled guy with a dark color scheme and what seems to be a corrupted squirrel tail. They really do not go much into their history, which left a lot of fans hoping season three will give some answers about their relationship.\\n\\n\r\nSeason three also introduces Brioche's brother Isuka, a traveling swordsmith/samurai. He's very calm and collected much like Brioche, and lets onto a little bit of back story about Brioche's true name and a bit of her history. I was disappointed he didn't play a more important role.\\n\\n\r\nAs far as development goes we do see a bit. As stated earlier we get backstory about Yukikaze and Brioche. We also find out a tad more about their world and summoning and the possibility that there have been Flonyardians that go to Earth. Millhiore and Shinku don't get much development in their relationship, Eclair has roughly half an episode dedicated to her and her feelings for Shinku, and Becky and Shinku's relationship is only slightly developed at the end. Shinku is being a pretty great lead character as he's not giving into any of their obvious advances, and plainly acknowledges that he knows about their feelings, but he has better things to do. I found it pretty impossible to hate Shinku, especially seeing that there are enough other characters getting screen time this season that the story wouldn't always focus on him, which prevented him from turning into a character I just want off the screen. \\n\\n\r\nDog Days Dash was very character driven, even though many characters could have been fleshed out more. They introduced so many amazing characters, that many times I just wanted them to stop introducing characters so they could expand upon the ones they already have. This is a huge flaw of the franchise as a whole and I think really goes back to how Masaki Tsuzuki creates his worlds. He did the same thing with Nanoha where there was this big cast of really cool characters, but after he introduces them as being really cool characters, he likes to forget about them. It's almost as if he prefers to create characters rather than create stories for his characters, and it hurts Dog Days as a whole.\\n\\n\\n\r\nOVERALL ENJOYMENT AND OTHER CLOSING THOUGHTS:\\n\\n\r\n I really enjoy the Dog Days franchise. I've watched the first season four times, and so far have watched season two's episodes twice each. I'm going to watch them again on bluray to see what they changed, as well as watching it again if it ever got a dub.\\n\\n\r\nTo me, Dog Days continues to be a breath of fresh air in the world of stale novel and manga adaptations and edgy shows for teens. Sure, Dog Days has tropes like a slight harem element, it has fanservice, it has animal-eared and tailed characters (which to me only adds to their charm), and at it's heart it's a shounen. Where Dog Days Dash excels is being a show you can sit down, turn on, and be transported to a happy world with fun characters, fun magic battles, innocent character interactions, and (here I go using that \"F\" word again) fun wish-fulfillment for fans burnt out of typical shows who want to feel like they're are watching something created so that you can feel good and happy watching it, not feel as if you have to root for or against any particular faction, or wonder if your favorite character is going to die.\\n\\n\r\nIf you haven't watched season one, do yourself a favor and go do so. If you are on the fence after watching season one as to whether you should watch two, then of course give it a watch. There's less plot this time around and less conflict. With season two, I believe Masaki Tsuzuki knew he was green-lit for a third season so he decided to use season two as the world-building filler in-between two more semi-serious and conflict-filled seasons. The final episode of Dash strongly hinted at another season, and with all of the press and promotional work it has been getting, as well as the solid bluray sales and more merchandise on the way, you can bet you aren't getting involved with a dead franchise. I'm eagerly awaiting a North American release.\\n\\n\r\nDog Days Dash isn't the perfect sequel so many people were hoping for, but when you go into it expecting character-driven action-adventure cute fun instead of grimdark plot, it's as perfect as a franchise like this is going to get, and that's good enough for me.",
            "date": "2012-09-29T15:51:00+00:00",
            "helpful_count": 51,
            "mal_id": 73643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1091685.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GregZor9",
                "username": "GregZor9"
            },
            "url": "https://myanimelist.net/reviews.php?id=73643"
        },
        {
            "content": "Dog Days is one of those series  (1st season and 2nd season) where you either love it because of all the fun it has and how light hearted it is, or you hate it because it seemingly goes nowhere (this applies more so to the 2nd season).  But whether you love it or hate it, there is no denying that Dog Days is good at what it tries to do.\r\nFor the second season of Dog Days, Cinque is summoned back to the world of Flonyard along with his close friend Becky and cousin Nanami. This time, however, each side gets their own heroto even things out. Throughout each episode the characters experience some humorous ordeals or partake in a “war”. \\n\\n\r\nThere are numerous differences between the first and second season. The biggest difference is that the second season does not contain an underlying plot like the first season. However not every series needs a plot to succeed and the second season of Dog Days is an example of that. Each episode has a ton of funny moments and since something different happens every episode, most of the episodes are very entertaining. Another big difference is the addition of another country Pastillage. This addition did a number of things: added more characters, added variety to the “wars” and also helped with the comedy. Despite all these changes, the second season Dog Days is still very similar to the first season. The series doesn’t try for too much, it’s funny, it’s cute and most importantly it’s entertaining.\\n\\n\r\nThe art and animations are pretty much the same as the previous season. There are some very appealing visuals especially during battles and the character designs look very cute.\\n\\n\r\nThe opening and ending are also very similar to the opening and ending of the first season. The opening is very energetic, which describes the series very well. The ending is a very sweet song which I think is perfect for a conclusion to an episode. The voice actors also do a very good job matching the characters they are playing. \\n\\n\r\nFor this season, we don’t just have one hero, we have three.  Our original hero Cinque/Sink, is probably the weakest of the three heroes in terms of power level, but he still looking like Nathan Drake (just shows you how powerful these heroes are). Despite being the weakest hero, he is a great character. He never shies away from a challenge, he’s nice and he has great chemistry with all the other characters.\\n\\n\r\nThe other two heroes don’t stand out as much as Cinque but they do play a role during each episode. Nanami, who is Cinque’s older cousin, has a personality which is very similar to Cinque. She’s very energetic, doesn’t back down from a challenge but she’s also slightly stronger than Cinque. Becky, Cinque’s best friend and perhaps the most over powered hero of all, is very different from the other heroes. She isn’t very athletic but she does have a lot of experience with video games making her a hero with a different style from Cinque and Nanami (her hero form is like a witch). All 3 of them are very likable and are pretty good characters\\n\\n\r\nFor this season, the princess Millhiore doesn’t play as big as a role as she did the first time but she is still the same as the first season, soft-spoken, kind, can hold her own in battle and best of all very cute so I have no complaints. During this season Éclair really sticks out because she undergoes development which a pleasant surprise and also because out of all the characters in the series, she has the best chemistry with Cinque. There are also a bunch of new characters such as Couvert, Valerio and Adelaide just to name a few. Each character adds to the comedy each bringing a different personality to the table. I also like the fact that there is no jealousy war that goes on between the characters that love Cinque instead they are all nice to each other which I like because sometimes in other anime there is a jealousy war between love rivals which can get very annoying.\\n\\n\r\nDog Days (both seasons) is a very enjoyable series because it likes to have fun, it’s very light, very funny and every episode brings something different. However the series isn’t for everyone, it has no story and doesn’t seem to go anywhere. But if you are just looking for something to watch, Dog Days (both seasons) can be a very fun watch.\\n\\n\r\nOverall, even though the second season of Dog Days is different from the first, it’s still just as good. It’s not spectacular by any means but it’s still the cute and funny series that many would enjoy.\\n",
            "date": "2013-01-16T08:02:00+00:00",
            "helpful_count": 31,
            "mal_id": 83825,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=83825"
        },
        {
            "content": "An Exercise In Futility\r\nThat is really the best way I can describe the second season of Dog Days. While I felt the first season was sub-par and full of potential, this season denied the opportunity for this anime to have any potential. \r\nFor those that have seen the first season of Dog Days, you're not missing much with the second season. It is the same-old shtick with the addition of some new characters...completely unnecessary characters I might add. So where did this anime go awry?\r\nThe story. It is truly dreadful. Actually, that might be doing it a disservice because it is non-existent. This season picksup where the first one left off, Sinku takes Nanami and Rebecca with him to Flonyard and this time, Nanami becomes the hero for Galette and Rebecca becomes the hero for the newly introduced country of Pastillage. Couverte decides to enter Pastillage into the war games between Biscotti and Galette and it essentially becomes a three-sided war. Unfortunately, it doesn't sound as epic as it should. There is very little action in this \"Union Fest\" I believe they call it and the fight scenes that fans should be expecting are quite disappointing. It seriously felt like 2/3 of this anime was padding and fan service...and BOY is there fan service! Even more so than the first season which had a mild amount in its own right. One aspect I really didn't like was how it felt like Nanami and Rebecca were pros at the combat right off the bat. There wasn't any sort of struggle or buildup, it seemed like they were ready to go as soon as they got to Flonyard. It really took away any flare for the dramatic. \\n\\n\r\nI also did not find this anime very enjoyable just for the fact that the character interaction is extremely dry. Unlike the first season, there was no sense of drama or tension in this season. Everything was cookie cutter and dry. This felt like one, antagonizingly long episode of Barney the Dinosaur with all the I'm so happy, I love you moments. Throw that on top of the what felt like filler episodes made this a very difficult watch. While watching this anime (and even taking the very liberal stance Japan has with their media), I had several contemplations running through my mind. I kept asking myself, \"what's the target audience for this anime?\" The dialogue felt like it was for a middle-schooler or perhaps even younger while the content felt as though they were aiming for a HS to college age audience. Whatever it may be, it felt like it didn't work. The dialogue felt too childish for an older anime viewer like myself to enjoy while the fan service was raunchy enough to make me blush (kidding, but it's a statement that I wouldn't let my kids watch this). Unlike the first season, I had to really FORCE myself to finish this season and I really didn't feel the payoff by the time it was all said and done. \\n\\n\r\nSo with that being said, was there anything this anime did right? Sort of. I did like the artwork...albeit, there was a scene in Episode 2 where it felt like this anime suddenly jumped into the realm of magical girl hentai...and for those who have watched the anime know what I'm talking about. I thought the music was still pretty good for this season, although I'll admit I liked the music a little better last season. I will say that it is extremely hard to pinpoint the good things about Dog Days' because they were few and far between. \\n\\n\r\nOverall, I felt like Dog Days' was really 6 1/2 wasted hours of my life and probably the worst anime I've seen in 2012. The setup in the first season was actually much more dramatic than I expected and I felt if season two could capture the same sort of dramatic flare the mid-to-late sections of season one captured, it could've been a pretty decent anime. It didn't come close and honestly, it didn't even try. I have no idea what the writers were even trying to do with this season. I'm not sure if they wanted to try and make an epic setup for a third season or what, but season two was not even close to keep me invested in this series if it does continue.",
            "date": "2012-10-01T01:05:00+00:00",
            "helpful_count": 28,
            "mal_id": 73781,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=73781"
        },
        {
            "content": "---English is not my native language so I apologize in advance for all the mistakes(please provide me with some feedback), this anime had no reviews so I will attempt to write one---\r\nDog Days' is a direct continuation to the first season of Dogs Days, so if you enjoyed Dog Days the first, chances are you will also like the second season, since it follows the same concept but with newly added heroes, which just adds more fun to this amusing series.\r\nCinque is summoned once again to represent Biscotti Republic with his outstanding athletic abilities, but this time he goes back to Flonyard with Rebecca(friend) andNanami(cousin). \\n\r\nNanami also possesses extraordinary skills and she quickly becomes Cinque's rival when she is recruited as the hero to represent Galette. Rebecca, despite not being as skillful as Cinque and Nanami also joins the combat which as you may know is actually a friendly Olympic-like battle between the different republics in Flonyard.\\n\\n\r\nThe art is as good as last seasons';colorful, bright and flows smoothly.\\n\\n\r\nSound: The OP is performed by Nana Mizuki, what else could one ask for? Yui Horie sings the cute ED.\\n\r\nThe OSTs are fitting for each scene, upbeat for the combat scenes I've seen so far.\\n\\n\r\nCharacters:Cinque is still full of conviction,Nanami has confidence and Rebecca although shy at first shows promise of becoming a strong character. \\n\r\nPrincess Millhiore is as cute as ever and Leonmitchelli-sama still shows her prowess in the battlefield.Besides that, the characters show no evident changes. There is the newly added character Cou, Princess of Pastillage who gets along with Milly and Leo-hime and also participates in the battle events for her own country.\\n\\n\r\nThe seiyu are remarkable, the cast consists of Nana Mizuki,Yui Horie, Kana Hanazawa among other known voices.  \\n\\n\r\nI gave this show a 7(Good) since it is very enjoyable.\\n\r\nOtherwise if you are looking for a laid back series with action, this is perfect for you. \\n\\n\\n",
            "date": "2012-07-28T15:32:00+00:00",
            "helpful_count": 19,
            "mal_id": 67947,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1292725.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kurokami18",
                "username": "Kurokami18"
            },
            "url": "https://myanimelist.net/reviews.php?id=67947"
        },
        {
            "content": "I watched the first season of Dog Days, thinking that it wasn't so good, but had a decent story, cute characters with a cute design, and that it was entertaining enough to watch every week. And that a new season was a good thing.\r\nBut the second season is simply awful. The main reason for this is: there is no story. There is only a bunch of random episodic stuff. There is no tension, no danger. Only a bunch of kids playing, singing and giving some mild fanservice. I kept on watching every week thinking that there would be something to grasp upon. Something interesting thatwill make a real story.\\n\\n\r\nBut it never happened. No drama between the characters. All the girls like Cinque, and there is no problem with it. No political/magical problems that have to be solved with the sporty war, the competition this time is only for fun. Every problem is easily solved. No mean guy, and no big rivality.\\n\\n\r\nIf you want to watch something happy without any tension, watch a slice of life. If you want to watch a fantasy adventure, get the hell out of here. If you want to watch a harem show, there are more interesting ones with more fanservice out there.\\n\\n\r\nSo there is nothing there. I have the feeling I lost every minute I spent on this anime. Only the art was good, even the insert songs by Milhi were boring. If there is a third season of Dog Days sometime, I hope they will give it a story this time.",
            "date": "2012-10-02T11:41:00+00:00",
            "helpful_count": 13,
            "mal_id": 73913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/151981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/simakai",
                "username": "simakai"
            },
            "url": "https://myanimelist.net/reviews.php?id=73913"
        },
        {
            "content": "Dog Days Season 2\r\nGenre: Action, Adventure, Comedy, Ecchi, Drama (Minor - DESPITE what it tries), Romance (IF you can call it that).\r\nLength: 12 episodes, 24 minutes each.\r\nDog Days is about a athetic and OVERLY FEMINIE boy being yanked from our world, to fight in the wars of the magical land of Fronyaldo. Only, those wars are more like athetics events, and anyone who \"dies\", just turns into a cute little ball of fluff for a while.\r\nSeason 2 picks up with out hero Shinku (Or Cinque, or Sink, or Shink, Or Cink, or nutty von solo) returning to Fronyalda after the events of Season 1. Thistime he brings along his two best friends, Becky and Nanami.\\n\\n\r\nWithout spoiling anything, I will now say this. Dog Days SERRIOUSLY needs to get a grip on what it is. That is to say, a light hearted \"fun\" series. Thats what the wars are in its world, and it's what the anime itself should be. It always starts out like this, only to skew off toward the end. Unfortunatly, the first series though it could be a darker, demon fighting show, which it failed at. The second series seemed to understand that it wasn't that, but tried to focus on \"Character development\" and Ecchi. I'm not complaining too much about the ecchi (Although its downright redicolous that people who are \"defeated\" are suposed to turn into little fluff balls, but instead, just seem to loose their clothes now), but the \"character development\" is crap. It focuses too much on the girls carrying on about how they love Shinku, and not enough on anything else. Sorry Ladies, but I choose to believe (And I swear to god this is true) that Shinku is gay.\\n\\n\r\nAdd to that the whole introduction of two awesome characters who don't do a bloody thing, and you've got a mess of average battles and below average plot. The only redeeming quality. Beautiful artwork and some fanservice.\\n\\n\r\nI'm not being kind to Dog Days because I believe it fucked up something that could've been awesome fun. I recomend this series only because of its sheer \"non-seriousness\". Watch it inbetween anime series, like you'd chew gum between meals.",
            "date": "2013-03-27T16:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 91187,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/498260.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Overlord_A",
                "username": "Overlord_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=91187"
        },
        {
            "content": "With the new season coming in the Winter 2015 season, I thought to myself, hey, why not catch up on this quaint little series and the joy that it holds?  And so, with the totally unoriginal title, here's a review of Dog Days Dash.  (I assume the next one will be called Dog Days Dash Dash or something like that.)\r\nStory (7.11/10): The story of Dog Days follows up from its predecessor with a couple changes.  Compared to the previous season, our main protagonist Sink returns back to the magical land of Flonyard with two of his companions, his cousin Nanami, and hischildhood friend Rebecca.  It is here where the three go to the world where Sink spent some time in, and have a good time in the process.\\n\\n\r\nTo be blunt, this season really doesn't have much to offer.  It plays similar to a slice of life where it plays out without any drama or really dire events, which plays in huge contrast to the previous season where they added a plot and some drama.  The show sort of goes through a day by day process of storytelling where our three foreigner characters, them being Sink and his companions spend time with these nekomonomimi-type characters and spend their time as the heroes of three separate kingdoms.  By no means is this bad for the series, as the quaint day to day way of storytelling is well done and definitely fits the laid-back style that this series has, but it's not really something that we haven't seen before.  \\n\\n\r\nThat being said, this season does bring in some new things and characteristics about the world of Flonyard.  As the audience, you do get to see more about this fantasy world and learn a little bit more about it.  The fact that the show built up the world that it was presenting to us a little bit more, made this season a little bit more developed than the last one.\\n\\n\r\nOverall, Dog Days Dash doesn't really build much after the first season aside from bringing in new characters and new scenarios.  The same idea of war that Flonyard has, as well as the relationships that the characters share stay relatively the same with little to no change.  If you've watched Dog Days, the series' first season, the second season is essentially the same, but with less drama.\\n\\n\r\nOverview:\\n\r\n+  Good laid-back feel\\n\r\n+  Show builds up the world a little bit more.\\n\r\n+/-  Day to day storytelling is nothing new\\n\\n\r\nCharacters (7.35/10): Now, I could go on and on about the characters in this series, but there's honestly just too many to really explain or detail.  So, here're a couple overviews on the characters.\\n\\n\r\nDog Days is one of those series that has an absurd amount of characters.  We have Sink, the princess of Biscotti Millefiore, Eclair, Ricotta, Leo, Gaul, Nanami, Rebecca, Couverte, etc.  And those are only the \"main\" characters.  As far as depth goes, you won't really know very much about who they are as a person.  Since the show mostly focuses on a day to day style of storytelling with characters spending time with each other, the only thing you really witness are the characters interacting with each other.  The characteristics for everyone is really only skin-deep, with very one note traits like Eclair being a tsundere, and Gaul being competitive as all hell.  However, even though these traits don't go beyond that one trait, it doesn't really impact the series very much.  \\n\\n\r\nIn addition, the show hosts A LOT of supporting characters like Yukikaze, Violet, the three members of Genoise, the captains of each kingdom's guards, as well as a couple new side characters added to the mix.  Similar to the \"main\" characters, these guys don't really have traits beyond a singular one that defines their personality.  Once again, it's not that this style of storytelling is bad, seeing as how the show regardless was still enjoyable to watch.  There is however a drawback to this.\\n\\n\r\nThe drawback I can see with this season's characters compared to the first season, is how little focus there is on one specific character.  Compared to last season where Millefiore and Sink were the prime focus of the season, Dog Days Dash puts basically every character on equal ground, with main characters getting sometimes as much screentime as the side characters, and supporting cast getting more screentime than they previously did.  This bothers me a little bit due to how Sink, the supposed main character of this series, feels a little numbed down in terms of character importance.\\n\\n\r\nOverall, the cast of Dog Days is wide and expansive, with every character getting relatively equal ground now rather than being put high above the other.  What I also find interesting about this cast is how easy it is to recognize them.  Usually with shows that have such an expansive cast, you would only be able to recognize maybe 5-6 of them rather than maybe 20-30 characters here.  They're all surprisingly easy to recognize and remember, which is definitely a plus for this show.\\n\\n\r\nOverview:\\n\r\n+ Easy to remember cast\\n\r\n+/-  No real main characters\\n\\n\r\nArt and Sound (7.22/10): The art for this series is what you would call very colorful.  Everything is done in a very bold color scheme, going towards the lighter side in order to give off the show's nonchalant feeling.  The art itself is not really extraordinary.  It's aesthetically pleasing, but it's not really a standout quality of the show.  \\n\\n\r\nIn addition, Dog Days does have its own brand of ecchi, which is somewhat odd in all seriousness.  Every so often, the show basically disintegrates the clothes off of its female characters, leading them to basically be out in the open wearing nothing.  Compared to the previous season, this doesn't happen that often, but it happens often enough to be completely unnecessary. \\n\\n\r\nThe soundtrack for the series is really nothing to write home about.  There aren't any standout tracks for the series, and everything sort of follows a very calm tone that follows the flow to the series.  They're decent tracks, but they're not really memorable.\\n\\n\r\nOverview:\\n\r\n+  Decent art\\n\r\n+  Decent soundtrack\\n\r\n-   Unnecessary ecchi moments.\\n\\n\r\nPersonal Enjoyment (8.38/10): Flonyard is an interesting place.  It has chocobos, wars that are basically like sport, if you're a hero, you get treated like royalty, you can have overpowered abilities, and everyone there likes to get petted like a pet.  Above all, you can be in Sink's place and be surrounded by girls from all kinds, and even get to sleep next to some of them.  Hell, I want to live in this place.  \\n\\n\r\nDid I like this show?\\n\\n\r\nYes, I did.  This show was an enjoyable watch.  While there are no standout qualities about it, Dog Days Dash did follow its predecessor in making a more calm and relaxing story similar to what I anticipated in the first place.  Overall, it was a nice show to watch, and there really aren't that many negative experiences from watching it.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nHonestly, there's not really anything to dislike.  Every episode features something new, so you're never really bored.  Above all, it's a laid-back show, and it really delivers with an atmosphere and feeling that reflect what the show was trying to do.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you're looking for something kind of laid back but still action-packed, or you're just a fan of animal ears like me, then this is a show for you.  Note, this is a sequel, so watching the first season first is advised.\\n\\n\r\nOverall Score: 7.44/10",
            "date": "2014-12-31T17:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 175475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=175475"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nLife can be hard. Going through university, working 30 to 40 hours, dealing with relationships, handling finances, the list goes on and never seems to stop. So there are times where you just want to take that quick little breather to just relax, even if it is for a fleeting moment. Dog Days Season Two is this \"breather.\" Amid the many shows containing intense drama, crazy action, or philosophical insight, this one is there to just enjoy it for what it is.\r\nSTORY\r\nDog Days Season Two takes place a few months after the conclusion of the first season. Thistime, Shinku, Rebecca, and Nanami head to Flonyard in order to enjoy the land and its people.\\n\\n\r\nThe joke last time was that the whole point of the show was the fighting. The battles were the focus, and everything revolved around them. While they are present this time around as well (a continent can't have a cultural turnover in the span of a few months, anyway), they are not what is important. Instead, the show adopts a slice-of-life style episodic story-telling theme in order to present us with varying situations that the characters find themselves in. Body switching, mazes, and bunny/cat thieves all make an appearance, breaking the monotony that the first season was mired in. I call the first season having \"focus\" on the battles, but in the sense that that was all it cared about. This season really focused, giving it much needed direction and reason.\\n\\n\r\nThis new focus allows the show to actually expand on the characters and the world they live in. Thankfully, it transitioned heavily away from being all about Shinku and giving the other main and side characters a shot. Many times, a group of them would be hanging out training or finding themselves in a precarious situation, giving the fans of these characters much-needed screen time. It's always difficult doing something like this, especially with a cast this large while adding even more to the mix, but I found this season to handle the overall screen time for each member quite fairly. At the same time, the various plots provide for at least a small amount of world building on many of the smaller details, such as the demons that inhabit the land or the finer intricacies of a country's inner workings.\\n\\n\r\nIf one really wants to dig deep, there is a purpose to the countries themselves. Biscotti represents the kind and the fair, Galette are the strong and the proud, and Pastillage are the cute and the energetic. All three have their strong and weak points. Yet the wars they have between each other are not for domination but for sport. Meaning it doesn't matter if your kind, strong, or cute, anyone has the chance to be a \"Hero\" in the world of Flonyard.\\n\\n\r\nANIMATION\\n\\n\r\nDog Days Season Two actually faults a bit in this category.\\n\\n\r\nThe art style remains almost exactly the same. No surprise for any show, really, since immensely changing the art style could potentially make very little sense. The character designs for the new characters are just as enticing and unique as the old characters' designs, so there isn't any problems there either.\\n\\n\r\nIt's not entirely noticeable, but there is a lot less animation going on comparatively. Perhaps due to the slice-of-life nature of the show where the battles are not that important anymore, there seems to be not a dip in the quality of the animation but just less of it in general. In other words, a lot more talking and sitting around versus running, jumping, and crossing swords from days of old. The opportunities were there, but perhaps due to time, budget, or both, the show just refused to showcase its animating talent.\\n\\n\r\nCHARACTERS\\n\\n\r\nThis new season brings back every single character from the first, while simultaneously introducing us to a slew of new ones.\\n\\n\r\nMany of the new characters are very forgettable, such as Hina's brother (the swordsmith) or the little cat thief. Others manage to make a distinct mark, such as Couvert (Pastillage's princess) and Adel (the \"Hero King\"). Couvert is pretty much just a \"moe-blob.\" She's insanely cute in the way she talks and how she acts, and is always looking to have a little bit of fun. Adel, literally the king of all Heroes, is a woman who is outwardly very refined and dignified but inwardly loves to do battle. In a way, season two was simply trying to \"fill the gaps.\" The cast of characters at this point is ginormous, so there is bound to be someone for everyone who watches the anime.\\n\\n\r\nMy favorite character from the show is Yukikaze...I think. My previous reasons for liking her mostly do to her contagious personality and great body are somewhat conflicted after learning a bit more about her past. Arguably speaking, though, the best character from the show is Eclair. I had disappointments with her in the first season, but this time, she actually excels. In short, she is one of the best examples of a \"tsundere\" character that I've seen in quite some time. Over the course of the show, she actually breaks out of her \"tsun\" shell and moves to the \"dere\" side in a believable and fitting fashion. I thought her character development was done quite nicely.\\n\\n\r\nEveryone else is hit or miss. You either love the trope they represent or hate it, because that is the extent of the characters. Luckily, Shinku does not have a commanding presence this time around, giving the rest of the cast the chance to at least demonstrate their tropes in full force.\\n\\n\r\nSOUND\\n\\n\r\nThe OP this time around is at least a smidgen better than the first season's, but it's still way too generic. The vocals are okay, the trumpet is loud, and the beat is simple.\\n\\n\r\nOnce again, the ED goes for a considerably softer tone. And also once again the ED is better than the OP for their respective seasons. The drum beats and song itself are still generic, but the almost-ending pause and quiet lead in into the song at least spice it up a bit.\\n\\n\r\nReiterating myself a lot here, but like the first season, the soundtrack for the show is mostly forgettable. Princess Millifiore sings a few songs, just like the first season, but they're more about their \"relevance\" within the show than they are about listening to them as single tracks outside of it.\\n\\n\r\nAs for voice acting, Aoi Yuuki does an above average job portraying Couvert. The rest of the cast either fulfill their roles or fit the new ones nicely enough. However, I still can't stand Shinku's voice. It just does not fit his character.\\n\\n\r\nENJOYMENT\\n\\n\r\nThere is no denying that the show is cute. All of their characters are designed to be so. As such, I often found myself smiling at the tail-wagging or when the Heroes are petting their respective leaders. It seems like a silly concept from the title alone, but given how non-violent Flonyard actually is, it's always fun to see the entire cast hanging out and having a grand old time.\\n\\n\r\nThe show tones down the fan-service quite a lot this time around. Also of note is the romance at play. It's in a weird spot. First, Shinku is quite dismissive, avoiding the question. Yet, he says, \"I love you\" to some of the girls, hugs them/holds hands, and compliments them. In other words, the dude is sending way too many mixed signals, and it gets rather grating. Of course, the girls involved aren't dismayed by this fact, but such is anime.\\n\\n\r\nOne small aside: Pastillage should literally win every battle. I mean, they have complete domination of the air. Sure, the countries have one or two flight capable devices or someone can launch projectiles, but having such control over arguably 50% of the map (thinking of it like a rectangle, if you will) should make these wars a piece of cake. But no, of course not.\\n\\n\r\nDog Days Season Two doesn't do much, and it doesn't really try to. It's just kind of there. There really isn't anything wrong with that, too. If you are looking for a semi-enjoyable show, this should fill that void. At the very least, it is an improvement from the season that came before it.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, massive improvement from first season, focuses on slice-of-life\\n\\n\r\nAnimation: Bad, generic art style with less actual animation\\n\\n\r\nCharacters: Fine, a trope for everyone\\n\\n\r\nSound: Bad, okay OP and ED, forgettable soundtrack, okay VA work\\n\\n\r\nEnjoyment: Fine, cute little show to pass the time\\n\\n\r\nFinal Score: 4/10",
            "date": "2014-12-07T00:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 171299,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=171299"
        },
        {
            "content": "Disclaimer: I'm still furry trash\r\nIf you read my review of Dog Days season 1, you'll find that I went in expecting a garbage show and ended up with a really pleasant experience. Season two is more of the same, but that's a great thing in this case. I'll give it an actual review this time too.\r\nStory: 7/10\r\nThe story is pretty much the same as season 1: the main character (whose name may be shinku or cinque depending on your subs) travels to an alternate world full of animal girls and partakes in battles there. The difference this time is that he brings his two friendsalong this time, and also there's a squirrel faction. Another big difference is that there's less plot escalation and tension this time around; the big war only lasts for 2 episodes or so. Even so, the show still finds ways to make the premises of each episode original and that's cool.\\n\\n\r\nArt: 8/10\\n\r\nThe art is bright and colorful, and there's more cool scenery this time around since they aren't always on a battlefield. All of the girls are really cute. That's about it for now.\\n\\n\r\nSound: 6/10\\n\r\nPretty generic fantasy, no standout background music but it gets the job done. I didn't like the OP and ED as much as season 1's, but that may just be me.\\n\\n\r\nCharacter: 9/10\\n\r\nSo many good ones! As I previously said, all of the girls are really cute, so if you're one of those people who likes to choose the best girl of your shows, you're going to have a tough time as it's really hard to hate any of them. There's also a lot of lesbians, just thought I'd point that out. Also, MC gains the ability to become like 20-years old and superpowerful halfway through the show, and he looks like a cross between Izayoi Sakamoto and Samauri Flamenco, so that's a plus I guess. Character development is much better than the first season 2.\\n\\n\r\nEnjoyment: 8/10\\n\r\nThis was a really comfy show to watch. I can't fully describe it but it's never a slog to get through, even if the show doesn't throw many twists at you. It's just a feel-good kind of anime.\\n\\n\r\nOverall: 8/10\\n\r\nIf you liked season 1, you'll like this one, perhaps even a bit more (like I did). I finished this a day before Dog Days\", the next season, comes out, and I have to say that I'm pretty excited for it! I'll end with the same ending as last time: \\n\r\nIf you too like touching fluffy tail I recommend this show.",
            "date": "2015-01-09T13:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 177057,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2976321.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/somaisbatman",
                "username": "somaisbatman"
            },
            "url": "https://myanimelist.net/reviews.php?id=177057"
        },
        {
            "content": "After kind of weak 1st season, I was delighted when I started the sequel. The most noticable change about 2nd season is there was no big plot in play and it worked perfectly for the anime in my humble opinion. It finally become what it was supposed to be, a light anime that makes you feel relaxed and happy and not to concern about some complex story. That was the thing I liked the most about it. In other segments it hasnt changed much since first season. Art style, music and characters stayed pretty much the same with a few additions, but none of thosethings are what made this anime so enjoyable. Hope the 3rd season keeps this recipe.",
            "date": "2015-01-19T13:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 178535,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2492439.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Erebus25",
                "username": "Erebus25"
            },
            "url": "https://myanimelist.net/reviews.php?id=178535"
        },
        {
            "content": "It is pretty hard to choose where to stand for Dog Days'. On one hand you have a plotless, cheesy, and childish anime. On the other you have a nice, relaxing, refreshing, and a \"good for the sou\"l anime. I tend to lean more towards the second description.\r\nDog Days' is the second season for Dog Days (The difference is in the ' incase you haven't noticed). It would be wise to start with the first season, but it is honestly not that big of a deal if you skip that and move on to the second season. There is not much plot in either thatwill require you to know something to fully understand either seasons.\\n\\n\r\nThe story of Dog Days' continues off a few months from when the main character, Shinku, first travels to another world to become a hero. Shinku is preparing to go back to that world with his two friends, Nanami and Rebecca, to enjoy their summer vacation... That is pretty much it. Nothing else extravagant really happens... There is no major bad guy who is out to destroy the world or any extreme danger that the main characters must face and overcome. The first season at least had a story to it, but there is pretty much nothing to the second season of Dog Days.\\n\\n\r\nPlot and interesting story is not really where Dog Days - the first or second season- shines. Dog Days is more of a feel good show that warms your heart with constantly happy and cheerful characters. You feeling down? Then go and watch Dog Days cause nothing ever goes wrong here. No one dies or really gets hurt. The whole show is just episode after episode of the Heroes FUN adventures in another world. If you look at the Dog Days series in this way then it really is a well done anime.\\n\\n\r\nDespite the lack of any actual plot, everything else about this anime was wonderful. The art work was all colorful and extremely pleasant to look at. All the characters were very cute, or \"moe moe\", and the different events- like the wars and the concerts- were animated nicelyl.\\n\\n\r\nThe OSTs for Dog Days all set the mood very well. I personally preferred the music from this season better than the first, but both were very good. Like the story of the anime, the music are all cheerful and relaxing.\\n\\n\r\nLike i mentioned earlier, the characters in this show are all very nice and cute. Everyone has their own distinct personalities and none of them are really bad. It is pretty hard to hate on a group of middle school kids with cat/dog/squirrel ears and tails. If you do...well then this anime won't be to your liking.\\n\\n\r\nI really enjoyed Dog Day'. The relaxing nature of this show and its wonderful art and sound makes it a very pleasant watch. Each episode was very enjoyable (despite the lack of a story), and they had me saying \"aww...\" and thats nice\" a lot.\\n\\n\r\nDog Days' is a very nice anime overall. It might not be to everyone's liking because of the happy and sometimes childish elements; however, i still suggest you should check it out before you judge it. You might get a pleasant surprise.",
            "date": "2012-11-29T17:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 78682,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1488843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/The_Pro_At_Stuff",
                "username": "The_Pro_At_Stuff"
            },
            "url": "https://myanimelist.net/reviews.php?id=78682"
        },
        {
            "content": "Due to being in class this review will be short. Season 2 was a huge let down foir me. Everything in this season could just be said as \"happy happy joy joy\". The reason I say this is because there was no drama what so ever. Conflicts were minor in cliche. The best thing I can say about this anime is it's art. Enjoyment was ok at best. It had some comedy parts that did make me laugh. But this season was season 1 with more characters and no conflict.",
            "date": "2012-11-15T07:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 77605,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1733097.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/archangel93",
                "username": "archangel93"
            },
            "url": "https://myanimelist.net/reviews.php?id=77605"
        },
        {
            "content": "To be honest, the second season disappointed me truly. As for those who have seen the first season, I must say that it was better. There was at the very least an actual story line to it. The story was indeed a disappointment. WARNING: SPOILER FOR SEASON 1 AHEAD. In season 1, there was that thrilling plot throughout the anime how Leo-sama sees the future with Millhi and Biscotti's hero dead. Towards the end, the action was very satisfying. For season 2, however, the story seems to me as if it was done on a whim. \r\n    Theart I like. It has neon colors. The characters are all created very nicely. The sound was satisfying as well. Unlike other anime, Dog Days have voice actresses that have very different voice. In many anime, it is very common for two characters to sound exactly alike.\\n\r\n    Character--that was a disappointment, too. I cannot help but feel that each characters' personalities are all alike. Take Cou, Rebecca, and Millhi for example. Their personalities seem the same to me and that makes me wonder, \"What makes each of them unique and different?\" It makes me feel that the creators are using one personality and splitting it into three characters.\\n\r\n    I would say I enjoyed it, but again, I preferred season one over this season. The episodes go on and on about the daily lives the heroes have there. However, what is the point? What is the main idea of the anime? I did not expect for Dog Days to be like the customary every day journal entry. I would have wanted some thrill in it, like it had in the first season. Overall, I would rate it a 7, though I am slightly reconsidering the score to a 6.",
            "date": "2012-09-29T19:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 73663,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/800357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Athena_Carolyn",
                "username": "Athena_Carolyn"
            },
            "url": "https://myanimelist.net/reviews.php?id=73663"
        }
    ],
    [
        {
            "content": "This review is going to be based from the point of view of someone who has already seen season one. I have already written a review for season one that you should read if you are new to Dog Days. If you are just going to be getting into Dog Days for the first time, please make sure to watch season one first. You may think this is obvious, but because of the weird naming scheme of the show and it's current streaming conditions in the west, it can really be confusing to newcomers. Season one is called \"Dog Days\" and season two is \"DogDays'\" or \"Dog Days Dash\". As of this writing, there is no legal way to watch season one streaming, as Crunchyroll is only streaming season two. I feel as if many reviewers are going to watch season two thinking that it is a fresh new anime series and are going to be confused by who these characters are and what is going on. \\n\\n\r\nPlease, if you want to get into the franchise and don't want to download fansubs or import the blurays (they do come with English subtitles), don't just get impatient and skip season one. Make sure to let Crunchyroll know how bad you want season one streaming, and let Aniplex, Funimation, or whoever know you want it in a domestic boxset. It's a fantastic franchise and the lack of a legal season one stream is very disappointing and is only hurting the revenue and chances for future seasons.\\n\\n\\n\r\nSTORY:\\n\\n\r\nSeason two starts off where season one left off. Shinku gets summoned back to Flonyard but this time thinks it's a great idea to take his friend Becky along, and Nanami gets summoned by Galette and taken to Flonyard. \\n\\n\r\nRight off the bat the first arc is all one giant battle. Shinku fights for the Biscotti Republic, Nanami fights for Galette as their new hero, and then Becky is abducted by the new country of squirrel people called \"Pastillage\" to be their hero. The battles are just like last season with countries receiving points for knockouts and clothes-ripping hits, but this time with three countries instead of two, and three heroes instead of one. The season is filled with random adventures and lots of magic as well as new characters and mahou shounen/shoujo super moves.\\n\\n\r\nIn the Dog Days fandom, there seems to be two types of people: those who liked season one because it had over-arcing conflict (Shinku not knowing if he can get back to Earth, as well as the giant monster at the end), and those who feel that the first season was slightly ruined by the forced drama of the tacked-on monster and just wanted to have wacky Flonyard hi-jinx. People who just want wacky hi-jinx and battles are really in for a treat with season two. When there aren't battle episodes, the series is filled with self-contained episodes that have a small conflict and is usually resolved quickly. There is no real conflict, and the only drama in the season is one episode featuring  Eclair questioning her and Shinku's relationship and whether she should confess or not. There is still no fear of death. People following the show initially thought that they would be introducing a big bad character mid-season due to the character's portrait being shadowed in the opening, but that character turned out to not be so bad after all. If you are watching Dog Days Dash hoping for edgy drama or conflict, you will be disappointed. \\n\\n\r\nSeason two is all about world-building, new characters, and battles. Masaki Tsuzuki more than likely knew when he was writing up season two that he was approved for a season three already and decided to use season two to be light-hearted and build into a more serious third season.\\n\\n\r\nEveryone in Flonyard is still nice, the monsters are mischievous, the giant birds still look like chocobos, and the story is still about fun and excitement and not about being dark. \\n\\n\\n\r\nART AND ANIMATION:\\n\\n\r\nSevenArcs did a pretty decent job. Action sequences are really fast-paced and exciting and the art is good when it needs to be. Season one had an absolutely amazing concert scene late in the season that I was hoping we would see more of in this season, but sadly even though we got two concerts both were lackluster. \\n\\n\r\nSeason two gets a mahou shoujo transformation scene with animation by Kou Yoshinari and Studio Silver. The scene blew me away the first time I saw it as it felt so out of place with the rest of the episode. Sadly, while much of the sequence was amazing, it was also filled with quite apparent CG, and some fans including myself felt that the scene was too overly sexual to put in a show like Dog Days. Still, that sequence, coupled with a short sequence of fighting between Eclair and Leo later in the season, were my favorite sequences. \\n\\n\r\nThere are many frames where if you stop and pay attention to the background characters, they are drawn so terribly, you can't help but laugh. Also, season one's generic-faced soldiers return, and you can see copy-pasted people in several panning shots. I watched most of the high-action sequences at 25% speed so I could catch frames both good and bad. There are many really interesting and truly gorgeous key frames in many of the sequences, but just as many hilariously bad inbetweens. They have some work to do for the bluray release.\\n\\n\r\nAs far as character design and costumes go, Dog Days is absolutely stunning. All the characters are really unique and well thought out. We get a new race of squirrel people, and they all have big bushy squirrel tails as they should. Nanami and Becky's hero outfits/barrier jackets are stunningly designed with really cool colors, and even the generic soldiers even have neat looking uniforms. The characters even get turned into their younger/older selves in an episode and they are all given new clothes and look appropriate. Whoever did the costume design for this series is a genius. As someone who has watched Nanoha, you can really tell the Nanoha-esque resemblance in the designs. I cannot think of a single costume or humanoid character design from the second season that I dislike...except the catgirl-god from episode eight. She was just ugly on all fronts.\\n\\n\r\nAs far as the monsters and animals in Flonyard go, they are just passable. Season two sees the return of Brioche and Yukikaze's group of ninja-dogs, but many times when they are on screen they are drawn poorly. We get a new giant dragon that is honestly rather underwhelming as he's a boring grey color and looks like one of the Weapon-type monsters from Final Fantasy. We get new giant birds that this time fly and they just look like giant canaries and make cute squeaky bird noises. We even get a race of monster rabbits that just look like really chubby stuffed rabbits.\\n\\n\r\nSeason two kept up the unique art direction season one had, and the bright shiny colors kept me smiling and feeling that the brightness was very appropriate for an anime where everything is happy. Overall, the art was very good.\\n\\n\\n\r\nSOUND:\\n\\n\r\nThe opening is done by Nana Mizuki who voices one of the new heroes and Ricotta. The ending is done by Yui Horie who voices Millhiore. Millhiore also has two concert songs this season. They really aren't trying to hide the fact that Dog Days is a show to help promote album sales. Still, Fearless Hero is an amazing track that compliments that opening animation and let's you know this is a show with plenty of action and adventure. Yui Horie's song is simply played as the ED over a scrolling cast of chibi characters.\\n\\n\r\nThe rest of the soundtrack is just there. Most of the music I remember hearing in season one is back, which isn't particularly a bad thing because the music they play when the action gets going is very hot-blooded and fun.\\n\\n\r\nThere are absolutely no complaints about the voice cast. The all-star cast from season one returns, and on top of that we get Aoi Yuki as the new squirrel princess, as well as Eri Kitamura, Kousuke Toriumi, and others. Aoi does an amazing job being the high-pitched annoying excitable squirrel, as you would expect from a small rodent. Nana Mizuki returns as Ricotta and continues to make me smile every time she says \"de arimasu~\" after a sentence. Eri voices a new older character that says \"nanodesu~\" quite often. The voices are an absolute pleasure to listen to and I'm curious as to what talent they will get for season three.\\n\\n\\n\r\nCHARACTERS:\\n\\n\r\n If you loved season one's characters, you will love them all over again. Shinku is still a hotblooded athletic hero that just wants to have fun, Millhiore is still the cute princess, Leo is still a warrior-queen, Brioche is still a refined older lady, Yukki is still cheery and has giant breasts, Ricotta is still a wacky genius, etc. \\n\\n\r\nThe new characters are hit or miss. Becky and Nanami I initially thought were going to be terrible characters. I thought Backy was going to be the jealous third-wheel, and Nanami was going to be Miss Perfect. Surprisingly, I really enjoyed both of them. Nanami in her hero form fights with ice/water skates and a staff and has an absolutely amazing costume. She really reminds me of Subaru from Nanoha StrikerS. Becky becomes sort of a witch and rides around on a magical broom and shoots magical spellcards like in Touhou. Becky's costume is also really neatly designed (I'm a sucker for orange).\\n\\n\r\nWith the introduction of a new country of squirrels comes a new squirrel princess. She seems to always be constantly bored and looking for other people's business to butt into and drags her soldiers into other people's battles and generally gets in trouble. She has two main soldiers with her, Caraway and Riselle, who while seemed to be really neat characters when they were in the initial battle, were hardly on screen past that.\\n\\n\r\nThere's also an ancient human Hero King, Adelaide, that is actually a woman voiced by Eri Kitamura who fights with a magic pistol and sword. She is accompanied by a demon king named Valerie and the two of them are sort of a couple, possibly even going as far as being married. Adele is the typical jealous girl character that hates when her significant other looks at other women, which happens often because Valerie is a pervert. She threatens him with violence, and the schtick gets really old after the second time. Adele has sort of a neat white and yellow color scheme with blonde hair and star-shaped pupils, while Valerie is a big tall super-muscled guy with a dark color scheme and what seems to be a corrupted squirrel tail. They really do not go much into their history, which left a lot of fans hoping season three will give some answers about their relationship.\\n\\n\r\nSeason three also introduces Brioche's brother Isuka, a traveling swordsmith/samurai. He's very calm and collected much like Brioche, and lets onto a little bit of back story about Brioche's true name and a bit of her history. I was disappointed he didn't play a more important role.\\n\\n\r\nAs far as development goes we do see a bit. As stated earlier we get backstory about Yukikaze and Brioche. We also find out a tad more about their world and summoning and the possibility that there have been Flonyardians that go to Earth. Millhiore and Shinku don't get much development in their relationship, Eclair has roughly half an episode dedicated to her and her feelings for Shinku, and Becky and Shinku's relationship is only slightly developed at the end. Shinku is being a pretty great lead character as he's not giving into any of their obvious advances, and plainly acknowledges that he knows about their feelings, but he has better things to do. I found it pretty impossible to hate Shinku, especially seeing that there are enough other characters getting screen time this season that the story wouldn't always focus on him, which prevented him from turning into a character I just want off the screen. \\n\\n\r\nDog Days Dash was very character driven, even though many characters could have been fleshed out more. They introduced so many amazing characters, that many times I just wanted them to stop introducing characters so they could expand upon the ones they already have. This is a huge flaw of the franchise as a whole and I think really goes back to how Masaki Tsuzuki creates his worlds. He did the same thing with Nanoha where there was this big cast of really cool characters, but after he introduces them as being really cool characters, he likes to forget about them. It's almost as if he prefers to create characters rather than create stories for his characters, and it hurts Dog Days as a whole.\\n\\n\\n\r\nOVERALL ENJOYMENT AND OTHER CLOSING THOUGHTS:\\n\\n\r\n I really enjoy the Dog Days franchise. I've watched the first season four times, and so far have watched season two's episodes twice each. I'm going to watch them again on bluray to see what they changed, as well as watching it again if it ever got a dub.\\n\\n\r\nTo me, Dog Days continues to be a breath of fresh air in the world of stale novel and manga adaptations and edgy shows for teens. Sure, Dog Days has tropes like a slight harem element, it has fanservice, it has animal-eared and tailed characters (which to me only adds to their charm), and at it's heart it's a shounen. Where Dog Days Dash excels is being a show you can sit down, turn on, and be transported to a happy world with fun characters, fun magic battles, innocent character interactions, and (here I go using that \"F\" word again) fun wish-fulfillment for fans burnt out of typical shows who want to feel like they're are watching something created so that you can feel good and happy watching it, not feel as if you have to root for or against any particular faction, or wonder if your favorite character is going to die.\\n\\n\r\nIf you haven't watched season one, do yourself a favor and go do so. If you are on the fence after watching season one as to whether you should watch two, then of course give it a watch. There's less plot this time around and less conflict. With season two, I believe Masaki Tsuzuki knew he was green-lit for a third season so he decided to use season two as the world-building filler in-between two more semi-serious and conflict-filled seasons. The final episode of Dash strongly hinted at another season, and with all of the press and promotional work it has been getting, as well as the solid bluray sales and more merchandise on the way, you can bet you aren't getting involved with a dead franchise. I'm eagerly awaiting a North American release.\\n\\n\r\nDog Days Dash isn't the perfect sequel so many people were hoping for, but when you go into it expecting character-driven action-adventure cute fun instead of grimdark plot, it's as perfect as a franchise like this is going to get, and that's good enough for me.",
            "date": "2012-09-29T15:51:00+00:00",
            "helpful_count": 51,
            "mal_id": 73643,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1091685.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/GregZor9",
                "username": "GregZor9"
            },
            "url": "https://myanimelist.net/reviews.php?id=73643"
        },
        {
            "content": "Dog Days is one of those series  (1st season and 2nd season) where you either love it because of all the fun it has and how light hearted it is, or you hate it because it seemingly goes nowhere (this applies more so to the 2nd season).  But whether you love it or hate it, there is no denying that Dog Days is good at what it tries to do.\r\nFor the second season of Dog Days, Cinque is summoned back to the world of Flonyard along with his close friend Becky and cousin Nanami. This time, however, each side gets their own heroto even things out. Throughout each episode the characters experience some humorous ordeals or partake in a “war”. \\n\\n\r\nThere are numerous differences between the first and second season. The biggest difference is that the second season does not contain an underlying plot like the first season. However not every series needs a plot to succeed and the second season of Dog Days is an example of that. Each episode has a ton of funny moments and since something different happens every episode, most of the episodes are very entertaining. Another big difference is the addition of another country Pastillage. This addition did a number of things: added more characters, added variety to the “wars” and also helped with the comedy. Despite all these changes, the second season Dog Days is still very similar to the first season. The series doesn’t try for too much, it’s funny, it’s cute and most importantly it’s entertaining.\\n\\n\r\nThe art and animations are pretty much the same as the previous season. There are some very appealing visuals especially during battles and the character designs look very cute.\\n\\n\r\nThe opening and ending are also very similar to the opening and ending of the first season. The opening is very energetic, which describes the series very well. The ending is a very sweet song which I think is perfect for a conclusion to an episode. The voice actors also do a very good job matching the characters they are playing. \\n\\n\r\nFor this season, we don’t just have one hero, we have three.  Our original hero Cinque/Sink, is probably the weakest of the three heroes in terms of power level, but he still looking like Nathan Drake (just shows you how powerful these heroes are). Despite being the weakest hero, he is a great character. He never shies away from a challenge, he’s nice and he has great chemistry with all the other characters.\\n\\n\r\nThe other two heroes don’t stand out as much as Cinque but they do play a role during each episode. Nanami, who is Cinque’s older cousin, has a personality which is very similar to Cinque. She’s very energetic, doesn’t back down from a challenge but she’s also slightly stronger than Cinque. Becky, Cinque’s best friend and perhaps the most over powered hero of all, is very different from the other heroes. She isn’t very athletic but she does have a lot of experience with video games making her a hero with a different style from Cinque and Nanami (her hero form is like a witch). All 3 of them are very likable and are pretty good characters\\n\\n\r\nFor this season, the princess Millhiore doesn’t play as big as a role as she did the first time but she is still the same as the first season, soft-spoken, kind, can hold her own in battle and best of all very cute so I have no complaints. During this season Éclair really sticks out because she undergoes development which a pleasant surprise and also because out of all the characters in the series, she has the best chemistry with Cinque. There are also a bunch of new characters such as Couvert, Valerio and Adelaide just to name a few. Each character adds to the comedy each bringing a different personality to the table. I also like the fact that there is no jealousy war that goes on between the characters that love Cinque instead they are all nice to each other which I like because sometimes in other anime there is a jealousy war between love rivals which can get very annoying.\\n\\n\r\nDog Days (both seasons) is a very enjoyable series because it likes to have fun, it’s very light, very funny and every episode brings something different. However the series isn’t for everyone, it has no story and doesn’t seem to go anywhere. But if you are just looking for something to watch, Dog Days (both seasons) can be a very fun watch.\\n\\n\r\nOverall, even though the second season of Dog Days is different from the first, it’s still just as good. It’s not spectacular by any means but it’s still the cute and funny series that many would enjoy.\\n",
            "date": "2013-01-16T08:02:00+00:00",
            "helpful_count": 31,
            "mal_id": 83825,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/188380.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AquaHaze",
                "username": "AquaHaze"
            },
            "url": "https://myanimelist.net/reviews.php?id=83825"
        },
        {
            "content": "An Exercise In Futility\r\nThat is really the best way I can describe the second season of Dog Days. While I felt the first season was sub-par and full of potential, this season denied the opportunity for this anime to have any potential. \r\nFor those that have seen the first season of Dog Days, you're not missing much with the second season. It is the same-old shtick with the addition of some new characters...completely unnecessary characters I might add. So where did this anime go awry?\r\nThe story. It is truly dreadful. Actually, that might be doing it a disservice because it is non-existent. This season picksup where the first one left off, Sinku takes Nanami and Rebecca with him to Flonyard and this time, Nanami becomes the hero for Galette and Rebecca becomes the hero for the newly introduced country of Pastillage. Couverte decides to enter Pastillage into the war games between Biscotti and Galette and it essentially becomes a three-sided war. Unfortunately, it doesn't sound as epic as it should. There is very little action in this \"Union Fest\" I believe they call it and the fight scenes that fans should be expecting are quite disappointing. It seriously felt like 2/3 of this anime was padding and fan service...and BOY is there fan service! Even more so than the first season which had a mild amount in its own right. One aspect I really didn't like was how it felt like Nanami and Rebecca were pros at the combat right off the bat. There wasn't any sort of struggle or buildup, it seemed like they were ready to go as soon as they got to Flonyard. It really took away any flare for the dramatic. \\n\\n\r\nI also did not find this anime very enjoyable just for the fact that the character interaction is extremely dry. Unlike the first season, there was no sense of drama or tension in this season. Everything was cookie cutter and dry. This felt like one, antagonizingly long episode of Barney the Dinosaur with all the I'm so happy, I love you moments. Throw that on top of the what felt like filler episodes made this a very difficult watch. While watching this anime (and even taking the very liberal stance Japan has with their media), I had several contemplations running through my mind. I kept asking myself, \"what's the target audience for this anime?\" The dialogue felt like it was for a middle-schooler or perhaps even younger while the content felt as though they were aiming for a HS to college age audience. Whatever it may be, it felt like it didn't work. The dialogue felt too childish for an older anime viewer like myself to enjoy while the fan service was raunchy enough to make me blush (kidding, but it's a statement that I wouldn't let my kids watch this). Unlike the first season, I had to really FORCE myself to finish this season and I really didn't feel the payoff by the time it was all said and done. \\n\\n\r\nSo with that being said, was there anything this anime did right? Sort of. I did like the artwork...albeit, there was a scene in Episode 2 where it felt like this anime suddenly jumped into the realm of magical girl hentai...and for those who have watched the anime know what I'm talking about. I thought the music was still pretty good for this season, although I'll admit I liked the music a little better last season. I will say that it is extremely hard to pinpoint the good things about Dog Days' because they were few and far between. \\n\\n\r\nOverall, I felt like Dog Days' was really 6 1/2 wasted hours of my life and probably the worst anime I've seen in 2012. The setup in the first season was actually much more dramatic than I expected and I felt if season two could capture the same sort of dramatic flare the mid-to-late sections of season one captured, it could've been a pretty decent anime. It didn't come close and honestly, it didn't even try. I have no idea what the writers were even trying to do with this season. I'm not sure if they wanted to try and make an epic setup for a third season or what, but season two was not even close to keep me invested in this series if it does continue.",
            "date": "2012-10-01T01:05:00+00:00",
            "helpful_count": 28,
            "mal_id": 73781,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1202421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Toucanbird",
                "username": "Toucanbird"
            },
            "url": "https://myanimelist.net/reviews.php?id=73781"
        },
        {
            "content": "---English is not my native language so I apologize in advance for all the mistakes(please provide me with some feedback), this anime had no reviews so I will attempt to write one---\r\nDog Days' is a direct continuation to the first season of Dogs Days, so if you enjoyed Dog Days the first, chances are you will also like the second season, since it follows the same concept but with newly added heroes, which just adds more fun to this amusing series.\r\nCinque is summoned once again to represent Biscotti Republic with his outstanding athletic abilities, but this time he goes back to Flonyard with Rebecca(friend) andNanami(cousin). \\n\r\nNanami also possesses extraordinary skills and she quickly becomes Cinque's rival when she is recruited as the hero to represent Galette. Rebecca, despite not being as skillful as Cinque and Nanami also joins the combat which as you may know is actually a friendly Olympic-like battle between the different republics in Flonyard.\\n\\n\r\nThe art is as good as last seasons';colorful, bright and flows smoothly.\\n\\n\r\nSound: The OP is performed by Nana Mizuki, what else could one ask for? Yui Horie sings the cute ED.\\n\r\nThe OSTs are fitting for each scene, upbeat for the combat scenes I've seen so far.\\n\\n\r\nCharacters:Cinque is still full of conviction,Nanami has confidence and Rebecca although shy at first shows promise of becoming a strong character. \\n\r\nPrincess Millhiore is as cute as ever and Leonmitchelli-sama still shows her prowess in the battlefield.Besides that, the characters show no evident changes. There is the newly added character Cou, Princess of Pastillage who gets along with Milly and Leo-hime and also participates in the battle events for her own country.\\n\\n\r\nThe seiyu are remarkable, the cast consists of Nana Mizuki,Yui Horie, Kana Hanazawa among other known voices.  \\n\\n\r\nI gave this show a 7(Good) since it is very enjoyable.\\n\r\nOtherwise if you are looking for a laid back series with action, this is perfect for you. \\n\\n\\n",
            "date": "2012-07-28T15:32:00+00:00",
            "helpful_count": 19,
            "mal_id": 67947,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1292725.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Kurokami18",
                "username": "Kurokami18"
            },
            "url": "https://myanimelist.net/reviews.php?id=67947"
        },
        {
            "content": "I watched the first season of Dog Days, thinking that it wasn't so good, but had a decent story, cute characters with a cute design, and that it was entertaining enough to watch every week. And that a new season was a good thing.\r\nBut the second season is simply awful. The main reason for this is: there is no story. There is only a bunch of random episodic stuff. There is no tension, no danger. Only a bunch of kids playing, singing and giving some mild fanservice. I kept on watching every week thinking that there would be something to grasp upon. Something interesting thatwill make a real story.\\n\\n\r\nBut it never happened. No drama between the characters. All the girls like Cinque, and there is no problem with it. No political/magical problems that have to be solved with the sporty war, the competition this time is only for fun. Every problem is easily solved. No mean guy, and no big rivality.\\n\\n\r\nIf you want to watch something happy without any tension, watch a slice of life. If you want to watch a fantasy adventure, get the hell out of here. If you want to watch a harem show, there are more interesting ones with more fanservice out there.\\n\\n\r\nSo there is nothing there. I have the feeling I lost every minute I spent on this anime. Only the art was good, even the insert songs by Milhi were boring. If there is a third season of Dog Days sometime, I hope they will give it a story this time.",
            "date": "2012-10-02T11:41:00+00:00",
            "helpful_count": 13,
            "mal_id": 73913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/151981.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/simakai",
                "username": "simakai"
            },
            "url": "https://myanimelist.net/reviews.php?id=73913"
        },
        {
            "content": "Dog Days Season 2\r\nGenre: Action, Adventure, Comedy, Ecchi, Drama (Minor - DESPITE what it tries), Romance (IF you can call it that).\r\nLength: 12 episodes, 24 minutes each.\r\nDog Days is about a athetic and OVERLY FEMINIE boy being yanked from our world, to fight in the wars of the magical land of Fronyaldo. Only, those wars are more like athetics events, and anyone who \"dies\", just turns into a cute little ball of fluff for a while.\r\nSeason 2 picks up with out hero Shinku (Or Cinque, or Sink, or Shink, Or Cink, or nutty von solo) returning to Fronyalda after the events of Season 1. Thistime he brings along his two best friends, Becky and Nanami.\\n\\n\r\nWithout spoiling anything, I will now say this. Dog Days SERRIOUSLY needs to get a grip on what it is. That is to say, a light hearted \"fun\" series. Thats what the wars are in its world, and it's what the anime itself should be. It always starts out like this, only to skew off toward the end. Unfortunatly, the first series though it could be a darker, demon fighting show, which it failed at. The second series seemed to understand that it wasn't that, but tried to focus on \"Character development\" and Ecchi. I'm not complaining too much about the ecchi (Although its downright redicolous that people who are \"defeated\" are suposed to turn into little fluff balls, but instead, just seem to loose their clothes now), but the \"character development\" is crap. It focuses too much on the girls carrying on about how they love Shinku, and not enough on anything else. Sorry Ladies, but I choose to believe (And I swear to god this is true) that Shinku is gay.\\n\\n\r\nAdd to that the whole introduction of two awesome characters who don't do a bloody thing, and you've got a mess of average battles and below average plot. The only redeeming quality. Beautiful artwork and some fanservice.\\n\\n\r\nI'm not being kind to Dog Days because I believe it fucked up something that could've been awesome fun. I recomend this series only because of its sheer \"non-seriousness\". Watch it inbetween anime series, like you'd chew gum between meals.",
            "date": "2013-03-27T16:21:00+00:00",
            "helpful_count": 7,
            "mal_id": 91187,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/498260.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Overlord_A",
                "username": "Overlord_A"
            },
            "url": "https://myanimelist.net/reviews.php?id=91187"
        },
        {
            "content": "With the new season coming in the Winter 2015 season, I thought to myself, hey, why not catch up on this quaint little series and the joy that it holds?  And so, with the totally unoriginal title, here's a review of Dog Days Dash.  (I assume the next one will be called Dog Days Dash Dash or something like that.)\r\nStory (7.11/10): The story of Dog Days follows up from its predecessor with a couple changes.  Compared to the previous season, our main protagonist Sink returns back to the magical land of Flonyard with two of his companions, his cousin Nanami, and hischildhood friend Rebecca.  It is here where the three go to the world where Sink spent some time in, and have a good time in the process.\\n\\n\r\nTo be blunt, this season really doesn't have much to offer.  It plays similar to a slice of life where it plays out without any drama or really dire events, which plays in huge contrast to the previous season where they added a plot and some drama.  The show sort of goes through a day by day process of storytelling where our three foreigner characters, them being Sink and his companions spend time with these nekomonomimi-type characters and spend their time as the heroes of three separate kingdoms.  By no means is this bad for the series, as the quaint day to day way of storytelling is well done and definitely fits the laid-back style that this series has, but it's not really something that we haven't seen before.  \\n\\n\r\nThat being said, this season does bring in some new things and characteristics about the world of Flonyard.  As the audience, you do get to see more about this fantasy world and learn a little bit more about it.  The fact that the show built up the world that it was presenting to us a little bit more, made this season a little bit more developed than the last one.\\n\\n\r\nOverall, Dog Days Dash doesn't really build much after the first season aside from bringing in new characters and new scenarios.  The same idea of war that Flonyard has, as well as the relationships that the characters share stay relatively the same with little to no change.  If you've watched Dog Days, the series' first season, the second season is essentially the same, but with less drama.\\n\\n\r\nOverview:\\n\r\n+  Good laid-back feel\\n\r\n+  Show builds up the world a little bit more.\\n\r\n+/-  Day to day storytelling is nothing new\\n\\n\r\nCharacters (7.35/10): Now, I could go on and on about the characters in this series, but there's honestly just too many to really explain or detail.  So, here're a couple overviews on the characters.\\n\\n\r\nDog Days is one of those series that has an absurd amount of characters.  We have Sink, the princess of Biscotti Millefiore, Eclair, Ricotta, Leo, Gaul, Nanami, Rebecca, Couverte, etc.  And those are only the \"main\" characters.  As far as depth goes, you won't really know very much about who they are as a person.  Since the show mostly focuses on a day to day style of storytelling with characters spending time with each other, the only thing you really witness are the characters interacting with each other.  The characteristics for everyone is really only skin-deep, with very one note traits like Eclair being a tsundere, and Gaul being competitive as all hell.  However, even though these traits don't go beyond that one trait, it doesn't really impact the series very much.  \\n\\n\r\nIn addition, the show hosts A LOT of supporting characters like Yukikaze, Violet, the three members of Genoise, the captains of each kingdom's guards, as well as a couple new side characters added to the mix.  Similar to the \"main\" characters, these guys don't really have traits beyond a singular one that defines their personality.  Once again, it's not that this style of storytelling is bad, seeing as how the show regardless was still enjoyable to watch.  There is however a drawback to this.\\n\\n\r\nThe drawback I can see with this season's characters compared to the first season, is how little focus there is on one specific character.  Compared to last season where Millefiore and Sink were the prime focus of the season, Dog Days Dash puts basically every character on equal ground, with main characters getting sometimes as much screentime as the side characters, and supporting cast getting more screentime than they previously did.  This bothers me a little bit due to how Sink, the supposed main character of this series, feels a little numbed down in terms of character importance.\\n\\n\r\nOverall, the cast of Dog Days is wide and expansive, with every character getting relatively equal ground now rather than being put high above the other.  What I also find interesting about this cast is how easy it is to recognize them.  Usually with shows that have such an expansive cast, you would only be able to recognize maybe 5-6 of them rather than maybe 20-30 characters here.  They're all surprisingly easy to recognize and remember, which is definitely a plus for this show.\\n\\n\r\nOverview:\\n\r\n+ Easy to remember cast\\n\r\n+/-  No real main characters\\n\\n\r\nArt and Sound (7.22/10): The art for this series is what you would call very colorful.  Everything is done in a very bold color scheme, going towards the lighter side in order to give off the show's nonchalant feeling.  The art itself is not really extraordinary.  It's aesthetically pleasing, but it's not really a standout quality of the show.  \\n\\n\r\nIn addition, Dog Days does have its own brand of ecchi, which is somewhat odd in all seriousness.  Every so often, the show basically disintegrates the clothes off of its female characters, leading them to basically be out in the open wearing nothing.  Compared to the previous season, this doesn't happen that often, but it happens often enough to be completely unnecessary. \\n\\n\r\nThe soundtrack for the series is really nothing to write home about.  There aren't any standout tracks for the series, and everything sort of follows a very calm tone that follows the flow to the series.  They're decent tracks, but they're not really memorable.\\n\\n\r\nOverview:\\n\r\n+  Decent art\\n\r\n+  Decent soundtrack\\n\r\n-   Unnecessary ecchi moments.\\n\\n\r\nPersonal Enjoyment (8.38/10): Flonyard is an interesting place.  It has chocobos, wars that are basically like sport, if you're a hero, you get treated like royalty, you can have overpowered abilities, and everyone there likes to get petted like a pet.  Above all, you can be in Sink's place and be surrounded by girls from all kinds, and even get to sleep next to some of them.  Hell, I want to live in this place.  \\n\\n\r\nDid I like this show?\\n\\n\r\nYes, I did.  This show was an enjoyable watch.  While there are no standout qualities about it, Dog Days Dash did follow its predecessor in making a more calm and relaxing story similar to what I anticipated in the first place.  Overall, it was a nice show to watch, and there really aren't that many negative experiences from watching it.\\n\\n\r\nWhat didn't I like about this show?\\n\\n\r\nHonestly, there's not really anything to dislike.  Every episode features something new, so you're never really bored.  Above all, it's a laid-back show, and it really delivers with an atmosphere and feeling that reflect what the show was trying to do.\\n\\n\r\nWould I recommend this show?\\n\\n\r\nIf you're looking for something kind of laid back but still action-packed, or you're just a fan of animal ears like me, then this is a show for you.  Note, this is a sequel, so watching the first season first is advised.\\n\\n\r\nOverall Score: 7.44/10",
            "date": "2014-12-31T17:24:00+00:00",
            "helpful_count": 7,
            "mal_id": 175475,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=175475"
        },
        {
            "content": "(This has been adapted from my reddit thread)\r\nLife can be hard. Going through university, working 30 to 40 hours, dealing with relationships, handling finances, the list goes on and never seems to stop. So there are times where you just want to take that quick little breather to just relax, even if it is for a fleeting moment. Dog Days Season Two is this \"breather.\" Amid the many shows containing intense drama, crazy action, or philosophical insight, this one is there to just enjoy it for what it is.\r\nSTORY\r\nDog Days Season Two takes place a few months after the conclusion of the first season. Thistime, Shinku, Rebecca, and Nanami head to Flonyard in order to enjoy the land and its people.\\n\\n\r\nThe joke last time was that the whole point of the show was the fighting. The battles were the focus, and everything revolved around them. While they are present this time around as well (a continent can't have a cultural turnover in the span of a few months, anyway), they are not what is important. Instead, the show adopts a slice-of-life style episodic story-telling theme in order to present us with varying situations that the characters find themselves in. Body switching, mazes, and bunny/cat thieves all make an appearance, breaking the monotony that the first season was mired in. I call the first season having \"focus\" on the battles, but in the sense that that was all it cared about. This season really focused, giving it much needed direction and reason.\\n\\n\r\nThis new focus allows the show to actually expand on the characters and the world they live in. Thankfully, it transitioned heavily away from being all about Shinku and giving the other main and side characters a shot. Many times, a group of them would be hanging out training or finding themselves in a precarious situation, giving the fans of these characters much-needed screen time. It's always difficult doing something like this, especially with a cast this large while adding even more to the mix, but I found this season to handle the overall screen time for each member quite fairly. At the same time, the various plots provide for at least a small amount of world building on many of the smaller details, such as the demons that inhabit the land or the finer intricacies of a country's inner workings.\\n\\n\r\nIf one really wants to dig deep, there is a purpose to the countries themselves. Biscotti represents the kind and the fair, Galette are the strong and the proud, and Pastillage are the cute and the energetic. All three have their strong and weak points. Yet the wars they have between each other are not for domination but for sport. Meaning it doesn't matter if your kind, strong, or cute, anyone has the chance to be a \"Hero\" in the world of Flonyard.\\n\\n\r\nANIMATION\\n\\n\r\nDog Days Season Two actually faults a bit in this category.\\n\\n\r\nThe art style remains almost exactly the same. No surprise for any show, really, since immensely changing the art style could potentially make very little sense. The character designs for the new characters are just as enticing and unique as the old characters' designs, so there isn't any problems there either.\\n\\n\r\nIt's not entirely noticeable, but there is a lot less animation going on comparatively. Perhaps due to the slice-of-life nature of the show where the battles are not that important anymore, there seems to be not a dip in the quality of the animation but just less of it in general. In other words, a lot more talking and sitting around versus running, jumping, and crossing swords from days of old. The opportunities were there, but perhaps due to time, budget, or both, the show just refused to showcase its animating talent.\\n\\n\r\nCHARACTERS\\n\\n\r\nThis new season brings back every single character from the first, while simultaneously introducing us to a slew of new ones.\\n\\n\r\nMany of the new characters are very forgettable, such as Hina's brother (the swordsmith) or the little cat thief. Others manage to make a distinct mark, such as Couvert (Pastillage's princess) and Adel (the \"Hero King\"). Couvert is pretty much just a \"moe-blob.\" She's insanely cute in the way she talks and how she acts, and is always looking to have a little bit of fun. Adel, literally the king of all Heroes, is a woman who is outwardly very refined and dignified but inwardly loves to do battle. In a way, season two was simply trying to \"fill the gaps.\" The cast of characters at this point is ginormous, so there is bound to be someone for everyone who watches the anime.\\n\\n\r\nMy favorite character from the show is Yukikaze...I think. My previous reasons for liking her mostly do to her contagious personality and great body are somewhat conflicted after learning a bit more about her past. Arguably speaking, though, the best character from the show is Eclair. I had disappointments with her in the first season, but this time, she actually excels. In short, she is one of the best examples of a \"tsundere\" character that I've seen in quite some time. Over the course of the show, she actually breaks out of her \"tsun\" shell and moves to the \"dere\" side in a believable and fitting fashion. I thought her character development was done quite nicely.\\n\\n\r\nEveryone else is hit or miss. You either love the trope they represent or hate it, because that is the extent of the characters. Luckily, Shinku does not have a commanding presence this time around, giving the rest of the cast the chance to at least demonstrate their tropes in full force.\\n\\n\r\nSOUND\\n\\n\r\nThe OP this time around is at least a smidgen better than the first season's, but it's still way too generic. The vocals are okay, the trumpet is loud, and the beat is simple.\\n\\n\r\nOnce again, the ED goes for a considerably softer tone. And also once again the ED is better than the OP for their respective seasons. The drum beats and song itself are still generic, but the almost-ending pause and quiet lead in into the song at least spice it up a bit.\\n\\n\r\nReiterating myself a lot here, but like the first season, the soundtrack for the show is mostly forgettable. Princess Millifiore sings a few songs, just like the first season, but they're more about their \"relevance\" within the show than they are about listening to them as single tracks outside of it.\\n\\n\r\nAs for voice acting, Aoi Yuuki does an above average job portraying Couvert. The rest of the cast either fulfill their roles or fit the new ones nicely enough. However, I still can't stand Shinku's voice. It just does not fit his character.\\n\\n\r\nENJOYMENT\\n\\n\r\nThere is no denying that the show is cute. All of their characters are designed to be so. As such, I often found myself smiling at the tail-wagging or when the Heroes are petting their respective leaders. It seems like a silly concept from the title alone, but given how non-violent Flonyard actually is, it's always fun to see the entire cast hanging out and having a grand old time.\\n\\n\r\nThe show tones down the fan-service quite a lot this time around. Also of note is the romance at play. It's in a weird spot. First, Shinku is quite dismissive, avoiding the question. Yet, he says, \"I love you\" to some of the girls, hugs them/holds hands, and compliments them. In other words, the dude is sending way too many mixed signals, and it gets rather grating. Of course, the girls involved aren't dismayed by this fact, but such is anime.\\n\\n\r\nOne small aside: Pastillage should literally win every battle. I mean, they have complete domination of the air. Sure, the countries have one or two flight capable devices or someone can launch projectiles, but having such control over arguably 50% of the map (thinking of it like a rectangle, if you will) should make these wars a piece of cake. But no, of course not.\\n\\n\r\nDog Days Season Two doesn't do much, and it doesn't really try to. It's just kind of there. There really isn't anything wrong with that, too. If you are looking for a semi-enjoyable show, this should fill that void. At the very least, it is an improvement from the season that came before it.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Fine, massive improvement from first season, focuses on slice-of-life\\n\\n\r\nAnimation: Bad, generic art style with less actual animation\\n\\n\r\nCharacters: Fine, a trope for everyone\\n\\n\r\nSound: Bad, okay OP and ED, forgettable soundtrack, okay VA work\\n\\n\r\nEnjoyment: Fine, cute little show to pass the time\\n\\n\r\nFinal Score: 4/10",
            "date": "2014-12-07T00:03:00+00:00",
            "helpful_count": 7,
            "mal_id": 171299,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 4,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=171299"
        },
        {
            "content": "Disclaimer: I'm still furry trash\r\nIf you read my review of Dog Days season 1, you'll find that I went in expecting a garbage show and ended up with a really pleasant experience. Season two is more of the same, but that's a great thing in this case. I'll give it an actual review this time too.\r\nStory: 7/10\r\nThe story is pretty much the same as season 1: the main character (whose name may be shinku or cinque depending on your subs) travels to an alternate world full of animal girls and partakes in battles there. The difference this time is that he brings his two friendsalong this time, and also there's a squirrel faction. Another big difference is that there's less plot escalation and tension this time around; the big war only lasts for 2 episodes or so. Even so, the show still finds ways to make the premises of each episode original and that's cool.\\n\\n\r\nArt: 8/10\\n\r\nThe art is bright and colorful, and there's more cool scenery this time around since they aren't always on a battlefield. All of the girls are really cute. That's about it for now.\\n\\n\r\nSound: 6/10\\n\r\nPretty generic fantasy, no standout background music but it gets the job done. I didn't like the OP and ED as much as season 1's, but that may just be me.\\n\\n\r\nCharacter: 9/10\\n\r\nSo many good ones! As I previously said, all of the girls are really cute, so if you're one of those people who likes to choose the best girl of your shows, you're going to have a tough time as it's really hard to hate any of them. There's also a lot of lesbians, just thought I'd point that out. Also, MC gains the ability to become like 20-years old and superpowerful halfway through the show, and he looks like a cross between Izayoi Sakamoto and Samauri Flamenco, so that's a plus I guess. Character development is much better than the first season 2.\\n\\n\r\nEnjoyment: 8/10\\n\r\nThis was a really comfy show to watch. I can't fully describe it but it's never a slog to get through, even if the show doesn't throw many twists at you. It's just a feel-good kind of anime.\\n\\n\r\nOverall: 8/10\\n\r\nIf you liked season 1, you'll like this one, perhaps even a bit more (like I did). I finished this a day before Dog Days\", the next season, comes out, and I have to say that I'm pretty excited for it! I'll end with the same ending as last time: \\n\r\nIf you too like touching fluffy tail I recommend this show.",
            "date": "2015-01-09T13:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 177057,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2976321.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/somaisbatman",
                "username": "somaisbatman"
            },
            "url": "https://myanimelist.net/reviews.php?id=177057"
        },
        {
            "content": "After kind of weak 1st season, I was delighted when I started the sequel. The most noticable change about 2nd season is there was no big plot in play and it worked perfectly for the anime in my humble opinion. It finally become what it was supposed to be, a light anime that makes you feel relaxed and happy and not to concern about some complex story. That was the thing I liked the most about it. In other segments it hasnt changed much since first season. Art style, music and characters stayed pretty much the same with a few additions, but none of thosethings are what made this anime so enjoyable. Hope the 3rd season keeps this recipe.",
            "date": "2015-01-19T13:45:00+00:00",
            "helpful_count": 5,
            "mal_id": 178535,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2492439.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Erebus25",
                "username": "Erebus25"
            },
            "url": "https://myanimelist.net/reviews.php?id=178535"
        },
        {
            "content": "It is pretty hard to choose where to stand for Dog Days'. On one hand you have a plotless, cheesy, and childish anime. On the other you have a nice, relaxing, refreshing, and a \"good for the sou\"l anime. I tend to lean more towards the second description.\r\nDog Days' is the second season for Dog Days (The difference is in the ' incase you haven't noticed). It would be wise to start with the first season, but it is honestly not that big of a deal if you skip that and move on to the second season. There is not much plot in either thatwill require you to know something to fully understand either seasons.\\n\\n\r\nThe story of Dog Days' continues off a few months from when the main character, Shinku, first travels to another world to become a hero. Shinku is preparing to go back to that world with his two friends, Nanami and Rebecca, to enjoy their summer vacation... That is pretty much it. Nothing else extravagant really happens... There is no major bad guy who is out to destroy the world or any extreme danger that the main characters must face and overcome. The first season at least had a story to it, but there is pretty much nothing to the second season of Dog Days.\\n\\n\r\nPlot and interesting story is not really where Dog Days - the first or second season- shines. Dog Days is more of a feel good show that warms your heart with constantly happy and cheerful characters. You feeling down? Then go and watch Dog Days cause nothing ever goes wrong here. No one dies or really gets hurt. The whole show is just episode after episode of the Heroes FUN adventures in another world. If you look at the Dog Days series in this way then it really is a well done anime.\\n\\n\r\nDespite the lack of any actual plot, everything else about this anime was wonderful. The art work was all colorful and extremely pleasant to look at. All the characters were very cute, or \"moe moe\", and the different events- like the wars and the concerts- were animated nicelyl.\\n\\n\r\nThe OSTs for Dog Days all set the mood very well. I personally preferred the music from this season better than the first, but both were very good. Like the story of the anime, the music are all cheerful and relaxing.\\n\\n\r\nLike i mentioned earlier, the characters in this show are all very nice and cute. Everyone has their own distinct personalities and none of them are really bad. It is pretty hard to hate on a group of middle school kids with cat/dog/squirrel ears and tails. If you do...well then this anime won't be to your liking.\\n\\n\r\nI really enjoyed Dog Day'. The relaxing nature of this show and its wonderful art and sound makes it a very pleasant watch. Each episode was very enjoyable (despite the lack of a story), and they had me saying \"aww...\" and thats nice\" a lot.\\n\\n\r\nDog Days' is a very nice anime overall. It might not be to everyone's liking because of the happy and sometimes childish elements; however, i still suggest you should check it out before you judge it. You might get a pleasant surprise.",
            "date": "2012-11-29T17:47:00+00:00",
            "helpful_count": 3,
            "mal_id": 78682,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1488843.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/The_Pro_At_Stuff",
                "username": "The_Pro_At_Stuff"
            },
            "url": "https://myanimelist.net/reviews.php?id=78682"
        },
        {
            "content": "Due to being in class this review will be short. Season 2 was a huge let down foir me. Everything in this season could just be said as \"happy happy joy joy\". The reason I say this is because there was no drama what so ever. Conflicts were minor in cliche. The best thing I can say about this anime is it's art. Enjoyment was ok at best. It had some comedy parts that did make me laugh. But this season was season 1 with more characters and no conflict.",
            "date": "2012-11-15T07:45:00+00:00",
            "helpful_count": 3,
            "mal_id": 77605,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1733097.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/archangel93",
                "username": "archangel93"
            },
            "url": "https://myanimelist.net/reviews.php?id=77605"
        },
        {
            "content": "To be honest, the second season disappointed me truly. As for those who have seen the first season, I must say that it was better. There was at the very least an actual story line to it. The story was indeed a disappointment. WARNING: SPOILER FOR SEASON 1 AHEAD. In season 1, there was that thrilling plot throughout the anime how Leo-sama sees the future with Millhi and Biscotti's hero dead. Towards the end, the action was very satisfying. For season 2, however, the story seems to me as if it was done on a whim. \r\n    Theart I like. It has neon colors. The characters are all created very nicely. The sound was satisfying as well. Unlike other anime, Dog Days have voice actresses that have very different voice. In many anime, it is very common for two characters to sound exactly alike.\\n\r\n    Character--that was a disappointment, too. I cannot help but feel that each characters' personalities are all alike. Take Cou, Rebecca, and Millhi for example. Their personalities seem the same to me and that makes me wonder, \"What makes each of them unique and different?\" It makes me feel that the creators are using one personality and splitting it into three characters.\\n\r\n    I would say I enjoyed it, but again, I preferred season one over this season. The episodes go on and on about the daily lives the heroes have there. However, what is the point? What is the main idea of the anime? I did not expect for Dog Days to be like the customary every day journal entry. I would have wanted some thrill in it, like it had in the first season. Overall, I would rate it a 7, though I am slightly reconsidering the score to a 6.",
            "date": "2012-09-29T19:53:00+00:00",
            "helpful_count": 1,
            "mal_id": 73663,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/800357.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Athena_Carolyn",
                "username": "Athena_Carolyn"
            },
            "url": "https://myanimelist.net/reviews.php?id=73663"
        }
    ]
]