[
    [
        {
            "content": "Second Season > First Season. \r\nNo, it's not a joke. \r\nI guess if you're here is because you watched more of the first 12 chapters, right? Utawarerumono: Itsuwari no Kamen, something that seemed to be a spin-off, was actually a sequel to Utawarerumono, hence many had expected something very similar to its predecessor and, in that sense, were disappointed, but... What so special is the first Utawarerumono?\r\nBoth series are of the same: a \"medieval fantasy world\" where peace is apparent, although there are frictions between various kingdoms, and where one day, appeared someone without memories whose fate will influence many people and the fate ofone or more nations, while looking to find out who is actually. The first part showed this from a more \"serious\" side, basically without any break between wars in its 26 chapters, however, we must not forget that this is also a \"fantasy\" and as such, it also has elements comedy, slice of life, romance, even harem in the case of the visual novel. In this sense, many apparently did not notice the flaws of the first season: everything was going at a frenetic speed, while time to present all its cast in an acceptable manner were not given. 26 chapters of war and more war is not entirely productive, there was almost no development of character, to the point that only a few were important and the rest were forgettable. As if that were not enough, even dedicating all its chapters to advance the plot, this was not developed at all well; everything was so rushed that did not explain certain issues, there were had many plot holes and an ending that leaves more questions than answers (and is not exactly a cliffhanger). The first season was not bad set, in fact his story is very interesting an with a good potential, but its development left much to be desired.\\n\\n\r\nNow, talking about Itsuwari no Kamen, which started much slower than its predecessor. In this case they decided to do something more \"faithful\" to its original concept, which apparently angered many who expected wars since the early chapters. Itsuwari no Kamen decided to dedicate its first chapters to the presentation of the characters and even had time to decide if you take their affection or not. \\n\\n\r\nYes, perhaps dedicates 12 chapters was too much, but it knew how to entertain us with a good dose of comedy and slice of life as we knew a little more to the characters. From the second half would start the real story: a more serious faction of today's world is shown located several years after the first season, with a story that has nothing to envy. The wars raging again, but in this case we see from the perspective of people who do not fight directly in them, we see Haku, our protagonist, who is not used to the horror of seeing people die before his eyes, and he has to deal with this situation, while trying to help his nation and his friends. Yamato, a nation with great military power faces several threats, including a possible war with the nation of Tusukuru. We must not forget one of the facts that makes this story very interesting: the mystery behind our protagonist, which has much to do about the origin of today's society, which this season is played less, but always in an understandable way and when you have seen the first season (where they left some plot holes in this issue). In only 13 chapters, Itsuwari no Kamen built a story that moves at a good pace, with serious, intense, intriguing and dramatic moments (the latter especially in the final chapter, with a great atmosphere that makes you reflect on the events that led to that conclusion) and how the characters were taken to that situation. Something that Utawarerumono did not quite very well in 26 chapters.\\n\\n\r\nThe characters are not the most interesting in the world, but enough to bring history and have time to at least take their affection. Haku is someone quite apathetic attitude a bit annoying but it brings, for both comedy situations, as for those moments where the character is in unexpected situations, where he has to show a change in their way of being if he wants overcome as a person and achieve his goal. Kuon is a fun character, but knows how to be serious when the situation requires. She's cute, beautiful, something perverted, rude and quite mature, basically is Best Waifu. Oshutoru is basically who makes the story forward, who saw the potential of Haku and made it what it is, just as Haku tries to support him, although his peculiar way. The rest of the cast is not much to say, they are all quite different in personality, but they fulfill their roles.\\n\\n\r\nIn short: Utawarerumono: Itsuwari no Kamen is an anime that has nothing to envy to its predecessor. Has a different way to develop the plot, very slow at first but satisfying in the end, an audiovisual quality above average and acceptable and charismatic cast. Although it might be better in some ways, it is a very enjoyable and entertaining series that achieved its goal. The final cliffhanger shows that the series has potential if it proposes.",
            "date": "2016-03-27T20:53:00+00:00",
            "helpful_count": 115,
            "mal_id": 214480,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3780539.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rhapsody-",
                "username": "Rhapsody-"
            },
            "url": "https://myanimelist.net/reviews.php?id=214480"
        },
        {
            "content": "This is a review written after I saw it entirely. So, it'll diverge a lot in relation to those which had been written around the beginning. Is my first review, mainly cause of the controversial feeling about this anime.\r\nStory: People may say that it hasn't a story, I say the otherwise. The first half can be a low-development kind. For those who compared directly with the first Utawarerumono, it really is slow and without a outter story development. Though, the second half goes on a exponential curve of \"Give me the next episode!\". So, we have character and environment presentation and later the rampage ofthe story. For those who searched about the anime, now that it is based on a 2-part visual novel, so, be warned that we have a \"half\" series, even so, I consider this season as a preparation to \"I hope there will be a\" next one.  \\n\\n\r\nArt: Well, the art is nice. The ambience is well made, and although there's a difference from the first one, in a few episodes you accustom to it. Well, the furry part is well made, as are the battles and \"special effects\". Some parts, considering the year of release, are lot better than the first one, which is expected.\\n\\n\r\nSound: I really liked the previous Utawarerumono opening (I love that one). They keep Suara's songs for the two openings (prefer the first one - really nice - but the second is really nice too). The endings are those slow-motion zen-kind songs, nice if you want to hear it (worst from all aspects). The general soundtrack is really good, mainly the last episode's ones; They match very well to the situations and ambience.\\n\\n\r\nCharacter: Well, we have a half season for that, if it was bad the overall would be to. We have a whole set of cliches to not cliches characters. I, particularly, really liked the MC - because he is really different from the normal-MC-way, and has a great development -. Aside from that, the whole set (older Utawarerumono characters, \"allies\" characters and enemies alike) are well made, be the visual, the actions, reasons, thinking, whatever. Even the lesser things cab be see as a potential character development fuel.\\n\\n\r\nEnjoyment: The fantasy slice-of-life that is the first part is, if nothing else, fun. I found it to be relaxing too. They have a equilibrium between fun and serious, a bit of overall development, new characters, being to know more of the world, etc. The second part is fun, cool, tense and all around some feels and emotions in some aspects (I'll refrain from spoilers, but mainly one part about the MC, and the finale). Basically, I watched one episode every week and waited for the next one from the first to the last episode.\\n\\n\\n\r\nSo, the overall note is kind a mean between all of it. I'm bad with rating, never know exactly what I think, Thus, pay more attention to what I wrote than tho the rating.",
            "date": "2016-03-28T15:24:00+00:00",
            "helpful_count": 53,
            "mal_id": 214589,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2016181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HikariKyuubi",
                "username": "HikariKyuubi"
            },
            "url": "https://myanimelist.net/reviews.php?id=214589"
        },
        {
            "content": "Utawarerumono: Itsuwari no Kamen is one tough anime to review. I started watching it without having seen the first season (I probably should have done that, but in the end I felt like I was able to understand the story without it) and had some mixed feelings while watching it. Utawarerumono: Itsuwari no Kamen is an anime that starts out as a slice of life and fantasy type of anime and ends as an action and drama type. I'm having a hard time deciding if that was a good thing since it made it good in some areas, but bad in others. As stated beforeI have mixed feelings about this anime, and I will now try to share those with you.\\n\\n\r\nUtawarerumono starts out with an extremely slow pace, extremely slow. Almost nothing happens for more than 10 episodes. The slow pacing is good in the sense that it introduces us to the characters and the world of Utawarerumono. The first few episodes are extremely relaxing to watch and easy to understand. As time goes on we gets introduced to character after character, that all gather around the main character. I can see why they all gather around him, I think he's a likeable guy with his casual lazy-type of personality. The characters around him get a fair bit of development considering how many there are. Too many for me to be able to count, and maybe not even remember. They each have some unique traits which make them avoid getting absolutely forgotten. But the side characters are too many to be able to genuinely contribute to the story, which is a shame since they also were likeable. All in all, the anime does a good job at introducing us to all these different characters, and sets us up for a promising ride.\\n\\n\r\nAfter the characters have all been introduced you would think that the story would start progressing, but that is not the case. After the characters have been introduced and developed, either nothing happens, or even more characters get introduced to even more characters. The middle of the anime, after the characters have been introduced and before the all the action, the anime turns stale and a bit boring. Maybe it was to fill more episodes, but it doesn't work out very well. These episodes are just a composition of random events that does not progress the story at all. The episodes contain some sort of action, but it's badly executed with the characters fighting armies by taking on usually 1, rarely 2 or 3, opponents at a time. The different action segments are boring and meaningless since it does not progress the story nor offer very much to the viewer. It's a shame that the good build up was ruined by this sudden stop of progress.\\n\\n\r\nSince the story of the anime stopped progressing, I had little hope that it would turn out good, or even decent. But at the end of the anime something finally happens, and it's actually something good and exciting. Since we get to spend so much time with the characters doing nothing, we are very likely to sympathise with them. When the story starts to unfold, we get to follow developed characters trough their adventures. This is great because we actually have feelings for these characters. Maybe not only good feelings, but we actually know these characters. The political twist (maybe not a twist if you've seen the first season) was nicely presented and executed. The power struggle was both fun and exciting to watch. The ending to this anime is great. It's bittersweet and definitely leaves an impact. \\n\\n\r\nThe animation of this anime is pretty good. It has a nice natural style which fits in nicely with the medieval type of universe. The background is detailed but at the same time it doesn't stand out too much. A fault with the animation is that it sometimes comes of as being lazily done. Mainly action scenes have too little going on. For example when armies are fighting, only a few people are fighting at a time. This makes the fights come of as unrealistic and genuinely bad. \\n\\n\r\nThe sound is not something that really stood out to me, all the openings and ending where decent, but not great. The soundtrack was also nothing that really stood out to me. Most voice actors where pretty good and the majority of the characters did a good job at impersonating their character. \\n\\n\r\nI enjoyed some parts of Utawarerumono, especially the start and end to it. But the middle of the anime just felt stale and boring. All in all Utawarerumono: Itsuwari no Kamen is an okay anime. Would I recommend it? I would if you like slow build up, a medieval type of universe and animation and/ or political disputes.",
            "date": "2016-03-27T11:04:00+00:00",
            "helpful_count": 43,
            "mal_id": 214381,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Katakurin",
                "username": "Katakurin"
            },
            "url": "https://myanimelist.net/reviews.php?id=214381"
        },
        {
            "content": "Everything about this anime is fantastic.In my most honest opinion,it is a good succesor to the 2006 season.The art is outstanding,story is very comprehensive and deep and expands its roots from the first season.The characters all have their own background behind them and very interesting and well-tought ones at that.While watching the first season will triple your excitement about this anime,you don't need to do that in order to see the fantastic story.It is honestly very rare for me to feel this way about an anime and encourage others to watch it as well,and not to give it a bad rating after watching only 25%of it :)",
            "date": "2016-03-29T10:39:00+00:00",
            "helpful_count": 33,
            "mal_id": 214688,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5005619.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Suffaru3",
                "username": "Suffaru3"
            },
            "url": "https://myanimelist.net/reviews.php?id=214688"
        },
        {
            "content": "Warning: Review may contain spoilers.\r\nUtawarerumono: Itsuwari no Kamen is a good example of why a second season is sometimes a terrible idea. I can't help but wonder if most of these \"reviews\" even watched this anime.\r\nThe \"successor\" to the charming first season of the series, which was a series with likeable characters that saw well-paced development, followed with a strong narrative and art/sound direction for the time and was an overall joy to watch.\r\nUtawarerumono: Itsuwari no Kamen, however, falls flat on all expectations short of art direction and soundtrack. Characters lack any real depth, they don't grow, bond or build a real relationship, we cansee characters lounging around for the better part of the series, 12+ episodes until anything happens isn't \"slow pacing\", it's poor writing and lack of actual content, and having a hack of a director in charge. The action feels forced and unnecessarily over-the-top compared to the first season when it does happen.\\n\\n\r\nWe're presented with Haku, an extremely unremarkable and outright idiotic main character with no redeeming qualities, who finds himself in the wilderness and is rescued by Kuon, an inferior and bland version of a character we had in the first season. \\n\r\nThis second season regurgitates and reuses some narrative elements such as amnesia, a character rising to become a leader, and inheriting a weapon that belonged to someone else,  in very cheap ways. \\n\r\nFrom the moment Haku shows up, he pretty much just receives everything, and everyone falls in love with him for no reason at all. He's lazy, ill-mannered, untalented and amnesiac. He is quick to form a harem of literal princesses from different countries through no effort of his own, there is no real development or storytelling to speak of. The first half of the series takes place in an inn where all the characters converge as if it were a cheap run-off-the-mill slice of life, the series tries to entertain with the \"yaoi fangirls\" trope every single episode which quickly gets old, even though it's not funny the first time, it definitely wasn't funny the 20th time.\\n\\n\r\nBy the time anything happens in the series, it's hard to take it seriously at all. Haku fails to care about anything other than drifting by and doesn't have any meaningful bonding with any of the other bland characters nor any noteworthy character development, he literally just lazily strolls through a war-zone while accompanied by the rest of the group who seem to think that going to war is a game, and after witnessing a single particularly gruesome event he pretends to be highly hurt by this for two episodes even though he has no reason to be. After 80% or so of the series has passed by, we're introduced to the cheap twist of \"this guy is actually amazing\" for Haku, he's supposed to be related to the late emperor! At this point the plot is trying to rapidly move forward in a rushed way, the empire is about to fall and the princess is rescued by Haku and his comrades, one of them dying along the way and entrusting the lazy good-for-nothing with the future of the empire, with absolutely no emotion or build-up at all. With basically no reason to do care or do anything, Haku accepts and pretends to be his fallen comrade and tries to rally his supporters to march towards the empire, and the series ends there. Astounding isn't it?\\n\\n\r\nAs far as the \"action\" goes, there's a clear exaggeration when it comes how strong and capable the characters are, as fights that were akin to medieval fantasy with some mild magic gets twisted into literally splitting mountains with a single slash, yet these people are unable to win fights against the old season 1 characters. This felt like an unnecessarily big narrative gap created by mindless shounen power-leveling and \"flashy\" fights. In the first season, characters had real reasons to fight, such as revenge and protecting their homeland and loved ones. In this series it's basically \"these guys are challenging **US**, we'll kill them!\"\\n\\n\r\nAll-in-all, Utawarerumono: Itsuwari no Kamen was extremely painful to watch, it's sad that the series which was solid and had laid the groundwork for something great was ruined by this. When it's not a mediocre slice-of-life harem with stale humor, it attempts at serious storytelling and fails.\\n\r\nI recommend watching the first season and skipping this one.\\n",
            "date": "2016-04-09T19:07:00+00:00",
            "helpful_count": 15,
            "mal_id": 215971,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2434093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Silfie",
                "username": "Silfie"
            },
            "url": "https://myanimelist.net/reviews.php?id=215971"
        },
        {
            "content": "- Be advised, don't read this review if you have not finish the anime as it contains spoilers -\r\nFirstly, I would like to say that I like Utawarerumono, but I haven't play the Visual Novel at all. Contrary to the high scores that most people give to this anime, I would have to say that this anime is one giant mess, whether it's because of the original material or the director, there is nothing great about the sequel to great series of Utawarerumono.\r\nThe main issue with this anime is its story which I really dislike, especially with how the anime starts and ends. In myopinion, the first cour of the anime from Fall 2015 is nothing but a giant filler. Why? It's because unlike its prequel, the first cour is a slice of life anime that has very little purpose other than introducing the characters and providing service to fans of Utawarerumono, especially when they re-introduce characters from S1. It must have been painful to watch this anime weekly, especially if you are a fan of the Utawarerumono series. Based on the first cour only, there is little direction of where the anime will go. Will any of the characters have any used to the story? Will there any plot at all? Is this the best that they could do? These are the questioned that I keep on having as I watched the first cour of the anime. \\n\\n\r\nThe second cour of the anime is where a real storyline starts to come to light as the Barbaric arc and the Invasion arc are introduced. This is where our characters are introduced to one of the struggle that they must face during those time, war. Something they must win if they want to survive during those time.  This is also when our characters from S1 and their country are introduced into the sequel, a way to remind us that they are still there, living among the characters from this anime. Furthermore, we are shown in the past as they bring back story from S1 like Iceman, the scientists, and the test subjects. We are shown here that the scientists are not evil, but they are the “necessary evil” as they have to deal with the curse and the mess that they bring to humanity. Just like the people of Yamato and Tuskuru, our scientists are there to survive and the only way to do so is to research the test subjects and Iceman to improve their genes. Finally, there's the ending that left a giant hole among the viewers heart as there is no sense of closure to the ending at all. The ending is a giant \"Fuck you!\" to the viewers as the relationship between the characters breaks apart and there’s no information if they will come back together again or it’s the end of their relationship. The ending makes all of the slice of life part from the first cour to be completely pointless. \\n\\n\r\nThen there's the characters of this anime which could be considered as the weakest point of this anime. The characters have common traits just like many other anime, they have a bishoujo, fujoshi, tsundere, and the list goes on. There is nothing special with the characters (maybe except for Haku), and with the little to no character development from the first cour, I can't really feel attached to the characters. Not just that, some of the supporting characters like Maroro and Kiuru have very little purpose to the anime and if we are to take out these characters, the anime could still continue. \\n\\n\r\nThe second cour of the anime is where our characters begin to develop, although only a little. From here, we can see that despite how happy-go-lucky Hakku is, he is dislike and afraid to the idea of change. He couldn’t bear the fact that the people that he spent with all this time could easily go to war and kill people like it’s nothing. We could also see the extent of their relationship as it was quite fragile, especially when the characters didn't know how to act towards Haku after the war with the Barbarians ended. We also started to see the development of relationship between Haku and Kuon as Kuon is starting to have a romantic feelings towards Haku. Despite all this, there's very little to no development to the side characters of the anime as we see that they have a problem here and there that serve to develop the characters, but that’s the extent of their development. \\n\\n\r\nDespite all the faults I provide previously, the art and the sound are likely to be the only strong point of the anime. There is a massive improvement with the art from S1 as almost a decade has passed by because every aspect of the design of this anime is great, especially the design for Akuruturuka for Vurai and Oshutoru. There is a great amount of details being put towards the characters and the world they live in. The Op, Ed, and Ost are great as well as they fit right into the theme of the anime, especially the vocals and lyrics of the music. I find myself not skipping the Op and Ed every time I watch the episode which just shows how lovely they are. \\n\\n\r\nOverall, I can't really find myself enjoying this anime, especially as the ending was too open ended and with no information about any sequel, I feel disappointed with this anime (although there's a sequel for the VN). Watching the first cour of the anime was quite painful and I find myself wanting to drop this anime if not for the characters from S1. This anime really have lots of potential and it could have done better with how the story develops. For example, they could have shorten the slice of life part of the anime into 3-4 episodes and use the remaining episodes to show the Rebellion arc. I really want to like this anime, but I just can't with the amount of faults that it has.\\n",
            "date": "2016-04-05T01:37:00+00:00",
            "helpful_count": 13,
            "mal_id": 215556,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4113589.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/popoklemos",
                "username": "popoklemos"
            },
            "url": "https://myanimelist.net/reviews.php?id=215556"
        },
        {
            "content": "*\r\nI'd say there might be mild spoilers, but then again, there is almost nothing to spoil :'( \r\n*\r\nBefore I start my rant I will state that I have enjoyed the art and soundtrack in this series (my reaction to the piano track was overwhelmingly positive) . Let us start with the fact, that I have liked the first Utawarerumono series quite a lot. That was mostly because of the narrative, character development and the relation between Hakuoro, Eruru and the rest of the gang. That being said,  Itsuwari no Kamen tried to draw some obvious parallels and teased us in a couple of scenes,but failed. At the end of the day, it has very little in common with its predecessor. The elation between the main two protagonists: Haku and Kuon, is cut short in favor of overly introducing the rest of the characters. This is a product that one gets when the makers try to put too much in and leaving single components half baked. It feels unfinished, leaving many plot holes. Some of them are obvious, others explainable by logic. The last episode made me cringe.\\n\r\n-> [SPOILER] I knew that Haku would take Oshutorus place before watching the anime, but the build up to this event was non existent. It was way too  sudden. He changes from a slacker into a responsible leader withing hours - really?! A+ on the character development #sarcasm. But the most irritating part was when Kuon cried over Hakus death. As if they were that close. That was so forced by the script that I stopped watching for a couple of moments. Why was she crying? There was no progression in terms of any kind of a relationship between them. No romantic scenes, e.g. holding hands, hugging, kissing... And now she weeps because she thinks he is dead. Give me a break. I was waiting the whole darn series for them to become a couple and all I've got was that? Was there another episode they have forgotten to air? The last episode was just insulting and infuriating. Had to rewatch the last episode of the original series to get my calm back[SPOILER] \\n\\n\r\nTLDR; You could make a 5 episode OVA and it would contain a more complex  narrative. As a fan of the original series, I got lured by the cheap trick called nostalgia. It has provided a very shallow story. It felt like a combination of a mediocre harem with some random fujoshi fanservice more often than I would appreciate for this title. Out of the whole series I'd probably recommend watching 6-7 episodes. A wasted potential of what turned out to be more of a filler than anything else.",
            "date": "2016-03-27T10:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 214363,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ifalna",
                "username": "ifalna"
            },
            "url": "https://myanimelist.net/reviews.php?id=214363"
        },
        {
            "content": "This is a lax review that falls more to the compartment style (and being my first review).\r\nAfter enjoying the first season of Utawarerumono, i wanted more! So i turned to Itsuwari no Kamen. Luckily i didn't watch the original show when it aired now 10 years ago because the wait and disappointment would have crushed me even harder than it just recently did.\r\nUtawarerumono: Itsuwari no Kamen starts off with setting identical to the original, but quickly changes to your typical slice of life fantasy setting. MC starts building harem of sorts and nothing reminiscent of plot or traces to first season is to be seenuntil first few episodes in.\\n\r\nThere are few major plotholes (just like in the original) that might someday get covered in future seasons but i wouldn't bet my money on that.\\n\r\nJust a little warning for those who loved first season; Itsuwari no Kamen is going to make you hate/feel angry towards the main cast at some point of story for some time. And you really wish you could see the original characters more often.\\n\r\nLuckily after slow start the story develops to better every episode towards the ending and after its over you're wanting for next season. Just hope it doesn't take 9 years again.\\n\\n\r\nCharacters compared to the 2006 original feel just empty (yes, there were some bad characters on the original, not denying that). Every girl is shoehorned to fill in cliche roles that make all harems so dull to watch. They act weak except in 2-3 episodes about battles where they're suddenly smart and powerful only to fall back to your sheepish little harem after the battle ends. \\n\r\nMale characters bonding with MC are all boring, empty wallflowers with the exception of 2nd MC. Boylove is everywhere (not that i mind, but it gets old fast).\\n\\n\r\nAfter first season this was a big letdown, but its slightly above average.\\n\r\nWell worth the watch if another world/fantasy setting is close to your heart.",
            "date": "2016-04-18T14:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 216653,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4223643.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Liveless",
                "username": "Liveless"
            },
            "url": "https://myanimelist.net/reviews.php?id=216653"
        },
        {
            "content": "Story: 4\r\nBland, specially within the first half of the anime and that’s 12 episode of runtime wasted on weak attempt to develop the characters. At best, the plot is mediocre. It again wasted the rich foundation the prequel built and the very detailed world already built. The show also failed to take advantage of a crucial plot event that should have made momentous changes to the story.Overall, very disappointing story but another element truly dragged it down.\r\nArt: 8\r\nFluid animation and nothing hurts the eye, though nothing to give you wow factor either. Characters designs receive thumbs up and in my opinion it is superior comparedto its predecessor and source material.\\n\\n\r\nMusic: 7\\n\\n\r\nThose tracks from the game (I haven’t watched the prequel anime but played the VN) just kills you with nostalgia. Aside from this and the decently timed tracks, nothing is truly noteworthy.\\n\\n\r\nCharacter: 1\\n\\n\r\nWhen the supporting cast interests you more than the protagonist, you know you failed to write a credible lead to your story. Our dear main character showed no real development, even after the “big revelation” nor any progress in his relationship with the heroine, who’s been dragging him along for 25 episodes. But no matter how well written our Kuon is, Haku is simply doing a great job dragging the whole cast and the show itself down.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nUtawarerumono is one of my favorite visual novel of all time and have a special place in my memory hence no matter how I dislike the protagonist I still found ways to enjoy this show with its lighthearted comedy and the cameos of old characters. Sadly it didn’t leave any sort of emotional crater of course all thanks to a terribly written protagonist.\\n\\n\r\nOverall: 4\\n\\n\r\nOverall this show’s stale plot and disappointing main character is the main reason of its downfall. \\n",
            "date": "2016-06-21T19:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 221447,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Quickie",
                "username": "Quickie"
            },
            "url": "https://myanimelist.net/reviews.php?id=221447"
        },
        {
            "content": "This anime is a failure as a sequel, so much so that it made me make an account to this website just so i could review it. \"A bunch of girls in a bathtub\" would be another name for this anime. The anime is about random girls who just decide to move in with the MC for no reason at all take baths about twice per episode, talk about boys all night long, and meet new girls to take baths with. The MC has 0 skills there is nothing special about him he barely even shows up since the story just kinda focused the entiretime on the girls in the bathtub but don't worry because you get to see some of the characters from the first season show up take a bath and never show up again. The girls are as cliche as they can possibly be there is nothing interesting about them and they all look the same. Okay so enough talk about the first 20 episodes in the last episodes a war just kinda happens for no reason some guy comes out of nowhere does some behind the scene shit and there was some fighting and what not the anime ended on a cliffhanger so there is probably gonna be another season but you can skip this one if you want because you will probably understand everything that happened in this season within the first episode of the next one. You dont really have to watch the first season to understand this one since, well nothing actually happen but you probably are going need to watch it for the third season if you are planning on watching it. Overall this season is an average harem anime with some yaoi jokes thrown in it.",
            "date": "2016-10-04T09:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 231076,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5745805.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/IP3an",
                "username": "IP3an"
            },
            "url": "https://myanimelist.net/reviews.php?id=231076"
        },
        {
            "content": "A lot of people complain about the fan service, but you have to remember what they were adapted from. This series has it's share of service, but the story is deeper than it seems, just like the first series it has mystery and a strange beautiful world that confuses and mystifies the MC. Sure this one could've been better, but all in all it is nothing more than a big build up to the next part. It has your suspense, wonder, fantasy, fighting and more, give it a shot before you judge it based on screen caps. The art and sound are one of myfavorite parts as it reminds me of the first series, some of the characters don't feel as though they contribute much so that could've been better, but all in all it was enjoyable. The art style was the main selling point for me, and so was the story since i knew from the start it was gonna be a build up series. Overall i highly enjoyed this show.",
            "date": "2016-03-29T09:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 214682,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5297665.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AgntTwelfth",
                "username": "AgntTwelfth"
            },
            "url": "https://myanimelist.net/reviews.php?id=214682"
        },
        {
            "content": "So first of all if you have not watched the original Utawarerumono anime you probably need to do that first or else there will be points in this story that you will definitely find yourself lost because this is a continuation of the original Utawarerumono story line.\r\nI found this anime quite a bit more enjoyable than the first.  You get more in depth with the characters and the tone is much lighter that in the original anime.  I do like how well the story progressed through each and every character ultimately building to the conclusion which in itself is another beginning.  \r\nMostof the anime has a light feel to it, although it doesn't skip a more serious tone hear and there the largest of which comes at the conclusion.  The animation is nice and clean and the sound and everything else is crisp.  Overall it is an anime that I would definitely purchase should it be released here.  \\n\\n\r\nThe one thing that did bug me about this anime is the ending of which there was none.  I'm not going to spoil anything for you but in case you didn't know the entire Utawarerumono series is based off of a popular game franchise in Japan and so the anime ends right where the game ends essencially.  So see no spoiler if you've played the game because you already know what is going to happen.\\n\\n\r\nThis anime seems to have been made as a tool to boost interest and promote the new game coming out this September which if I'm not mistaken is \"Utawarerumono: The Two Hakuro\".  Now here is the rub, will there be a concrete ending this time or will this ultimately lead us into another game after a third anime release.  The thing is I have no idea and I don't think anyone else does either.  The only thing that I do know from the preview of the new game is that it will seem to have a far more serious tone as Tusukuru and Yamato seem to be headed towards full scale war.  \\n\\n\r\nSo with that said hopefully there will be a third anime sometime in 2017 that will lead us further down the rabbit hole into the world Utawarerumono.  At least I hope that there is because it sure has been fun so far.",
            "date": "2016-04-02T11:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 215210,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/500571.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/widowmaker",
                "username": "widowmaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=215210"
        },
        {
            "content": "So, after watching the whole thing, even though i did not watch the first season, i do recommend it since because there are some ties regarding haku and kuon, so this is coming from a person who had not watch the first season, but do understand a few things from the first season, and who heard about the visual novel of this.\r\nStory-10, i heard some things in the visual novel, and the first half, 12 episodes or so, were more like, character introductions and such.  You know, that getting to know character to build more emotion to the characters. After the first half, thenit started getting to the story, as i see other reviews on here, they only watched like 12 episodes or below, and that is not so helpful.  \\n\\n\r\nArt-9, I love the art they use in this, really great, just simply love it.  had no problems with it whatsoever.\\n\\n\r\nsound 7- i do not love, i do not hate, it just simply enjoy it.  i like the first and 2nd op as well.  The sound are pretty good, not gonna lie.\\n\\n\r\nCharacter 8- As i said before, the character introductions, and such, its good.  Hence at the last episode almost made me tear up, and so i got kinda attached to characters, well im the type of person to get attach to characters.\\n\\n\r\nEnjoyment 10- there were funny scenes and action scene that got my hyped, including the ending which makes me want to know what going to happen next.  each epison was good enough for me, got my attention and my \"wanting\" of more episodes of this.  \\n\\n\r\nOverall 10- i wished others would also watch this anime, i highly reccomend it, it is great to me.  I also wished there were more Live Reaction videos to this anime, want to see their reaction to the interesting things.\\n\\n\r\n*First review ever*",
            "date": "2016-03-26T12:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 214235,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Krisient",
                "username": "Krisient"
            },
            "url": "https://myanimelist.net/reviews.php?id=214235"
        },
        {
            "content": "This had so much potential to be good, perhaps the game or manga[if there is a manga] would be better than the anime at delivering the finished piece of this utawarerumono story, but there is one glaring terrible thing of this series\r\nThe main character; i'm not saying his personality or anything is bad, it's how he's presented. He's constantly extolled as a character that gets things done, but what the story shows him really being able to do is fix a mill and teach the princess a lesson and even those weren't that great because with the mill he simply removes the stopper and withthe princess he coat tails off of ushutoru's words.\\n\\n\r\nIt would have been an amazing anime if it simply showed him actually doing things to later pull back to when they praise him instead of just saying he can do things with nothing to refer to.",
            "date": "2016-04-26T06:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 217210,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kuroclown",
                "username": "kuroclown"
            },
            "url": "https://myanimelist.net/reviews.php?id=217210"
        },
        {
            "content": "I'll start off by saying that I'm a big fanboy of the Utawarerumono series. I've watched the original anime series and it was so good that it made me play the Visual Novel version. (Which brought me into the Visual Novel world - this was a few years ago) So it's natural that I was overjoyed when I heard Itsuwari no kamen was getting animated. I also came in with some expectations.\r\nWith that said, here's my slightly biased review of Utawarerumono: Itsuwari no Kamen.\r\nStory:6\r\nThe first few episodes were beautiful, it allowed first time viewers to get used to the world and the people in it.Then the plots slowly starts to go south. The biggest thing that bugged me was combat. We see characters that laze around doing nothing, suddenly become proficient at using their weapon. We are told, but not shown how they've gotten stronger. It is most likely due to the fact that this anime was based off a SRPG, where the player trains the characters. At the end, a lot of things were left unexplained and plot points left hanging, but I will talk about this more at the end of this review.\\n\\n\r\nArt: 8\\n\\n\r\nI'm no expert at spotting errors in animation so I can only give you my impressions as viewer who focuses mostly on the plot. The scenery in the first few episodes blew me away, it really gave you a sense of being in the world. The large scale battles featured cookie cutter soldiers, but I'm fine with this as it is pretty expensive and a waste of money to try and anime each solder individually in a large battle. All in all, character movement felt smooth and the colors used in the anime felt natural.\\n\\n\r\nSound: 9\\n\\n\r\nNothing to say but great. If you enjoyed the type of music in the first series, you'll love the ones here. \\n\\n\r\nCharacter: 6\\n\\n\r\nExcept for a few, most of the characters in this anime felt flat and their actions felt mechanical. I will explain more about this at the end of my review.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nUtsuwari no Kamen will feel nostalgic to those who've watched this first series and just seeing the world and characters is enjoyable. Somethings will bug you like inconsistent plot and characters, but that is due to it's SRPG nature and a fact that I will discuss right below. \\n\\n\r\nRant\\n\\n\r\nFor those of you that don't know. Next we'll mostly likely get the next season during the Fall 2016 lineup. Why you ask? It's because the last visual novel of this series will be released that day. Why am I talking about next season on a review for this season? This is because you'll find that everything in this season is a buildup for next season.\\n\\n\r\nWhat essentially happened was that they made the visual novel too large, so they split the story into two games. (Utawarerumono: Itsuwari no Kamen and Utawarerumono: Futari no Hakuoro) Which forced the anime to follow the same pattern and the viewer is left with lots of unexplained and hanging plot at the end. For those of you that have watched the first season, all of Itsuwari no Kamen is basically like the world building in the first few episodes of the first season. Now this wouldn't be a bad thing if the director could create some anime original scenes to smooth the transition from a SRPG visual novel to an anime, but due to the fact that there's already a sequel in plan, the director is not given much leeway. The anime is sticking so close to the source material that some plot points feel extremely awkward/doesn't make sense due to the SRPG elements. \\n\\n\r\nOverall: 7\\n\\n\r\nTl;Dr Don't expect too much from this season as it is just world building for the next season. \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-03-26T23:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 214310,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4577890.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/whitetragedy",
                "username": "whitetragedy"
            },
            "url": "https://myanimelist.net/reviews.php?id=214310"
        },
        {
            "content": "Story\r\nthe story starts with Kuon   which is the female main character of this series  . The story overall was awesome if you loved the first season as it expanded on the story of which how the experimental beings from the first season or the people grew and became the prominent people we know in the story . It explains why Yamato is so advance and why Yamato is able to have the masks like in the first season even though its not nearly as strong as the original mask . Though the ending maybe abit of a disappointment but its still anawesome story non the less \\n\r\nArt\\n\r\nThe art was amazing if you loved the art in the first anime this is just as good.\\n\r\nSound\\n\r\n The sound is nice and matches all the feeling and emotions  you face while watching it making it a more thrilling and fun anime to watch . \\n\r\nCharacter\\n\r\nThe development of the story is quite slow but is always accompanied with humor and something new to learn about the characters . In every episode you can always feel the character has improved or grown one way or the other  which is very interesting to watch .\\n\r\nEnjoyment\\n\r\nI enjoyed how the characters developed and learning more of the history and lore of the original anime Utawarerumono . There are many exiting and funny twist in the story making sure you are not bored especially in the last few episodes . Though i would definitely love it more  if the ending wasn't so sad\\n\r\nOverall \\n\r\nI would say if you loved the first season and love to know more of the history and lore of the anime you should definitely watch it as its an anime full of fun adventure comedy and romance and would make anyone who watches it satisfied",
            "date": "2016-03-27T10:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 214362,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278575.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sazerarrow2",
                "username": "sazerarrow2"
            },
            "url": "https://myanimelist.net/reviews.php?id=214362"
        },
        {
            "content": "In 2006, the world was graced with a fantasy world of animal themed people surrounded by mystery and war.  The series known as Utawarerumono has since then become a bit of a cult classic with its mix of fantasy and science to formulate the world's backstory, in conjunction with the present day story with what is essentially a completely new world.  And so, 9-10 years later after the first Utawarerumono, we have Itsuwari no Kamen, the false faces, the second installment of the Utawarerumono trilogy.  \r\nStory:  Twenty years after the end of the first Utawarerumono ended, the world has been relativelytame.  It is here where we find ourselves in a different, larger country to the newborn state of Tuskuru, where we follow the story of a woman by the name of Kuon and the man that she found that she names...Haku.  \\n\\n\r\nThe story of Itsu, as I shall be referring this series as, is split into two parts, corresponding to the two cours that make up its entire runtime.  Contrary to its predecessor, Itsu is a more character-based story, focusing more on the development and characteristics of each and every main character that they introduce to some extent.  The entire first cour is virtually plotless, as it spends its time more on the development and building of its main cast, involving Haku, Kuon, and several other characters that each receive their own quirks and traits that make feel more like characters than pieces that follow a plot-based story.  The issue that arises from this is the fact that the plot itself during this section of the anime really doesn't have much going on about it.  By devoting itself to defining its cast, the show sacrifices any sort of plot development and doesn't feel exactly like what we were presented with back in 2006.  \\n\\n\r\nThe second half of Itsu on the other hand is what would be considered more as 'Utawarerumono'.  As the series was originally a tactical RPG game, the series dives into its traditional style of war and conflict, which really only benefits the series.  Due to the fact that the series sort of slogs on with its first 12 episodes, only to give us a plot based story with more defined characters, the story overall in that sense just feels more well written and makes more sense overall.  Character motivation during this second half is more defined, the different viewpoints of war and rule, what is best for the people of a nation; all of these are tackled with much more value to them.  \\n\\n\r\nAnother thing that this series does, and is just a positive for the entire Utawarerumono series as a whole, is the idea of world building.  Because we're in a completely different country to the one we see from the original series, the structure, culture, and overall feel of the place is completely different.  Yamato is a very powerful country that has a lot of land and power over the rest of the world.  And you get a sense of that with the way the country is set up, the daily lives of the citizens there, and the impacts when that powerful pyramid crumbles down.  All in all, we get such great world building that there really isn't much for me to complain about.\\n\\n\r\nAll in all, while there were some bumps in the storytelling on account of the fact that there was virtually no plot in the first half and JUST plot in the second half, personally, I think that the story only benefitted from this, as the actions and events were more personal and impacted the characters in a way that would've otherwise been null if they didn't spend that time.  The end is definitely a more open end, as the story is more or less setting up for hopefully, the third game's anime adaptation some time down the line.  (White Fox, PLEASE get on this.)\\n\\n\r\nOverview:\\n\r\n+  World Building\\n\r\n+  Good second half \\n\r\n+/-  Good first half (This is dependent on whether you would appreciate the time spent on the characters or hate just the sheer lack of anything and the randomness of some of the stuff that happens.)\\n\r\n+/-  Open end.  (Does well for setup and is bittersweet, but doesn't REALLY finish the story.)\\n\\n\r\nCharacters:  Itsu does a complete clean sweep in its character department, as the series focuses on an entirely different group to the characters that we knew before.  \\n\\n\r\nUp first is Haku, the 'new' Hakouro of the series.  After waking up without any memory as to who he was (Gee, that sounds familiar), he is found by Kuon and is dubbed 'Haku' by her, now under her responsibility as she is his 'guardian' of sorts.  (Ka na.)  However, that's where the similarities between these two men ends.  Haku is more or less the opposite of Hakuoro, being less willing to do physical tasks and has a very negative outlook on war and the kind of destruction that comes with it.  As the series progresses along, Haku becomes a hardened character that grows out of his innate inability to do anything.  He's a realistic character that has an odd charisma of always having a \"I'm so done with this shit\" expression everywhere he goes.  All in all, Haku's growth as a character makes him a much better character overall as you can see his ascent of willpower and growing into the ideals and wishes that he wants to fulfill as the events of the series impacts him.  We also get a backstory to him that ties into the events of the continuity, adding in his hand into the ordeal that created the world of Uta.\\n\\n\r\nThen we have Kuon, the 'new' Eruruu character of the series.  Aside from having the ability to heal, Kuon doesn't really have any traits that the previous female protagonist had with her.  She's a much more mischievous, hot tempered girl who loves to eat, play, and acts as a sort of 'mom' character in a sense.  The main issue that arises from Kuon is the fact that her motives or backstory are more or less shrouded in mystery.  The series does give clues and facts as to how she came to be, but towards the near end of the series, there're hints to show that there is more to her, and that she has an underlying motive for finding and caring for Haku, which really doesn't get explained.  Maybe we'll get information in third adaptation, but at the time of this review, there really isn't any information currently to explain that.\\n\\n\r\nFor the rest of the cast, we have a variety of players in the game.  We have the two noble princesses from different provinces in Yamato, Rurutie and Atui, the general of the right, Ukon and his sister Nekone, the novice archer, Kiuru, and the entire government and military structure of Yamato, including the emperor, his daughter, and the Eight Pillar Generals, powerful leaders who command their own army that obey the will of the emperor to ensure that the country of Yamato will continue and prosper, and the best girl of them all, Kokopo the giant bird.  (Seriously though, this bird is an AMAZING character.)  While mostly side characters, these members of the cast, most of these side characters don't really feel it.  They add to the atmosphere of this new country, as their values, culture, and ideals largely differ to those from the cast in Tuskuru.  The majority of them are defined and mesh very well with the story, creating a genuine feeling world.  Several in particular, Oshtoru and the emperor, play bigger parts and act as both plot devices and characters that add more to the story.  Overall, this side cast is much better crafted and really only added to the story (Except Ponpo of course.  Hate that bastard).  Plus...there might be a couple...return appearances here and there.  \\n\\n\r\nOverview:\\n\r\n+  Characters that have both plot importance and development\\n\r\n+  Defined cast\\n\r\n+  Characters mesh very well with the story\\n\r\n-   Some missing and/or incomplete motives for some characters\\n\\n\r\nArt:  Produced by White Fox, an offshoot of the company Oriental Light and Magic who made the original Uta, Itsu returns back with a fresh coat of paint from the olden style of the original Uta series.  With a much more refined look to it, the true beauty of the asian inspired world of Utawarerumono comes back full force with wonderfully produced backgrounds and fluid animation.  \\n\\n\r\nThe overall look of Itsu took what was good about the original Uta's art, and just sort of elevated it.  While some moments were taken into liberty with CGI in order to animate certain scenes, there wasn't particularly anything messy or bad about it.  In fact, it still looked rather fluent even with CGI employed.  (The curses looked a bit off.  I'll say that much.)  What does bother me about the art is how everything has this slight tint of beige to it.  The colors of Uta have never particularly been bright, but everything just looks a bit too dull in terms of color.  \\n\\n\r\nAnother thing that Itsu has is fanservice.  It doesn't have it in spades, but in certain scenes, most prominently in the first half of the series, there are scenes that detail more risque moments in the bath.  (Because Kuon is apparently a cat that likes to take a bath.)  It's not that much, but I just thought that a little warning was a good idea.\\n\\n\r\nOverview:\\n\r\n+  Consistent, good quality art  (Oh White Fox, you do spoil me)\\n\r\n+  CGI that was used was more or less fluent\\n\r\n-   Colors look slightly dull\\n\\n\r\nSound:  I think one of the more defining parts of the Utawarerumono series.  As the entire OST is more or less based around an oriental style of music, the tracks sound more unique than your traditional anime OP, ED, or OST in general because of that.  Taking her reign back as the singer for the Uta series, Suara makes a comeback to sing every OP and ED song that the OST has, just like what she did back in 2006 with the original Uta. \\n\\n\r\nThis time, the OPs have a more serious tone to them while the EDs have a very relaxing and mystical tone to them.  All four of these tracks are very memorable and evoke the feeling of the oriental and mystical war anime that Utawarerumono is.  Personally, I think that Suara's style of music perfectly represents Utawarerumono, so much that it's just difficult to think about Utawarerumono WITHOUT these tracks.\\n\\n\r\nOverview:\\n\r\n+ Perfect OST  (There are NO complaints or bad parts about this.)\\n\\n\r\nPersonal Enjoyment:  Utawarerumono was a series that intrigued me for a good long while.  After I took it out of the backburner, I found myself enjoying a series that was actually more deep in its lore than I originally thought.  I love stories that have lore to them, and when I found that Utawarerumono was having a sequel, I was excited.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nOh, far more than I should've.  I love stories that just add to the continuity, and really there wasn't anything about this show that I didn't like.  The characters were enjoyable, the story over time transitioned to what the original Uta was structured like, and we got a look into the aftermath (sort of) into what happened after the events of the original Uta.  Plus, the soundtrack, my god, it's heavenly.  (And the cameos!!!!)  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nTo get into specifics, Ponpo.  The character Dekonponpo is the saddest excuse for a living being and I hope that waste of life and space dies very soon.  Such an irritating and terrifyingly designed character.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you saw the original Uta, you should watch this.  It continues the story and adds another layer of depth to the world of Utawarerumono.  It is the second part to a trilogy, so more or less, this is the 'lead-in' part of the series that moves the series to its final conclusion, so it doesn't exactly end cleanly, but nonetheless, it is a fitting end.  If you're new to Utawarerumono or you're interested in a fantasy series with war and some relatively deep lore, I would strongly suggest you watch the original first.  Despite what people think, this is a story that happens AFTER what happens in the original series, and there will be continuity mistakes if Itsu is watched without any prerequisite.  Until then, it's time to slumber and wait another decade until they release the third and final installment.  And boy, a day that will be.",
            "date": "2016-03-26T21:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 214303,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=214303"
        },
        {
            "content": "I watched and rewatched the original 2006 series several times. This alone probably gives you a decent idea of how much I enjoyed it.\r\nWhat initally drew me to the original was the combat and how it was relatively realistic, at lwast by anime standards sure it had super human strenght (karula) and super speed. some people could jump 20 feet in the air (although realistically that would have gotten them killed) and there was magic and mechs. The mechs although overpowered were meant to be and i could accept them. The magic was also not over used and was not as overpowered. As for militarytactics i could list out a whole lot of issues but thats for another time. I still want to leave that cavalry cant charge through spearmen like that but thats what anime is\\n\r\nI also appreciated the fact that the main character was level headed and very capable. He might have been too lenient at times, but that's japanese influence there, not much the creators could have done there.\\n\\n\r\nNow enough about the original. \\n\\n\r\nOn the topic of combat theyve completely thrown out realism for the more popular one man army general idea thats so common in asian movies and stories. \\n\\n\r\nI mean seriously if one woman (munechika) could basically wall crush an entire army why does she even have an army with her. Same for that blondie human nuke. Theyre as big a threat to their own men and they dont even use them except for the clean up. While on the topic of combat i really cant agree with women just running up and beating the crap out of trained soldiers. I mean yeah in the original there were women in the army but they were extremely special cases. Karula belonged to a tribe that had natural super strength and touka was part of some miliatary order that served justice or something. In this we were given absolutely no explanation as to why they could fight. Anyways even if there was 5 people charging an entire army is completely useless, they should have been speared to death at a distance. \\n\\n\r\nAs for the characters \\n\r\nHaku with his retorts were probably the saving grace of the anime\\n\\n\r\nThere was also a bit too much gay with the princesses and all for my taste. Sure i get that they might have wanted a bit of comedy but episode after episode of it got annoying\\n\\n\r\nAs for the rest it didnt feel rushed (not too much at least) the art and sound was good so i dont have much else to complain about",
            "date": "2016-10-04T18:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 231105,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4108135.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/fang3412",
                "username": "fang3412"
            },
            "url": "https://myanimelist.net/reviews.php?id=231105"
        },
        {
            "content": "This review is written by someone who has watched the prequel first, then read the visual novel, and then watched this anime without reading the novel for this anime. Spoilers will be present and announced later in the review.\r\nThe prequel was fun enough for me to want to read the VN and watch the sequel. The VN was a nice addition but the anime itself was a good one. However I can only say I'm very dissapointed in this sequel anime. I've seen people claim Fate/Stay Night is the kiddy version of Fate/Zero because the cast in F/SN mostly consists out of kids. I heavilydisagree since plotwise Stay Night is just more complex than Zero. However this sequel does seem to be the kiddy version of the prequel.\\n\r\nThe original Utawarerumono was written for 18+ (and the anime 17+) and I think that reflects in the story and characters. The sequel was originally written for 15+ and the anime itself is 13+. As such, we got a lot of bathing scenes to start with for horny young boys and yaoi jokes for fujoshis? It's not just these details, it just reflects in about everything.\\n\\n\r\nAnyway since this is the sequel of the anime from 2006 I expect you to have seen it or atleast plan to watch it before you watch this. As such I will make comparisons since I don't think this anime should be watched as stand alone.\\n\\n\r\nBefore I start to point out all the things I'm not satisfied with or just want to adress, I have to admit, the anime is well animated and does looks good.\\n\\n\r\nThe points I want to adress are:\\n\\n\r\nStructure of the story\\n\r\nFanservice\\n\r\nHumour\\n\r\nPlot\\n\r\nCharacterization\\n\r\nInconsistencies\\n\\n\r\nThe structure is as follows. You do not get an introduction to your main character, it's pretty much like how the prequel started, guy with no memories is found. Someone takes care of him. They then travel around and meet people. The first 2-3 episodes are somewhat about fighting, survival and introduction to the setting of the world we're going to be seeing. Then a part which people like to call the slice of life part follows, in which a lot of characters are introduced episode by episode. Some of these characters will join the main cast actively. This isn't actually slice of life as it actively seeks out events to introduce more people. As such, you will have no idea how much time has passed as this is aslo never mention. Then action happens and doesn't stop till the end. You may or may not like the slow 9 episodes after the first 3, but that's pretty much what it has to offer.\\n\\n\r\nThe fanservice is is mostly at the start and in the early stages of the slice of life parts. There are tons of bathing scenes where they're basically showing everything except for genetalia and nipples. My personal opinion is that it felt like they had to put these in to keep the attention of people who can't keep focused unless stimulated.\\n\\n\r\nThe humour is pretty decent half of the time, other times it's repetitive or misplaced. One of the most recurring themes for humour is yaoi. Now it's not wrong to try to entertain people with yaoi, it is however getting old fast if you use the existence of yaoi and embarrassment of being associated or reading yaoi repeatedly.\\n\\n\r\nThe plot is a pretty meagre one. A guy with no past basically gets a girl to help him out. Then for no reason girls start flocking to him. The MC spends some time in the capitol before he finaly gets caught up in battle (by choice). For some strange reason great things are expected of Haku, our MC.\\n\\n\r\nThe characterization is also pretty meagre at best. \\n\r\nHaku is the MC, he's lazy and somewhat smart. Since he tries to actively avoid doing anything you don't learn much about him except his fondness of being lazy. Oh and he does like his friends.\\n\r\nKuon is traveling around she claims she sees Haku as someone she has to take care of and acts motherly around him. She has a lot of family who she respects or so it seems at first.\\n\r\nUkon is a strong man who likes to help people out, he's also very devoted to his emporer and for some reason very fond of Haku.\\n\r\nNekone is obsessed with her brother and basically looks down on everything silly.\\n\r\nRurutie is a princess that likes yaoi, cooking and is perhaps a bit jealous. Oh and she's not very fond of fighting and has a bird that's combat capable. \\n\r\nAtui is a princess whom is combat capable, she's pretty easy going and I think she (or else it was Rurutie (this is how important this detail was regarding the story)) was looking for love.\\n\r\nMaroro (cowaredly)/Kiuru very fond of Haku for some reason.\\n\\n\r\nSome inconsistencies are that Yamato, the region where this anime seems to take place, doesn't seem to exist at all in the prequel. If it existed, then the Avu Kamu arc would probably have gone drastically different. Also powerlevels seem higher here and technology a lot more advanced. Magic also plays a much greater role. Also I cannot imagine Dii or however you wish to spell his name not having interfered in Yamato. Also there's a huge tamed bird that's combat capable, if so many combat capable creatures were out there, where were they in the prequel? Also for some reason Onvitaikayans or however you want to call them and ultra strong bugs are now roaming the earth freely.\\n\\n\r\nAnyway my conclusion is that the art and animation are pretty good, the story is told in such a way that there are gaps here in and there which makes events harder to explain and timespans aren't clear. Humour is good at times and at others it could have better been left out. If you liked the setting of the prequel and only look for something like it, this anime can be ok. It's just important not to expect to see any characters from the prequel or any dept in story or characters.\\n\\n\r\n====Spoilers/in dept start here====\\n\\n\r\nYaoi is ok, you can make jokes about it, but when you send Yaoi to your general out at war to raise her morale and the General actually goes ahead and read it... That's just forcing the humour out. Also there were lots of moments in serious epsiodes which were about fighting and surviving where predictable humour was added. Not only do these things ruin the atmosphere they also ruin the pacing and what not.\\n\\n\r\nThe plot in my eyes is very very bad. Kuon saves Haku, that's ok. Haku saves Maroro, that's ok. Ukon saves everyone, that's ok. Then they get to the capital. About 9 episodes where nothing plotwise happens is OK. But these episodes are not used to establish bonds, to make characters flourish which basically bites back later when things speed up. Haku goes to war to join Ukon. This is still OK. Haku sees Vurai's mass destruction and is scarred for life. That's OK. Then Tusukuru war happens, which is very sudden and unexpected. Haku then accepts the mission. That's where it all goes wrong. There's no reason for Haku to join the war. He dislikes war, he doesn't want to see innocent people die. He also, isn't attached to Yamato so there's no reason for him to serve. Also there's no reason for HIM to serve in the first place, it could have been ANYone. Then they go search for Kuon. My logical reaction would be, Kuon has gone home to her homeland to defend it. Instead they go around looking for Kuon at food stalls. Then the most surprising thing of all, Kuon decides to help Yamato. Fighting Tusukuru to her, means possibly facing Karura, Touka, Aruru, Kamyu, etc etc. People who she calls mother/sister. At war, Aruru then leads them to their generals camp. For reasons unknown ofcourse. Haku then decides to do what Hakuoro did too, recycling tactics is fine. Eventually they succeed in destroying the provisions and go home empty handed. War with Tusukuru never happened. Then plot and betrayal which is OK.\\n\\n\r\nThe characterization is one of the worst things of the anime.\\n\r\nKuon mothers over Haku and is secretly very fond of her family. She respects them deeply. She said she wanted to explore the world, which is fine. But that also means she doesn't have a real connection to Yamato, thus no reason to help Yamato wage war. And her reason to join the war was to end it swiftly, I'm not sure how she though she was going to end it swiftly but it was never shown in any way that it would end swiftly. It feels like Kuons reason to wage war against her homeland was ungrounded and therefore a bad decision to make her do so.\\n\r\nHaku is lazy, not combat capable and does want to help his friends. His first \"fight\" would be against the giant bug. He was useless. His second fight was when he was in the capitol. If I had to make a good estimation, a couple of weeks upto a month had passed. Ukon fought him and told him he had improved. WHAT? Improved how? How did he change from 100% useless to combat capable? Surely he wasn't practising, atleast we were never shown any of it. Time passes again and he defeats guards, people trained for combat over a prlonged period of time. Later he blocks a blow from Vurai. Yeah that's pretty ok to do, Vurai isn't even strong.... Anyway for some reason he got ultra strong and combat capable without any reason.\\n\r\nHarem girls: \\n\r\nNekone, just dislikes everything except her brother, more, we don't know of her. She is supposedly smart and educated beyond her years. Her role is nonexistent.\\n\r\nRurutie, we don't know anything about her except that she likes yaoi, cooking and dislikes war. Her little act at the end pointing a dagger at Kuon is first of all out of character (as she just agreed with Atui she wanted to help them).\\n\r\nAtui, is easy going and combat capable. That's basicaly her whole role. It's unknown to me why any of these girls flock to Haku.\\n\r\nMiko girls: Fanservice/humour device/deus ex-machina magic, but usually useless because of magical barriers they then just shield.\\n\\n\r\nPrequel characters: \\n\r\nKarura, hates to be called mother/drinks/investigates?\\n\r\nTouka, servant of Karura?\\n\r\nAruruu/Kamyu like Kuon, want to look after Kuon. And about Aruruu, it's still a mystery why she helped Kuon/Haku to the camp.\\n\\n\r\nI mean it's all great and fun if you want to add characters from the sequel, but atleast give them some character or part to play. Touka for instance made an appearance, but if she didn't NOTHING would have changed, the same goes for Kamyu. Karura and Aruruu atleast played a small role.\\n\\n\r\nThe characters are just poor. Atui plays a bigger role in the sequel than Touka did in the prequel. But yet I can tell you a lot more about Touka than I can tell you about Atui. Touka for instance is a Evenkurga or however you wish to spell it. She was devoted to help good defeat evil. She has high morals and would only do what she thought was right. She's combat capable because she grew up in a clan where that would be normal. She decided to serve Hakuoro because she wanted to repay her debt. She feels a strong sense of duty to bring back the body of that other king home and play as a body guard for Hakuoro leaving him pretty much guarded most of the time even to an extent that it could become seem as a burden.\\n\\n\r\nAlso it makes sense that people flock around Hakuoro, he helped Yamamura, solved the Mutikapa problem helped around with other stuff. Got accepted as one of their own, got appointed head of the village. Lead a rebellion, defended his people against enemies, rebuilds what's lost. Haku doesn't do anything to deserve people gathering around him. So it's not logical that they do.\\n\\n\r\nAlso told why Mutikapa was combat capable, and thus it's logical why Mukkuru is too. But there's not explanation or anything about the giant bird. This is just another thing that shows the prequel clearly put more effort into details.\\n\\n\r\nThe inconsistensies are mostly that things exist and are present in the sequel that would probably have altered the course of the prequel if they were there as well. The world was about lost when the Avu Kamu were roaming the world. But as far as I can tell, those things wouldn't have gotten very far invading Yamato. Tusukuru used to be a small country with a relative small army. A decade or 2 later they became so strong Yamato couldn't even defeat them. Oh and Tusukuru warships with magic cannon like shooting... Then there's the wildlife that I mentioned before, the technology to make cages go up and down for bug fighting with lighting that all ignite at the same time almost like lighting. The story about the mask and people being wiped out was also different. In the prequel people were living in the underground because because above they couldn't survive. In the sequel it was shown that people turned into those blobs and then some kind of ultra laser shooting down destroying everything. (including a city which seemed like the city it was taking place in). But it would make more sense to me, if something like that would happen before people would grow close to extinct rather than afterwards. The prequel clearly showed that Iceman was released, conceived a child, then imprisoned again. He then changed people into blobs. Laser beam then destroyed a lot. This suggests that Iceman and furry eared people had been roaming the earth where people cannot follow for a year or so. A huge city above ground suggests otherwise.\\n",
            "date": "2017-05-29T05:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 248796,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3319957.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/doom19876",
                "username": "doom19876"
            },
            "url": "https://myanimelist.net/reviews.php?id=248796"
        },
        {
            "content": "The first Utawarerumono is vastly superior to this one. What made the show very enjoyable were its characters. In the first series we have Hakuoro, who is much more mature and intelligent than the protagonist, Haku, of Itsuwari no Kamen. Haku is in possession of a middle schooler's brain while Hakuoro has a mature one. This goes for the other main characters to a large degree as well. I realize that some of them aren't that old, but the sheer stupidity of some of the things they do is unfitting of someone with slightly above average intelligence. Average and below average intelligence are not enjoyableto watch. Keep in mind that i write this review considering someone with average intelligence to be frighteningly stupid. There are times and places for characters that are stupid, but this show is not one of them, especially not in the places of the main characters.\\n\\n\r\nThis show is very character reliant, and as such is very disappointing after having seen the first Utawarerumono. That being said, it's still much better than the average anime show.",
            "date": "2016-07-16T21:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 224209,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564087.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ryanz84",
                "username": "ryanz84"
            },
            "url": "https://myanimelist.net/reviews.php?id=224209"
        }
    ],
    [
        {
            "content": "Second Season > First Season. \r\nNo, it's not a joke. \r\nI guess if you're here is because you watched more of the first 12 chapters, right? Utawarerumono: Itsuwari no Kamen, something that seemed to be a spin-off, was actually a sequel to Utawarerumono, hence many had expected something very similar to its predecessor and, in that sense, were disappointed, but... What so special is the first Utawarerumono?\r\nBoth series are of the same: a \"medieval fantasy world\" where peace is apparent, although there are frictions between various kingdoms, and where one day, appeared someone without memories whose fate will influence many people and the fate ofone or more nations, while looking to find out who is actually. The first part showed this from a more \"serious\" side, basically without any break between wars in its 26 chapters, however, we must not forget that this is also a \"fantasy\" and as such, it also has elements comedy, slice of life, romance, even harem in the case of the visual novel. In this sense, many apparently did not notice the flaws of the first season: everything was going at a frenetic speed, while time to present all its cast in an acceptable manner were not given. 26 chapters of war and more war is not entirely productive, there was almost no development of character, to the point that only a few were important and the rest were forgettable. As if that were not enough, even dedicating all its chapters to advance the plot, this was not developed at all well; everything was so rushed that did not explain certain issues, there were had many plot holes and an ending that leaves more questions than answers (and is not exactly a cliffhanger). The first season was not bad set, in fact his story is very interesting an with a good potential, but its development left much to be desired.\\n\\n\r\nNow, talking about Itsuwari no Kamen, which started much slower than its predecessor. In this case they decided to do something more \"faithful\" to its original concept, which apparently angered many who expected wars since the early chapters. Itsuwari no Kamen decided to dedicate its first chapters to the presentation of the characters and even had time to decide if you take their affection or not. \\n\\n\r\nYes, perhaps dedicates 12 chapters was too much, but it knew how to entertain us with a good dose of comedy and slice of life as we knew a little more to the characters. From the second half would start the real story: a more serious faction of today's world is shown located several years after the first season, with a story that has nothing to envy. The wars raging again, but in this case we see from the perspective of people who do not fight directly in them, we see Haku, our protagonist, who is not used to the horror of seeing people die before his eyes, and he has to deal with this situation, while trying to help his nation and his friends. Yamato, a nation with great military power faces several threats, including a possible war with the nation of Tusukuru. We must not forget one of the facts that makes this story very interesting: the mystery behind our protagonist, which has much to do about the origin of today's society, which this season is played less, but always in an understandable way and when you have seen the first season (where they left some plot holes in this issue). In only 13 chapters, Itsuwari no Kamen built a story that moves at a good pace, with serious, intense, intriguing and dramatic moments (the latter especially in the final chapter, with a great atmosphere that makes you reflect on the events that led to that conclusion) and how the characters were taken to that situation. Something that Utawarerumono did not quite very well in 26 chapters.\\n\\n\r\nThe characters are not the most interesting in the world, but enough to bring history and have time to at least take their affection. Haku is someone quite apathetic attitude a bit annoying but it brings, for both comedy situations, as for those moments where the character is in unexpected situations, where he has to show a change in their way of being if he wants overcome as a person and achieve his goal. Kuon is a fun character, but knows how to be serious when the situation requires. She's cute, beautiful, something perverted, rude and quite mature, basically is Best Waifu. Oshutoru is basically who makes the story forward, who saw the potential of Haku and made it what it is, just as Haku tries to support him, although his peculiar way. The rest of the cast is not much to say, they are all quite different in personality, but they fulfill their roles.\\n\\n\r\nIn short: Utawarerumono: Itsuwari no Kamen is an anime that has nothing to envy to its predecessor. Has a different way to develop the plot, very slow at first but satisfying in the end, an audiovisual quality above average and acceptable and charismatic cast. Although it might be better in some ways, it is a very enjoyable and entertaining series that achieved its goal. The final cliffhanger shows that the series has potential if it proposes.",
            "date": "2016-03-27T20:53:00+00:00",
            "helpful_count": 115,
            "mal_id": 214480,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3780539.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Rhapsody-",
                "username": "Rhapsody-"
            },
            "url": "https://myanimelist.net/reviews.php?id=214480"
        },
        {
            "content": "This is a review written after I saw it entirely. So, it'll diverge a lot in relation to those which had been written around the beginning. Is my first review, mainly cause of the controversial feeling about this anime.\r\nStory: People may say that it hasn't a story, I say the otherwise. The first half can be a low-development kind. For those who compared directly with the first Utawarerumono, it really is slow and without a outter story development. Though, the second half goes on a exponential curve of \"Give me the next episode!\". So, we have character and environment presentation and later the rampage ofthe story. For those who searched about the anime, now that it is based on a 2-part visual novel, so, be warned that we have a \"half\" series, even so, I consider this season as a preparation to \"I hope there will be a\" next one.  \\n\\n\r\nArt: Well, the art is nice. The ambience is well made, and although there's a difference from the first one, in a few episodes you accustom to it. Well, the furry part is well made, as are the battles and \"special effects\". Some parts, considering the year of release, are lot better than the first one, which is expected.\\n\\n\r\nSound: I really liked the previous Utawarerumono opening (I love that one). They keep Suara's songs for the two openings (prefer the first one - really nice - but the second is really nice too). The endings are those slow-motion zen-kind songs, nice if you want to hear it (worst from all aspects). The general soundtrack is really good, mainly the last episode's ones; They match very well to the situations and ambience.\\n\\n\r\nCharacter: Well, we have a half season for that, if it was bad the overall would be to. We have a whole set of cliches to not cliches characters. I, particularly, really liked the MC - because he is really different from the normal-MC-way, and has a great development -. Aside from that, the whole set (older Utawarerumono characters, \"allies\" characters and enemies alike) are well made, be the visual, the actions, reasons, thinking, whatever. Even the lesser things cab be see as a potential character development fuel.\\n\\n\r\nEnjoyment: The fantasy slice-of-life that is the first part is, if nothing else, fun. I found it to be relaxing too. They have a equilibrium between fun and serious, a bit of overall development, new characters, being to know more of the world, etc. The second part is fun, cool, tense and all around some feels and emotions in some aspects (I'll refrain from spoilers, but mainly one part about the MC, and the finale). Basically, I watched one episode every week and waited for the next one from the first to the last episode.\\n\\n\\n\r\nSo, the overall note is kind a mean between all of it. I'm bad with rating, never know exactly what I think, Thus, pay more attention to what I wrote than tho the rating.",
            "date": "2016-03-28T15:24:00+00:00",
            "helpful_count": 53,
            "mal_id": 214589,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2016181.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/HikariKyuubi",
                "username": "HikariKyuubi"
            },
            "url": "https://myanimelist.net/reviews.php?id=214589"
        },
        {
            "content": "Utawarerumono: Itsuwari no Kamen is one tough anime to review. I started watching it without having seen the first season (I probably should have done that, but in the end I felt like I was able to understand the story without it) and had some mixed feelings while watching it. Utawarerumono: Itsuwari no Kamen is an anime that starts out as a slice of life and fantasy type of anime and ends as an action and drama type. I'm having a hard time deciding if that was a good thing since it made it good in some areas, but bad in others. As stated beforeI have mixed feelings about this anime, and I will now try to share those with you.\\n\\n\r\nUtawarerumono starts out with an extremely slow pace, extremely slow. Almost nothing happens for more than 10 episodes. The slow pacing is good in the sense that it introduces us to the characters and the world of Utawarerumono. The first few episodes are extremely relaxing to watch and easy to understand. As time goes on we gets introduced to character after character, that all gather around the main character. I can see why they all gather around him, I think he's a likeable guy with his casual lazy-type of personality. The characters around him get a fair bit of development considering how many there are. Too many for me to be able to count, and maybe not even remember. They each have some unique traits which make them avoid getting absolutely forgotten. But the side characters are too many to be able to genuinely contribute to the story, which is a shame since they also were likeable. All in all, the anime does a good job at introducing us to all these different characters, and sets us up for a promising ride.\\n\\n\r\nAfter the characters have all been introduced you would think that the story would start progressing, but that is not the case. After the characters have been introduced and developed, either nothing happens, or even more characters get introduced to even more characters. The middle of the anime, after the characters have been introduced and before the all the action, the anime turns stale and a bit boring. Maybe it was to fill more episodes, but it doesn't work out very well. These episodes are just a composition of random events that does not progress the story at all. The episodes contain some sort of action, but it's badly executed with the characters fighting armies by taking on usually 1, rarely 2 or 3, opponents at a time. The different action segments are boring and meaningless since it does not progress the story nor offer very much to the viewer. It's a shame that the good build up was ruined by this sudden stop of progress.\\n\\n\r\nSince the story of the anime stopped progressing, I had little hope that it would turn out good, or even decent. But at the end of the anime something finally happens, and it's actually something good and exciting. Since we get to spend so much time with the characters doing nothing, we are very likely to sympathise with them. When the story starts to unfold, we get to follow developed characters trough their adventures. This is great because we actually have feelings for these characters. Maybe not only good feelings, but we actually know these characters. The political twist (maybe not a twist if you've seen the first season) was nicely presented and executed. The power struggle was both fun and exciting to watch. The ending to this anime is great. It's bittersweet and definitely leaves an impact. \\n\\n\r\nThe animation of this anime is pretty good. It has a nice natural style which fits in nicely with the medieval type of universe. The background is detailed but at the same time it doesn't stand out too much. A fault with the animation is that it sometimes comes of as being lazily done. Mainly action scenes have too little going on. For example when armies are fighting, only a few people are fighting at a time. This makes the fights come of as unrealistic and genuinely bad. \\n\\n\r\nThe sound is not something that really stood out to me, all the openings and ending where decent, but not great. The soundtrack was also nothing that really stood out to me. Most voice actors where pretty good and the majority of the characters did a good job at impersonating their character. \\n\\n\r\nI enjoyed some parts of Utawarerumono, especially the start and end to it. But the middle of the anime just felt stale and boring. All in all Utawarerumono: Itsuwari no Kamen is an okay anime. Would I recommend it? I would if you like slow build up, a medieval type of universe and animation and/ or political disputes.",
            "date": "2016-03-27T11:04:00+00:00",
            "helpful_count": 43,
            "mal_id": 214381,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4429881.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Katakurin",
                "username": "Katakurin"
            },
            "url": "https://myanimelist.net/reviews.php?id=214381"
        },
        {
            "content": "Everything about this anime is fantastic.In my most honest opinion,it is a good succesor to the 2006 season.The art is outstanding,story is very comprehensive and deep and expands its roots from the first season.The characters all have their own background behind them and very interesting and well-tought ones at that.While watching the first season will triple your excitement about this anime,you don't need to do that in order to see the fantastic story.It is honestly very rare for me to feel this way about an anime and encourage others to watch it as well,and not to give it a bad rating after watching only 25%of it :)",
            "date": "2016-03-29T10:39:00+00:00",
            "helpful_count": 33,
            "mal_id": 214688,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5005619.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Suffaru3",
                "username": "Suffaru3"
            },
            "url": "https://myanimelist.net/reviews.php?id=214688"
        },
        {
            "content": "Warning: Review may contain spoilers.\r\nUtawarerumono: Itsuwari no Kamen is a good example of why a second season is sometimes a terrible idea. I can't help but wonder if most of these \"reviews\" even watched this anime.\r\nThe \"successor\" to the charming first season of the series, which was a series with likeable characters that saw well-paced development, followed with a strong narrative and art/sound direction for the time and was an overall joy to watch.\r\nUtawarerumono: Itsuwari no Kamen, however, falls flat on all expectations short of art direction and soundtrack. Characters lack any real depth, they don't grow, bond or build a real relationship, we cansee characters lounging around for the better part of the series, 12+ episodes until anything happens isn't \"slow pacing\", it's poor writing and lack of actual content, and having a hack of a director in charge. The action feels forced and unnecessarily over-the-top compared to the first season when it does happen.\\n\\n\r\nWe're presented with Haku, an extremely unremarkable and outright idiotic main character with no redeeming qualities, who finds himself in the wilderness and is rescued by Kuon, an inferior and bland version of a character we had in the first season. \\n\r\nThis second season regurgitates and reuses some narrative elements such as amnesia, a character rising to become a leader, and inheriting a weapon that belonged to someone else,  in very cheap ways. \\n\r\nFrom the moment Haku shows up, he pretty much just receives everything, and everyone falls in love with him for no reason at all. He's lazy, ill-mannered, untalented and amnesiac. He is quick to form a harem of literal princesses from different countries through no effort of his own, there is no real development or storytelling to speak of. The first half of the series takes place in an inn where all the characters converge as if it were a cheap run-off-the-mill slice of life, the series tries to entertain with the \"yaoi fangirls\" trope every single episode which quickly gets old, even though it's not funny the first time, it definitely wasn't funny the 20th time.\\n\\n\r\nBy the time anything happens in the series, it's hard to take it seriously at all. Haku fails to care about anything other than drifting by and doesn't have any meaningful bonding with any of the other bland characters nor any noteworthy character development, he literally just lazily strolls through a war-zone while accompanied by the rest of the group who seem to think that going to war is a game, and after witnessing a single particularly gruesome event he pretends to be highly hurt by this for two episodes even though he has no reason to be. After 80% or so of the series has passed by, we're introduced to the cheap twist of \"this guy is actually amazing\" for Haku, he's supposed to be related to the late emperor! At this point the plot is trying to rapidly move forward in a rushed way, the empire is about to fall and the princess is rescued by Haku and his comrades, one of them dying along the way and entrusting the lazy good-for-nothing with the future of the empire, with absolutely no emotion or build-up at all. With basically no reason to do care or do anything, Haku accepts and pretends to be his fallen comrade and tries to rally his supporters to march towards the empire, and the series ends there. Astounding isn't it?\\n\\n\r\nAs far as the \"action\" goes, there's a clear exaggeration when it comes how strong and capable the characters are, as fights that were akin to medieval fantasy with some mild magic gets twisted into literally splitting mountains with a single slash, yet these people are unable to win fights against the old season 1 characters. This felt like an unnecessarily big narrative gap created by mindless shounen power-leveling and \"flashy\" fights. In the first season, characters had real reasons to fight, such as revenge and protecting their homeland and loved ones. In this series it's basically \"these guys are challenging **US**, we'll kill them!\"\\n\\n\r\nAll-in-all, Utawarerumono: Itsuwari no Kamen was extremely painful to watch, it's sad that the series which was solid and had laid the groundwork for something great was ruined by this. When it's not a mediocre slice-of-life harem with stale humor, it attempts at serious storytelling and fails.\\n\r\nI recommend watching the first season and skipping this one.\\n",
            "date": "2016-04-09T19:07:00+00:00",
            "helpful_count": 15,
            "mal_id": 215971,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2434093.jpg",
                "scores": {
                    "animation": 8,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Silfie",
                "username": "Silfie"
            },
            "url": "https://myanimelist.net/reviews.php?id=215971"
        },
        {
            "content": "- Be advised, don't read this review if you have not finish the anime as it contains spoilers -\r\nFirstly, I would like to say that I like Utawarerumono, but I haven't play the Visual Novel at all. Contrary to the high scores that most people give to this anime, I would have to say that this anime is one giant mess, whether it's because of the original material or the director, there is nothing great about the sequel to great series of Utawarerumono.\r\nThe main issue with this anime is its story which I really dislike, especially with how the anime starts and ends. In myopinion, the first cour of the anime from Fall 2015 is nothing but a giant filler. Why? It's because unlike its prequel, the first cour is a slice of life anime that has very little purpose other than introducing the characters and providing service to fans of Utawarerumono, especially when they re-introduce characters from S1. It must have been painful to watch this anime weekly, especially if you are a fan of the Utawarerumono series. Based on the first cour only, there is little direction of where the anime will go. Will any of the characters have any used to the story? Will there any plot at all? Is this the best that they could do? These are the questioned that I keep on having as I watched the first cour of the anime. \\n\\n\r\nThe second cour of the anime is where a real storyline starts to come to light as the Barbaric arc and the Invasion arc are introduced. This is where our characters are introduced to one of the struggle that they must face during those time, war. Something they must win if they want to survive during those time.  This is also when our characters from S1 and their country are introduced into the sequel, a way to remind us that they are still there, living among the characters from this anime. Furthermore, we are shown in the past as they bring back story from S1 like Iceman, the scientists, and the test subjects. We are shown here that the scientists are not evil, but they are the “necessary evil” as they have to deal with the curse and the mess that they bring to humanity. Just like the people of Yamato and Tuskuru, our scientists are there to survive and the only way to do so is to research the test subjects and Iceman to improve their genes. Finally, there's the ending that left a giant hole among the viewers heart as there is no sense of closure to the ending at all. The ending is a giant \"Fuck you!\" to the viewers as the relationship between the characters breaks apart and there’s no information if they will come back together again or it’s the end of their relationship. The ending makes all of the slice of life part from the first cour to be completely pointless. \\n\\n\r\nThen there's the characters of this anime which could be considered as the weakest point of this anime. The characters have common traits just like many other anime, they have a bishoujo, fujoshi, tsundere, and the list goes on. There is nothing special with the characters (maybe except for Haku), and with the little to no character development from the first cour, I can't really feel attached to the characters. Not just that, some of the supporting characters like Maroro and Kiuru have very little purpose to the anime and if we are to take out these characters, the anime could still continue. \\n\\n\r\nThe second cour of the anime is where our characters begin to develop, although only a little. From here, we can see that despite how happy-go-lucky Hakku is, he is dislike and afraid to the idea of change. He couldn’t bear the fact that the people that he spent with all this time could easily go to war and kill people like it’s nothing. We could also see the extent of their relationship as it was quite fragile, especially when the characters didn't know how to act towards Haku after the war with the Barbarians ended. We also started to see the development of relationship between Haku and Kuon as Kuon is starting to have a romantic feelings towards Haku. Despite all this, there's very little to no development to the side characters of the anime as we see that they have a problem here and there that serve to develop the characters, but that’s the extent of their development. \\n\\n\r\nDespite all the faults I provide previously, the art and the sound are likely to be the only strong point of the anime. There is a massive improvement with the art from S1 as almost a decade has passed by because every aspect of the design of this anime is great, especially the design for Akuruturuka for Vurai and Oshutoru. There is a great amount of details being put towards the characters and the world they live in. The Op, Ed, and Ost are great as well as they fit right into the theme of the anime, especially the vocals and lyrics of the music. I find myself not skipping the Op and Ed every time I watch the episode which just shows how lovely they are. \\n\\n\r\nOverall, I can't really find myself enjoying this anime, especially as the ending was too open ended and with no information about any sequel, I feel disappointed with this anime (although there's a sequel for the VN). Watching the first cour of the anime was quite painful and I find myself wanting to drop this anime if not for the characters from S1. This anime really have lots of potential and it could have done better with how the story develops. For example, they could have shorten the slice of life part of the anime into 3-4 episodes and use the remaining episodes to show the Rebellion arc. I really want to like this anime, but I just can't with the amount of faults that it has.\\n",
            "date": "2016-04-05T01:37:00+00:00",
            "helpful_count": 13,
            "mal_id": 215556,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4113589.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/popoklemos",
                "username": "popoklemos"
            },
            "url": "https://myanimelist.net/reviews.php?id=215556"
        },
        {
            "content": "*\r\nI'd say there might be mild spoilers, but then again, there is almost nothing to spoil :'( \r\n*\r\nBefore I start my rant I will state that I have enjoyed the art and soundtrack in this series (my reaction to the piano track was overwhelmingly positive) . Let us start with the fact, that I have liked the first Utawarerumono series quite a lot. That was mostly because of the narrative, character development and the relation between Hakuoro, Eruru and the rest of the gang. That being said,  Itsuwari no Kamen tried to draw some obvious parallels and teased us in a couple of scenes,but failed. At the end of the day, it has very little in common with its predecessor. The elation between the main two protagonists: Haku and Kuon, is cut short in favor of overly introducing the rest of the characters. This is a product that one gets when the makers try to put too much in and leaving single components half baked. It feels unfinished, leaving many plot holes. Some of them are obvious, others explainable by logic. The last episode made me cringe.\\n\r\n-> [SPOILER] I knew that Haku would take Oshutorus place before watching the anime, but the build up to this event was non existent. It was way too  sudden. He changes from a slacker into a responsible leader withing hours - really?! A+ on the character development #sarcasm. But the most irritating part was when Kuon cried over Hakus death. As if they were that close. That was so forced by the script that I stopped watching for a couple of moments. Why was she crying? There was no progression in terms of any kind of a relationship between them. No romantic scenes, e.g. holding hands, hugging, kissing... And now she weeps because she thinks he is dead. Give me a break. I was waiting the whole darn series for them to become a couple and all I've got was that? Was there another episode they have forgotten to air? The last episode was just insulting and infuriating. Had to rewatch the last episode of the original series to get my calm back[SPOILER] \\n\\n\r\nTLDR; You could make a 5 episode OVA and it would contain a more complex  narrative. As a fan of the original series, I got lured by the cheap trick called nostalgia. It has provided a very shallow story. It felt like a combination of a mediocre harem with some random fujoshi fanservice more often than I would appreciate for this title. Out of the whole series I'd probably recommend watching 6-7 episodes. A wasted potential of what turned out to be more of a filler than anything else.",
            "date": "2016-03-27T10:09:00+00:00",
            "helpful_count": 8,
            "mal_id": 214363,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ifalna",
                "username": "ifalna"
            },
            "url": "https://myanimelist.net/reviews.php?id=214363"
        },
        {
            "content": "This is a lax review that falls more to the compartment style (and being my first review).\r\nAfter enjoying the first season of Utawarerumono, i wanted more! So i turned to Itsuwari no Kamen. Luckily i didn't watch the original show when it aired now 10 years ago because the wait and disappointment would have crushed me even harder than it just recently did.\r\nUtawarerumono: Itsuwari no Kamen starts off with setting identical to the original, but quickly changes to your typical slice of life fantasy setting. MC starts building harem of sorts and nothing reminiscent of plot or traces to first season is to be seenuntil first few episodes in.\\n\r\nThere are few major plotholes (just like in the original) that might someday get covered in future seasons but i wouldn't bet my money on that.\\n\r\nJust a little warning for those who loved first season; Itsuwari no Kamen is going to make you hate/feel angry towards the main cast at some point of story for some time. And you really wish you could see the original characters more often.\\n\r\nLuckily after slow start the story develops to better every episode towards the ending and after its over you're wanting for next season. Just hope it doesn't take 9 years again.\\n\\n\r\nCharacters compared to the 2006 original feel just empty (yes, there were some bad characters on the original, not denying that). Every girl is shoehorned to fill in cliche roles that make all harems so dull to watch. They act weak except in 2-3 episodes about battles where they're suddenly smart and powerful only to fall back to your sheepish little harem after the battle ends. \\n\r\nMale characters bonding with MC are all boring, empty wallflowers with the exception of 2nd MC. Boylove is everywhere (not that i mind, but it gets old fast).\\n\\n\r\nAfter first season this was a big letdown, but its slightly above average.\\n\r\nWell worth the watch if another world/fantasy setting is close to your heart.",
            "date": "2016-04-18T14:21:00+00:00",
            "helpful_count": 6,
            "mal_id": 216653,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4223643.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Liveless",
                "username": "Liveless"
            },
            "url": "https://myanimelist.net/reviews.php?id=216653"
        },
        {
            "content": "Story: 4\r\nBland, specially within the first half of the anime and that’s 12 episode of runtime wasted on weak attempt to develop the characters. At best, the plot is mediocre. It again wasted the rich foundation the prequel built and the very detailed world already built. The show also failed to take advantage of a crucial plot event that should have made momentous changes to the story.Overall, very disappointing story but another element truly dragged it down.\r\nArt: 8\r\nFluid animation and nothing hurts the eye, though nothing to give you wow factor either. Characters designs receive thumbs up and in my opinion it is superior comparedto its predecessor and source material.\\n\\n\r\nMusic: 7\\n\\n\r\nThose tracks from the game (I haven’t watched the prequel anime but played the VN) just kills you with nostalgia. Aside from this and the decently timed tracks, nothing is truly noteworthy.\\n\\n\r\nCharacter: 1\\n\\n\r\nWhen the supporting cast interests you more than the protagonist, you know you failed to write a credible lead to your story. Our dear main character showed no real development, even after the “big revelation” nor any progress in his relationship with the heroine, who’s been dragging him along for 25 episodes. But no matter how well written our Kuon is, Haku is simply doing a great job dragging the whole cast and the show itself down.\\n\\n\r\nEnjoyment: 6\\n\\n\r\nUtawarerumono is one of my favorite visual novel of all time and have a special place in my memory hence no matter how I dislike the protagonist I still found ways to enjoy this show with its lighthearted comedy and the cameos of old characters. Sadly it didn’t leave any sort of emotional crater of course all thanks to a terribly written protagonist.\\n\\n\r\nOverall: 4\\n\\n\r\nOverall this show’s stale plot and disappointing main character is the main reason of its downfall. \\n",
            "date": "2016-06-21T19:01:00+00:00",
            "helpful_count": 5,
            "mal_id": 221447,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Quickie",
                "username": "Quickie"
            },
            "url": "https://myanimelist.net/reviews.php?id=221447"
        },
        {
            "content": "This anime is a failure as a sequel, so much so that it made me make an account to this website just so i could review it. \"A bunch of girls in a bathtub\" would be another name for this anime. The anime is about random girls who just decide to move in with the MC for no reason at all take baths about twice per episode, talk about boys all night long, and meet new girls to take baths with. The MC has 0 skills there is nothing special about him he barely even shows up since the story just kinda focused the entiretime on the girls in the bathtub but don't worry because you get to see some of the characters from the first season show up take a bath and never show up again. The girls are as cliche as they can possibly be there is nothing interesting about them and they all look the same. Okay so enough talk about the first 20 episodes in the last episodes a war just kinda happens for no reason some guy comes out of nowhere does some behind the scene shit and there was some fighting and what not the anime ended on a cliffhanger so there is probably gonna be another season but you can skip this one if you want because you will probably understand everything that happened in this season within the first episode of the next one. You dont really have to watch the first season to understand this one since, well nothing actually happen but you probably are going need to watch it for the third season if you are planning on watching it. Overall this season is an average harem anime with some yaoi jokes thrown in it.",
            "date": "2016-10-04T09:51:00+00:00",
            "helpful_count": 4,
            "mal_id": 231076,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5745805.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/IP3an",
                "username": "IP3an"
            },
            "url": "https://myanimelist.net/reviews.php?id=231076"
        },
        {
            "content": "A lot of people complain about the fan service, but you have to remember what they were adapted from. This series has it's share of service, but the story is deeper than it seems, just like the first series it has mystery and a strange beautiful world that confuses and mystifies the MC. Sure this one could've been better, but all in all it is nothing more than a big build up to the next part. It has your suspense, wonder, fantasy, fighting and more, give it a shot before you judge it based on screen caps. The art and sound are one of myfavorite parts as it reminds me of the first series, some of the characters don't feel as though they contribute much so that could've been better, but all in all it was enjoyable. The art style was the main selling point for me, and so was the story since i knew from the start it was gonna be a build up series. Overall i highly enjoyed this show.",
            "date": "2016-03-29T09:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 214682,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5297665.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AgntTwelfth",
                "username": "AgntTwelfth"
            },
            "url": "https://myanimelist.net/reviews.php?id=214682"
        },
        {
            "content": "So first of all if you have not watched the original Utawarerumono anime you probably need to do that first or else there will be points in this story that you will definitely find yourself lost because this is a continuation of the original Utawarerumono story line.\r\nI found this anime quite a bit more enjoyable than the first.  You get more in depth with the characters and the tone is much lighter that in the original anime.  I do like how well the story progressed through each and every character ultimately building to the conclusion which in itself is another beginning.  \r\nMostof the anime has a light feel to it, although it doesn't skip a more serious tone hear and there the largest of which comes at the conclusion.  The animation is nice and clean and the sound and everything else is crisp.  Overall it is an anime that I would definitely purchase should it be released here.  \\n\\n\r\nThe one thing that did bug me about this anime is the ending of which there was none.  I'm not going to spoil anything for you but in case you didn't know the entire Utawarerumono series is based off of a popular game franchise in Japan and so the anime ends right where the game ends essencially.  So see no spoiler if you've played the game because you already know what is going to happen.\\n\\n\r\nThis anime seems to have been made as a tool to boost interest and promote the new game coming out this September which if I'm not mistaken is \"Utawarerumono: The Two Hakuro\".  Now here is the rub, will there be a concrete ending this time or will this ultimately lead us into another game after a third anime release.  The thing is I have no idea and I don't think anyone else does either.  The only thing that I do know from the preview of the new game is that it will seem to have a far more serious tone as Tusukuru and Yamato seem to be headed towards full scale war.  \\n\\n\r\nSo with that said hopefully there will be a third anime sometime in 2017 that will lead us further down the rabbit hole into the world Utawarerumono.  At least I hope that there is because it sure has been fun so far.",
            "date": "2016-04-02T11:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 215210,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/500571.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/widowmaker",
                "username": "widowmaker"
            },
            "url": "https://myanimelist.net/reviews.php?id=215210"
        },
        {
            "content": "So, after watching the whole thing, even though i did not watch the first season, i do recommend it since because there are some ties regarding haku and kuon, so this is coming from a person who had not watch the first season, but do understand a few things from the first season, and who heard about the visual novel of this.\r\nStory-10, i heard some things in the visual novel, and the first half, 12 episodes or so, were more like, character introductions and such.  You know, that getting to know character to build more emotion to the characters. After the first half, thenit started getting to the story, as i see other reviews on here, they only watched like 12 episodes or below, and that is not so helpful.  \\n\\n\r\nArt-9, I love the art they use in this, really great, just simply love it.  had no problems with it whatsoever.\\n\\n\r\nsound 7- i do not love, i do not hate, it just simply enjoy it.  i like the first and 2nd op as well.  The sound are pretty good, not gonna lie.\\n\\n\r\nCharacter 8- As i said before, the character introductions, and such, its good.  Hence at the last episode almost made me tear up, and so i got kinda attached to characters, well im the type of person to get attach to characters.\\n\\n\r\nEnjoyment 10- there were funny scenes and action scene that got my hyped, including the ending which makes me want to know what going to happen next.  each epison was good enough for me, got my attention and my \"wanting\" of more episodes of this.  \\n\\n\r\nOverall 10- i wished others would also watch this anime, i highly reccomend it, it is great to me.  I also wished there were more Live Reaction videos to this anime, want to see their reaction to the interesting things.\\n\\n\r\n*First review ever*",
            "date": "2016-03-26T12:16:00+00:00",
            "helpful_count": 5,
            "mal_id": 214235,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Krisient",
                "username": "Krisient"
            },
            "url": "https://myanimelist.net/reviews.php?id=214235"
        },
        {
            "content": "This had so much potential to be good, perhaps the game or manga[if there is a manga] would be better than the anime at delivering the finished piece of this utawarerumono story, but there is one glaring terrible thing of this series\r\nThe main character; i'm not saying his personality or anything is bad, it's how he's presented. He's constantly extolled as a character that gets things done, but what the story shows him really being able to do is fix a mill and teach the princess a lesson and even those weren't that great because with the mill he simply removes the stopper and withthe princess he coat tails off of ushutoru's words.\\n\\n\r\nIt would have been an amazing anime if it simply showed him actually doing things to later pull back to when they praise him instead of just saying he can do things with nothing to refer to.",
            "date": "2016-04-26T06:19:00+00:00",
            "helpful_count": 5,
            "mal_id": 217210,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/kuroclown",
                "username": "kuroclown"
            },
            "url": "https://myanimelist.net/reviews.php?id=217210"
        },
        {
            "content": "I'll start off by saying that I'm a big fanboy of the Utawarerumono series. I've watched the original anime series and it was so good that it made me play the Visual Novel version. (Which brought me into the Visual Novel world - this was a few years ago) So it's natural that I was overjoyed when I heard Itsuwari no kamen was getting animated. I also came in with some expectations.\r\nWith that said, here's my slightly biased review of Utawarerumono: Itsuwari no Kamen.\r\nStory:6\r\nThe first few episodes were beautiful, it allowed first time viewers to get used to the world and the people in it.Then the plots slowly starts to go south. The biggest thing that bugged me was combat. We see characters that laze around doing nothing, suddenly become proficient at using their weapon. We are told, but not shown how they've gotten stronger. It is most likely due to the fact that this anime was based off a SRPG, where the player trains the characters. At the end, a lot of things were left unexplained and plot points left hanging, but I will talk about this more at the end of this review.\\n\\n\r\nArt: 8\\n\\n\r\nI'm no expert at spotting errors in animation so I can only give you my impressions as viewer who focuses mostly on the plot. The scenery in the first few episodes blew me away, it really gave you a sense of being in the world. The large scale battles featured cookie cutter soldiers, but I'm fine with this as it is pretty expensive and a waste of money to try and anime each solder individually in a large battle. All in all, character movement felt smooth and the colors used in the anime felt natural.\\n\\n\r\nSound: 9\\n\\n\r\nNothing to say but great. If you enjoyed the type of music in the first series, you'll love the ones here. \\n\\n\r\nCharacter: 6\\n\\n\r\nExcept for a few, most of the characters in this anime felt flat and their actions felt mechanical. I will explain more about this at the end of my review.\\n\\n\r\nEnjoyment: 8\\n\\n\r\nUtsuwari no Kamen will feel nostalgic to those who've watched this first series and just seeing the world and characters is enjoyable. Somethings will bug you like inconsistent plot and characters, but that is due to it's SRPG nature and a fact that I will discuss right below. \\n\\n\r\nRant\\n\\n\r\nFor those of you that don't know. Next we'll mostly likely get the next season during the Fall 2016 lineup. Why you ask? It's because the last visual novel of this series will be released that day. Why am I talking about next season on a review for this season? This is because you'll find that everything in this season is a buildup for next season.\\n\\n\r\nWhat essentially happened was that they made the visual novel too large, so they split the story into two games. (Utawarerumono: Itsuwari no Kamen and Utawarerumono: Futari no Hakuoro) Which forced the anime to follow the same pattern and the viewer is left with lots of unexplained and hanging plot at the end. For those of you that have watched the first season, all of Itsuwari no Kamen is basically like the world building in the first few episodes of the first season. Now this wouldn't be a bad thing if the director could create some anime original scenes to smooth the transition from a SRPG visual novel to an anime, but due to the fact that there's already a sequel in plan, the director is not given much leeway. The anime is sticking so close to the source material that some plot points feel extremely awkward/doesn't make sense due to the SRPG elements. \\n\\n\r\nOverall: 7\\n\\n\r\nTl;Dr Don't expect too much from this season as it is just world building for the next season. \\n\\n\\n\\n\\n\\n\\n\\n",
            "date": "2016-03-26T23:41:00+00:00",
            "helpful_count": 4,
            "mal_id": 214310,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4577890.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/whitetragedy",
                "username": "whitetragedy"
            },
            "url": "https://myanimelist.net/reviews.php?id=214310"
        },
        {
            "content": "Story\r\nthe story starts with Kuon   which is the female main character of this series  . The story overall was awesome if you loved the first season as it expanded on the story of which how the experimental beings from the first season or the people grew and became the prominent people we know in the story . It explains why Yamato is so advance and why Yamato is able to have the masks like in the first season even though its not nearly as strong as the original mask . Though the ending maybe abit of a disappointment but its still anawesome story non the less \\n\r\nArt\\n\r\nThe art was amazing if you loved the art in the first anime this is just as good.\\n\r\nSound\\n\r\n The sound is nice and matches all the feeling and emotions  you face while watching it making it a more thrilling and fun anime to watch . \\n\r\nCharacter\\n\r\nThe development of the story is quite slow but is always accompanied with humor and something new to learn about the characters . In every episode you can always feel the character has improved or grown one way or the other  which is very interesting to watch .\\n\r\nEnjoyment\\n\r\nI enjoyed how the characters developed and learning more of the history and lore of the original anime Utawarerumono . There are many exiting and funny twist in the story making sure you are not bored especially in the last few episodes . Though i would definitely love it more  if the ending wasn't so sad\\n\r\nOverall \\n\r\nI would say if you loved the first season and love to know more of the history and lore of the anime you should definitely watch it as its an anime full of fun adventure comedy and romance and would make anyone who watches it satisfied",
            "date": "2016-03-27T10:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 214362,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278575.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sazerarrow2",
                "username": "sazerarrow2"
            },
            "url": "https://myanimelist.net/reviews.php?id=214362"
        },
        {
            "content": "In 2006, the world was graced with a fantasy world of animal themed people surrounded by mystery and war.  The series known as Utawarerumono has since then become a bit of a cult classic with its mix of fantasy and science to formulate the world's backstory, in conjunction with the present day story with what is essentially a completely new world.  And so, 9-10 years later after the first Utawarerumono, we have Itsuwari no Kamen, the false faces, the second installment of the Utawarerumono trilogy.  \r\nStory:  Twenty years after the end of the first Utawarerumono ended, the world has been relativelytame.  It is here where we find ourselves in a different, larger country to the newborn state of Tuskuru, where we follow the story of a woman by the name of Kuon and the man that she found that she names...Haku.  \\n\\n\r\nThe story of Itsu, as I shall be referring this series as, is split into two parts, corresponding to the two cours that make up its entire runtime.  Contrary to its predecessor, Itsu is a more character-based story, focusing more on the development and characteristics of each and every main character that they introduce to some extent.  The entire first cour is virtually plotless, as it spends its time more on the development and building of its main cast, involving Haku, Kuon, and several other characters that each receive their own quirks and traits that make feel more like characters than pieces that follow a plot-based story.  The issue that arises from this is the fact that the plot itself during this section of the anime really doesn't have much going on about it.  By devoting itself to defining its cast, the show sacrifices any sort of plot development and doesn't feel exactly like what we were presented with back in 2006.  \\n\\n\r\nThe second half of Itsu on the other hand is what would be considered more as 'Utawarerumono'.  As the series was originally a tactical RPG game, the series dives into its traditional style of war and conflict, which really only benefits the series.  Due to the fact that the series sort of slogs on with its first 12 episodes, only to give us a plot based story with more defined characters, the story overall in that sense just feels more well written and makes more sense overall.  Character motivation during this second half is more defined, the different viewpoints of war and rule, what is best for the people of a nation; all of these are tackled with much more value to them.  \\n\\n\r\nAnother thing that this series does, and is just a positive for the entire Utawarerumono series as a whole, is the idea of world building.  Because we're in a completely different country to the one we see from the original series, the structure, culture, and overall feel of the place is completely different.  Yamato is a very powerful country that has a lot of land and power over the rest of the world.  And you get a sense of that with the way the country is set up, the daily lives of the citizens there, and the impacts when that powerful pyramid crumbles down.  All in all, we get such great world building that there really isn't much for me to complain about.\\n\\n\r\nAll in all, while there were some bumps in the storytelling on account of the fact that there was virtually no plot in the first half and JUST plot in the second half, personally, I think that the story only benefitted from this, as the actions and events were more personal and impacted the characters in a way that would've otherwise been null if they didn't spend that time.  The end is definitely a more open end, as the story is more or less setting up for hopefully, the third game's anime adaptation some time down the line.  (White Fox, PLEASE get on this.)\\n\\n\r\nOverview:\\n\r\n+  World Building\\n\r\n+  Good second half \\n\r\n+/-  Good first half (This is dependent on whether you would appreciate the time spent on the characters or hate just the sheer lack of anything and the randomness of some of the stuff that happens.)\\n\r\n+/-  Open end.  (Does well for setup and is bittersweet, but doesn't REALLY finish the story.)\\n\\n\r\nCharacters:  Itsu does a complete clean sweep in its character department, as the series focuses on an entirely different group to the characters that we knew before.  \\n\\n\r\nUp first is Haku, the 'new' Hakouro of the series.  After waking up without any memory as to who he was (Gee, that sounds familiar), he is found by Kuon and is dubbed 'Haku' by her, now under her responsibility as she is his 'guardian' of sorts.  (Ka na.)  However, that's where the similarities between these two men ends.  Haku is more or less the opposite of Hakuoro, being less willing to do physical tasks and has a very negative outlook on war and the kind of destruction that comes with it.  As the series progresses along, Haku becomes a hardened character that grows out of his innate inability to do anything.  He's a realistic character that has an odd charisma of always having a \"I'm so done with this shit\" expression everywhere he goes.  All in all, Haku's growth as a character makes him a much better character overall as you can see his ascent of willpower and growing into the ideals and wishes that he wants to fulfill as the events of the series impacts him.  We also get a backstory to him that ties into the events of the continuity, adding in his hand into the ordeal that created the world of Uta.\\n\\n\r\nThen we have Kuon, the 'new' Eruruu character of the series.  Aside from having the ability to heal, Kuon doesn't really have any traits that the previous female protagonist had with her.  She's a much more mischievous, hot tempered girl who loves to eat, play, and acts as a sort of 'mom' character in a sense.  The main issue that arises from Kuon is the fact that her motives or backstory are more or less shrouded in mystery.  The series does give clues and facts as to how she came to be, but towards the near end of the series, there're hints to show that there is more to her, and that she has an underlying motive for finding and caring for Haku, which really doesn't get explained.  Maybe we'll get information in third adaptation, but at the time of this review, there really isn't any information currently to explain that.\\n\\n\r\nFor the rest of the cast, we have a variety of players in the game.  We have the two noble princesses from different provinces in Yamato, Rurutie and Atui, the general of the right, Ukon and his sister Nekone, the novice archer, Kiuru, and the entire government and military structure of Yamato, including the emperor, his daughter, and the Eight Pillar Generals, powerful leaders who command their own army that obey the will of the emperor to ensure that the country of Yamato will continue and prosper, and the best girl of them all, Kokopo the giant bird.  (Seriously though, this bird is an AMAZING character.)  While mostly side characters, these members of the cast, most of these side characters don't really feel it.  They add to the atmosphere of this new country, as their values, culture, and ideals largely differ to those from the cast in Tuskuru.  The majority of them are defined and mesh very well with the story, creating a genuine feeling world.  Several in particular, Oshtoru and the emperor, play bigger parts and act as both plot devices and characters that add more to the story.  Overall, this side cast is much better crafted and really only added to the story (Except Ponpo of course.  Hate that bastard).  Plus...there might be a couple...return appearances here and there.  \\n\\n\r\nOverview:\\n\r\n+  Characters that have both plot importance and development\\n\r\n+  Defined cast\\n\r\n+  Characters mesh very well with the story\\n\r\n-   Some missing and/or incomplete motives for some characters\\n\\n\r\nArt:  Produced by White Fox, an offshoot of the company Oriental Light and Magic who made the original Uta, Itsu returns back with a fresh coat of paint from the olden style of the original Uta series.  With a much more refined look to it, the true beauty of the asian inspired world of Utawarerumono comes back full force with wonderfully produced backgrounds and fluid animation.  \\n\\n\r\nThe overall look of Itsu took what was good about the original Uta's art, and just sort of elevated it.  While some moments were taken into liberty with CGI in order to animate certain scenes, there wasn't particularly anything messy or bad about it.  In fact, it still looked rather fluent even with CGI employed.  (The curses looked a bit off.  I'll say that much.)  What does bother me about the art is how everything has this slight tint of beige to it.  The colors of Uta have never particularly been bright, but everything just looks a bit too dull in terms of color.  \\n\\n\r\nAnother thing that Itsu has is fanservice.  It doesn't have it in spades, but in certain scenes, most prominently in the first half of the series, there are scenes that detail more risque moments in the bath.  (Because Kuon is apparently a cat that likes to take a bath.)  It's not that much, but I just thought that a little warning was a good idea.\\n\\n\r\nOverview:\\n\r\n+  Consistent, good quality art  (Oh White Fox, you do spoil me)\\n\r\n+  CGI that was used was more or less fluent\\n\r\n-   Colors look slightly dull\\n\\n\r\nSound:  I think one of the more defining parts of the Utawarerumono series.  As the entire OST is more or less based around an oriental style of music, the tracks sound more unique than your traditional anime OP, ED, or OST in general because of that.  Taking her reign back as the singer for the Uta series, Suara makes a comeback to sing every OP and ED song that the OST has, just like what she did back in 2006 with the original Uta. \\n\\n\r\nThis time, the OPs have a more serious tone to them while the EDs have a very relaxing and mystical tone to them.  All four of these tracks are very memorable and evoke the feeling of the oriental and mystical war anime that Utawarerumono is.  Personally, I think that Suara's style of music perfectly represents Utawarerumono, so much that it's just difficult to think about Utawarerumono WITHOUT these tracks.\\n\\n\r\nOverview:\\n\r\n+ Perfect OST  (There are NO complaints or bad parts about this.)\\n\\n\r\nPersonal Enjoyment:  Utawarerumono was a series that intrigued me for a good long while.  After I took it out of the backburner, I found myself enjoying a series that was actually more deep in its lore than I originally thought.  I love stories that have lore to them, and when I found that Utawarerumono was having a sequel, I was excited.  \\n\\n\r\nDid I like this anime?\\n\\n\r\nOh, far more than I should've.  I love stories that just add to the continuity, and really there wasn't anything about this show that I didn't like.  The characters were enjoyable, the story over time transitioned to what the original Uta was structured like, and we got a look into the aftermath (sort of) into what happened after the events of the original Uta.  Plus, the soundtrack, my god, it's heavenly.  (And the cameos!!!!)  \\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nTo get into specifics, Ponpo.  The character Dekonponpo is the saddest excuse for a living being and I hope that waste of life and space dies very soon.  Such an irritating and terrifyingly designed character.  \\n\\n\r\nWould I recommend this anime?\\n\\n\r\nIf you saw the original Uta, you should watch this.  It continues the story and adds another layer of depth to the world of Utawarerumono.  It is the second part to a trilogy, so more or less, this is the 'lead-in' part of the series that moves the series to its final conclusion, so it doesn't exactly end cleanly, but nonetheless, it is a fitting end.  If you're new to Utawarerumono or you're interested in a fantasy series with war and some relatively deep lore, I would strongly suggest you watch the original first.  Despite what people think, this is a story that happens AFTER what happens in the original series, and there will be continuity mistakes if Itsu is watched without any prerequisite.  Until then, it's time to slumber and wait another decade until they release the third and final installment.  And boy, a day that will be.",
            "date": "2016-03-26T21:38:00+00:00",
            "helpful_count": 4,
            "mal_id": 214303,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=214303"
        },
        {
            "content": "I watched and rewatched the original 2006 series several times. This alone probably gives you a decent idea of how much I enjoyed it.\r\nWhat initally drew me to the original was the combat and how it was relatively realistic, at lwast by anime standards sure it had super human strenght (karula) and super speed. some people could jump 20 feet in the air (although realistically that would have gotten them killed) and there was magic and mechs. The mechs although overpowered were meant to be and i could accept them. The magic was also not over used and was not as overpowered. As for militarytactics i could list out a whole lot of issues but thats for another time. I still want to leave that cavalry cant charge through spearmen like that but thats what anime is\\n\r\nI also appreciated the fact that the main character was level headed and very capable. He might have been too lenient at times, but that's japanese influence there, not much the creators could have done there.\\n\\n\r\nNow enough about the original. \\n\\n\r\nOn the topic of combat theyve completely thrown out realism for the more popular one man army general idea thats so common in asian movies and stories. \\n\\n\r\nI mean seriously if one woman (munechika) could basically wall crush an entire army why does she even have an army with her. Same for that blondie human nuke. Theyre as big a threat to their own men and they dont even use them except for the clean up. While on the topic of combat i really cant agree with women just running up and beating the crap out of trained soldiers. I mean yeah in the original there were women in the army but they were extremely special cases. Karula belonged to a tribe that had natural super strength and touka was part of some miliatary order that served justice or something. In this we were given absolutely no explanation as to why they could fight. Anyways even if there was 5 people charging an entire army is completely useless, they should have been speared to death at a distance. \\n\\n\r\nAs for the characters \\n\r\nHaku with his retorts were probably the saving grace of the anime\\n\\n\r\nThere was also a bit too much gay with the princesses and all for my taste. Sure i get that they might have wanted a bit of comedy but episode after episode of it got annoying\\n\\n\r\nAs for the rest it didnt feel rushed (not too much at least) the art and sound was good so i dont have much else to complain about",
            "date": "2016-10-04T18:19:00+00:00",
            "helpful_count": 3,
            "mal_id": 231105,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4108135.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/fang3412",
                "username": "fang3412"
            },
            "url": "https://myanimelist.net/reviews.php?id=231105"
        },
        {
            "content": "This review is written by someone who has watched the prequel first, then read the visual novel, and then watched this anime without reading the novel for this anime. Spoilers will be present and announced later in the review.\r\nThe prequel was fun enough for me to want to read the VN and watch the sequel. The VN was a nice addition but the anime itself was a good one. However I can only say I'm very dissapointed in this sequel anime. I've seen people claim Fate/Stay Night is the kiddy version of Fate/Zero because the cast in F/SN mostly consists out of kids. I heavilydisagree since plotwise Stay Night is just more complex than Zero. However this sequel does seem to be the kiddy version of the prequel.\\n\r\nThe original Utawarerumono was written for 18+ (and the anime 17+) and I think that reflects in the story and characters. The sequel was originally written for 15+ and the anime itself is 13+. As such, we got a lot of bathing scenes to start with for horny young boys and yaoi jokes for fujoshis? It's not just these details, it just reflects in about everything.\\n\\n\r\nAnyway since this is the sequel of the anime from 2006 I expect you to have seen it or atleast plan to watch it before you watch this. As such I will make comparisons since I don't think this anime should be watched as stand alone.\\n\\n\r\nBefore I start to point out all the things I'm not satisfied with or just want to adress, I have to admit, the anime is well animated and does looks good.\\n\\n\r\nThe points I want to adress are:\\n\\n\r\nStructure of the story\\n\r\nFanservice\\n\r\nHumour\\n\r\nPlot\\n\r\nCharacterization\\n\r\nInconsistencies\\n\\n\r\nThe structure is as follows. You do not get an introduction to your main character, it's pretty much like how the prequel started, guy with no memories is found. Someone takes care of him. They then travel around and meet people. The first 2-3 episodes are somewhat about fighting, survival and introduction to the setting of the world we're going to be seeing. Then a part which people like to call the slice of life part follows, in which a lot of characters are introduced episode by episode. Some of these characters will join the main cast actively. This isn't actually slice of life as it actively seeks out events to introduce more people. As such, you will have no idea how much time has passed as this is aslo never mention. Then action happens and doesn't stop till the end. You may or may not like the slow 9 episodes after the first 3, but that's pretty much what it has to offer.\\n\\n\r\nThe fanservice is is mostly at the start and in the early stages of the slice of life parts. There are tons of bathing scenes where they're basically showing everything except for genetalia and nipples. My personal opinion is that it felt like they had to put these in to keep the attention of people who can't keep focused unless stimulated.\\n\\n\r\nThe humour is pretty decent half of the time, other times it's repetitive or misplaced. One of the most recurring themes for humour is yaoi. Now it's not wrong to try to entertain people with yaoi, it is however getting old fast if you use the existence of yaoi and embarrassment of being associated or reading yaoi repeatedly.\\n\\n\r\nThe plot is a pretty meagre one. A guy with no past basically gets a girl to help him out. Then for no reason girls start flocking to him. The MC spends some time in the capitol before he finaly gets caught up in battle (by choice). For some strange reason great things are expected of Haku, our MC.\\n\\n\r\nThe characterization is also pretty meagre at best. \\n\r\nHaku is the MC, he's lazy and somewhat smart. Since he tries to actively avoid doing anything you don't learn much about him except his fondness of being lazy. Oh and he does like his friends.\\n\r\nKuon is traveling around she claims she sees Haku as someone she has to take care of and acts motherly around him. She has a lot of family who she respects or so it seems at first.\\n\r\nUkon is a strong man who likes to help people out, he's also very devoted to his emporer and for some reason very fond of Haku.\\n\r\nNekone is obsessed with her brother and basically looks down on everything silly.\\n\r\nRurutie is a princess that likes yaoi, cooking and is perhaps a bit jealous. Oh and she's not very fond of fighting and has a bird that's combat capable. \\n\r\nAtui is a princess whom is combat capable, she's pretty easy going and I think she (or else it was Rurutie (this is how important this detail was regarding the story)) was looking for love.\\n\r\nMaroro (cowaredly)/Kiuru very fond of Haku for some reason.\\n\\n\r\nSome inconsistencies are that Yamato, the region where this anime seems to take place, doesn't seem to exist at all in the prequel. If it existed, then the Avu Kamu arc would probably have gone drastically different. Also powerlevels seem higher here and technology a lot more advanced. Magic also plays a much greater role. Also I cannot imagine Dii or however you wish to spell his name not having interfered in Yamato. Also there's a huge tamed bird that's combat capable, if so many combat capable creatures were out there, where were they in the prequel? Also for some reason Onvitaikayans or however you want to call them and ultra strong bugs are now roaming the earth freely.\\n\\n\r\nAnyway my conclusion is that the art and animation are pretty good, the story is told in such a way that there are gaps here in and there which makes events harder to explain and timespans aren't clear. Humour is good at times and at others it could have better been left out. If you liked the setting of the prequel and only look for something like it, this anime can be ok. It's just important not to expect to see any characters from the prequel or any dept in story or characters.\\n\\n\r\n====Spoilers/in dept start here====\\n\\n\r\nYaoi is ok, you can make jokes about it, but when you send Yaoi to your general out at war to raise her morale and the General actually goes ahead and read it... That's just forcing the humour out. Also there were lots of moments in serious epsiodes which were about fighting and surviving where predictable humour was added. Not only do these things ruin the atmosphere they also ruin the pacing and what not.\\n\\n\r\nThe plot in my eyes is very very bad. Kuon saves Haku, that's ok. Haku saves Maroro, that's ok. Ukon saves everyone, that's ok. Then they get to the capital. About 9 episodes where nothing plotwise happens is OK. But these episodes are not used to establish bonds, to make characters flourish which basically bites back later when things speed up. Haku goes to war to join Ukon. This is still OK. Haku sees Vurai's mass destruction and is scarred for life. That's OK. Then Tusukuru war happens, which is very sudden and unexpected. Haku then accepts the mission. That's where it all goes wrong. There's no reason for Haku to join the war. He dislikes war, he doesn't want to see innocent people die. He also, isn't attached to Yamato so there's no reason for him to serve. Also there's no reason for HIM to serve in the first place, it could have been ANYone. Then they go search for Kuon. My logical reaction would be, Kuon has gone home to her homeland to defend it. Instead they go around looking for Kuon at food stalls. Then the most surprising thing of all, Kuon decides to help Yamato. Fighting Tusukuru to her, means possibly facing Karura, Touka, Aruru, Kamyu, etc etc. People who she calls mother/sister. At war, Aruru then leads them to their generals camp. For reasons unknown ofcourse. Haku then decides to do what Hakuoro did too, recycling tactics is fine. Eventually they succeed in destroying the provisions and go home empty handed. War with Tusukuru never happened. Then plot and betrayal which is OK.\\n\\n\r\nThe characterization is one of the worst things of the anime.\\n\r\nKuon mothers over Haku and is secretly very fond of her family. She respects them deeply. She said she wanted to explore the world, which is fine. But that also means she doesn't have a real connection to Yamato, thus no reason to help Yamato wage war. And her reason to join the war was to end it swiftly, I'm not sure how she though she was going to end it swiftly but it was never shown in any way that it would end swiftly. It feels like Kuons reason to wage war against her homeland was ungrounded and therefore a bad decision to make her do so.\\n\r\nHaku is lazy, not combat capable and does want to help his friends. His first \"fight\" would be against the giant bug. He was useless. His second fight was when he was in the capitol. If I had to make a good estimation, a couple of weeks upto a month had passed. Ukon fought him and told him he had improved. WHAT? Improved how? How did he change from 100% useless to combat capable? Surely he wasn't practising, atleast we were never shown any of it. Time passes again and he defeats guards, people trained for combat over a prlonged period of time. Later he blocks a blow from Vurai. Yeah that's pretty ok to do, Vurai isn't even strong.... Anyway for some reason he got ultra strong and combat capable without any reason.\\n\r\nHarem girls: \\n\r\nNekone, just dislikes everything except her brother, more, we don't know of her. She is supposedly smart and educated beyond her years. Her role is nonexistent.\\n\r\nRurutie, we don't know anything about her except that she likes yaoi, cooking and dislikes war. Her little act at the end pointing a dagger at Kuon is first of all out of character (as she just agreed with Atui she wanted to help them).\\n\r\nAtui, is easy going and combat capable. That's basicaly her whole role. It's unknown to me why any of these girls flock to Haku.\\n\r\nMiko girls: Fanservice/humour device/deus ex-machina magic, but usually useless because of magical barriers they then just shield.\\n\\n\r\nPrequel characters: \\n\r\nKarura, hates to be called mother/drinks/investigates?\\n\r\nTouka, servant of Karura?\\n\r\nAruruu/Kamyu like Kuon, want to look after Kuon. And about Aruruu, it's still a mystery why she helped Kuon/Haku to the camp.\\n\\n\r\nI mean it's all great and fun if you want to add characters from the sequel, but atleast give them some character or part to play. Touka for instance made an appearance, but if she didn't NOTHING would have changed, the same goes for Kamyu. Karura and Aruruu atleast played a small role.\\n\\n\r\nThe characters are just poor. Atui plays a bigger role in the sequel than Touka did in the prequel. But yet I can tell you a lot more about Touka than I can tell you about Atui. Touka for instance is a Evenkurga or however you wish to spell it. She was devoted to help good defeat evil. She has high morals and would only do what she thought was right. She's combat capable because she grew up in a clan where that would be normal. She decided to serve Hakuoro because she wanted to repay her debt. She feels a strong sense of duty to bring back the body of that other king home and play as a body guard for Hakuoro leaving him pretty much guarded most of the time even to an extent that it could become seem as a burden.\\n\\n\r\nAlso it makes sense that people flock around Hakuoro, he helped Yamamura, solved the Mutikapa problem helped around with other stuff. Got accepted as one of their own, got appointed head of the village. Lead a rebellion, defended his people against enemies, rebuilds what's lost. Haku doesn't do anything to deserve people gathering around him. So it's not logical that they do.\\n\\n\r\nAlso told why Mutikapa was combat capable, and thus it's logical why Mukkuru is too. But there's not explanation or anything about the giant bird. This is just another thing that shows the prequel clearly put more effort into details.\\n\\n\r\nThe inconsistensies are mostly that things exist and are present in the sequel that would probably have altered the course of the prequel if they were there as well. The world was about lost when the Avu Kamu were roaming the world. But as far as I can tell, those things wouldn't have gotten very far invading Yamato. Tusukuru used to be a small country with a relative small army. A decade or 2 later they became so strong Yamato couldn't even defeat them. Oh and Tusukuru warships with magic cannon like shooting... Then there's the wildlife that I mentioned before, the technology to make cages go up and down for bug fighting with lighting that all ignite at the same time almost like lighting. The story about the mask and people being wiped out was also different. In the prequel people were living in the underground because because above they couldn't survive. In the sequel it was shown that people turned into those blobs and then some kind of ultra laser shooting down destroying everything. (including a city which seemed like the city it was taking place in). But it would make more sense to me, if something like that would happen before people would grow close to extinct rather than afterwards. The prequel clearly showed that Iceman was released, conceived a child, then imprisoned again. He then changed people into blobs. Laser beam then destroyed a lot. This suggests that Iceman and furry eared people had been roaming the earth where people cannot follow for a year or so. A huge city above ground suggests otherwise.\\n",
            "date": "2017-05-29T05:40:00+00:00",
            "helpful_count": 2,
            "mal_id": 248796,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3319957.jpg",
                "scores": {
                    "animation": 9,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/doom19876",
                "username": "doom19876"
            },
            "url": "https://myanimelist.net/reviews.php?id=248796"
        },
        {
            "content": "The first Utawarerumono is vastly superior to this one. What made the show very enjoyable were its characters. In the first series we have Hakuoro, who is much more mature and intelligent than the protagonist, Haku, of Itsuwari no Kamen. Haku is in possession of a middle schooler's brain while Hakuoro has a mature one. This goes for the other main characters to a large degree as well. I realize that some of them aren't that old, but the sheer stupidity of some of the things they do is unfitting of someone with slightly above average intelligence. Average and below average intelligence are not enjoyableto watch. Keep in mind that i write this review considering someone with average intelligence to be frighteningly stupid. There are times and places for characters that are stupid, but this show is not one of them, especially not in the places of the main characters.\\n\\n\r\nThis show is very character reliant, and as such is very disappointing after having seen the first Utawarerumono. That being said, it's still much better than the average anime show.",
            "date": "2016-07-16T21:23:00+00:00",
            "helpful_count": 3,
            "mal_id": 224209,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/564087.jpg",
                "scores": {
                    "animation": 10,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ryanz84",
                "username": "ryanz84"
            },
            "url": "https://myanimelist.net/reviews.php?id=224209"
        }
    ],
    [
        {
            "content": "Careful not to pay too close attention to the number as they don't mean that much.\r\nAnyways, my previous review is somewhere here where I looked at it objectively from a development standpoint.  It does everything it needs to do, establishes a hero's journey, creates tension, and arrives at a climax before ending it.  It would be a 7/10 for execution.  Now that I'm done talking game, let's move onto the anime.\r\nYour hero is an everyday hacker, who is surrounded by anime animal girls, one of which has a fetish for hot springs.  We get to see their everyday life before wesee something happen.  What you say?   A general killing it's civilians as casualties of war.  You know, you generally don't want to kill off your productivity if you want to prosper as a nation.  Seriously, where are the key supporters and the businesses who were located in that city?  Anyways, the show starts to fall into a slump where the cast is depressed over the death of random people.  Does it make them better people? No, not really.  \\n\\n\r\nSoon there is a war with a neighboring nation who had another uprising which had their own set of one dimensional antagonists.  Sadly, it ends like I would've expected.  Nothing really changes.  No real stakes involved.  We just move into the next story arc.  Here we get to see a main character die by becoming  bubbles.  \\n\\n\r\nSo how is the story in the anime and the game?  It's bare bones. It's the same problem with their first game.  It sounds cool, a hero rising up and getting their people to overthrow their oppressive ruler.  But the characters aren't that interesting and there is no consequence for their actions.  Why is the bandit village stealing?  Is that productive?  Why are they not farming?  Why are they not doing literally anything else?  Yeah, it's that situation.  In many cases for banditry such as what happens in China, it is done not as an occupation, but to oppose the government or when people are experiencing extreme poverty.  But these characters just seem to exist as bandits with no real oppressive rule or extreme poverty.  \\n\\n\r\nDoes it end well?  No, not really.  It ends in the same way as the first game.  Best girl is ditched just like her mom by the protagonist when they decide to become god.  Both are doing it to be sealed away.  Seriously, has no one solved a problem without killing people, annoying the populous, or getting sealed away for religious/safety reasons?  \\n\\n\r\nSo, is it enjoyable then? Sure, if you like to see how they made the anime from an objective point of view and discussing the guidelines to righting a story.  But if you want to enjoy it as entertainment, it is subjective.  The main character doesn't exactly fit the series, the helpful male character looks too similar to the MC, so it's obvious what will happen, the antagonists are idiots, the key supporters are morons, the main cast are lounging around without a purpose, and nothing is really resolved at the end of the 2nd game or next season if it ever has one.  To stop the civil war, he unmasks the plan to, of course, blow up the city with a giant space laser!  Which apparently, still blows up the city.\\n\\n\r\nSo, how was this 5 minute review?  Like and subscribe for more reviews on anime.",
            "date": "2017-03-06T09:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 241997,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/BadReview",
                "username": "BadReview"
            },
            "url": "https://myanimelist.net/reviews.php?id=241997"
        },
        {
            "content": "Dispar as it might appears to be on my rating of this anime, I choose Overall 6 as well as Story 6 due the simple fact that, although being  sequel to a good Science Fiction / Strategy and Drama series, it failed to convey the richness of the first season, exchanging it for too much comedy relief in the first half of the series, and then rushing out things so badly that they just tossed ideas and revelations from one thing to another, explaining nothing at all and forgetting elements, hints and ideas laid during the series which were great if developed, throwing everythingto the wind in a finale that lacked sence and went to a very unecessary and plainly out of place drama path, totally unnecessary and senseless. I will not spoil things for those who have not seen the series, but they lost a chance to really carry on a great story, and clearly lost the hand of it all at the end. So much was hinted, so much was shown, so much was put in some episodes, but in the end they just forgot everything as just sidekicks (and all the elements forgotten were trully important ones for the whole story! Those elements were crucial, for instance the  the relationship of the Emperor and Haku...damn that alone would make the whole story different than what was done...I could not understand what happened there....no sense at all the path they choose) And the end being just a cliffhanger is a bit unfair after 25 eps, but as a prequel to the Final Installment of this series, we cannot ask much of it.  As the third istallment is scheduled for september 2016 (Utawarerumono: The Two White Emperors ~ Utawarerumono: Futari no Hakuoro) we should consider this 25 eps as just a very looong introduction to the real story to unfold in the final installment of this trilogy. So lets see what comes ahead, as they have a lot to develop from all laid down during this 25 episodes. Lets wait and see",
            "date": "2016-05-15T09:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 218604,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/135660.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/VoidHawk",
                "username": "VoidHawk"
            },
            "url": "https://myanimelist.net/reviews.php?id=218604"
        },
        {
            "content": "Utawarerumono: Itsuwari no Kamen is the successor of the original 2006 anime Utawarerumono. Both are 25-episodes anime and both are set in the same setting.\r\nFirst and foremost, I would advise you watch the first season before attempting to watch this one. Otherwise, you will not understand half of what happens in the second half of the anime. You might think this is obvious since this is a second season but you'd be surprised how many people dived straight in that anime without watching the original first...\r\nTo start off with a side note, I am baffled by the amount of people who claim this anime isbasically a Slice of Life anime and has no direction whatsoever and decided to drop it halfway. \\n\\n\r\nIt's not that nothing is happening, the anime is simply taking its time to properly do a good job at adapting a story that deserves that much time put into its world creation. I personally wanted to wait at least 20 episodes and surprise ! Things are actually happened !\\n\r\nBut back to the review.\\n\\n\r\nStory-wise, it is true that the anime starts off slow. That's a good thing. It takes its time to properly remind us of the world we were left in with season 1 while making A LOT of obvious references to it (and this is important, due to how many years it has been since it was released). In fact there are so many references that some people mistakenly thought at first that this wasn't a season 2 but rather a rework of the first season. But what we have is indeed the continuation of an epic tale of fantasy, sci-fi and war but with a whole new cast of characters... at the beginning at least. Not much to add, the story at first is mainly character-focused and later on links back to what we have left from season 1 to create tension and drama.\\n\\n\r\nIn my opinion, while the original Utawarerumono was focused more on its plot than characters, this season takes a different approach by giving each character its own arc in a way that makes us attached to them as the events go on. This however does not mean the story is neglected. \\n\\n\r\nIn fact, one could even divide Utawarerumono: Itsuwari no Kamen into two parts: the first half that is meant to introduce each new character to us and the second part which introduces climax, tension, drama, plot twists and allows the previously showcased characters to each shine in their own way through meaningful character development.\\n\\n\r\nThe artwork is one that is close to one commonly found in \"moe\" Slice of Life anime. While it works in the first half of the anime, it feels a bit out of place as the second half reunites us with characters from the first season who look younger due to the upgraded art-style even though story-wise they should be older. While the visual update is generally appreciated, I still can't help but feel like it contradicts with the image I kept from back when I watched the first season which has an art-style befitting of the 2006 anime era. \\n\r\nAnimation-wise, it feels smooth and fluid, so I have to give props to the animators for that.\\n\\n\r\nIn terms of music, well just like the original, the soundtrack merges perfectly with the tone of the scenes, using traditional instruments to give that kind of historical/fantasy feeling. I also really liked the first OP, not so much the second one but both of these are personal tastes.\\n\\n\r\nAll in all,  I consider this series to be just as great as its predecessor and a must watch if you were a fan of the first season.",
            "date": "2016-04-02T08:12:00+00:00",
            "helpful_count": 3,
            "mal_id": 215180,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5228498.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Trumpcard",
                "username": "Trumpcard"
            },
            "url": "https://myanimelist.net/reviews.php?id=215180"
        },
        {
            "content": "Just putting this here, I marathoned the entire first season in 3 days (including watching till 4 in the morning) just before watching this last episode. After seeing the last episode, and thinking through a bit, \"GO BACK TO THE FIRST SEASON: UTAWARERUMONO\". Its really important  (unless you're a genius at putting puzzles togethers, in which case, this one is still incomplete with the third game coming next year.)\r\nBut I'll just make my review on this anime series and this series alone. \r\nStory: Unless you've seen the first season's 26 episodes of amnesia, war, friendship, haunting past and man................(Not gonna spoil it), you wouldn'tgive this show atleast a 7. This show is literally tied, though not quite nicely, back to the first season, answering a few questions (and giving me a bigger map of the continent to look at. Seriously, their world functions just like agar.io) For me, I enjoyed this, more after seeing the first season. The first cour was all fanservice and introducing new characters (and the returning characters that are still alive and kicking ass) while the second season gets straight to the point of why its called \"Itsuwari no Kamen\" and how this season is the build up of the third season (Yes, we have a third coming.). Without spoiling here, there's a war going on for reasons that date back into the past, and things get hectic, with people dying, and a country breaking apart due to internal problems. \\n\\n\r\nI just say this here, the second cour sucks like shit. Period. The battles were lame, and its all about \"HAKU, SOLVE THIS FOR US. YOU\"RE A HUMAN\". The fanservice died out, and character development on the guy you never wanted to \"grow up\" beings here. Haku becomes (and I'm spoiling it). If you're deciding whether to watch this or not, give it a shot. The first 3 episodes are misleading of what this shows about (but it does hint what might happen in the end, and what's to come in the NEXT SEASON).\\n\\n\r\nTL;DR, Shit. (But if you watched the first season, bearable.)\\n\\n\r\nThe visuals were nice, as with all modern anime of 2010+. Comparing to the 2006 anime adaption of the first season, at least I won't have nightmares of all the CG they used (seriously, the battles were done with ugly polygons like Counter Strike or Lara Croft before 21st century came around).\\n\\n\r\nThe OST was nicely woven into this series, just like the first season. A soothing, well-paced soundtrack with unique, interesting instruments playing to give to the feel of a \"fantasy\" or \"aboriginal/native\" atmosphere. Sadly, no  very face-paced soundtrack for a few scenes that were...out of placed (The old man's secret rooms. yeah, talking about that). The OP and ED (and their 2nd cour ones) were also nice, especially the OP2. \\n\\n\r\nOther than great songs, I loved seeing past characters returning, grown up, stronger, and laughing (WHERE IS ERURUU!)\\n\\n\r\nAs for enjoyment. I guess it's rewatchable (as I had just finished the first season, want to see this go through properly) but really, the joy of this show isn't much. Its to build up and have everything in place for the next game/anime (I mean, the first season's anime could have actually been made with 10 more episodes making it 36.) Its a good series, but because I've kept my rule of S2 < S1, I'll say a 6 for this show. 7 if I have mercy and 5 if you're a real cruel critic or one who doesn't want to watch the 2006 anime.\\n\\n\r\nSo there you have it. Utawarerumono fans are like FSN fans, just milder or less left wing/Weab/obsessive otaku, but this show is still worth watching, if you're willing to go through the troubles of watching its first season, and waiting *cough* 10 *cough* years *cough*. Otherwise, I guess there are other great anime to watch instead. If you're looking for more battles in asian style manners, go watch those sengoku anime, else play the game. All in all, this anime is not as bad, but pretty bad.\\n\\n\r\nVerdict: 7/10\\n\\n\r\nP.S. Fanservice aimed at both Harem lovers, BL lovers and Fujoshi(s)",
            "date": "2016-03-26T16:03:00+00:00",
            "helpful_count": 3,
            "mal_id": 214264,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4893103.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/iKlariS",
                "username": "iKlariS"
            },
            "url": "https://myanimelist.net/reviews.php?id=214264"
        },
        {
            "content": "Where did it all go wrong?!?\r\nThe first season of Uawarerumono was great; the characters were developed well, the story was compelling, the action was good and it was enjoyable.\r\nThe second season on the other hand is like rotting meat left in sewage compared to a nice juicy steak (with the first season being the steak).\r\nIt starts off well, my hopes for it meeting the standard of the first season were high. Then it took a massive plunge like an obese man flopping off a 30 metre high diving board.\r\nAt least 10 episodes have no, or completely unrelated content in regards to the main storyline. Theprogression is slow, nothing even happens, save for a few harem-esque moments and the mc whining like a baby. \\n\r\nThe choices characters make have no sensible logic behind them, the mc can't do anything without a kick up the backside, all the female characters seem to adopt the good old BL book adoration and turning red at the sight of any men. \\n\r\nThe villain is unclear throughout most of the series which results in no sense if tension or foreboding.\\n\r\nI don't know how I managed to get through this season; the ending wasn't even very fulfilling at all... \\n\r\nIt is not even worth watching it for a sense of completion, the only thing you'll be completing is your suicide note and the knot in the length of rope you will hang yourself with.\\n\r\nThe only redeeming factors of this anime is the world (which was set up by the original series anyway), the art (which is high quality and consistent) and a few decent fight scenes.",
            "date": "2016-06-09T14:24:00+00:00",
            "helpful_count": 2,
            "mal_id": 220371,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5465461.jpg",
                "scores": {
                    "animation": 8,
                    "character": 4,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/-GLOtaku-",
                "username": "-GLOtaku-"
            },
            "url": "https://myanimelist.net/reviews.php?id=220371"
        },
        {
            "content": "First of all there might be some spoilers within this review because it isn't possible to be mad about this story by not even rant a bit about what went wrong within only one and in this case the last episode.\r\nI really enjoyed this whole setting and even if there wasn't much going on in a lot of those 25 episodes I really enjoyed watching all those great characters living their life. But also as the story started to unfold it really went into a nice story telling direction. The OST was really great and suited the settings perfectly. \r\nBUT and if you haven't watchedthe last episode please stop here.\\n\\n\r\nBUT what were they thinking? I mean the ruined a whole series with just one and in this case the last episode. This show would have received a much higher rank in my case if they hadn't done what they in fact did. \\n\\n\r\nThe whole \"I can't tell her it's me\"-thing is just crap. I mean his sister knows and also the two priestesses but he can't tell Kuon? Where is the sense about such a stupid story twist. I mean isn't she able to keep it a secret all of the sudden? I am really to upset to write any further because it all feels like if I have wasted watching a whole series for nothing. This season finale was beyond anything satisfying. It is a shame what they did.",
            "date": "2016-04-02T03:51:00+00:00",
            "helpful_count": 2,
            "mal_id": 215155,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5117618.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/withoutregretts",
                "username": "withoutregretts"
            },
            "url": "https://myanimelist.net/reviews.php?id=215155"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nI’ve never had amnesia.\r\nThe closest I have ever come to memory loss was the few hours following the removal of my wisdom teeth. While I wish to save the actual wisdom-teeth anecdote for later, suffice it to say that I do not remember anything that happened once the anesthesia kicked in. My parents tell me that I blubbered like a buffoon, though. Which, in all honesty, I could see myself doing.\r\nUnfortunately for Utawarerumono: Itsuwari no Kamen, it ends up as a forgetful experience, too.\r\nSTORY\r\nUtawarerumono starts off with mystery in mind. Kuon, a wandering woman, discoversa man seemingly lost in the woods. He has no knowledge of who he is, and he cannot seem to recall his memories. Kuon decides to name the man Haku, and thus the anime begins.\\n\\n\r\nThe show definitely starts off on the right foot (or perhaps the right paw). Kuon and Haku form a nice duo. Their silly antics and their potential connection creates a relationship that has a lot of room for growth. The quaint, woodsy setting plays on the mystical, easing the audience into the concepts of animal people, technological deficiency, and otherworldliness. Extra characters bring both fun and purpose. A carefree yet commanding leader, an important princess, and a giant, cooing bird add variety to the show without taking away from its current feeling.\\n\\n\r\nEvent-wise, the anime takes a combined approach. The majority of the scenes are slice-of-life-oriented, such as Kuon spying on Haku or Haku doing his best at manual labor. Simultaneously, some of the scenes are action-oriented, such as a battle against a massive centipede or a kerfuffle with some thieves.\\n\\n\r\nTo put it differently, Utawarerumono does well in establishing its premise and direction and scope.\\n\\n\r\nThen the anime slows everything down. Really slows it down. For approximately nine episodes, the anime chooses to focus on just slice-of-life material. The first couple of these episodes are acceptable since they help to transition from the old setting and into the new one. But once the show continually goes with this direction, the events themselves start to feel largely inconsequential.\\n\\n\r\nFor example, some of the group members sneak onto a ship that gets overrun with giant bugs. Anju, the princess, tries to understand what love means. Kamunagi of the Chains, two daughters of the high priestess, are given to Haku as a reward, leading to an episode with a disproportionate number of sexual acts and innuendo.\\n\\n\r\nSlowing down the anime so much leads to stagnation. Indirectly, it keeps the cast in single spot for a long while: the capital of Yamato. Consequently, where the first few episodes made progress in terms of world-building and providing motivation for the characters, this stretch of nine or so episodes where very little actually happens feels unfocused.\\n\\n\r\nEspecially so when the remainder of the season – thirteen episodes – is dedicated to obscene amounts of action. While the fight at Maruruha is pertinent for the masks and Haku’s character, much of this action simply feels pointless. The attacking Usuurussha, bandits basically seeking food, lacks a place in the narrative following their retreat (and despite the big showing the anime made with the daughter of one of their generals). And the entire invasion of Tousukuru, Kuon’s home country, ends up as worthless in the long run.\\n\\n\r\nThe majority of episode seventeen deserves a special (negative) callout. This episode is dedicated to unveiling a huge revelation: that the Emperor and Haku are the only humans on the planet. In short, the animal-esque people of the world were created by the Emperor after people destroyed themselves, and, also, the Emperor is Haku’s older brother.\\n\\n\r\nFirst, this reveal comes out of nowhere. After those snowy mountains, the stretch of slice-of-life events, and a hefty amount of battling, the anime drops this information on the audience without discretion. And second, and arguably worse, the anime does almost nothing with this information. Haku somewhat gets inspiration from the news when he destroys a provisions storehouse later on, but these relatively gargantuan details have next to no impact on the narrative.\\n\\n\r\nBut Utawarerumono does not stop there. It also falls prey to other narrative snags. For some reason, the show chooses to kill off the Emperor off screen and without warning. One of the final plotlines, the attempted murder of Anju, does not receive a resolution. Ukon gives up his mask to demonstrate his loyalty to the princess, but it serves no purpose once out of his hands and is even given back to him some time later, making the entire exchange unnecessary.\\n\\n\r\nThe show runs into thematic trouble as well. It tries to emphasize the necessity of war in order to fight for resources and display dominance. But the majority of the season is not dedicated to war – the first half is (to reiterate) slice-of-life whereas part of the second half is more centralized in its conflicts. In essence, the whole war angle, while appropriate for certain circumstances, does not fit within the anime’s other material.\\n\\n\r\nOverall, the narrative begins and means well, but, the further along it proceeds, the more issues it brings upon itself.\\n\\n\r\nANIMATION\\n\\n\r\nUtawarerumono’s artistic direction does well in certain areas but not-so-well in others.\\n\\n\r\nFor example, the background art is more unfortunate than fortunate. Similar to the story, the backgrounds are supported by the more mystical environment. A mountain village and snowcapped hills purport that differentiation of the land exists (as do the visuals of the first ED). Yet, once the anime constrains its setting to just the capital of Yamato, the anime unfortunately hits a lack of creativity. This misfortune continues into the latter half of the show as well: open fields, some forests, and random towns are not exactly immersive.\\n\\n\r\nTo be fair, the show does place care in the details. The capital is very cultural with food stalls, stone castles, and minor amenities. Lighting as well. Many moonlit nights, delicate sunsets, and daytime outings blanket the show in various forms of light.\\n\\n\r\nActual animation is somewhere around average. Action sequences, while not the most choreographed, are filled with lots of sword swinging, jumping, and (sometimes) giant fireballs. Downtime is similar in that sequences can see a nice amount of movement – dancing, searching, and joking – but nothing outright dazzling.\\n\\n\r\nThe character designs are quite nice, though. Mostly because of the extensive variety. While they all derive from (more or less) the same cultural influences, they tout different colors, different animal characteristics, and different styles.\\n\\n\r\nFor example, Kuon’s long hair, warm colors (light purple, orange, and yellow), and plain tail paint her as a kind and mature woman. Rurutie’s black-and-white garb with pink-colored additions coincide with her princess-yet-lewd and sweet personality. And Munechika’s white-and-blue garb, curled hair, and short tail depict her as the wise commander she is known to be.\\n\\n\r\nCHARACTERS\\n\\n\r\nUtawarerumono has a singular problem with its cast: Too many characters for its own good.\\n\\n\r\nGranted, having a big cast is not an inherent problem. It all comes down to their use. Their purpose. Their execution.\\n\\n\r\nIn Utawarerumono’s case, the execution fails to be present. Mostly because it continually adds more and more and more characters to the pool without stopping to explore them to any large depth. The show has Haku. And Kuon. And Rurutie and Atui. And Ukon and his little sister. And the samurai and his daughter. And the princess, the emperor, the emperor’s assistant, her two daughters, and…\\n\\n\r\nThe show rarely explores anyone that is not either Haku or Kuon. They do have their particular characteristics – Rurutie loves boys-love material, Atui is very particular about men, and so on – but these traits get tiresome when they are used over and over without major deviations from their respective formulae.\\n\\n\r\nArguably, they do not need to have development. They do not need any extensive change to their character. Which, to some extent, is true. They are not wholly important to the plot, and there are just way too many of them to adequately divvy up necessary attention.\\n\\n\r\nBut the show has twenty-five episodes to work with. That’s a lot of time. Presumably enough for everyone involved.\\n\\n\r\nEven if these side characters are given exemption, Haku and Kuon’s development is not.\\n\\n\r\nHaku started off in a rather interesting spot. Without memories, he had no way of understanding who he was, where he was going, or even why he was there in the first place. But he did know what he wanted to do: nothing. He was lazy. Whenever possible, he would prefer to sit around the campfire rather than subject himself to more work.\\n\\n\r\nYet he was surprisingly good at the jobs he was given. Mostly because he would seek out a way to perform the task efficiently. I.e., he would devise a way to get the job done with as little work out of him as possible.\\n\\n\r\nAnd while he was not an amazing fighter like Ukon, he was courageous and could hold his own. Plus, he learned how to read and write, treated others with respect, and did his best with the craziness that happened around him.\\n\\n\r\nUnfortunately, these traits are as much as his character gets. Roughly halfway through the season, Haku does have a small situation when he becomes terrified of the prospect of war. His friends cheer him up, letting him know that war and its outcome is natural. At least, natural for their world. But one miniscule development over twenty-five episodes seems dismally disproportionate.\\n\\n\r\nIn fact, Haku is arguably a very bland character. Furthermore, this blandness makes it strange to get behind Ukon’s constant reliance on the dude. Haku is not exceedingly strong, and he is not exactly a genius. In other words, he doesn’t stand out.\\n\\n\r\nThe idea is that Haku is simply charming. As the only human (besides the emperor; almost nobody knows that either of them are human), as this lazy yet strangely productive person, he attracts others to his circle.\\n\\n\r\nAnd, arguing in his character’s favor, that may be the point. That is, one does not have to be an “amazing” person to influence the world. Yet, even taking this mindset into consideration, the evolution of his character does not support this idea. Haku never really affects those around him, let alone the direction of the plot, going with the flow of events for nearly the entire season. And when the audience finally does see him gain a position of power, the show ends.\\n\\n\r\nNot that gaining power and numerous friends changes him for the better. Indeed, besides Ukon, he does not seem to strengthen his relationship with anyone – including Kuon.\\n\\n\r\nKuon’s relationship with Haku is alarming for this very reason: not having a strong foundation. In the beginning, when it was just the two of them (and maybe a couple of other characters), one could easily see where their relationship stood. She teased him, shared meals with him, and traveled with him to take care of different happenings.\\n\\n\r\nFollowing their trek to the capital, however, Kuon’s relationship with Haku almost stagnates. As more characters are added, Kuon gets less and less time to spend with Haku. The story’s action-heavy direction also forces their separation. And while she does get angry with Haku after their initial time together, their moments on-screen get reduced to a pitiable amount.\\n\\n\r\nThe result is a weak relationship between the two. Subsequently, Kuon’s later (presumed) romantic feelings for the man and distress over his death come off as empty. It’s unfortunate. They are the main duo of Utawarerumono, but, because the anime spent almost no time on building their relationship, Kuon and Haku are not strong together.\\n\\n\r\nAgain, for all of the cast members, if the show were shorter in length, it would be somewhat more acceptable to not have as much care given to each of them individually. But given how much time the anime had to work with, it’s almost inexcusable for the anime to have characters so weak writing-wise.\\n\\n\r\nSOUND\\n\\n\r\nThe first OP incites wonder, a feeling of mysticism that fits well with the anime (at least the first quarter or so). The cultural instruments, the nice vocal work, and the build-up into the fast-paced portion come together to create a somewhat intricate track that is both catchy and fun.\\n\\n\r\nThe second OP tries to follow in its brethren’s footsteps. Mysticism reappears, and cultural sounds – like the background chants and the wood tapping – return, too. Most of the piece contains skipping singing and unobtrusive instruments, but the final stretch twists the tone. As the vocalist picks up emotion and the instruments start to resound, the tone moves from normal to almost harrowing, mirroring the shift in tone of the anime itself.\\n\\n\r\nThe first ED slows down the festivities (in similar fashion to the story). While not serene, the piece is peaceful, the soft piano accompanying the thoughtful singing. The second ED is similar but slightly more mystical. The track gradually builds into strong drums, passionate singing, and cultural sounds that match the sadness the show concludes with.\\n\\n\r\nWhile neither of the EDs are particularly gripping, they are at the minimum nice additions to Utawarerumono.\\n\\n\r\nThe rest of the original soundtrack continues with the foreign feel. From the slice-of-life escapades to the countryside brawls, Asian ambiance fills the atmosphere. This music turns their hotel, the capital of Yamato, and the surrounding world into a place teeming with intrigue and cultural influence.\\n\\n\r\nVoice acting performances are well done as well – if only thanks to the various vocal tics that some of the different cast members use. As such, some shout-outs are deserved. Risa Taneda as Kuon and her “I think.” Chinatsu Akasaki as Anju and her “Indeed!” And Madoka Yonezawa as Kokopo and her constant cooing.\\n\\n\r\nENJOYMENT\\n\\n\r\nTo be honest, I am disappointed in this one.\\n\\n\r\nIt felt as though it had a lot of potential. Especially in terms of the characters and their interactions together. Haku actually ended up being a rather boring person to follow. Kuon seemed to get the brunt end of the stick in terms of focus once the cast size became unwieldy. And the rest of the cast were just not interesting – mostly because the anime never cared enough about them.\\n\\n\r\nYet easily the worst character in the entire anime was Dekoponpo. He was so aggravatingly annoying. His dumb-and-arrogant-yet-he-still-gets-away-with-it persona had me shaking my head. And then my eyebrow would raise when the anime continually relied on him. Be it for comedic relief or for some small plot point, he soured the experience completely.\\n\\n\r\nIt’s fair to say that I would have liked this one more if I had seen the prequel first. This sentiment is apparent in the (obvious even to me) cameos. They didn’t resonate with me. Yes, they were nice for the sake of Kuon and her character, but they lacked the emotion, the nostalgia that such reappearances would garner.\\n\\n\r\nA lot of the action was not that gripping, too. Going from smaller, cultural conflicts – gigiri and weird slimes (that are actually the original humans) – and interpersonal, slice-of-life events to countrywide war and massive, mystical beasts was too much of a contrast. I would have preferred the show stick with its more grounded, comedic material despite its slowness.\\n\\n\r\nThe ending also irked me. I could have maybe forgiven the show for having Haku literally let Kuon go if his maids and Ukon’s little sister did not already know the secret. But, since they did, it made not telling at least Kuon as well – given how distraught and emotional it made her – such a lame conclusion.\\n\\n\r\nEven so, not everything was dismal. Kuon getting playfully angry with Haku had me smiling. Rurutie’s constant fantasizing had me chuckling. Ougi’s strange devotion to his sister got laughs out of me. Anju’s childlike crush on Oshutoru had me cheering for the little girl. And Saarana and Uruuru brought a sexual edge that I welcomed.\\n\\n\r\nUnfortunately, these positives were unable to overcome this overabundance of negatives.\\n\\n\r\nUtawarerumono: Itsuwari no Kamen starts off strong but slowly falls down the mountain. While the art and the sound-work deserve some praise, many other areas do not. The narrative has a slew of issues. The characters are unexplored. And various annoyances only serve to hurt the anime. Getting amnesia would be a better alternative.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, mystical beginnings give way to inconsequential events, unimportant action, and multiple narrative snags\\n\\n\r\nAnimation: Fine, okay artistic direction, about average actual animation, and nice character designs\\n\\n\r\nCharacters: Terrible, too many characters overshadow both Haku and Kuon, preventing any worthwhile development\\n\\n\r\nSound: Good, good first OP, good second OP, okay first ED, okay second ED, nice OST, above average VA performances\\n\\n\r\nEnjoyment: Bad, while some fun can be found, boring action, a lame ending, and especially Dekoponpo are too ruinous to ignore\\n\\n\r\nFinal Score: 3/10",
            "date": "2017-06-04T20:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 249289,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=249289"
        },
        {
            "content": "The One Being Sung: The False Faces is the second season of The One Being Sung and has a very similar premise to the original. A man with no memories finds himself in a sword and sorcery world populated by people with animal ears and tails. After being saved from a monster by a cat-girl named Kuon, she declares that from now on she is his guardian and the two begin their journey together. \r\nThis anime is set several years after season one and includes a few cameo appearances from characters in the first season, but this anime is set in a different country andyou really don't need to watch season one before watching this anime. \\n\\n\r\nOne thing you may be wondering is why this anime is ranked so much lower than season one. Well, that's because none of things that made season one good (like strong characters, a great story, cool fight scenes) are  in this anime. \\n\\n\r\nStory 3/10 \\n\\n\r\nWhile season one was more of an action-adventure story, this anime is mostly a slice-of-life story with most of the anime just being about Haku and the others goofing around in the capital. I like slice-of-life anime, but my problem is that the action and fighting was what I liked the most about season one. Furthermore, usually in a slice-of-life anime there's a lot of focus on the characters and their development, but this anime keeps adding new characters and changing focus that we don't get the time to develop their personalities. \\n\\n\r\nHowever, this anime does have some action in it with some of the large-scale warfare that was present in season one and some one-on-one fights, too. However, we only get a quick taste of action, though, because in the middle of the battle the focus has to change from the war to whatever Haku is doing leaving me saying \"Can we go back to the fighting?\". \\n\\n\r\nFurthermore, season one left me with some questions I was hoping season two would answer, but no such luck. In fact, Hakuoro's name never comes up once and we don't learn anything that wasn't already explained in season one. \\n\\n\r\nFinally, I really don't understand the beginning of this story. So Kuon saves Haku's life and declares that from now on she's his guardian...why? I mean Haku and Kuon are complete strangers, but Kuon just randomly decides to be his guardian. What? Usually there's a reason the main characters are traveling together like in InuYasha Inuyasha and Kagome are traveling together to find the shards of the sacred jewel, but what sparks Kuon and Haku's relationship? \\n\\n\r\nCharacters 7/10\\n\\n\r\nFirst, I want to clarify that I hate Haku and it's all the other characters that got this anime a 7/10.\\n\\n\r\nThe reason I hate Haku is simply because he is the main character; this anime would be at least ten times better if any other character like Kuon or Ukon were the lead. Haku is lazy, cowardly, and there just isn't anything interesting about him at all, but for some reason Ukon and the other characters keep treating him like he's some kind of hero. For example, Haku will get captured by bandits, another character rescues him with Haku doing nothing, and later Ukon will be saying something like \"I was impressed by how you defeated those bandits\", even though he did nothing. \\n\\n\r\nThe one good thing about Haku is that he's smart and can find solutions to problems. However, everyone else does the hard work while he just watches or complains. Why is he the main character!!!\\n\\n\r\nKuon, Uknon, Nosuri, and Kokopo (the giant bird that doesn't talk, but is somehow still more interesting than Haku) are all far better characters than Haku and I wish there was more focus on them. However, because Haku has to be the center of every episode and this anime keeps adding more characters we don't get the chance learn much about them. \\n\\n\r\nThis anime is like if in Dragon Ball Z Krillin was the main character instead of Goku. \\n\\n\r\nOverall 5/10\\n\\n\r\nMy recommendation is to not watch this anime. It doesn't advance the story of season one, Haku may be the worst main character ever, and this anime has none of the things I liked about season one. \\n\\n",
            "date": "2017-04-13T20:46:00+00:00",
            "helpful_count": 1,
            "mal_id": 245444,
            "reviewer": {
                "episodes_seen": 25,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3238983.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/middleground4471",
                "username": "middleground4471"
            },
            "url": "https://myanimelist.net/reviews.php?id=245444"
        }
    ]
]