[
    [
        {
            "content": "- Updated after completing the anime.\r\nYuru Yuri is a light-hearted and pleasant to watch slice-of-life filled with moe and comedy. Like the anime's very name makes it obvious, this anime also \"kinda\" foccuses on the relationships between the characters, which are all girls (and thus, \"yuri\"). It isn't anything as serious as you would see in other romance-orientated shoujo-ai anime like Strawberry Panic, but it isn't used for ecchi fanservice either, like you could see in Queen's Blade or many anime similar to it. \r\nThe \"yuriness\" in Yuru Yuri is meant for moe, cuteness, and comedy purposes, and I've got to say, it works verywell. This said, I reckon that even people who would feel disgusted by seeing such relationships (GirlxGirl) should be, in theory, able to watch Yuru Yuri.\\n\\n\r\nIt's 2nd season, Yuru Yuri ♪♪, does an extraordinary job keeping up with the 'main four', allowing us to have our share of Toshinou Kyouko, but while focusing quite much more on it's other characters too, which didn't have so many moments in the spotlight as they're having now (especially Sakurako and Himawari).\\n\\n\r\nBut something I'm fairly sure about, is that if you are not into moe or comedy, you'll absolutely hate Yuru Yuri. Why? Simple, it's just because this is exactly what this anime excels at, and you shouldn't be expecting much else while watching it.\\n\\n\r\nStory\\n\r\n8/10\\n\r\nThe story is very simple, but works really well for this anime. It's what you could expect from a simple moe slice-of-life: The everyday school life of the protagonists. The little twist in this one (emphasis on \"little\") is that they've created an \"unregistered\" club in the abandoned tea club room, the \"Amusement Club\", where they, well, do fun things, because fun things are fun. This deserves an 8 in my opinion because it's to be expected, and like in many other animes, this simple story works very well.\\n\\n\r\nArt\\n\r\n8/10\\n\r\nEven if it's not stunningly eye-candy like Fate/Zero, Kara no Kyoukai or Guilty Crown, neither unique and twisted like Bakemonogatari or Madoka Magica, the art reflects the nature and objective of the anime: Cuteness. It is simple and cute, and fits just perfectly. Anything more complicated would have ruined it, in my opinion.\\n\\n\r\nSound\\n\r\n8/10\\n\r\nI was already an fan of the first opening and endings, but they managed to improve it even further. Both songs are fun, energetic and kinda catchy, so I guess this also fits very well. I'm kinda exigent when it comes to the openings and endings, especially when they show us them before the anime actually begins even in the first episode, for it gives us an \"first impression\". The opening became easily one of my favorites, and the background music and sound effects for the rest of the anime are just refined and well made. Even if I tried to, I'm unable to find anything to complain about in them.\\n\\n\r\nCharacter\\n\r\n9/10\\n\r\nEveryone already knows the standard character typos: The Tsundere, the Bookworm, the Genki Girl, and so-so... But good luck trying to fit every Yuru Yuri character into a \"preset personality\". The anime presents us with funny and likeable characters, with very unique personalities that I hadn't seen anywhere else before. A few examples are the \"main character\" with no presence that is pretty much invisible, the Student Council President that whispers so softly she looks mute and only the mad scientist, explosion-addict chemistry teacher is able to translate what she says, and also, the two meganekkos that nosebleed/drool when they remove their glasses and fantasize about yuri. They're very innovative, and most importantly: Loveable. Perhaps I'm the wrong person to talk about this, but I just adore every single character in this anime.\\n\\n\r\nEnjoyment\\n\r\n10/10\\n\r\nThis. Enjoyment is what I weight more heavily when giving out my score. If I really enjoy an anime, it doesn't matter how crappy the art or sound may be (unless they're SO bad that they actually ruin the enjoyment), it may be able to score just fine. And Yuru Yuri is no exception: I'm just unable not to love it. I feel very well, in peace, while watching it, and every second spent watching is a second well-spent. This is the kind of anime I'll never feel bored watching or wishing for the episode to be over quickly (if you're watching something while thinking \"Damn, isn't this over yet? I need to do something else.\", then you're not enjoying it.), and I always actually want to watch more once it's over. And thus, a 10 in enjoyment.\\n\\n\r\nOverall\\n\r\n10/10\\n\r\nEven if the Story may be a bit \"common\", and the art, simple, all the rest this anime has to offer counterbalances it's little imperfections. I couldn't wish for Yuru Yuri to give me anything else, except longer seasons, perhaps, for these short, 12-episode-long ones always leave me wanting for more. I already loved the first season, it's true, but they managed to somehow even improve every single aspect they could in the 2nd, and I found myself unable to rate it anything but a masterpiece.",
            "date": "2012-07-16T13:32:00+00:00",
            "helpful_count": 133,
            "mal_id": 66745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1000021.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Morbyllan",
                "username": "Morbyllan"
            },
            "url": "https://myanimelist.net/reviews.php?id=66745"
        },
        {
            "content": "Okay, let's begin by addressing the tremendously obese elephant in the room. I gave an anime involving moe a nine. \r\n  But before many of you collect pitchforks, torches, tough rope, and a sturdy tree and begin to hurt, riot, and chase my sorry Gluteus Maximus, allow me justify the rating. The second season of \"Yuru Yuri\" is actually an accessible, light-hearted, and very funny triumph. One of the many great things about the second season of \"Yuru Yuri\" is that you don't need to: live in a dingy and cramped basement, own multiple moe figures, have several colorful posters plastered across your wall, possess gigantic male breasts, andhave hair cover 95% of your body. In other words, you don't need to be a typical, easily-impressed moe fanboy to enjoy the series. The anime actually provides authentic laughter along with a gratifying array of cutesy, endearing, and wonderfully quirky characters. \\n\\n\r\n  It makes genuine attempts at being humorous and is thoroughly successful with them. The gags haven't gone stale since the first season because they are all generally reworked in pleasant ways. The second season is solid enough to stand on it's own feet. In fact, it's actually even stronger than the first. The playful sense of humor is even more apparent but without being overbearing or intolerable. The clever jokes are even more consistent, and it accomplishes its fairly simplistic goal of being both being very funny and adorable.\\n\\n\r\n  The premise is familiar and the situations are seemingly mundane. When one approaches this anime without any knowledge, it does certainly seem that this is just another throw-away series made by a random anime studio in a yet another substandard, thoughtless, and desperate attempt at making a successful anime sales and revenue wise. These attempts are typically composed around heavy amounts of pandering, poor humor, weak characters, and complete lack in any real effort or care. It is very easy to cast off this anime as just another one of those, but doing this would result in missing out on one of the anime industry's hugest and most surprisingly satisfying efforts to premiere in 2012.\\n\\n\r\n  It's four girls, one club, and a never-ending stream of endeavors at amusing themselves performed by the four main character girls. The club's title, The Amusement Club, obviously reflects the real purpose. The main character, Akari, is supposedly the heroine, but is usually ignored and barely has any screen time. The series uses her being ignored as the subject of many of its jokes. It also uses female-only romantic affections (\"yuri\" is in the title after all) as a very capable source that ensues in much hilarity. Many of the characters have crushes on each other and one club member in particular, Chinatsu, is very direct about her attraction towards another club member Yui. The final club member, Kyōko, is very vocal with her attraction and borderline obsession towards Chinatsu. Most of the attractions are unrequited, but their misfortune only causes more hearty laughs. Although the second season of \"Yuru Yuri\" is still an actual yuri anime, it continues to parody and lampoon certain tropes of other prominent yuri series. At times, Kyōko and Chinatsu's love illusions towards their chosen ones are amplified to such high degree, which ends up resulting in a pleasing parody of standard yuri.\\n\\n\r\n  Akari Akaze is the main character that everything is supposed to revolve around. However, situations tend to never go in her favor. She is a very cheery and bubbly girl who wants to be everybody's friend. The problem she faces is that her personality isn't particularly memorable or special compared to her three closest companions and fellow club members. They frequently ignore her, and don't even notice her even though she's practically always with them when they get together as a club. Multiple gags are based on this including the ever popular \"AKARIN!\" invisibility joke that she sometimes does. She is an enjoyably pathetic character that deserves either heaps of resonating empathy or great pity. It's interesting to see such an unflattering depiction of the character in an anime. Whether it be comedy or not, this is rare and very refreshing when done well. And \"Yuru Yuri\" provides an excellent execution.\\n\\n\r\n  Kyōko Toshinō is arguably the most lovable character because of her hyper personality and amusing shenanigans. She's always pulling something and it seems to always annoy Yui or Chinatsu. She typically bothers Yui with her bold actions, and irritates Chinatsu with her constant pestering due to her giant attraction towards her.\\n\\n\r\n  Yui Funami and Chinatsu Yoshikawa are vital characters as well. They are also the basis and the cause of many successful gags. Yui plays the usual, calm, and somewhat quiet girl who acts with a reasonable mindset. Chinatsu is average on a superficial level, but deep inside her burns a violent passion for Yui. She admires and is severely attracted to her. Chinatsu's love delusions involving Yui, like Akarin's popularity expectations, are priceless and honestly create some wild laughter.\\n\\n\r\n  Other less important characters are shown serve basically as gags that don't give much purpose or gather as much as interest as the main cast. However, all of them are generally funny, albeit in a lesser degree. Thankfully, they are given less attention and in turn, do not really bog down the anime as a whole. They are generally pleasant detours and don't become obnoxious.\\n\\n\r\n  The main characters' interactions are hilarious and the various, variegated jokes that come from them are fantastic. Throughout the anime, they generally stem from their appearances, actions, and mindsets. In particular, the appearances component, specifically doing with hair, surprisingly works well under the enjoyable direction the anime takes. The gags range everywhere from Akari's dual-balls of red hair to Yui's dark, black shoulder-length hair to Chinatsu's frightening and monstrous clumps of light pink hair.\\n\\n\r\n  Other gags are references to past situations that occurred in the first season, but viewers with a hazy memory should not fret. These references are far and few between, and are still funny in and of themselves. Vast and detailed knowledge is not required to enjoy the numerous charming antics that take place in the second season of \"Yuru Yuri\". It still remains accessible and is devoid of any major duds regarding its humor.\\n\\n\r\n  The character designs are obligatorily cutesy and palatable. They are simple yet attractive. In a soft comedy like this, they are not only pleasing but appropriate too. The colors are light like the humor, and the visual brightness is slightly high and not faded. The backgrounds are simplistic like the character designs, but don't border being half-baked. They are sufficient enough to not detract the audience. They might not be spectacular or especially intricate, but that's mostly due to the main focus being on the characters and their quirks. Excessively fancy or detailed backgrounds would be inadequate for the mood the anime creates. \\n\r\n \\n\r\n  The music that joins this anime is fairly sparse and unobtrusive like other certain aspects (i.e. the visuals) in the second season of \"Yuru Yuri\". The tracks are typically quiet and, like the appealing backgrounds, are composed for the purpose of pleasantly accompanying the anime in a gentle fashion. What actually makes the soundtrack \\n\r\nnoteworthy are the playful OP and ED. Minami Tsuda, Rumi Ōkubo, Shiori Mikami and Yuka Ōtsubo are the creators of both the opening theme, \"Yes! YuYuYu☆YuruYuri♪♪\", and the ending theme, \"100% Middle Schooler\". The sixth episode has its own OP and ED, but they aren't as likable as the usual ones played in every other episode of the season.\\n\\n\r\n  Sheer enjoyment is honestly the primary reason as to why I'm writing this review in the first place. The humor tends to be so spot-on and really satisfies my expectations for slice-of-life and moe-involving comedies. This anime is delivered so well mainly due to the focused and very humorous direction of Masahiko Oota (Miname-ke, Mitsudomoe). He is a rising anime director who typically works with comedy and puts out successful works such as this one, \"Yuru Yuri\".\\n\\n\r\n  I fancy all the four main characters and absolutely adore Akari and Kyōko. This second season only provides more reason on why they're so interesting and likable. I admire the fact that there are no grand phony attempts at serious depth and that its purpose is not muddled or fuzzy. It is not ashamed to be just be quirky and entertaining. It rigorously and proudly utilizes its best strong suit of light humor and enjoyable characters.\\n\\n\r\n  Ultimately, any anime like \"Yuru Yuri\" that involves light comedy and moe will keep on being polarized. Many will continue to completely dismiss any anime that contains moe and consider them all to be utterly terrible and unwatchable. It's not true that every single anime that includes moe is good, or that all those that use moe can only be remotely enjoyed whilst at a distance. \"Yuru Yuri\" proves that an anime can have moe and still be a very charming, whimsical, and enjoyable experience. It incorporates some minimalistic aspects and its methods aren't flashy or dazzling. It's not that type of series. It relies on the lean muscle of humor that it smoothly sculpts with its endearing characters, solid jokes and gags, and a delightful, sweet atmosphere that continuously builds as the anime progresses. It's not regretful or embarrassed of what it really is. \\n\r\n  \"Yuru Yuri\" realizes it and shamelessly showcases it to great effect with heart, wit, likability, and light, well-polished, and very potent humor.\\n\\n\r\nNine Rum Raisin Flavored Tubs of Ice Cream out of Ten.",
            "date": "2013-07-11T06:37:00+00:00",
            "helpful_count": 106,
            "mal_id": 104835,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332859.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/albinochocolate",
                "username": "albinochocolate"
            },
            "url": "https://myanimelist.net/reviews.php?id=104835"
        },
        {
            "content": "The continuation of a comedy about 4+ girls going to school. What more could you want? *coughKyoukocough*\r\n[Story]\r\nPlain and simple, there is no story. You can imagine there will be a short arc spanning 2-3 episodes at the most but generally, this is an anime about the daily lives of middle school girls. If you've watched the first season, you know what I'm talking about.\r\n[Art]\r\nSince the very start, the art has been soft on the eyes and continues to be so. This time around, I'd say that the animation has improved greatly. Toshino Kyouko, for example, has generated more irrational body language than ever before! (lol)If you really search, you'll find some impurities in this divine anime but c'mon..\\n\\n\r\n[Sound]\\n\\n\r\nEverything is spot on. You forget this was done in a studio. xD The seiyuu seem a little better this time around but that could be just me. There's nothing notable that brings down the already great quality of the girls' endeavors. The OP and ED are fun to watch as well.\\n\\n\r\n[Character]\\n\\n\r\nPffff!! Toshino Kyouko! It feels like everything revolves around her and when it doesn't, the episode is a little more serious than usual. That aside, each girl has a dominant quality about them to be remembered. Kyouko, spontaneous.. Chiaki, Bad artist... Yui, swag.. Himawari, breasts/poise.. and so on. Unfortunately Akari, the most forgotten, is a character in itself too. Everybody stands out well and has a sense of individuality which you'll like a lot when growing towards a favorite.\\n\\n\r\n[Enjoyment & Overall]\\n\\n\r\nIf you don't laugh in the first episode, you shouldn't watch this show. If you are opposed to Yuri in any way, you will not enjoy this anime. If you are  looking for development of any kind, you will not like this show. I don't always watch anime of the yuri genre, but when I do.. I kick it with Rivarun.\\n\\n\r\nOverall, the show is funny and a great second season to the first. You'll look forward to the rest of the episodes and whatever else that may come after.",
            "date": "2012-07-05T13:02:00+00:00",
            "helpful_count": 49,
            "mal_id": 65407,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104790.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shirt",
                "username": "Shirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=65407"
        },
        {
            "content": "+ This show made me understand the true meaning of moe\r\n+ The art is absolutely adorable\r\n+ Every character is so funny\r\n+ This really made me lauch\r\n+ Despite of cute outlook, the humour is sometimes kind of crrepy, in a good way though ;)\r\n+ Fun inside jokes\r\n- The 2nd season contains lots of jokes from the 1st season, so if you haven't watched that first you may not fully understand the jokes.\r\n- Season 3 hasn't been announced jet.\r\nAnd there isn't actual yuri that much, so if you aren't that into lesbians I can still recommend this. But if you're a homophobic don't spend you time watchingthis and writing hate -comments\\n",
            "date": "2012-10-21T07:53:00+00:00",
            "helpful_count": 36,
            "mal_id": 75505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1023647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CinnamonHime",
                "username": "CinnamonHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=75505"
        },
        {
            "content": "The second season of this show really out shines the first. Yuru Yuri just might be the cutest anime you will ever watch. The art of the show is cute, the characters are cute, the stories are cute, but most important of all the personalities of the characters are cute.  \r\nEach episode is light-hearted, fun feel and pretty self contained. Sometimes references to material from earlier episodes are made, but these are almost always accompanied by flashbacks. Although the stories of each of these episodes might not be extremely interesting, the characters of the show make everything super enjoyable and entertaining. Some of theepisodes are pretty mundane by design, like missing the train to go swimming on a hot summer day; however, the show's charm can even make something like this, as boring as it sounds, make you laugh or gin a little.\\n\\n\r\nThis extension to the original series is definitely worth a watch if you are looking for something to make you laugh and put a smile on your face; however, this show isn't something I would recommend watching in a single sitting. Yuru Yuri is definitely the kind of show you want to watch an episode of here and there eventually leading you to the end.\\n\\n\r\nIf you are interested in Yuru Yuri♪♪ (the second season of Yuru Yuri) I do think watching the first season before you start is a good idea; although, it is by no means required to enjoy the show because of its self-contained style.\\n\\n\r\n\"It's 10/10. I love cute grills\" -BryceHoodie",
            "date": "2014-04-18T00:23:00+00:00",
            "helpful_count": 20,
            "mal_id": 140373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3686855.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BryceHoodie",
                "username": "BryceHoodie"
            },
            "url": "https://myanimelist.net/reviews.php?id=140373"
        },
        {
            "content": "I don't know what else to say, but i love this manga anime because it's so ****ing funny xD\r\ni love the characters, the moe art, music and voice actors xD\r\nthis easily gets 10/10 from me :3",
            "date": "2012-07-04T00:30:00+00:00",
            "helpful_count": 15,
            "mal_id": 65273,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1376895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bokenasu98",
                "username": "Bokenasu98"
            },
            "url": "https://myanimelist.net/reviews.php?id=65273"
        },
        {
            "content": "It's been quite a while since I reviewed the first series of Yuru Yuri, the anime from Doga Kobo inc, based on the manga by Naromi. Overall, I liked the first series and thought the humour did mostly work pretty well. So, does the second series improve, is it a step down or is it roughly the same as the first? \r\nStory: \r\nThe setup remains the same as the first series, a group of zany lesbian schoolgirls go through their everyday lives while being generally quirky and humour happens as a consequence. The humour is much the same as it was in the first series,the comedy is derived largely from the characters, their strangeness and their interaction. The old running gags are still present, albeit downplayed a bit when compared to the first series. Namori seems to be trying to focus more on other jokes under the assumption that most people have probably seen these jokes enough that they won't be that amused by them anymore. I will give this series credit for having some class when it comes to the fantasising scenes, just like the first it refrains from showing anything sexualised during them, preferring a more cutesy tone. There are also some gags based around really strange occurrences as opposed to the more everyday scenarios and they do work fairly well and the justifications for them are effective parts of the jokes. \\n\\n\r\nHonestly, almost every joke that really doesn't work in this one are those based on one particular character. Akari's sister, Akane. In the first series she was mentioned, but never seen and that was probably for the best. Every time she appears it's for the same joke, she has a sister complex and is insanely creepy about it. That is the entire joke for her. Yeah, the joke about Kyouko going into her room and seeing all of her creepy paraphernalia kind of worked in the first series as a miniature horror parody, but this series doesn't get clever with any of these scenes and they're just bad most of the time. Fortunately, most of them are also very brief. You'll get thirty seconds of Akane before it switches to a different scene or at least takes the focus off of her. \\n\\n\r\nOn a more positive note, the humour, aside from the Akane scenes, is a lot more solid than the first series. There are also some really good cute scenes, particularly between Sakurako and Himawari. Those two might very well have the best scenes in the series, actually. \\n\\n\r\nCharacters: \\n\\n\r\nThis is a series that largely works, because of the characters. They have quirks that lead to a lot of comedic possibilities and there are some really strong interactions. Again, the weakness is Akane since her whole schtick is crushing on her little sister. She doesn't even really get good interactions with the other characters since the only two she really interacts with are Akari and Tomoko, Chinatsu's older sister.\\n\\n\r\nArt: \\n\\n\r\nThe art style is the same as the first series. As I said when I talked about the first series, it's not a style I particularly care for. It looks fine for what it is, the bright and vibrant style does, arguably, suit a series like this, but the character designs feel kind of plain and the general lack of detailing can make things look kind of lackluster at times. It doesn't look bad but it's also not artwork that I find particularly engrossing or interesting. \\n\\n\r\nSound: \\n\\n\r\nThe cast remains a strong aspect of the series. The entire main cast, Mikami Shiori, Tsuda Minami, Ootsubo Yuka & Ookubo Rumi all do well in their roles. Oddly enough, even Akane's actress, Horie Yui, does well given that her character has only a sliver of personality and a rather unpleasant one. Of course, Horie Yui is also a really good actress in general so it may be odd but isn't that surprising. The strongest performances probably come from Mimori Suzuko and Katou Emiri since their characters get so many really strong scenes together. The music is improved over the first series. It remains fun and catchy but the singing itself is more capably done this time around. \\n\\n\r\nHo-yay: \\n\\n\r\nThere's quite a bit. Our cast has maintained their various crushes and even added some new ones. It's strongly implied that Sakurako's older sister has a girlfriend and Chinatsu's sister very obviously has a thing for Akane. There's a lot of romantic tension between certain girls as well. We also find out that Akari is fantasising about every girl in the amusement club, the student council and Nishigaki sensei. Well, she is at that age so it's not that unusual but it's gotta make things a bit awkward for her. \\n\\n\r\nFinal Thoughts: \\n\\n\r\nThe second series of Yuru Yuri is an improvement over the first in practically every aspect. The jokes, as a whole, are stronger. The characters mesh a bit better, mostly and the music is better. That being said, it also has a huge issue that the first series didn't, Akane as a reoccurring character. In all fairness, her presence doesn't hurt the series that much since she isn't around that often, but it still holds it back enough that it ends up being barely better. As such, my final rating is an 8/10. Next week I'll look at Choujuu Densetsu Gestalt.",
            "date": "2015-06-10T10:27:00+00:00",
            "helpful_count": 15,
            "mal_id": 190003,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=190003"
        },
        {
            "content": "\"Chocchi macchi chuugakusei, getsuyou ichigen saenai kao shicha dame dame.\"\r\nGood.\r\n\"Are yuru happy? Do yuru happy? aikotoba\"\r\nBetter.\r\nThe second season of Yuru Yuri has once again ignited my feeling for excitement for this whole series. They say that \"More is not always better and excessive is bad.\" Although true, this time, I can say that it isn't.  Everything I expected, have been expecting and will expect are portrayed perfectly in this exciting second season.\r\nFollowing the events of the first season, again, the story, or not-a-true-story-because-it-is-a-slice-of-life centers around the main characters Akari, Yui, Kyouko and Chinatsu, along with the supporting characters Ayano, Chitose, Chizuru, Sakurako, Himawari, Nishigaki-sensei,Matsumoto and others who are again, in an all-girls school with many comedic routines that I really found entertainment at. Truly astounding.\\n\\n\r\nOnce again, even if the story has no central plot, as a slice-of-life, it is still as great as the first season. Lots of scenes that have relaxing, comedic scenes. Lots of scenes which are unforgettable. Lots of things that still make me want more and more and more and more and more every end of each episode. Makes me think again: Am I in the wrong being a fan of girls loving each other romantically? No? Yes? Maybe? And that’s the qualities it has in order for it to make it a truly outstanding one.\\n\\n\r\nAgain, the arts and designs of the characters was drawn so well that I kept screen shooting them. More scenes to watch, more character developments, continuing from the first season, and more of Yuru Yuri! The character designs, in my opinion, hasn’t changed much, and that’s what is good about it. More time to appreciate the designs drawn and much, much more time to be amazed about the development of the story. Am I being too redundant? Or simply annoying? Nevertheless, I write this review for entertainment only.\\n\\n\r\nStop and read the first part of the review again, again. They were the lyrics of the opening and closing themes of the second season. Like the first season, the sounds, OSTs and the music within are also something that cannot be gotten ever so easily. Even if the music of the characters was changed when signaling the start and the end of a commercial, it didn’t even leave behind a speck of discontent or disappointment in me. Meaning? The music were great.\\n\\n\r\nAgain, the characters did not lose their significance as they each have their own personalities, as I said in my review for the first season. There were also characters introduced, like an incestuous, yet loving sister, kids more mature than the characters older than them, and others which also play a significant role in the series. I will also specially mention the student council president, Rise Matsumoto, who has an almost inaudible voice. The way she was portrayed was cute. Not to mention that she’s a test subject for Nishigaki-sensei’s experiments (which always explodes). I like her. Too bad she’s not real. (This is not a spoiler because this part was already explained in the first season.) I also liked Akari because she reminds me of Kuroko Tetsuya from Kuroko no Basuke, for they both have a lack of presence.\\n\\n\r\nI would also like to say something about the Ikeda Twins. Their fantasies are one-spot GREAT. What will happen if their fantasies were true, I wonder? Maybe the reality equilibrium will be destroyed? RIP Earth. I don't want that to happen. I still need to watch Yuru Yuri.\\n\\n\r\nExciting? What kind of question is that? Balderdash. Even if people have many preferences, I prefer anime like this: Slice of life, comedy, and somehow yuri. I am thoroughly excited after each episode. I am happy to have been born on this era. And I just repeated what I wrote in my first review. Why? Because the excitement I felt never changed. It is still exciting. It is still a significant watch in my life. Yes. Too exciting.\\n\\n\r\nOnce again, I have ran out of words synonymous for great in describing a praiseworthy anime like Yuru Yuri. The anime was great overall. Arts? Music? Story? Doesn’t matter. It was truly great. The entertainment I received was over the top and I cannot stop watching it until the end. To be honest, I watched the second season in one go. And I am not lying. For people who likes yuri, then this is perfect for you.\\n\\n\r\nTruly outstanding material.\\n",
            "date": "2017-07-31T02:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 254307,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6297554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexPaulLEWZ",
                "username": "AlexPaulLEWZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=254307"
        },
        {
            "content": "Second season of Yuru Yuri and still looking good. I mean what can you expect from an anime that has humor in every episode. \r\nStory plot and art still around the same as the first season so I'll give both of them a 9 and 8 respectively. Sound also stays somewhat the same so an 8.\r\nNow comes the interesting part. The characters. All of them have a distinct personality which makes all of them likable. However, I'd like to emphasize a few characters.\r\n1. Toshinou Kyoko. The hyper girl in the anime who always does stupid things and makes everyone go crazy but hey as longas she makes things interesting anything goes i guess.\\n\\n\r\n2. Akari. Wait who's she? I didn't realize that she was in the anime at all(just kidding). I must admit as much as I like to make fun of Akari with her lack of presence, I like her because she's that caring friend who always has everyone's back covered. \\n\\n\r\n3. Sakurako and Himawari. I'll combine these 2 as really they're always lumped together with Sakurako making fun of Himawari every time due to her large oppais. I must say Sakurako always cracks me up with her jokes. And then there's Himawari, who's the more mature of the two but always somehow gets back at Sakurako. \\n\\n\r\nOverall this anime has got to be one of the funniest and most enjoyable animes i've ever watched and i'll definitely rewatch this one.\\n\\n\r\nFinal rating: 9/10",
            "date": "2018-02-25T05:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 272429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tringapore_98",
                "username": "Tringapore_98"
            },
            "url": "https://myanimelist.net/reviews.php?id=272429"
        },
        {
            "content": "Honestly, it breaks my heart to give this show a 6. I loved season one, but this one felt a bit disappointing. The jokes felt very...insubstantial. There were a few good \"hahaha, her hair ate it\" moments but other than that it's not very funny.\r\nThe characters are awesome, but I gave \"Character\" a 7 because no new characters were introduced, and no existing characters were developed further. This lead to the writers not having very many jokes that weren't already made in the first season.\r\nMy final gripe about this is that there was an episode that attempted to be serious and emotional. Why on earthwould anybody do that in an anime that is supposed to be almost entirely comedy? I'm not talking about a 5-minute segment, either; there was literally a whole episode that was rarely light-hearted in any sense.\\n\\n\r\nSorry, Yuru Yuri. You're a good series but sometimes you just need a little more.",
            "date": "2013-08-13T19:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 109525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/garrett1502",
                "username": "garrett1502"
            },
            "url": "https://myanimelist.net/reviews.php?id=109525"
        },
        {
            "content": "akariin~ Yuri Yuri is a really great Seinen x Slice of Life, even my buddies who are not really a fan of all girls anime completed season one with a lol. Yuri Yuri is one of the best example of animes that represents Timelessness because it doesn't gets old(watched in 2017) and can be watch in anytime,\r\nThere are only few changes from the Season 1, they've focus to the other characters such as Sakurako, Himawari and Akari's Onee-chan, also, there are some development to the relationship of the characters and to the story as well.\r\nIt's Light Yuri makes the character more interesting like Yui-chanand Ayano-chan. Also, the comedy of this anime is good, their gags are not forced and smooth as always.\\n\\n\r\nAll in all it was a great refreshing season 2 of Yuru Yuri that continued the legacy of season 1, niraka~",
            "date": "2017-09-28T21:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 259058,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6573021.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Moorym",
                "username": "Moorym"
            },
            "url": "https://myanimelist.net/reviews.php?id=259058"
        },
        {
            "content": "Though the series has barely just begun, I really enjoyed the first season of Yuru Yuri. The story was just random, making it comical for the viewers unlike other anime where there are always problems. It shows the daily lives of regular middle school girls with some funny situations. I must say that the art is indeed better than most other anime in my opinion and the sound makes it sound cute. Each character has their own personalities, making everyone different. Akarin, for example, is a bit withdrawn but tries to stand out and does her best, making the best outof her day. Kyoko is very outgoing and energetic. She makes the group's lives an adventure everyday. Meanwhile, Yui would be the mature type of the group to make sure that they stay out of trouble, mostly referring to Kyoko. Chinatsu is like the extra glue that would tie the entire group together, making even more funny situations with her imaginations of her and Yui. Yuru Yuri is really funny and overall, I think it deserves a perfect 10.",
            "date": "2012-07-04T08:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 65297,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/800357.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Athena_Carolyn",
                "username": "Athena_Carolyn"
            },
            "url": "https://myanimelist.net/reviews.php?id=65297"
        },
        {
            "content": "I was very pleased with the first season of Yuru Yuri, and the second season did not disappoint. Every episode I watch gives me a happy feeling and I can't hold back my smiles and giggles~! \r\nI'm a hardcore yuri shipper, more than yaoi, and I'm personally addicted to anything cute and moe. If you're into that kind of lolicon thing, please watch this anime. It's worth a shot. \r\nIt's a slice-of-life anime that gives off a happy nostalgic feeling and the \"romance\" in this anime is very light, fluffy, and completely hilarious. Each character has their very own personality that makes the show sounique. It's different from school girl anime such as K-ON in a very odd way...but a good way. It's kind of hard to describe. \\n\\n\r\nStory (8/10)\\n\r\nI'd give it a 10 if it had a well developed, continuing plot. Though it doesn't, the cute moe stories in each episode are enough to keep you coming back for more. Little story lines such as studying for finals, cooking, christmas, and heading to anime conventions with Toshinuo Kyouko. It's simply fun and silly. \\n\\n\r\nArt (9/10)\\n\r\nThe artwork for this anime fits. It's not complex and completely detailed like the designs for Angel Beats. The simplicity to the artwork keeps you focused on the meaning of the anime, which is basically cute. moe, moe, kawaii. \\n\\n\r\nSound (9/10)\\n\r\nI LOVE any eroge openings and any cutesy akihabara idol music, so if you're into that sort of thing, the OPs and EDs are perfect. They make me feel happy, excited and like I want to jump up and start hugging people. ~~^__^ \\n\r\n100% Chu~Gakusei (100％ちゅ～学生) is my favorite of this season and I was earlier disappointed when I couldn't find a full version to download. I normally don't listen to the song at the end of the episode, but the music in Yuri Yuri♪♪ is an exception. \\n\\n\r\n~chu chu chu la la ♥\\n\\n\r\nCharacter (10/10) \\n\r\n(my review had gotten cut off here, so it will be shorter)\\n\r\nLike I said before, each character is quite different (except for Toshinou Kyouko and Ohmuro Sakurako. Even the other characters pointed out their similarities in episode 9.) \\n\r\nThe 4 main characters are all amusing on their own. \\n\r\nAkaza Akari is the mild, laid-back one and is even joked about not having any presence. Do not get this confused with episode 1 where she is having a dream that everyone loves her.\\n\r\nFunami Yui is very quiet, tomboyish, and mature, making her the perfect love interest for China-chan :3\\n\r\nToshinou Kyouko is very irresponsible, outgoing, and not the brightest. She is madly obsessed with Chinatsu-chan and even made her the model for the main character in her manga. \\n\r\nYoshikawa Chinatsu is bubbly and naive and fails in art. She loves Yui-senpai, is good friends with Akari, and is constantly irritated by Kyouko. \\n\\n\r\nEnjoyment (10/10) \\n\r\nI also said before that I was very impressed by this anime. I've enjoyed the episodes I've watched and I will enjoy the rest! :3\\n\\n\r\nOverall (10/10) \\n\r\nLOVED IT. It's not an old-school classic like Sailor Moon but it is definitely a masterpiece to me. Even my friend who doesn't watch anime said she thought it was cute any funny! ♥\\n",
            "date": "2013-01-02T15:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 82432,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1160967.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pastelstrawberry",
                "username": "pastelstrawberry"
            },
            "url": "https://myanimelist.net/reviews.php?id=82432"
        },
        {
            "content": "This anime is great when you want to relax, and just have a good laugh with no main storyline.\r\nSeason 2 is way better than season 1 in so many ways. I will miss this anime, when i come home from school on mondays :/\r\nYuru Yuri S2 follows where S1 left. You follow Akari, Yui, Kyouko and Chinatsu once again in the Amuement club. You get even more nosebleed from Chitose, and more romance between Kyouko and Ayano.\r\nOne of the things i liked most about S2, is you get to see Akari's sister, Akane Akaza a lot more. And she's one hell of a stalker.\r\nIf youwant an anime where you sit back and close your mind, this is the anime for you.",
            "date": "2012-09-19T13:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 72725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1384623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jeller",
                "username": "Jeller"
            },
            "url": "https://myanimelist.net/reviews.php?id=72725"
        },
        {
            "content": "Yuru Yuri ♪♪ is an amazing anime which all anime studios need to take notes from. It's about the normal lives of schoolgirls trying to enjoy themselves in their tea-club. Each character has her own personality and her own unique traits, which helps enhances the series as it goes on. Yuru Yuri generally does not have a story, it only shows us episodes of lesbian (yuri) girls who are not fully aware of their sexual affiliation, which is the core of the comedy aspect in this, almost, rom-com.\r\nCharacters:\r\nThe clumsy, ignored, and plain Akari. She's the absolutely normal girl every shoujo has, albeit a little clumsyand awkward. Her lack of presence is the cause of her distress.\\n\r\nThe selfish, easygoing, and perverted Kyoko. She's a famous mangaka, and her class' highest scorer even though she's a slouch. Her gluttony and laziness are her most shinning traits.\\n\r\nThe lustful yet calm, and cute Chinatsu. She's the best at making tea and the worst at drawing.\\n\r\nThe nice, mature, and independent Yui. She lives in an apartment by herself, and is often found at the center of the four main characters mentioned above.\\n\r\nThen, there are the secondary characters: The vexed but shy Ayano. The wet-dreaming, nose-bleeding Chitose. The jealous, and dumb Sakurako. The big-breasted and lady-like Himawari. The mute student council president, Rise. And Nana, the science teacher whose inventions are all explosive.\\n\\n\r\nRelationships:\\n\\n\r\nThe relationships are linear and obvious: Akari is ignored by everyone. Kyoko loves Chinatsu, and often crashes at Yui's apartment. Chinatsu adores and looks up to Yui, and is constantly avoiding Kyoko. Yui is the one keeping Kyoko away from Chinatsu, and having them all at her apartment every now and then. Ayano secretly loves Kyoko but pretends she doesn't tolerate her. Chitose is Ayano's best friend, and the one encouraging and advising Ayano. She day-dreams a lot about intimate scenes between Kyoko and Ayano whenever she removes her glasses, and that causes her nose to bleed. Sakurako is extremely jealous of Himawari's big breasts. She always fights with her throughout the two seasons, but appears to be heavily dependent on her.\\n\\n\r\nAnalysis:\\n\\n\r\nThe music is slightly above-par, and is catchy and enjoyable. The animation and design are amazing. And the final episode would account for all the rest, meaning: You can watch the last episode without losing much content. It was really good.\\n\\n\r\nThe anime is truly fantastic because of what it teaches us about the art of making anime. It serves to be as the perfect model of what NOT to do in an anime. Here is a huge list:\\n\\n\r\n*The characters are heavily contrasted, and that does not reflect any social reality.\\n\r\n*The relationships feel like they were planned or written by a robot: They're linear.\\n\r\n*Each character has a list of habits and traits that aren't shared with anyone, and that is neither the case in Japan, nor in anywhere else. It doesn't feel real at all.\\n\r\n*Each joke is thoroughly and excessively explained in a way that would make it pointless.\\n\r\n*Everything can be expected from the start of each event, so there's not much to anticipate.\\n\r\n*Each character tries hard to be a full representation of her characteristics.\\n\r\n*Everything is commented on. There seems to be no understanding between any character without speech.\\n\r\n*No imagination or thinking is left to the watcher. Every reference or notion has to be pointed at.\\n\r\n*Responses are forced and unnatural. So are the reactions. No flexibility.\\n\r\n*Repetition. All events are similar, and all reactions and responses feel like they're repeated.\\n\r\n*Full exploitation of the relationships between these characters, and all characters' characteristics.\\n\r\n*No character development whatsoever. The episodic nature of the anime makes it closer to a cartoon than an anime.\\n\r\n*No story elements or moral. The series' main and only goal is entertainment.\\n\r\n*Typical characters, typical scenarios, and predictable events.\\n\r\n*The children are unrealistic, and overtly frank in an awkward way, which makes one wonder if the developers ever saw children in their lives.\\n\\n\r\nAnd with these notes, which are so easy to notice, most anime studios can start making good anime devoid of all these cliches. The only thing this piece-of-garbage anime is ever good for is showing us how horrible an anime could be, with looking and sounding as beautiful as the budget allows.\\n\\n\r\nWe all know that anime does not have to be realistic, but characters do, and so should relationships, reactions, and traits. It's alright to exaggerate or bend reality a little, but doing so without limits makes the anime unwatchable. The story, the setting, or the events can be unrealistic, and that's alright, but the characters should be relatable so that the watcher can relate himself to the anime, and have a worthy experience. This is a key in arts, and so should it be in anime, even if anime is more about entertainment.\\n\\n\r\nOverall:\\n\\n\r\nThere is not much to be gained from watching Yuru Yuri. Both seasons are mediocre at most and extremely boring. The experience is dull; we don't get any idea about the Japanese culture, nor are we entertained, which is ironic, because that seems to be the main objective of the anime. No new types of characters, no new or even inspired events, and most certainly, no originality.\\n\\n\r\nIf there was anything worth anyone’s time in the whole series (24 episodes), it is the last episode, which was, by a whole deal, better than the rest.",
            "date": "2014-12-28T13:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 174863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1689115.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/3dnanoo94",
                "username": "3dnanoo94"
            },
            "url": "https://myanimelist.net/reviews.php?id=174863"
        },
        {
            "content": "To be honest, I struggle with the idea of reviewing second seasons, especially for slice of life. I'm gonna try to keep this brief.\r\nStory: 9\r\nThe story hasn't changed. Four girls who take over the abandoned Tea Club for their own amusement. They're still in middle school- more importantly, they're still in the same year of middle school. This isn't addressed until late in the series. While this anime is literally just more of the first season, around the end of the series things start to get strange. The second-year students still seem to be second years, there are some odd moments of deja vu, andfor some reason they bring back a wooden sword.. even though they already brought back a wooden sword? This show pulls something similar to Non Non Biyori Repeat, in the way that it just shows different moments from the same time period, yet it's different because it's not a rewind, but somewhat of a time loop. Even the characters notice something is odd!\\n\r\nWhat really makes this season so much better is a particular episode that really tossed my feelings around. It was good because it was parallel with some of the small details of the first season, and it happened in a way that really could be seen as possible. Then there's a bunch of emotions and long-awaited, much-deserved attention for a certain girl, then there's the \"Psyche!\" that just blocks everything out. I've been emotionally abused, but it was still hilarious.\\n\r\nThis show has several moments that really kept me guessing until the punchline hit, and I found everything to be positively cute, stunning, and simply amusing.\\n\\n\r\nArt: 9\\n\r\nI can't really tell with the art. I didn't notice any differences between the first and second season, and that's not necessarily a bad thing. There don't need to be drastic changes, or even changes at all. This goes for Yuru Yuri especially since the setting or time didn't really move either.\\n\r\nEverything is still well-drawn and everyone is cute as ever.\\n\\n\r\nSound: 9\\n\r\nNew music, great voices, and sound effects that fit with the action and add to the moments. Not much else to say, I'm not a sound critic.\\n\\n\r\nCharacter: 10\\n\r\nThe characters didn't change either. Same people, except we're introduced to a couple new characters: the older sisters. They aren't completely explained all in one go, but there have been enough cameo appearances beforehand to at least understand a bit about them. The older sisters simply add to the comedy, outlining the personality traits of the main characters pretty well.\\n\\n\r\nEnjoyment: 10\\n\r\nI still like this show. The second season doesn't stand out as new or exciting, but it's still lovable and funny and cute like the first.\\n\\n\r\nOverall: 9\\n\r\nDefinitely not a masterpiece, but as a successor to its first season, Yuru Yuri ♪♪ does not disappoint. If you enjoyed the manga or the first season, you have absolutely no reason for not wanting to watch this one.",
            "date": "2016-01-03T21:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 207693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3606903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Symantra",
                "username": "Symantra"
            },
            "url": "https://myanimelist.net/reviews.php?id=207693"
        },
        {
            "content": "More \"cute lesbian girls doing cute things\" kind of show. How great.....and I'm not being sarcastic. \r\n[Story]: (7/10)\r\nThis is the 2nd season of Yuru Yuri.\r\nIf you're watching or have watched the 2nd season then that means you enjoyed the first season of Yuru Yuri or you're just here to see if it gets better. The 2nd season is nothing new. It's the same old \"cute girls doing cute things\" element and there are still no lesbian relationship which shouldn't be a surprise at this point. \r\nThe comedy seems to be a bit better though because I laughed way more in this season than the firstseason. There are a few new jokes brought on the table like the magical girl \"Mirakurun\" but for the most part, it's the same old jokes but somehow better. For me, at least. \\n\\n\r\nGoddammit, Yuru Yuri..I want my tears back after watching that 1 episode where Akarin \"accidentally\" traveled back in time. This is now the 2nd slice-of-life anime that made me tear up but this is the first time I've been tricked into tearing my eyes up. Ahh, this was one of the best episode I've seen in Yuru Yuri.  \\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (7.5/10)\\n\r\nThe 2nd Season is handled by the same studio so there weren't really any changed in the animation or the character design. Everything looks the same. The Akarin intros are also back and they're actually better than the intros in the first season. Even though the intros are better, they're kind of the same intro when compared to the first season. For example, the 6th episode intro of 1st and 2nd season are the same except there are a few changes to the scenes. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8.5/10)\\n\r\nThe soundtrack is the same as the first season so the soundtrack is not worth mentioning in this review. Now the OP and ED theme song(s).\\n\\n\r\nThe OP theme songs are \"Yes! Yuyuyu?Yuru Yuri??\" by Nanamori Chu?Goraku Bu and \"Yonde Mirakurun!\" by Majokko Mirakurun. The ED theme songs are \"100% Chu~Gakusei\" by Nanamori Chu?Goraku Bu and \"Girls Power de\" by Yui Funami and Chinatsu Yoshikawa. Compared to the first season's OP, this season's OP is a lot better and their songs are much catchier. The 2nd OP for this season is....meh. It didn't catch my attention. This season's ED theme song is also a lot better than the first season. While the 2nd ED theme song is nothing great, the lyrics did pique my interest. The lyrics sounds like it can be used by feminists..\\n\r\n______________________________________________________________\\n\r\n[Characters]: (8/10)\\n\r\nMost of the characters who appeared in the first season are here and their personalities are still the same. \\n\\n\r\nAkari Akaza, who is supposedly the protagonist of the show is still being treated like she's a side character..as a joke, of course. Although, she did get one episode dedicated to her and it was a damn good episode. Yui Finama is still the same ol' mature girl and after 24 episodes, she somehow managed to handle Toshino's craziness. Chinatsu still drools all over Yui and Toshino is still \"in love\" with Chinatsu. She's as energetic as ever and is still the \"protagonist\" and the driving force of the show. She also seems to be more funnier in this season. Most likely because she's more crazier and more energetic  \\n\\n\r\nSome new supporting characters were introduced in the 2nd season like Sakurako's sisters, Chinatsu's sister, and Akari's sister who is in love with her own sister. \\n\r\n______________________________________________________________\\n\r\n[Enjoyment]: (9/10)\\n\r\nFor the most, I enjoyed this season way more than the first season. The jokes are funnier even though most of them were the same and a bunch of new likable supporting characters. \\n\r\n______________________________________________________________\\n\r\n[VERDICT] \\n\r\n'Yuru Yuri (S2)\" is a great sequel to the Yuru Yuri series. Even though the comedy is mostly recycled, it still made me laugh more than the first season. If you liked the 1st season then this sequel is a must-watch. \\n\\n\r\n[OVERALL]: (9/10)\\n\\n\\n\r\nPros: \\n\r\n+Same ol' \"cute girls doing cute things\" element\\n\r\n+Jokes are more funnier than the previous season\\n\r\n+New sets of likable side characters\\n\\n\r\nCons:\\n\r\n-Plain Animation",
            "date": "2016-01-27T15:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 209485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=209485"
        },
        {
            "content": "I'm just going to guess you have seen the first season of Yuru Yuri. This season... is just as good maybe better!\r\nStory 9/10: It's the same old same old, the same cute girls who all have crushes on each other doing the same cute things. No suprise, it still works and it's still hilarious!\r\nArt 9/10: Art is still the same cute moe style, and it's still cute as hell!\r\nSound 9/10: While in this OP is still delightful it's not as good as season one's IMO. Still it's wonderful!\r\nCharacter 10/10: Just when you thought these girls couldn't get anymore lovable, they get even more lovable! Thejokes revolving around them are still hilarious, there relationships with each other are still hilarious and/or cute. \\n\\n\r\nEnjoyment 10/10: If you enjoyed season one immensely (like me), then season two will offer the same fun and the same endless laughs!\\n\\n\r\nOverall 9/10: Yuru Yuri is still the same cute yurilicious comedy is always was and always will be. Fans of humor and shoujo ai will love this season as much as the last!\\n\\n\r\n(Also I found out Yui and Chinatsu's VAs are girlfriends, so YuiXChinatsu canon?)",
            "date": "2015-10-29T11:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 202208,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4945214.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkLordofYuri",
                "username": "DarkLordofYuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=202208"
        },
        {
            "content": "Well the story is not of the essence of other anime, that is probably NOT the reason why you chose to watch YuruYuri. Oh, this review may contain light spoilers. Read with caution.\r\nIn my prior review regarding the first season, I mostly mentioned that this anime aimed to be a comedy. But, in this season...\r\nIt is still a comedy. Albeit, MUCH better. Character development was of the essence in this season as we further realize that Akane actually deeply cares about Akari, and is only obsessed in that she loves having a little sister; nothing sexual at all that was implied right off the firstepisode that had that hilarious scene with Kyōko.\\n\\n\r\n(SPOILER BEGIN)\\n\\n\r\nShe even willingly believes and helps her in a (later found out to be fictional) time traveling situation (though I believed it because it fit into the atmosphere of the anime for some reason) without hesitation.\\n\\n\r\n(SPOILER END)\\n\\n\r\nShe also cares about her very deeply in a sisterly way that is actually very heartwarming. She is just, well, obsessive about the whole thing. Yeah, she actually did deserve three light paragraphs of her own; could not just sum it up in a short, single one.\\n\\n\r\nThe rest of the new characters are also very cute and have fitting personalities. And, the first scene with Kaede in it was so sad about her thesis on the oppression of teenagers! Even though it is a comedy, they manage to dish out sadness in the best way with that beautiful piano combined with the atmosphere of the scene. Very surprising for what genre it is in.\\n\\n\r\nBut, my favorite development is in the main characters themselves, specifically finding out that Sakurako and Himawari were actually best friends that just drifted apart and became rivals; yet, still help each other out (well, one-sided on Himawari's end; more or less) at times. Also, it carried over the running gag of the last episode featuring legit Yuri in it. If you have seen the first season already, you probably saw it coming. But, definitely not on the same scale as the last one.\\n\\n\r\nWhat you get in this season is more comedy, but delivered with a side of sadness as the character development reels in and is extremely fitting without at all straying too far away from the goal of the anime.\\n\\n\r\nSpeaking of sadness, I still think that scene with Akari thinking she killed a snake was the most heart-touching moment as she had a real look of anguish as she believed that she killed that snake; even though it was not real. And it even led to the scene turning from comedy to sadness in just a few seconds.\\n\\n\r\nBut, I feel like I am spoiling more than being helpful, so I will leave you off with a note that will convince you to watch this next season.\\n\\n\r\nAt the rate that this anime is going, seeing as how it just got two more seasons THIS YEAR, I can see it becoming very popular; possibly mainstream, as rarely does an anime just get renewed out of the blue.\\n\\n\r\nA manga usually has one or, rarely, two anime adaptions of it. So, for this one to have four is quite astonishing and that alone should convince you to watch this next season if you already watched the first, as it features most of what I mentioned before in my prior review regarding that season. The same characters, music, comedy; complete with only having changed the interludes, but nothing much besides that. Oh, and the opening and closing credits, obviously. \\n\\n\r\nFunny thing is, it barely changed a thing over its season transition. But, I imagine the third onward probably will have noticeable changes, as they probably did not anticipate another season. But, I imagine those seasons will be just as good as these last two were.\\n\\n\r\nAnd, I highly recommend both of them to anyone that is a fan of cute comedies, but again, not to those that do not know what \"ゆる\" means. As also stated before, this anime is not what you think it is at first glance and instead offers a rich comedy with beautiful visuals and music, but not erotica material.",
            "date": "2015-08-26T01:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 197082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=197082"
        },
        {
            "content": "Ever since K-on's inception, the creation of Moe genred anime has exponentially increased, to the point that practically in every season of anime, we get at least 1 moe themed show.  Yuru Yuri's season two, is absolutely no exception to the rule.\r\nStory (6.05/10):  If you're not familiar with the show, basically, Yuru Yuri ♪♪ is about the lives of four middle school girls named Kyouko, Yui, Chinatsu, and Akari as they go through school and enjoy life as the amusement club created by our very own star of the show, Toshino Kyouko.  (No one should tell you otherwise that the main characterrole is her and her alone.)  \\n\\n\r\nNow, does this plot sound very familiar?  Practically every moe show involving 4 or so girls as the main characters have this sort of idea.  To put it bluntly, there's nothing really different about this show from an idea's standpoint.  It's a club, four girls, and daily and random activities.  That's not to discourage the show in any way, since the idea to this day is still alive and kicking in terms of how popular it is, but you can literally name at least ten or more shows that have this sort of central idea.\\n\\n\r\nOverview\\n\\n\r\n+/- Overused idea \\n\\n\r\nCharacters (8.42/10):  What moe shows lack in terms of a core and central idea, they make up in really memorable characters.  That's to say, if this show didn't the fantastic and memorable  characters that it had, then it would've failed as a show overall.\\n\\n\r\nThere's not really much to say in terms of the cast, as if you've watched the first season, you'll pretty much be watching the exact same girls doing what they did the the first season.  Which, by itself, isn't bad, as I've mentioned before, the characters are very, very, memorable.  \\n\\n\r\nWhat makes this season different than its last one, is the addition and additional screentime of certain characters.  Some characters that were mentioned but not shown in the first season get some much wanted screentime (albeit not as much as I wanted), and some characters that were dubbed to the supporting cast that show up every now and then, get bumped up to the point that they have whole sections of the show that is about them.  Personally, I find this change to be a nice one, as the somewhat expansive cast gets a bit more depth and exploration into their characters.  \\n\\n\r\nWhat also makes this show's characters memorable, are their gags.  On many occasions, gags that were introduced in the first show, as well as new ones in this season, are reintroduced and done tastefully in the sense that they aren't heavily overused, and the situations that they are used in make sense in context to the story.  \\n\\n\r\nWhile the show did try and make changes to its cast by making some more prominent than they were before, there were a few drawbacks.  For one thing, characters explored or shown a bit more in the first season were put into the supporting positions while some other character whom were part of the supporting role became more prominent.  In short, the creators sort of switched some of the characters' importance to the story, which to me, felt a little disappointing since all of these characters are enjoyable in some way shape or form.  \\n\\n\r\nOverview:\\n\\n\r\n+ EXTREMELY memorable cast\\n\r\n+ Explored characters\\n\r\n-  Memorable supporting characters that needed more screentime\\n\r\n-  Loss of screentime for some characters\\n\\n\r\nArt and Sound (7.21/10 and 6.48/10):  The art of this show is really what you would expect from a moe show.  Big round eyes that exemplify the girls' cuteness, comical facial changes, and a really simple looking look to the show overall to show how laid back it is.  \\n\\n\r\nThe style of the show didn't change drastically from the first season, and that's fine, as it retained the show's charm.  The art itself wasn't bad in the sense that it was jarring to watch, (although Chinatsu's drawings did spring quite a few nightmares), but it wasn't exceptionally breathtaking or wonderfully painted as some shows in recent years have been.  There weren't really any standout moments that really peaked the show's artstyle.\\n\\n\r\nIn terms of sound, it's more or less just general moe themed songs.  Cute girls singing generic sounding songs.  They weren't bad per say, but they weren't memorable or to me, even worth listening to.  \\n\\n\r\nOverview\\n\\n\r\n+/-  Moe artstyle.  (Depending on your tastes)\\n\r\n-  Generic sounding tracks\\n\\n\r\nPersonal enjoyment (7.35/10):  Now comes the question.  What makes this show unique in comparison to the vast majority of moe shows out there?  Aside from the all female cast and this being a yuri show, nothing really stood out.  At least, what I can think of.  The show has a charm to it.  Somehow, Yuru Yuri ♪♪ has this thing to it that just makes it an interesting show.  \\n\\n\r\nPersonally though, I found it odd that I would even watch this sort of show, and even more so that I would like it.  The actual show structure resembles so much to the ever popular Lucky Star, but it has something different about it that just makes it unique.  Perhaps it's the fact that they completely ignore the main character throughout the entirety of the show, or maybe it's because the ships are just so shippable (is that even a real word?), I personally don't know.  \\n\\n\r\nAll I can say is, I watched it, I liked it, and if you're a fan of moe shows, you may like this.  While personally, I didn't like this show as much as I have liked other shows in the past, Yuru Yuri is definitely a series that is worthy enough to be a decent timekiller.  \\n\\n\r\nOverall Score: (7.50/10)",
            "date": "2014-06-18T13:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 147445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=147445"
        }
    ],
    [
        {
            "content": "- Updated after completing the anime.\r\nYuru Yuri is a light-hearted and pleasant to watch slice-of-life filled with moe and comedy. Like the anime's very name makes it obvious, this anime also \"kinda\" foccuses on the relationships between the characters, which are all girls (and thus, \"yuri\"). It isn't anything as serious as you would see in other romance-orientated shoujo-ai anime like Strawberry Panic, but it isn't used for ecchi fanservice either, like you could see in Queen's Blade or many anime similar to it. \r\nThe \"yuriness\" in Yuru Yuri is meant for moe, cuteness, and comedy purposes, and I've got to say, it works verywell. This said, I reckon that even people who would feel disgusted by seeing such relationships (GirlxGirl) should be, in theory, able to watch Yuru Yuri.\\n\\n\r\nIt's 2nd season, Yuru Yuri ♪♪, does an extraordinary job keeping up with the 'main four', allowing us to have our share of Toshinou Kyouko, but while focusing quite much more on it's other characters too, which didn't have so many moments in the spotlight as they're having now (especially Sakurako and Himawari).\\n\\n\r\nBut something I'm fairly sure about, is that if you are not into moe or comedy, you'll absolutely hate Yuru Yuri. Why? Simple, it's just because this is exactly what this anime excels at, and you shouldn't be expecting much else while watching it.\\n\\n\r\nStory\\n\r\n8/10\\n\r\nThe story is very simple, but works really well for this anime. It's what you could expect from a simple moe slice-of-life: The everyday school life of the protagonists. The little twist in this one (emphasis on \"little\") is that they've created an \"unregistered\" club in the abandoned tea club room, the \"Amusement Club\", where they, well, do fun things, because fun things are fun. This deserves an 8 in my opinion because it's to be expected, and like in many other animes, this simple story works very well.\\n\\n\r\nArt\\n\r\n8/10\\n\r\nEven if it's not stunningly eye-candy like Fate/Zero, Kara no Kyoukai or Guilty Crown, neither unique and twisted like Bakemonogatari or Madoka Magica, the art reflects the nature and objective of the anime: Cuteness. It is simple and cute, and fits just perfectly. Anything more complicated would have ruined it, in my opinion.\\n\\n\r\nSound\\n\r\n8/10\\n\r\nI was already an fan of the first opening and endings, but they managed to improve it even further. Both songs are fun, energetic and kinda catchy, so I guess this also fits very well. I'm kinda exigent when it comes to the openings and endings, especially when they show us them before the anime actually begins even in the first episode, for it gives us an \"first impression\". The opening became easily one of my favorites, and the background music and sound effects for the rest of the anime are just refined and well made. Even if I tried to, I'm unable to find anything to complain about in them.\\n\\n\r\nCharacter\\n\r\n9/10\\n\r\nEveryone already knows the standard character typos: The Tsundere, the Bookworm, the Genki Girl, and so-so... But good luck trying to fit every Yuru Yuri character into a \"preset personality\". The anime presents us with funny and likeable characters, with very unique personalities that I hadn't seen anywhere else before. A few examples are the \"main character\" with no presence that is pretty much invisible, the Student Council President that whispers so softly she looks mute and only the mad scientist, explosion-addict chemistry teacher is able to translate what she says, and also, the two meganekkos that nosebleed/drool when they remove their glasses and fantasize about yuri. They're very innovative, and most importantly: Loveable. Perhaps I'm the wrong person to talk about this, but I just adore every single character in this anime.\\n\\n\r\nEnjoyment\\n\r\n10/10\\n\r\nThis. Enjoyment is what I weight more heavily when giving out my score. If I really enjoy an anime, it doesn't matter how crappy the art or sound may be (unless they're SO bad that they actually ruin the enjoyment), it may be able to score just fine. And Yuru Yuri is no exception: I'm just unable not to love it. I feel very well, in peace, while watching it, and every second spent watching is a second well-spent. This is the kind of anime I'll never feel bored watching or wishing for the episode to be over quickly (if you're watching something while thinking \"Damn, isn't this over yet? I need to do something else.\", then you're not enjoying it.), and I always actually want to watch more once it's over. And thus, a 10 in enjoyment.\\n\\n\r\nOverall\\n\r\n10/10\\n\r\nEven if the Story may be a bit \"common\", and the art, simple, all the rest this anime has to offer counterbalances it's little imperfections. I couldn't wish for Yuru Yuri to give me anything else, except longer seasons, perhaps, for these short, 12-episode-long ones always leave me wanting for more. I already loved the first season, it's true, but they managed to somehow even improve every single aspect they could in the 2nd, and I found myself unable to rate it anything but a masterpiece.",
            "date": "2012-07-16T13:32:00+00:00",
            "helpful_count": 133,
            "mal_id": 66745,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1000021.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Morbyllan",
                "username": "Morbyllan"
            },
            "url": "https://myanimelist.net/reviews.php?id=66745"
        },
        {
            "content": "Okay, let's begin by addressing the tremendously obese elephant in the room. I gave an anime involving moe a nine. \r\n  But before many of you collect pitchforks, torches, tough rope, and a sturdy tree and begin to hurt, riot, and chase my sorry Gluteus Maximus, allow me justify the rating. The second season of \"Yuru Yuri\" is actually an accessible, light-hearted, and very funny triumph. One of the many great things about the second season of \"Yuru Yuri\" is that you don't need to: live in a dingy and cramped basement, own multiple moe figures, have several colorful posters plastered across your wall, possess gigantic male breasts, andhave hair cover 95% of your body. In other words, you don't need to be a typical, easily-impressed moe fanboy to enjoy the series. The anime actually provides authentic laughter along with a gratifying array of cutesy, endearing, and wonderfully quirky characters. \\n\\n\r\n  It makes genuine attempts at being humorous and is thoroughly successful with them. The gags haven't gone stale since the first season because they are all generally reworked in pleasant ways. The second season is solid enough to stand on it's own feet. In fact, it's actually even stronger than the first. The playful sense of humor is even more apparent but without being overbearing or intolerable. The clever jokes are even more consistent, and it accomplishes its fairly simplistic goal of being both being very funny and adorable.\\n\\n\r\n  The premise is familiar and the situations are seemingly mundane. When one approaches this anime without any knowledge, it does certainly seem that this is just another throw-away series made by a random anime studio in a yet another substandard, thoughtless, and desperate attempt at making a successful anime sales and revenue wise. These attempts are typically composed around heavy amounts of pandering, poor humor, weak characters, and complete lack in any real effort or care. It is very easy to cast off this anime as just another one of those, but doing this would result in missing out on one of the anime industry's hugest and most surprisingly satisfying efforts to premiere in 2012.\\n\\n\r\n  It's four girls, one club, and a never-ending stream of endeavors at amusing themselves performed by the four main character girls. The club's title, The Amusement Club, obviously reflects the real purpose. The main character, Akari, is supposedly the heroine, but is usually ignored and barely has any screen time. The series uses her being ignored as the subject of many of its jokes. It also uses female-only romantic affections (\"yuri\" is in the title after all) as a very capable source that ensues in much hilarity. Many of the characters have crushes on each other and one club member in particular, Chinatsu, is very direct about her attraction towards another club member Yui. The final club member, Kyōko, is very vocal with her attraction and borderline obsession towards Chinatsu. Most of the attractions are unrequited, but their misfortune only causes more hearty laughs. Although the second season of \"Yuru Yuri\" is still an actual yuri anime, it continues to parody and lampoon certain tropes of other prominent yuri series. At times, Kyōko and Chinatsu's love illusions towards their chosen ones are amplified to such high degree, which ends up resulting in a pleasing parody of standard yuri.\\n\\n\r\n  Akari Akaze is the main character that everything is supposed to revolve around. However, situations tend to never go in her favor. She is a very cheery and bubbly girl who wants to be everybody's friend. The problem she faces is that her personality isn't particularly memorable or special compared to her three closest companions and fellow club members. They frequently ignore her, and don't even notice her even though she's practically always with them when they get together as a club. Multiple gags are based on this including the ever popular \"AKARIN!\" invisibility joke that she sometimes does. She is an enjoyably pathetic character that deserves either heaps of resonating empathy or great pity. It's interesting to see such an unflattering depiction of the character in an anime. Whether it be comedy or not, this is rare and very refreshing when done well. And \"Yuru Yuri\" provides an excellent execution.\\n\\n\r\n  Kyōko Toshinō is arguably the most lovable character because of her hyper personality and amusing shenanigans. She's always pulling something and it seems to always annoy Yui or Chinatsu. She typically bothers Yui with her bold actions, and irritates Chinatsu with her constant pestering due to her giant attraction towards her.\\n\\n\r\n  Yui Funami and Chinatsu Yoshikawa are vital characters as well. They are also the basis and the cause of many successful gags. Yui plays the usual, calm, and somewhat quiet girl who acts with a reasonable mindset. Chinatsu is average on a superficial level, but deep inside her burns a violent passion for Yui. She admires and is severely attracted to her. Chinatsu's love delusions involving Yui, like Akarin's popularity expectations, are priceless and honestly create some wild laughter.\\n\\n\r\n  Other less important characters are shown serve basically as gags that don't give much purpose or gather as much as interest as the main cast. However, all of them are generally funny, albeit in a lesser degree. Thankfully, they are given less attention and in turn, do not really bog down the anime as a whole. They are generally pleasant detours and don't become obnoxious.\\n\\n\r\n  The main characters' interactions are hilarious and the various, variegated jokes that come from them are fantastic. Throughout the anime, they generally stem from their appearances, actions, and mindsets. In particular, the appearances component, specifically doing with hair, surprisingly works well under the enjoyable direction the anime takes. The gags range everywhere from Akari's dual-balls of red hair to Yui's dark, black shoulder-length hair to Chinatsu's frightening and monstrous clumps of light pink hair.\\n\\n\r\n  Other gags are references to past situations that occurred in the first season, but viewers with a hazy memory should not fret. These references are far and few between, and are still funny in and of themselves. Vast and detailed knowledge is not required to enjoy the numerous charming antics that take place in the second season of \"Yuru Yuri\". It still remains accessible and is devoid of any major duds regarding its humor.\\n\\n\r\n  The character designs are obligatorily cutesy and palatable. They are simple yet attractive. In a soft comedy like this, they are not only pleasing but appropriate too. The colors are light like the humor, and the visual brightness is slightly high and not faded. The backgrounds are simplistic like the character designs, but don't border being half-baked. They are sufficient enough to not detract the audience. They might not be spectacular or especially intricate, but that's mostly due to the main focus being on the characters and their quirks. Excessively fancy or detailed backgrounds would be inadequate for the mood the anime creates. \\n\r\n \\n\r\n  The music that joins this anime is fairly sparse and unobtrusive like other certain aspects (i.e. the visuals) in the second season of \"Yuru Yuri\". The tracks are typically quiet and, like the appealing backgrounds, are composed for the purpose of pleasantly accompanying the anime in a gentle fashion. What actually makes the soundtrack \\n\r\nnoteworthy are the playful OP and ED. Minami Tsuda, Rumi Ōkubo, Shiori Mikami and Yuka Ōtsubo are the creators of both the opening theme, \"Yes! YuYuYu☆YuruYuri♪♪\", and the ending theme, \"100% Middle Schooler\". The sixth episode has its own OP and ED, but they aren't as likable as the usual ones played in every other episode of the season.\\n\\n\r\n  Sheer enjoyment is honestly the primary reason as to why I'm writing this review in the first place. The humor tends to be so spot-on and really satisfies my expectations for slice-of-life and moe-involving comedies. This anime is delivered so well mainly due to the focused and very humorous direction of Masahiko Oota (Miname-ke, Mitsudomoe). He is a rising anime director who typically works with comedy and puts out successful works such as this one, \"Yuru Yuri\".\\n\\n\r\n  I fancy all the four main characters and absolutely adore Akari and Kyōko. This second season only provides more reason on why they're so interesting and likable. I admire the fact that there are no grand phony attempts at serious depth and that its purpose is not muddled or fuzzy. It is not ashamed to be just be quirky and entertaining. It rigorously and proudly utilizes its best strong suit of light humor and enjoyable characters.\\n\\n\r\n  Ultimately, any anime like \"Yuru Yuri\" that involves light comedy and moe will keep on being polarized. Many will continue to completely dismiss any anime that contains moe and consider them all to be utterly terrible and unwatchable. It's not true that every single anime that includes moe is good, or that all those that use moe can only be remotely enjoyed whilst at a distance. \"Yuru Yuri\" proves that an anime can have moe and still be a very charming, whimsical, and enjoyable experience. It incorporates some minimalistic aspects and its methods aren't flashy or dazzling. It's not that type of series. It relies on the lean muscle of humor that it smoothly sculpts with its endearing characters, solid jokes and gags, and a delightful, sweet atmosphere that continuously builds as the anime progresses. It's not regretful or embarrassed of what it really is. \\n\r\n  \"Yuru Yuri\" realizes it and shamelessly showcases it to great effect with heart, wit, likability, and light, well-polished, and very potent humor.\\n\\n\r\nNine Rum Raisin Flavored Tubs of Ice Cream out of Ten.",
            "date": "2013-07-11T06:37:00+00:00",
            "helpful_count": 106,
            "mal_id": 104835,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1332859.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 9,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/albinochocolate",
                "username": "albinochocolate"
            },
            "url": "https://myanimelist.net/reviews.php?id=104835"
        },
        {
            "content": "The continuation of a comedy about 4+ girls going to school. What more could you want? *coughKyoukocough*\r\n[Story]\r\nPlain and simple, there is no story. You can imagine there will be a short arc spanning 2-3 episodes at the most but generally, this is an anime about the daily lives of middle school girls. If you've watched the first season, you know what I'm talking about.\r\n[Art]\r\nSince the very start, the art has been soft on the eyes and continues to be so. This time around, I'd say that the animation has improved greatly. Toshino Kyouko, for example, has generated more irrational body language than ever before! (lol)If you really search, you'll find some impurities in this divine anime but c'mon..\\n\\n\r\n[Sound]\\n\\n\r\nEverything is spot on. You forget this was done in a studio. xD The seiyuu seem a little better this time around but that could be just me. There's nothing notable that brings down the already great quality of the girls' endeavors. The OP and ED are fun to watch as well.\\n\\n\r\n[Character]\\n\\n\r\nPffff!! Toshino Kyouko! It feels like everything revolves around her and when it doesn't, the episode is a little more serious than usual. That aside, each girl has a dominant quality about them to be remembered. Kyouko, spontaneous.. Chiaki, Bad artist... Yui, swag.. Himawari, breasts/poise.. and so on. Unfortunately Akari, the most forgotten, is a character in itself too. Everybody stands out well and has a sense of individuality which you'll like a lot when growing towards a favorite.\\n\\n\r\n[Enjoyment & Overall]\\n\\n\r\nIf you don't laugh in the first episode, you shouldn't watch this show. If you are opposed to Yuri in any way, you will not enjoy this anime. If you are  looking for development of any kind, you will not like this show. I don't always watch anime of the yuri genre, but when I do.. I kick it with Rivarun.\\n\\n\r\nOverall, the show is funny and a great second season to the first. You'll look forward to the rest of the episodes and whatever else that may come after.",
            "date": "2012-07-05T13:02:00+00:00",
            "helpful_count": 49,
            "mal_id": 65407,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/104790.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Shirt",
                "username": "Shirt"
            },
            "url": "https://myanimelist.net/reviews.php?id=65407"
        },
        {
            "content": "+ This show made me understand the true meaning of moe\r\n+ The art is absolutely adorable\r\n+ Every character is so funny\r\n+ This really made me lauch\r\n+ Despite of cute outlook, the humour is sometimes kind of crrepy, in a good way though ;)\r\n+ Fun inside jokes\r\n- The 2nd season contains lots of jokes from the 1st season, so if you haven't watched that first you may not fully understand the jokes.\r\n- Season 3 hasn't been announced jet.\r\nAnd there isn't actual yuri that much, so if you aren't that into lesbians I can still recommend this. But if you're a homophobic don't spend you time watchingthis and writing hate -comments\\n",
            "date": "2012-10-21T07:53:00+00:00",
            "helpful_count": 36,
            "mal_id": 75505,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1023647.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/CinnamonHime",
                "username": "CinnamonHime"
            },
            "url": "https://myanimelist.net/reviews.php?id=75505"
        },
        {
            "content": "The second season of this show really out shines the first. Yuru Yuri just might be the cutest anime you will ever watch. The art of the show is cute, the characters are cute, the stories are cute, but most important of all the personalities of the characters are cute.  \r\nEach episode is light-hearted, fun feel and pretty self contained. Sometimes references to material from earlier episodes are made, but these are almost always accompanied by flashbacks. Although the stories of each of these episodes might not be extremely interesting, the characters of the show make everything super enjoyable and entertaining. Some of theepisodes are pretty mundane by design, like missing the train to go swimming on a hot summer day; however, the show's charm can even make something like this, as boring as it sounds, make you laugh or gin a little.\\n\\n\r\nThis extension to the original series is definitely worth a watch if you are looking for something to make you laugh and put a smile on your face; however, this show isn't something I would recommend watching in a single sitting. Yuru Yuri is definitely the kind of show you want to watch an episode of here and there eventually leading you to the end.\\n\\n\r\nIf you are interested in Yuru Yuri♪♪ (the second season of Yuru Yuri) I do think watching the first season before you start is a good idea; although, it is by no means required to enjoy the show because of its self-contained style.\\n\\n\r\n\"It's 10/10. I love cute grills\" -BryceHoodie",
            "date": "2014-04-18T00:23:00+00:00",
            "helpful_count": 20,
            "mal_id": 140373,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3686855.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/BryceHoodie",
                "username": "BryceHoodie"
            },
            "url": "https://myanimelist.net/reviews.php?id=140373"
        },
        {
            "content": "I don't know what else to say, but i love this manga anime because it's so ****ing funny xD\r\ni love the characters, the moe art, music and voice actors xD\r\nthis easily gets 10/10 from me :3",
            "date": "2012-07-04T00:30:00+00:00",
            "helpful_count": 15,
            "mal_id": 65273,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1376895.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Bokenasu98",
                "username": "Bokenasu98"
            },
            "url": "https://myanimelist.net/reviews.php?id=65273"
        },
        {
            "content": "It's been quite a while since I reviewed the first series of Yuru Yuri, the anime from Doga Kobo inc, based on the manga by Naromi. Overall, I liked the first series and thought the humour did mostly work pretty well. So, does the second series improve, is it a step down or is it roughly the same as the first? \r\nStory: \r\nThe setup remains the same as the first series, a group of zany lesbian schoolgirls go through their everyday lives while being generally quirky and humour happens as a consequence. The humour is much the same as it was in the first series,the comedy is derived largely from the characters, their strangeness and their interaction. The old running gags are still present, albeit downplayed a bit when compared to the first series. Namori seems to be trying to focus more on other jokes under the assumption that most people have probably seen these jokes enough that they won't be that amused by them anymore. I will give this series credit for having some class when it comes to the fantasising scenes, just like the first it refrains from showing anything sexualised during them, preferring a more cutesy tone. There are also some gags based around really strange occurrences as opposed to the more everyday scenarios and they do work fairly well and the justifications for them are effective parts of the jokes. \\n\\n\r\nHonestly, almost every joke that really doesn't work in this one are those based on one particular character. Akari's sister, Akane. In the first series she was mentioned, but never seen and that was probably for the best. Every time she appears it's for the same joke, she has a sister complex and is insanely creepy about it. That is the entire joke for her. Yeah, the joke about Kyouko going into her room and seeing all of her creepy paraphernalia kind of worked in the first series as a miniature horror parody, but this series doesn't get clever with any of these scenes and they're just bad most of the time. Fortunately, most of them are also very brief. You'll get thirty seconds of Akane before it switches to a different scene or at least takes the focus off of her. \\n\\n\r\nOn a more positive note, the humour, aside from the Akane scenes, is a lot more solid than the first series. There are also some really good cute scenes, particularly between Sakurako and Himawari. Those two might very well have the best scenes in the series, actually. \\n\\n\r\nCharacters: \\n\\n\r\nThis is a series that largely works, because of the characters. They have quirks that lead to a lot of comedic possibilities and there are some really strong interactions. Again, the weakness is Akane since her whole schtick is crushing on her little sister. She doesn't even really get good interactions with the other characters since the only two she really interacts with are Akari and Tomoko, Chinatsu's older sister.\\n\\n\r\nArt: \\n\\n\r\nThe art style is the same as the first series. As I said when I talked about the first series, it's not a style I particularly care for. It looks fine for what it is, the bright and vibrant style does, arguably, suit a series like this, but the character designs feel kind of plain and the general lack of detailing can make things look kind of lackluster at times. It doesn't look bad but it's also not artwork that I find particularly engrossing or interesting. \\n\\n\r\nSound: \\n\\n\r\nThe cast remains a strong aspect of the series. The entire main cast, Mikami Shiori, Tsuda Minami, Ootsubo Yuka & Ookubo Rumi all do well in their roles. Oddly enough, even Akane's actress, Horie Yui, does well given that her character has only a sliver of personality and a rather unpleasant one. Of course, Horie Yui is also a really good actress in general so it may be odd but isn't that surprising. The strongest performances probably come from Mimori Suzuko and Katou Emiri since their characters get so many really strong scenes together. The music is improved over the first series. It remains fun and catchy but the singing itself is more capably done this time around. \\n\\n\r\nHo-yay: \\n\\n\r\nThere's quite a bit. Our cast has maintained their various crushes and even added some new ones. It's strongly implied that Sakurako's older sister has a girlfriend and Chinatsu's sister very obviously has a thing for Akane. There's a lot of romantic tension between certain girls as well. We also find out that Akari is fantasising about every girl in the amusement club, the student council and Nishigaki sensei. Well, she is at that age so it's not that unusual but it's gotta make things a bit awkward for her. \\n\\n\r\nFinal Thoughts: \\n\\n\r\nThe second series of Yuru Yuri is an improvement over the first in practically every aspect. The jokes, as a whole, are stronger. The characters mesh a bit better, mostly and the music is better. That being said, it also has a huge issue that the first series didn't, Akane as a reoccurring character. In all fairness, her presence doesn't hurt the series that much since she isn't around that often, but it still holds it back enough that it ends up being barely better. As such, my final rating is an 8/10. Next week I'll look at Choujuu Densetsu Gestalt.",
            "date": "2015-06-10T10:27:00+00:00",
            "helpful_count": 15,
            "mal_id": 190003,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/150305.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/ktulu007",
                "username": "ktulu007"
            },
            "url": "https://myanimelist.net/reviews.php?id=190003"
        },
        {
            "content": "\"Chocchi macchi chuugakusei, getsuyou ichigen saenai kao shicha dame dame.\"\r\nGood.\r\n\"Are yuru happy? Do yuru happy? aikotoba\"\r\nBetter.\r\nThe second season of Yuru Yuri has once again ignited my feeling for excitement for this whole series. They say that \"More is not always better and excessive is bad.\" Although true, this time, I can say that it isn't.  Everything I expected, have been expecting and will expect are portrayed perfectly in this exciting second season.\r\nFollowing the events of the first season, again, the story, or not-a-true-story-because-it-is-a-slice-of-life centers around the main characters Akari, Yui, Kyouko and Chinatsu, along with the supporting characters Ayano, Chitose, Chizuru, Sakurako, Himawari, Nishigaki-sensei,Matsumoto and others who are again, in an all-girls school with many comedic routines that I really found entertainment at. Truly astounding.\\n\\n\r\nOnce again, even if the story has no central plot, as a slice-of-life, it is still as great as the first season. Lots of scenes that have relaxing, comedic scenes. Lots of scenes which are unforgettable. Lots of things that still make me want more and more and more and more and more every end of each episode. Makes me think again: Am I in the wrong being a fan of girls loving each other romantically? No? Yes? Maybe? And that’s the qualities it has in order for it to make it a truly outstanding one.\\n\\n\r\nAgain, the arts and designs of the characters was drawn so well that I kept screen shooting them. More scenes to watch, more character developments, continuing from the first season, and more of Yuru Yuri! The character designs, in my opinion, hasn’t changed much, and that’s what is good about it. More time to appreciate the designs drawn and much, much more time to be amazed about the development of the story. Am I being too redundant? Or simply annoying? Nevertheless, I write this review for entertainment only.\\n\\n\r\nStop and read the first part of the review again, again. They were the lyrics of the opening and closing themes of the second season. Like the first season, the sounds, OSTs and the music within are also something that cannot be gotten ever so easily. Even if the music of the characters was changed when signaling the start and the end of a commercial, it didn’t even leave behind a speck of discontent or disappointment in me. Meaning? The music were great.\\n\\n\r\nAgain, the characters did not lose their significance as they each have their own personalities, as I said in my review for the first season. There were also characters introduced, like an incestuous, yet loving sister, kids more mature than the characters older than them, and others which also play a significant role in the series. I will also specially mention the student council president, Rise Matsumoto, who has an almost inaudible voice. The way she was portrayed was cute. Not to mention that she’s a test subject for Nishigaki-sensei’s experiments (which always explodes). I like her. Too bad she’s not real. (This is not a spoiler because this part was already explained in the first season.) I also liked Akari because she reminds me of Kuroko Tetsuya from Kuroko no Basuke, for they both have a lack of presence.\\n\\n\r\nI would also like to say something about the Ikeda Twins. Their fantasies are one-spot GREAT. What will happen if their fantasies were true, I wonder? Maybe the reality equilibrium will be destroyed? RIP Earth. I don't want that to happen. I still need to watch Yuru Yuri.\\n\\n\r\nExciting? What kind of question is that? Balderdash. Even if people have many preferences, I prefer anime like this: Slice of life, comedy, and somehow yuri. I am thoroughly excited after each episode. I am happy to have been born on this era. And I just repeated what I wrote in my first review. Why? Because the excitement I felt never changed. It is still exciting. It is still a significant watch in my life. Yes. Too exciting.\\n\\n\r\nOnce again, I have ran out of words synonymous for great in describing a praiseworthy anime like Yuru Yuri. The anime was great overall. Arts? Music? Story? Doesn’t matter. It was truly great. The entertainment I received was over the top and I cannot stop watching it until the end. To be honest, I watched the second season in one go. And I am not lying. For people who likes yuri, then this is perfect for you.\\n\\n\r\nTruly outstanding material.\\n",
            "date": "2017-07-31T02:39:00+00:00",
            "helpful_count": 4,
            "mal_id": 254307,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6297554.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexPaulLEWZ",
                "username": "AlexPaulLEWZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=254307"
        },
        {
            "content": "Second season of Yuru Yuri and still looking good. I mean what can you expect from an anime that has humor in every episode. \r\nStory plot and art still around the same as the first season so I'll give both of them a 9 and 8 respectively. Sound also stays somewhat the same so an 8.\r\nNow comes the interesting part. The characters. All of them have a distinct personality which makes all of them likable. However, I'd like to emphasize a few characters.\r\n1. Toshinou Kyoko. The hyper girl in the anime who always does stupid things and makes everyone go crazy but hey as longas she makes things interesting anything goes i guess.\\n\\n\r\n2. Akari. Wait who's she? I didn't realize that she was in the anime at all(just kidding). I must admit as much as I like to make fun of Akari with her lack of presence, I like her because she's that caring friend who always has everyone's back covered. \\n\\n\r\n3. Sakurako and Himawari. I'll combine these 2 as really they're always lumped together with Sakurako making fun of Himawari every time due to her large oppais. I must say Sakurako always cracks me up with her jokes. And then there's Himawari, who's the more mature of the two but always somehow gets back at Sakurako. \\n\\n\r\nOverall this anime has got to be one of the funniest and most enjoyable animes i've ever watched and i'll definitely rewatch this one.\\n\\n\r\nFinal rating: 9/10",
            "date": "2018-02-25T05:43:00+00:00",
            "helpful_count": 3,
            "mal_id": 272429,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6872532.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Tringapore_98",
                "username": "Tringapore_98"
            },
            "url": "https://myanimelist.net/reviews.php?id=272429"
        },
        {
            "content": "Honestly, it breaks my heart to give this show a 6. I loved season one, but this one felt a bit disappointing. The jokes felt very...insubstantial. There were a few good \"hahaha, her hair ate it\" moments but other than that it's not very funny.\r\nThe characters are awesome, but I gave \"Character\" a 7 because no new characters were introduced, and no existing characters were developed further. This lead to the writers not having very many jokes that weren't already made in the first season.\r\nMy final gripe about this is that there was an episode that attempted to be serious and emotional. Why on earthwould anybody do that in an anime that is supposed to be almost entirely comedy? I'm not talking about a 5-minute segment, either; there was literally a whole episode that was rarely light-hearted in any sense.\\n\\n\r\nSorry, Yuru Yuri. You're a good series but sometimes you just need a little more.",
            "date": "2013-08-13T19:15:00+00:00",
            "helpful_count": 7,
            "mal_id": 109525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/garrett1502",
                "username": "garrett1502"
            },
            "url": "https://myanimelist.net/reviews.php?id=109525"
        },
        {
            "content": "akariin~ Yuri Yuri is a really great Seinen x Slice of Life, even my buddies who are not really a fan of all girls anime completed season one with a lol. Yuri Yuri is one of the best example of animes that represents Timelessness because it doesn't gets old(watched in 2017) and can be watch in anytime,\r\nThere are only few changes from the Season 1, they've focus to the other characters such as Sakurako, Himawari and Akari's Onee-chan, also, there are some development to the relationship of the characters and to the story as well.\r\nIt's Light Yuri makes the character more interesting like Yui-chanand Ayano-chan. Also, the comedy of this anime is good, their gags are not forced and smooth as always.\\n\\n\r\nAll in all it was a great refreshing season 2 of Yuru Yuri that continued the legacy of season 1, niraka~",
            "date": "2017-09-28T21:57:00+00:00",
            "helpful_count": 3,
            "mal_id": 259058,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6573021.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Moorym",
                "username": "Moorym"
            },
            "url": "https://myanimelist.net/reviews.php?id=259058"
        },
        {
            "content": "Though the series has barely just begun, I really enjoyed the first season of Yuru Yuri. The story was just random, making it comical for the viewers unlike other anime where there are always problems. It shows the daily lives of regular middle school girls with some funny situations. I must say that the art is indeed better than most other anime in my opinion and the sound makes it sound cute. Each character has their own personalities, making everyone different. Akarin, for example, is a bit withdrawn but tries to stand out and does her best, making the best outof her day. Kyoko is very outgoing and energetic. She makes the group's lives an adventure everyday. Meanwhile, Yui would be the mature type of the group to make sure that they stay out of trouble, mostly referring to Kyoko. Chinatsu is like the extra glue that would tie the entire group together, making even more funny situations with her imaginations of her and Yui. Yuru Yuri is really funny and overall, I think it deserves a perfect 10.",
            "date": "2012-07-04T08:15:00+00:00",
            "helpful_count": 6,
            "mal_id": 65297,
            "reviewer": {
                "episodes_seen": 1,
                "image_url": "https://cdn.myanimelist.net/images/userimages/800357.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Athena_Carolyn",
                "username": "Athena_Carolyn"
            },
            "url": "https://myanimelist.net/reviews.php?id=65297"
        },
        {
            "content": "I was very pleased with the first season of Yuru Yuri, and the second season did not disappoint. Every episode I watch gives me a happy feeling and I can't hold back my smiles and giggles~! \r\nI'm a hardcore yuri shipper, more than yaoi, and I'm personally addicted to anything cute and moe. If you're into that kind of lolicon thing, please watch this anime. It's worth a shot. \r\nIt's a slice-of-life anime that gives off a happy nostalgic feeling and the \"romance\" in this anime is very light, fluffy, and completely hilarious. Each character has their very own personality that makes the show sounique. It's different from school girl anime such as K-ON in a very odd way...but a good way. It's kind of hard to describe. \\n\\n\r\nStory (8/10)\\n\r\nI'd give it a 10 if it had a well developed, continuing plot. Though it doesn't, the cute moe stories in each episode are enough to keep you coming back for more. Little story lines such as studying for finals, cooking, christmas, and heading to anime conventions with Toshinuo Kyouko. It's simply fun and silly. \\n\\n\r\nArt (9/10)\\n\r\nThe artwork for this anime fits. It's not complex and completely detailed like the designs for Angel Beats. The simplicity to the artwork keeps you focused on the meaning of the anime, which is basically cute. moe, moe, kawaii. \\n\\n\r\nSound (9/10)\\n\r\nI LOVE any eroge openings and any cutesy akihabara idol music, so if you're into that sort of thing, the OPs and EDs are perfect. They make me feel happy, excited and like I want to jump up and start hugging people. ~~^__^ \\n\r\n100% Chu~Gakusei (100％ちゅ～学生) is my favorite of this season and I was earlier disappointed when I couldn't find a full version to download. I normally don't listen to the song at the end of the episode, but the music in Yuri Yuri♪♪ is an exception. \\n\\n\r\n~chu chu chu la la ♥\\n\\n\r\nCharacter (10/10) \\n\r\n(my review had gotten cut off here, so it will be shorter)\\n\r\nLike I said before, each character is quite different (except for Toshinou Kyouko and Ohmuro Sakurako. Even the other characters pointed out their similarities in episode 9.) \\n\r\nThe 4 main characters are all amusing on their own. \\n\r\nAkaza Akari is the mild, laid-back one and is even joked about not having any presence. Do not get this confused with episode 1 where she is having a dream that everyone loves her.\\n\r\nFunami Yui is very quiet, tomboyish, and mature, making her the perfect love interest for China-chan :3\\n\r\nToshinou Kyouko is very irresponsible, outgoing, and not the brightest. She is madly obsessed with Chinatsu-chan and even made her the model for the main character in her manga. \\n\r\nYoshikawa Chinatsu is bubbly and naive and fails in art. She loves Yui-senpai, is good friends with Akari, and is constantly irritated by Kyouko. \\n\\n\r\nEnjoyment (10/10) \\n\r\nI also said before that I was very impressed by this anime. I've enjoyed the episodes I've watched and I will enjoy the rest! :3\\n\\n\r\nOverall (10/10) \\n\r\nLOVED IT. It's not an old-school classic like Sailor Moon but it is definitely a masterpiece to me. Even my friend who doesn't watch anime said she thought it was cute any funny! ♥\\n",
            "date": "2013-01-02T15:22:00+00:00",
            "helpful_count": 6,
            "mal_id": 82432,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1160967.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/pastelstrawberry",
                "username": "pastelstrawberry"
            },
            "url": "https://myanimelist.net/reviews.php?id=82432"
        },
        {
            "content": "This anime is great when you want to relax, and just have a good laugh with no main storyline.\r\nSeason 2 is way better than season 1 in so many ways. I will miss this anime, when i come home from school on mondays :/\r\nYuru Yuri S2 follows where S1 left. You follow Akari, Yui, Kyouko and Chinatsu once again in the Amuement club. You get even more nosebleed from Chitose, and more romance between Kyouko and Ayano.\r\nOne of the things i liked most about S2, is you get to see Akari's sister, Akane Akaza a lot more. And she's one hell of a stalker.\r\nIf youwant an anime where you sit back and close your mind, this is the anime for you.",
            "date": "2012-09-19T13:05:00+00:00",
            "helpful_count": 5,
            "mal_id": 72725,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1384623.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Jeller",
                "username": "Jeller"
            },
            "url": "https://myanimelist.net/reviews.php?id=72725"
        },
        {
            "content": "Yuru Yuri ♪♪ is an amazing anime which all anime studios need to take notes from. It's about the normal lives of schoolgirls trying to enjoy themselves in their tea-club. Each character has her own personality and her own unique traits, which helps enhances the series as it goes on. Yuru Yuri generally does not have a story, it only shows us episodes of lesbian (yuri) girls who are not fully aware of their sexual affiliation, which is the core of the comedy aspect in this, almost, rom-com.\r\nCharacters:\r\nThe clumsy, ignored, and plain Akari. She's the absolutely normal girl every shoujo has, albeit a little clumsyand awkward. Her lack of presence is the cause of her distress.\\n\r\nThe selfish, easygoing, and perverted Kyoko. She's a famous mangaka, and her class' highest scorer even though she's a slouch. Her gluttony and laziness are her most shinning traits.\\n\r\nThe lustful yet calm, and cute Chinatsu. She's the best at making tea and the worst at drawing.\\n\r\nThe nice, mature, and independent Yui. She lives in an apartment by herself, and is often found at the center of the four main characters mentioned above.\\n\r\nThen, there are the secondary characters: The vexed but shy Ayano. The wet-dreaming, nose-bleeding Chitose. The jealous, and dumb Sakurako. The big-breasted and lady-like Himawari. The mute student council president, Rise. And Nana, the science teacher whose inventions are all explosive.\\n\\n\r\nRelationships:\\n\\n\r\nThe relationships are linear and obvious: Akari is ignored by everyone. Kyoko loves Chinatsu, and often crashes at Yui's apartment. Chinatsu adores and looks up to Yui, and is constantly avoiding Kyoko. Yui is the one keeping Kyoko away from Chinatsu, and having them all at her apartment every now and then. Ayano secretly loves Kyoko but pretends she doesn't tolerate her. Chitose is Ayano's best friend, and the one encouraging and advising Ayano. She day-dreams a lot about intimate scenes between Kyoko and Ayano whenever she removes her glasses, and that causes her nose to bleed. Sakurako is extremely jealous of Himawari's big breasts. She always fights with her throughout the two seasons, but appears to be heavily dependent on her.\\n\\n\r\nAnalysis:\\n\\n\r\nThe music is slightly above-par, and is catchy and enjoyable. The animation and design are amazing. And the final episode would account for all the rest, meaning: You can watch the last episode without losing much content. It was really good.\\n\\n\r\nThe anime is truly fantastic because of what it teaches us about the art of making anime. It serves to be as the perfect model of what NOT to do in an anime. Here is a huge list:\\n\\n\r\n*The characters are heavily contrasted, and that does not reflect any social reality.\\n\r\n*The relationships feel like they were planned or written by a robot: They're linear.\\n\r\n*Each character has a list of habits and traits that aren't shared with anyone, and that is neither the case in Japan, nor in anywhere else. It doesn't feel real at all.\\n\r\n*Each joke is thoroughly and excessively explained in a way that would make it pointless.\\n\r\n*Everything can be expected from the start of each event, so there's not much to anticipate.\\n\r\n*Each character tries hard to be a full representation of her characteristics.\\n\r\n*Everything is commented on. There seems to be no understanding between any character without speech.\\n\r\n*No imagination or thinking is left to the watcher. Every reference or notion has to be pointed at.\\n\r\n*Responses are forced and unnatural. So are the reactions. No flexibility.\\n\r\n*Repetition. All events are similar, and all reactions and responses feel like they're repeated.\\n\r\n*Full exploitation of the relationships between these characters, and all characters' characteristics.\\n\r\n*No character development whatsoever. The episodic nature of the anime makes it closer to a cartoon than an anime.\\n\r\n*No story elements or moral. The series' main and only goal is entertainment.\\n\r\n*Typical characters, typical scenarios, and predictable events.\\n\r\n*The children are unrealistic, and overtly frank in an awkward way, which makes one wonder if the developers ever saw children in their lives.\\n\\n\r\nAnd with these notes, which are so easy to notice, most anime studios can start making good anime devoid of all these cliches. The only thing this piece-of-garbage anime is ever good for is showing us how horrible an anime could be, with looking and sounding as beautiful as the budget allows.\\n\\n\r\nWe all know that anime does not have to be realistic, but characters do, and so should relationships, reactions, and traits. It's alright to exaggerate or bend reality a little, but doing so without limits makes the anime unwatchable. The story, the setting, or the events can be unrealistic, and that's alright, but the characters should be relatable so that the watcher can relate himself to the anime, and have a worthy experience. This is a key in arts, and so should it be in anime, even if anime is more about entertainment.\\n\\n\r\nOverall:\\n\\n\r\nThere is not much to be gained from watching Yuru Yuri. Both seasons are mediocre at most and extremely boring. The experience is dull; we don't get any idea about the Japanese culture, nor are we entertained, which is ironic, because that seems to be the main objective of the anime. No new types of characters, no new or even inspired events, and most certainly, no originality.\\n\\n\r\nIf there was anything worth anyone’s time in the whole series (24 episodes), it is the last episode, which was, by a whole deal, better than the rest.",
            "date": "2014-12-28T13:47:00+00:00",
            "helpful_count": 5,
            "mal_id": 174863,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1689115.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/3dnanoo94",
                "username": "3dnanoo94"
            },
            "url": "https://myanimelist.net/reviews.php?id=174863"
        },
        {
            "content": "To be honest, I struggle with the idea of reviewing second seasons, especially for slice of life. I'm gonna try to keep this brief.\r\nStory: 9\r\nThe story hasn't changed. Four girls who take over the abandoned Tea Club for their own amusement. They're still in middle school- more importantly, they're still in the same year of middle school. This isn't addressed until late in the series. While this anime is literally just more of the first season, around the end of the series things start to get strange. The second-year students still seem to be second years, there are some odd moments of deja vu, andfor some reason they bring back a wooden sword.. even though they already brought back a wooden sword? This show pulls something similar to Non Non Biyori Repeat, in the way that it just shows different moments from the same time period, yet it's different because it's not a rewind, but somewhat of a time loop. Even the characters notice something is odd!\\n\r\nWhat really makes this season so much better is a particular episode that really tossed my feelings around. It was good because it was parallel with some of the small details of the first season, and it happened in a way that really could be seen as possible. Then there's a bunch of emotions and long-awaited, much-deserved attention for a certain girl, then there's the \"Psyche!\" that just blocks everything out. I've been emotionally abused, but it was still hilarious.\\n\r\nThis show has several moments that really kept me guessing until the punchline hit, and I found everything to be positively cute, stunning, and simply amusing.\\n\\n\r\nArt: 9\\n\r\nI can't really tell with the art. I didn't notice any differences between the first and second season, and that's not necessarily a bad thing. There don't need to be drastic changes, or even changes at all. This goes for Yuru Yuri especially since the setting or time didn't really move either.\\n\r\nEverything is still well-drawn and everyone is cute as ever.\\n\\n\r\nSound: 9\\n\r\nNew music, great voices, and sound effects that fit with the action and add to the moments. Not much else to say, I'm not a sound critic.\\n\\n\r\nCharacter: 10\\n\r\nThe characters didn't change either. Same people, except we're introduced to a couple new characters: the older sisters. They aren't completely explained all in one go, but there have been enough cameo appearances beforehand to at least understand a bit about them. The older sisters simply add to the comedy, outlining the personality traits of the main characters pretty well.\\n\\n\r\nEnjoyment: 10\\n\r\nI still like this show. The second season doesn't stand out as new or exciting, but it's still lovable and funny and cute like the first.\\n\\n\r\nOverall: 9\\n\r\nDefinitely not a masterpiece, but as a successor to its first season, Yuru Yuri ♪♪ does not disappoint. If you enjoyed the manga or the first season, you have absolutely no reason for not wanting to watch this one.",
            "date": "2016-01-03T21:14:00+00:00",
            "helpful_count": 5,
            "mal_id": 207693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3606903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Symantra",
                "username": "Symantra"
            },
            "url": "https://myanimelist.net/reviews.php?id=207693"
        },
        {
            "content": "More \"cute lesbian girls doing cute things\" kind of show. How great.....and I'm not being sarcastic. \r\n[Story]: (7/10)\r\nThis is the 2nd season of Yuru Yuri.\r\nIf you're watching or have watched the 2nd season then that means you enjoyed the first season of Yuru Yuri or you're just here to see if it gets better. The 2nd season is nothing new. It's the same old \"cute girls doing cute things\" element and there are still no lesbian relationship which shouldn't be a surprise at this point. \r\nThe comedy seems to be a bit better though because I laughed way more in this season than the firstseason. There are a few new jokes brought on the table like the magical girl \"Mirakurun\" but for the most part, it's the same old jokes but somehow better. For me, at least. \\n\\n\r\nGoddammit, Yuru Yuri..I want my tears back after watching that 1 episode where Akarin \"accidentally\" traveled back in time. This is now the 2nd slice-of-life anime that made me tear up but this is the first time I've been tricked into tearing my eyes up. Ahh, this was one of the best episode I've seen in Yuru Yuri.  \\n\r\n______________________________________________________________\\n\r\n[Art/Animation]: (7.5/10)\\n\r\nThe 2nd Season is handled by the same studio so there weren't really any changed in the animation or the character design. Everything looks the same. The Akarin intros are also back and they're actually better than the intros in the first season. Even though the intros are better, they're kind of the same intro when compared to the first season. For example, the 6th episode intro of 1st and 2nd season are the same except there are a few changes to the scenes. \\n\r\n______________________________________________________________\\n\r\n[Sound]: (8.5/10)\\n\r\nThe soundtrack is the same as the first season so the soundtrack is not worth mentioning in this review. Now the OP and ED theme song(s).\\n\\n\r\nThe OP theme songs are \"Yes! Yuyuyu?Yuru Yuri??\" by Nanamori Chu?Goraku Bu and \"Yonde Mirakurun!\" by Majokko Mirakurun. The ED theme songs are \"100% Chu~Gakusei\" by Nanamori Chu?Goraku Bu and \"Girls Power de\" by Yui Funami and Chinatsu Yoshikawa. Compared to the first season's OP, this season's OP is a lot better and their songs are much catchier. The 2nd OP for this season is....meh. It didn't catch my attention. This season's ED theme song is also a lot better than the first season. While the 2nd ED theme song is nothing great, the lyrics did pique my interest. The lyrics sounds like it can be used by feminists..\\n\r\n______________________________________________________________\\n\r\n[Characters]: (8/10)\\n\r\nMost of the characters who appeared in the first season are here and their personalities are still the same. \\n\\n\r\nAkari Akaza, who is supposedly the protagonist of the show is still being treated like she's a side character..as a joke, of course. Although, she did get one episode dedicated to her and it was a damn good episode. Yui Finama is still the same ol' mature girl and after 24 episodes, she somehow managed to handle Toshino's craziness. Chinatsu still drools all over Yui and Toshino is still \"in love\" with Chinatsu. She's as energetic as ever and is still the \"protagonist\" and the driving force of the show. She also seems to be more funnier in this season. Most likely because she's more crazier and more energetic  \\n\\n\r\nSome new supporting characters were introduced in the 2nd season like Sakurako's sisters, Chinatsu's sister, and Akari's sister who is in love with her own sister. \\n\r\n______________________________________________________________\\n\r\n[Enjoyment]: (9/10)\\n\r\nFor the most, I enjoyed this season way more than the first season. The jokes are funnier even though most of them were the same and a bunch of new likable supporting characters. \\n\r\n______________________________________________________________\\n\r\n[VERDICT] \\n\r\n'Yuru Yuri (S2)\" is a great sequel to the Yuru Yuri series. Even though the comedy is mostly recycled, it still made me laugh more than the first season. If you liked the 1st season then this sequel is a must-watch. \\n\\n\r\n[OVERALL]: (9/10)\\n\\n\\n\r\nPros: \\n\r\n+Same ol' \"cute girls doing cute things\" element\\n\r\n+Jokes are more funnier than the previous season\\n\r\n+New sets of likable side characters\\n\\n\r\nCons:\\n\r\n-Plain Animation",
            "date": "2016-01-27T15:05:00+00:00",
            "helpful_count": 4,
            "mal_id": 209485,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4630421.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/jc9622",
                "username": "jc9622"
            },
            "url": "https://myanimelist.net/reviews.php?id=209485"
        },
        {
            "content": "I'm just going to guess you have seen the first season of Yuru Yuri. This season... is just as good maybe better!\r\nStory 9/10: It's the same old same old, the same cute girls who all have crushes on each other doing the same cute things. No suprise, it still works and it's still hilarious!\r\nArt 9/10: Art is still the same cute moe style, and it's still cute as hell!\r\nSound 9/10: While in this OP is still delightful it's not as good as season one's IMO. Still it's wonderful!\r\nCharacter 10/10: Just when you thought these girls couldn't get anymore lovable, they get even more lovable! Thejokes revolving around them are still hilarious, there relationships with each other are still hilarious and/or cute. \\n\\n\r\nEnjoyment 10/10: If you enjoyed season one immensely (like me), then season two will offer the same fun and the same endless laughs!\\n\\n\r\nOverall 9/10: Yuru Yuri is still the same cute yurilicious comedy is always was and always will be. Fans of humor and shoujo ai will love this season as much as the last!\\n\\n\r\n(Also I found out Yui and Chinatsu's VAs are girlfriends, so YuiXChinatsu canon?)",
            "date": "2015-10-29T11:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 202208,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4945214.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DarkLordofYuri",
                "username": "DarkLordofYuri"
            },
            "url": "https://myanimelist.net/reviews.php?id=202208"
        },
        {
            "content": "Well the story is not of the essence of other anime, that is probably NOT the reason why you chose to watch YuruYuri. Oh, this review may contain light spoilers. Read with caution.\r\nIn my prior review regarding the first season, I mostly mentioned that this anime aimed to be a comedy. But, in this season...\r\nIt is still a comedy. Albeit, MUCH better. Character development was of the essence in this season as we further realize that Akane actually deeply cares about Akari, and is only obsessed in that she loves having a little sister; nothing sexual at all that was implied right off the firstepisode that had that hilarious scene with Kyōko.\\n\\n\r\n(SPOILER BEGIN)\\n\\n\r\nShe even willingly believes and helps her in a (later found out to be fictional) time traveling situation (though I believed it because it fit into the atmosphere of the anime for some reason) without hesitation.\\n\\n\r\n(SPOILER END)\\n\\n\r\nShe also cares about her very deeply in a sisterly way that is actually very heartwarming. She is just, well, obsessive about the whole thing. Yeah, she actually did deserve three light paragraphs of her own; could not just sum it up in a short, single one.\\n\\n\r\nThe rest of the new characters are also very cute and have fitting personalities. And, the first scene with Kaede in it was so sad about her thesis on the oppression of teenagers! Even though it is a comedy, they manage to dish out sadness in the best way with that beautiful piano combined with the atmosphere of the scene. Very surprising for what genre it is in.\\n\\n\r\nBut, my favorite development is in the main characters themselves, specifically finding out that Sakurako and Himawari were actually best friends that just drifted apart and became rivals; yet, still help each other out (well, one-sided on Himawari's end; more or less) at times. Also, it carried over the running gag of the last episode featuring legit Yuri in it. If you have seen the first season already, you probably saw it coming. But, definitely not on the same scale as the last one.\\n\\n\r\nWhat you get in this season is more comedy, but delivered with a side of sadness as the character development reels in and is extremely fitting without at all straying too far away from the goal of the anime.\\n\\n\r\nSpeaking of sadness, I still think that scene with Akari thinking she killed a snake was the most heart-touching moment as she had a real look of anguish as she believed that she killed that snake; even though it was not real. And it even led to the scene turning from comedy to sadness in just a few seconds.\\n\\n\r\nBut, I feel like I am spoiling more than being helpful, so I will leave you off with a note that will convince you to watch this next season.\\n\\n\r\nAt the rate that this anime is going, seeing as how it just got two more seasons THIS YEAR, I can see it becoming very popular; possibly mainstream, as rarely does an anime just get renewed out of the blue.\\n\\n\r\nA manga usually has one or, rarely, two anime adaptions of it. So, for this one to have four is quite astonishing and that alone should convince you to watch this next season if you already watched the first, as it features most of what I mentioned before in my prior review regarding that season. The same characters, music, comedy; complete with only having changed the interludes, but nothing much besides that. Oh, and the opening and closing credits, obviously. \\n\\n\r\nFunny thing is, it barely changed a thing over its season transition. But, I imagine the third onward probably will have noticeable changes, as they probably did not anticipate another season. But, I imagine those seasons will be just as good as these last two were.\\n\\n\r\nAnd, I highly recommend both of them to anyone that is a fan of cute comedies, but again, not to those that do not know what \"ゆる\" means. As also stated before, this anime is not what you think it is at first glance and instead offers a rich comedy with beautiful visuals and music, but not erotica material.",
            "date": "2015-08-26T01:31:00+00:00",
            "helpful_count": 4,
            "mal_id": 197082,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4372679.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Notshane",
                "username": "Notshane"
            },
            "url": "https://myanimelist.net/reviews.php?id=197082"
        },
        {
            "content": "Ever since K-on's inception, the creation of Moe genred anime has exponentially increased, to the point that practically in every season of anime, we get at least 1 moe themed show.  Yuru Yuri's season two, is absolutely no exception to the rule.\r\nStory (6.05/10):  If you're not familiar with the show, basically, Yuru Yuri ♪♪ is about the lives of four middle school girls named Kyouko, Yui, Chinatsu, and Akari as they go through school and enjoy life as the amusement club created by our very own star of the show, Toshino Kyouko.  (No one should tell you otherwise that the main characterrole is her and her alone.)  \\n\\n\r\nNow, does this plot sound very familiar?  Practically every moe show involving 4 or so girls as the main characters have this sort of idea.  To put it bluntly, there's nothing really different about this show from an idea's standpoint.  It's a club, four girls, and daily and random activities.  That's not to discourage the show in any way, since the idea to this day is still alive and kicking in terms of how popular it is, but you can literally name at least ten or more shows that have this sort of central idea.\\n\\n\r\nOverview\\n\\n\r\n+/- Overused idea \\n\\n\r\nCharacters (8.42/10):  What moe shows lack in terms of a core and central idea, they make up in really memorable characters.  That's to say, if this show didn't the fantastic and memorable  characters that it had, then it would've failed as a show overall.\\n\\n\r\nThere's not really much to say in terms of the cast, as if you've watched the first season, you'll pretty much be watching the exact same girls doing what they did the the first season.  Which, by itself, isn't bad, as I've mentioned before, the characters are very, very, memorable.  \\n\\n\r\nWhat makes this season different than its last one, is the addition and additional screentime of certain characters.  Some characters that were mentioned but not shown in the first season get some much wanted screentime (albeit not as much as I wanted), and some characters that were dubbed to the supporting cast that show up every now and then, get bumped up to the point that they have whole sections of the show that is about them.  Personally, I find this change to be a nice one, as the somewhat expansive cast gets a bit more depth and exploration into their characters.  \\n\\n\r\nWhat also makes this show's characters memorable, are their gags.  On many occasions, gags that were introduced in the first show, as well as new ones in this season, are reintroduced and done tastefully in the sense that they aren't heavily overused, and the situations that they are used in make sense in context to the story.  \\n\\n\r\nWhile the show did try and make changes to its cast by making some more prominent than they were before, there were a few drawbacks.  For one thing, characters explored or shown a bit more in the first season were put into the supporting positions while some other character whom were part of the supporting role became more prominent.  In short, the creators sort of switched some of the characters' importance to the story, which to me, felt a little disappointing since all of these characters are enjoyable in some way shape or form.  \\n\\n\r\nOverview:\\n\\n\r\n+ EXTREMELY memorable cast\\n\r\n+ Explored characters\\n\r\n-  Memorable supporting characters that needed more screentime\\n\r\n-  Loss of screentime for some characters\\n\\n\r\nArt and Sound (7.21/10 and 6.48/10):  The art of this show is really what you would expect from a moe show.  Big round eyes that exemplify the girls' cuteness, comical facial changes, and a really simple looking look to the show overall to show how laid back it is.  \\n\\n\r\nThe style of the show didn't change drastically from the first season, and that's fine, as it retained the show's charm.  The art itself wasn't bad in the sense that it was jarring to watch, (although Chinatsu's drawings did spring quite a few nightmares), but it wasn't exceptionally breathtaking or wonderfully painted as some shows in recent years have been.  There weren't really any standout moments that really peaked the show's artstyle.\\n\\n\r\nIn terms of sound, it's more or less just general moe themed songs.  Cute girls singing generic sounding songs.  They weren't bad per say, but they weren't memorable or to me, even worth listening to.  \\n\\n\r\nOverview\\n\\n\r\n+/-  Moe artstyle.  (Depending on your tastes)\\n\r\n-  Generic sounding tracks\\n\\n\r\nPersonal enjoyment (7.35/10):  Now comes the question.  What makes this show unique in comparison to the vast majority of moe shows out there?  Aside from the all female cast and this being a yuri show, nothing really stood out.  At least, what I can think of.  The show has a charm to it.  Somehow, Yuru Yuri ♪♪ has this thing to it that just makes it an interesting show.  \\n\\n\r\nPersonally though, I found it odd that I would even watch this sort of show, and even more so that I would like it.  The actual show structure resembles so much to the ever popular Lucky Star, but it has something different about it that just makes it unique.  Perhaps it's the fact that they completely ignore the main character throughout the entirety of the show, or maybe it's because the ships are just so shippable (is that even a real word?), I personally don't know.  \\n\\n\r\nAll I can say is, I watched it, I liked it, and if you're a fan of moe shows, you may like this.  While personally, I didn't like this show as much as I have liked other shows in the past, Yuru Yuri is definitely a series that is worthy enough to be a decent timekiller.  \\n\\n\r\nOverall Score: (7.50/10)",
            "date": "2014-06-18T13:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 147445,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=147445"
        }
    ],
    [
        {
            "content": "I have not read the manga.\r\nSeason 2 does everything that season 1 did. But it manages to do it better. The scenarios get more absurd. The magical realism is more intense. The Yuri jokes are just as funny, but this time they don't overstay their welcome like in Season 1 (Chitose I'm talking to you). The pacing in this season is more consistent and just makes sense. When the girls revisit the same places, I was pleasantly surprised how they managed to keep it entertaining. The girls' personalities compliment each other so well that there's rarely a dull moment. Some of the um..more questionable characterscould turn viewers off, but I see them as an extension of absurdism and shock value.\\n\\n\r\nAfter finishing Episode 10 I was thoroughly enjoying this anime. But then I watched Episode 11. \\n\\n\r\nEpisode 11 pulled out all the stops and all the heartstrings. I was not expecting to get emotional. It's fitting that it's the 11th episode because they turned everything up to 11. That's all I'm gonna say.\\n\\n\r\nAnd then there's Episode 12, easily the silliest episode yet, but it WORKS, and that's what's so amazing about this anime. No matter how far out things go, or how silly things get (which, relative to other genres, isn't all that much), I don't feel alienated or turned off. It just works. The characters are adorable (most of them...). The OP and ED are catchy as hell. Akari's (and several other girls') facial expressions deserve a review of their own. Some might see the girls' personalities as archetypal, shallow, or rudimentary, but this is a slice of life, not the whole pie. This anime is the epitome of cute girls doing cute things, and it doesn't need to be anything more than that.",
            "date": "2015-12-28T00:21:00+00:00",
            "helpful_count": 3,
            "mal_id": 207065,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4995932.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Cat-Daddy",
                "username": "Cat-Daddy"
            },
            "url": "https://myanimelist.net/reviews.php?id=207065"
        },
        {
            "content": "Overall, a lot stronger than the first season, although as to be expected, it's story is quite minimal at some points, and is restricted mainly to running gags and other things a fan could relate to. However, once you start watching, it becomes quite hard to avert your eyes, as you are drawn to love the characters and the joy filled times they have together.",
            "date": "2014-04-13T19:00:00+00:00",
            "helpful_count": 3,
            "mal_id": 139843,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3637941.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Agrippa",
                "username": "Agrippa"
            },
            "url": "https://myanimelist.net/reviews.php?id=139843"
        },
        {
            "content": "First things first. My \"reviews\" system is explained on a blog entry. Which can be found through my profile.\r\n-----\r\nThe usual, cute lesbian girls hanging around the school. Doing their club activities, chatting and having fun. Although this season gave me less memorable effect. Found episodes somewhat boring or lacking the impact.\r\nArt and expressions were superb as always. Music and OST was also quite nice. The cast remained the same, we got all the various stereotypes. Yui and Himawari remain my favorite.\r\nBut yeah, if you are looking for cute girls doing cute stuff anime with touch of lesbians, then be sure to check it out.",
            "date": "2017-08-19T00:50:00+00:00",
            "helpful_count": 1,
            "mal_id": 255793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/75903.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/DesolatePsyche",
                "username": "DesolatePsyche"
            },
            "url": "https://myanimelist.net/reviews.php?id=255793"
        },
        {
            "content": "Oh Season 2, How I enjoy the puns and puns and puns and mimicrys and mimicrys everywhere. Such a fantastic season filled with more cuteness. Let's get to the review. With that said Hajimaru Yo (始まるよ)!!!\r\n                                JAPANESE LEARNERS  (2/5 Easy to Understand)\r\nOnce again, I found this anime easy to understand without subtitles. If you are at the intermediate/advanced level, then this anime should present no problem if you watch it without English subtitles.The grammar and vocabulary spoken is mostly at the basic level. There will be some times where advanced grammar will be used. If you are at the beginner level, this anime will be an excellent learning tool to use.\\n\\n\r\n                                                  STORY\\n\\n\r\nDespite there being no actual story plot in the anime, that doesn't stop it from achieving many plot elements in each episode. There are about 2-3 mini stories in each episode that feature the many characters in the anime. These mini stories are usually based on Japanese puns and most of the puns will go unnoticed by many people who don't know much about Japanese culture. For example, one of the puns has to do with Akari's two buns that she has on her hair. The two buns represent teru teru bouzu, which is a superstition that makes the next day sunny. Despite there being no actual plot, these mini stories, and their puns are well appreciated.\\n\\n\r\n                                                 ART/ANIMATION\\n\\n\r\nFor the most part, the animation is excellent and typical of a slice of life anime. The loli appearances of Akari and Chinatsu may turn some people off if you don't like loli type characters. If you are looking for an anime where characters have a nice size bust then you won't find any here except for Himawari, who haves a huge rack. All of the other characters are flat chested. If you enjoy short skirts, though, you will definitely find that here. Aside from that, each character is well animated and designed to fit their personality.\\n\\n\r\n                                                SOUND\\n\\n\r\nIf there is one thing that Yuru Yuri lacks, it's sound. The OST in this anime is neither exciting nor interesting. I even found the opening and ending themes to be pretty disappointing despite the first season having an excellent opening and ending theme. The good thing is that if you are watching Yuru Yuri, you are probably not remotely interested in the music. \\n\\n\r\n                                                CHARACTER\\n\\n\r\nNow we get to the part that Yuru Yuri shines its brightest at. Yuru Yuri features loads of characters and the best part about it is that each character has her own unique personality. You have Akari, clumsy and rarely appears on-screen; Kyouko, who is funny, smart, and adorable; and Chinatsu, who gets frequent nosebleeds when she appears on-screen. The hard truth is that there will be characters you hate and characters you love depending on what type of personalities you love, and yes, there is a tsundere character for you tsundere lovers. In all honestly, the characters are what makes Yuru Yuri such a fantastic anime. Most slice of life animes contains 3-5 characters who all have a the same personality. The nice thing about Yuru Yuri is that you get to explore over 10 different personalities.\\n\\n\r\n                                               ENJOYMENT/FINAL VERDICT\\n\\n\r\nI loved the second season of Yuru Yuri. However, there were some episodes that were not as entertaining as they could have been. Unlike the first season, I found some episodes to be quite bland and boring. If you loved the first season, then there is no doubt that you will love the second season. What are you waiting for, get to watching!!!\\n\\n\r\nLike my reviews? Want to learn Japanese? Stop by my profile and leave me a message. As always, hope you enjoy my review and thanks for reading until the end.\\n\\n",
            "date": "2015-11-30T19:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 204544,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5022776.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 2,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ghostfromjapan",
                "username": "ghostfromjapan"
            },
            "url": "https://myanimelist.net/reviews.php?id=204544"
        }
    ]
]