[
    [
        {
            "content": "While waiting for someone to write a positive review about this, I thought I'd wake up because that won't happen, so I guess I should do it myself. I find 7 to be above average, not something I'd recommend, but it's good compared to the hate this show is getting, and I actually like it. So there may be spoilers because no one cares about a show with this low of a rating, right? \r\nThe story with its mysteries and use of time travel is stunning, it's all connected and covers up most of its plot-holes (not really all though). The way Setsuna wants tosave someone, which is later implied to be Rinne, the way the Island repeats itself, the way Kuon is revealed to be the future Rinne. It all felt smoothly connected, believable, and most of all, shocking. Even I was surprised by how an overhated anime can shock me with its twists, but surprisingly it surprised me. But that does not mean it is without issues. The ending where saving Rinne is neglected kind of was off the point, but I can't say after that big shock that I cared enough. It still dropped my scoring a bit, in addition to the Never Island segments having copies of the Island segment, that was hard to believe. Ignoring the flaws, I believe the story is the strongest point in the series, but its minimal flaws make me rate it a 7.\\n\\n\r\nSongs by Rinne's seiyuu are really nice to hear, I love the seiyuu. Insert songs are also well made, no complaints. Art looks nice, which is something even the haters can agree on.\\n\\n\r\nAnd I bet we all can agree that the characters are flat. They were used as plot devices, and if the plot wasn't good, this series would be as forgettable as School Days. Even though they are bland, I did not really dislike them, nor like them. The 3 main girls are cute with cute voices, and Setsuna with his manly seiyuu, not much to complain about, but I did rate the characters a 5. The show would be an easy 8/10 with stronger characterization.\\n\\n\r\nObviously after everything I said, I did enjoy the show. Characters do not really affect enjoyment, and enjoyment is the main reason we watch anime, right? So it's not wrong to ignore certain flaws if you enjoyed a show. You do not have to agree with me, after all, I like SAO. But I could name 50 shows better than SAO and Island, so even if they are good in my opinion, you can find better, but you can give this a try.",
            "date": "2018-09-16T10:08:00+00:00",
            "helpful_count": 91,
            "mal_id": 289173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6612923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/animesscythe",
                "username": "animesscythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=289173"
        },
        {
            "content": "Ever wondered what would be like to wake up and have no memories about yourself? Island takes this traditional trope but instead of translating it into a survival tale, it turns it into a story about rediscovery. It’s a series based on a visual novel but I confess to say that it’s very questionable in terms of presentation. Looking at the show made me wonder how such a simple premise descended into an abomination.\r\nThe simple premise of Island honestly made me curious about the show at first. Taking place on this island known as “Urashima”, it gives the impression of a setting of isolation. It’saway from cities, civilizations, and the social problems that we have to deal in our everyday lives. In fact, the first few episodes really makes it clear that the islanders there live in a carefree way. However, it didn’t take long for me to realize that there’s more than meets the eye about the story’s mystery. A big part of the show is trying to sell its suspenseful plot by connecting the past with the present. \\n\\n\r\nBefore I actually get into the juicy part of the show, it’s noticeable that Island underwent some changes before the actual premiere. From my understanding, there was dispute over the script so what we see on TV may not be what was originally planned. I have not played the visual novel (even though it’s available now in both Japanese and English) so I came into the show as a fresh newbie. Still, a show like this felt more like a niche designed to target the specific audience. In this case, it’s aimed at people who enjoys the feeling of a dramatic adventure. And to be honest, that’s a tough pill to swallow. The first few episodes flirted with relationships between the main cast. Meanwhile, the story suffers pacing issues from the very start as each episode constantly bounces between cheesy comedy and dramatic sequences. Then, there’s the mystery that tries to carry the plot. What we get instead is more of a wish-fulfillment love story that doesn’t know what it’s trying to do. There’s a lot of pitfalls that hardly puts emphasis on the story. This is evidenced with the sex jokes, ineffective writing, and in general, lack of care in the characterization.\\n\\n\r\nSpeaking of characters, Setsuna Sanzenkai is what I like to describe as a blank piece of paper. You try to write down facts about him and there’s really nothing. That’s because the guy has a mysterious past but in reality, his personality is just as empty. Through his interactions with the main cast, he doesn’t stand out any more than they do. It doesn't help that his dialogues sounds robotic and often lacks enthuaism. The main cast consists of three girls – Rinne, Karen, and Sara. Each of them seems to have some sort of connection with Setsuna as evidenced through various flashbacks. The show also dedicates a decent amount of screen time by using montages to enhance their relationships. Unfortunately, it fails to cook up any meaningful relationship between Setsuna and these girls. There’s too much generalization on the girls’ personalities and much less on their development. Even Rinne, the girl that Setsuna spends the most time with suffers from this. Sure, there is background storytelling that makes it clear he and Rinne knows more about each other than meets the eye. However, it’s the type of relationship that adheres to wish-fulfillment. These characters are not larger than life and in fact, you can find them in just about any eroge visual novel. It’s a shame really since they look charming on the surface.\\n\\n\r\nSo is there anything worth watching about the show? To be honest, it’s really comes down to the decision on what you’ll find attractive or not. The comedy is blatantly inauthentic with poor timing between the characters’ dialogues. While the show had potential for its mystery elements, it really doesn’t get the ride going until quite later on. In other words, this anime will test your patience. I’ve honestly struggled to stay awake when watching Island and this show felt like it would be better if you played the game. \\n\\n\r\nPerhaps there’s some redeeming quality about the show when it comes to the technical quality. I have to admit, Island does look well designed in terms of its setting. It’s able to convince me of the cultural differences between itself and the outside world. The idea of isolationism also looks credible with the relaxing atmosphere and being away from urban cities. Characters all look like they live the carefree life with their simple clothing and moderate technology. There’s also quite an abundance of fanservice that may sometimes feel uncomfortable. Because let’s face it, some of the girls in the show looks like kids. You be the judge but it’s hard to deny their physical appearances.\\n\\n\r\nOn the other hand, Front Wing was able to create this series with a very relaxing and atmospheric music. While the montage songs can sound a bit generic, they are also appealing by itself if you just listen to them. Unfortunately, the show definitely takes a step back when it comes to voice acting. I already mentioned Setsuna but his voice really sounds like a cog in a machine when he opens his mouth. The female characters’ voices doesn’t sound any better and often too high pitched to take to heart. \\n\\n\r\nI’m glad this show is only 1 cour because any more than that would feel like a chore. To be able to attract an audience towards this show takes more than just a creative setting. The premise had some potential but it’s weathered down by its ineffective plot and one dimensional characters. Perhaps if I watch this without thinking too much, it would’ve been a better experience. The fact is, Island is just another example of a poor story with a budget that it doesn’t deserve.",
            "date": "2018-09-16T06:32:00+00:00",
            "helpful_count": 62,
            "mal_id": 289160,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=289160"
        },
        {
            "content": "There are certain shows that have the potential to be a hentai.\r\nI am not joking. You know, the vast empty spaces, the lone male character, and finally the girls that throw themselves at him.\r\nImagine a perfect hentai setting: an isolated island, a male that lost his memory, and three girls that take turns in persuading him to, and I quote directly from the show, \"mess them up\". Add to this setting a little bit of mystery, the shadow of a plot, and there you have it: Island (minus the hentai).\r\nThe sad part is, upon watching the first episode, I thought \"This has the potential tobe a really interesting anime!\". The visuals were very well done, the sound was heavenly, the sceneries were awesome, and the premise of a mysterious event that doomed an island sold me. As I continued watching, it all went downhill.\\n\r\nThe main character is a cardboard. Scratch that. He is less than that. His role in the anime is to pop up at random moments during convenient times. He has no depth, no personality, nothing. \\n\r\nThe three main girls are walking clichées. \\n\r\nWe have the tsundere \"baka!\" orange haired girl, the loli that they managed to sexualize without the F.B.I breaking their door, and finally the hypersensitive deep white-haired girl. \\n\r\nLet's talk about the plot. \\n\r\nDone. \\n\r\nOh, we haven't? That's because it's nonexistent. \\n\r\nThe main character talks with the other three girls, and each time they mention something about a bad event, time travel, and the need to leave or change the future. That's it. Nothing goes forward \\n\r\nThe problem is, it only seems to get worse throughout each episode. \\n\r\nThis is easily a droppable anime, but I will finish watching it since it's only a total of twenty minutes per week and I need my weekly dose of cringe.\\n",
            "date": "2018-07-22T07:22:00+00:00",
            "helpful_count": 55,
            "mal_id": 284508,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/IAintAllBad",
                "username": "IAintAllBad"
            },
            "url": "https://myanimelist.net/reviews.php?id=284508"
        },
        {
            "content": "The Summer 2018 season is wrapping up slowly and it's that time again.\r\nToday, I will be reviewing Island, an anime with time travel, romance and lolis!\r\nStory (2.5/10)\r\nIsland had a really terrible story.\r\nThe writing immediately suffers from absurd pacing where it either goes too slow with nothing happening at all, or goes too fast with major plot twists and elements failing to work due to being rushed to hell.\r\nAnd whatever content that was given, was super boring and for a guy that loves SciFi shows a lot, this did not interest me one bit.\r\nIt felt like they were writing this anime but it had no soulto it, since shit just occured with no real heart put into it.\\n\\n\r\nOverall, a very boring, lackluster and terribly paced story that had to be one of the most boring SciFi stories I have ever witnessed.\\n\\n\r\nCharacters (3/10)\\n\\n\r\nSetsuna was not the worst character ever. He ain't annoying nor a dick.\\n\\n\r\nHe was just a guy. Didn't feel anything for him but he isn't bad.\\n\\n\r\nAnd the girls also feel very generic and the relationships between Setsuna and all the girls lack a lot of depth to it, with poor writing to blame.\\n\\n\r\nRinne looks cute but was nowhere engaging for me as a character and Karen & Sara were just there too.\\n\\n\r\nArt & Animation (8/10)\\n\\n\r\nfeel. did not make this look as good as Hinamatsuri last season, but the art looks very good with some nice character designs.\\n\\n\r\nSound (6.5/10)\\n\\n\r\nThe OP and ED songs weren't that great but the OST was really nice and fitting for this show, especially its calm songs.\\n\\n\r\nHowever, the voice acting was not good for me.\\n\\n\r\nRinne and Karen's voices felt off for me as they sound too striking for their characters.\\n\\n\r\nEnjoyment (3/10)\\n\\n\r\nYawn.\\n\\n\r\nIsland was a massive letdown and a poorly written show from the get go. One of the weakest shows of this season for sure.\\n\\n\r\nScore 3.5/10",
            "date": "2018-09-16T10:57:00+00:00",
            "helpful_count": 30,
            "mal_id": 289175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6391437.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/animejas",
                "username": "animejas"
            },
            "url": "https://myanimelist.net/reviews.php?id=289175"
        },
        {
            "content": "This anime is a serious problem onto itself: promising us with the light-hearted romance turned dark-esque story with the time travel mechanics, but converting about 30 to 50 hours of play into a 12 episode series (which is honestly a no-go for VN fans and anime-onlys who has watched numerous VNs like myself).\r\nWith it, this is a in-depth look on the controversial series called Island, and this review will be long as molasses (don't worry there's a TL;DR summary):\r\nThe VN was created by Frontwing, who has done the Grisaia series, with 8-bit's adaptation in 2014 raking in massive success. This is the 2nd attempt thatthe company has done this (for their 15th anniversary) to promote the Eng Sub game by using the anime adaptation from studio Feel. Unfortunately, people who have played the Japanese version saw emerging red-flags from the get-go, with similar resonance and dissuasive implications with anime-onlys that this is a bad-ass poor adaptation of the game. The most obvious would be that its gameplay is based on narratives and dialogues, but somehow even the anime adaptation could screw that.\\n\\n\r\nSo yeah, a game that the company advertises Island as a \"momentary and eternal fairy tale\"? There are few scenes here and there, but I don't really think so.\\n\\n\r\nSo, going through the story background (and indeed from the game itself):\\n\r\nThe \"Island\" of Urashima, one that has been heavily under suspicion on the tales of the 3 main girls (Rinne, Karen, Sara) and their family traditions in the span of 5 years. Oppressed under misfortune and cut from the mainland in order not to spread the curse around, in comes a guy who is aptly named Setsuna Sanzenkai. Formerly a nameless guy who comes from the future to kill and save someone, that is washed up ashore naked and questioned about his motives, but everything else to him is satisfactory. His main mission is to not let the recurring memories happen, and save everyone from the misery of the curse by doing some time-traveling on his way.\\n\\n\r\nFrom there, criticism level 1: The story exists on 3 platforms (SPOILER WARNING): \\n\r\nThe initial start but quickly dull and boring \"Stage\" (Ep 1-7);\\n\r\nThe seriously rushed \"Recursion\" (Ep 8-10);\\n\r\nand the quickly made \"to feel like the ending\" \"Jump\" (Ep 11 and 12). \\n\\n\r\nAside from information that was cut out from the VN, don't bother to use the 3-episode rule because the story gets stranger every proceeding episode. The cheaply-made time-travel mechanism just made the whole series look like utter crap with confusion on the progression and beyond...and that's not all. An example would be when the time-traveling scenes came, the timeline was confusing. Only those who are able to discern the events within that period, were able to understand and enjoy/hate the predictability of the series going forward.\\n\\n\r\nThe characters...all are strikingly similar (at least the girls), so the point that looking at them reminded me of shows like Kodomo no Jikan: An adult-looking guy wanting to get dirty with the children pedophile lolis. And don't you dare try to sneak away by the thought that the characters have something unique to them, because they don't. They solely exist to fulfill the narratives and plot points from the game, and seemingly similar to the anime adaptation. Think about it: \\n\\n\r\nKaren wants to leave Urashima to find out what really happened to her biological mom;\\n\r\nSara is like a psychologist with all the charts, diagrams and whatnot, and questioning of past and future events;\\n\r\nRinne has Soot Blight Syndrome (cannot stand under sunlight, it's a premontioned curse) and is like an owl, only active at night, and searching for the TRUE Setsuna, the one who has been with her before \"his\" disappearance 5 years ago;\\n\r\nSetsuna is there for the 3 girls to fill in the plot \"holes\" for them and get theirs and Urashima's problems solved, while working as a servant for Rinne.\\n\\n\r\nSo...criticism level 2:\\n\r\nNone of the characters, yet alone the MC guy or loli girls are engaging nor interesting to follow. All of them are \"walking\" cliches. Their dialogue just made it seem like there's a narrative leading to plot points located around the strange Island, and the \"going about everyday issues\" thing don't really click all that well, accounting for the many issues that made this series much less enjoyable to begin with. You want some romance? It's minimalistic at best. Typical VNs will have sorta-based harems, but this one made the troupe seem far too conventional, like it is the last thing the producers want the characters to end up with.\\n\\n\r\nOne issue I would like to address (if that ever calms your displeasing qualms about the show):\\n\r\nThe VAs however...through they remain the same as is with the game, Sara's in-game VA Rie Murakawa has been changed to Hibiku Yamamura for the anime due to disputes between her parent agency against the production committee. The full bio's on ANN if you want to check it out (because it seems like a big issue to fans of the VN).\\n\r\nThe criticism though: All of them felt very muted and out of character, as much as they reprised their characters from the game, the exact feeling is barely fleshed out in the anime, and that is literally quite sad.\\n\\n\r\nNow, let's get on with the good stuff:\\n\r\nThe art and animation by studio Feel is bright, gorgeous and beautiful to look at, and no, I'm not saying that Feel is a studio that you can count on for VN adaptations. Just take a look at Yosuga no Sora in 2010 and you can see why (same type of adaptation but much enjoyable to watch). Such stuff like the scenes of reflecting water upon the beach and the soft touché background made this watchable to a degree, your mileage may vary. But for Island, striking art and good animation just doesn't do justice to warrant a series that's worth watching. With that said, I applaud the producers for good effort done to get the anime as close to the VN source as possible.\\n\\n\r\nEasily the best part about Island, is undoubtedly the music, or the OST rather, and it's rare that we get a double-take of both the OP and ED for a 1-cour show. Since the events of Island happen within different timelines, it's considerable that the OST has to be confined to the overall presentation, and what we're given makes it for one of the best OSTs this season has to offer: the voice talent of Yukari Tamura (from Last Song) for the OPs and Asaka's amazing rhythmic-feeling EDs. Honestly, I would be much better just listening to the OST alone than watching this show (and you should, too).\\n\\n\r\nIn the end, the million-dollar question is: Should you watch Island?\\n\r\nGranted, most people's criticisms with this show are far more or less than what I can cover here, and that's to an insane degree.  If you like the Kodomo no Jikan feels of \"big\" guy and loli sex-induced fanservice, I'm sorry but you're not gonna find it here.\\n\\n\r\nIf you want the TL;DR though: again, it's a poor adaptation of the VN with a whole lot of nothing. I was certainly looking forward to watch this, but ended up burning myself at the 3-episode rule and giving this another shot (after prelim review)...and yeap, I don't wanna come back again.\\n\\n\r\nThis is just another shot at making VN adaptations the cream of the crap ton of anime, and doesn't bode well either. The more deep the progress, the more insane those let-it-be ideas come and gradually, all sense is lost altogether. Skip this and just proceed onto better VNs like Clannad and the such. But yeah, I'd much rather watch sex shows like Yosuga no Sora more.",
            "date": "2018-09-16T07:39:00+00:00",
            "helpful_count": 29,
            "mal_id": 289165,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=289165"
        },
        {
            "content": "My note for the page is 10, but my valuation is really 7.8\r\nIs an anime with tints of mystery and a future (or a past) to tell about a protagonist with amnesia, at first glance it looks like a harem, but it isn't its focus principal to deal with the romance, if not of the protagonist's intermissions with the main girls, which are interrelated through their families and a legend that has a argument weight on the plot of the story.\r\nAt the beginning the exhibition of the island is interesting and gives rise to varied situations, the style and personality of the main girls inmy personal taste what most attracts me to keep watching it, but thinking about it cold, the plot and the history of background do not seem to reach something deep or relevant.\\n\r\nThe music and atmosphere are cozy, and seeing how the protagonist discovers his past is quite entertaining, it is not an anime that I would recommend to everybody, but I am particularly entertained and it seems to me the most remarkable thing of the season.",
            "date": "2018-07-29T10:58:00+00:00",
            "helpful_count": 11,
            "mal_id": 285077,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kratonos",
                "username": "Kratonos"
            },
            "url": "https://myanimelist.net/reviews.php?id=285077"
        },
        {
            "content": "Hello, and welcome to my first published review on MAL.\r\nDisclaimer: I have not played the original (or any fan translations of) the Island visual novel, nor have I read a summary or detailed explanation of said visual novel. I would like to believe that, unlike others, I have no preconceptual biases of a \"rushed story\" and can judge the anime on what few merits it has alone.\r\nDisclaimer 2: This review is preliminary, and taking place halfway through the airing of Island.\r\nWhere do I begin? Let's begin with the story. It's rather jury rigged and a mixed-parts piecemeal of different tropes and plot elements. Time travel?Ancient prophetic romances? Where have I heard these things before? It seems almost like anything can be Frankenstein'd together these days. While I can look past the very narrow window of what a story can be about, especially when it's an anime adaptation of a visual novel that generally has everything written out for the production team short of translating the story to animation (and hiring/rehiring VAs, etc.) -- this is still a judgment of the anime itself, independent of any other production it takes place in. I'll be honest. It's dull. It's not interesting at all. Whether it's due to the \"rushed\" aspect of it according to VN players or just because the story isn't very deep or visceral, at the end of the day it feels uninteresting and generic. Not that it's inherently and outwardly bad, just -- it doesn't shine more than the common stone. The plot unwinds too conveniently for the MC. A harem of girls mindlessly throw themselves at him for no discernable reason other than that he is an outsider, that he has a name of a prophetic individual, or seemingly pure insanity. Hijinks occur and he ends up developing some degree of a bond with each of these girls for different reasons. Of course there will be plot twists, but why does this matter? At its core, the story presents nothing interesting or of value to me in this format.\\n\\n\r\nThe art isn't bad. It's pretty okay, actually. They use some visual effects in post-production that you don't see too often, and it looks nice doing it. Is it a masterpiece of visual effects? Nowhere near. But as far as the animation and visual effects it is most definitely above average compared to some of the abominations that were churned out even merely year ago. \\n\\n\r\nThe sound design might seem rather unremarkable to the average viewer, but they have a slight attention to detail environmentally than I think is average. Is it up to par? No, perhaps not, but not a lot of animation is with this field. The voice actors casted for the characters, although limited in number, aren't poorly chosen, but they're not particularly remarkable in their roles either. \\n\\n\r\nThe characters are the true downfall in this anime in that they're both neither good enough, nor bad enough to be remarkable -- however they aren't the worst quality, merely what brings down my opinion of the anime as a whole. In fact, the only remotely interesting characters seem to be the generic tsun girl and the \"main\" female, who seem to be somewhat either driven by realistic desires in the small portion of their lives we see, or running away from what seems to be a traumatic past in pursuit of the life they want to live. And that's fine. But in other cases, we seem to have both a main and several side characters that act the way they do for what can only be described as orthodox and unconventional reasons. These aren't characters you're meant to sympathize with as they're not the focus of the show perhaps, but nonetheless the quirkiness and antagonism embedded within their character design seems too conventional. In fact, the harem aspect of this anime is FAR too conventional to be acceptable in my book.  That being said, I'm willing to overlook this mediocrity by the sheer fact that there is indeed worse. \\n\\n\r\nIronically, I'm still enjoying this anime somewhat. This tends to be the case, I understand how not-swell this anime is as a production, but I'm still intrigued as to see how the plot unravels, and I look forward to understanding the full context of the story when the Visual Novel releases globally towards the end of summer (or whenever it is, I guess. Perhaps it's already out.) Perhaps it's just the lead female having a cool hat, or something petty and nonsensical like that. I'm not sure. I'm going to ride this anime out until the end, most likely.\\n\\n\r\nOverall, as far as non-weighted averages go, this anime is a 5.4/10, or 5/10 rounded. You can't go into a borderline loli-harem anime expecting too much, after all. I'm not surprised or disappointed with how this has turned out thus far. \\n\\n\r\nUpon the airing of this show being finished I will adjust any categories that shift, and add any post-series notes that I can. \\n\\n\r\nElement ratings at 6/12: 3/6/6/5/6",
            "date": "2018-08-07T16:42:00+00:00",
            "helpful_count": 9,
            "mal_id": 285846,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5401080.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/KaiserKB",
                "username": "KaiserKB"
            },
            "url": "https://myanimelist.net/reviews.php?id=285846"
        },
        {
            "content": "Island an aberration for some, an acceptable series for few. For me, Island is a series that delivered a different story from the average anime and is more interesting than the generic seasonal series. Is it bad? Is it good? The answer is none; the anime is acceptable, it has good points and some disgusting events that mislead the spectator but in the end, I enjoyed the story. \r\nPerhaps the biggest grotesque event of this series is in episode 9. It helps to add fire to the opposition that considered Island as a pedophilic vessel, in my case, I got angry because those scenes arejust fanservice and are not needed. However, the show isn't searching to do that, but those events are disgusting and generate a repulsion towards the series. It is wrong saying that any spectator who watches Island is a pedophilic lover. The biggest mistake is the look of the characters but after paying attention to the plot, the age of the characters is not that young, but the perception is incorrect. Another mistake, unusual comedic events, they are poorly executed. \\n\\n\r\nOn the other hand, the plot complexity does not help to entertain the spectators. The plot is confusing, but if you spend some minutes understanding it, the outcome will be interesting to the point that you can like some twists and you can question about the Island history and existence. Additionally, all happens in a small portion of land where we can see how the persons inside believe in mythical stories involving the main characters in the present, past, and future (Setsuna and Rinne).  Sadly, some parts of the plot give the sensation that is misplaced and leaves a gap that needs to be explained. Another factor that scares a lot of the spectators is the pacing. The pacing is not that bad. In a short amount of time the series setups an interesting concept full of mystery, fables, and love. Island could have improved with a better pacing and/or more information about the story.    \\n\\n\r\nThe characters are not that amazing, they can be generic and not too special. However, I think it is intentional because in that way you can appreciate the contrast between Setsuna and Rinne and how they are related to the island fables. In addition, the main characters tend to lose their memory so it is obvious that they are not going to have a full background. My favorite character is Kuon because at the end of the series is a character that presented an important evolution. Kuon has more personality compared with the rest.\\n\\n\r\nAbout the art and sound, the art isn't that generic. It is clean, smooth, and the colors are bright. However, the technique is incorrectly used. Since one of the main attractions of Island is the time travel, the artists couldn't find a middle point between young and old. They defined characters with a very youthful look misleading the viewers and affecting the outcome directly. It creates a wrongly pedophilic sensation with the slogan “Setsuna wants all these girls.” Maybe it was the fault of the director, but they wasted some acceptable art trying to create a failed visual contrast and a failed visual age gap between the characters. The result is inappropriate but I cannot dig the series for a mistake that comes from the Visual Novel. It is just the artist perception of the story.\\n\\n\r\nThe sound is acceptable and helps to guide the spectator when the climax changes. The OP is great if you pay attention to the lyrics and the catching rhytm while the ED is normal. \\n\\n\r\nShould you watch Island? Maybe you can try the first episodes but have patience, the story is complex and you could notice some pacing and narrative issues. Honestly, the final score went up from 6.11 - 6.46 after the last two episodes. That indicates the show isn't abysmal.",
            "date": "2018-09-20T12:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 289514,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6017253.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pipe",
                "username": "Pipe"
            },
            "url": "https://myanimelist.net/reviews.php?id=289514"
        },
        {
            "content": "A ****show. That's what this anime is, an utter, unrepentant, disgraceful, atrocious, obnoxious, boring ****show. I've never given an anime such a low score before but this anime is just so bloody awful, it beggars belief.\r\nDisclaimer: I have only watched the anime, I have no idea about the original source that led to this adaptation and have no interest in it. Also, TL;DR at the end.\r\nThe two things that bury this anime are, by far, the story (if one could even call it that) and the characters. I won't bother writing different sections to grade each thing separately, it's pointless, so I'll just whine aboutthe two worst things, ye've been warned.\\n\\n\r\nThe story is just atrocious. Even without knowing the original source, I can see that this needed A LOT more episodes than 12. Everything is jumbled together in such a nonsensical way that when the music ramps up for the \"ta-daaaaaaaaa, plot twist!\" moment I only felt extremely confused because I didn't know what the hell I was supposed to think. The gist of it is time travel, I guess. The amoeba and only man on the island thinks he travelled back through time to...there, I don't know. At one time I thought it was to save his daughter (that he very much felt like shagging when he didn't know she was his daughter, obviously) and at another time it felt like he needed to fix the problems that would lead to the future.\\n\r\nBUT NO! In the end, it was only about him ******* his old love, because the time machine isn't a time machine, it's a time stopping machine, whoever goes in has their time halted while the rest of the world keeps going on, and yet the island is still THE SAME, where all things happen the same bloody way in a continuous loop. This is so bloody retarded that I feel like my lowly IQ got shot a few points down just by trying to think about it again.\\n\r\nStory is a guy who flirts with 3 different girls, one of which his daughter, only to eventually marry his original girlfriend who of course used another time stopping machine (which conveniently awoke her a couple decades before him). That's it. It's atrociously stupid.\\n\\n\r\nCharacters. Oh boy. The thing I noticed the most is how death is treated here. A girl finds out her mother died and will you look at that, 5 seconds later and a quick transition is enough for her to be as cheerful as she was. And it's not the \"oh I act cheerful but I'm so sad inside\" kind of thing, she was LITERALLY as cheerful as before finding out her long lost mother had died.\\n\r\nThe rest of the characters are useless. Pointless. Inconsequential. There is a miko whose only reason to exist is that her...future self, great great nephew, what-the-****-ever, has huuuuge oppai while she's as flat as an ironing board. That's it. Then there's the rebellious girl who treats her mother's passing like the death of an ant and whose only purpose is to lead the protagonist to another \"time machine\".\\n\r\nThen the two main ones. ****able daughter Rinne and only guy in the anime, known as Setsuna. Rinne is boring. I'd rather watch paint dry than having to listen to anything her character says. She has no personality, she just wants to shag Setsuna cos she feels so lonely and blahblahblah you get the point.\\n\r\nSetsuna himself is just \"oh I have to help everyone and I have to save Rinne because oh I don't know, what's this feeling BLAAAAAHHHHHHHHH\" ffs, I can't be bothered. He's an idiot, with no traits other than the I'llsaveeveryonecosI'mthehero one, he's not charming, he's not funny, he's not intelligent, he's not witty, he's the human equivalent of a room painted eggshell.\\n\\n\r\nTL;DR I regret every single minute I spent watching this ****show. Please be smarter than me and DON'T waste your precious time with this sodding disaster of an anime.",
            "date": "2018-09-18T00:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 289293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Kurgo",
                "username": "Kurgo"
            },
            "url": "https://myanimelist.net/reviews.php?id=289293"
        },
        {
            "content": "Although visual novel is very hard to make into an anime, however, this anime is the does not even match to the original story. There is a lot of changes in the story (For example Rinne just scared of going out in day time in the original story, but in anime it becomes that she will die if the sun shine on her) and the main character is really annoying in the anime. Strongly agree to read the visual novel as the story is great. Visual novel story is complicated to understand, but it is all worth it to spend 30hr on it. Anime 3/10,Visual novel 10/10.",
            "date": "2018-08-18T12:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 286810,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5921721.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/_FainT",
                "username": "_FainT"
            },
            "url": "https://myanimelist.net/reviews.php?id=286810"
        },
        {
            "content": "A naked guy on a beach with amnesia wakes up with a girl laying face down on his dick. This is the first scene of Island, a show airing this summer anime 2018 season. Labeled as a drama sci fi show, Island takes place on an island that is isolated by the rest of the world. Bound by its old traditions, the island has its own social structure, which consists of their three families basically acting as major political figures on the island. Recently, the island has been under some distress and the families are under suspicion. These odd circumstances can only be solved bythe daughters of the three families, named Rinne Karen, and Sara, and by a mysterious man that washes up on the beach devoid of all memories. Except the fact that he is named Setsuna.\\n\\n\r\n\tThis show is quite obviously a visual novel. It has three girls, and a protagonist that looks generic as have the watcher imprint themselves on them, and a story that clearly shows all of the girl’s story options. Now me myself haven’t played or seen any gameplay of the game, but with basic visual novel tropes I can guess some things about the anime based on that. So the anime tried to adapt all of the endings and make it flow into a cohesive story. I feel as though this backfired though, because it feels suddenly split from one girl’s storyline to the next one, which made things more confusing for me. And it doesn’t help either that Sara and Karen’s story ended before the 6 or 7 episode mark. I guess in this visual novel there is a very specific girl you were meant to follow, and they tried to make the majority of the show about that. That in and of itself isn’t bad, but it feels like the other two stories were rushed. Especially with Sara’s story, where the revelation and the twist happened literally in the span of 10 minutes. It was resolved as soon as they knew what the problem was. And after both their stories were finished, they were forced to the sidelines almost immediately, now acting as side or even filler characters to react to what they protagonist and Rinne does.\\n\\n\r\n\tIts mentioned in the synopsis that the island is cut off from the rest of the world, which suggests a more tropical, deserted island feeling. But, this isn’t the case at all, and is pretty industrialized for what it claims to be. It seems to be receiving manufactured goods, so the only way its cut off is that the families won’t let anybody enter or leave. Another issue is with the genre tags used for this show. The first half of the show doesn’t have anything to do with sci fi at all. Even some of the middle episode after that only hint at some ancient technology before we get hit all at once during the last 4 or so episodes. Before that its a slice of life drama with a piece of mystery through and through. \\n\\n\r\n\tThe characters in this show represent your basic girl tropes in anime. Karen is the blond hair tsundere who is the daughter of the family that currently runs things. Sara is a shrine girl loli that works really hard to compensate for her family that has gone off the map in terms of politics. And Rinne is the main girl which has the most backstory and development behind her. The protagonist I already touched on as being your typical anime protagonist. I can’t say the any of them are good characters. There are always leaps in logic and stuff that should have been obvious, but wasn’t. It doesn’t go far beyond in accordance to their personalities. They’re mostly carried by their stories.\\n\\n\r\n\tIsland’s story is confusing, rushed, and boring. The first 6 episodes were very very slow, almost completely ignoring the sci fi tag. And even when they did go into the mystery more, I just ended up not caring for anything they were showing me. Or in this case, telling me. Maybe if this show was more then one cour or season, they would have had the time to flesh out the stories of each character more. I feel like they stories they presented were genuinely interesting, but it was just presented in such a way to the point where it became a snooze fest full of characters I don’t care about.\\n\\n\r\n\tThe art in this show is below average. In terms of both character art as well as background art. On a tropical island, you were expect to get long shots of beautiful beaches or some pretty pictures of some of the scenery you would see. Island has that, but they don’t look good in the slightest. If the show takes place in a setting where it's supposed to be bright sunny and beautiful, I would assume you would spend more of the budget on its art. This show’s animation is also sub par. Its very stiff and it doesn’t do much extra when it comes to its “action” scenes. It's not on the lowest tier of animation I’ve seen, but it's enough to notice that something is wrong here.\\n\\n\r\n\tIsland, for me, felt like it had more to say. But its short run time made it feel like they didn’t get enough stuff into it as they would’ve liked. Anyway, the end result is a bad show all around. I recommend this to someone who wouldn’t mind waiting for a while to watch a only decent sci fi mystery. Maybe someone else can appreciate Island more than I could. I give this show a 3 out of 10. This has been PixEFit’s spoiler free, but not really anime review on Island.\\n",
            "date": "2018-09-18T21:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 289380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=289380"
        },
        {
            "content": "My experience with this anime that is... ALLEGEDLY a VN adaptation can be summarized in one word: \"...what?\"\r\nAt least once, I found myself going back to the info page to make sure this was indeed the VN adaptation I was following this season, because it suffers from an issue I've never seen before in a VN adaptation (and I've seen plenty of subpar VN anime): every week, it felt like they were making it up as they went along. I'm not sure who's at fault for this, actually; whether the anime team didn't do a proper job explaining everything or the VN itself didn't dothat, but either way, I, the viewer, was left scratching my head.\\n\\n\r\nThe cause of all this confusion is that most ill-defined and whatever-they-want-it-to-be of plot devices, time travel. I recall something in the earlier episodes about one of the leads thinking they were from the past or something and one thinking they were from the future, then some side characters (who ultimately proved to be irrelevant) were given arcs lasting a couple episodes each, some of whom were convinced they were or had to become time travelers themselves, then they took away the protagonist's memory a second time or something and had him time travel again and suddenly the setting was totally different for just two episodes, and then the final episode with its final twists that feel like they thought them up in the week beforehand got even more ridiculous and I've given up trying to follow the order of events.\\n\\n\r\nI was so clocked out trying to follow the plot, I had actually dropped it by episode 11. At the time, I was thinking the plot still made so little sense that they'd be making something like 16 total episodes to properly resolve everything in a way that made sense. It wasn't until I found out it suddenly ended at just 12 that I decided to watch that final episode. That final episode, I can summarize the same way I'd summarize this whole series: while it kind of has good character moments, I'm too busy not understanding what's going on to feel anything.",
            "date": "2018-09-17T09:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 289246,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2562145.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Megamean09",
                "username": "Megamean09"
            },
            "url": "https://myanimelist.net/reviews.php?id=289246"
        },
        {
            "content": "The Island anime is sort of like traveling nomads. A group of people who just travel around aimlessly without a fixated habitation. The problem with this sort of skeleton is that the anime just turns into a “master of none” type of scenario. Trying to incorporate all these different plot points and different tropes and it ends up just falling flat on its ass. Island has a cool time traveling thing it has going on, but it fails to develop it properly. Having very vague rules and up until the later episodes, activating when the plot demands it. It then just info dumps on you.Expecting the viewer to understand or even care at that point.  It has a cast that has interesting backstories that connects back to the island, but instead of properly fleshing out its characters, it feels like a hentai. Just one-dimensional tropey characters that essentially want to bone the MC. Having an Island setting is somewhat interesting, but it has too much editing in post that makes the art look artificial and boring to look at instead of something natural. The one redeeming this is the music, but that only goes so far in your tolerance of what you can take on the BS happening in this anime.  Having all of these things would make you have an average anime. However, what makes it very much below average is that fact that it constantly disappoints the viewer on all fronts. It isn’t good at anything that it's trying to be and culminated into a massive mess that I can’t recommend to anyone. It fails at being a thriller. It fails at being an ecchi visual novel. It fails at being a compelling character story and it fails at looking good. It fails on all fronts.",
            "date": "2018-09-16T11:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 289178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5340907.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Immovable_Object",
                "username": "Immovable_Object"
            },
            "url": "https://myanimelist.net/reviews.php?id=289178"
        },
        {
            "content": "The show is full of slice of life style writing despite being marketed as a mystery sci-fi drama. There's also a lot of fan service which sometimes leaves me giggling but other times seems too unoriginal or forced.\r\nAs of 5 episodes, we're nowhere near a conclusion and every episode takes the narrative in a completely different direction, leaving me unsure on whether or not this show is going to answer the questions I had from episode one, let alone the abundance of questions that each consecutive episode creates.\r\nHowever, the show is still enjoyable to consume on a weekly basis since the characters aren't too insufferableso if that's the kind of show you're looking for, you should at least try this show out.",
            "date": "2018-07-29T17:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 285112,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5875633.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TooFiveFive",
                "username": "TooFiveFive"
            },
            "url": "https://myanimelist.net/reviews.php?id=285112"
        },
        {
            "content": "Although as you already noticed most of the reviews are very negative towards this anime I want to be more neutral.\r\nWatching \"Island\" may not be for everyone since it's story is trying to confuse you but overall I believe It's very cool \"mystery\" anime. Ever since you jump into this anime you will experience good animation and very fitting sounds. To be fair it may also make you a little uncomfortable but if you can deal with that feeling, why not try it ?\r\nOverall I would recommend this anime for everyone who has free time to spare and likes mysteries like in Hyouka :)\r\nDon't expecttoo much but it's certainly not bad and some people may even love the story... \\n\\n\r\nI watched 4 episodes so I'm not sure what brings us the ending so my opinion might change.",
            "date": "2018-07-24T07:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 284672,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7102051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zapole",
                "username": "zapole"
            },
            "url": "https://myanimelist.net/reviews.php?id=284672"
        },
        {
            "content": "Short and quick review:\r\nAh here we go again, every season we find ourselves in this situation where an anime so mediocre with chracters so flat and bland that makes you wonder if you are ever going to see a SOL/romance/harem VN adaptation that doesn't suck.\r\nI assure you, you have indeed watched Island before, but you just can't remember when and where, pretty much like the MC in this anime, he just can't seem to remember how many girls he has slept with, just flashbacks. Sad indeed.\r\nIf you've watched any other mediocre trash of an anime, then rest assured that this one is no different, I'vewatched enough anime of this sorts to safely say that this anime is not worth your time, unless you wish to see an MC which is slightly better then most other harem anime MCs, then by all means go ahead, but you'll soon be disappointed by how generic each of the main heroine is\\n\\n\r\nSpoilers ahead: \\n\\n\r\nOne of the female characters said 'Mess me up' by the end of Episode 3 to the MC and I see this as doing a great disservice to an anime that is already pathetic to the point where I just ended up dropping it 4 episodes in. Reason being, it doesn't do anything but to have the audience stay and keep watching.\\n\\n\r\nA good anime or rather any good story should make the audience understand what's going on as soon as the first episode ends. Sure, you may argue that great animes as such Steins Gate had a confusing start. However, what seperates Steins Gate from this anime in particular is that while waiting for the mystery to clear, we have interesting characters to indulge in and also we get a gist of what's going on by the hints littered in each episode, thus allowing us to formulate our own reasoning as to what is going on. \\n\\n\r\nBut with Island, you get a mystery anime that quickly turned into a SOL anime that has no obvious direction, no idea what it is doing and even the chracters just felt like it's there for some reason. Even after 4 episodes the anime has not clarified a lot of things and instead spends time developing the mysterious air around Rinne, one of the main heroine, which is not doing much to help an absolute trainwreck of the anime since developing one dimensional chracters gets you nowhere\\n\\n\r\nAll in all, there are better alternatives this season, this is just not worth your time if you're looking for a harem, SOL anime",
            "date": "2018-07-23T17:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 284615,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Horatiomaxx",
                "username": "Horatiomaxx"
            },
            "url": "https://myanimelist.net/reviews.php?id=284615"
        },
        {
            "content": "I’m just going to cut right to the chase, as this isn’t a review, but rather a suggestion to everyone who is either interested in watching Island, or is a player of the visual novel who wants to see how the show stacks up to the source material.\r\nAll I can say is, please don’t waste your time on this.\r\nAs for anime-only’s, please play the visual novel instead. The visual novel is one of the best I’ve read in quite a while, and it’s definitely worth playing for it’s 30-50 hour length. And if you’ve seen or played The Fruit of Grisaia, the game is madeby the same exact people, so go for it!\\n\\n\r\nAs for the group of people (including myself) who have either watched a playthrough or have read the entirety of Island, the anime doesn’t do it justice. Comparing it to the visual novel isn’t even necessary, as comparing the visual novel to the anime adaptation is the same at putting a diamond ring next to a trash can, and playing ‘spot the difference’.\\n\\n\r\nWhether you’re an anime-only or a fan of the original source material, just don’t waste your time watching the anime adaptation. The visual novel will leave much more of a lasting impression on you them the anime ever would.\\n\\n\r\nThe visuals may look nice, but in the end it’s a piss-poor adaptation of an excellent visual novel.\\n\\n",
            "date": "2018-10-02T08:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 290711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5813043.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/calamariqueen",
                "username": "calamariqueen"
            },
            "url": "https://myanimelist.net/reviews.php?id=290711"
        },
        {
            "content": "I was supposed to drop, but I'm glad I stuck with is the ending is awesome, ties the plot threads pretty neatly. \r\nDo not expect much from the first 4 episodes. Its gets slightly better during episode 5 then it gets more confusing. In episode 9 it gets better and better, then episode 11 comes around where they fix the problems of the first episode unitil episode 8. \r\nThe final episode ties the plot points of the series pretty well I say but the road to its awesome ending is messy.\r\nIn conclusion I don't know how to feel about this show. Awesome ending messy earlyplot. Awesome Ending.",
            "date": "2018-09-23T04:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 289751,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6952777.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PhiNic",
                "username": "PhiNic"
            },
            "url": "https://myanimelist.net/reviews.php?id=289751"
        },
        {
            "content": "TL;DR: An anime that barely connects its mysteries to develop a romance\r\nWhile Island is trying to be one of the remarkable romance, mystery anime, the outcomes are pretty unsatisfactory, as it barely connects the mysteries around and develops a romance story. I would say Island is an average show, but can't be considered as a masterpiece, as it can have a better story presentation, rather than things I just saw in the anime.\r\n+Kinda dense mystery elements \r\n+It can be considered as a complete story at the end\r\n+Colourful animation\r\n+The bond between main protagonists is presented \r\n+Usage of soundtrack and music are pretty cool \r\n-Bland characters, especiallyfor side characters\\n\r\n-Strange story pace\\n\r\n-The characters designs are pretty much similar\\n\\n\r\nTo begin with, people considered Island as a fan-service anime, but at the end, you'll be shocked or confused to realise that it's not really the case, as at the end, you will need to figure out the mysteries settled by the settings and most likely you may need to compare the story differences and try to figure what Island is trying to present. I think most people who watch Island in seasonal would have this kind of issue, as the story pace is rather strange and may suddenly have plot elements that you wouldn't expect and may even misunderstanding the ideas of Island, like considering it is just a harem anime or a fan-service anime.I could understand why people think like that, as at first, Island is really like a fan-service anime with many unnecessary fan-service or comedy elements. This is a really common error in most anime that they should present the story in a better way, rather than just rush it at the end, anime fans wouldn't be impressed even the ending is a good ending or bad ending, as in general the story is really feeling bland and the characters are easily forgettable.\\n\\n\r\nSpeaking of anime characters, although Island tries to focus on the bond between Rinne and Setsuna at first, the efforts are ruined because of the plot twists. This is kinda strange to say that because plot twists usually contribute well to the story, but in fact plot twists are too late to be developed and there's not much character development because of the poor story presentation, like the strange story pace in this anime. Side characters like Karen and Sara are even more bland because in Island, it's either they're acting like a harem character or it just a minor character that barely contribute to the plot and at the end, I don't really know what the side characters are doing to be honest, they're just really bland and lame.\\n\\n\r\nIn a nutshell, Island is really trying to bring out a refreshing romance mystery anime, together with the desire that the main characters want to love each other with a few plot twists, but turns out pretty bad due to a poor story presentation. It's really disappointing that with such great potential, Island could be a great visual novel adaptation, but it ends up like important plot elements are packed and rushed at the end and fan-service is placed in the beginning, like a harem anime.\\n\\n\r\nAt the end, let's talk about the animation and sound usage. Well, Island does have kinda good animation, like the visuals used in the Island, the sunlight reflected on the clear sea water, but the character designs are looking too similar, same eye and face shape for female characters, they just change the hairstyle and the colours, others are looking the same if you realise that. Great and nice opening and ending songs, soundtracks and background music are used pretty well, they're kinda fit into the atmosphere. Sadly, this is the one only aspect I think Island is doing great.\\n\\n\r\nFor those who are considering to watch this, either you watch other anime or you should consider whether you'd enjoy a dense and packed romance and mystery anime or not.\\n\\n\r\nStory: 5.5/10 (D+) (35%)\\n\r\nAnimation: 7/10 (B) (10%)\\n\r\nSound: 7.5/10 (B+) (10%)\\n\r\nCharacters: 5/10 (D) (25%)\\n\r\nEnjoyment: 6/10 (C) (20%)\\n\r\nOverall rating: 6/10 (C)",
            "date": "2018-09-17T03:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 289230,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569911.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Swordarc",
                "username": "Swordarc"
            },
            "url": "https://myanimelist.net/reviews.php?id=289230"
        },
        {
            "content": "My review on Island Anime:\r\nThe story was pretty much GOOD on some aspects on there line up of the  Visual novel. It's like watching slow paste game at first, then mystery case on time travel appear. base on episode 1-3. Also episode 4-6 more solving problem island. 8-10 (spoiler) someone die they are trying to save him by going to the future. 11-12 (spoiler) TIME MACHINE it self is not time machine it like a freezing your body to not age at all. Like the story on future-rama show. Any-case they are all SAVE by Rinne alone. That main character didn't do anything atall. To solve the story on the island .Here is my point.\\n\r\nThere is no time travel he just continuous living  1 Million year or etc.\\n\r\nThe theory was endless cycle on life. \\n\\n\\n\r\nstory -\\n\r\nGiving it 8\\n\r\nbecause i love the way author pull up this story.\\n\\n\\n\r\nArt- \\n\r\nGiving it 8\\n\r\nLove the art work and cute girls.\\n\\n\\n\r\nSounds\\n\r\nGiving it 8\\n\r\nI almost cry on ending on that song.\\n\\n\\n\r\nCharacter\\n\r\nGiving it 5\\n\r\nI have MC also there voice quite bad! i mean no emotion at all!\\n\\n\\n\r\nEnjoyment\\n\r\nGiving it 10 (Bias it my review)\\n\r\nI love the  mystery  on solving the Time Machine :)\\n\\n\r\nOVERALL\\n\\n\r\n7.8 round of 8 \\n\\n\r\nGIVING IT 8\\n\\n\\n\\n",
            "date": "2018-09-16T15:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 289201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/linemare",
                "username": "linemare"
            },
            "url": "https://myanimelist.net/reviews.php?id=289201"
        }
    ],
    [
        {
            "content": "While waiting for someone to write a positive review about this, I thought I'd wake up because that won't happen, so I guess I should do it myself. I find 7 to be above average, not something I'd recommend, but it's good compared to the hate this show is getting, and I actually like it. So there may be spoilers because no one cares about a show with this low of a rating, right? \r\nThe story with its mysteries and use of time travel is stunning, it's all connected and covers up most of its plot-holes (not really all though). The way Setsuna wants tosave someone, which is later implied to be Rinne, the way the Island repeats itself, the way Kuon is revealed to be the future Rinne. It all felt smoothly connected, believable, and most of all, shocking. Even I was surprised by how an overhated anime can shock me with its twists, but surprisingly it surprised me. But that does not mean it is without issues. The ending where saving Rinne is neglected kind of was off the point, but I can't say after that big shock that I cared enough. It still dropped my scoring a bit, in addition to the Never Island segments having copies of the Island segment, that was hard to believe. Ignoring the flaws, I believe the story is the strongest point in the series, but its minimal flaws make me rate it a 7.\\n\\n\r\nSongs by Rinne's seiyuu are really nice to hear, I love the seiyuu. Insert songs are also well made, no complaints. Art looks nice, which is something even the haters can agree on.\\n\\n\r\nAnd I bet we all can agree that the characters are flat. They were used as plot devices, and if the plot wasn't good, this series would be as forgettable as School Days. Even though they are bland, I did not really dislike them, nor like them. The 3 main girls are cute with cute voices, and Setsuna with his manly seiyuu, not much to complain about, but I did rate the characters a 5. The show would be an easy 8/10 with stronger characterization.\\n\\n\r\nObviously after everything I said, I did enjoy the show. Characters do not really affect enjoyment, and enjoyment is the main reason we watch anime, right? So it's not wrong to ignore certain flaws if you enjoyed a show. You do not have to agree with me, after all, I like SAO. But I could name 50 shows better than SAO and Island, so even if they are good in my opinion, you can find better, but you can give this a try.",
            "date": "2018-09-16T10:08:00+00:00",
            "helpful_count": 91,
            "mal_id": 289173,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6612923.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/animesscythe",
                "username": "animesscythe"
            },
            "url": "https://myanimelist.net/reviews.php?id=289173"
        },
        {
            "content": "Ever wondered what would be like to wake up and have no memories about yourself? Island takes this traditional trope but instead of translating it into a survival tale, it turns it into a story about rediscovery. It’s a series based on a visual novel but I confess to say that it’s very questionable in terms of presentation. Looking at the show made me wonder how such a simple premise descended into an abomination.\r\nThe simple premise of Island honestly made me curious about the show at first. Taking place on this island known as “Urashima”, it gives the impression of a setting of isolation. It’saway from cities, civilizations, and the social problems that we have to deal in our everyday lives. In fact, the first few episodes really makes it clear that the islanders there live in a carefree way. However, it didn’t take long for me to realize that there’s more than meets the eye about the story’s mystery. A big part of the show is trying to sell its suspenseful plot by connecting the past with the present. \\n\\n\r\nBefore I actually get into the juicy part of the show, it’s noticeable that Island underwent some changes before the actual premiere. From my understanding, there was dispute over the script so what we see on TV may not be what was originally planned. I have not played the visual novel (even though it’s available now in both Japanese and English) so I came into the show as a fresh newbie. Still, a show like this felt more like a niche designed to target the specific audience. In this case, it’s aimed at people who enjoys the feeling of a dramatic adventure. And to be honest, that’s a tough pill to swallow. The first few episodes flirted with relationships between the main cast. Meanwhile, the story suffers pacing issues from the very start as each episode constantly bounces between cheesy comedy and dramatic sequences. Then, there’s the mystery that tries to carry the plot. What we get instead is more of a wish-fulfillment love story that doesn’t know what it’s trying to do. There’s a lot of pitfalls that hardly puts emphasis on the story. This is evidenced with the sex jokes, ineffective writing, and in general, lack of care in the characterization.\\n\\n\r\nSpeaking of characters, Setsuna Sanzenkai is what I like to describe as a blank piece of paper. You try to write down facts about him and there’s really nothing. That’s because the guy has a mysterious past but in reality, his personality is just as empty. Through his interactions with the main cast, he doesn’t stand out any more than they do. It doesn't help that his dialogues sounds robotic and often lacks enthuaism. The main cast consists of three girls – Rinne, Karen, and Sara. Each of them seems to have some sort of connection with Setsuna as evidenced through various flashbacks. The show also dedicates a decent amount of screen time by using montages to enhance their relationships. Unfortunately, it fails to cook up any meaningful relationship between Setsuna and these girls. There’s too much generalization on the girls’ personalities and much less on their development. Even Rinne, the girl that Setsuna spends the most time with suffers from this. Sure, there is background storytelling that makes it clear he and Rinne knows more about each other than meets the eye. However, it’s the type of relationship that adheres to wish-fulfillment. These characters are not larger than life and in fact, you can find them in just about any eroge visual novel. It’s a shame really since they look charming on the surface.\\n\\n\r\nSo is there anything worth watching about the show? To be honest, it’s really comes down to the decision on what you’ll find attractive or not. The comedy is blatantly inauthentic with poor timing between the characters’ dialogues. While the show had potential for its mystery elements, it really doesn’t get the ride going until quite later on. In other words, this anime will test your patience. I’ve honestly struggled to stay awake when watching Island and this show felt like it would be better if you played the game. \\n\\n\r\nPerhaps there’s some redeeming quality about the show when it comes to the technical quality. I have to admit, Island does look well designed in terms of its setting. It’s able to convince me of the cultural differences between itself and the outside world. The idea of isolationism also looks credible with the relaxing atmosphere and being away from urban cities. Characters all look like they live the carefree life with their simple clothing and moderate technology. There’s also quite an abundance of fanservice that may sometimes feel uncomfortable. Because let’s face it, some of the girls in the show looks like kids. You be the judge but it’s hard to deny their physical appearances.\\n\\n\r\nOn the other hand, Front Wing was able to create this series with a very relaxing and atmospheric music. While the montage songs can sound a bit generic, they are also appealing by itself if you just listen to them. Unfortunately, the show definitely takes a step back when it comes to voice acting. I already mentioned Setsuna but his voice really sounds like a cog in a machine when he opens his mouth. The female characters’ voices doesn’t sound any better and often too high pitched to take to heart. \\n\\n\r\nI’m glad this show is only 1 cour because any more than that would feel like a chore. To be able to attract an audience towards this show takes more than just a creative setting. The premise had some potential but it’s weathered down by its ineffective plot and one dimensional characters. Perhaps if I watch this without thinking too much, it would’ve been a better experience. The fact is, Island is just another example of a poor story with a budget that it doesn’t deserve.",
            "date": "2018-09-16T06:32:00+00:00",
            "helpful_count": 62,
            "mal_id": 289160,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=289160"
        },
        {
            "content": "There are certain shows that have the potential to be a hentai.\r\nI am not joking. You know, the vast empty spaces, the lone male character, and finally the girls that throw themselves at him.\r\nImagine a perfect hentai setting: an isolated island, a male that lost his memory, and three girls that take turns in persuading him to, and I quote directly from the show, \"mess them up\". Add to this setting a little bit of mystery, the shadow of a plot, and there you have it: Island (minus the hentai).\r\nThe sad part is, upon watching the first episode, I thought \"This has the potential tobe a really interesting anime!\". The visuals were very well done, the sound was heavenly, the sceneries were awesome, and the premise of a mysterious event that doomed an island sold me. As I continued watching, it all went downhill.\\n\r\nThe main character is a cardboard. Scratch that. He is less than that. His role in the anime is to pop up at random moments during convenient times. He has no depth, no personality, nothing. \\n\r\nThe three main girls are walking clichées. \\n\r\nWe have the tsundere \"baka!\" orange haired girl, the loli that they managed to sexualize without the F.B.I breaking their door, and finally the hypersensitive deep white-haired girl. \\n\r\nLet's talk about the plot. \\n\r\nDone. \\n\r\nOh, we haven't? That's because it's nonexistent. \\n\r\nThe main character talks with the other three girls, and each time they mention something about a bad event, time travel, and the need to leave or change the future. That's it. Nothing goes forward \\n\r\nThe problem is, it only seems to get worse throughout each episode. \\n\r\nThis is easily a droppable anime, but I will finish watching it since it's only a total of twenty minutes per week and I need my weekly dose of cringe.\\n",
            "date": "2018-07-22T07:22:00+00:00",
            "helpful_count": 55,
            "mal_id": 284508,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4675181.jpg",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/IAintAllBad",
                "username": "IAintAllBad"
            },
            "url": "https://myanimelist.net/reviews.php?id=284508"
        },
        {
            "content": "The Summer 2018 season is wrapping up slowly and it's that time again.\r\nToday, I will be reviewing Island, an anime with time travel, romance and lolis!\r\nStory (2.5/10)\r\nIsland had a really terrible story.\r\nThe writing immediately suffers from absurd pacing where it either goes too slow with nothing happening at all, or goes too fast with major plot twists and elements failing to work due to being rushed to hell.\r\nAnd whatever content that was given, was super boring and for a guy that loves SciFi shows a lot, this did not interest me one bit.\r\nIt felt like they were writing this anime but it had no soulto it, since shit just occured with no real heart put into it.\\n\\n\r\nOverall, a very boring, lackluster and terribly paced story that had to be one of the most boring SciFi stories I have ever witnessed.\\n\\n\r\nCharacters (3/10)\\n\\n\r\nSetsuna was not the worst character ever. He ain't annoying nor a dick.\\n\\n\r\nHe was just a guy. Didn't feel anything for him but he isn't bad.\\n\\n\r\nAnd the girls also feel very generic and the relationships between Setsuna and all the girls lack a lot of depth to it, with poor writing to blame.\\n\\n\r\nRinne looks cute but was nowhere engaging for me as a character and Karen & Sara were just there too.\\n\\n\r\nArt & Animation (8/10)\\n\\n\r\nfeel. did not make this look as good as Hinamatsuri last season, but the art looks very good with some nice character designs.\\n\\n\r\nSound (6.5/10)\\n\\n\r\nThe OP and ED songs weren't that great but the OST was really nice and fitting for this show, especially its calm songs.\\n\\n\r\nHowever, the voice acting was not good for me.\\n\\n\r\nRinne and Karen's voices felt off for me as they sound too striking for their characters.\\n\\n\r\nEnjoyment (3/10)\\n\\n\r\nYawn.\\n\\n\r\nIsland was a massive letdown and a poorly written show from the get go. One of the weakest shows of this season for sure.\\n\\n\r\nScore 3.5/10",
            "date": "2018-09-16T10:57:00+00:00",
            "helpful_count": 30,
            "mal_id": 289175,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6391437.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/animejas",
                "username": "animejas"
            },
            "url": "https://myanimelist.net/reviews.php?id=289175"
        },
        {
            "content": "This anime is a serious problem onto itself: promising us with the light-hearted romance turned dark-esque story with the time travel mechanics, but converting about 30 to 50 hours of play into a 12 episode series (which is honestly a no-go for VN fans and anime-onlys who has watched numerous VNs like myself).\r\nWith it, this is a in-depth look on the controversial series called Island, and this review will be long as molasses (don't worry there's a TL;DR summary):\r\nThe VN was created by Frontwing, who has done the Grisaia series, with 8-bit's adaptation in 2014 raking in massive success. This is the 2nd attempt thatthe company has done this (for their 15th anniversary) to promote the Eng Sub game by using the anime adaptation from studio Feel. Unfortunately, people who have played the Japanese version saw emerging red-flags from the get-go, with similar resonance and dissuasive implications with anime-onlys that this is a bad-ass poor adaptation of the game. The most obvious would be that its gameplay is based on narratives and dialogues, but somehow even the anime adaptation could screw that.\\n\\n\r\nSo yeah, a game that the company advertises Island as a \"momentary and eternal fairy tale\"? There are few scenes here and there, but I don't really think so.\\n\\n\r\nSo, going through the story background (and indeed from the game itself):\\n\r\nThe \"Island\" of Urashima, one that has been heavily under suspicion on the tales of the 3 main girls (Rinne, Karen, Sara) and their family traditions in the span of 5 years. Oppressed under misfortune and cut from the mainland in order not to spread the curse around, in comes a guy who is aptly named Setsuna Sanzenkai. Formerly a nameless guy who comes from the future to kill and save someone, that is washed up ashore naked and questioned about his motives, but everything else to him is satisfactory. His main mission is to not let the recurring memories happen, and save everyone from the misery of the curse by doing some time-traveling on his way.\\n\\n\r\nFrom there, criticism level 1: The story exists on 3 platforms (SPOILER WARNING): \\n\r\nThe initial start but quickly dull and boring \"Stage\" (Ep 1-7);\\n\r\nThe seriously rushed \"Recursion\" (Ep 8-10);\\n\r\nand the quickly made \"to feel like the ending\" \"Jump\" (Ep 11 and 12). \\n\\n\r\nAside from information that was cut out from the VN, don't bother to use the 3-episode rule because the story gets stranger every proceeding episode. The cheaply-made time-travel mechanism just made the whole series look like utter crap with confusion on the progression and beyond...and that's not all. An example would be when the time-traveling scenes came, the timeline was confusing. Only those who are able to discern the events within that period, were able to understand and enjoy/hate the predictability of the series going forward.\\n\\n\r\nThe characters...all are strikingly similar (at least the girls), so the point that looking at them reminded me of shows like Kodomo no Jikan: An adult-looking guy wanting to get dirty with the children pedophile lolis. And don't you dare try to sneak away by the thought that the characters have something unique to them, because they don't. They solely exist to fulfill the narratives and plot points from the game, and seemingly similar to the anime adaptation. Think about it: \\n\\n\r\nKaren wants to leave Urashima to find out what really happened to her biological mom;\\n\r\nSara is like a psychologist with all the charts, diagrams and whatnot, and questioning of past and future events;\\n\r\nRinne has Soot Blight Syndrome (cannot stand under sunlight, it's a premontioned curse) and is like an owl, only active at night, and searching for the TRUE Setsuna, the one who has been with her before \"his\" disappearance 5 years ago;\\n\r\nSetsuna is there for the 3 girls to fill in the plot \"holes\" for them and get theirs and Urashima's problems solved, while working as a servant for Rinne.\\n\\n\r\nSo...criticism level 2:\\n\r\nNone of the characters, yet alone the MC guy or loli girls are engaging nor interesting to follow. All of them are \"walking\" cliches. Their dialogue just made it seem like there's a narrative leading to plot points located around the strange Island, and the \"going about everyday issues\" thing don't really click all that well, accounting for the many issues that made this series much less enjoyable to begin with. You want some romance? It's minimalistic at best. Typical VNs will have sorta-based harems, but this one made the troupe seem far too conventional, like it is the last thing the producers want the characters to end up with.\\n\\n\r\nOne issue I would like to address (if that ever calms your displeasing qualms about the show):\\n\r\nThe VAs however...through they remain the same as is with the game, Sara's in-game VA Rie Murakawa has been changed to Hibiku Yamamura for the anime due to disputes between her parent agency against the production committee. The full bio's on ANN if you want to check it out (because it seems like a big issue to fans of the VN).\\n\r\nThe criticism though: All of them felt very muted and out of character, as much as they reprised their characters from the game, the exact feeling is barely fleshed out in the anime, and that is literally quite sad.\\n\\n\r\nNow, let's get on with the good stuff:\\n\r\nThe art and animation by studio Feel is bright, gorgeous and beautiful to look at, and no, I'm not saying that Feel is a studio that you can count on for VN adaptations. Just take a look at Yosuga no Sora in 2010 and you can see why (same type of adaptation but much enjoyable to watch). Such stuff like the scenes of reflecting water upon the beach and the soft touché background made this watchable to a degree, your mileage may vary. But for Island, striking art and good animation just doesn't do justice to warrant a series that's worth watching. With that said, I applaud the producers for good effort done to get the anime as close to the VN source as possible.\\n\\n\r\nEasily the best part about Island, is undoubtedly the music, or the OST rather, and it's rare that we get a double-take of both the OP and ED for a 1-cour show. Since the events of Island happen within different timelines, it's considerable that the OST has to be confined to the overall presentation, and what we're given makes it for one of the best OSTs this season has to offer: the voice talent of Yukari Tamura (from Last Song) for the OPs and Asaka's amazing rhythmic-feeling EDs. Honestly, I would be much better just listening to the OST alone than watching this show (and you should, too).\\n\\n\r\nIn the end, the million-dollar question is: Should you watch Island?\\n\r\nGranted, most people's criticisms with this show are far more or less than what I can cover here, and that's to an insane degree.  If you like the Kodomo no Jikan feels of \"big\" guy and loli sex-induced fanservice, I'm sorry but you're not gonna find it here.\\n\\n\r\nIf you want the TL;DR though: again, it's a poor adaptation of the VN with a whole lot of nothing. I was certainly looking forward to watch this, but ended up burning myself at the 3-episode rule and giving this another shot (after prelim review)...and yeap, I don't wanna come back again.\\n\\n\r\nThis is just another shot at making VN adaptations the cream of the crap ton of anime, and doesn't bode well either. The more deep the progress, the more insane those let-it-be ideas come and gradually, all sense is lost altogether. Skip this and just proceed onto better VNs like Clannad and the such. But yeah, I'd much rather watch sex shows like Yosuga no Sora more.",
            "date": "2018-09-16T07:39:00+00:00",
            "helpful_count": 29,
            "mal_id": 289165,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6448140.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/KANLen09",
                "username": "KANLen09"
            },
            "url": "https://myanimelist.net/reviews.php?id=289165"
        },
        {
            "content": "My note for the page is 10, but my valuation is really 7.8\r\nIs an anime with tints of mystery and a future (or a past) to tell about a protagonist with amnesia, at first glance it looks like a harem, but it isn't its focus principal to deal with the romance, if not of the protagonist's intermissions with the main girls, which are interrelated through their families and a legend that has a argument weight on the plot of the story.\r\nAt the beginning the exhibition of the island is interesting and gives rise to varied situations, the style and personality of the main girls inmy personal taste what most attracts me to keep watching it, but thinking about it cold, the plot and the history of background do not seem to reach something deep or relevant.\\n\r\nThe music and atmosphere are cozy, and seeing how the protagonist discovers his past is quite entertaining, it is not an anime that I would recommend to everybody, but I am particularly entertained and it seems to me the most remarkable thing of the season.",
            "date": "2018-07-29T10:58:00+00:00",
            "helpful_count": 11,
            "mal_id": 285077,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Kratonos",
                "username": "Kratonos"
            },
            "url": "https://myanimelist.net/reviews.php?id=285077"
        },
        {
            "content": "Hello, and welcome to my first published review on MAL.\r\nDisclaimer: I have not played the original (or any fan translations of) the Island visual novel, nor have I read a summary or detailed explanation of said visual novel. I would like to believe that, unlike others, I have no preconceptual biases of a \"rushed story\" and can judge the anime on what few merits it has alone.\r\nDisclaimer 2: This review is preliminary, and taking place halfway through the airing of Island.\r\nWhere do I begin? Let's begin with the story. It's rather jury rigged and a mixed-parts piecemeal of different tropes and plot elements. Time travel?Ancient prophetic romances? Where have I heard these things before? It seems almost like anything can be Frankenstein'd together these days. While I can look past the very narrow window of what a story can be about, especially when it's an anime adaptation of a visual novel that generally has everything written out for the production team short of translating the story to animation (and hiring/rehiring VAs, etc.) -- this is still a judgment of the anime itself, independent of any other production it takes place in. I'll be honest. It's dull. It's not interesting at all. Whether it's due to the \"rushed\" aspect of it according to VN players or just because the story isn't very deep or visceral, at the end of the day it feels uninteresting and generic. Not that it's inherently and outwardly bad, just -- it doesn't shine more than the common stone. The plot unwinds too conveniently for the MC. A harem of girls mindlessly throw themselves at him for no discernable reason other than that he is an outsider, that he has a name of a prophetic individual, or seemingly pure insanity. Hijinks occur and he ends up developing some degree of a bond with each of these girls for different reasons. Of course there will be plot twists, but why does this matter? At its core, the story presents nothing interesting or of value to me in this format.\\n\\n\r\nThe art isn't bad. It's pretty okay, actually. They use some visual effects in post-production that you don't see too often, and it looks nice doing it. Is it a masterpiece of visual effects? Nowhere near. But as far as the animation and visual effects it is most definitely above average compared to some of the abominations that were churned out even merely year ago. \\n\\n\r\nThe sound design might seem rather unremarkable to the average viewer, but they have a slight attention to detail environmentally than I think is average. Is it up to par? No, perhaps not, but not a lot of animation is with this field. The voice actors casted for the characters, although limited in number, aren't poorly chosen, but they're not particularly remarkable in their roles either. \\n\\n\r\nThe characters are the true downfall in this anime in that they're both neither good enough, nor bad enough to be remarkable -- however they aren't the worst quality, merely what brings down my opinion of the anime as a whole. In fact, the only remotely interesting characters seem to be the generic tsun girl and the \"main\" female, who seem to be somewhat either driven by realistic desires in the small portion of their lives we see, or running away from what seems to be a traumatic past in pursuit of the life they want to live. And that's fine. But in other cases, we seem to have both a main and several side characters that act the way they do for what can only be described as orthodox and unconventional reasons. These aren't characters you're meant to sympathize with as they're not the focus of the show perhaps, but nonetheless the quirkiness and antagonism embedded within their character design seems too conventional. In fact, the harem aspect of this anime is FAR too conventional to be acceptable in my book.  That being said, I'm willing to overlook this mediocrity by the sheer fact that there is indeed worse. \\n\\n\r\nIronically, I'm still enjoying this anime somewhat. This tends to be the case, I understand how not-swell this anime is as a production, but I'm still intrigued as to see how the plot unravels, and I look forward to understanding the full context of the story when the Visual Novel releases globally towards the end of summer (or whenever it is, I guess. Perhaps it's already out.) Perhaps it's just the lead female having a cool hat, or something petty and nonsensical like that. I'm not sure. I'm going to ride this anime out until the end, most likely.\\n\\n\r\nOverall, as far as non-weighted averages go, this anime is a 5.4/10, or 5/10 rounded. You can't go into a borderline loli-harem anime expecting too much, after all. I'm not surprised or disappointed with how this has turned out thus far. \\n\\n\r\nUpon the airing of this show being finished I will adjust any categories that shift, and add any post-series notes that I can. \\n\\n\r\nElement ratings at 6/12: 3/6/6/5/6",
            "date": "2018-08-07T16:42:00+00:00",
            "helpful_count": 9,
            "mal_id": 285846,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5401080.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/KaiserKB",
                "username": "KaiserKB"
            },
            "url": "https://myanimelist.net/reviews.php?id=285846"
        },
        {
            "content": "Island an aberration for some, an acceptable series for few. For me, Island is a series that delivered a different story from the average anime and is more interesting than the generic seasonal series. Is it bad? Is it good? The answer is none; the anime is acceptable, it has good points and some disgusting events that mislead the spectator but in the end, I enjoyed the story. \r\nPerhaps the biggest grotesque event of this series is in episode 9. It helps to add fire to the opposition that considered Island as a pedophilic vessel, in my case, I got angry because those scenes arejust fanservice and are not needed. However, the show isn't searching to do that, but those events are disgusting and generate a repulsion towards the series. It is wrong saying that any spectator who watches Island is a pedophilic lover. The biggest mistake is the look of the characters but after paying attention to the plot, the age of the characters is not that young, but the perception is incorrect. Another mistake, unusual comedic events, they are poorly executed. \\n\\n\r\nOn the other hand, the plot complexity does not help to entertain the spectators. The plot is confusing, but if you spend some minutes understanding it, the outcome will be interesting to the point that you can like some twists and you can question about the Island history and existence. Additionally, all happens in a small portion of land where we can see how the persons inside believe in mythical stories involving the main characters in the present, past, and future (Setsuna and Rinne).  Sadly, some parts of the plot give the sensation that is misplaced and leaves a gap that needs to be explained. Another factor that scares a lot of the spectators is the pacing. The pacing is not that bad. In a short amount of time the series setups an interesting concept full of mystery, fables, and love. Island could have improved with a better pacing and/or more information about the story.    \\n\\n\r\nThe characters are not that amazing, they can be generic and not too special. However, I think it is intentional because in that way you can appreciate the contrast between Setsuna and Rinne and how they are related to the island fables. In addition, the main characters tend to lose their memory so it is obvious that they are not going to have a full background. My favorite character is Kuon because at the end of the series is a character that presented an important evolution. Kuon has more personality compared with the rest.\\n\\n\r\nAbout the art and sound, the art isn't that generic. It is clean, smooth, and the colors are bright. However, the technique is incorrectly used. Since one of the main attractions of Island is the time travel, the artists couldn't find a middle point between young and old. They defined characters with a very youthful look misleading the viewers and affecting the outcome directly. It creates a wrongly pedophilic sensation with the slogan “Setsuna wants all these girls.” Maybe it was the fault of the director, but they wasted some acceptable art trying to create a failed visual contrast and a failed visual age gap between the characters. The result is inappropriate but I cannot dig the series for a mistake that comes from the Visual Novel. It is just the artist perception of the story.\\n\\n\r\nThe sound is acceptable and helps to guide the spectator when the climax changes. The OP is great if you pay attention to the lyrics and the catching rhytm while the ED is normal. \\n\\n\r\nShould you watch Island? Maybe you can try the first episodes but have patience, the story is complex and you could notice some pacing and narrative issues. Honestly, the final score went up from 6.11 - 6.46 after the last two episodes. That indicates the show isn't abysmal.",
            "date": "2018-09-20T12:56:00+00:00",
            "helpful_count": 8,
            "mal_id": 289514,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6017253.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pipe",
                "username": "Pipe"
            },
            "url": "https://myanimelist.net/reviews.php?id=289514"
        },
        {
            "content": "A ****show. That's what this anime is, an utter, unrepentant, disgraceful, atrocious, obnoxious, boring ****show. I've never given an anime such a low score before but this anime is just so bloody awful, it beggars belief.\r\nDisclaimer: I have only watched the anime, I have no idea about the original source that led to this adaptation and have no interest in it. Also, TL;DR at the end.\r\nThe two things that bury this anime are, by far, the story (if one could even call it that) and the characters. I won't bother writing different sections to grade each thing separately, it's pointless, so I'll just whine aboutthe two worst things, ye've been warned.\\n\\n\r\nThe story is just atrocious. Even without knowing the original source, I can see that this needed A LOT more episodes than 12. Everything is jumbled together in such a nonsensical way that when the music ramps up for the \"ta-daaaaaaaaa, plot twist!\" moment I only felt extremely confused because I didn't know what the hell I was supposed to think. The gist of it is time travel, I guess. The amoeba and only man on the island thinks he travelled back through time to...there, I don't know. At one time I thought it was to save his daughter (that he very much felt like shagging when he didn't know she was his daughter, obviously) and at another time it felt like he needed to fix the problems that would lead to the future.\\n\r\nBUT NO! In the end, it was only about him ******* his old love, because the time machine isn't a time machine, it's a time stopping machine, whoever goes in has their time halted while the rest of the world keeps going on, and yet the island is still THE SAME, where all things happen the same bloody way in a continuous loop. This is so bloody retarded that I feel like my lowly IQ got shot a few points down just by trying to think about it again.\\n\r\nStory is a guy who flirts with 3 different girls, one of which his daughter, only to eventually marry his original girlfriend who of course used another time stopping machine (which conveniently awoke her a couple decades before him). That's it. It's atrociously stupid.\\n\\n\r\nCharacters. Oh boy. The thing I noticed the most is how death is treated here. A girl finds out her mother died and will you look at that, 5 seconds later and a quick transition is enough for her to be as cheerful as she was. And it's not the \"oh I act cheerful but I'm so sad inside\" kind of thing, she was LITERALLY as cheerful as before finding out her long lost mother had died.\\n\r\nThe rest of the characters are useless. Pointless. Inconsequential. There is a miko whose only reason to exist is that her...future self, great great nephew, what-the-****-ever, has huuuuge oppai while she's as flat as an ironing board. That's it. Then there's the rebellious girl who treats her mother's passing like the death of an ant and whose only purpose is to lead the protagonist to another \"time machine\".\\n\r\nThen the two main ones. ****able daughter Rinne and only guy in the anime, known as Setsuna. Rinne is boring. I'd rather watch paint dry than having to listen to anything her character says. She has no personality, she just wants to shag Setsuna cos she feels so lonely and blahblahblah you get the point.\\n\r\nSetsuna himself is just \"oh I have to help everyone and I have to save Rinne because oh I don't know, what's this feeling BLAAAAAHHHHHHHHH\" ffs, I can't be bothered. He's an idiot, with no traits other than the I'llsaveeveryonecosI'mthehero one, he's not charming, he's not funny, he's not intelligent, he's not witty, he's the human equivalent of a room painted eggshell.\\n\\n\r\nTL;DR I regret every single minute I spent watching this ****show. Please be smarter than me and DON'T waste your precious time with this sodding disaster of an anime.",
            "date": "2018-09-18T00:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 289293,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 4,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 4,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Kurgo",
                "username": "Kurgo"
            },
            "url": "https://myanimelist.net/reviews.php?id=289293"
        },
        {
            "content": "Although visual novel is very hard to make into an anime, however, this anime is the does not even match to the original story. There is a lot of changes in the story (For example Rinne just scared of going out in day time in the original story, but in anime it becomes that she will die if the sun shine on her) and the main character is really annoying in the anime. Strongly agree to read the visual novel as the story is great. Visual novel story is complicated to understand, but it is all worth it to spend 30hr on it. Anime 3/10,Visual novel 10/10.",
            "date": "2018-08-18T12:29:00+00:00",
            "helpful_count": 5,
            "mal_id": 286810,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5921721.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/_FainT",
                "username": "_FainT"
            },
            "url": "https://myanimelist.net/reviews.php?id=286810"
        },
        {
            "content": "A naked guy on a beach with amnesia wakes up with a girl laying face down on his dick. This is the first scene of Island, a show airing this summer anime 2018 season. Labeled as a drama sci fi show, Island takes place on an island that is isolated by the rest of the world. Bound by its old traditions, the island has its own social structure, which consists of their three families basically acting as major political figures on the island. Recently, the island has been under some distress and the families are under suspicion. These odd circumstances can only be solved bythe daughters of the three families, named Rinne Karen, and Sara, and by a mysterious man that washes up on the beach devoid of all memories. Except the fact that he is named Setsuna.\\n\\n\r\n\tThis show is quite obviously a visual novel. It has three girls, and a protagonist that looks generic as have the watcher imprint themselves on them, and a story that clearly shows all of the girl’s story options. Now me myself haven’t played or seen any gameplay of the game, but with basic visual novel tropes I can guess some things about the anime based on that. So the anime tried to adapt all of the endings and make it flow into a cohesive story. I feel as though this backfired though, because it feels suddenly split from one girl’s storyline to the next one, which made things more confusing for me. And it doesn’t help either that Sara and Karen’s story ended before the 6 or 7 episode mark. I guess in this visual novel there is a very specific girl you were meant to follow, and they tried to make the majority of the show about that. That in and of itself isn’t bad, but it feels like the other two stories were rushed. Especially with Sara’s story, where the revelation and the twist happened literally in the span of 10 minutes. It was resolved as soon as they knew what the problem was. And after both their stories were finished, they were forced to the sidelines almost immediately, now acting as side or even filler characters to react to what they protagonist and Rinne does.\\n\\n\r\n\tIts mentioned in the synopsis that the island is cut off from the rest of the world, which suggests a more tropical, deserted island feeling. But, this isn’t the case at all, and is pretty industrialized for what it claims to be. It seems to be receiving manufactured goods, so the only way its cut off is that the families won’t let anybody enter or leave. Another issue is with the genre tags used for this show. The first half of the show doesn’t have anything to do with sci fi at all. Even some of the middle episode after that only hint at some ancient technology before we get hit all at once during the last 4 or so episodes. Before that its a slice of life drama with a piece of mystery through and through. \\n\\n\r\n\tThe characters in this show represent your basic girl tropes in anime. Karen is the blond hair tsundere who is the daughter of the family that currently runs things. Sara is a shrine girl loli that works really hard to compensate for her family that has gone off the map in terms of politics. And Rinne is the main girl which has the most backstory and development behind her. The protagonist I already touched on as being your typical anime protagonist. I can’t say the any of them are good characters. There are always leaps in logic and stuff that should have been obvious, but wasn’t. It doesn’t go far beyond in accordance to their personalities. They’re mostly carried by their stories.\\n\\n\r\n\tIsland’s story is confusing, rushed, and boring. The first 6 episodes were very very slow, almost completely ignoring the sci fi tag. And even when they did go into the mystery more, I just ended up not caring for anything they were showing me. Or in this case, telling me. Maybe if this show was more then one cour or season, they would have had the time to flesh out the stories of each character more. I feel like they stories they presented were genuinely interesting, but it was just presented in such a way to the point where it became a snooze fest full of characters I don’t care about.\\n\\n\r\n\tThe art in this show is below average. In terms of both character art as well as background art. On a tropical island, you were expect to get long shots of beautiful beaches or some pretty pictures of some of the scenery you would see. Island has that, but they don’t look good in the slightest. If the show takes place in a setting where it's supposed to be bright sunny and beautiful, I would assume you would spend more of the budget on its art. This show’s animation is also sub par. Its very stiff and it doesn’t do much extra when it comes to its “action” scenes. It's not on the lowest tier of animation I’ve seen, but it's enough to notice that something is wrong here.\\n\\n\r\n\tIsland, for me, felt like it had more to say. But its short run time made it feel like they didn’t get enough stuff into it as they would’ve liked. Anyway, the end result is a bad show all around. I recommend this to someone who wouldn’t mind waiting for a while to watch a only decent sci fi mystery. Maybe someone else can appreciate Island more than I could. I give this show a 3 out of 10. This has been PixEFit’s spoiler free, but not really anime review on Island.\\n",
            "date": "2018-09-18T21:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 289380,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6467665.jpg",
                "scores": {
                    "animation": 2,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PixEFit",
                "username": "PixEFit"
            },
            "url": "https://myanimelist.net/reviews.php?id=289380"
        },
        {
            "content": "My experience with this anime that is... ALLEGEDLY a VN adaptation can be summarized in one word: \"...what?\"\r\nAt least once, I found myself going back to the info page to make sure this was indeed the VN adaptation I was following this season, because it suffers from an issue I've never seen before in a VN adaptation (and I've seen plenty of subpar VN anime): every week, it felt like they were making it up as they went along. I'm not sure who's at fault for this, actually; whether the anime team didn't do a proper job explaining everything or the VN itself didn't dothat, but either way, I, the viewer, was left scratching my head.\\n\\n\r\nThe cause of all this confusion is that most ill-defined and whatever-they-want-it-to-be of plot devices, time travel. I recall something in the earlier episodes about one of the leads thinking they were from the past or something and one thinking they were from the future, then some side characters (who ultimately proved to be irrelevant) were given arcs lasting a couple episodes each, some of whom were convinced they were or had to become time travelers themselves, then they took away the protagonist's memory a second time or something and had him time travel again and suddenly the setting was totally different for just two episodes, and then the final episode with its final twists that feel like they thought them up in the week beforehand got even more ridiculous and I've given up trying to follow the order of events.\\n\\n\r\nI was so clocked out trying to follow the plot, I had actually dropped it by episode 11. At the time, I was thinking the plot still made so little sense that they'd be making something like 16 total episodes to properly resolve everything in a way that made sense. It wasn't until I found out it suddenly ended at just 12 that I decided to watch that final episode. That final episode, I can summarize the same way I'd summarize this whole series: while it kind of has good character moments, I'm too busy not understanding what's going on to feel anything.",
            "date": "2018-09-17T09:34:00+00:00",
            "helpful_count": 4,
            "mal_id": 289246,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2562145.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Megamean09",
                "username": "Megamean09"
            },
            "url": "https://myanimelist.net/reviews.php?id=289246"
        },
        {
            "content": "The Island anime is sort of like traveling nomads. A group of people who just travel around aimlessly without a fixated habitation. The problem with this sort of skeleton is that the anime just turns into a “master of none” type of scenario. Trying to incorporate all these different plot points and different tropes and it ends up just falling flat on its ass. Island has a cool time traveling thing it has going on, but it fails to develop it properly. Having very vague rules and up until the later episodes, activating when the plot demands it. It then just info dumps on you.Expecting the viewer to understand or even care at that point.  It has a cast that has interesting backstories that connects back to the island, but instead of properly fleshing out its characters, it feels like a hentai. Just one-dimensional tropey characters that essentially want to bone the MC. Having an Island setting is somewhat interesting, but it has too much editing in post that makes the art look artificial and boring to look at instead of something natural. The one redeeming this is the music, but that only goes so far in your tolerance of what you can take on the BS happening in this anime.  Having all of these things would make you have an average anime. However, what makes it very much below average is that fact that it constantly disappoints the viewer on all fronts. It isn’t good at anything that it's trying to be and culminated into a massive mess that I can’t recommend to anyone. It fails at being a thriller. It fails at being an ecchi visual novel. It fails at being a compelling character story and it fails at looking good. It fails on all fronts.",
            "date": "2018-09-16T11:21:00+00:00",
            "helpful_count": 4,
            "mal_id": 289178,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5340907.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Immovable_Object",
                "username": "Immovable_Object"
            },
            "url": "https://myanimelist.net/reviews.php?id=289178"
        },
        {
            "content": "The show is full of slice of life style writing despite being marketed as a mystery sci-fi drama. There's also a lot of fan service which sometimes leaves me giggling but other times seems too unoriginal or forced.\r\nAs of 5 episodes, we're nowhere near a conclusion and every episode takes the narrative in a completely different direction, leaving me unsure on whether or not this show is going to answer the questions I had from episode one, let alone the abundance of questions that each consecutive episode creates.\r\nHowever, the show is still enjoyable to consume on a weekly basis since the characters aren't too insufferableso if that's the kind of show you're looking for, you should at least try this show out.",
            "date": "2018-07-29T17:30:00+00:00",
            "helpful_count": 4,
            "mal_id": 285112,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5875633.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/TooFiveFive",
                "username": "TooFiveFive"
            },
            "url": "https://myanimelist.net/reviews.php?id=285112"
        },
        {
            "content": "Although as you already noticed most of the reviews are very negative towards this anime I want to be more neutral.\r\nWatching \"Island\" may not be for everyone since it's story is trying to confuse you but overall I believe It's very cool \"mystery\" anime. Ever since you jump into this anime you will experience good animation and very fitting sounds. To be fair it may also make you a little uncomfortable but if you can deal with that feeling, why not try it ?\r\nOverall I would recommend this anime for everyone who has free time to spare and likes mysteries like in Hyouka :)\r\nDon't expecttoo much but it's certainly not bad and some people may even love the story... \\n\\n\r\nI watched 4 episodes so I'm not sure what brings us the ending so my opinion might change.",
            "date": "2018-07-24T07:57:00+00:00",
            "helpful_count": 4,
            "mal_id": 284672,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7102051.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zapole",
                "username": "zapole"
            },
            "url": "https://myanimelist.net/reviews.php?id=284672"
        },
        {
            "content": "Short and quick review:\r\nAh here we go again, every season we find ourselves in this situation where an anime so mediocre with chracters so flat and bland that makes you wonder if you are ever going to see a SOL/romance/harem VN adaptation that doesn't suck.\r\nI assure you, you have indeed watched Island before, but you just can't remember when and where, pretty much like the MC in this anime, he just can't seem to remember how many girls he has slept with, just flashbacks. Sad indeed.\r\nIf you've watched any other mediocre trash of an anime, then rest assured that this one is no different, I'vewatched enough anime of this sorts to safely say that this anime is not worth your time, unless you wish to see an MC which is slightly better then most other harem anime MCs, then by all means go ahead, but you'll soon be disappointed by how generic each of the main heroine is\\n\\n\r\nSpoilers ahead: \\n\\n\r\nOne of the female characters said 'Mess me up' by the end of Episode 3 to the MC and I see this as doing a great disservice to an anime that is already pathetic to the point where I just ended up dropping it 4 episodes in. Reason being, it doesn't do anything but to have the audience stay and keep watching.\\n\\n\r\nA good anime or rather any good story should make the audience understand what's going on as soon as the first episode ends. Sure, you may argue that great animes as such Steins Gate had a confusing start. However, what seperates Steins Gate from this anime in particular is that while waiting for the mystery to clear, we have interesting characters to indulge in and also we get a gist of what's going on by the hints littered in each episode, thus allowing us to formulate our own reasoning as to what is going on. \\n\\n\r\nBut with Island, you get a mystery anime that quickly turned into a SOL anime that has no obvious direction, no idea what it is doing and even the chracters just felt like it's there for some reason. Even after 4 episodes the anime has not clarified a lot of things and instead spends time developing the mysterious air around Rinne, one of the main heroine, which is not doing much to help an absolute trainwreck of the anime since developing one dimensional chracters gets you nowhere\\n\\n\r\nAll in all, there are better alternatives this season, this is just not worth your time if you're looking for a harem, SOL anime",
            "date": "2018-07-23T17:17:00+00:00",
            "helpful_count": 4,
            "mal_id": 284615,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Horatiomaxx",
                "username": "Horatiomaxx"
            },
            "url": "https://myanimelist.net/reviews.php?id=284615"
        },
        {
            "content": "I’m just going to cut right to the chase, as this isn’t a review, but rather a suggestion to everyone who is either interested in watching Island, or is a player of the visual novel who wants to see how the show stacks up to the source material.\r\nAll I can say is, please don’t waste your time on this.\r\nAs for anime-only’s, please play the visual novel instead. The visual novel is one of the best I’ve read in quite a while, and it’s definitely worth playing for it’s 30-50 hour length. And if you’ve seen or played The Fruit of Grisaia, the game is madeby the same exact people, so go for it!\\n\\n\r\nAs for the group of people (including myself) who have either watched a playthrough or have read the entirety of Island, the anime doesn’t do it justice. Comparing it to the visual novel isn’t even necessary, as comparing the visual novel to the anime adaptation is the same at putting a diamond ring next to a trash can, and playing ‘spot the difference’.\\n\\n\r\nWhether you’re an anime-only or a fan of the original source material, just don’t waste your time watching the anime adaptation. The visual novel will leave much more of a lasting impression on you them the anime ever would.\\n\\n\r\nThe visuals may look nice, but in the end it’s a piss-poor adaptation of an excellent visual novel.\\n\\n",
            "date": "2018-10-02T08:14:00+00:00",
            "helpful_count": 3,
            "mal_id": 290711,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5813043.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/calamariqueen",
                "username": "calamariqueen"
            },
            "url": "https://myanimelist.net/reviews.php?id=290711"
        },
        {
            "content": "I was supposed to drop, but I'm glad I stuck with is the ending is awesome, ties the plot threads pretty neatly. \r\nDo not expect much from the first 4 episodes. Its gets slightly better during episode 5 then it gets more confusing. In episode 9 it gets better and better, then episode 11 comes around where they fix the problems of the first episode unitil episode 8. \r\nThe final episode ties the plot points of the series pretty well I say but the road to its awesome ending is messy.\r\nIn conclusion I don't know how to feel about this show. Awesome ending messy earlyplot. Awesome Ending.",
            "date": "2018-09-23T04:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 289751,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6952777.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/PhiNic",
                "username": "PhiNic"
            },
            "url": "https://myanimelist.net/reviews.php?id=289751"
        },
        {
            "content": "TL;DR: An anime that barely connects its mysteries to develop a romance\r\nWhile Island is trying to be one of the remarkable romance, mystery anime, the outcomes are pretty unsatisfactory, as it barely connects the mysteries around and develops a romance story. I would say Island is an average show, but can't be considered as a masterpiece, as it can have a better story presentation, rather than things I just saw in the anime.\r\n+Kinda dense mystery elements \r\n+It can be considered as a complete story at the end\r\n+Colourful animation\r\n+The bond between main protagonists is presented \r\n+Usage of soundtrack and music are pretty cool \r\n-Bland characters, especiallyfor side characters\\n\r\n-Strange story pace\\n\r\n-The characters designs are pretty much similar\\n\\n\r\nTo begin with, people considered Island as a fan-service anime, but at the end, you'll be shocked or confused to realise that it's not really the case, as at the end, you will need to figure out the mysteries settled by the settings and most likely you may need to compare the story differences and try to figure what Island is trying to present. I think most people who watch Island in seasonal would have this kind of issue, as the story pace is rather strange and may suddenly have plot elements that you wouldn't expect and may even misunderstanding the ideas of Island, like considering it is just a harem anime or a fan-service anime.I could understand why people think like that, as at first, Island is really like a fan-service anime with many unnecessary fan-service or comedy elements. This is a really common error in most anime that they should present the story in a better way, rather than just rush it at the end, anime fans wouldn't be impressed even the ending is a good ending or bad ending, as in general the story is really feeling bland and the characters are easily forgettable.\\n\\n\r\nSpeaking of anime characters, although Island tries to focus on the bond between Rinne and Setsuna at first, the efforts are ruined because of the plot twists. This is kinda strange to say that because plot twists usually contribute well to the story, but in fact plot twists are too late to be developed and there's not much character development because of the poor story presentation, like the strange story pace in this anime. Side characters like Karen and Sara are even more bland because in Island, it's either they're acting like a harem character or it just a minor character that barely contribute to the plot and at the end, I don't really know what the side characters are doing to be honest, they're just really bland and lame.\\n\\n\r\nIn a nutshell, Island is really trying to bring out a refreshing romance mystery anime, together with the desire that the main characters want to love each other with a few plot twists, but turns out pretty bad due to a poor story presentation. It's really disappointing that with such great potential, Island could be a great visual novel adaptation, but it ends up like important plot elements are packed and rushed at the end and fan-service is placed in the beginning, like a harem anime.\\n\\n\r\nAt the end, let's talk about the animation and sound usage. Well, Island does have kinda good animation, like the visuals used in the Island, the sunlight reflected on the clear sea water, but the character designs are looking too similar, same eye and face shape for female characters, they just change the hairstyle and the colours, others are looking the same if you realise that. Great and nice opening and ending songs, soundtracks and background music are used pretty well, they're kinda fit into the atmosphere. Sadly, this is the one only aspect I think Island is doing great.\\n\\n\r\nFor those who are considering to watch this, either you watch other anime or you should consider whether you'd enjoy a dense and packed romance and mystery anime or not.\\n\\n\r\nStory: 5.5/10 (D+) (35%)\\n\r\nAnimation: 7/10 (B) (10%)\\n\r\nSound: 7.5/10 (B+) (10%)\\n\r\nCharacters: 5/10 (D) (25%)\\n\r\nEnjoyment: 6/10 (C) (20%)\\n\r\nOverall rating: 6/10 (C)",
            "date": "2018-09-17T03:08:00+00:00",
            "helpful_count": 3,
            "mal_id": 289230,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5569911.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Swordarc",
                "username": "Swordarc"
            },
            "url": "https://myanimelist.net/reviews.php?id=289230"
        },
        {
            "content": "My review on Island Anime:\r\nThe story was pretty much GOOD on some aspects on there line up of the  Visual novel. It's like watching slow paste game at first, then mystery case on time travel appear. base on episode 1-3. Also episode 4-6 more solving problem island. 8-10 (spoiler) someone die they are trying to save him by going to the future. 11-12 (spoiler) TIME MACHINE it self is not time machine it like a freezing your body to not age at all. Like the story on future-rama show. Any-case they are all SAVE by Rinne alone. That main character didn't do anything atall. To solve the story on the island .Here is my point.\\n\r\nThere is no time travel he just continuous living  1 Million year or etc.\\n\r\nThe theory was endless cycle on life. \\n\\n\\n\r\nstory -\\n\r\nGiving it 8\\n\r\nbecause i love the way author pull up this story.\\n\\n\\n\r\nArt- \\n\r\nGiving it 8\\n\r\nLove the art work and cute girls.\\n\\n\\n\r\nSounds\\n\r\nGiving it 8\\n\r\nI almost cry on ending on that song.\\n\\n\\n\r\nCharacter\\n\r\nGiving it 5\\n\r\nI have MC also there voice quite bad! i mean no emotion at all!\\n\\n\\n\r\nEnjoyment\\n\r\nGiving it 10 (Bias it my review)\\n\r\nI love the  mystery  on solving the Time Machine :)\\n\\n\r\nOVERALL\\n\\n\r\n7.8 round of 8 \\n\\n\r\nGIVING IT 8\\n\\n\\n\\n",
            "date": "2018-09-16T15:36:00+00:00",
            "helpful_count": 3,
            "mal_id": 289201,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/linemare",
                "username": "linemare"
            },
            "url": "https://myanimelist.net/reviews.php?id=289201"
        }
    ],
    [
        {
            "content": "honestly, there isn't a whole lot to say about this anime. it's sorta dull and boring, the story is all over the place and after nine episodes I'm more confused about what the anime actually is about than when I started. \r\nEach episode seems to have a different direction than the last one, it doesn't even seem like there is an underlying story. Honestly, I've watched porn with better stories.\r\nThe art is decent, I've definitely seen better, and definitely much worse *cough* Highschool DxD Hero *cough* It is what you would expect from a mediocre anime in 2018.\r\nThe sound is kinda crappy. It never reallyfelt real when the characters were supposed to sound sad, happy, or any other emotion. It's just dull.\\n\\n\r\nI don't feel like much character development happens, they don't really change, and if they do, it is not enough for me to realize.\\n\\n\r\nThe enjoyment is... enough for me to drag through these nine episodes of mediocre writing. I wouldn't say that it is boring, but if you don't like \"slice of life\" anime then this probably won't be the show for you since neither the mysteries nor the art is good enough on its own to make it watchable.\\n\\n\r\nOverall, I'd say it's just kinda dull, and probably not worth your time, which you could definitely be using on something more productive, like... I dunno, smacking your head against the wall or something. Honestly, this anime isn't worth your watch if it is just for the plot, maybe it is if you watch it for the interactions between the characters, but that is a big maybe.",
            "date": "2018-08-29T09:07:00+00:00",
            "helpful_count": 3,
            "mal_id": 287696,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Mr_Floppy_Donkey",
                "username": "Mr_Floppy_Donkey"
            },
            "url": "https://myanimelist.net/reviews.php?id=287696"
        },
        {
            "content": "I dont know why most all of the member of MAL score this badly\r\nIn my opinion ISLAND have a unique story based on a Romantic, Sadness, and time travel.\r\nin beginning episode you will be find loli and other fucking stuff in it.\r\nbut you must be know that most of all anime have an story introduction. i think most of all anime have story introduction in rage of episode 1 to episode 3 or 4.\r\nin beginning episode you shouldn't skip anything, just stay and watch it until finish. Because you will lose the main story in beginning.\r\nNext to the my score of this anime\r\nSTORY (10/10) :Why i give 10/10? because main story in middle episode to the end of the story have unique atmosphere, that you won't miss any sec on this anime. (REMEMBER YOU SHOULDN'T SKIP THE BEGINNING OF ANIME OR YOU WILL LOSE THE CORE OF THIS ANIME)\\n\r\nART (9/10) : I think all of the art is ok, i didn't see anything wrong in art section\\n\r\nSound (9/10) : I don't know why but i feel the sound of this anime is good enough XD\\n\r\nCharacter (10/10) : For character i think this anime have very good art and animation\\n\r\nEnjoyment (10/10) : I belive if you watch lots of anime you can compare and says this anime is best from other drama anime (in this case anime like grisaia series that have dark story)\\n\r\nOverall I THINK 10/10 is worth\\n\r\ni think this anime will have same or maybe will above the grisaia series anime",
            "date": "2018-11-18T05:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 294288,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5449575.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dhanamerdeka",
                "username": "dhanamerdeka"
            },
            "url": "https://myanimelist.net/reviews.php?id=294288"
        },
        {
            "content": "Do you remember the feel of those boring slow-paced mystery-hentai visual novels? Well that's how this show feels with its boring visual novel pacing, lines and characters. But WOW, you need to bear with it cause the story is just something else. I dropped it by episode 7 and then finished it like a month after, that's how boring and uninspired it was, but now I feel this is one of the best anime of the year. No, I don't put story above all else, in fact I always care more for the characters, voice-acting and artwork more than anything, but Island's story was sogood that even with it being just average in all other categories, the story makes up for it in the last few episodes.\\n\\n\r\nThe bottom line is that certainly it could have been done a lot better, with better pacing and dialogue, but I'm just glad that I've seen it.",
            "date": "2018-10-17T02:13:00+00:00",
            "helpful_count": 2,
            "mal_id": 291932,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/464011.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 6,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Genjurooo",
                "username": "Genjurooo"
            },
            "url": "https://myanimelist.net/reviews.php?id=291932"
        },
        {
            "content": "So, I just finished watching this show and I've got to say. It was definitely a refreshing experience. Unlike typical anime where characters stories are simple and usually revolve around some ancient legend or something like that. This anime goes three steps forward and completely smashes that stereotype by integrating a compelling story with rememberable characters. \r\nWhen mixing those two attributes with a time travel mystery and a romance plot. It only adds to the layers of this show. \r\nBUT\r\nThere were some aspects of the show that weren't enjoyable. An example would be the pacing. Some \"Arcs\" of the show were rushed and weren't reallyplanned out well, and some characters had more potential than others that weren't used as much as I would have liked. \\n\\n\r\nBut overall, this is a solid 8, I wouldn't watch again, but if someone was looking for a mystery/romance/time travel anime. I would mention this as an option.",
            "date": "2018-10-07T22:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 291218,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7417815.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DrTelstra",
                "username": "DrTelstra"
            },
            "url": "https://myanimelist.net/reviews.php?id=291218"
        },
        {
            "content": "This is not a good anime, but what make it worse is the fact it was publicized everywhere, from Crunchyroll to Steam, like it was an incredible masterpiece with superb visuals and NO, it was not.\r\n Island is a mediocre piece of cr*p, the script starts contradicting in THE F*CKING FIRST EPISODE, and continues contradicting over and over. \r\n Plot? Has not. Visuals? Nothing special. Characters? Quite flat. Music? HORRIBLE. Why do they starts randomly singing teen pop songs?\r\n The ONLY THING I liked it was the story of Karen's mother, it was quite enjoyable.\r\n It is not the worst anime I saw, butit disappointed me because it looked like a serious anime in the beggining but chapter after chapter I felt like I was losing neurons watching a non-sense and a mediocre thing.",
            "date": "2018-09-17T15:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 289269,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7048679.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 1,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/mrffranc",
                "username": "mrffranc"
            },
            "url": "https://myanimelist.net/reviews.php?id=289269"
        },
        {
            "content": "\"lol what??\": The Anime.\r\nAs a person who habitually watches trash anime for kicks and giggles, I jumped into Island expecting to laugh at all the wrong things, poke fun at the story, and generally have a blast watching through this summer's overblown soft-core hentai. Problem is, I didn't laugh. Not even at the mind-numbing ecchi scenes. Not even at our self-insert protagonist memeing his way into tight, questionably-aged thighs.\r\nHas it finally happened? Do I not find these types of shows morbidly entertaining anymore? Am I a normie?\r\nTo make sure, I went back and re-watched an episode of Kiss x Sis. No, I still find badecchi animes supremely entertaining. When how come was Island making me more irritated as I watched on? Then I realized it: one of these animes finally did the impossible, and made a story that not only uninteresting, but painful to watch. \\n\\n\r\n[VERY LIGHT SPOILERS (though idk why you would care)]\\n\\n\r\nStory:\\n\\n\r\n\"This stupid anime makes no goddamn sense\" ~one guy in the comments section of Episode 7\\n\\n\r\nIsland is about a young man who mysteriously washes up on a small, populated island, beached with only his wits and his alarmingly long, protagonist schlong to aid him. Cool. Within 30 seconds of the very first episode, one of the main heroines finds him, and promptly trips and falls face-first on his freshly-washed balls. While I greatly appreciated the big laugh I got from that scene, I realized rather quickly that the breakneck speed that episode 1 took would a be trend that would be this anime's ultimate failure as a half-way coherent story. The studio who developed the story board for Island thought that it would be a fantastic idea to cram 10000000000000+ arcs into a 12 episode time frame. Stop it. Don't do this. You're only confusing the audience.\\n\\n\r\nWhich brings me to my main gripe with this series: the story doesn't make sense in Island. To an infuriating extent. And to make matters worse, they shove this really bad time-travelling BS plot device down your throat, that never is fleshed out. I expected absolutely nothing from this garbage, and still left somehow disappointed.\\n\\n\r\nFar be it for me to judge the plot of something I knew from the start was going to be retarded, but damn, stop trying to build the plot and throw a titty or two up on the screen, Island!\\n\\n\r\nCharacters:\\n\\n\r\nAt least the cast is small, thank god. You got four people:\\n\\n\r\nSetsuna, the protagonist of this story. There's nothing to say about this guy, because he's a self-insert for basement dwellers. Nice when he needs to be, happy-go-lucky when appropriate, and absolutely useless when the plot needs to be dragged on. When one of the girls hits the protagonist with that classic \"You're so nice\" line, you already know he's got nothing going for him.\\n\\n\r\nRinne, the main heroine of the story. She's 17 years old ( ͡° ͜ʖ ͡°), physically 23 ( ͡◉ ͜ʖ ͡◉),  and lives with her recluse mom in a massive house. Your typical VN main girl waifu that has a mysterious background and a big problem that tied to everything else in the story.\\n\\n\r\nKaren, the other girl. She's a 17 year old tsundere with daddy issues and an adventurous soul. Wants to leave the island. Oh, and she fell face-first into the protagonists nuts that one episode. Good times.\\n\\n\r\nSara, the third wheel. She's the loli of this dream-team cast. I actually don't really know what's up with her (the anime decides not to really deal with her lol), but her hair bothers me so I kind of just focus on that when she's on screen.\\n\\n\r\nSound:\\n\\n\r\nIndustry-standard. Opening and ending forgettable. All other sounds in this series are nothing to complain about--they're either too unexceptional to notice, or quite well-designed.\\n\\n\r\nAnimation:\\n\\n\r\nSlightly above average. The girls are cute enough. The art style is uninspired and bland. Some series creators would kill for an animation budget like this though, so hey.\\n\\n\r\nEnjoyment:\\n\\n\r\nHaha.\\n\\n\r\nTL;DR: 2/10. This ain't it, chief.",
            "date": "2018-09-16T20:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 289214,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7307744.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 7,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/fuck_bryan",
                "username": "fuck_bryan"
            },
            "url": "https://myanimelist.net/reviews.php?id=289214"
        },
        {
            "content": "Very happy ending! Had some twists at the ending, unlike other anime you see now a days. If you want to watch a loli harem, I'd definitely recommend this to you. It felt kind of like a musical with all the singing, but it tied in nice with the plot. Let's just say the protagonist ISN'T beta like most other anime MCs. So points for that. Some questions left unanswered like about him having to do some things to people (it's in ep1, vague for no spoilers), but other than that pretty good drama and romance watch! My favorite characterwas Rinne AYY LMAO",
            "date": "2018-09-16T12:03:00+00:00",
            "helpful_count": 2,
            "mal_id": 289184,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7401827.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 8,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Omfganimal",
                "username": "Omfganimal"
            },
            "url": "https://myanimelist.net/reviews.php?id=289184"
        },
        {
            "content": "Let's start saying this is an anime adaptation of a visual novel released 28th april 2016 for japan while for english language it was released 24th august 2018 on steam (about 2 months later the airing of the first anime episode).\r\nKey tags: Novel Adaptation, Time Travel, Love Story, Drama, No Harem\r\nThe plot is kinda \"complicated\" and I saw a lot of hate for this anime for being \"confusing\" and with \"boring characters\". While the majority of characters is actually bland, i actually found the plot interesting, so far i also went to play the visual novel because i couldn't bear to wait cliffhangers of eachepisode and trust me when i say you this: the novel is REALLY confusing, with characters making suddens U-turns on their personality making me doubt i was watching other people with the same face; also the \"true ending\" was really...a letdown so i went back watching the anime, and honestly? Damn at least for me it was MUCH better than the novel! But well let's stick to the anime review.\\n\\n\r\nStory - 7.5\\n\r\nI don't get what's so \"confusing\" honestly (aside the overabused use of Setsuna and Rinne as names). This isn't your usual slice of life/comedy anime so the plot is bound to be more complicated and in this case we have also different \"time arcs\". The \"main plot\" itself definitely makes sense, being an adaptation some details are lost in the way but while they weren't that important for the sake of the main plot, the narration goes quite fast at same point and you need to catch up fast what's happening to fully understand the plot. The first half is quite \"easygoing\" but the last half get more interesting the more it goes on and ultimately ends in a good way (far better than the novel, which was very confusing ending).\\n\\n\r\nChararcters - 6.5\\n\r\nWhile the main \"trio\" of girls itself it's actually your usual bland group (tsundere, smart loli, kuudere), the main protagonist is very fun to watch bickering with other characters and there is a \"secret\" character showing up later on which is really a godsend and became the true \"important\" character later on. Overall score around 5 for the main trio but 7.5 for setsuna and special char.\\n\\n\r\nOverall - 7\\n\r\nWhile for sure Island isn't the best anime of the summer season it can definitely hold its ground as good love sci-fi drama anime thanks to an interesting plot and main character which gets better the more the show goes on. If you are fine with these premises you should definitely give it a shot!\\n\\n\r\nIn short: Save the world -> Save the girl!",
            "date": "2018-09-16T11:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 289176,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/153323.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/DakenFrost",
                "username": "DakenFrost"
            },
            "url": "https://myanimelist.net/reviews.php?id=289176"
        },
        {
            "content": "*Warning there are a few spoiler in this review*\r\nI apologise if my review is hard to follow this is mostly due to the fact that I have only reviewed one anime up till now and that I am really bad at giving reviews about anime in general. \r\nTo be honest I am not really sure how I am supposed to rate this show due to its bland and flat character design, as well as its cliché character romance. \r\nWhen I first picked up Island and saw it advertised I thought that it would be great due to the high reviews that I had noticed whenI found out it had a Visual Novel that was used to get the source material for the anime. I was  surprised and it gave me high hopes for the show however that was changed dramatically after only the first episode, this was mostly due to the fact that the opening was a bit random you could say or just plain stupid and the fact that the anime explained nothing about the protagonist except he believes his name is \"Setsuna\" . And not to mention each episode kind of unrvaled a mystery but just made a new one which was even more obscure than the first one and before I knew it I found myself at episode 11 and I realised that this show just doesn't live up to the Visual Novel that was released back in 2016 for PC and Soon PS4.  \\n",
            "date": "2018-09-11T00:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 288733,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6931580.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Kevin_Leafy",
                "username": "Kevin_Leafy"
            },
            "url": "https://myanimelist.net/reviews.php?id=288733"
        },
        {
            "content": "Ok this series made me sleep a few times I'm not lying its a bit boring and the characters are hmmm well let's just say not terrible but kinda bland, the mystery factor in this series did get me interested and the visuals is pretty damn cool, the animation is so clean and the colours and character design is pretty beautiful I also like the Japanese voice actors they are good. Overall this series to watch on a rainy day when you can't really go out and you are stuck at home but I'd say wait till it's finished airing to marathon it in onego.\\n\r\nBut if you are asking if this series rivals the legends before it like stein's gate etc no it can not rival it",
            "date": "2018-08-16T14:06:00+00:00",
            "helpful_count": 2,
            "mal_id": 286633,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4671068.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kiriikun",
                "username": "Kiriikun"
            },
            "url": "https://myanimelist.net/reviews.php?id=286633"
        },
        {
            "content": "Story\r\nIs there even a story. Is this not just a show for loli lovers to enjoy. There is just no purpose of this show no mater how hard they try.The plot was set in the first episode and the progress made in the next episodes are pointless.\r\nArt\r\nThe art is a relatively redeeming factor to this complete mess of a show. At least some scenes look somewhat pleasing to the eyes.\r\nSound\r\nI will give them a 3 on sound just because they had it. Not much to say, but there is sound. Nothing exceptional is done here. It's what is expected out of any anime.\r\nCharacter\r\nThe characters areawful. The MC is lost out of his mind and each girl has a quirk that makes them intolerable.\\n\\n\r\nEnjoyment\\n\r\nThe fact that I watched at least 3 episodes warrants a higher score than 1. I was hopeful for development, but I didn't receive any which is why I dropped this show.\\n\\n\r\nOverall\\n\r\nIf you like loli's watch it I guess",
            "date": "2018-08-15T02:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 286528,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5971755.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 3,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/BabyChiem",
                "username": "BabyChiem"
            },
            "url": "https://myanimelist.net/reviews.php?id=286528"
        },
        {
            "content": "I don't know why people hated this show. I watched it, laughed, cried, laughed some more.... It was a very good show, i watched it without any remorse or regret.\r\nThe story lacked some stuff. but otherwise it was music to my heart. I saw people hating it... but because im not the KIND of person who cares about opinions, i really must say that i enjoyed it. the time travel part and theories they called gave me an headache tho.\r\nThe characters were not so... memorable, but they played their parts, as they should, they had some story behind, nothing bad.\r\nIn the end, i gave thisa fat 10, and i have every intention of keeping it that way.",
            "date": "2019-05-01T19:10:00+00:00",
            "helpful_count": 1,
            "mal_id": 307601,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6305276.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/KimuraTheHatoru",
                "username": "KimuraTheHatoru"
            },
            "url": "https://myanimelist.net/reviews.php?id=307601"
        },
        {
            "content": "So many bad reviews from people who mainly expected something else... I rate it 7 aka above average. Island is a story that takes some time to build up but unravels in a dynamic second half.\r\nThis show has a plot that puts to shame so many \"great\" and recognized anime. While the first half, episodes 3-7, are indeed too slow, they are not uninteresting, with a few redeeming, unexpected plot points, and I had a good time watching them on speed x2. The rest however makes you will make you glad you waited. No spoilers!\r\nCharacters are flat, that I will admit. Breaking news : characterdevelopment isn't the only way to make a show interesting. You have so many shows where the only sort of story to be found is the emotional development of everyone involved. Here in Island, characters are functional. They exist to serve a plot worth watching.\\n\r\nArt and music, while not particularly memorable, fulfill their role well enough. The designs are cliché yet sober enough that you won't give them more thought that need be.",
            "date": "2018-12-17T06:34:00+00:00",
            "helpful_count": 1,
            "mal_id": 295962,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 4,
                    "enjoyment": 6,
                    "overall": 7,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/gargagaga",
                "username": "gargagaga"
            },
            "url": "https://myanimelist.net/reviews.php?id=295962"
        },
        {
            "content": "I don't understand why many people hate this show. At first I had no expectations of it, however that changed when I watched it. The twists that are set in the story is a favorite. Only a few anime  are ones that i consider my favorite and this one slipped in to that list. \r\nThe characters are another thing, they are are greatly drawn characters with the feel of caressing them. Even though, for some reason, the female mc's are meant to be high schoolers  yet look like middle schoolers. It fits into the story line with the male mc being able tohold them tight within his arms, which many fantasize about, and which is perfectly normal for an anime watcher.\\n\r\nNow; end of discussion",
            "date": "2018-11-04T10:14:00+00:00",
            "helpful_count": 1,
            "mal_id": 293337,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AzureusWind02",
                "username": "AzureusWind02"
            },
            "url": "https://myanimelist.net/reviews.php?id=293337"
        },
        {
            "content": "I've had high expectations when I started this anime,expecting this to be the biggest show of 2018,I was clearly mistaken.The anime starts off with a fairly good introduction,introducing us to the cast and the mystery of the show,this is important to note later down the review.I would say that this anime is getting too much hate,its a fairly meh anime,but definitely not deserving of being torn apart,we have a top contender for that already.(Clue:The new isekai harem anime)\r\nI will like to tackle the art and sound of the anime first.It is of fairly good quality combined with what I believe are the powerful soundtrack ofthe source material itself.The art and sound are definitely of high quality,but it is the strongest point of the show.This is only the icing to the cake and we would still need the cake to taste good.\\n\\n\r\nThis is a problem when we discuss the story and the characters.Let's start off with the characters.This is actually fairly simple to analyse as we have our protagonist Setsuna who is interesting at first but was turned into a boring harem protagonist after the introduction section,ep 2.Next, we have Karen, not too much to say here considering her relevance to the story,typical clumsy tsundere.At least her arc is pretty good to be fair.After that,we have our loli of a loli Sara,a funny and slightly obsess with myths and time travelling,however,she also is irrelevant to the story.Lastly,we have our main girl,or so we thought,Rinne,another tsundere who is absolutely obsessed with \"her setsuna\",pretty boring of a character but is important to the story.\\n\\n\r\nLet us move on to the juicy part,the story,which is also the worst aspect of the show.The story starts off by creating an intense atmosphere over the mystery of our setsuna.The story then tries to pull off a similar stunt from Steins Gate by putting casual slice of life events in the first few episodes to get us attached to the characters,which failed miserably due to how rushed and awkward the interactions are.We would then time skip to Rinne's supposed death which forced Setsuna to \"time-freeze\" his body,kind of like cryogenics.He then wakes up in the future and met Rinne 2.0,which is a product of all anime characters look alike.This future arc is EXTREMELY rushed with only 2 episodes and little development for any of the characters,this tremendously hurt the story as this anime is heavily reliant on its character.Setsuna would go back in time to save the world,oh wait nope.He just hooks up Rinne 2.0 of legal age who also went through cryogenics and became Rinne's father.In other words,he almost married his own daughter and start an incest.The whole problem with this ending is,the apocalyptic future is still assured,nothing has changed,the world will still perish,which would mean that the whole mystery mentioned in paragraph 1 is pretty useless.We spent the whole 12 episodes of this anime hoping for Setsuna to do something relevant to the \"mystery\",not just marry Rinne 2.0.This story is extremely unsatisfactory due to poor timing and throwing the entire plot out of the window in the last episode.\\n\\n\r\nAll in all,I did expect Island to be a disaster if it only has 12 episodes,which it did.I was hoping that the series could save itself since it is produce with rather high quality judging from the art and soundtrack.However,at the end of the day,the story and characters of the anime are still important to consider,causing Island to be a mediocre anime,which is extremely pitiful due to its potential to be a great anime.",
            "date": "2018-09-17T05:58:00+00:00",
            "helpful_count": 1,
            "mal_id": 289236,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7141130.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/AngeVGC",
                "username": "AngeVGC"
            },
            "url": "https://myanimelist.net/reviews.php?id=289236"
        },
        {
            "content": "Whatever any says that this anime is bad, are lies. They didn't finish the anime yet so they can't say anything. Maybe it is a bit bad at first but you start to enjoy in the later episodes. So, go give this anime a try.\r\nThe opening and the songs in the anime are really beautiful and that maybe one reason for you to watch it. (so trying hard not to put spoilers) Don't judge a anime by its few episodes people who wrote reviews without finishing the anime first!\r\nI didn't get the anime at first but I began liking it when it came to episode3 or 5. Island is a really good anime and I recommend you watch it.",
            "date": "2018-09-16T21:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 289216,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6805838.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Rachel751",
                "username": "Rachel751"
            },
            "url": "https://myanimelist.net/reviews.php?id=289216"
        },
        {
            "content": "Wow. This is my mini review and final thoughts after watching the last episode (SPOILERS):\r\nFirstly, the mother fucking plot twist! Now, while it made me almost physically want to vomit considering Rinne loved Setsuna as a lover, not a father, it still caught me by surprise so well done.\r\nHowever, it begs to the question: was the whole Rinne, Setsuna time travel bait switch really neeccesary?\r\nNever Island has some unresolved plot points: Weren’t Setsuna going to save future Karen and Sara? What about all the untagged? The world going to shit? Does NI not matter now that Setsuna and Rinne got their happy ever after? Whatabout the cave? Who built it? Because it’s clearly functional even till NI. Why is time looping? How did future Sara time travel in the beginning? The story around NI is rushed and should have been expanded on\\n\\n\r\nRinne’s 180° towards her feelings for Setsuna was unrealistic. After watching her for so many episodes and seeing how deeply she feel in love with him, to sitting on a beach and then accepting Setsuna and Kuon are supposed to be together came across as forced.\\n\\n\r\nKuon just feels like a self-insert love interest and a massive fuck you to Rinne fans. Kuon may have been introduced at the beginning, but she barely had anything to do with the story. It isn’t till we’re 3/4 way in with NI do we actually learn about future Kuon and her relationship with Setsuna. However, their relationship lacked development and is massively overshadowed by Setsuna x Rinne, so seeing Setsuna and Kuon kiss, get married and live happily ever after feels cheap. This is the problem when a show opts out of shipping the main girl with another.\\n\\n\r\nSpeaking of Kuon, what was the time chamber she slept in and how did she find it?? How is she not affected by the soot blight syndrome anymore or was that all a lie? And what kind of sick person would let her daughter fall in love with her father because he didn’t recognise her? Setsuna had no memory and Rinne looks identical to her, you can’t blame him in this circumstance.\\n\\n\r\nIsland had the potential to be a good time travel alternative for Steins; Gate, but ultimately failed. It has a good concept with some interesting mystery, time travel and plot twists. However, the poor direction, execution, skipped content and unresolved plot points made it confusing and brings it down. Also, the pacing is a mess, there’s a lot of boring episodes, annoying exposition and there’s more plot holes than Swiss cheese.\\n\\n\r\nThe characters weren’t that well written. Karen and Sara in particular just felt like 2 dimensional, character archetypes. Setsuna is pretty bland throughout the series. Rinne’s probably my favourite, but her love fixation on Setsuna at times was off putting\\n\\n\r\nThe osts are alright. I do like the song Rinne sings, but hearing it so many times started to irrate me so I skipped it. Opening was forgettable \\n\\n\r\nThe animation was average.\\n\\n\r\nStory: 4\\n\r\nCharacters: 5\\n\r\nMusic: 4\\n\r\nAnimation:4\\n\r\nEnjoyment: 5\\n\\n\r\nIsland gets a 3-4/10 from me.",
            "date": "2018-09-16T11:38:00+00:00",
            "helpful_count": 1,
            "mal_id": 289180,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 2,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=289180"
        },
        {
            "content": "At beggining, my expectation was to watch an anime that spoke of a mysterious island with a lot of mystery, disappearances, surprises, etc.\r\nThis appeared up to a few times, but overall, they were things that could be predicted, the time travel could have been better explored, the whole subject and mystery could have taken a better approach.\r\n   Even so, I who do not know the original material, I was able to ignore some loopholes and enjoy the entertainment that the anime is able to offer, the animation that in some scenes is very beautiful, and in some parts and history,\r\n  It's not the WORST ANIMEELABORATED OF THE WORLD, but it's a cool anime to watch, a little fun at the least.\\n\r\n  Most of the time, the critics cling so much to the technical side, that they start to see the anime technically and forget that it is an entertainment material, turning everything into a negative by a gap or something that left something to be desired.",
            "date": "2018-09-05T07:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 288164,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6057150.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 9,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Zeeng",
                "username": "Zeeng"
            },
            "url": "https://myanimelist.net/reviews.php?id=288164"
        },
        {
            "content": "I'll never recommend this anime, it's funny at the beggining but once you watch the 3rd episode you realized that this anime is boring as hell, i don't know the original visual novel story, but i hope it's better than the anime story.\r\nThe characters are pretty cute, i love Rinne a lot, her design is acceptable and everybody on the island looks good, the same thing with the animation.\r\nBut i don't know if i just watched the same episode over and over again because it's the same shit in every fucking episode, i watched episode 7 and was like i just watched the 3rd episodeagain. The same story, Rinne has forgotten her memories, Setsuna doesn't knows who the hell is himself and what he did before he appeared on the island, all the girls wants to fuck him (except the stupid and graceless tsundere).\\n\\n\r\nIn summary, if you want to waste your time go ahead and watch Island, for all of you that wants to see a good anime with an acceptable story go and watch another one instead of Island.",
            "date": "2018-08-13T03:03:00+00:00",
            "helpful_count": 1,
            "mal_id": 286357,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7118581.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AllanDZ",
                "username": "AllanDZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=286357"
        }
    ]
]