[
    [
        {
            "content": "I don’t understand the hate behind this series. Let’s be fair, it’s an ecchi anime, so we should be watching for fun over substance. And if you don’t look too hard, this is actually a pretty good and fun series :)\r\n\r\nArt – 9 points\r\nThe character designs are very well done. First, all the girls are very attractive (pretty, hot, sexy, cute, you name it…) each with unique appearances that match their personalities. Then each girl got individual ninja gears that are splendid top to bottom. From this wide selection of girls, the audience should be able to find a girl that suits their taste justby appearance. I personally found several. :) The major setback in the art is the boobs may have been a little too round and the lack of nipples, but that didn’t really bother me. :)\\n\\n\r\nStory – 7 points\\n\\n\r\nThe story certainly wasn’t one of the best, but it was good enough to develop a course of action and direction. Basically, the light shinobi girls are students of a ninja academy. They train to get the skills  they need while carrying out missions and having their perverted fun. One day, they come in contact with the dark shinobi girls. This begins the series of challenge from the dark side shinobi girls to the light shinobi girls to see who’s stronger. The fights were really good and shows off both side’s rivalry with each other. As the story progresses, there seems to be a bigger evil working in the shadows among the dark shinobi faction.\\n\\n\r\nEcchi – 8 points\\n\\n\r\nThe ecchi was great and perverted in nature. This anime has a lot of boob service and uses the ninja theme well to exploit this. The ecchi was very fun to watch in actuality more so than in the hotness aspect in my opinion. But believe me, some parts do get very hot (……Haruka…..Haruka….) The shinobi girls also have a skill where their gear transforms into swimsuits and you get to see them fight in swimsuits, I thought that was pretty nice. The main complaint you’re gonna get in the ecchi department is probably the lack of guys for perverted stuff. But the spotlight is in the beauty of the girls so it’s alright. :) Besides you got that ninja teacher Kiriya- sensei  who I think is pretty funny and that perverted old gramps. They create the right mood for this anime to go well. :)\\n\r\n\\n\r\nCharacter – 8 points\\n\\n\r\nI think the character department deserves a good score. The word unique would sum it up. This anime managed to create so many girls with unique personalities that things never get dull or repetitive. I was really impressed by how easy it was to distinguish a large cast of girls due to their unique personality. Each girl got their background story that enhances their personality and this combination of personalities in character interaction fleshes out memorable characters (like Yagyuu and Hibari duo). I really liked all the characters, the girls are awesome!\\n\\n\r\nSound – 10 points\\n\\n\r\nThe opening kicks ass and is epic!!!  The endings, both ending 1 and 2 are so good!!! Can’t you guys recognize that? The Ninja BGM was very good too!\\n\\n\r\nEnjoyment – 9 points\\n\\n\r\nI’ve really enjoyed this anime that I’ve gone to write a review for it. It’s by no means a mind blowing anime, but this is a really great ecchi anime. It deserves a solid 9! \\n\\n\r\nThank you so much everyone :)\\n",
            "date": "2013-07-19T01:20:00+00:00",
            "helpful_count": 258,
            "mal_id": 105935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2807721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BenJames",
                "username": "BenJames"
            },
            "url": "https://myanimelist.net/reviews.php?id=105935"
        },
        {
            "content": "The expression \"don't judge a book by it's cover\" is something you should always keep in mind, because occasionally, a show is a lot more than what it's cover suggests.\r\nSenran Kagura is not one of those shows. What you see is what you get, you see ninja girls with big boobs in the cover picture? That's what you'll get. This is a quintessential ecchi action romp, plenty of fan service, serviceable action and characters that are for the most part likable. How well exactly does the show do what it does?\r\nLet's start with an important aspect of the show, the art and animation. On thewhole the animation strong, and surprisingly consistent, the faces and character models are rarely off model, and the action looks fluid, and there is a good use of colour which makes for an enjoyable viewing. The art is weaker, the backgrounds lack detail, to the point where it's rather noticeable, however, for the most part it makes little difference, because rather than the scenery, most of your attention will be drawn to the characters and their assets. Let's not beat about the bush, these characters are all meant to be visually appealing, and the specific pull of this anime is that they all have huge boobs. On the whole I think the character designs work, however a couple of the character designs just look strange with the gigantic boobs attached, but there will be a character design that you like, and at numerous points you will see their bodies in almost all their glory. The character designs are like the music wholly generic, but are good enough to satisfy the needs of the show.\\n\\n\r\nOnto the characters, they are shallow but on the whole likable. You have the standard tropes like the pervert, the Ojou-sama etc. which fulfill their fanservice roles whilst being mostly likable. In the end these characters are really poor and have the depth of a puddle, but they suffice. Obviously, these characters aren't really what you'd expect of trained ninjas, but Senran Kagura doesn't really give a toss about realism, because why should it? There are tons of holes in the plot of this show, but really it doesn't matter, it's not as if it was aiming for high brow entertainment.\\n\\n\r\nThe plot is not exactly spectacular, it's really stupid, cares nothing for sense, logic or proper plot progression. Whilst the fights are entertaining, the ways in which they come about are so stupid, and I often was in disbelief at how blatantly poor the writing was. However, by the end of the show nothing surprises anymore, and so you can wholly accept the anime for what it is, cheap shallow entertainment, funny often for how poor it is in areas. In the final few episodes, the fights that take place become less like fights and more like a competitions to see who has the most tragic back story. It was funny seeing people trying to be more tragic than their opponent, something I actually enjoyed. If you can take these scenes at face value, then I expect you'll get some more honest entertainment out.\\n\\n\r\nIn the end, Senran Kagura is a poor anime that provides cheap and easy entertainment, about as low brow as you can go. However, it fulfills it's intended purpose pretty well, so if you look at the picture and think \"a show about big boobed ninjas? Sounds like my sort of show!\" then I can't say anything other than yes, this probably is exactly your sort of show, after all, it does exactly what it says on the tin.",
            "date": "2013-03-25T20:33:00+00:00",
            "helpful_count": 123,
            "mal_id": 90919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465627.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Infinite",
                "username": "Infinite"
            },
            "url": "https://myanimelist.net/reviews.php?id=90919"
        },
        {
            "content": "Senran Kagura is one of those titles that doesn't pretend it is something high-quality; even the game it spawned from is all about clothing damage and huge jiggling breasts. Once you move past the unrealistic expectations, it becomes something you can, er, actually enjoy.\r\nTitles like these banks almost entirely on the character designs. The huge success of the games proved their appeal somewhat (I even put up Hibari as one of the most likable characters of the season). Character like Yomi, Yagyu and Katsuragi are also pretty popular on the net. It's a pity one of the most well-received characters (and one of my favourites),Hikage, never really got a chance to shine.\\n\\n\r\nIt may be a good thing that no one expects any kind of story at all, because the anime actually managed to surprise us with some reasonable plot. True, having the bad guy revealing his plans at the worse moment possible, losing all his allies and doubling his enemies are evidence of shitty storytelling, but hey, when the \"bad guys\" put pressure on the heroines in the first part of the story, they really had something going on there. No one would have predicted that it could actually be exciting, at certain parts of the story.\\n\\n\r\nThey actually had a good ninja vibe there with the stealthy tactics and hidden doors and stuff, but they also ruined it with stuff like bulletproof umbrellas, ninjas that dress like they're going to a ball, hidden miniguns and fighter jets under a shirt, a giant fluffy summoned rabbit, and the girl who never wears a bra, never buttons up her shirt, and jumps around the most. Why did they even go for the ninja theme?\\n\\n\r\nBut it's silly to complain about the theme of Senran Kagura. People who would even approach this already knows what and what not to expect. There's a thousand and one things that are stupid or pointless, and the fans got what they want, and they the producers made a lot of money off it. Who's gotta complain?",
            "date": "2013-04-04T03:27:00+00:00",
            "helpful_count": 74,
            "mal_id": 92347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22253.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/du5k",
                "username": "du5k"
            },
            "url": "https://myanimelist.net/reviews.php?id=92347"
        },
        {
            "content": "Obviously, what draws in the viewers for this series is the ecchi. Admittedly, that is what drew me in. As used up as the whole \"ninjas/shinobis\" niche has become, I am finding the plot to be fairly enjoyable. As the anime is just over half over, at the time of this post, I will reserve most judgement of the characters. \r\nIf you can tolerate ecchi to a certain point, it might not hurt to giv this series a chance. If you LOVE ecchi, this series would come as a great recommendation. But a fair warning for those who DO NOT LIKE the ecchi genre, thisseries contains large amounts of fanservice.",
            "date": "2013-02-19T06:08:00+00:00",
            "helpful_count": 32,
            "mal_id": 87221,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/StrikeWizard",
                "username": "StrikeWizard"
            },
            "url": "https://myanimelist.net/reviews.php?id=87221"
        },
        {
            "content": "Senran Kagura. I just finished watching it, As it just finished Airing.\r\nIt's a good anime, a Shounen, With an Ecchi mind.\r\nIf you want to see big breasted ninja girls, with other big breasted ninja girls and get they're clothes rip off, Senran Kagura is an anime for you hehe.\r\nIt is more Male oriented considering the big Ecchi part, But Girls can like it aswell since it's not only based on that.\r\nThe Story was good, My note was 7.\r\nThe Art was good, Different from what I've seen before on the character sides, But it was nice to watch,alot of colors and yeah, It was pretty, Igave it a 8.\\n\\n\r\nThe Sound was okay, I liked the Theme Song it was pleasant, And quite good.\\n\r\nI give this, A 7.\\n\\n\r\nThe Characters was okay, I did not really get caught in them, I felt a lack of character development, But overall they we're okay, I mean I did not dislike them, I just did not Like them as much as I did with other Animes, So my note is 6.\\n\\n\r\nSenran Kagura was enjoyable, Not the best I've seen but still enjoyable, I give it a passing 7.\\n\\n\\n\r\nSo the Overall Note has to be 7. A Good Anime. A big taste of Ecchi mixed in with Shounen basic. Good Action, Good Fan Service, What to ask more?\\n",
            "date": "2013-03-25T14:18:00+00:00",
            "helpful_count": 20,
            "mal_id": 90871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=90871"
        },
        {
            "content": "Am i the only one here who likes this anime?\r\nThis is the most underrated anime this season but i love it due to fanservice.\r\nI wonder why is this underrated? just because the characters looks familiar?\r\nAsuka is the original character in this series but the others look familiar.\r\nLet`s see.......\r\nIkaruga looks like Imai Nobume (Gintama)\r\nKatsuragi looks like older version of Toshino Kyouko (Yuru yuri)\r\nYagyuu looks like Twintailed Laura (Infinite Stratos)\r\nHibari looks like Madoka kaname (MSMM) with Nia`s eyes (TTGL)\r\noh wait.........\r\nthe villains reminds me of Naruto characters fushion with other anime characters.\r\nHomura akemi (MSMM) + Killer bee (Naruto) = Homura\r\nKuroneko (Ore no Imouto) + Itachi Uchiha (Naruto) =Mirai\\n\r\nKurumi (Touhou) + Zabuza (Naruto) = Yomi\\n\r\nYuuka Kazami (Touhou) + Orochimaru (Naruto) = Hikage\\n\r\nElly (Touhou) + Sasori (Naruto) = Haruka\\n\\n\\n\\n\r\nI SEE WHAT YOU DID THERE WATANABE TAKASHI!",
            "date": "2013-02-08T05:19:00+00:00",
            "helpful_count": 16,
            "mal_id": 86221,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gridley",
                "username": "Gridley"
            },
            "url": "https://myanimelist.net/reviews.php?id=86221"
        },
        {
            "content": "Senran Kagura is a an ecchi/action anime based on the video game series of the same name. Animation is handled by studio Artland (Mushishi, Gunslinger Girl, Hitman Reborn, etc). Senran Kagura shares the same director with similar ecchi anime such as the first season of Ikkitousen and Freezing, as well as the same scriptwriter as Ikkitousen, High School DxD, and Queen’s Blade.  That information alone will give you a pretty good idea of what to expect of this anime. And that is: not much. \r\nSenran Kagura is the story of five busty ninjas in training in modern Japan who strive to protect the secrettechnique scroll and become super special awesome overpowered ninjas. Later in the anime, they run into some trouble from “evil ninjas” of a rival school who just want to get in the way of the “good ninjas” and steal their super-secret scroll.\\n\\n\r\nAnd no, I am not being lazy with that synopsis. The actual anime is about as deep, enthralling, and complex as that description. It’s mostly just a crazy power struggle between good and evil ninjas. And yes, they are actually referred to as “good” and “evil” ninjas. No elaborate clan names with a rich, thousand year history and their own unique techniques. Just “good” and “evil” ninjas. And breasts. And clothes made of the finest quality tissue paper. There’s also the typical beach episode and plenty of bathing scenes.  The girl’s ability to transform during a fight in order to use their ninjutsu is a pretty interesting twist. In a way, they are sort of magical girl ninjas.  But of course that little interesting spin is hardly enough to save the show, or excuse the bare bones plot.\\n\\n\r\nTo be fair, Senran Kagura is mildly entertaining as a silly ecchi anime with action and lighthearted humor. But this is pretty much ruined when the plot does a total 180 and tries to be serious.  Forced melodrama, overly tragic backstories, and some half-assed attempts to present some moral dilemmas really detract from the show.  It’s actually pretty hard to take these moments seriously. SK would have been better off consistently conveying a lighthearted tone.\\n\\n\r\nThe characters aren’t much better. They are all one dimensional stereotypes that get little character development. That is, aside from the typical “You beat me! Now I have the resolve to train and get stronger with the power of love and friendship” development. Asuka is the granddaughter of famous ninja, yet she hardly shows it. She’s clumsy, rough around the edges, and upbeat. Ikaruga is the serious and mature leader type character. Katsuragi is the wild and perverted type character who would never pass up the chance to grope her friend’s breasts. Yagyu is the serious type who’s drive to protect Hibari hints at some subtle yet deeper feelings. Hibari is the klutzy moe character who is always getting her hide saved by Yagyu.\\n\\n\r\nThere are also a number of side characters. Uninteresting villains with no personality, the sensei who pops up occasionally to train the girls or give them words of wisdom, a mysterious ninja connected to their sensei, and a woman with breasts so big, it looks like she should have scoliosis. The main characters are given some minor sob stories that explain their connections to each other and how they became the ninjas they are today. But it’s nothing original or deep.\\n\\n\r\nThe art, animation, and sound are a lot better. The music contains quite a few catchy tracks that go hand in hand with the series various battles and training montages. They have an eastern feel to them that further complements the atmosphere. The animation is good, sporting some competent fight scenes. The character designs are interesting and wacky, though some of the girls end up looking really similar.\\n\\n\r\nOverall, Senran Kagura isn’t that bad, but it can’t be called good either. It’s a great time waster but nothing that would make it stand out amongst the flurry of other action/ecchi anime.  Video game adaptions are tricky. They can go wrong for many reasons. With no gameplay segments to break up the cut scenes, adaptions will sometime add needless filler in order to stretch it out a whole season. Sometimes the adaption will take creative liberties with the story and change things around, for better or for worse. Or sometimes the story just won’t be that good because video games can usually get away with poor stories as long as the gameplay is captivating and fun. \\n\\n\r\nThis could possibly be an excellent anime for fans of the game, which is most likely the target audience of this anime. Or perhaps its a 12 episode long commercial for the new Shinovi Versus game that came out around the time the anime was airing. It’s also great for ecchi enthusiasts or anyone who simply wants something light hearted and silly. For everyone else, its nothing to get excited about.  \\n",
            "date": "2013-04-02T17:14:00+00:00",
            "helpful_count": 12,
            "mal_id": 92137,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1565209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LuckyKrystal",
                "username": "LuckyKrystal"
            },
            "url": "https://myanimelist.net/reviews.php?id=92137"
        },
        {
            "content": "Recently I was busy browsing the Steam store – on the prowl for some new Hyperdimension Neptune game – when I saw a familiar face. I watched the anime back when it started airing in 2012 and even though it had some of the trashiest fan service scenes from anime, weirdly enough I enjoyed it. I thoroughly enjoyed the over-the-top action which the series is known for. And so I decided to write a long overdue review of Senran Kagura.\r\nStory – 6/10\r\nWeirdly enough a show revolving around busty shinobi who has a bone to pick with each cause your either “good” or “bad”, does haveplot. Yes it has plenty of bad elements – way too oversexuallized high school girls with gravity defying busts – but what reviewers usually seem to neglect is the fact that every character has their own personal character arc. This helps us feel for the characters more than the majority of characters found in the typical ecchi-battle-harem-bullshit-formula. Other than the characters the plot doesn’t have much going for it. Bad-guy-manipulates-girls-into-doing-some-evil-shit-for-him-so-he-can-summon-a-demon-to-use-in-wars-which-brings-him-more-profit-and-occasionally-shinobi-fire-shuriken-at-their-enemies-because-they-believe-in-a-line-between-good-and-evil. Average as heck but at least there is a plot present to keep you watching for more than the fanservice.\\n\\n\r\nArt –6/10\\n\\n\r\n“Yip loads of titties and at times some different titties, followed by the odd well executed and gravity defying action scene followed by by some sad character moments. Lastly remember to repeat for 12 episodes.”, said the animation studio. Senran Kagura felt like a low-budget doujin project, because the majority of the budget was spent on creating that perfect physics engine and the odd fight scenes. If the creators took more time trying to flesh out backgrounds and set pieces the overall animation quality wouldn’t have suffered as much as it did. The art isn’t fantastic but it gets the job done and fits with the ecchi premise of the series.\\n\\n\r\nSound -8/10\\n\\n\r\nAm I the only weirdo who actually likes the soundtrack of the anime? The score helps add that extra adrenaline in the action scenes and further enhances the overall quality of the series. Both the openings were catchy and the endings were a fun little contrast of the more “serious” openings. I watched the dubbed simulcast of the anime and even thought I found the majority of voice actors average as all hell, I absolutely loved the script which the narrator had to read. Sure it was cheap as all hell, but it worked really well for an anime which you can just sit back and enjoy. I am not sure if the anime has the same Japanese voice actors as the games, because if so then the sub version of the series should be vastly superior.\\n\\n\r\nCharacter – 7/10\\n\\n\r\nIf there is something I really enjoyed about Senran Kagura – other than the fun and laid back atmosphere of the series – it would have to be the characters. Characters such as Ikaruga, Katsuragi, Homura, Hikage and Yomi were really fun to watch as their back stories were more fleshed out than the rest of the cast and made the characters relatable. They suffered from simple problems however the trials which they experienced in their pasts, was something which could happen to anybody you know. Perhaps I’m too sensitive of a person but when I heard the reasoning behind Yagyuu’s eyepatch and the reason for her fondness of Hibari, I started crying. It was sweet, heartwarming and something I didn’t expect from a show with such a bad reputation such as Senran Kagura. Even though the characters at times seemed to exist only to satisfy the fans, I found something incredibly human within them which made it such a worthy waste of time.\\n\\n\r\nEnjoyment – 8/10\\n\\n\r\nSenran Kagura is without a doubt a fun series. It is the type of anime you would want to watch when you are feeling down and just want to watch something average but enjoyable. The fast pacing, fun fights and OST, makes for a mediocre but fun experience, which doesn’t need to be thought provoking. Overall I really enjoyed the anime and game’s despite being filled with fanservice. Perhaps it was the absence of a useless male protagonist which does absolutely nothing for the plot.\\n\\n\r\nOverall – 7/10\\n\\n\r\nSenran Kagura is an anime which isn’t afraid to accept that it is bad, as it never seems to move away from the pointless fanservice. However it you are looking for an ecchi anime to watch with just a little more than it seems, then look no further!\\n\\n\r\nThanks for taking the time to read my review!",
            "date": "2018-02-26T02:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 272488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4981708.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TiaanM777",
                "username": "TiaanM777"
            },
            "url": "https://myanimelist.net/reviews.php?id=272488"
        },
        {
            "content": "Senran Kagura is quite obviously a piece of fan service, and as a fan service it is great, but also underneath the fan service, is a good story that draws you in. The story comes across as an over simplified \"good vs bad\" story, and the English dubbing is very simplistic in the language it uses.\r\nLook through the fan service, look through the simple top layer of the story, and Senran Kagura is a fair bit deeper with a story of good turned bad to pursue power and then has thoughts of returning to the good.\r\nStory is a solid 7/10. Yes it's a bit simplified,yes its fan service, but its very approachable and doesn't get bogged down in unnecessary detail.\\n\\n\r\nArt is 9/10. This maybe a bit bias by me being a bit of a perv, but take what you will, it looks good, scenery is enjoyable and it all works.\\n\\n\r\nSound is 8/10 minimum. English dub for this is very good, and the choices for each character were spot on!\\n\\n\r\nCharacters are 9/10 easily. Ikagaru and Katsuragi make this anime, and their voices are perfect in every way! All characters have a back story that makes sense for where they are, and there is a good amount of development for a Fan Service.\\n\\n\r\nEnjoyment and Overall 8/10. I enjoy a good Fan Service as much as the next guy, but sometimes its a bit heavy. Bearing in mind that the story is actually captivating, and the girls aren't trying to impress boys it becomes a lot more enjoyable.\\n\\n\r\nIf you have looked at this anime and considered it then absolutely commit and give it a go. It's not going to win any awards, but its also not going to thrown away and never looked at again after you watch it.\\n\\n\r\nShout out to Ikagaru for being the black haired modest girl that is cute as hell, and with Tipton's voice acting, PERFECTION!",
            "date": "2015-06-07T18:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 189793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4572935.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/waly913",
                "username": "waly913"
            },
            "url": "https://myanimelist.net/reviews.php?id=189793"
        },
        {
            "content": "Pure throw-away entertainment\r\ngarbage, trash\r\nAfter watching the characters for 5 seconds you understand everything that is trying to be presented in their personality and they don't break from it over the course of the 12 or however many episodes. I've never been so uninterested in a show before... I pretty much had to watch it while hungover or doing something else because the idea of giving it my full attention was upsetting.  The only reason I ended up seeing this anime through to the end was to validate the fact that this was the worst anime I've ever seen.\r\nThey don't do ecchi well. It's incrediblybland. Boob physics that don't make sense and poorly animated crotch shots are the brunt of it. Oh also the girls always eat uncut sushi so it looks like they are sucking dong at every meal, haha it's really stupid.  The character design is laughable and the animation is uninspired. It looks like the creators just pumped it out in a hurry and didn't really care how good it looked. Music was mediocre, humor was meh. You could tell it was trying to be funny. Like you could see parts and be like “oh I think they were trying to make me laugh here” but it just never did anything that was genuinely humorous. Just not a type of humor that would make anyone with a fully functioning brain laugh.  It's a whole show for people who really think really dumb sexual innuendos are just the funniest thing in the world.\\n\\n\r\nMost shows have an interesting story to present. That's the whole point of a show, to tell a story.  The one portrayed in senran kagura is about stupid ninja girls vs asshole ninja girls.  There's very little context. It's similar to basilisk in that there are 2 ninja clans that don't like each other I guess, but that's about it. Each girl from one clan has a rival from the other and the clan leaders have a sordid history with each other. Clothes disappear when they fight. That's pretty much it. Plot over. Story finished.\\n\\n\r\nAll of the characters are so unmemorable they can only be distinguished in my mind by hair color.  There is a blond haired girl and she grabs the brunettes tits and she makes high pitched japanese exclamations to “no stop it” it's truly god damn awful. Maybe if I was a thirteen year old boy with downs this would be entertaining, but that might be a stretch.  The series seriously climaxes with the retardation in the last episode when 2 of the “good team” lesbians are in their underwear riding a glowing rabbit that is riding a squid doing a helicopter rotation thing with it's tentacles that's destroying a building while some crappy j-rock song is trying to get you pumped. It's that retarded.\\n\\n\r\nI feel like the types of people that would glean enjoyment from senran kagura are the types that have serious arguments about their waifus.  Like people that want to pretend these big titty anime characters in this show are their significant other.  If you feel that way about any of the characters here you should probably give it a rest. And by it I mean your life.\\n\\n\r\nIf you want to spend the 4 hours or whatever it takes to see the meh-fest I just described go right ahead.  Don't say I didn't warn you.  The warning is out there. I watched this heaping pile of trash so you don't have to.\\n\\n\r\nTerri-bad/10",
            "date": "2013-08-26T14:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 111281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/333089.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/synd465",
                "username": "synd465"
            },
            "url": "https://myanimelist.net/reviews.php?id=111281"
        },
        {
            "content": "This is a serious review for a serious matter.\r\nSenran Kagura shows a five girl ninja school against another school (this one evil). You will learn a lot about ninjas.\r\nNinjas can defy physics: when they are hanging down, their breasts hang, but their skirts don't. Strange, as they like to show her underwear whenever possible. Also, when hanging with a water bucket on each hand they can still somehow shake hands with a companion. Uh?\r\nReal ninjas resemble magical girls, and some armor transformations have even less cloth that the usual school uniform. I cannot stop staring at Katsuragi's... armor.\r\nEven with magical girl transformations, there is nopanty shots here, there is simply some scenes where panties are strangely not shown. Given the setting, this scenes can be dificult to understand, you will need to try your best.\\n\\n\r\nMusic is pretty good, being interesting and powerful. Helps a lot to cover the shallow story.\\n\\n\r\nCharacters are walking cliches with enormous breasts (the pervert, the shy, the cool genious, the willful protagonist, the straight: you will know who is who and you have probably already seem then anywhere else). Something to point out: student bodies don't differ greaty, they all have this cowish milky breasts which bounce at the minor oportunity (even when they talk). Could have been interesting to have more than one body type (there's only a loli on the bad girls team).\\n\\n\r\nGood:\\n\r\nThere are two Kuroneko ripoff, coming in two different sizes. Most animes have only one.\\n\r\nOn one before-spot image one of the bad girls is leaking one of her breasts! D.D\\n\r\nEven with so incredibly stupid premises, this happens to be fun.\\n\\n\r\nBad:\\n\r\nAs you are always watching at some kind of underwear, they soon start to seem as battle bikinis.\\n\r\nThe story is shallow.\\n\r\nThe ending is a bit stupid.",
            "date": "2014-07-31T04:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 154593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669775.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/emilsinclair",
                "username": "emilsinclair"
            },
            "url": "https://myanimelist.net/reviews.php?id=154593"
        },
        {
            "content": "So the video game franchise based on female ninjas with 3D tits gets an animu about female ninjas with 3D-esque tits. No argument there; except for the fact that Wapan wants to 1) turn everything into a female and 2) turn said females into lesbians.\r\nThe accompaning PSV game, Senran Kagura Shinovi Versus, sold vehemently well (as the lot of games that objectify women do). And yet I'm already seeing images of the ladies herein looking like NOBODY knows how to dress them properly. It already crossed the line with its lolies and guns.\r\nThe animu, saddeningly, doesn't have the upskirt panty shots when the ladies hereinwear their school uniforms. But it did have some nice concepts going on:\\n\\n\r\n* Light ninjas versus dark ninjas.\\n\r\n* Dark ninjas being \"dark\" because of dark pasts but otherwise good ninjas.\\n\r\n* Ikagura's ungifted brother wanting her sword.\\n\r\n* Evil head of the \"Serpent\" ninja girls' school.\\n\\n\r\nNice concepts that, in the end, fell flat on their faces because this \"pink bishoujo ghetto\" with a taint of red is STILL a \"pink bishoujo ghetto.\"\\n\\n\r\nMy hope is that there's a sequel in the works that feature ninja teams 3 and 4 (from Shinovi Versus) AND a capable male lead (ala Izayoi from Mondaiji-tachi). But you know: \"Wrapping the world around happy titties\" isn't so \"warm and fuzzy\" when some guy instead of \"that failing loser you\" had been picked to be encased in said happiness.",
            "date": "2013-03-25T21:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 90925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=90925"
        },
        {
            "content": "Senran Kagura drowns itself in it's own mediocrity. It has most of the basic elements in the series, but it falls short in most areas and never quite delivers. I held on through the story, but 12 episodes was more than enough, in fact, I wish it was halved. At times I enjoyed it, and others I couldn't wait for the episode to end. \r\nI'll keep it short and sweet. It really had a volatile mix of ingredients. It had good artwork, but they focused too much on sex appeal and didn't put enough attention into anything else. The sound was tolerable, but I wishit had better music.The voice acting was mediocre, they didn't focus enough on character development, and I found that I didn't have enough invested in them to like the characters. I just kept waiting for it to get good but it didn't. It was seriously lacking in so many areas. The story even was super simple and not satisfying.  \\n\\n\r\nIf you're into panty shots, skimpy clothed teenage girls fighting, and low quality voice acting, then you may enjoy this series. It has a predicable story (what little there is), and it's filled with simple cliche characters. It really is on the the bottom border of being mediocre as far as action anime series go. Don't expect anything more than you get from the beginning, because it does not deliver. So why the 6 overall? I did use the word \"volatile\" when describing it. It's good and bad at the same time, but I think 12 year boys will love it.\\n\\n\r\nIn short, I don't think it's a \"must avoid\" anime series, but I won't be watching it a second time.",
            "date": "2013-07-27T14:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 107115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/568293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/explicit707",
                "username": "explicit707"
            },
            "url": "https://myanimelist.net/reviews.php?id=107115"
        },
        {
            "content": "I won’t use any arbitrary numbers for the duration of this review. Senran Kagura is a series I picked up from a trailer I watched for Senran Kagura: Burst and let me tell you, I was just so fascinated. A fighting game where we pit scantily clad high school girls against one another and fight to destroy the other girls’ clothing? Count me in. WHY AREN’T MORE DEVS DOING THIS!? Then I realized there was an anime and manga series that fleshes out the legend of this mysterious series’ origins. Then it donned on me that this is not something I’d enjoy. I’m really ata loss for words with this one, because it wasn’t anything I didn’t expect. In fact it was so within my expectations I can’t give it a bad rating (not that it matters), because, let’s be honest, people eat up ecchi material regardless of the content or context. Criticizing this series for being ecchi isn’t really fair, because it is unapologetic and forward with the idea, it only really starts to dip in quality when it expects you to care about the characters and the story(?) that was going on, but I’m not a prude. I can accept panty shots, jiggle joggers and high pitched peeping as staples of the anime industry when it’s lacking in substance otherwise. That’s fine. In all seriousness, Senran Kagura wasn’t bad, it was just normal, which I think is part of what disturbs me about it. That we’re so used to this style of storytelling that it doesn’t faze us anymore, but that’s a story for another day.\\n\\n\r\nAs far as animation and other technical aspects of the show, it wasn’t terrible. It was fluid and appropriate albeit you can tell when parts were rushed. I’d venture to say that the series could have benefitted from more expansion of the plot and less booby bounces, or the opposite where there was less story and ONLY BOOBY BOUNCES. The finished product looks more like a mess when the finale comes around as a result, but maybe that’s what OVAs are for. Or maybe I’m expecting too much out of my anime these days.\\n",
            "date": "2016-03-01T17:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 212054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4483061.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/fullmetaljo",
                "username": "fullmetaljo"
            },
            "url": "https://myanimelist.net/reviews.php?id=212054"
        },
        {
            "content": "I normally love Action/ecchi anime, but I just couldn't get into this one and dropped it after five episodes (I watched the dubbed version).\r\nThe only reason I am writing this review at all was to point out the one aspect I did like, because no other review I read bothered to mention it. The narrator/voice over guy's observations were by far the most amusing thing about the show.\r\nStory:\r\nI thought a story about girl shinobi would be good, but it never really went anywhere. I learned basically nothing about the girls, the clans or anything really in the episodes I watched. And way too much timewas spent on showing the girls cleavage in the episodes I saw and not enough time spent on action.\\n\\n\r\nCharacters:\\n\r\nAs one dimensional as their faces. I didn't grow to like any of them.\\n\\n\r\nArt\\n\r\nPretty poor. The girls faces seemed very one dimensional, using shiny spots on the cheeks for definition and quite often the girls noses were just drawn as nothing more than a dot on their face (similar style of animation to Katana Maidens if you've seen that one). Would have been tolerable if story line was more enjoyable.\\n\r\nBeing an ecchi, I expected the girls to have large breasts, but most anime will give us some variety in size. In this one it's overly large, overly round, completely ridiculous looking breasts for all, no matter how petite they are.\\n\\n\r\nSound:\\n\r\nNothing stood out either way, not that I really pay that much attention to it when I am watching. \\n\\n\r\nOverall: \\n\r\nI would skip this one, or go into it with very low expectations so it doesn't disappoint.\\n\r\n I give it a generous 4.5 out of 10, only because I didn't complete the series.\\n\\n",
            "date": "2018-07-12T04:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 283783,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5125927.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jezza_G",
                "username": "Jezza_G"
            },
            "url": "https://myanimelist.net/reviews.php?id=283783"
        },
        {
            "content": "Senran Kagura is an anime about female ninjas that go to a super secret school. It’s based on a 3DS game of the same name. It should be pretty obvious that this is an ecchi anime that is 85% fanservice and 15% actual plot, and it is. You have the Hanzou Academy, for the virtuous ninjas and there is another school for evil ninjas called the Serpent Academy. The anime is basically just these light and dark factions fighting against each other.\r\nI generally don’t mind ecchi series, I happen to like a few (Jungle de Ikou, anyone?), but this one was just a little toocliche and boring for me. The story is trite, the character archetypes are overused, they pretty much cover every sort of fanservice possible… if you really don’t care about story or characters and are more interested in unrealistic boobie physics, then this is the show for you. It really wasn’t for me…",
            "date": "2013-03-30T21:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 91693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2071271.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kiokushitaka",
                "username": "kiokushitaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=91693"
        },
        {
            "content": "So five busty girls is apparently what pulls people into this one. Each having their own small back story which is nicely explained by the narrator so I don't have to hear too many sob story about how their live was like before the actually series started. Don't get me wrong I'm ok with a little backstory, I just don't like when one is full of nothing but tears and sadness, only to find that the person we see now doesn't really connect with said backstory. Fairy Tail is a good example of good back story, telling the whole thing, both the good and thebad, The Whole Thing! \\n\r\nSpeaking of which why is that is almost every fighting scene, clothes are being blasted off and everyone is fighting in their underwear? I don't care if people use the \"magic\" excuse (the idea that anything that you can't really explain through any logical reason is magic) o.k? Your not Gray Fullbuster, you don't use ice magic, you don't need to strip down to your underwear in order to get in touch with the cold! \\n\r\nOn the plus side there are a silver-lining, having good characters is important and I feel they do that pretty o.k. Especially the supporting characters from the dark side, when you hear their story and watch how and why the interact with one another the way they do, while it may seem mean, is all for good reason. To the point where you may start thinking about who is the real bad guy here?\\n\r\nAs far as fanservice is concerned, I'd say it's 35% fanservice and 65% story. I don't know maybe I'm missing something that you see but what I think. Other than the whole underwear thing, which is not hot unless your a kid that is retarded or has down syndrome (and I mean the legit stuff, not the \"oh your so stupid\" bullshit). \\n\r\nThis show did have it's ups and downs, but I think that if they decided to make a sequel to this show, it would give them another chance at fixing some of those problems in the first story, and personally I like to see a show all the way through to the end and just have it cut off halfway through like most anime seems to be doing.",
            "date": "2014-06-23T08:33:00+00:00",
            "helpful_count": 0,
            "mal_id": 148203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=148203"
        }
    ],
    [
        {
            "content": "I don’t understand the hate behind this series. Let’s be fair, it’s an ecchi anime, so we should be watching for fun over substance. And if you don’t look too hard, this is actually a pretty good and fun series :)\r\n\r\nArt – 9 points\r\nThe character designs are very well done. First, all the girls are very attractive (pretty, hot, sexy, cute, you name it…) each with unique appearances that match their personalities. Then each girl got individual ninja gears that are splendid top to bottom. From this wide selection of girls, the audience should be able to find a girl that suits their taste justby appearance. I personally found several. :) The major setback in the art is the boobs may have been a little too round and the lack of nipples, but that didn’t really bother me. :)\\n\\n\r\nStory – 7 points\\n\\n\r\nThe story certainly wasn’t one of the best, but it was good enough to develop a course of action and direction. Basically, the light shinobi girls are students of a ninja academy. They train to get the skills  they need while carrying out missions and having their perverted fun. One day, they come in contact with the dark shinobi girls. This begins the series of challenge from the dark side shinobi girls to the light shinobi girls to see who’s stronger. The fights were really good and shows off both side’s rivalry with each other. As the story progresses, there seems to be a bigger evil working in the shadows among the dark shinobi faction.\\n\\n\r\nEcchi – 8 points\\n\\n\r\nThe ecchi was great and perverted in nature. This anime has a lot of boob service and uses the ninja theme well to exploit this. The ecchi was very fun to watch in actuality more so than in the hotness aspect in my opinion. But believe me, some parts do get very hot (……Haruka…..Haruka….) The shinobi girls also have a skill where their gear transforms into swimsuits and you get to see them fight in swimsuits, I thought that was pretty nice. The main complaint you’re gonna get in the ecchi department is probably the lack of guys for perverted stuff. But the spotlight is in the beauty of the girls so it’s alright. :) Besides you got that ninja teacher Kiriya- sensei  who I think is pretty funny and that perverted old gramps. They create the right mood for this anime to go well. :)\\n\r\n\\n\r\nCharacter – 8 points\\n\\n\r\nI think the character department deserves a good score. The word unique would sum it up. This anime managed to create so many girls with unique personalities that things never get dull or repetitive. I was really impressed by how easy it was to distinguish a large cast of girls due to their unique personality. Each girl got their background story that enhances their personality and this combination of personalities in character interaction fleshes out memorable characters (like Yagyuu and Hibari duo). I really liked all the characters, the girls are awesome!\\n\\n\r\nSound – 10 points\\n\\n\r\nThe opening kicks ass and is epic!!!  The endings, both ending 1 and 2 are so good!!! Can’t you guys recognize that? The Ninja BGM was very good too!\\n\\n\r\nEnjoyment – 9 points\\n\\n\r\nI’ve really enjoyed this anime that I’ve gone to write a review for it. It’s by no means a mind blowing anime, but this is a really great ecchi anime. It deserves a solid 9! \\n\\n\r\nThank you so much everyone :)\\n",
            "date": "2013-07-19T01:20:00+00:00",
            "helpful_count": 258,
            "mal_id": 105935,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2807721.jpg",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BenJames",
                "username": "BenJames"
            },
            "url": "https://myanimelist.net/reviews.php?id=105935"
        },
        {
            "content": "The expression \"don't judge a book by it's cover\" is something you should always keep in mind, because occasionally, a show is a lot more than what it's cover suggests.\r\nSenran Kagura is not one of those shows. What you see is what you get, you see ninja girls with big boobs in the cover picture? That's what you'll get. This is a quintessential ecchi action romp, plenty of fan service, serviceable action and characters that are for the most part likable. How well exactly does the show do what it does?\r\nLet's start with an important aspect of the show, the art and animation. On thewhole the animation strong, and surprisingly consistent, the faces and character models are rarely off model, and the action looks fluid, and there is a good use of colour which makes for an enjoyable viewing. The art is weaker, the backgrounds lack detail, to the point where it's rather noticeable, however, for the most part it makes little difference, because rather than the scenery, most of your attention will be drawn to the characters and their assets. Let's not beat about the bush, these characters are all meant to be visually appealing, and the specific pull of this anime is that they all have huge boobs. On the whole I think the character designs work, however a couple of the character designs just look strange with the gigantic boobs attached, but there will be a character design that you like, and at numerous points you will see their bodies in almost all their glory. The character designs are like the music wholly generic, but are good enough to satisfy the needs of the show.\\n\\n\r\nOnto the characters, they are shallow but on the whole likable. You have the standard tropes like the pervert, the Ojou-sama etc. which fulfill their fanservice roles whilst being mostly likable. In the end these characters are really poor and have the depth of a puddle, but they suffice. Obviously, these characters aren't really what you'd expect of trained ninjas, but Senran Kagura doesn't really give a toss about realism, because why should it? There are tons of holes in the plot of this show, but really it doesn't matter, it's not as if it was aiming for high brow entertainment.\\n\\n\r\nThe plot is not exactly spectacular, it's really stupid, cares nothing for sense, logic or proper plot progression. Whilst the fights are entertaining, the ways in which they come about are so stupid, and I often was in disbelief at how blatantly poor the writing was. However, by the end of the show nothing surprises anymore, and so you can wholly accept the anime for what it is, cheap shallow entertainment, funny often for how poor it is in areas. In the final few episodes, the fights that take place become less like fights and more like a competitions to see who has the most tragic back story. It was funny seeing people trying to be more tragic than their opponent, something I actually enjoyed. If you can take these scenes at face value, then I expect you'll get some more honest entertainment out.\\n\\n\r\nIn the end, Senran Kagura is a poor anime that provides cheap and easy entertainment, about as low brow as you can go. However, it fulfills it's intended purpose pretty well, so if you look at the picture and think \"a show about big boobed ninjas? Sounds like my sort of show!\" then I can't say anything other than yes, this probably is exactly your sort of show, after all, it does exactly what it says on the tin.",
            "date": "2013-03-25T20:33:00+00:00",
            "helpful_count": 123,
            "mal_id": 90919,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/465627.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 5,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Infinite",
                "username": "Infinite"
            },
            "url": "https://myanimelist.net/reviews.php?id=90919"
        },
        {
            "content": "Senran Kagura is one of those titles that doesn't pretend it is something high-quality; even the game it spawned from is all about clothing damage and huge jiggling breasts. Once you move past the unrealistic expectations, it becomes something you can, er, actually enjoy.\r\nTitles like these banks almost entirely on the character designs. The huge success of the games proved their appeal somewhat (I even put up Hibari as one of the most likable characters of the season). Character like Yomi, Yagyu and Katsuragi are also pretty popular on the net. It's a pity one of the most well-received characters (and one of my favourites),Hikage, never really got a chance to shine.\\n\\n\r\nIt may be a good thing that no one expects any kind of story at all, because the anime actually managed to surprise us with some reasonable plot. True, having the bad guy revealing his plans at the worse moment possible, losing all his allies and doubling his enemies are evidence of shitty storytelling, but hey, when the \"bad guys\" put pressure on the heroines in the first part of the story, they really had something going on there. No one would have predicted that it could actually be exciting, at certain parts of the story.\\n\\n\r\nThey actually had a good ninja vibe there with the stealthy tactics and hidden doors and stuff, but they also ruined it with stuff like bulletproof umbrellas, ninjas that dress like they're going to a ball, hidden miniguns and fighter jets under a shirt, a giant fluffy summoned rabbit, and the girl who never wears a bra, never buttons up her shirt, and jumps around the most. Why did they even go for the ninja theme?\\n\\n\r\nBut it's silly to complain about the theme of Senran Kagura. People who would even approach this already knows what and what not to expect. There's a thousand and one things that are stupid or pointless, and the fans got what they want, and they the producers made a lot of money off it. Who's gotta complain?",
            "date": "2013-04-04T03:27:00+00:00",
            "helpful_count": 74,
            "mal_id": 92347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/22253.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/du5k",
                "username": "du5k"
            },
            "url": "https://myanimelist.net/reviews.php?id=92347"
        },
        {
            "content": "Obviously, what draws in the viewers for this series is the ecchi. Admittedly, that is what drew me in. As used up as the whole \"ninjas/shinobis\" niche has become, I am finding the plot to be fairly enjoyable. As the anime is just over half over, at the time of this post, I will reserve most judgement of the characters. \r\nIf you can tolerate ecchi to a certain point, it might not hurt to giv this series a chance. If you LOVE ecchi, this series would come as a great recommendation. But a fair warning for those who DO NOT LIKE the ecchi genre, thisseries contains large amounts of fanservice.",
            "date": "2013-02-19T06:08:00+00:00",
            "helpful_count": 32,
            "mal_id": 87221,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 10,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/StrikeWizard",
                "username": "StrikeWizard"
            },
            "url": "https://myanimelist.net/reviews.php?id=87221"
        },
        {
            "content": "Senran Kagura. I just finished watching it, As it just finished Airing.\r\nIt's a good anime, a Shounen, With an Ecchi mind.\r\nIf you want to see big breasted ninja girls, with other big breasted ninja girls and get they're clothes rip off, Senran Kagura is an anime for you hehe.\r\nIt is more Male oriented considering the big Ecchi part, But Girls can like it aswell since it's not only based on that.\r\nThe Story was good, My note was 7.\r\nThe Art was good, Different from what I've seen before on the character sides, But it was nice to watch,alot of colors and yeah, It was pretty, Igave it a 8.\\n\\n\r\nThe Sound was okay, I liked the Theme Song it was pleasant, And quite good.\\n\r\nI give this, A 7.\\n\\n\r\nThe Characters was okay, I did not really get caught in them, I felt a lack of character development, But overall they we're okay, I mean I did not dislike them, I just did not Like them as much as I did with other Animes, So my note is 6.\\n\\n\r\nSenran Kagura was enjoyable, Not the best I've seen but still enjoyable, I give it a passing 7.\\n\\n\\n\r\nSo the Overall Note has to be 7. A Good Anime. A big taste of Ecchi mixed in with Shounen basic. Good Action, Good Fan Service, What to ask more?\\n",
            "date": "2013-03-25T14:18:00+00:00",
            "helpful_count": 20,
            "mal_id": 90871,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1932138.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Kruh",
                "username": "Kruh"
            },
            "url": "https://myanimelist.net/reviews.php?id=90871"
        },
        {
            "content": "Am i the only one here who likes this anime?\r\nThis is the most underrated anime this season but i love it due to fanservice.\r\nI wonder why is this underrated? just because the characters looks familiar?\r\nAsuka is the original character in this series but the others look familiar.\r\nLet`s see.......\r\nIkaruga looks like Imai Nobume (Gintama)\r\nKatsuragi looks like older version of Toshino Kyouko (Yuru yuri)\r\nYagyuu looks like Twintailed Laura (Infinite Stratos)\r\nHibari looks like Madoka kaname (MSMM) with Nia`s eyes (TTGL)\r\noh wait.........\r\nthe villains reminds me of Naruto characters fushion with other anime characters.\r\nHomura akemi (MSMM) + Killer bee (Naruto) = Homura\r\nKuroneko (Ore no Imouto) + Itachi Uchiha (Naruto) =Mirai\\n\r\nKurumi (Touhou) + Zabuza (Naruto) = Yomi\\n\r\nYuuka Kazami (Touhou) + Orochimaru (Naruto) = Hikage\\n\r\nElly (Touhou) + Sasori (Naruto) = Haruka\\n\\n\\n\\n\r\nI SEE WHAT YOU DID THERE WATANABE TAKASHI!",
            "date": "2013-02-08T05:19:00+00:00",
            "helpful_count": 16,
            "mal_id": 86221,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1211747.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Gridley",
                "username": "Gridley"
            },
            "url": "https://myanimelist.net/reviews.php?id=86221"
        },
        {
            "content": "Senran Kagura is a an ecchi/action anime based on the video game series of the same name. Animation is handled by studio Artland (Mushishi, Gunslinger Girl, Hitman Reborn, etc). Senran Kagura shares the same director with similar ecchi anime such as the first season of Ikkitousen and Freezing, as well as the same scriptwriter as Ikkitousen, High School DxD, and Queen’s Blade.  That information alone will give you a pretty good idea of what to expect of this anime. And that is: not much. \r\nSenran Kagura is the story of five busty ninjas in training in modern Japan who strive to protect the secrettechnique scroll and become super special awesome overpowered ninjas. Later in the anime, they run into some trouble from “evil ninjas” of a rival school who just want to get in the way of the “good ninjas” and steal their super-secret scroll.\\n\\n\r\nAnd no, I am not being lazy with that synopsis. The actual anime is about as deep, enthralling, and complex as that description. It’s mostly just a crazy power struggle between good and evil ninjas. And yes, they are actually referred to as “good” and “evil” ninjas. No elaborate clan names with a rich, thousand year history and their own unique techniques. Just “good” and “evil” ninjas. And breasts. And clothes made of the finest quality tissue paper. There’s also the typical beach episode and plenty of bathing scenes.  The girl’s ability to transform during a fight in order to use their ninjutsu is a pretty interesting twist. In a way, they are sort of magical girl ninjas.  But of course that little interesting spin is hardly enough to save the show, or excuse the bare bones plot.\\n\\n\r\nTo be fair, Senran Kagura is mildly entertaining as a silly ecchi anime with action and lighthearted humor. But this is pretty much ruined when the plot does a total 180 and tries to be serious.  Forced melodrama, overly tragic backstories, and some half-assed attempts to present some moral dilemmas really detract from the show.  It’s actually pretty hard to take these moments seriously. SK would have been better off consistently conveying a lighthearted tone.\\n\\n\r\nThe characters aren’t much better. They are all one dimensional stereotypes that get little character development. That is, aside from the typical “You beat me! Now I have the resolve to train and get stronger with the power of love and friendship” development. Asuka is the granddaughter of famous ninja, yet she hardly shows it. She’s clumsy, rough around the edges, and upbeat. Ikaruga is the serious and mature leader type character. Katsuragi is the wild and perverted type character who would never pass up the chance to grope her friend’s breasts. Yagyu is the serious type who’s drive to protect Hibari hints at some subtle yet deeper feelings. Hibari is the klutzy moe character who is always getting her hide saved by Yagyu.\\n\\n\r\nThere are also a number of side characters. Uninteresting villains with no personality, the sensei who pops up occasionally to train the girls or give them words of wisdom, a mysterious ninja connected to their sensei, and a woman with breasts so big, it looks like she should have scoliosis. The main characters are given some minor sob stories that explain their connections to each other and how they became the ninjas they are today. But it’s nothing original or deep.\\n\\n\r\nThe art, animation, and sound are a lot better. The music contains quite a few catchy tracks that go hand in hand with the series various battles and training montages. They have an eastern feel to them that further complements the atmosphere. The animation is good, sporting some competent fight scenes. The character designs are interesting and wacky, though some of the girls end up looking really similar.\\n\\n\r\nOverall, Senran Kagura isn’t that bad, but it can’t be called good either. It’s a great time waster but nothing that would make it stand out amongst the flurry of other action/ecchi anime.  Video game adaptions are tricky. They can go wrong for many reasons. With no gameplay segments to break up the cut scenes, adaptions will sometime add needless filler in order to stretch it out a whole season. Sometimes the adaption will take creative liberties with the story and change things around, for better or for worse. Or sometimes the story just won’t be that good because video games can usually get away with poor stories as long as the gameplay is captivating and fun. \\n\\n\r\nThis could possibly be an excellent anime for fans of the game, which is most likely the target audience of this anime. Or perhaps its a 12 episode long commercial for the new Shinovi Versus game that came out around the time the anime was airing. It’s also great for ecchi enthusiasts or anyone who simply wants something light hearted and silly. For everyone else, its nothing to get excited about.  \\n",
            "date": "2013-04-02T17:14:00+00:00",
            "helpful_count": 12,
            "mal_id": 92137,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1565209.jpg",
                "scores": {
                    "animation": 7,
                    "character": 3,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/LuckyKrystal",
                "username": "LuckyKrystal"
            },
            "url": "https://myanimelist.net/reviews.php?id=92137"
        },
        {
            "content": "Recently I was busy browsing the Steam store – on the prowl for some new Hyperdimension Neptune game – when I saw a familiar face. I watched the anime back when it started airing in 2012 and even though it had some of the trashiest fan service scenes from anime, weirdly enough I enjoyed it. I thoroughly enjoyed the over-the-top action which the series is known for. And so I decided to write a long overdue review of Senran Kagura.\r\nStory – 6/10\r\nWeirdly enough a show revolving around busty shinobi who has a bone to pick with each cause your either “good” or “bad”, does haveplot. Yes it has plenty of bad elements – way too oversexuallized high school girls with gravity defying busts – but what reviewers usually seem to neglect is the fact that every character has their own personal character arc. This helps us feel for the characters more than the majority of characters found in the typical ecchi-battle-harem-bullshit-formula. Other than the characters the plot doesn’t have much going for it. Bad-guy-manipulates-girls-into-doing-some-evil-shit-for-him-so-he-can-summon-a-demon-to-use-in-wars-which-brings-him-more-profit-and-occasionally-shinobi-fire-shuriken-at-their-enemies-because-they-believe-in-a-line-between-good-and-evil. Average as heck but at least there is a plot present to keep you watching for more than the fanservice.\\n\\n\r\nArt –6/10\\n\\n\r\n“Yip loads of titties and at times some different titties, followed by the odd well executed and gravity defying action scene followed by by some sad character moments. Lastly remember to repeat for 12 episodes.”, said the animation studio. Senran Kagura felt like a low-budget doujin project, because the majority of the budget was spent on creating that perfect physics engine and the odd fight scenes. If the creators took more time trying to flesh out backgrounds and set pieces the overall animation quality wouldn’t have suffered as much as it did. The art isn’t fantastic but it gets the job done and fits with the ecchi premise of the series.\\n\\n\r\nSound -8/10\\n\\n\r\nAm I the only weirdo who actually likes the soundtrack of the anime? The score helps add that extra adrenaline in the action scenes and further enhances the overall quality of the series. Both the openings were catchy and the endings were a fun little contrast of the more “serious” openings. I watched the dubbed simulcast of the anime and even thought I found the majority of voice actors average as all hell, I absolutely loved the script which the narrator had to read. Sure it was cheap as all hell, but it worked really well for an anime which you can just sit back and enjoy. I am not sure if the anime has the same Japanese voice actors as the games, because if so then the sub version of the series should be vastly superior.\\n\\n\r\nCharacter – 7/10\\n\\n\r\nIf there is something I really enjoyed about Senran Kagura – other than the fun and laid back atmosphere of the series – it would have to be the characters. Characters such as Ikaruga, Katsuragi, Homura, Hikage and Yomi were really fun to watch as their back stories were more fleshed out than the rest of the cast and made the characters relatable. They suffered from simple problems however the trials which they experienced in their pasts, was something which could happen to anybody you know. Perhaps I’m too sensitive of a person but when I heard the reasoning behind Yagyuu’s eyepatch and the reason for her fondness of Hibari, I started crying. It was sweet, heartwarming and something I didn’t expect from a show with such a bad reputation such as Senran Kagura. Even though the characters at times seemed to exist only to satisfy the fans, I found something incredibly human within them which made it such a worthy waste of time.\\n\\n\r\nEnjoyment – 8/10\\n\\n\r\nSenran Kagura is without a doubt a fun series. It is the type of anime you would want to watch when you are feeling down and just want to watch something average but enjoyable. The fast pacing, fun fights and OST, makes for a mediocre but fun experience, which doesn’t need to be thought provoking. Overall I really enjoyed the anime and game’s despite being filled with fanservice. Perhaps it was the absence of a useless male protagonist which does absolutely nothing for the plot.\\n\\n\r\nOverall – 7/10\\n\\n\r\nSenran Kagura is an anime which isn’t afraid to accept that it is bad, as it never seems to move away from the pointless fanservice. However it you are looking for an ecchi anime to watch with just a little more than it seems, then look no further!\\n\\n\r\nThanks for taking the time to read my review!",
            "date": "2018-02-26T02:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 272488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4981708.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TiaanM777",
                "username": "TiaanM777"
            },
            "url": "https://myanimelist.net/reviews.php?id=272488"
        },
        {
            "content": "Senran Kagura is quite obviously a piece of fan service, and as a fan service it is great, but also underneath the fan service, is a good story that draws you in. The story comes across as an over simplified \"good vs bad\" story, and the English dubbing is very simplistic in the language it uses.\r\nLook through the fan service, look through the simple top layer of the story, and Senran Kagura is a fair bit deeper with a story of good turned bad to pursue power and then has thoughts of returning to the good.\r\nStory is a solid 7/10. Yes it's a bit simplified,yes its fan service, but its very approachable and doesn't get bogged down in unnecessary detail.\\n\\n\r\nArt is 9/10. This maybe a bit bias by me being a bit of a perv, but take what you will, it looks good, scenery is enjoyable and it all works.\\n\\n\r\nSound is 8/10 minimum. English dub for this is very good, and the choices for each character were spot on!\\n\\n\r\nCharacters are 9/10 easily. Ikagaru and Katsuragi make this anime, and their voices are perfect in every way! All characters have a back story that makes sense for where they are, and there is a good amount of development for a Fan Service.\\n\\n\r\nEnjoyment and Overall 8/10. I enjoy a good Fan Service as much as the next guy, but sometimes its a bit heavy. Bearing in mind that the story is actually captivating, and the girls aren't trying to impress boys it becomes a lot more enjoyable.\\n\\n\r\nIf you have looked at this anime and considered it then absolutely commit and give it a go. It's not going to win any awards, but its also not going to thrown away and never looked at again after you watch it.\\n\\n\r\nShout out to Ikagaru for being the black haired modest girl that is cute as hell, and with Tipton's voice acting, PERFECTION!",
            "date": "2015-06-07T18:29:00+00:00",
            "helpful_count": 9,
            "mal_id": 189793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4572935.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/waly913",
                "username": "waly913"
            },
            "url": "https://myanimelist.net/reviews.php?id=189793"
        },
        {
            "content": "Pure throw-away entertainment\r\ngarbage, trash\r\nAfter watching the characters for 5 seconds you understand everything that is trying to be presented in their personality and they don't break from it over the course of the 12 or however many episodes. I've never been so uninterested in a show before... I pretty much had to watch it while hungover or doing something else because the idea of giving it my full attention was upsetting.  The only reason I ended up seeing this anime through to the end was to validate the fact that this was the worst anime I've ever seen.\r\nThey don't do ecchi well. It's incrediblybland. Boob physics that don't make sense and poorly animated crotch shots are the brunt of it. Oh also the girls always eat uncut sushi so it looks like they are sucking dong at every meal, haha it's really stupid.  The character design is laughable and the animation is uninspired. It looks like the creators just pumped it out in a hurry and didn't really care how good it looked. Music was mediocre, humor was meh. You could tell it was trying to be funny. Like you could see parts and be like “oh I think they were trying to make me laugh here” but it just never did anything that was genuinely humorous. Just not a type of humor that would make anyone with a fully functioning brain laugh.  It's a whole show for people who really think really dumb sexual innuendos are just the funniest thing in the world.\\n\\n\r\nMost shows have an interesting story to present. That's the whole point of a show, to tell a story.  The one portrayed in senran kagura is about stupid ninja girls vs asshole ninja girls.  There's very little context. It's similar to basilisk in that there are 2 ninja clans that don't like each other I guess, but that's about it. Each girl from one clan has a rival from the other and the clan leaders have a sordid history with each other. Clothes disappear when they fight. That's pretty much it. Plot over. Story finished.\\n\\n\r\nAll of the characters are so unmemorable they can only be distinguished in my mind by hair color.  There is a blond haired girl and she grabs the brunettes tits and she makes high pitched japanese exclamations to “no stop it” it's truly god damn awful. Maybe if I was a thirteen year old boy with downs this would be entertaining, but that might be a stretch.  The series seriously climaxes with the retardation in the last episode when 2 of the “good team” lesbians are in their underwear riding a glowing rabbit that is riding a squid doing a helicopter rotation thing with it's tentacles that's destroying a building while some crappy j-rock song is trying to get you pumped. It's that retarded.\\n\\n\r\nI feel like the types of people that would glean enjoyment from senran kagura are the types that have serious arguments about their waifus.  Like people that want to pretend these big titty anime characters in this show are their significant other.  If you feel that way about any of the characters here you should probably give it a rest. And by it I mean your life.\\n\\n\r\nIf you want to spend the 4 hours or whatever it takes to see the meh-fest I just described go right ahead.  Don't say I didn't warn you.  The warning is out there. I watched this heaping pile of trash so you don't have to.\\n\\n\r\nTerri-bad/10",
            "date": "2013-08-26T14:17:00+00:00",
            "helpful_count": 7,
            "mal_id": 111281,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/333089.jpg",
                "scores": {
                    "animation": 5,
                    "character": 2,
                    "enjoyment": 1,
                    "overall": 2,
                    "sound": 5,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/synd465",
                "username": "synd465"
            },
            "url": "https://myanimelist.net/reviews.php?id=111281"
        },
        {
            "content": "This is a serious review for a serious matter.\r\nSenran Kagura shows a five girl ninja school against another school (this one evil). You will learn a lot about ninjas.\r\nNinjas can defy physics: when they are hanging down, their breasts hang, but their skirts don't. Strange, as they like to show her underwear whenever possible. Also, when hanging with a water bucket on each hand they can still somehow shake hands with a companion. Uh?\r\nReal ninjas resemble magical girls, and some armor transformations have even less cloth that the usual school uniform. I cannot stop staring at Katsuragi's... armor.\r\nEven with magical girl transformations, there is nopanty shots here, there is simply some scenes where panties are strangely not shown. Given the setting, this scenes can be dificult to understand, you will need to try your best.\\n\\n\r\nMusic is pretty good, being interesting and powerful. Helps a lot to cover the shallow story.\\n\\n\r\nCharacters are walking cliches with enormous breasts (the pervert, the shy, the cool genious, the willful protagonist, the straight: you will know who is who and you have probably already seem then anywhere else). Something to point out: student bodies don't differ greaty, they all have this cowish milky breasts which bounce at the minor oportunity (even when they talk). Could have been interesting to have more than one body type (there's only a loli on the bad girls team).\\n\\n\r\nGood:\\n\r\nThere are two Kuroneko ripoff, coming in two different sizes. Most animes have only one.\\n\r\nOn one before-spot image one of the bad girls is leaking one of her breasts! D.D\\n\r\nEven with so incredibly stupid premises, this happens to be fun.\\n\\n\r\nBad:\\n\r\nAs you are always watching at some kind of underwear, they soon start to seem as battle bikinis.\\n\r\nThe story is shallow.\\n\r\nThe ending is a bit stupid.",
            "date": "2014-07-31T04:27:00+00:00",
            "helpful_count": 6,
            "mal_id": 154593,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3669775.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/emilsinclair",
                "username": "emilsinclair"
            },
            "url": "https://myanimelist.net/reviews.php?id=154593"
        },
        {
            "content": "So the video game franchise based on female ninjas with 3D tits gets an animu about female ninjas with 3D-esque tits. No argument there; except for the fact that Wapan wants to 1) turn everything into a female and 2) turn said females into lesbians.\r\nThe accompaning PSV game, Senran Kagura Shinovi Versus, sold vehemently well (as the lot of games that objectify women do). And yet I'm already seeing images of the ladies herein looking like NOBODY knows how to dress them properly. It already crossed the line with its lolies and guns.\r\nThe animu, saddeningly, doesn't have the upskirt panty shots when the ladies hereinwear their school uniforms. But it did have some nice concepts going on:\\n\\n\r\n* Light ninjas versus dark ninjas.\\n\r\n* Dark ninjas being \"dark\" because of dark pasts but otherwise good ninjas.\\n\r\n* Ikagura's ungifted brother wanting her sword.\\n\r\n* Evil head of the \"Serpent\" ninja girls' school.\\n\\n\r\nNice concepts that, in the end, fell flat on their faces because this \"pink bishoujo ghetto\" with a taint of red is STILL a \"pink bishoujo ghetto.\"\\n\\n\r\nMy hope is that there's a sequel in the works that feature ninja teams 3 and 4 (from Shinovi Versus) AND a capable male lead (ala Izayoi from Mondaiji-tachi). But you know: \"Wrapping the world around happy titties\" isn't so \"warm and fuzzy\" when some guy instead of \"that failing loser you\" had been picked to be encased in said happiness.",
            "date": "2013-03-25T21:41:00+00:00",
            "helpful_count": 6,
            "mal_id": 90925,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/309411.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hectotane",
                "username": "Hectotane"
            },
            "url": "https://myanimelist.net/reviews.php?id=90925"
        },
        {
            "content": "Senran Kagura drowns itself in it's own mediocrity. It has most of the basic elements in the series, but it falls short in most areas and never quite delivers. I held on through the story, but 12 episodes was more than enough, in fact, I wish it was halved. At times I enjoyed it, and others I couldn't wait for the episode to end. \r\nI'll keep it short and sweet. It really had a volatile mix of ingredients. It had good artwork, but they focused too much on sex appeal and didn't put enough attention into anything else. The sound was tolerable, but I wishit had better music.The voice acting was mediocre, they didn't focus enough on character development, and I found that I didn't have enough invested in them to like the characters. I just kept waiting for it to get good but it didn't. It was seriously lacking in so many areas. The story even was super simple and not satisfying.  \\n\\n\r\nIf you're into panty shots, skimpy clothed teenage girls fighting, and low quality voice acting, then you may enjoy this series. It has a predicable story (what little there is), and it's filled with simple cliche characters. It really is on the the bottom border of being mediocre as far as action anime series go. Don't expect anything more than you get from the beginning, because it does not deliver. So why the 6 overall? I did use the word \"volatile\" when describing it. It's good and bad at the same time, but I think 12 year boys will love it.\\n\\n\r\nIn short, I don't think it's a \"must avoid\" anime series, but I won't be watching it a second time.",
            "date": "2013-07-27T14:46:00+00:00",
            "helpful_count": 4,
            "mal_id": 107115,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/568293.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 6,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/explicit707",
                "username": "explicit707"
            },
            "url": "https://myanimelist.net/reviews.php?id=107115"
        },
        {
            "content": "I won’t use any arbitrary numbers for the duration of this review. Senran Kagura is a series I picked up from a trailer I watched for Senran Kagura: Burst and let me tell you, I was just so fascinated. A fighting game where we pit scantily clad high school girls against one another and fight to destroy the other girls’ clothing? Count me in. WHY AREN’T MORE DEVS DOING THIS!? Then I realized there was an anime and manga series that fleshes out the legend of this mysterious series’ origins. Then it donned on me that this is not something I’d enjoy. I’m really ata loss for words with this one, because it wasn’t anything I didn’t expect. In fact it was so within my expectations I can’t give it a bad rating (not that it matters), because, let’s be honest, people eat up ecchi material regardless of the content or context. Criticizing this series for being ecchi isn’t really fair, because it is unapologetic and forward with the idea, it only really starts to dip in quality when it expects you to care about the characters and the story(?) that was going on, but I’m not a prude. I can accept panty shots, jiggle joggers and high pitched peeping as staples of the anime industry when it’s lacking in substance otherwise. That’s fine. In all seriousness, Senran Kagura wasn’t bad, it was just normal, which I think is part of what disturbs me about it. That we’re so used to this style of storytelling that it doesn’t faze us anymore, but that’s a story for another day.\\n\\n\r\nAs far as animation and other technical aspects of the show, it wasn’t terrible. It was fluid and appropriate albeit you can tell when parts were rushed. I’d venture to say that the series could have benefitted from more expansion of the plot and less booby bounces, or the opposite where there was less story and ONLY BOOBY BOUNCES. The finished product looks more like a mess when the finale comes around as a result, but maybe that’s what OVAs are for. Or maybe I’m expecting too much out of my anime these days.\\n",
            "date": "2016-03-01T17:35:00+00:00",
            "helpful_count": 3,
            "mal_id": 212054,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4483061.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/fullmetaljo",
                "username": "fullmetaljo"
            },
            "url": "https://myanimelist.net/reviews.php?id=212054"
        },
        {
            "content": "I normally love Action/ecchi anime, but I just couldn't get into this one and dropped it after five episodes (I watched the dubbed version).\r\nThe only reason I am writing this review at all was to point out the one aspect I did like, because no other review I read bothered to mention it. The narrator/voice over guy's observations were by far the most amusing thing about the show.\r\nStory:\r\nI thought a story about girl shinobi would be good, but it never really went anywhere. I learned basically nothing about the girls, the clans or anything really in the episodes I watched. And way too much timewas spent on showing the girls cleavage in the episodes I saw and not enough time spent on action.\\n\\n\r\nCharacters:\\n\r\nAs one dimensional as their faces. I didn't grow to like any of them.\\n\\n\r\nArt\\n\r\nPretty poor. The girls faces seemed very one dimensional, using shiny spots on the cheeks for definition and quite often the girls noses were just drawn as nothing more than a dot on their face (similar style of animation to Katana Maidens if you've seen that one). Would have been tolerable if story line was more enjoyable.\\n\r\nBeing an ecchi, I expected the girls to have large breasts, but most anime will give us some variety in size. In this one it's overly large, overly round, completely ridiculous looking breasts for all, no matter how petite they are.\\n\\n\r\nSound:\\n\r\nNothing stood out either way, not that I really pay that much attention to it when I am watching. \\n\\n\r\nOverall: \\n\r\nI would skip this one, or go into it with very low expectations so it doesn't disappoint.\\n\r\n I give it a generous 4.5 out of 10, only because I didn't complete the series.\\n\\n",
            "date": "2018-07-12T04:04:00+00:00",
            "helpful_count": 1,
            "mal_id": 283783,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5125927.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Jezza_G",
                "username": "Jezza_G"
            },
            "url": "https://myanimelist.net/reviews.php?id=283783"
        },
        {
            "content": "Senran Kagura is an anime about female ninjas that go to a super secret school. It’s based on a 3DS game of the same name. It should be pretty obvious that this is an ecchi anime that is 85% fanservice and 15% actual plot, and it is. You have the Hanzou Academy, for the virtuous ninjas and there is another school for evil ninjas called the Serpent Academy. The anime is basically just these light and dark factions fighting against each other.\r\nI generally don’t mind ecchi series, I happen to like a few (Jungle de Ikou, anyone?), but this one was just a little toocliche and boring for me. The story is trite, the character archetypes are overused, they pretty much cover every sort of fanservice possible… if you really don’t care about story or characters and are more interested in unrealistic boobie physics, then this is the show for you. It really wasn’t for me…",
            "date": "2013-03-30T21:48:00+00:00",
            "helpful_count": 2,
            "mal_id": 91693,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2071271.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/kiokushitaka",
                "username": "kiokushitaka"
            },
            "url": "https://myanimelist.net/reviews.php?id=91693"
        },
        {
            "content": "So five busty girls is apparently what pulls people into this one. Each having their own small back story which is nicely explained by the narrator so I don't have to hear too many sob story about how their live was like before the actually series started. Don't get me wrong I'm ok with a little backstory, I just don't like when one is full of nothing but tears and sadness, only to find that the person we see now doesn't really connect with said backstory. Fairy Tail is a good example of good back story, telling the whole thing, both the good and thebad, The Whole Thing! \\n\r\nSpeaking of which why is that is almost every fighting scene, clothes are being blasted off and everyone is fighting in their underwear? I don't care if people use the \"magic\" excuse (the idea that anything that you can't really explain through any logical reason is magic) o.k? Your not Gray Fullbuster, you don't use ice magic, you don't need to strip down to your underwear in order to get in touch with the cold! \\n\r\nOn the plus side there are a silver-lining, having good characters is important and I feel they do that pretty o.k. Especially the supporting characters from the dark side, when you hear their story and watch how and why the interact with one another the way they do, while it may seem mean, is all for good reason. To the point where you may start thinking about who is the real bad guy here?\\n\r\nAs far as fanservice is concerned, I'd say it's 35% fanservice and 65% story. I don't know maybe I'm missing something that you see but what I think. Other than the whole underwear thing, which is not hot unless your a kid that is retarded or has down syndrome (and I mean the legit stuff, not the \"oh your so stupid\" bullshit). \\n\r\nThis show did have it's ups and downs, but I think that if they decided to make a sequel to this show, it would give them another chance at fixing some of those problems in the first story, and personally I like to see a show all the way through to the end and just have it cut off halfway through like most anime seems to be doing.",
            "date": "2014-06-23T08:33:00+00:00",
            "helpful_count": 0,
            "mal_id": 148203,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 10,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Sonic-Speed17",
                "username": "Sonic-Speed17"
            },
            "url": "https://myanimelist.net/reviews.php?id=148203"
        }
    ]
]