[
    [
        {
            "content": "Loads of anime have a hard time being original, espacially in the comedy genre. Hoozuki no Reitsu has been a fresh breath of air. I mean, how often do you see the king of hell being treated like a little punk. Hoozuki is a badass.\r\nStory: 7\r\nThe anime is episodic and does not follow a story with a clear end goal. It revolves around the funny cast and their interactions. The consept they used with the multiple hells and meetings between their respected cheif was brilliant. \r\nArt: 8\r\nThe art is just awesome. The way they incorporate old classic japenese art into the background is fantastic. Theanimation is good for a comedy anime and the designs are pretty unique as far as I have seen.\\n\\n\r\nSound: 9\\n\r\nTHis is one of the strongpoints of this serie. The opening theme keeps playing in your head, it's hard to get rid off. Well timed sounds and music always seems to crack me up, and that is somthing Hoozuki no Reitsu does well.\\n\\n\r\nCharacters: 9\\n\r\nI Love most of the characters. Some of them have a bit of background story based on old asian folklore. Most of the characters are pretty likeable and doesn't turn sour and annoying. I have to say that the characters were really well casted. Fitting voices for everyone. Perfekt for dry jokes (I'm a big fan).\\n\r\nEnjoyment: 9\\n\r\nI'm launghing out loud every episode, that's actually quite rare in my case. I'm having tons of fun watching it (it's still finished at the time I'm writing this).\\n\\n\r\nOverall: 8\\n\r\nI have a hard time giving any comedy anime higher then 8. Mostly due to the lack of any deeper meaning. This anime is both unique and hilarious. It makes the most out of every character and non of them betrays my expectations\\n\r\nEdit: I have finished the series completely now and my opinion has not been altered in any way. I have watched alot of anime and this is definitely one of the better comedies.",
            "date": "2014-04-29T06:36:00+00:00",
            "helpful_count": 66,
            "mal_id": 141753,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1461781.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vallety",
                "username": "Vallety"
            },
            "url": "https://myanimelist.net/reviews.php?id=141753"
        },
        {
            "content": "This is one of those animes that just make you happy. \r\nI have to say I quite like the layout of the series and how it's made up of lots of mini stories.\r\nIt makes it easy to watch and you can just play it whenever you just feel like having a laugh.\r\nAlso throughout this series you come to love the main character. \r\nHe's got dark humour, always seems to know what he's doing and is literally the strongest and most sadistic person in hell (although maybe I'm not making him sound appealing). \r\nI would highly recommend watching the series, it's something with character so thatyou will actually remember as well (unlike a lot of animes nowadays which follow similar styles and trends-not to say they are bad though)\\n\\n\r\nOh and the art style is brilliant!",
            "date": "2014-04-11T15:56:00+00:00",
            "helpful_count": 47,
            "mal_id": 139599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fuggyber",
                "username": "Fuggyber"
            },
            "url": "https://myanimelist.net/reviews.php?id=139599"
        },
        {
            "content": "The afterlife consists of Heaven and Hell. The Japanese hell is divided into Eight Fiery Hells and Eight Frozen Hells, while those are further subdivided into 272 sections. In both our world and the afterlife, proper governing requires sound decision-making. Unfortunately, there are far more charismatic leaders than there are wise decision-makers. The Great King Enma, may be the ruler of all the above, however Hoozuki, the chief of staff to his greatness is the one owning the attributes of both charismatic leader and wise decision-maker. And even after all of the minor torture, experiments and cold blooded pranks his assistant puts Enma through, ittakes quite a long time for the gigantic but naive Daiou sama to realize that Hoozuki would make a better Great King. Although the facts from Hoozuki's perspective follow that kind of process: I am well-suited to working on site, my position enables me to whomp you, the toughest man in hell, while manipulating that very hell behind the curtains, what could be better?\\n\r\nKaburaki Hiro may have directed renown romances such as Kimi ni Todoke and Tonari no Kaibutsu-kun, however, Hoozuki no Reitetsu feels like Gintama's cuter, little cousin. In each autonomous episode a new comical story unfolds, occasionally accompanied by black humor. What is also similar to Gintama is how the show does not have a clear goal, the last episode could be whichever one as well as mistaking the order of the episodes does not necessarily harm the flow of the anime. At times, anime of that sort, lacking in excitement or suspense and agony, have a different charm, as the enjoyment is more instinctive and less tiring. Of course, the number of episodes is not a substance of insignificance, for the more episodes one have watched the better he will enjoy the upcoming, because you steadily grow attached to the characters and come to like more of the anime's nature as it progresses.\\n\r\nThe concept of a comedic guiding through the bizarre sections of hell, might seem unappealing initially, even gloomy or scary, but this certain show deviates greatly from that notion. Hoozuki no Reitetsu affects positively as its main purpose is making fun of the way we imagine hell to be using intriguing stories with their foundation lying in historical, traditional, Japanese folk tales. The flaming mirror that will present all of the embarrassing moments of one's mortal life is actually the monitor for all the hidden cameras on earth, the most savage torturer goes by the form of a furry rabbit with high pitched voice and tanuki traumas. \\n\r\nAll of the cast in general, has its own story to tell, and without vast amounts of screen time they remain alluring and intriguing. Hoozuki's only rival is a Chinese medicine expert working in Shangri-la-the equivalent of Heaven-leading a life directly related to booze and women, unlike his heavenly position and his polar opposite, Hoozuki, whom aside his sadism, remains surprisingly moral and intact. Moreover, two of the most prominent subordinates of Hoozuki are the minions getting the most development and having the feel of mascot like characters. Karauri-the Japanese pronunciation of Crowley, holding the same meaning as \\n\r\nD.Gray-man's Crowley, as the name is most likely taken from Edward Alexander Crowley (Aleister Crowley), existent person and known for rejecting the fundamental christian faith to pursue an interest in Western esotericism and founding the religion and philosophy of Thelema-he is the more serious and reserved of the two, but hiding a perverted side which equals to pure adoration for the adult ladies around him, adding cuteness to both of them. And Nasubi, his constant companion and co-worker, Nasubi's outer appearance make him look either utterly retarded or permanently stoned, despite that he is a natural genius when it comes to art and most of his actions accidentally end up contributing to something notable in the anime.\\n\r\nWit studio released the anime in 2014 while the manga had its original run at 2011, therefore the art is quite a strong asset in Hoozuki no Reitetsu. Bright, unique and exceptionally graphical with the character's movements never being inadequate in cohesion. The visuals are startlingly beautiful at times, while utterly distinctive at all times. One of the show's best qualities is how it shows off traditional Japanese art, which property might render the background as childish drawings in paper at times, but intentionally matches the historical and narrative nature of the anime. In addition, the art is not just pleasant to watch due to its folk tale appeal but also about the interesting material it has to offer, each scene is poured with imagination and originality, the background on occasion stands still separating the characters from it and having them look as if they're performing on stage, but the scenes rest unique.. from the goldfish garden to Sangri-la's medicinal forest. \\n\r\nIn Hoozuki no Reitetsu, being knowledgeable in the Japanese culture will assist you in grasping a complete understanding of the humor, however the explanations are thorough enough for the average viewer to understand them. In spite of this, the fact that it frequently makes use of traditional history and myths remains. One might be reminded of Naruto, as words like Susanoo, Amaterasu and Orochi will be mentioned, and at the same time acquiring the chance to deepen the meaning of them. When it comes to the sound, it more or less wavers between the same lines. The opening theme is a funny song created solely for the series and performed by the main voice actors, while its cheerful rhythm remains at the back of your head. Furthermore, all of the seiyuus voices match the character's personality perfectly while resonate surprisingly imposing, which helps in focusing on them. Lastly, narrator for the series is Junji Inagawa, hugely popular as a producer and narrator of ghost stories, he becomes the last component of Hoozuki no Reitetsu success. \\n\r\nThe anime itself might not be immensely well-known, but the manga has met a lot of recognition, with quite a few of best selling achievements and often rated in the top ten of several manga charts. All in all, Japan's hell is a multi section hell, and all together, it has 272 sections.. The cool-headed Hoozuki is the only demon fit to properly rule them all, and that demon ogre working under the Head Judge of hell makes it a worthwhile comedy.",
            "date": "2015-09-03T16:27:00+00:00",
            "helpful_count": 20,
            "mal_id": 197757,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3933117.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Megami",
                "username": "_Megami"
            },
            "url": "https://myanimelist.net/reviews.php?id=197757"
        },
        {
            "content": "I just finished watching this anime and I have to say that it's brilliant! Art and animation etc are all great. Story is minimal, its an episodic anime but it has quite an interesting cast.\r\nI pissed myself at some of the jokes but many of them are very Japanese orientated and if you aren't really knowledgeable about the culture a lot of these will fly right over your head.\r\n When I saw the first episode I was a little confused; it's a somewhat strange anime., but I ended up getting hooked by the second episode.\r\n The opening and ending credits are quite weird but alsoreally fun, it was one of the few anime I watched the opening and ending credits for every episode. I highly recommend watching the closing credits at least once or twice as they are part of one of the best jokes I have ever seen in any anime (this comes up in the last episode).",
            "date": "2015-04-08T01:22:00+00:00",
            "helpful_count": 13,
            "mal_id": 185125,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278087.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Parabi",
                "username": "Parabi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185125"
        },
        {
            "content": "There aren’t many anime in the comedy genre that does well what Hoozuki no Reitetsu has done. That is delivering an amusing tale that parodies a mythology. And it is made even more interesting as it teaches you the history behind the mythologies portrayed in the show. \r\nThe show operates under the premise that the viewer has a basic gist of Japanese Hell, as well as other worlds such as European Hell and Chinese Heaven. It follows the character, Hoozuki, a very sadistic, no-nonsense-but-sometimes-I-want-my-own-fun, advisor to the King of Japanese Hell in a slap-stick and often subtle humor that takes a little thinking of theviewers’ end. \\n\\n\r\nThis comedy isn’t just a show where there are simply running gags, well-delivered punchlines, and clichés that you would typically see in a comedy. The jokes in the show evolve. That is because in HnR, the incorporation of different mythologies permits that. You see interactions that you normally wouldn’t see between demons of Euro Hell when meeting their Japanese counterparts. The jokes and gags become even more complex as new characters are introduced, but never does the complexity of a joke require too much information of the actual mythology for one to understand.\\n\\n\r\n One could almost hear the writers thinking ‘What would happen if Lucifer and Enma meet?’ or ‘How do we make a demon piss his pants?’ Suffice the say, the results of the writers’ and directors’ efforts are successfully pulled off and you’re left with one hell of a hilarious concoction. \\n\\n\r\nOne of the most fascinating things about the show is the back stories of each character. They’re minced in with truth and fiction, and most of the time they form a very volatile kind of humor that are brought out by the characters’ interaction with each other. IE Hoozuki and Haku, Hoozuki and Enma, Haku and the various women of each Hell, among many other combinations. However, you begin to see a pattern that different combinations have different dynamics, but none I assure you, are boring. Each have their own personality as dictated by the history they’ve been given by the real world, putting you at the edge of your seat to see how they react to one another’s antics. \\n",
            "date": "2014-09-02T06:15:00+00:00",
            "helpful_count": 8,
            "mal_id": 158913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2799905.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jammin_Rabbit",
                "username": "Jammin_Rabbit"
            },
            "url": "https://myanimelist.net/reviews.php?id=158913"
        },
        {
            "content": "No Spoilers.\r\nThis show was pretty enjoyable and quite humorous.  It made me laugh a lot, and I liked the way they incorporated traditional myths into their worldbuilding.  The light-hearted treatment of effecting eternal torment is tactfully done and adds a lot to the ability of the show to deliver some continuous laughs.\r\nBut there were things which put me off from this show as well.  Notably, the consistent direct-face shots of the characters speaking was repetitive over time.  The way the demon characters' teeth would be drawn in such shots just made me feel weird, not in a good way.  Iget the metaphors and allegory they were trying to impart through it but it still got old.  Also Hoozuki's character is pretty annoying in the long run, and I found myself commiserating with the people who wanted to see him fail, which I don't think is the intention of the authors.  Finally, I'm a binge watcher and this show had the same effect that Maria Holic gave, where it's consistently funny but gets almost droning after one episode.  It's very conducive to the weekly episode format, however, so it's hard to fault the creators for that.\\n\\n\r\nAll in all a very funny and well-done anime which I feel deserves an eight on a more objective level, but which I gave a seven primarily for personal reasons.  I'd recommend this anime to anyone who likes cleverly-written comedy, can stand condescending MCs, or who likes classical eastern mythology.",
            "date": "2019-02-01T01:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 300574,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4065865.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Unconfidence",
                "username": "Unconfidence"
            },
            "url": "https://myanimelist.net/reviews.php?id=300574"
        },
        {
            "content": "Hoozuki no Reitetsu\r\nReview By: John Fragglepuss Evans\r\nHoozuki no Reitetsu uses a lot of Japanese mythology and history in its episodes. For example, there are many different levels of Hell for people to be sent to, based on their wrongdoings in life. There is an animal cruelty hell, where people are sent that abused animals in life. In this hell, the animals abuse the people relentlessly. The whole Hell system in the anime runs like the normal world does, with demons taking jobs and being able to travel to the different sub-hells. They even put on festivals and Satan from European Hell comes for a visit.\r\nYoumight enjoy this if: You want to watch slice-of-life in Hell.\\n\\n\r\nYou might not like it if: You want character development and a continuing storyline.\\n\\n\r\nNote to the Viewer: Be prepared to pause the anime if you are not familiar with Japanese mythology. Subtitles will pop up with an explanation of what is happening, but they do not stay up for long.\\n\\n\r\nEXPANDED REVIEW FROM SLC ANIME: WARNING, MAY CONTAIN MINOR SPOILERS!\\n\\n\r\nSLC Anime reviewed Hoozuki no Reitetsu as their anime of the month and this is what they thought of it. We will start with the positive parts of the show. The focus on Japanese folklore was appreciated by the group. There were a lot of references to folklore in every episode, which were mainly Japanese, with a few Western references peppered in. The group liked the animation style of the show as well. The characters were well done, each having a unique look and personality. The only criticism of the characters look was that Hoozuki’s single horn in the middle of his forehead was annoying.\\n\\n\r\nOne negative review of the anime that was shared by several people was that the episodic nature of the show did not engage the viewer. The episodes did not end and make you insist on watching another episode. The lack of an involved storyline made the show difficult to finish for some group members.\\n\\n\r\nThere were mixed reviews regarding some aspects of the anime. The humor was enjoyed by everybody, but some group members enjoyed it more than others. Some people thought that the jokes took too long to set up, or that the punchline of the joke ran flat. Other people thought the humor was spot on, being very dry.",
            "date": "2015-04-20T20:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 186105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4571079.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fragglepuss",
                "username": "Fragglepuss"
            },
            "url": "https://myanimelist.net/reviews.php?id=186105"
        },
        {
            "content": "This is the first anime I've felt compelled to write a review for, only because I want you to know this anime is worth watching. \r\nFirstly, you should know this anime isn't for everyone. It has no story line, and no real character development because of this. Everyone is the same in the last episode as they were in the first episode. For me, that's perfectly fine and I actually preferred it in this case, because the characters are excellent. This isn't really a show you're going to binge, but throw on when you really just want to relax and enjoy something.\r\nI gave this animea 10/10 in every category, except \"overall\" which I gave an 8. What I meant by that is: if this is the type of anime you would enjoy, you're going to really, really enjoy it. If this isn't your style, you probably would still like it, but you're not going to say it's \"outstanding\". \\n\\n\r\nStory: It's one of the more genuinely creative anime you're going see (not the \"wacky for the sake of being wacky\" creative). It's pretty darn funny too, although your level of understanding of Japanese culture is going to effect how much you laugh. (For example: they make a KFC joke that some people are going to find hilarious, and others may not get). There's also many, many references to Japanese/Chinese folklore. As a history buff, this was probably my favorite part of the show.\\n\\n\r\nArt/Sound: They absolutely killed it here. Everything about the art and sound is perfect for this show, and it feels extremely organic. The character's voices couldn't be more spot-on. And the opening/closing songs remind you of waking up early to watch Saturday morning cartoons; you know once you hear that jingle, you're about to be in your \"happy place\".\\n\\n\r\nCharacters: Again, no character development. But each character is great at what they do. \\n\\n\r\nEnjoyment: If I had to choose one word to describe this show, it'd be: charming. This show is charming and sincere. Nothing feels forced, it moves at a great pace, and I really believe that if you're into comedy/historical/sitcom type shows, you're going to love this.\\n\\n\r\nAgain, it's not a show you're going to rush to download and then binge watch. You will probably be disappointed that way. But if you just want to watch something with the intent of relaxing and enjoyment without any expectations, you are truly in for a treat.",
            "date": "2016-11-19T08:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 234012,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5447860.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sweatpantspapi",
                "username": "sweatpantspapi"
            },
            "url": "https://myanimelist.net/reviews.php?id=234012"
        },
        {
            "content": "This is my first Review ,I hope you like it.\r\nThis Anime was a life saver, i have been feeling bored for a very Long time and havent been able to watch many animes in the past few weeks but this anime saved me. It was funny ,sincere,full of references that could reach the level in Gintama ,here is the status :\r\nArt: 9 , the art is really unique and you feel that  it is new, although its close to a comical one but its truly fantastic and special in its own way .\r\nMusic : 8, The music is really  more to the Funside than the Epic Side  , Its the kind of music that you dance to ,ALONE!! \\n\r\nThe music was really fun and interesting and very different than what we hear these days in Anime.\\n\\n\r\nCharacter :  8,  This series has many characters and all of those characters had their own specific time on Air , there isnt any character development because it is not the kind of series which needs one , The characters are all different and memorable and funny in thier own way.\\n\\n\r\nEnjoyment: 10, This series encouraged me to write my first review because of how FUN AND AMAZING IT IS , I am not the kind of person who likes comedy or anything like action, i watch psychological, tragedy ,supernatural genre And this name was surprisingly more enjoyable than animes like OPM or any other normal comedy .\\n\\n\r\nTO DESCRIBE THIS ANIME IN ONE WORD IT IS \"FUN \"",
            "date": "2016-09-29T04:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 230518,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5523660.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheHonest_Senpai",
                "username": "TheHonest_Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=230518"
        },
        {
            "content": "This show aaabsolutely cracked me up. It is full of dry humour, which I love, so I guess it is a bit of a biased review in that sense. It is episodic, often episodes are split into two stories. \r\nAll the reviews here go into detail about the story and characters so I'll leave that. I found it to be supremely enjoyable to watch. Easy-going, good light watch, funny enough that I'll probably watch it again sometime. I'm sure there are tropes in here, but unlike many anime (and other genres), you don't sit there and notice them like you do with most series thesedays. \\n\\n\r\nDue to the fact that I laughed multiple times through every episode, and had a low-key permanent grin on my face throughout, I'd say it's one of my favourites. It aims only for comedy and it delivers. I absolutely recommend you watch it. I do wish we got another thirteen episodes of shenanigans, but there's so much going on that I'm sure I'll discover things I missed the first time around.\\n\\n\r\nOne thing to note: you should have your finger at the ready to hit pause, as there are many cultural jokes and references that are explained, but often too briefly to finish reading.",
            "date": "2016-03-18T01:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 213224,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4976127.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MsCommunication",
                "username": "MsCommunication"
            },
            "url": "https://myanimelist.net/reviews.php?id=213224"
        },
        {
            "content": "I'll cut the whole \"i don't normally write reviews\" short and get right into why I would rate Hozuki to be one of my absolute favorite anime. \r\nPersonally, I enjoy thriller, mind-bending, mysterious, or sometimes a (guilty) pleasure of an occasional Kamisama-kiss type romance. If I'm watching a comedy, I enjoy good sarcasm, irony, and satire like references...especially considering the kind of strong hold Japan has on a possible mainstream show. \r\nWhy Hozuki? Almost every character is unique. Sometimes an anime will have a great story, great personalities, amazing art, and wrap it all up at the end with an amazing twist. However, the viewercan feel a bit unsatisfied, as if they didn't get what they either wanted, or expect to feel from the show. \\n\\n\r\nHozuki is an anime where you wish the characters existed. That weird feeling where you want more of a particular character, almost as if you need it! I understand we are all a fan of any particular show, but to pull of this feeling many people get from anime, manga, or novel can prove difficult. \\n\\n\r\nThe childish theme song in the beginning may have lost a few viewers. Maybe the art will turn others off. Perhaps the overall mood when watched haphazardly will seem a bit lame. BUT. \\n\r\nThis show is far from a child show. The humor is relatable, the characters act as normal people would if thrown into hell. The business feel, the actual history, and the idea of special sections designated to certain sinners can inspire any imagination. \\n\\n\r\nEverything about this show is original. Whether you are an aspiring artist, writer, or creative thinker...or just a casual anime fan..this show is something I HIGHLY reccomened. Whoever created this show has a beautiful mind and I am looking forward to the next season!",
            "date": "2017-08-15T19:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 255557,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5994751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/diabolicalx",
                "username": "diabolicalx"
            },
            "url": "https://myanimelist.net/reviews.php?id=255557"
        },
        {
            "content": "This is one of my favorite shows, not just animes.  The only problem I have with the show is that you need to pause constantly during your first viewing, because there is so much additional information subtitled in places other than the character dialogue location (so much worse to watch with a DvD player rather than a streaming site).\r\nI couldn't give the story a 10 because it is episodic with no real overarching story, but every episode is funny.  It is a show that I was hesistant about because the pictures displayed on the info page didn't strike me as great, but Iwas very wrong to be worried.  There are tons of jokes and references that a westerner will have difficulty understanding (being ready to google a bit can make the story more enjoyable), but enough jokes do land that you won't mind not getting a few.\\n\\n\r\nThis is a great twist on typical slice of life stuff and incredibly funny.  The main character may just be the ultimate overpowered slice of life character (is that a thing even?!) there is. If you like comedy, you'll like this show.  The second viewing is much better than the first; if you felt \"meh\" after watching it all the first time, you need to try again, because it just gets funnier everytime you watch.",
            "date": "2017-04-13T19:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 245439,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dunedane",
                "username": "Dunedane"
            },
            "url": "https://myanimelist.net/reviews.php?id=245439"
        },
        {
            "content": "If brutal honesty in polite situations is your idea of comedy, this show delivers!\r\nStory (6)\r\nStory wise, it's mostly just slice of life / office storys; most don't even have a real story arc. The Setting is japanese hell and chinese heaven; japanese hell seems pretty accurate and well researched,  and the enviroments unique propertys are used for comedy. As for chinese heaven, it's only a side thing; they're rarely there, but it seems fine, but you already notice that they don't use the places full comedic potential (also way less respect). It only gets really obvious when they talk about western ideas of hell(and western hell characters) that the author obviously didn't bother to research any of it. Pretty inaccurate, i mean dantes inferno is prety explicit about the topic, but it doesn't look like the author bothered.\\n\\n\r\nArt (7)\\n\\n\r\nThe Animation itself is okay, tho not aoutstanding. The backrounds are pretty standart too. They sometimes use scrolls in a different style to explain studd, so that's pretty neat. The Art only really shines in the Character designs; they all have different, unique faces, that are still pleasant to look at, and still instantly recognisable. Even the girls. The colours are also well done, both in the chracterdesigns and the backrounds. It's different and still easy on the eyes.\\n\\n\r\nSound (7)\\n\\n\r\nMusic is okay, and fits the  scenes. Sometimes it is used for comedy, but the voice actors usually provide most of it. And that pretty well! They manage to play characters more than stereotypes, and go over the top in different ways; the variations help making every charcter stand out more. \\n\\n\r\nCharcter (9)\\n\\n\r\nThe best thing about the show are it's characters; they are familiar types, but either pushed to an extrem, or with a  twist, which makes them unique enough to be enjoyable. The main characters is the typical \"strong and silent\" type, mixed with a\"pretty but stern\" personality; the twist is that he's a total asshole, by crushing everyone with his brutal honesty. Judging everyone even though he himself is pretty wierd too. And childish; the funnyest episodes are in my opinion, the ones where he plays of his \"rival\" whom he hates for a very trivial reason, and just goes above and beyond to make his life miserable. My only complaint would be that everyone likes him too much, and that he rarely has to face consequences for his deeds. Still really great.\\n\\n\r\nEnjoyment (9)\\n\\n\r\nMost jokes work great, and a lot of the characters are great at working off of each other. There are few jokes that don't work\\n\r\n (for me personlly the european hell stuff, because a) the infos they have are often just wrong and b) it's one of those \"japan is better than everything\" stuff)\\n\r\nBut if assholes being rude to each other and a kind of british humor sounds like fun to you, it's very entertaining\\n\\n\r\nOverall (8)\\n\\n\r\nWatch the first 3 eps. If you like the episodes and the comedy style, the show (and it's ovas) just bring it (comedy wise). If you're looking for a deep story or character arcs, you will be dissapointed.",
            "date": "2017-04-04T06:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 244584,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6115809.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Blaufisch",
                "username": "Blaufisch"
            },
            "url": "https://myanimelist.net/reviews.php?id=244584"
        },
        {
            "content": "For me this anime has been really enjoyable.\r\nThe story is fresh, it is about the hell and how it is divided, and you follow the second in command of the Japanese version of Hell.\r\nIt's story is made full of references to real life legends, urban myths and actual people and contains a lot of jokes as well.\r\nThe art style was very nice to see and despite the fact that i dont like to watch most anime more then once this was definitely an anime i could watch multiple times due to its diversity.\r\nThe music is fun to listen to and sing along to and overalli really like this anime.\\n\\n\r\nI would recommend this to anyone who wants a anime which is fresh in its content and able to learn about some real life facts from Japanese Hell.\\n\\n\r\nIt's one Hell of an anime ;)",
            "date": "2019-01-07T15:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 298358,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4909327.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Legendmons",
                "username": "Legendmons"
            },
            "url": "https://myanimelist.net/reviews.php?id=298358"
        },
        {
            "content": "This was a great anime personally, ill get straight to the point 8/10 from me. \r\nStory:\r\nNow about the story there is none .... You might be thinking well if there is no story how did they manage to put this together, the answer is they made it like there are mini stories within each episode, very smartly put together and the comady is different from the usual intake within other anime out there.\r\nArt style :\r\ndepending on how you look at it, it can be good or it can be bad your own opinion personally its great at times but at other moments it just lacksthe modern type of arts style considering they implemented the mordern era aswell and basing it around hell. \\n\\n\r\nSound: \\n\r\nSame as usual nice simple and the songs are very catchy and some even make you confused but summing it up very nice. \\n\\n\r\nCharacter: \\n\r\nAt first you don't know what to think naturally you wait a few episodes and see what happening and that's what they have done, while bringing new charactes in you get the feel of the main characters past life while also likeing the new characters which is what i like about the show, this makes it easier to enjoy the show it self.\\n\\n\r\nEnjoyment:\\n\r\nThe way the producers have done this is brilliant its different from all the other animes try hard style to get you to laugh. It almost makes it self a rare type not unique but there are hardly any like tgis that makes you laugh atleast twice every episode and depending on your age you will also understand some of the inside jokes and the random BS that happends when they talk ( id get confused and have to watch the sceane twice).\\n\\n\r\nOverall iv said that at the beginning and now ill say it again 8/10 nicely put together rare and something that must go in to your collection of watched animes.\\n\\n",
            "date": "2014-09-02T03:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 158909,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3583859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Unthinkable92",
                "username": "Unthinkable92"
            },
            "url": "https://myanimelist.net/reviews.php?id=158909"
        },
        {
            "content": "If you're looking for a great laugh then this is it. I didn't expect this show to be so funny. I think part of my enjoyment had to do with the characters, Hoozuki especially. He's such a straight faced sadist who does some crazy things. The whole cast is very lovable. Just the way they interact with each other is hilarious.\r\nAnother thing that I liked were the jokes themselves. There are a lot of references that you get, that you don't have to be Japanese to understand them. There isn't much of a plot which is understandable. The show is basically the everyday life inhell and the people that live there. I like that though, because something new is always happening in each episode.\\n\\n\r\nI also want to say that I enjoy anime that shows a lot of Japanese culture and history. There are many stories and real life people referenced that makes me want to research it. Not to mention the setting of the show has a traditional look to it. So all in all, I would try it out. I don't think it would disappoint.",
            "date": "2015-09-12T01:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 198379,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4626830.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jinx-13th",
                "username": "Jinx-13th"
            },
            "url": "https://myanimelist.net/reviews.php?id=198379"
        },
        {
            "content": "Boy am I glad I decided to pick up this anime. I’d been looking for something like Saiki K no Psi-Nan, one of my all-time favourites, and found this on the list of recommendations. The two anime are actually totally different in many aspects, but Hoozuki no Reitetsu definitely filled the void left by Saiki K, at least for a little while.\r\nThe anime was fun to watch, it was interesting, it had an utterly brilliant and hilarious set of characters, and it even ended up teaching me a lot of Japanese folktales and history. Granted, there were a lot of references that I either neededto look up or only knew from other anime/manga, but that isn’t a bad thing so no negative votes on that. It’s actually a testament to the anime that I enjoyed it so much despite likely missing a lot of the references.\\n\\n\r\nOkay, now to the individual parts of the series.\\n\\n\r\nArt/animation – not fabulous or anything, but appropriate for the type of anime that was being shown. It’s a very specific style, reminiscent of the old paintings and drawings associated with the folktales themselves.\\n\\n\r\nSound – here I do have to say, I actually couldn’t stand the opening. It was one of the only ones that I’ve ever skipped every time in an anime. That is, until I found out what it meant, and then it just became hilarious. The rest of the sound was great, lots of old style music which again fit in perfectly, and the seiyuus were fantastic. Hozuki’s seiyuu, in particular, managed to capture his character so well.\\n\\n\r\nStory – very episodic, random, and sometimes nonsensical. Many of the stories had a Gintama-like feel to them in the way that events unfolded or the way the characters reacted to them, and especially due to the amount of (well-handled) gag humour.\\n\\n\r\nCharacters – absolutely great. The cast was lively, quirky, interesting and hilarious. From the bumbling king of Japanese Hell to the whimsical playboy Hakutaku, the cast of somehow adorable trainee torturers and especially the utterly deadpan ‘coolheaded’ yet brutal general secretary Hozuki, there will always be someone who is enjoyable to watch. The characters don’t really get much in the way of development, it’s more about exploring their lives and the events happening around them than seeing how they grow throughout the series. \\n\\n\r\nI guess you could call it a satire, or parody of the slice-of-life genre, but basically, it’s just a lot of amusing and entertaining insights into the life of an administrator of hell. Exactly what it says.\\n\\n\r\nI’m not entirely sure who to recommend this to, but if you like series with a lot of deadpan humour, episodic stories or general randomness – like Gintama, Saiki K, Arakawa Under the Bridge, One Punch Man, or Nichijou (The daily lives of High School Boys), try checking this out. XD\\n",
            "date": "2018-01-16T07:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 268738,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=268738"
        },
        {
            "content": "If you like dry, slightly absurd humour and have a passing familiarity with Japanese folklore, I strongly recommend Houzuki no Reitetsu. It takes a couple episodes to get going, but the dry humour is great and the characters are a joy.\r\nContent Advisory: episode 3 part 2 has the old \"is it a man or woman\" transphobic chestnut as the foundation of an extended joke. Hakutaku and Houzuki had a bet whether the next woman who walked out of a bathroom had a large or small chest; they can't agree whether the person is a man or a woman, and in a later scene where theyactually ask the person - she's a non-op trans woman - the two of them argue about whether she's a woman. Again. OAD1 also has a gag about a person of indeterminate gender, where being trans is treated as \"other.\" (I know I know, cultural differences and all that, but I'm writing this review in English about an anime licensed in North America, as an anglo North American.)\\n\\n\r\nThe series generally has a casual attitude toward death, pain, and suffering, and the various tortures are more slapstick than horrifying. On the other hand, the series condemns animal abuse and sexual assault-via-alcohol (rare mentions). \\n\\n\r\nHumour is always a subjective thing, and HnR is a love-it-or-hate-it kind of show. A lot of the humour is in the ways characters bounce off of each other, not just references or punch lines, or in the juxtaposition of serious & silly. Some references are obvious (Lum in episode 2), and some are pretty subtle (in OAD3, the Addams Family theme music appears behind some dialogue, keyshifted up a bit). The crunchyroll subs do a good job of preserving the puns, and rarely substitute western references for the sake of the joke. Characters slide between the boke and tsukkomi/ridiculous person and straight man depending on the situation, and Houzuki himself has more than a few ridiculous moments. It's comparable to Hot Fuzz, where a lot of the laughs are from Angel reacting to his coworkers' ridiculousness/being ridiculous himself and from parodies of cop movies & rural English life. \\n\\n\r\n(I laugh out loud at least once an episode, and I know there are lots of jokes that go riiiight over my head. It's entirely possible I would rate the series higher if I caught more of the references.)\\n\\n\r\nEach episode is split into two parts, each adapting a chapter of the manga. The pacing is good and the sections don't feel like they're dragged out. (It's much less frenetic than Gintama.) The art is beautiful, with sight gags in the backgrounds based on characters and/or famous paintings. In my opinion the voice acting adds a lot to the experience, including the delivery and easier dramatic pauses. While there is little \"plot\" with each episode we learn more about the characters and the world, opening up more jokes & callbacks. All that said, it takes time to get to know the characters so I didn't fall in love until around episode 3. \\n\\n\r\nI enjoy all of the characters I've met so far. They start as fairly stock characters, but the longer we see them the more we discover. Houzuki is both a good boss and a horrible underling, and he can act on a grudge and be nice to children within the same scene. (His seiyuu, Hiroki Yasumoto, does a fabulous job mixing deadpan delivery with Houzuki's not-very-buried rage; I like him much better here than as Germany in Hetalia.) Nasubi is both an airhead and a thoughtful artist; Hakutaku is a doctor and ladies' man who respects no, but he's happy to learn about other pursuits. Houzuki and Hakutaku's rivalry is in more than their don't-want-to-acknowledge-them similarities (and is a gift to rival shippers, just saying). In turn, this means that the characters are more than one trick ponies joke-wise and can support a wide range of stories.\\n\\n\r\nI'm solidly in love with the series. I had originally passed on this series because I read a (very) critical review of the first seven episodes, and I regret that now. After the first time or two through an episode - so that I get my giggles out - episodes also make for good background entertainment (like while farming in an MMO, or organizing computer files); Houzuki's voice is strangely calming. \\n\\n\r\nBottom line: This is one of the few series where I finish an episode then immediately want to see it again. I enjoy the rest of the series enough to forgive episode 3, though I skip that part when I rewatch.",
            "date": "2017-10-12T21:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 260634,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6477851.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/silvery-saber",
                "username": "silvery-saber"
            },
            "url": "https://myanimelist.net/reviews.php?id=260634"
        },
        {
            "content": "A fun, easy to watch and quite a refreshing comedy anime - is what I would say about Hoozuki no Reitetsu if I were asked to describe it in a single short sentence.\r\nStory (7)\r\nThe story in Hoozuki no Reitetsu is really all about the characters and their interactions with each other. For the most part, their interactions don’t change much (if anything) in the grand scheme of things and the episodes aren’t really connected to each other, except some minor changes that happen along the way. Each episode is more or less its own, and that can be either a good or a bad thing,depending on the person, but I personally think it’s an ok thing, seeing as the series doesn’t have a big goal to move towards, and nothing major changes from episode 1 to 13.\\n\\n\r\nArt (8)\\n\\n\r\nI don’t have much to say about the art style, other than: it looks different from the usual anime style and is pleasing to the eye.\\n\\n\r\nSound (8)\\n\\n\r\nThe OP song is pretty catchy and in fact it’s still stuck in my head as I’m writing this review. The sound effects throughout the show weren’t out of place and I found the voice acting to fit the show and its characters well.\\n\\n\r\nCharacter (8)\\n\\n\r\nPerhaps the part of the show that shines the brightest for me, the characters were interesting and I found quite a bit of enjoyment watching them interact with each other and the world around them. As far as I can tell, there were no characters that were annoying or brought the show down in my eyes for any reason.\\n\\n\r\nEnjoyment (8)\\n\\n\r\nNo matter how good the story, art, soundtrack or the characters are, it would all be useless if the show just wasn’t enjoyable. Fortunately, Hoozuki no Reitetsu doesn’t have this problem and is a good time all the way.\\n\\n\r\nOverall (8)\\n\\n\r\nThere’s not much else I can say about this show, other than: go try it if you’re a fan of the comedy genre in anime. I doubt this show will disappoint.\\n\\n\r\nP.S. For those that like Japanese mythology, as a fan myself, I noticed a few bits of it here, but don’t go in expecting too much, it’s mostly just a few mentions here and there.\\n",
            "date": "2017-07-26T13:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 253868,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201503.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akan3",
                "username": "Akan3"
            },
            "url": "https://myanimelist.net/reviews.php?id=253868"
        }
    ],
    [
        {
            "content": "Loads of anime have a hard time being original, espacially in the comedy genre. Hoozuki no Reitsu has been a fresh breath of air. I mean, how often do you see the king of hell being treated like a little punk. Hoozuki is a badass.\r\nStory: 7\r\nThe anime is episodic and does not follow a story with a clear end goal. It revolves around the funny cast and their interactions. The consept they used with the multiple hells and meetings between their respected cheif was brilliant. \r\nArt: 8\r\nThe art is just awesome. The way they incorporate old classic japenese art into the background is fantastic. Theanimation is good for a comedy anime and the designs are pretty unique as far as I have seen.\\n\\n\r\nSound: 9\\n\r\nTHis is one of the strongpoints of this serie. The opening theme keeps playing in your head, it's hard to get rid off. Well timed sounds and music always seems to crack me up, and that is somthing Hoozuki no Reitsu does well.\\n\\n\r\nCharacters: 9\\n\r\nI Love most of the characters. Some of them have a bit of background story based on old asian folklore. Most of the characters are pretty likeable and doesn't turn sour and annoying. I have to say that the characters were really well casted. Fitting voices for everyone. Perfekt for dry jokes (I'm a big fan).\\n\r\nEnjoyment: 9\\n\r\nI'm launghing out loud every episode, that's actually quite rare in my case. I'm having tons of fun watching it (it's still finished at the time I'm writing this).\\n\\n\r\nOverall: 8\\n\r\nI have a hard time giving any comedy anime higher then 8. Mostly due to the lack of any deeper meaning. This anime is both unique and hilarious. It makes the most out of every character and non of them betrays my expectations\\n\r\nEdit: I have finished the series completely now and my opinion has not been altered in any way. I have watched alot of anime and this is definitely one of the better comedies.",
            "date": "2014-04-29T06:36:00+00:00",
            "helpful_count": 66,
            "mal_id": 141753,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1461781.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Vallety",
                "username": "Vallety"
            },
            "url": "https://myanimelist.net/reviews.php?id=141753"
        },
        {
            "content": "This is one of those animes that just make you happy. \r\nI have to say I quite like the layout of the series and how it's made up of lots of mini stories.\r\nIt makes it easy to watch and you can just play it whenever you just feel like having a laugh.\r\nAlso throughout this series you come to love the main character. \r\nHe's got dark humour, always seems to know what he's doing and is literally the strongest and most sadistic person in hell (although maybe I'm not making him sound appealing). \r\nI would highly recommend watching the series, it's something with character so thatyou will actually remember as well (unlike a lot of animes nowadays which follow similar styles and trends-not to say they are bad though)\\n\\n\r\nOh and the art style is brilliant!",
            "date": "2014-04-11T15:56:00+00:00",
            "helpful_count": 47,
            "mal_id": 139599,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fuggyber",
                "username": "Fuggyber"
            },
            "url": "https://myanimelist.net/reviews.php?id=139599"
        },
        {
            "content": "The afterlife consists of Heaven and Hell. The Japanese hell is divided into Eight Fiery Hells and Eight Frozen Hells, while those are further subdivided into 272 sections. In both our world and the afterlife, proper governing requires sound decision-making. Unfortunately, there are far more charismatic leaders than there are wise decision-makers. The Great King Enma, may be the ruler of all the above, however Hoozuki, the chief of staff to his greatness is the one owning the attributes of both charismatic leader and wise decision-maker. And even after all of the minor torture, experiments and cold blooded pranks his assistant puts Enma through, ittakes quite a long time for the gigantic but naive Daiou sama to realize that Hoozuki would make a better Great King. Although the facts from Hoozuki's perspective follow that kind of process: I am well-suited to working on site, my position enables me to whomp you, the toughest man in hell, while manipulating that very hell behind the curtains, what could be better?\\n\r\nKaburaki Hiro may have directed renown romances such as Kimi ni Todoke and Tonari no Kaibutsu-kun, however, Hoozuki no Reitetsu feels like Gintama's cuter, little cousin. In each autonomous episode a new comical story unfolds, occasionally accompanied by black humor. What is also similar to Gintama is how the show does not have a clear goal, the last episode could be whichever one as well as mistaking the order of the episodes does not necessarily harm the flow of the anime. At times, anime of that sort, lacking in excitement or suspense and agony, have a different charm, as the enjoyment is more instinctive and less tiring. Of course, the number of episodes is not a substance of insignificance, for the more episodes one have watched the better he will enjoy the upcoming, because you steadily grow attached to the characters and come to like more of the anime's nature as it progresses.\\n\r\nThe concept of a comedic guiding through the bizarre sections of hell, might seem unappealing initially, even gloomy or scary, but this certain show deviates greatly from that notion. Hoozuki no Reitetsu affects positively as its main purpose is making fun of the way we imagine hell to be using intriguing stories with their foundation lying in historical, traditional, Japanese folk tales. The flaming mirror that will present all of the embarrassing moments of one's mortal life is actually the monitor for all the hidden cameras on earth, the most savage torturer goes by the form of a furry rabbit with high pitched voice and tanuki traumas. \\n\r\nAll of the cast in general, has its own story to tell, and without vast amounts of screen time they remain alluring and intriguing. Hoozuki's only rival is a Chinese medicine expert working in Shangri-la-the equivalent of Heaven-leading a life directly related to booze and women, unlike his heavenly position and his polar opposite, Hoozuki, whom aside his sadism, remains surprisingly moral and intact. Moreover, two of the most prominent subordinates of Hoozuki are the minions getting the most development and having the feel of mascot like characters. Karauri-the Japanese pronunciation of Crowley, holding the same meaning as \\n\r\nD.Gray-man's Crowley, as the name is most likely taken from Edward Alexander Crowley (Aleister Crowley), existent person and known for rejecting the fundamental christian faith to pursue an interest in Western esotericism and founding the religion and philosophy of Thelema-he is the more serious and reserved of the two, but hiding a perverted side which equals to pure adoration for the adult ladies around him, adding cuteness to both of them. And Nasubi, his constant companion and co-worker, Nasubi's outer appearance make him look either utterly retarded or permanently stoned, despite that he is a natural genius when it comes to art and most of his actions accidentally end up contributing to something notable in the anime.\\n\r\nWit studio released the anime in 2014 while the manga had its original run at 2011, therefore the art is quite a strong asset in Hoozuki no Reitetsu. Bright, unique and exceptionally graphical with the character's movements never being inadequate in cohesion. The visuals are startlingly beautiful at times, while utterly distinctive at all times. One of the show's best qualities is how it shows off traditional Japanese art, which property might render the background as childish drawings in paper at times, but intentionally matches the historical and narrative nature of the anime. In addition, the art is not just pleasant to watch due to its folk tale appeal but also about the interesting material it has to offer, each scene is poured with imagination and originality, the background on occasion stands still separating the characters from it and having them look as if they're performing on stage, but the scenes rest unique.. from the goldfish garden to Sangri-la's medicinal forest. \\n\r\nIn Hoozuki no Reitetsu, being knowledgeable in the Japanese culture will assist you in grasping a complete understanding of the humor, however the explanations are thorough enough for the average viewer to understand them. In spite of this, the fact that it frequently makes use of traditional history and myths remains. One might be reminded of Naruto, as words like Susanoo, Amaterasu and Orochi will be mentioned, and at the same time acquiring the chance to deepen the meaning of them. When it comes to the sound, it more or less wavers between the same lines. The opening theme is a funny song created solely for the series and performed by the main voice actors, while its cheerful rhythm remains at the back of your head. Furthermore, all of the seiyuus voices match the character's personality perfectly while resonate surprisingly imposing, which helps in focusing on them. Lastly, narrator for the series is Junji Inagawa, hugely popular as a producer and narrator of ghost stories, he becomes the last component of Hoozuki no Reitetsu success. \\n\r\nThe anime itself might not be immensely well-known, but the manga has met a lot of recognition, with quite a few of best selling achievements and often rated in the top ten of several manga charts. All in all, Japan's hell is a multi section hell, and all together, it has 272 sections.. The cool-headed Hoozuki is the only demon fit to properly rule them all, and that demon ogre working under the Head Judge of hell makes it a worthwhile comedy.",
            "date": "2015-09-03T16:27:00+00:00",
            "helpful_count": 20,
            "mal_id": 197757,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3933117.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/_Megami",
                "username": "_Megami"
            },
            "url": "https://myanimelist.net/reviews.php?id=197757"
        },
        {
            "content": "I just finished watching this anime and I have to say that it's brilliant! Art and animation etc are all great. Story is minimal, its an episodic anime but it has quite an interesting cast.\r\nI pissed myself at some of the jokes but many of them are very Japanese orientated and if you aren't really knowledgeable about the culture a lot of these will fly right over your head.\r\n When I saw the first episode I was a little confused; it's a somewhat strange anime., but I ended up getting hooked by the second episode.\r\n The opening and ending credits are quite weird but alsoreally fun, it was one of the few anime I watched the opening and ending credits for every episode. I highly recommend watching the closing credits at least once or twice as they are part of one of the best jokes I have ever seen in any anime (this comes up in the last episode).",
            "date": "2015-04-08T01:22:00+00:00",
            "helpful_count": 13,
            "mal_id": 185125,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3278087.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Parabi",
                "username": "Parabi"
            },
            "url": "https://myanimelist.net/reviews.php?id=185125"
        },
        {
            "content": "There aren’t many anime in the comedy genre that does well what Hoozuki no Reitetsu has done. That is delivering an amusing tale that parodies a mythology. And it is made even more interesting as it teaches you the history behind the mythologies portrayed in the show. \r\nThe show operates under the premise that the viewer has a basic gist of Japanese Hell, as well as other worlds such as European Hell and Chinese Heaven. It follows the character, Hoozuki, a very sadistic, no-nonsense-but-sometimes-I-want-my-own-fun, advisor to the King of Japanese Hell in a slap-stick and often subtle humor that takes a little thinking of theviewers’ end. \\n\\n\r\nThis comedy isn’t just a show where there are simply running gags, well-delivered punchlines, and clichés that you would typically see in a comedy. The jokes in the show evolve. That is because in HnR, the incorporation of different mythologies permits that. You see interactions that you normally wouldn’t see between demons of Euro Hell when meeting their Japanese counterparts. The jokes and gags become even more complex as new characters are introduced, but never does the complexity of a joke require too much information of the actual mythology for one to understand.\\n\\n\r\n One could almost hear the writers thinking ‘What would happen if Lucifer and Enma meet?’ or ‘How do we make a demon piss his pants?’ Suffice the say, the results of the writers’ and directors’ efforts are successfully pulled off and you’re left with one hell of a hilarious concoction. \\n\\n\r\nOne of the most fascinating things about the show is the back stories of each character. They’re minced in with truth and fiction, and most of the time they form a very volatile kind of humor that are brought out by the characters’ interaction with each other. IE Hoozuki and Haku, Hoozuki and Enma, Haku and the various women of each Hell, among many other combinations. However, you begin to see a pattern that different combinations have different dynamics, but none I assure you, are boring. Each have their own personality as dictated by the history they’ve been given by the real world, putting you at the edge of your seat to see how they react to one another’s antics. \\n",
            "date": "2014-09-02T06:15:00+00:00",
            "helpful_count": 8,
            "mal_id": 158913,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2799905.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Jammin_Rabbit",
                "username": "Jammin_Rabbit"
            },
            "url": "https://myanimelist.net/reviews.php?id=158913"
        },
        {
            "content": "No Spoilers.\r\nThis show was pretty enjoyable and quite humorous.  It made me laugh a lot, and I liked the way they incorporated traditional myths into their worldbuilding.  The light-hearted treatment of effecting eternal torment is tactfully done and adds a lot to the ability of the show to deliver some continuous laughs.\r\nBut there were things which put me off from this show as well.  Notably, the consistent direct-face shots of the characters speaking was repetitive over time.  The way the demon characters' teeth would be drawn in such shots just made me feel weird, not in a good way.  Iget the metaphors and allegory they were trying to impart through it but it still got old.  Also Hoozuki's character is pretty annoying in the long run, and I found myself commiserating with the people who wanted to see him fail, which I don't think is the intention of the authors.  Finally, I'm a binge watcher and this show had the same effect that Maria Holic gave, where it's consistently funny but gets almost droning after one episode.  It's very conducive to the weekly episode format, however, so it's hard to fault the creators for that.\\n\\n\r\nAll in all a very funny and well-done anime which I feel deserves an eight on a more objective level, but which I gave a seven primarily for personal reasons.  I'd recommend this anime to anyone who likes cleverly-written comedy, can stand condescending MCs, or who likes classical eastern mythology.",
            "date": "2019-02-01T01:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 300574,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4065865.jpg",
                "scores": {
                    "animation": 3,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 5,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Unconfidence",
                "username": "Unconfidence"
            },
            "url": "https://myanimelist.net/reviews.php?id=300574"
        },
        {
            "content": "Hoozuki no Reitetsu\r\nReview By: John Fragglepuss Evans\r\nHoozuki no Reitetsu uses a lot of Japanese mythology and history in its episodes. For example, there are many different levels of Hell for people to be sent to, based on their wrongdoings in life. There is an animal cruelty hell, where people are sent that abused animals in life. In this hell, the animals abuse the people relentlessly. The whole Hell system in the anime runs like the normal world does, with demons taking jobs and being able to travel to the different sub-hells. They even put on festivals and Satan from European Hell comes for a visit.\r\nYoumight enjoy this if: You want to watch slice-of-life in Hell.\\n\\n\r\nYou might not like it if: You want character development and a continuing storyline.\\n\\n\r\nNote to the Viewer: Be prepared to pause the anime if you are not familiar with Japanese mythology. Subtitles will pop up with an explanation of what is happening, but they do not stay up for long.\\n\\n\r\nEXPANDED REVIEW FROM SLC ANIME: WARNING, MAY CONTAIN MINOR SPOILERS!\\n\\n\r\nSLC Anime reviewed Hoozuki no Reitetsu as their anime of the month and this is what they thought of it. We will start with the positive parts of the show. The focus on Japanese folklore was appreciated by the group. There were a lot of references to folklore in every episode, which were mainly Japanese, with a few Western references peppered in. The group liked the animation style of the show as well. The characters were well done, each having a unique look and personality. The only criticism of the characters look was that Hoozuki’s single horn in the middle of his forehead was annoying.\\n\\n\r\nOne negative review of the anime that was shared by several people was that the episodic nature of the show did not engage the viewer. The episodes did not end and make you insist on watching another episode. The lack of an involved storyline made the show difficult to finish for some group members.\\n\\n\r\nThere were mixed reviews regarding some aspects of the anime. The humor was enjoyed by everybody, but some group members enjoyed it more than others. Some people thought that the jokes took too long to set up, or that the punchline of the joke ran flat. Other people thought the humor was spot on, being very dry.",
            "date": "2015-04-20T20:09:00+00:00",
            "helpful_count": 6,
            "mal_id": 186105,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4571079.jpg",
                "scores": {
                    "animation": 9,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 6,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Fragglepuss",
                "username": "Fragglepuss"
            },
            "url": "https://myanimelist.net/reviews.php?id=186105"
        },
        {
            "content": "This is the first anime I've felt compelled to write a review for, only because I want you to know this anime is worth watching. \r\nFirstly, you should know this anime isn't for everyone. It has no story line, and no real character development because of this. Everyone is the same in the last episode as they were in the first episode. For me, that's perfectly fine and I actually preferred it in this case, because the characters are excellent. This isn't really a show you're going to binge, but throw on when you really just want to relax and enjoy something.\r\nI gave this animea 10/10 in every category, except \"overall\" which I gave an 8. What I meant by that is: if this is the type of anime you would enjoy, you're going to really, really enjoy it. If this isn't your style, you probably would still like it, but you're not going to say it's \"outstanding\". \\n\\n\r\nStory: It's one of the more genuinely creative anime you're going see (not the \"wacky for the sake of being wacky\" creative). It's pretty darn funny too, although your level of understanding of Japanese culture is going to effect how much you laugh. (For example: they make a KFC joke that some people are going to find hilarious, and others may not get). There's also many, many references to Japanese/Chinese folklore. As a history buff, this was probably my favorite part of the show.\\n\\n\r\nArt/Sound: They absolutely killed it here. Everything about the art and sound is perfect for this show, and it feels extremely organic. The character's voices couldn't be more spot-on. And the opening/closing songs remind you of waking up early to watch Saturday morning cartoons; you know once you hear that jingle, you're about to be in your \"happy place\".\\n\\n\r\nCharacters: Again, no character development. But each character is great at what they do. \\n\\n\r\nEnjoyment: If I had to choose one word to describe this show, it'd be: charming. This show is charming and sincere. Nothing feels forced, it moves at a great pace, and I really believe that if you're into comedy/historical/sitcom type shows, you're going to love this.\\n\\n\r\nAgain, it's not a show you're going to rush to download and then binge watch. You will probably be disappointed that way. But if you just want to watch something with the intent of relaxing and enjoyment without any expectations, you are truly in for a treat.",
            "date": "2016-11-19T08:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 234012,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5447860.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/sweatpantspapi",
                "username": "sweatpantspapi"
            },
            "url": "https://myanimelist.net/reviews.php?id=234012"
        },
        {
            "content": "This is my first Review ,I hope you like it.\r\nThis Anime was a life saver, i have been feeling bored for a very Long time and havent been able to watch many animes in the past few weeks but this anime saved me. It was funny ,sincere,full of references that could reach the level in Gintama ,here is the status :\r\nArt: 9 , the art is really unique and you feel that  it is new, although its close to a comical one but its truly fantastic and special in its own way .\r\nMusic : 8, The music is really  more to the Funside than the Epic Side  , Its the kind of music that you dance to ,ALONE!! \\n\r\nThe music was really fun and interesting and very different than what we hear these days in Anime.\\n\\n\r\nCharacter :  8,  This series has many characters and all of those characters had their own specific time on Air , there isnt any character development because it is not the kind of series which needs one , The characters are all different and memorable and funny in thier own way.\\n\\n\r\nEnjoyment: 10, This series encouraged me to write my first review because of how FUN AND AMAZING IT IS , I am not the kind of person who likes comedy or anything like action, i watch psychological, tragedy ,supernatural genre And this name was surprisingly more enjoyable than animes like OPM or any other normal comedy .\\n\\n\r\nTO DESCRIBE THIS ANIME IN ONE WORD IT IS \"FUN \"",
            "date": "2016-09-29T04:03:00+00:00",
            "helpful_count": 4,
            "mal_id": 230518,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5523660.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/TheHonest_Senpai",
                "username": "TheHonest_Senpai"
            },
            "url": "https://myanimelist.net/reviews.php?id=230518"
        },
        {
            "content": "This show aaabsolutely cracked me up. It is full of dry humour, which I love, so I guess it is a bit of a biased review in that sense. It is episodic, often episodes are split into two stories. \r\nAll the reviews here go into detail about the story and characters so I'll leave that. I found it to be supremely enjoyable to watch. Easy-going, good light watch, funny enough that I'll probably watch it again sometime. I'm sure there are tropes in here, but unlike many anime (and other genres), you don't sit there and notice them like you do with most series thesedays. \\n\\n\r\nDue to the fact that I laughed multiple times through every episode, and had a low-key permanent grin on my face throughout, I'd say it's one of my favourites. It aims only for comedy and it delivers. I absolutely recommend you watch it. I do wish we got another thirteen episodes of shenanigans, but there's so much going on that I'm sure I'll discover things I missed the first time around.\\n\\n\r\nOne thing to note: you should have your finger at the ready to hit pause, as there are many cultural jokes and references that are explained, but often too briefly to finish reading.",
            "date": "2016-03-18T01:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 213224,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4976127.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/MsCommunication",
                "username": "MsCommunication"
            },
            "url": "https://myanimelist.net/reviews.php?id=213224"
        },
        {
            "content": "I'll cut the whole \"i don't normally write reviews\" short and get right into why I would rate Hozuki to be one of my absolute favorite anime. \r\nPersonally, I enjoy thriller, mind-bending, mysterious, or sometimes a (guilty) pleasure of an occasional Kamisama-kiss type romance. If I'm watching a comedy, I enjoy good sarcasm, irony, and satire like references...especially considering the kind of strong hold Japan has on a possible mainstream show. \r\nWhy Hozuki? Almost every character is unique. Sometimes an anime will have a great story, great personalities, amazing art, and wrap it all up at the end with an amazing twist. However, the viewercan feel a bit unsatisfied, as if they didn't get what they either wanted, or expect to feel from the show. \\n\\n\r\nHozuki is an anime where you wish the characters existed. That weird feeling where you want more of a particular character, almost as if you need it! I understand we are all a fan of any particular show, but to pull of this feeling many people get from anime, manga, or novel can prove difficult. \\n\\n\r\nThe childish theme song in the beginning may have lost a few viewers. Maybe the art will turn others off. Perhaps the overall mood when watched haphazardly will seem a bit lame. BUT. \\n\r\nThis show is far from a child show. The humor is relatable, the characters act as normal people would if thrown into hell. The business feel, the actual history, and the idea of special sections designated to certain sinners can inspire any imagination. \\n\\n\r\nEverything about this show is original. Whether you are an aspiring artist, writer, or creative thinker...or just a casual anime fan..this show is something I HIGHLY reccomened. Whoever created this show has a beautiful mind and I am looking forward to the next season!",
            "date": "2017-08-15T19:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 255557,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5994751.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/diabolicalx",
                "username": "diabolicalx"
            },
            "url": "https://myanimelist.net/reviews.php?id=255557"
        },
        {
            "content": "This is one of my favorite shows, not just animes.  The only problem I have with the show is that you need to pause constantly during your first viewing, because there is so much additional information subtitled in places other than the character dialogue location (so much worse to watch with a DvD player rather than a streaming site).\r\nI couldn't give the story a 10 because it is episodic with no real overarching story, but every episode is funny.  It is a show that I was hesistant about because the pictures displayed on the info page didn't strike me as great, but Iwas very wrong to be worried.  There are tons of jokes and references that a westerner will have difficulty understanding (being ready to google a bit can make the story more enjoyable), but enough jokes do land that you won't mind not getting a few.\\n\\n\r\nThis is a great twist on typical slice of life stuff and incredibly funny.  The main character may just be the ultimate overpowered slice of life character (is that a thing even?!) there is. If you like comedy, you'll like this show.  The second viewing is much better than the first; if you felt \"meh\" after watching it all the first time, you need to try again, because it just gets funnier everytime you watch.",
            "date": "2017-04-13T19:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 245439,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Dunedane",
                "username": "Dunedane"
            },
            "url": "https://myanimelist.net/reviews.php?id=245439"
        },
        {
            "content": "If brutal honesty in polite situations is your idea of comedy, this show delivers!\r\nStory (6)\r\nStory wise, it's mostly just slice of life / office storys; most don't even have a real story arc. The Setting is japanese hell and chinese heaven; japanese hell seems pretty accurate and well researched,  and the enviroments unique propertys are used for comedy. As for chinese heaven, it's only a side thing; they're rarely there, but it seems fine, but you already notice that they don't use the places full comedic potential (also way less respect). It only gets really obvious when they talk about western ideas of hell(and western hell characters) that the author obviously didn't bother to research any of it. Pretty inaccurate, i mean dantes inferno is prety explicit about the topic, but it doesn't look like the author bothered.\\n\\n\r\nArt (7)\\n\\n\r\nThe Animation itself is okay, tho not aoutstanding. The backrounds are pretty standart too. They sometimes use scrolls in a different style to explain studd, so that's pretty neat. The Art only really shines in the Character designs; they all have different, unique faces, that are still pleasant to look at, and still instantly recognisable. Even the girls. The colours are also well done, both in the chracterdesigns and the backrounds. It's different and still easy on the eyes.\\n\\n\r\nSound (7)\\n\\n\r\nMusic is okay, and fits the  scenes. Sometimes it is used for comedy, but the voice actors usually provide most of it. And that pretty well! They manage to play characters more than stereotypes, and go over the top in different ways; the variations help making every charcter stand out more. \\n\\n\r\nCharcter (9)\\n\\n\r\nThe best thing about the show are it's characters; they are familiar types, but either pushed to an extrem, or with a  twist, which makes them unique enough to be enjoyable. The main characters is the typical \"strong and silent\" type, mixed with a\"pretty but stern\" personality; the twist is that he's a total asshole, by crushing everyone with his brutal honesty. Judging everyone even though he himself is pretty wierd too. And childish; the funnyest episodes are in my opinion, the ones where he plays of his \"rival\" whom he hates for a very trivial reason, and just goes above and beyond to make his life miserable. My only complaint would be that everyone likes him too much, and that he rarely has to face consequences for his deeds. Still really great.\\n\\n\r\nEnjoyment (9)\\n\\n\r\nMost jokes work great, and a lot of the characters are great at working off of each other. There are few jokes that don't work\\n\r\n (for me personlly the european hell stuff, because a) the infos they have are often just wrong and b) it's one of those \"japan is better than everything\" stuff)\\n\r\nBut if assholes being rude to each other and a kind of british humor sounds like fun to you, it's very entertaining\\n\\n\r\nOverall (8)\\n\\n\r\nWatch the first 3 eps. If you like the episodes and the comedy style, the show (and it's ovas) just bring it (comedy wise). If you're looking for a deep story or character arcs, you will be dissapointed.",
            "date": "2017-04-04T06:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 244584,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6115809.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Blaufisch",
                "username": "Blaufisch"
            },
            "url": "https://myanimelist.net/reviews.php?id=244584"
        },
        {
            "content": "For me this anime has been really enjoyable.\r\nThe story is fresh, it is about the hell and how it is divided, and you follow the second in command of the Japanese version of Hell.\r\nIt's story is made full of references to real life legends, urban myths and actual people and contains a lot of jokes as well.\r\nThe art style was very nice to see and despite the fact that i dont like to watch most anime more then once this was definitely an anime i could watch multiple times due to its diversity.\r\nThe music is fun to listen to and sing along to and overalli really like this anime.\\n\\n\r\nI would recommend this to anyone who wants a anime which is fresh in its content and able to learn about some real life facts from Japanese Hell.\\n\\n\r\nIt's one Hell of an anime ;)",
            "date": "2019-01-07T15:31:00+00:00",
            "helpful_count": 1,
            "mal_id": 298358,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4909327.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Legendmons",
                "username": "Legendmons"
            },
            "url": "https://myanimelist.net/reviews.php?id=298358"
        },
        {
            "content": "This was a great anime personally, ill get straight to the point 8/10 from me. \r\nStory:\r\nNow about the story there is none .... You might be thinking well if there is no story how did they manage to put this together, the answer is they made it like there are mini stories within each episode, very smartly put together and the comady is different from the usual intake within other anime out there.\r\nArt style :\r\ndepending on how you look at it, it can be good or it can be bad your own opinion personally its great at times but at other moments it just lacksthe modern type of arts style considering they implemented the mordern era aswell and basing it around hell. \\n\\n\r\nSound: \\n\r\nSame as usual nice simple and the songs are very catchy and some even make you confused but summing it up very nice. \\n\\n\r\nCharacter: \\n\r\nAt first you don't know what to think naturally you wait a few episodes and see what happening and that's what they have done, while bringing new charactes in you get the feel of the main characters past life while also likeing the new characters which is what i like about the show, this makes it easier to enjoy the show it self.\\n\\n\r\nEnjoyment:\\n\r\nThe way the producers have done this is brilliant its different from all the other animes try hard style to get you to laugh. It almost makes it self a rare type not unique but there are hardly any like tgis that makes you laugh atleast twice every episode and depending on your age you will also understand some of the inside jokes and the random BS that happends when they talk ( id get confused and have to watch the sceane twice).\\n\\n\r\nOverall iv said that at the beginning and now ill say it again 8/10 nicely put together rare and something that must go in to your collection of watched animes.\\n\\n",
            "date": "2014-09-02T03:27:00+00:00",
            "helpful_count": 3,
            "mal_id": 158909,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3583859.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Unthinkable92",
                "username": "Unthinkable92"
            },
            "url": "https://myanimelist.net/reviews.php?id=158909"
        },
        {
            "content": "If you're looking for a great laugh then this is it. I didn't expect this show to be so funny. I think part of my enjoyment had to do with the characters, Hoozuki especially. He's such a straight faced sadist who does some crazy things. The whole cast is very lovable. Just the way they interact with each other is hilarious.\r\nAnother thing that I liked were the jokes themselves. There are a lot of references that you get, that you don't have to be Japanese to understand them. There isn't much of a plot which is understandable. The show is basically the everyday life inhell and the people that live there. I like that though, because something new is always happening in each episode.\\n\\n\r\nI also want to say that I enjoy anime that shows a lot of Japanese culture and history. There are many stories and real life people referenced that makes me want to research it. Not to mention the setting of the show has a traditional look to it. So all in all, I would try it out. I don't think it would disappoint.",
            "date": "2015-09-12T01:10:00+00:00",
            "helpful_count": 3,
            "mal_id": 198379,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4626830.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Jinx-13th",
                "username": "Jinx-13th"
            },
            "url": "https://myanimelist.net/reviews.php?id=198379"
        },
        {
            "content": "Boy am I glad I decided to pick up this anime. I’d been looking for something like Saiki K no Psi-Nan, one of my all-time favourites, and found this on the list of recommendations. The two anime are actually totally different in many aspects, but Hoozuki no Reitetsu definitely filled the void left by Saiki K, at least for a little while.\r\nThe anime was fun to watch, it was interesting, it had an utterly brilliant and hilarious set of characters, and it even ended up teaching me a lot of Japanese folktales and history. Granted, there were a lot of references that I either neededto look up or only knew from other anime/manga, but that isn’t a bad thing so no negative votes on that. It’s actually a testament to the anime that I enjoyed it so much despite likely missing a lot of the references.\\n\\n\r\nOkay, now to the individual parts of the series.\\n\\n\r\nArt/animation – not fabulous or anything, but appropriate for the type of anime that was being shown. It’s a very specific style, reminiscent of the old paintings and drawings associated with the folktales themselves.\\n\\n\r\nSound – here I do have to say, I actually couldn’t stand the opening. It was one of the only ones that I’ve ever skipped every time in an anime. That is, until I found out what it meant, and then it just became hilarious. The rest of the sound was great, lots of old style music which again fit in perfectly, and the seiyuus were fantastic. Hozuki’s seiyuu, in particular, managed to capture his character so well.\\n\\n\r\nStory – very episodic, random, and sometimes nonsensical. Many of the stories had a Gintama-like feel to them in the way that events unfolded or the way the characters reacted to them, and especially due to the amount of (well-handled) gag humour.\\n\\n\r\nCharacters – absolutely great. The cast was lively, quirky, interesting and hilarious. From the bumbling king of Japanese Hell to the whimsical playboy Hakutaku, the cast of somehow adorable trainee torturers and especially the utterly deadpan ‘coolheaded’ yet brutal general secretary Hozuki, there will always be someone who is enjoyable to watch. The characters don’t really get much in the way of development, it’s more about exploring their lives and the events happening around them than seeing how they grow throughout the series. \\n\\n\r\nI guess you could call it a satire, or parody of the slice-of-life genre, but basically, it’s just a lot of amusing and entertaining insights into the life of an administrator of hell. Exactly what it says.\\n\\n\r\nI’m not entirely sure who to recommend this to, but if you like series with a lot of deadpan humour, episodic stories or general randomness – like Gintama, Saiki K, Arakawa Under the Bridge, One Punch Man, or Nichijou (The daily lives of High School Boys), try checking this out. XD\\n",
            "date": "2018-01-16T07:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 268738,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201866.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AmishaelMA",
                "username": "AmishaelMA"
            },
            "url": "https://myanimelist.net/reviews.php?id=268738"
        },
        {
            "content": "If you like dry, slightly absurd humour and have a passing familiarity with Japanese folklore, I strongly recommend Houzuki no Reitetsu. It takes a couple episodes to get going, but the dry humour is great and the characters are a joy.\r\nContent Advisory: episode 3 part 2 has the old \"is it a man or woman\" transphobic chestnut as the foundation of an extended joke. Hakutaku and Houzuki had a bet whether the next woman who walked out of a bathroom had a large or small chest; they can't agree whether the person is a man or a woman, and in a later scene where theyactually ask the person - she's a non-op trans woman - the two of them argue about whether she's a woman. Again. OAD1 also has a gag about a person of indeterminate gender, where being trans is treated as \"other.\" (I know I know, cultural differences and all that, but I'm writing this review in English about an anime licensed in North America, as an anglo North American.)\\n\\n\r\nThe series generally has a casual attitude toward death, pain, and suffering, and the various tortures are more slapstick than horrifying. On the other hand, the series condemns animal abuse and sexual assault-via-alcohol (rare mentions). \\n\\n\r\nHumour is always a subjective thing, and HnR is a love-it-or-hate-it kind of show. A lot of the humour is in the ways characters bounce off of each other, not just references or punch lines, or in the juxtaposition of serious & silly. Some references are obvious (Lum in episode 2), and some are pretty subtle (in OAD3, the Addams Family theme music appears behind some dialogue, keyshifted up a bit). The crunchyroll subs do a good job of preserving the puns, and rarely substitute western references for the sake of the joke. Characters slide between the boke and tsukkomi/ridiculous person and straight man depending on the situation, and Houzuki himself has more than a few ridiculous moments. It's comparable to Hot Fuzz, where a lot of the laughs are from Angel reacting to his coworkers' ridiculousness/being ridiculous himself and from parodies of cop movies & rural English life. \\n\\n\r\n(I laugh out loud at least once an episode, and I know there are lots of jokes that go riiiight over my head. It's entirely possible I would rate the series higher if I caught more of the references.)\\n\\n\r\nEach episode is split into two parts, each adapting a chapter of the manga. The pacing is good and the sections don't feel like they're dragged out. (It's much less frenetic than Gintama.) The art is beautiful, with sight gags in the backgrounds based on characters and/or famous paintings. In my opinion the voice acting adds a lot to the experience, including the delivery and easier dramatic pauses. While there is little \"plot\" with each episode we learn more about the characters and the world, opening up more jokes & callbacks. All that said, it takes time to get to know the characters so I didn't fall in love until around episode 3. \\n\\n\r\nI enjoy all of the characters I've met so far. They start as fairly stock characters, but the longer we see them the more we discover. Houzuki is both a good boss and a horrible underling, and he can act on a grudge and be nice to children within the same scene. (His seiyuu, Hiroki Yasumoto, does a fabulous job mixing deadpan delivery with Houzuki's not-very-buried rage; I like him much better here than as Germany in Hetalia.) Nasubi is both an airhead and a thoughtful artist; Hakutaku is a doctor and ladies' man who respects no, but he's happy to learn about other pursuits. Houzuki and Hakutaku's rivalry is in more than their don't-want-to-acknowledge-them similarities (and is a gift to rival shippers, just saying). In turn, this means that the characters are more than one trick ponies joke-wise and can support a wide range of stories.\\n\\n\r\nI'm solidly in love with the series. I had originally passed on this series because I read a (very) critical review of the first seven episodes, and I regret that now. After the first time or two through an episode - so that I get my giggles out - episodes also make for good background entertainment (like while farming in an MMO, or organizing computer files); Houzuki's voice is strangely calming. \\n\\n\r\nBottom line: This is one of the few series where I finish an episode then immediately want to see it again. I enjoy the rest of the series enough to forgive episode 3, though I skip that part when I rewatch.",
            "date": "2017-10-12T21:08:00+00:00",
            "helpful_count": 1,
            "mal_id": 260634,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6477851.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/silvery-saber",
                "username": "silvery-saber"
            },
            "url": "https://myanimelist.net/reviews.php?id=260634"
        },
        {
            "content": "A fun, easy to watch and quite a refreshing comedy anime - is what I would say about Hoozuki no Reitetsu if I were asked to describe it in a single short sentence.\r\nStory (7)\r\nThe story in Hoozuki no Reitetsu is really all about the characters and their interactions with each other. For the most part, their interactions don’t change much (if anything) in the grand scheme of things and the episodes aren’t really connected to each other, except some minor changes that happen along the way. Each episode is more or less its own, and that can be either a good or a bad thing,depending on the person, but I personally think it’s an ok thing, seeing as the series doesn’t have a big goal to move towards, and nothing major changes from episode 1 to 13.\\n\\n\r\nArt (8)\\n\\n\r\nI don’t have much to say about the art style, other than: it looks different from the usual anime style and is pleasing to the eye.\\n\\n\r\nSound (8)\\n\\n\r\nThe OP song is pretty catchy and in fact it’s still stuck in my head as I’m writing this review. The sound effects throughout the show weren’t out of place and I found the voice acting to fit the show and its characters well.\\n\\n\r\nCharacter (8)\\n\\n\r\nPerhaps the part of the show that shines the brightest for me, the characters were interesting and I found quite a bit of enjoyment watching them interact with each other and the world around them. As far as I can tell, there were no characters that were annoying or brought the show down in my eyes for any reason.\\n\\n\r\nEnjoyment (8)\\n\\n\r\nNo matter how good the story, art, soundtrack or the characters are, it would all be useless if the show just wasn’t enjoyable. Fortunately, Hoozuki no Reitetsu doesn’t have this problem and is a good time all the way.\\n\\n\r\nOverall (8)\\n\\n\r\nThere’s not much else I can say about this show, other than: go try it if you’re a fan of the comedy genre in anime. I doubt this show will disappoint.\\n\\n\r\nP.S. For those that like Japanese mythology, as a fan myself, I noticed a few bits of it here, but don’t go in expecting too much, it’s mostly just a few mentions here and there.\\n",
            "date": "2017-07-26T13:44:00+00:00",
            "helpful_count": 1,
            "mal_id": 253868,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6201503.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Akan3",
                "username": "Akan3"
            },
            "url": "https://myanimelist.net/reviews.php?id=253868"
        }
    ]
]