[
    [
        {
            "content": "Some may argue that this anime is just another BL anime focused on fanservice for the girls. While I'm not totally denying this, I do have to say that there's more than meets the eye when it comes to Sekaiichi Hatsukoi. Unlike Junjou Romantica where it's just SEXSEXILOVEYOUSEXSEX every episode, this actually has a pretty good story.\r\nStory: 7/10\r\nIt's simple, sweet, and straight to the point. Some may view that as a good thing while others may disagree and claim that's a bad thing. Personally, I thought the story was fairly well done considering this is a BL anime. One of the biggest flaws, however, isthat the drama is kind of forced upon the viewer...but since this is a Shungiku Nakamura series, we all know the drama isn't going to end in heartbreak or tragedy; you know all of these guys are going to eventually end up in a relationship and live happily ever after because, well, that's just what happens in her works. The drama is there to interest the viewer, but it doesn't necessarily serve a big purpose within the story. Do I think that's a bad thing? I believe if it's a device to interest the viewers, then go for it.\\n\\n\r\nArt: 7/10\\n\r\nDeen did much better this time than in Junjou Romantica, that's for sure. The backgrounds have a more soft feeling about them, and it reminded me of Hourou Musuko's background art (if you haven't seen Hourou Musuko, the gist of what I'm getting at is that the background art is done extremely well). So the backgrounds are beautiful, that's fine and dandy. But the characters? I don't mind that they're all bishounen/\"bishies\" because that fits in with the theme, but...ugh, the faces. And the hair. They're all identical. I'm not talking about the color of the eyes and hair, but the shapes and styles are basically all the same. It's just a little thing but it bugs me when I get the characters confused since they all look too similar.\\n\\n\r\nSound: 5/10\\n\r\nIt's really nothing very special. The opening is upbeat which fits Sekaiichi Hatsukoi considering this anime is a lighthearted romance/comedy, and the ending is more serene. As for voice acting, it was simply alright. The ukes sounded girly and whiny and the semes sounded manly and rough. Too bad that, like the art, everyone sounded the same. It was a mediocre performance on the seiyuu's parts.\\n\\n\r\nCharacter: 5/10\\n\r\nCharacter is where the series starts slacking, because they're all so stereotypical and it can get REALLY annoying after a couple episodes. All of the ukes (Ritsu Onodera, Chiaki Yoshino, and Shouta Kisa) have the typical I-don't-want-you-to-kiss-you-even-though-I'm-obviously-in-love-with-you-so-I'm-just-gonna-keep-pushing-you-away-because-I'm-stupid attitude, whereas all the semes (Masamune Takano, Yoshiyuki Hatori, and Kou Yukina) won't give up because they know the ukes are undoubtedly in love with them. There's slight character development, but not enough to drastically change their attitudes or anything. It's the average stuff you see in BL which is why I rated it as such.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI like this series, don't get me wrong, but some major flaws and the ending prevented me from giving this a 9/10 like I would have originally put as my enjoyment score. I looked forward to watching a new episode every week, but it simply didn't astound me like some other anime has done. I'd still consider it a favorite, but objectively speaking there are quite a few weaknesses within this series.\\n\\n\r\nOverall: 6.4/10, rounded to 6/10\\n\r\nSekaiichi Hatsuko isn't atrocious, nor is it a masterpiece. It's slightly above average. The story and art are nice, but that's really all this anime has going for it. If you like BL, you'll probably enjoy this. If you're wondering whether you should dip your toes into BL by using Sekaiichi Hatsukoi as your starter series, you might finish up episode 12 and feel pretty underwhelmed.",
            "date": "2011-06-25T11:05:00+00:00",
            "helpful_count": 218,
            "mal_id": 38290,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/277613.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/QueenOfAlbion",
                "username": "QueenOfAlbion"
            },
            "url": "https://myanimelist.net/reviews.php?id=38290"
        },
        {
            "content": "I decided to give everything this season a shot, and as far as breaking out of my comfortable genres I thought that even BL wouldn't stop me. As a straight man I found it slightly hard to enjoy the romantic moments this is true. However, as I knew beforehand you can find some good stuff in the most deceiving places.\r\nLike the start. I found the setting introduction was pretty funny, and the initial backstory was pretty interesting between Takano and Onodera. A long lost boyfriend from 10 years ago ends up as your boss in the hectic manga section of the company, the section youdidn't apply for. The attitude between the two is pretty funny with their constant bickering. This does make it slightly difficult for the relationship to develop however, as there is even more issues than just Onodera's attitude. Unfortunately, the story is left unresolved and leaves you with a horrible sense of un-fulfillment by opening up more plot.\\n\\n\r\nThe cause for the lack of resolution is the introduction of the two other side couples. The first is between Yuu a popular oblivious mangaka and his childhood friends who became an assistant and an editor. The second between a editor whom has given up on successful relationships with good looking men, and a good looking manga salesmen. They aren't bad stories either, but eventually after episodes 5 through 10 you wonder what happened to the main story. Of course, neither is two or three episodes enough to deal with these new sub-plots either. \\n\\n\r\nI found Hatsukoi to have a surprisingly good sense of humor, and for me that is what I enjoyed the most. However, this pretty much disappeared as things got more serious farther into the stories which is a shame. With the waning of the humor the show turned, metaphorically, into the Uke crying rape and leaving the Seme to scratch their heads at the situation. Seriously, I thought that the female tsunderes were bad, but the male ones can be just as annoying. \\n\\n\r\nFor me Hatsukoi started out as an enjoyable show and then turned into somewhat the dreaded show. Of course, if you enjoy BL which would be a logical assumption, then it is a good watch. The issues about the story are somewhat resolved as there will be a sequel leading the once crappy ending into something more acceptable. \\n\\n\\n\r\nFeedback and questions are welcome! Thank you for spending time to read my review!",
            "date": "2011-08-01T06:05:00+00:00",
            "helpful_count": 169,
            "mal_id": 40533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=40533"
        },
        {
            "content": "-Again, not so good at writing reviews, but I'll try-\r\nNakamura Shungiku, author of Junjou Romantica, has made, yet, another great series known as Sekaiichi Hatsukoi. If you love Junjou Romantica, then you'll love this one! The romance in this series is twice as much as Junjou, that my inner fangirl just broke out. Trust me, it's so kawaii~! And Nakamura never fails to amaze me with the comedy in her work. Reading Junjou and Sekaiichi has always made me laugh and smile, no matter what kind of mood I'm in. I've watched the 2 episodes of it, and just watching the end of each episodegives me the feeling of wanting to watch more. But since it's still ongoing,  you have to be patient when the next episode comes out T_T but it's worth it! Even watching it over and over again, I never get tired of it 'cause I really enjoy this series so much. Please watch it! You'll be glad you did :D",
            "date": "2011-04-15T19:31:00+00:00",
            "helpful_count": 93,
            "mal_id": 36106,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/443724.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/XLady-IllusionX",
                "username": "XLady-IllusionX"
            },
            "url": "https://myanimelist.net/reviews.php?id=36106"
        },
        {
            "content": "Skip this paragraph, come back to it after you have read my review (below):\r\nOkay okay, after seeing all these bad ratings I'm guessing people who've been reading this are misinterpreting the message I'm trying to send across to the readers. I'm going to write here what the jist of this review is stating since I'm guessing not everyone has read my entire review and has failed to see the main point. Essentially, the point I'm trying to get across to you is that this show is pure \"fanservice\", like \"moe\". The writers are specifically targeting women through this series and creating a piece adorned withhot \"bishounens\" to cater to this specific demographic of yaoi fans. This is not necessarily a bad thing, but that's it, that's all this series is and how the company reels in its viewers. The story is plain as well as the characters, and the company, like all other anime studios that distribute ecchi related series, are simply using this series to get yaoi fan viewers!! That's it!! this story has little substance and so does its characters!! so don't expect any wonderful plot or story from this series.. \\n\\n\\n\\n\r\nStart reading review here: \\n\\n\r\n I am, for one, absolutely against reviews based on the first few episodes aired of a series, but this is serious, seriously agitating to the point that I am compelled to write this no matter what barrier lies before me. Why might you ask? why?? because, Sekaiichi Hatsukoi - in simplified terms -is Shoujo or girl \"ecchi\". This anime series is completely mundane and banal in all media related aspects from story, to art, to character. Honestly, the only thing worthwhile in this series is the sound, and even that isn't of a grand level of degree. The series is a waste of a time, and It is so gay, and I can validate that as gay person!( Oh yes, the irony hahaha...)\\n\r\n   I know I'm asking for an internet trashing (pulls up firewall) for bashing on this completely gay show, but I'm laying down the facts so I can hopefully convince you and everyone out there - whom posses the decency and optimal intelligence - to help you avoid wasting spare minutes of your life. \\n\\n\r\n  So, Why is this show gay?, apart from the obvious yaoi entitled genre and daunting advertised images of its homosexuality(towards those homophobes out there), that answer lies within an analysis of the story, characters, and art (which i will thoroughly soon cover).\\n\\n\r\n   The story is almost lackluster; filled with predictable characters associated with identifiable archetypes and an empty story acting as a vessel to hold these characters together. The story starts out with Ritsu Onodera, one who might be considered gifted, adorned with wealth and a good enough family to support him. Despite this, Onodera wishes to rebel against his content position in life and decides to step back a notch, entering the manga world while fleeting the prestigious world of literature and novels he had embarked upon in order to prove a somewhat childish notion of pride; proving that he can bolster himself in the adult world of corporations and succeed without help from his father. So far we can see that Onodera is the stuck up one, essentially he is the up-tight archetype impelled by pride; if he were a girl, he would be a tsundere. His fierce, defiant, and prideful attitude can be seen when he is infuriated by Masamao Takano, his editor in chief. Onodera also has a nice side to him - seen when he encourages the female staff members before their deadline - but all in all his character is completely mundane. All the mundane aspects of a yaoi series are evident within this story and especially within Onodera whom elicits them. Envy, greed, and pride a just a few that Onodera exudes when seen in conflict with counterpart, Masamao Takano. Masamao takano, on the other hand, is the calm and composed archetype - he is nonchalant, yet he can be easily incensed and infuriated  \\n\r\nand throw a mad fit. He can be compared to any worker who gets all worked up after a stress-induced job (think, Gordon Ramsey). The writers present us with a wonderful plot twist as both Onodera and Takano have, in fact, met before and, of course, as all gay men, had an affair. \\n\\n\r\n      Although the plot twist is intruiging.. it is so horribly executed and a grave, grave stereotype (I mean, come on! we don't all have sex on the first day, we're not hormone raging idiots that everyone makes us out to be!). Onodera and Takano are repeatedly seen with each other in their memories of their young, teenaged love life up to their modern day work lives. The plot twist becomes so incredibly evident that it becomes lackluster.. I mean, what were the writers thinking? \"Hmm.. we should come up with an interesting plot twist for this series, lets make them high school lovers! and when they grow up they'll coincidently find a job together and fall in love all over again, yay!!\" You see what I mean? The plot is so predictable, I mean, It's so obvious that they'll end up together and what's worse, is that the viewer is forced to watch their endless meet-ups and run-ins in the workplace while the plot twist just drags on and on and on.. Sure the writers may have been planning to build the momentum of suspense, but it just dragged on for too long that the enthusiasm dies out.\\n\r\n    Not only is the story ruined by such atrocious plot-planning by the writers, but everything including the characters, scene, setting that revolve around the story seems so FAKE. I mean, what is the coincidence that all the characters of the show will end up in a publishing company for shoujo manga, and furthermore, what is the coincidence that they are all men and that both the main characters will just mysteriously end up there by \"fate\". I mean, come on! the plot is so cheesy to be taken seriously, besides this, everything is clearly targeted to women. The company is filled with men, lots of men, and the art style of which they are drawn is horribly banal; with large shoulders, thin waistline and long faces. Like I said.. this is so obviously \"girl ecchi\", It can be compared to other shounen targeted works of ecchi such as love-to-ru and whatever harem possesing anime series are out there. All in all, what I'm trying to get at is that there is no sense of reality, normality, or any sense of naturalism. The writing feels so narrow-minded and there is no authentic feeling of true emotion of true human interaction. Heck, there couldn't possibly be in such a contorted setting that highly deviates from reality. It all comes down to the media and its corporations, strictly targeting to woman. I bet that if they planned a series with a normal setting, as in both men and woman, such as a high school, the show would reap a broad amount of viewers and could delve deeper in to realer sense of interaction between male characters, because, afterall, homosexuality isn't all about sex, there can be love too.\\n\\n\r\nWow, I really dragged on in this review.. and before, or if anyone flames me I just want to let you know that I'm being mostly satirical in this review, don't take it seriously when I hate on gays.. (I mean come on.. I am gay), but definitely heartfelt thoughts went into this review. And hey, if you are a hardcore yaoi fangirl, go ahead and watch this series and enjoy it, but whom I'm mostly addressing in this review are those who are looking for a series with a substantial plot and with substantial characters. A great example of a yaoi series that elicits this would be Hourou Musuko, that I would definitely recommend to anyone (especially the writers of Sekaiichi Hatsukoi, haha, i kid i kid).",
            "date": "2011-04-23T10:33:00+00:00",
            "helpful_count": 89,
            "mal_id": 36361,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/367934.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MSfanatic",
                "username": "MSfanatic"
            },
            "url": "https://myanimelist.net/reviews.php?id=36361"
        },
        {
            "content": "Alright... Before I start on anything, I'll be writing this as someone who has watched Junjou Romantica BOTH seasons more than three times and I've watched 7 episodes of Sekaiichi Hatsukoi with repeats of each episode twice after airing.\r\nI have to say, I've been waiting for this anime to come out a long time ago and when it did, I completely flipped. It is right down AMAZING! But I have to tell you, my review will be filled with my own thoughts and feelings for the anime so yeaa..\r\nLet's cut it down part by part kay?\r\n- Story -\r\nSimilar to Junjou Romantica's set, there are 3stories revolving around 6 main characters in the anime. The basic setting is that all the characters work on or are familiar to shoujo mangas. The two main characters and the main couple work in an editing company for shoujo mangas and it really shows the daily routine of a manga editor. The main story is about how the main character, Onodera Ritsu stumbles with his old lover who was also his first love and starts getting confused in his feelings for the latter. I've seen this plot in a lot of other animes/mangas where the main character gets confused in his feelings and all so it's pretty common. But it's the first time I see a BL anime set up in a manga editing company so I guess it's a plus point. Nevertheless, the story has its own special originality to it which won't make the viewers bored if they are those who really focus on the storyline or setting.\\n\\n\r\n- Art -\\n\r\nThis is probably one of the biggest plus point in the anime. The art is AMAZING and beautiful... The colours they used really brought the life of the settings and characters. Not to mention it brought out the hotness of some characters like Saga/Takano Masamune and the newly introduced character Yukina Ko. They are all beautifully drawn and as the anime's target is for female viewers (such as I), this is basically the eye candy for every shounen-ai lover out there.\\n\\n\r\n- Sound -\\n\r\nI LOVE both the opening and ending song. The opening has an interesting upbeat sound which really attracted my attention straight on when I watched the first episode. And the ending can really make somebody cry tears of awe. Whenever it played, I imagined a hopeful person wishing for love and I can't help but just shed tears at the beautiful melody of it. The instrumental soundtrack is also well made. Music is pretty much what brings up the feelings in a scene and I have to say, it has done an amazing job to move me.\\n\\n\r\n- Character -\\n\r\nOnodera Ritsu will probably my absolute favourite in this anime. His stubborn, serious hard-headed yet soft-hearted personality really caught me right from the beginning. A hardworking main character is common for an anime but he has his own originality which makes him a very loveable character. Takano is your average awesome-hot guy who succeeds in almost everything he does except when dealing with the guy he loves. But then again, I'm pretty sure there's more to Takano than meets the eye. That's what makes this guy to die for! The other characters have their own story and background and this is why Junjou Romantica and Sekaiichi Hatsukoi are such interesting animes. It doesn't only focus on one main pairing but revolves in the other characters. I have to say, even though some pairings have a very fast or slow development and all, they are all an important substance in the story and they bring up their own originality in their own way.\\n\\n\r\n- Enjoyment + Overall -\\n\r\nWhat can I say? I've rewatched each episode at least twice after the subs come out. And I'm pretty sure I can rewatch it again even when it ends. I don't know about others' thoughts for the anime but I think it is a great release and I hope there is a second season of it just like Junjou Romantica. To those who haven't watched Junjou, you better do! Because it is just as awesome as Sekaiichi. \\n\\n\r\n10/10 -",
            "date": "2011-06-02T02:44:00+00:00",
            "helpful_count": 50,
            "mal_id": 37507,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/414122.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Amaranthyz",
                "username": "Amaranthyz"
            },
            "url": "https://myanimelist.net/reviews.php?id=37507"
        },
        {
            "content": "Sekaiichi Hatsukoi, you say? Now, looking at the picture right there at the top, you might think that this is just Junjou Romantica again, seeing as how both series are rather fluffy yaoi with the exact same art style. You'd be right. This is, more or less, Junjou Romantica season 3, even taking place in the same setting but with a different main cast.\r\nIs this a good thing or a bad thing? Let's dive deeper into the deep depths of the phenomenon known only as \"Sekaiichi Hatsukoi\".\r\nActually, the depths aren't that deep. This is one of the shallowest anime I've ever watched. Like Junjou Romantica,Sekaiichi Hatsukoi focuses on not one but three different couples. Well, I say \"different\". Each of the couples has one \"bottom\" and one \"top\". The bottoms all look the same, as do the tops. It was the same deal in Junjou Romantica. The character designs aren't very varied, to be perfectly honest. The couples' dynamics are very similar, too. Often to the point of being completely identical.\\n\\n\r\nYou see, the top is in love with the bottom for some reason or another. The bottom is completely clueless about this affection until the top sexually harasses the bottom in some way or another. The bottom then goes into full-blown tsundere mode, as he completely ignores the top's advances, while said top keeps going \"WHY DO YOU NOT ACCEPT MY FEELINGS\" or \"I WILL MAKE YOU FALL IN LOVE WITH ME\" with occasional additional sexual harassment. Repeat this formula twice and et voila! You have a 12 episode yaoi series. \\n\r\nHow wondrous! How magnificent!\\n\\n\r\nOkay, there's a slight bit more to it than that. I actually had high hopes for the third couple, which seemed to be basically... based on physical attraction and nothing more. Of course, by the end of their introductory episode those hopes were dashed and it was on to the aforementioned formula. But enough about that. If you've seen Junjou Romantica you know full well what to expect. \\n\r\nOn to the other aspects of this work of art.\\n\\n\r\nThe art and animation is rather lackluster for 2011. I mean, okay, it's Studio DEEN. They're not exactly the most financially stable studio. Hell, they're not even the best known for high quality stuff. Anyone see Higurashi? That was a very ugly show in more ways than one. Basically, it looks exactly like Junjou Romantica, a show from 2008. Not terribly ugly, but not exactly breathtaking.\\n\r\nAs for the BGM, I hardly even noticed it. I'm not too hot on the ending theme, but the opening theme, sung by Shuuhei Kita, is admittedly very catchy.\\n\\n\r\nThe characters are about as three-dimensional as a piece of paper being ironed while being run over with a steamroller made of pancakes, but they do have some rather nice voices. I mean, Hiroshi Kamiya. He can make just about anything better with his... very lovely voice. Too bad his character is relevant for all of one episode.\\n\\n\r\nNow, if you liked Junjou Romantica, you'll probably like Sekaiichi Hatsukoi. I mean, it's pretty much the exact same thing, but with less steamy gay sex. Junjou Romantica's absolutely hilarious fits of melodrama are still on display here, but either they're just not as amusing or I've been desensitized towards them. At any rate, Sekaiichi Hatsukoi isn't too bad a way to kill some time.\\n\\n\r\nJust don't go in expecting anything with substance.\\n\\n\r\nYou will be sorely let down.\\n\\n\r\nI give this show a 6/10. It's unremarkable but I kind of like it, even though I'm not exactly in its target demographic. Unless I've somehow turned into a 13 year old girl overnight.\\n\\n\r\nThat would be an interesting experience. More interesting than this anime, at least.",
            "date": "2011-07-03T18:07:00+00:00",
            "helpful_count": 34,
            "mal_id": 38630,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118640.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Keirik",
                "username": "Keirik"
            },
            "url": "https://myanimelist.net/reviews.php?id=38630"
        },
        {
            "content": "Sekaiichi Hatsukoi is the first shounen-ai anime that I have ever seen, so I was skeptical at the beginning of course, but after only the first episode I was already sure that was a very well done anime.\r\nStory 9/10\r\nThe story it's nothing out of the ordinary, but still not so predictable. Even though the themes are simple they are well explained, the timing it's perfect so that you can feel what the main character feels (at least, I felt it).\r\nThere are three love stories but they are different to each other so that the viewer won't get bored. So yes, 9 out of 10 becausenothing is left unsolved (the story continues in the second season though), every event matters.\\n\\n\r\nArt 7/10\\n\r\nNothing much to say, the animation is fine but nothing spectacular, I don't like very much the drawings but that's my personal opinion, everithing's fine, nothing extraordinary.\\n\\n\r\nSound 7/10\\n\r\nThe opening and the ending are fine, they could be better but they do their job. The soundtrack it's not memorable but it fits the moment.\\n\\n\r\nCharacter 10/10\\n\r\nThe characters are very well developed, they let you know what they think so that you can understand the reasons under their behavior. Throughout the story, the characters behaviors are always in line with their personality, and that's the real strenght of this anime.\\n\\n\r\nEnjoyment 9/10\\n\r\nThis anime made me remember how I felt when I fell in love for the first time. I thought I would never feel again like that.. So I recommend this anime because it's not superficial at all, instead it's deep and intense.\\n\\n\r\nOverall: 8 (I have to consider sound and art.. but enjoyment is more important!)\\n",
            "date": "2015-02-26T18:26:00+00:00",
            "helpful_count": 19,
            "mal_id": 181278,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4466175.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lichedilia",
                "username": "lichedilia"
            },
            "url": "https://myanimelist.net/reviews.php?id=181278"
        },
        {
            "content": "I just finished watching Sekaiichi Hatsukoi for the second time. I was worried my review would have been biased after the first time because I had fallen in love with the series. After watching it a second time, I can say with the utmost certainty that this series is fantastic.\r\nDo not let the fact that this is boy love scare you away. Whether you are straight or not, you can find yourself being taken away by this love story. I did.\r\nThe story is fantastic, much better than the story of the parent series Junjou Romantica. It kept moving at a steady pace and only ina few situations did I feel that it was taking steps back. But if you look at it from another perspective, it can be accounted to Onodera’s apprehensions of loving Takano again. In which case, it can be seen as great characterization of Onodera. The final episode is told from Takano’s perspective and it is a great conclusion. It tells us more about Takano as well as giving us more of their past. I loved the manga backdrop to it all. It gives an insight to the process manga authors and editors go through. I don’t know what else to note of the story besides that it is well thought out and entertaining.\\n\\n\r\nThe artwork was beautiful and only at a few points did I find myself put off by it. This is a romantic comedy so you should expect some chibi and playful drawings. Scenes that were dramatic were dramatic, while scenes that were fun were fun. The openings and closings were fun to watch and entertaining. Great and pleasing art nonetheless.\\n\\n\r\nI loved the music. The opening and closing songs were amazing and I still attempt to sing along to them. But I don’t know Japanese and I cannot keep up with how fast they sing. They are playful and set the mood for a romantic comedy. The rest of the music was good, it fit well and some of it is still chiming in my head.\\n\\n\r\nAs for the characters, Onodera is one of my all time favorite characters. In fact, he is number one on my list, even ranking higher than Lelouch from Code Geass. It is hard not to be impress and disgusted with Onodera. I found myself cringing at the awkwardness Onodera had in his teenage years, reminding me of myself somewhat. I can respect his diligence as a hard worker, even though he hates the idea of editing shoujo manga. His history is decent, while his emotions are all genuine. His struggle with love was noteworthy and if there is anything I have learned from this series, it is that love is lawless, just as it is bitter-sweet. Takano’s character is fun as well. I find his history understandable and representing his character. Even though his emotional changes are slight, when you do see them you will notice them.\\n\\n\r\nBeyond those two, there are two other couples. After seeing it a second time, I found the whole love triangle between Yuu, Hatori, and Chiaki boring. It seemed that Chiaki was just a child being cared for by Hatori, not that something like that is impossible to believe. It just didn’t satisfy me compared to Onodera and Takano.\\n\\n\r\nThe other two are Kisa and Kou where the couple is formed based on pure looks. It is fair to say that most relationships occur based on physical attraction, but that can lead to issues as we see Kisa has those issues. I enjoyed these two and it likely because it wasn’t overdone as the love triangle was.\\n\\n\r\nThese two couples were side couples and while development is necessary, they are nothing more than an additional side story. Like a short story, it needs to be concise and to the point. Hatori and Chiaki I believed had this verbosity that was unneeded and likely why I became bored with them.\\n\\n\r\nOverall, I loved the series. If I watch it for a third time, and I likely will, I will probably skip the episodes only pertaining to the side couples. It is the main couple that makes this series great for me and worth a watch to anybody.\\n\\n\r\nStory: 10/10\\n\r\nAnimation: 9/10\\n\r\nSound: 9/10\\n\r\nCharacters: 9/10\\n\r\nEnjoyment: 9/10\\n\\n\r\nRounded Total: 9/10\\n",
            "date": "2013-12-23T16:59:00+00:00",
            "helpful_count": 18,
            "mal_id": 125275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3421185.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexanderRP",
                "username": "AlexanderRP"
            },
            "url": "https://myanimelist.net/reviews.php?id=125275"
        },
        {
            "content": "I've personally gotten very frustrated with shounen ai/yaoi, not because of all the man love, but because there's no point to it. It's all 'Hey you're cute! Let's now have sex for no apparent reason or character development, YAY!\" I also dislike that it's always marketed to little \"YAOI SUKI DESU\" 12 year old fan girls, so quite a lot of it has basically children getting jiggy with it. Even if the anime goes 'Oh yeah, I'm 25', there's noooo way that little boy could even possibly pass as so.\r\nIt's ridiculous.\r\nWhich brings me to Sekaiichi Hatsukoi. My oasis in the KAWAII DESU quicksand realm. Story-wise,it's nice to actually see it take place in a publishing house in the manga section. I personally haven't seen this before and found it very interesting. I also like that they split the series by following three different storylines that are all intertwined by where they work and it really connects you with all the characters instead of just the two main guys.\\n\\n\r\nI also like the fact that they're not always KAWAII BISHOUNEN hot and the fact that there are cycles where they look like they've been dragged under a bus and have bags under their eyes really cracks me up and I warm to the characters even more.\\n\\n\r\nNow, let's get to why most people will be coming across Sekaiichi Hatsukoi in the first place: The man shex. Don't worry! There's loads of little tidbits and oomph to sate your needs, but because of the character emotion and the build-up in storyarc, it rarely feels like a simple 'fanservice', where the creators have gone \"Oh this scene is running a bit flat. Let's add some sex!!\"\\n\\n\r\nIt's also very tastefully done, so those expecting a gangbang of wild pleasure, this really isn't the shounen ai for you. But for those of you who get the most enjoyment out of a growing story with buckets of angst, misunderstandings, tenderness, warmth, caring, hilarity and overall enjoyment, cue up episode one right now. RIGHT NOW, I SAY.",
            "date": "2011-10-14T04:30:00+00:00",
            "helpful_count": 13,
            "mal_id": 45515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/560167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/baskervwatson",
                "username": "baskervwatson"
            },
            "url": "https://myanimelist.net/reviews.php?id=45515"
        },
        {
            "content": "So having watched the first season and the second one, I am seriously loving this anime and as well as the manga. This deserves an overall of 10 to me, i'm not sure what it'll be to you but, i truly loved this anime. A lot of people have said that this is similar to Junjou Romantica and in the anime itself, there's lots of references to Junjou and personally i do think its kind of similar but there is a difference to it. Sekaiichi is more cuter to me as compared to Junjou which has more of 'those' scenes XD Personally, i enjoyed Sekaiichimore than Junjou\\n\\n\r\nNow moving on to the story, like Junjou, the main characters are these 3 guys with their love interests, to me it has a score of 9, the story line is there and its nice but i will link this to the characters which has a score of 7 to me. The character designs were really great and everything but the characters themselves were a little annoying in the sense that they were really stubborn (to be honest, it pissed me off a little, there was a lot of facepalm-ing here and there XD) but they were good, tsunderes i would say, are the best XD.\\n\\n\r\nthe art was definitely a grade higher than Junjou and overall i enjoyed this anime and the manga a hell lot. I CANT TAKE THE CUTENESS IT HAS IN IT!!! There are the novels as well, and i'd just say this to those who know of this MY OTP IS KIRISHIMA X YOKOZAWA~  Alright, as you can see, this randomness will tell you how much i seriously enjoyed and love this anime and so overall, it deserves a score of 10! ... personally :3 \\n\\n\r\ni would recommend this to those who like a little pure romance and enjoy that little squeeze in your heart every now and then X3 but don't watch it if you don't like BL or anything like that, i'd recommend Junjou Romantica to you if you like that little PIZAZZ(if you know what i mean) in your BL anime. And if you're, to say, 'scared' (i don't know how to explain this XD) just watch it and you won't regret, that's what i did and now i have become a fan girl. hahahaha~ :3 \\n\\n\r\n~Shinobu An~",
            "date": "2012-12-13T10:20:00+00:00",
            "helpful_count": 13,
            "mal_id": 80080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1470407.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AnPan-Desu",
                "username": "AnPan-Desu"
            },
            "url": "https://myanimelist.net/reviews.php?id=80080"
        },
        {
            "content": "First, I wasn't even a fan of yaoi before, but I tried Junjou Romantica and I started liking it. And then I read, and watched, Sekaiichi Hatsukoi and it totally blew me away. I've watched both seasons of Junjou Romantica once, and watched both seasons of Sekaiichi Hatsukoi FIVE times and I'm still enjoying it. Lets get to the point.\r\nSeeing the fluffy cute picture of a yaoi couple at the top left corner of this page, you might think 'oh, another fluffy nonsense yaoi where all they do is have sex''. YOU ARE WRONG. One of the reasons why I love this manga/anime so muchis because there is more than just the story of two guys falling in love. Unlike Junjou Romantica where one falls in love with another after his heart was broken, Sekaiichi's main couple actually has a history with each other since high school which gives the story more depth than Junjou Romantica. \\n\\n\r\nAlso, this story is not just 'we meet, we fall in love, happily ever after, the end'. It's 'we meet, we fall in love but we won't admit it, we face relationship troubles but we overcome it'. And personally, I can relate so much of these relationship situations in real life. \\n\\n\r\nDespite what some others might say, the other two couples other than the main is also pretty interesting for me and basically the guys are plainly 'hot' and they're like ideal boyfriends for girls. You can practically daydream about them and not get bored. \\n\\n\r\nI have more to say but I'm extremely bad with words so I might just end up repeating everything up there. But I hope you get the main point I'm trying to say - this manga/anime is not the same as the other BL out there, it has depth and story and not just sex sex sex. Really. c:",
            "date": "2012-07-22T09:17:00+00:00",
            "helpful_count": 9,
            "mal_id": 67331,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1373279.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kiisa-",
                "username": "kiisa-"
            },
            "url": "https://myanimelist.net/reviews.php?id=67331"
        },
        {
            "content": "The story was perfect it made a lot more sense than Junjou and it had a lot more feeling to it. I loved the setting as well how it was set in a shojo manga department. The comedy in this series is so funny, how everyone is like dying at the department and the faces Onodera makes! It was a great story, long lost love, jealousy, romance. It was perfect. \r\nThe art is fair. It wasn't anything that stands out, other than the ridiculous faces Onodera makes XD, but it's not anything that would put you off watching it. \r\nThe sounds track was really goodin my opioid. Well to be honest I didn't like the first opening song it sounded too cliché. But I LOVED the ending song and the second season theme songs. Also the songs throughout the series were cute too, fitting the scenes perfectly.\\n\\n\r\nThe characters were almost perfect. I mean Onodera was the cutest being ever but I got so confused with some characters like Kisa and Chiaki... They all look so similar! The seme's were super hot though.. \\n\\n\r\nI enjoyed this anime so much, like so so much simply because I am a HUGE yaoi fan. I loved it so much that I basically died when I finished watching it. It's a shame it's only 24 episodes because I loved it so much I had to continue it reading the manga and there are so many cute stories in there that should have been continued!\\n\\n\r\nThe only disappointment is that Onodera never told Takano that he loved him.. but the ending was super cute, the ending was perfect.\\n\\n\r\nOver all: 9.8",
            "date": "2012-06-16T16:07:00+00:00",
            "helpful_count": 9,
            "mal_id": 63589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1158433.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/EllenMelon",
                "username": "EllenMelon"
            },
            "url": "https://myanimelist.net/reviews.php?id=63589"
        },
        {
            "content": "If you are ready to indulge yourself in a colorful world with predictable actions, predictable lines, a cast full of bishounens, a lot of love confessions (as well as characters who desperatly try to deny their loveydovey feelings) and those superduper cutsey scenes then I would recommend this one. If, however, you are looking for awesome character building, groundbreaking ideas or something unique then you might want to spent your anime time on some other show.\r\nI am an adult, I know all the reasons why I should not like this anime as much as I do, but I just can't help it. This is myguilty pleasure. \\n\\n\r\nJust kick back, don't sweat it and enjoy.",
            "date": "2011-12-30T12:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 50513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/444246.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/painappurut",
                "username": "painappurut"
            },
            "url": "https://myanimelist.net/reviews.php?id=50513"
        },
        {
            "content": "This is the first BL anime that I've ever seen. All in all, I'm glad as I came across this series, as I gladly enjoyed it. While this show was written for the female audience more than the male audience, as a bisexual male, I feel I found the perfect level of enjoyment from this show. However, it has comedic aspects and a strong romance that even straight guys themselves could easily get into. \r\n-Story- 9/10 \r\nAs far as I can tell, no problems here. Even though I'm new to BL anime, I'm not new to anime in general. And still, this show seemed tobe quite refreshing. Nothing about it seems boring, and I was able to binge watch the show in two days. At the same time, it's nothing out of the ordinary, that's why I'm not giving it a 10/10. However, anyone can easily be sucked into the story. \\n\\n\r\n-Art- 7/10\\n\\n\r\nFrom what I can tell, since BL anime isn't the most popular thing in the world, it usually lacks in artistic style, compared to other genres of anime. Of course, it's nothing bad to look at. It's just average. Compared to other BL though, I must say, it'd be a 10/10. \\n\\n\r\n-Sound- 9/10\\n\\n\r\nNo complaints here. The voice acting was on point, and the anime had enough music to force a decent amount of emotion upon yourself. It could have used some more songs, which would be my only complaint. Other than that, it's completely fine. \\n\\n\r\n-Character- 10/10\\n\\n\r\nProbably the most enjoyable thing of the anime, the characters! I absolutely loved all 3 couples and their personality. They're all different in their own means, however, it was fun to watch them deal with their daily lives, some of them knew that they were gay, while others weren't sure, and this is what made it fun to watch them react to their situations and how society views them. Trust me, you'll love most, if not all of the characters in this show. \\n\\n\r\n-Enjoyment- 10/10\\n\\n\r\nI absolutely loved every minute if this anime! It's fantastic! I never thought that BL could offer a romance as satisfying at this one. There's only one complaint I have, however, I'll address it at the end. The fact of the matter is, I'd recommend this anime to ANYONE who is even remotely interested in anime. This show would definitely be in the top 15 of all the anime I've ever seen. \\n\\n\r\n-Overall- 9/10\\n\\n\r\nBesides the sub-par art style and hiccup of the story, this anime is great. Oh, but there is one thing I would like to mention. After you finish watching this anime, WATCH  SEKAIICHI HATSUKOI SEASON 2! My one complaint with this anime is the ending was unsatisfying. You will definitely experience this, too.  I'd say the second season is even better, it grows on the relationships and patches up the rough spots. If you enjoyed season 1 at all, season 2 is a must see.",
            "date": "2015-07-20T19:31:00+00:00",
            "helpful_count": 8,
            "mal_id": 193957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759204.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tyler_thomas48",
                "username": "tyler_thomas48"
            },
            "url": "https://myanimelist.net/reviews.php?id=193957"
        },
        {
            "content": "*This is a spoilerfree review*\r\nThis is my favourite anime of all time. \r\nHonestly it is the cutest, funniest and most addicting BL story I have ever had the pleasure of being addicted to. \r\nIf you are into BL, Shounen ai and the like, this really is a MUST watch.\r\nThe anime (and manga alike) are divided into stories about several couples. I know a lot of people who have watched this feel like they could do with only following the main story, and I can agree with this to a certain degree as their story is the most elaborate one and probably also the most infatuatingof them. BUT I honestly have to say that I enjoy them all, and the anime certainly wouldn't be the same without them.\\n\\n\r\nAs to why you should watch this particular anime I would start off by mentioning Takano-san, as he is one of my all time favourite characters and makes this story so much better than it already is. Forceful, manly and to the point that is what i love about him. \\n\r\nAs you watch and learn about the past and present hidden feelings in the relationship between him and the main protagonist Onodera, it makes your heart ache both in agony and in excitement for the two of them as they live their (not so separate) lives, being pulled closer and closer together.\\n\\n\r\nAs I mentioned before, in addition to this couple you get the pleasure of watching three other couples whose stories supplement the main one, bringing you different perspectives and  make out separate pieces of the full story.\\n\\n\r\nTo sum it all up, this is a romance story where you don't have to wait for the action to start, it hits you right out of the gate and holds you in front of your screen until you're suddenly done with the whole thing. \\n\r\nDefinitely a story worth watching, and one that will make you cry and laugh along with the characters as they fall in and out of love. \\n\r\n \"doki doki\"",
            "date": "2015-08-19T11:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 196543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4723499.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Varmkun",
                "username": "Varmkun"
            },
            "url": "https://myanimelist.net/reviews.php?id=196543"
        },
        {
            "content": "TLDR; Even if it has BL, it doesn't excuse the show from poor writing and poorly written characters.\r\nI like BL... which is something this show has. But I also like good writing... which is something this show DOESN'T have.\r\nStory 3/10\r\nAs I mentioned before, this show's writing is pretty bad. The story is basically the characters going through the everyday issues they have at work (needing to meet a deadline, being overworked, ...being sexually harassed by their boss...) and a bunch of romantic melodrama that basically boils down to bad communication. A lot of decisions the characters make are questionable and usually made me go \"WTFyou doin m8\". Oh, and apparently all the dudes that work at this shoujo department are gay. Makes sense.\\n\\n\r\nArt 7/10\\n\\n\r\nIt's good. Many attractive bishies and stuff. Woo. However, one of my gripes is that all the ukes basically look the same (sneering expression, big eyes, short). Same can be said about the semes.\\n\\n\r\nSound 6/10\\n\\n\r\nThe OP and ED of the first season are okay. Season 2 had a better OP and ED. The rest of the music is forgettable at best and dull at worst. However, I give this a 6 because it has some good voice acting (not to mention that it features many of my seiyuu biases).\\n\\n\r\nCharacter 2/10\\n\\n\r\nThe worst part of this entire anime. Also this part will contain mild spoilers so if you don't wanna know, move on. First off, the personalities of the ukes are basically carbon copies! HINT: They're tsunderes. On the other hand, the personalities of the semes are different but blander than cardboard. Yukina- The \"prince\". Basically a perfect dude with pretty much no flaws besides the fact that he's a lot younger than his lover (but that's not even a flaw so WTF). Hatori- A kind and caring workaholic who is very loyal. He was actually the most likeable out of the main six but apparently he rapes Yoshino in the manga so nvm I guess. Takano- the seme of the main couple and the dude I had the most issues with. First of all, he basically abuses his power as Onodera's boss and sexually harasses him both in and out of the office. Yes, we as the audience knows that Onodera does like him, but no means no. He tells Takano to stop MULTIPLE TIMES and yet Takano just pushes it further going like \"you know you want it\". BRUH, STOP. He also takes advantage of Onodera when he's drunk and then has the audacity to get pissed at Onodera when he doesn't remember what happened. Dude, you were completely sober and knew full well that he was drunk and yet you were like \"we'll bang okay\". Creep. He only gets slightly redeemed near the end when we FINALLY see his backstory.\\n\\n\r\nEnjoyment 6/10\\n\\n\r\nEven though I had issues with the characters and story, I will admit that I enjoyed watching this at times. Why? Cuz I like BL, and there are barely any shows that have it.\\n\\n\r\nOverall 4/10\\n\\n\r\nAt the end of the day, this show is only about fan service for BL lovers. There is no depth to it at all and does not portray a healthy relationship in anyway. Don't be fooled by this show's high ratings. We fujoshis tend to cling onto anything that has BL and hype it up to be better than what it actually is. If you can turn your brain off, then you'll probably enjoy this. Otherwise, stay away as this show will make you go \"wtf are you doing m8 he said stop OH GOD WHY ARE YOU DOING THIS YOU'RE HIS BOSS I'M PRETTY SURE SOMEONE COULD FILE A LAWSUIT AGAINST YOU FOR DOING THAT\". Or something.",
            "date": "2017-01-19T06:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 238628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3780691.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/krzywasabi",
                "username": "krzywasabi"
            },
            "url": "https://myanimelist.net/reviews.php?id=238628"
        },
        {
            "content": "So, I'm a little conflicted on how to review this anime properly because I did enjoy it to the fullest extent. I'm gonna try to give criticisms here so I'm not so biased, but it really is a fun anime to watch regardless of its imperfections. \r\nI'm not the biggest fan of the art style. The character designs aren't exactly the nicest to look at all the time because of the facial proportions, but I guess that's down to taste. Additionally, the characters are all very similar in appearance, so I actually had a difficult differentiating between them initially. As far as scenery and stuffgoes, it isn't really all that spectacular. So, I guess you could say the art is average. The music is also average, though the voice acting is pretty awesome. It sets the tone for comedic scenes really well. \\n\\n\r\nI like the characters quite a lot, stereotypical they may be. Stereotypical may seem bad, but they became stereotypes for a reason, right? I didn't mind it, at least. The story was mostly good, especially for a Shounen Ai. By that, I mean that it actually HAD a story rather than it just being about the risque stuff. The story also extends past the relationships in the anime, so that's nice. You get to see a bit of character growth out of the main character besides the development he has through his love life. \\n\\n\r\nI don't necessarily think the extra two couples were necessary to add in as their stories, by default, didn't make as much sense as the main one because their side stories, so they didn't get the proper setup. Unfortunately, that meant some of the things, like the \"I love yous,\" felt cheap and unrealistic, which runs a little closer to how normal Shounen Ai anime are. I'm also not the biggest fan of the whole \"oh, but you're a GUY\" mindset in these types of anime because it ruins the point of the romance, but that was a small detail to look over in this anime. \\n\\n\r\nAll in all, if you're looking for a Shounen Ai with a little something more, give this a go. It does have some substance to back everything else up, and while it's not perfect, it's probably one of the better Shounen Ai anime you're gonna get.",
            "date": "2018-10-31T13:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 293076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=293076"
        },
        {
            "content": "It's been a while since I finished the anime, meaning all Junjou and Sekaiichi seasons. \r\nSo I'm gonna write a review of Sekaiichi as I feel like giving a shoutout to a specific thing from the anime that I'll be mentioning in a bit.\r\nLet me quickly add to this that it was amazing to watch Junjou and Sekaiichi crossover moments, it was awesome and a great idea.\r\nAnyway let's get into it!\r\nThe story:\r\nThe story itself is great and super cute in so many ways, and there's a lot of drama and like JJR, the characters in this anime always tend to overthink everything that happens, whichsometimes gets on my nerves but yeah.\\n\r\nI like how this is all based on real artistic manga editing, speaking of the characters daily jobs in the story, or so I think.\\n\\n\r\nThe art is super great and the face expressions the characters are able to show in each scene is just on the spot.\\n\\n\r\nThe characters:\\n\r\nThey are each unique but it can be difficult to tell them apart because..\\n\r\nYeah they look alike. \\n\r\nBut it was a good idea to add more than just one couple to the series like JJR did.\\n\r\nIt appears the youngest looking main characters always have their funny expressions way more often than the other partner of theirs, and it makes me laugh all the time, of all the anime series I've watched, these JJR and SH made me laugh the most.\\n\\n\r\nAs for what I was gonna mention, is how a lot of episodes ends up with the watchers (us) gets a view of the skies, while this one character screams his lungs out, whereas an echo is heard afterwards, that always make me laugh it's so funny that this kind of scene repeats itself so many times in Sekaiichi.\\n\r\nGiving an example on what the character could be screaming as the episode is about to end:\\n\r\n\"This isn't love...THIS ISN'T LOVE..... THIS ISN'T LOOOOOOOOOOVEEEEEEEEEEEEEEE!!!\" \\n\r\nAmazing, very good idea!\\n\\n\r\nAnyway, overall, I really like Sekaiichi and Junjou and they're very alike of course.\\n\r\nIf you have yet to watch Junjou, I recommend watching that first.\\n\r\nI give this anime a 9.\\n\\n",
            "date": "2018-09-11T11:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 288759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738220.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Craneface",
                "username": "Craneface"
            },
            "url": "https://myanimelist.net/reviews.php?id=288759"
        },
        {
            "content": "It's really too bad that only popular BL manga gets an anime, not actually quality BL manga. I am clearly getting too darn old for this.\r\nBut at least it isn't as bad as BL anime used to be, so that's progress.  Nobody is actually getting outright raped!  We just have to put up with the never ending dubcon and the obnoxious stereotypes.  The stories are contrived, but at least hang together by a thread, so that's something else to be grateful for.  I had trouble with the pacing -- we get 4 episodes with couple A, then 2 with couple B,back to couple A, then 2 episodes with couple C; I felt like story coitus interruptus every few episodes.  I think this would have worked better as either distinct parts A, B, and C, or much more interwoven.  The latter would have required a lot of authorial skill.  \\n\\n\r\nStory:  Nakamura Shungiku is actually writing about something she knows here, which is the manga publishing business, and that's a pleasant surprise; it adds verisimilitude to the otherwise typical BL story style which isn't realistic or believable.  Sure, high school lovers fall out over stupid misunderstandings, and heck, maybe they indeed meet accidentally again 10 years later in the same workplace, but please -- do they also have to end up living right next to each other?  In Tokyo, of all places?  You'd win the lottery before that would happen.  Onodera doesn't even recognize the love of his life, which I also find not very believable, especially since the art makes them look pretty much the same, only a little younger.  Story B features the densest childhood friend ever (childhood friendship leading to love being a trope I admittedly love, but not in this incarnation).  Story C is more believable (Kisa falls in love with any pretty face after all, and Yukina certainly is pretty), but I can't say I liked it much because that's so damn superficial.  In all three stories, misunderstandings drive the plot.  I hate that, it is the laziest writing.  There is no good ending here; they must have known they were getting a second season, because the first one just petered out.\\n\\n\r\nArt: Nakamura has gotten better over the years, but I don't think I'll ever like her art much.  Her guys all look too much alike since she has basically only two types, uke and seme, and they fit all the standard stereotypes:  Seme are taller, dominant, forceful, usually older, with stoic faces, while uke are much smaller, submissive, usually younger, with bigger eyes, rounder faces, wishy-washy but tsundere to cover up their insecurities which are legion, who blush constantly, and cry at the drop of a hat.  The backgrounds are fairly nice.  The animation is standard for BL; gotta keep the budget down.\\n\\n\r\nSound:  I like the Japanese-flavoured BGM, and the OP and ED are upbeat pop which is always fun to bop along to even if it is forgettable.  Voice talent is a nice collection of good seiyuu who do BL, and I think they do a decent if not inspired job -- well, the material isn't inspiring.\\n\\n\r\nCharacter:  Oy. I tend to prefer seme to uke, and that's no different here, especially since the uke are such whiny stereotypes. The disadvantage is that we're never in the head of a seme, so we get them only second-hand, while for the uke we get their entire inner monologue, which tends to make me want to kill them.  I wonder if the seme would only grunt if I could hear them think, they have such caveman tactics.  I kind of like Onodera because he is actually hard working, wants to make it on his own instead of resting on the family laurels, and he has somewhat of a legitimate reason for ditching Saga/Takano in high school.  I always enjoy the times when those two work together, because that's when they both shine, and when one can see a decent relationship.  It's when it comes to interpersonal relationship skills that they both suck.  Yakazawa makes an interesting spoiler, though we know of course that his obvious love for Takano isn't going anywhere (he's a seme, after all, and that would be seriously transgressive).\\n\\n\r\nHatori is too bloody stoic, and Yoshino is an oblivious moron whom I despise because he is also selfish and a lousy friend, and since Hatori has to know how dense he is, it's his own damn fault he doesn't get anywhere with him.  I don't care about this pairing at all, I would hope Hatori finds somebody better.  Heck, take Yanase, at least he has more than two brain cells to rub together.\\n\\n\r\nI don't really care for the third pairing either, though Kisa doesn't bother me quite as much as Yoshino because he isn't as dense, but his resigned tone is depressing.  Yukino, on the other hand is a great guy, incredibly mature for his age (more so than Kisa), and hey, here we have Nakamura getting as transgressive as she ever gets -- he is a younger seme!  These two have the least dubcon, but I just can't like Kisa enough.  His story also seems inconsistent, what with how he acquired a stalker.\\n\\n\r\nEnjoyment:  I enjoyed this most for the workplace and the information about publishing; Marukawa Shoten has got to be the gayest publisher ever.  ;)  Takano x Onodera was somewhat interesting, but I got eventually tired of them and the neverending protestations of Onodera, and Takano's rough handling of him. I am not sure why any straight man would be interested in this anime; maybe there is enough humour in the misunderstandings to get some laughs.  There isn't a whole lot of fan service here (watch \"Free\" if you want near-nudity nearly all the time), and nothing graphically explicit.",
            "date": "2016-09-20T10:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 229622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229622"
        },
        {
            "content": "A very generic BL story, which I would describe as a waste of time. \r\nUnlike other BL anime this anime goes no further than a kiss, let me remind you all character are 18+ but nothing more than that developed.\r\nAs usual the younger boy in 2 of the 3 cases was basically the same character, both being unaware of their own feelings and looking and sounding exactly the same.\r\nWould rather this focused on 1 couple instead of 3, as this got very confusing with the character all looking alike.\r\nHow much more generic could you get than a BL story being based around literature/manga\r\nStudio Deen seemsto copy and paste all their BL stories, so if you've seen one you've seen them all.\\n\\n\r\nWaste of time, DONT WATCH! Have no idea how this anime is rated so high",
            "date": "2017-02-01T13:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 239669,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5585425.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ren07",
                "username": "Ren07"
            },
            "url": "https://myanimelist.net/reviews.php?id=239669"
        }
    ],
    [
        {
            "content": "Some may argue that this anime is just another BL anime focused on fanservice for the girls. While I'm not totally denying this, I do have to say that there's more than meets the eye when it comes to Sekaiichi Hatsukoi. Unlike Junjou Romantica where it's just SEXSEXILOVEYOUSEXSEX every episode, this actually has a pretty good story.\r\nStory: 7/10\r\nIt's simple, sweet, and straight to the point. Some may view that as a good thing while others may disagree and claim that's a bad thing. Personally, I thought the story was fairly well done considering this is a BL anime. One of the biggest flaws, however, isthat the drama is kind of forced upon the viewer...but since this is a Shungiku Nakamura series, we all know the drama isn't going to end in heartbreak or tragedy; you know all of these guys are going to eventually end up in a relationship and live happily ever after because, well, that's just what happens in her works. The drama is there to interest the viewer, but it doesn't necessarily serve a big purpose within the story. Do I think that's a bad thing? I believe if it's a device to interest the viewers, then go for it.\\n\\n\r\nArt: 7/10\\n\r\nDeen did much better this time than in Junjou Romantica, that's for sure. The backgrounds have a more soft feeling about them, and it reminded me of Hourou Musuko's background art (if you haven't seen Hourou Musuko, the gist of what I'm getting at is that the background art is done extremely well). So the backgrounds are beautiful, that's fine and dandy. But the characters? I don't mind that they're all bishounen/\"bishies\" because that fits in with the theme, but...ugh, the faces. And the hair. They're all identical. I'm not talking about the color of the eyes and hair, but the shapes and styles are basically all the same. It's just a little thing but it bugs me when I get the characters confused since they all look too similar.\\n\\n\r\nSound: 5/10\\n\r\nIt's really nothing very special. The opening is upbeat which fits Sekaiichi Hatsukoi considering this anime is a lighthearted romance/comedy, and the ending is more serene. As for voice acting, it was simply alright. The ukes sounded girly and whiny and the semes sounded manly and rough. Too bad that, like the art, everyone sounded the same. It was a mediocre performance on the seiyuu's parts.\\n\\n\r\nCharacter: 5/10\\n\r\nCharacter is where the series starts slacking, because they're all so stereotypical and it can get REALLY annoying after a couple episodes. All of the ukes (Ritsu Onodera, Chiaki Yoshino, and Shouta Kisa) have the typical I-don't-want-you-to-kiss-you-even-though-I'm-obviously-in-love-with-you-so-I'm-just-gonna-keep-pushing-you-away-because-I'm-stupid attitude, whereas all the semes (Masamune Takano, Yoshiyuki Hatori, and Kou Yukina) won't give up because they know the ukes are undoubtedly in love with them. There's slight character development, but not enough to drastically change their attitudes or anything. It's the average stuff you see in BL which is why I rated it as such.\\n\\n\r\nEnjoyment: 8/10\\n\r\nI like this series, don't get me wrong, but some major flaws and the ending prevented me from giving this a 9/10 like I would have originally put as my enjoyment score. I looked forward to watching a new episode every week, but it simply didn't astound me like some other anime has done. I'd still consider it a favorite, but objectively speaking there are quite a few weaknesses within this series.\\n\\n\r\nOverall: 6.4/10, rounded to 6/10\\n\r\nSekaiichi Hatsuko isn't atrocious, nor is it a masterpiece. It's slightly above average. The story and art are nice, but that's really all this anime has going for it. If you like BL, you'll probably enjoy this. If you're wondering whether you should dip your toes into BL by using Sekaiichi Hatsukoi as your starter series, you might finish up episode 12 and feel pretty underwhelmed.",
            "date": "2011-06-25T11:05:00+00:00",
            "helpful_count": 218,
            "mal_id": 38290,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/277613.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/QueenOfAlbion",
                "username": "QueenOfAlbion"
            },
            "url": "https://myanimelist.net/reviews.php?id=38290"
        },
        {
            "content": "I decided to give everything this season a shot, and as far as breaking out of my comfortable genres I thought that even BL wouldn't stop me. As a straight man I found it slightly hard to enjoy the romantic moments this is true. However, as I knew beforehand you can find some good stuff in the most deceiving places.\r\nLike the start. I found the setting introduction was pretty funny, and the initial backstory was pretty interesting between Takano and Onodera. A long lost boyfriend from 10 years ago ends up as your boss in the hectic manga section of the company, the section youdidn't apply for. The attitude between the two is pretty funny with their constant bickering. This does make it slightly difficult for the relationship to develop however, as there is even more issues than just Onodera's attitude. Unfortunately, the story is left unresolved and leaves you with a horrible sense of un-fulfillment by opening up more plot.\\n\\n\r\nThe cause for the lack of resolution is the introduction of the two other side couples. The first is between Yuu a popular oblivious mangaka and his childhood friends who became an assistant and an editor. The second between a editor whom has given up on successful relationships with good looking men, and a good looking manga salesmen. They aren't bad stories either, but eventually after episodes 5 through 10 you wonder what happened to the main story. Of course, neither is two or three episodes enough to deal with these new sub-plots either. \\n\\n\r\nI found Hatsukoi to have a surprisingly good sense of humor, and for me that is what I enjoyed the most. However, this pretty much disappeared as things got more serious farther into the stories which is a shame. With the waning of the humor the show turned, metaphorically, into the Uke crying rape and leaving the Seme to scratch their heads at the situation. Seriously, I thought that the female tsunderes were bad, but the male ones can be just as annoying. \\n\\n\r\nFor me Hatsukoi started out as an enjoyable show and then turned into somewhat the dreaded show. Of course, if you enjoy BL which would be a logical assumption, then it is a good watch. The issues about the story are somewhat resolved as there will be a sequel leading the once crappy ending into something more acceptable. \\n\\n\\n\r\nFeedback and questions are welcome! Thank you for spending time to read my review!",
            "date": "2011-08-01T06:05:00+00:00",
            "helpful_count": 169,
            "mal_id": 40533,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/257625.jpg",
                "scores": {
                    "animation": 0,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/helur",
                "username": "helur"
            },
            "url": "https://myanimelist.net/reviews.php?id=40533"
        },
        {
            "content": "-Again, not so good at writing reviews, but I'll try-\r\nNakamura Shungiku, author of Junjou Romantica, has made, yet, another great series known as Sekaiichi Hatsukoi. If you love Junjou Romantica, then you'll love this one! The romance in this series is twice as much as Junjou, that my inner fangirl just broke out. Trust me, it's so kawaii~! And Nakamura never fails to amaze me with the comedy in her work. Reading Junjou and Sekaiichi has always made me laugh and smile, no matter what kind of mood I'm in. I've watched the 2 episodes of it, and just watching the end of each episodegives me the feeling of wanting to watch more. But since it's still ongoing,  you have to be patient when the next episode comes out T_T but it's worth it! Even watching it over and over again, I never get tired of it 'cause I really enjoy this series so much. Please watch it! You'll be glad you did :D",
            "date": "2011-04-15T19:31:00+00:00",
            "helpful_count": 93,
            "mal_id": 36106,
            "reviewer": {
                "episodes_seen": 2,
                "image_url": "https://cdn.myanimelist.net/images/userimages/443724.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/XLady-IllusionX",
                "username": "XLady-IllusionX"
            },
            "url": "https://myanimelist.net/reviews.php?id=36106"
        },
        {
            "content": "Skip this paragraph, come back to it after you have read my review (below):\r\nOkay okay, after seeing all these bad ratings I'm guessing people who've been reading this are misinterpreting the message I'm trying to send across to the readers. I'm going to write here what the jist of this review is stating since I'm guessing not everyone has read my entire review and has failed to see the main point. Essentially, the point I'm trying to get across to you is that this show is pure \"fanservice\", like \"moe\". The writers are specifically targeting women through this series and creating a piece adorned withhot \"bishounens\" to cater to this specific demographic of yaoi fans. This is not necessarily a bad thing, but that's it, that's all this series is and how the company reels in its viewers. The story is plain as well as the characters, and the company, like all other anime studios that distribute ecchi related series, are simply using this series to get yaoi fan viewers!! That's it!! this story has little substance and so does its characters!! so don't expect any wonderful plot or story from this series.. \\n\\n\\n\\n\r\nStart reading review here: \\n\\n\r\n I am, for one, absolutely against reviews based on the first few episodes aired of a series, but this is serious, seriously agitating to the point that I am compelled to write this no matter what barrier lies before me. Why might you ask? why?? because, Sekaiichi Hatsukoi - in simplified terms -is Shoujo or girl \"ecchi\". This anime series is completely mundane and banal in all media related aspects from story, to art, to character. Honestly, the only thing worthwhile in this series is the sound, and even that isn't of a grand level of degree. The series is a waste of a time, and It is so gay, and I can validate that as gay person!( Oh yes, the irony hahaha...)\\n\r\n   I know I'm asking for an internet trashing (pulls up firewall) for bashing on this completely gay show, but I'm laying down the facts so I can hopefully convince you and everyone out there - whom posses the decency and optimal intelligence - to help you avoid wasting spare minutes of your life. \\n\\n\r\n  So, Why is this show gay?, apart from the obvious yaoi entitled genre and daunting advertised images of its homosexuality(towards those homophobes out there), that answer lies within an analysis of the story, characters, and art (which i will thoroughly soon cover).\\n\\n\r\n   The story is almost lackluster; filled with predictable characters associated with identifiable archetypes and an empty story acting as a vessel to hold these characters together. The story starts out with Ritsu Onodera, one who might be considered gifted, adorned with wealth and a good enough family to support him. Despite this, Onodera wishes to rebel against his content position in life and decides to step back a notch, entering the manga world while fleeting the prestigious world of literature and novels he had embarked upon in order to prove a somewhat childish notion of pride; proving that he can bolster himself in the adult world of corporations and succeed without help from his father. So far we can see that Onodera is the stuck up one, essentially he is the up-tight archetype impelled by pride; if he were a girl, he would be a tsundere. His fierce, defiant, and prideful attitude can be seen when he is infuriated by Masamao Takano, his editor in chief. Onodera also has a nice side to him - seen when he encourages the female staff members before their deadline - but all in all his character is completely mundane. All the mundane aspects of a yaoi series are evident within this story and especially within Onodera whom elicits them. Envy, greed, and pride a just a few that Onodera exudes when seen in conflict with counterpart, Masamao Takano. Masamao takano, on the other hand, is the calm and composed archetype - he is nonchalant, yet he can be easily incensed and infuriated  \\n\r\nand throw a mad fit. He can be compared to any worker who gets all worked up after a stress-induced job (think, Gordon Ramsey). The writers present us with a wonderful plot twist as both Onodera and Takano have, in fact, met before and, of course, as all gay men, had an affair. \\n\\n\r\n      Although the plot twist is intruiging.. it is so horribly executed and a grave, grave stereotype (I mean, come on! we don't all have sex on the first day, we're not hormone raging idiots that everyone makes us out to be!). Onodera and Takano are repeatedly seen with each other in their memories of their young, teenaged love life up to their modern day work lives. The plot twist becomes so incredibly evident that it becomes lackluster.. I mean, what were the writers thinking? \"Hmm.. we should come up with an interesting plot twist for this series, lets make them high school lovers! and when they grow up they'll coincidently find a job together and fall in love all over again, yay!!\" You see what I mean? The plot is so predictable, I mean, It's so obvious that they'll end up together and what's worse, is that the viewer is forced to watch their endless meet-ups and run-ins in the workplace while the plot twist just drags on and on and on.. Sure the writers may have been planning to build the momentum of suspense, but it just dragged on for too long that the enthusiasm dies out.\\n\r\n    Not only is the story ruined by such atrocious plot-planning by the writers, but everything including the characters, scene, setting that revolve around the story seems so FAKE. I mean, what is the coincidence that all the characters of the show will end up in a publishing company for shoujo manga, and furthermore, what is the coincidence that they are all men and that both the main characters will just mysteriously end up there by \"fate\". I mean, come on! the plot is so cheesy to be taken seriously, besides this, everything is clearly targeted to women. The company is filled with men, lots of men, and the art style of which they are drawn is horribly banal; with large shoulders, thin waistline and long faces. Like I said.. this is so obviously \"girl ecchi\", It can be compared to other shounen targeted works of ecchi such as love-to-ru and whatever harem possesing anime series are out there. All in all, what I'm trying to get at is that there is no sense of reality, normality, or any sense of naturalism. The writing feels so narrow-minded and there is no authentic feeling of true emotion of true human interaction. Heck, there couldn't possibly be in such a contorted setting that highly deviates from reality. It all comes down to the media and its corporations, strictly targeting to woman. I bet that if they planned a series with a normal setting, as in both men and woman, such as a high school, the show would reap a broad amount of viewers and could delve deeper in to realer sense of interaction between male characters, because, afterall, homosexuality isn't all about sex, there can be love too.\\n\\n\r\nWow, I really dragged on in this review.. and before, or if anyone flames me I just want to let you know that I'm being mostly satirical in this review, don't take it seriously when I hate on gays.. (I mean come on.. I am gay), but definitely heartfelt thoughts went into this review. And hey, if you are a hardcore yaoi fangirl, go ahead and watch this series and enjoy it, but whom I'm mostly addressing in this review are those who are looking for a series with a substantial plot and with substantial characters. A great example of a yaoi series that elicits this would be Hourou Musuko, that I would definitely recommend to anyone (especially the writers of Sekaiichi Hatsukoi, haha, i kid i kid).",
            "date": "2011-04-23T10:33:00+00:00",
            "helpful_count": 89,
            "mal_id": 36361,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/367934.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/MSfanatic",
                "username": "MSfanatic"
            },
            "url": "https://myanimelist.net/reviews.php?id=36361"
        },
        {
            "content": "Alright... Before I start on anything, I'll be writing this as someone who has watched Junjou Romantica BOTH seasons more than three times and I've watched 7 episodes of Sekaiichi Hatsukoi with repeats of each episode twice after airing.\r\nI have to say, I've been waiting for this anime to come out a long time ago and when it did, I completely flipped. It is right down AMAZING! But I have to tell you, my review will be filled with my own thoughts and feelings for the anime so yeaa..\r\nLet's cut it down part by part kay?\r\n- Story -\r\nSimilar to Junjou Romantica's set, there are 3stories revolving around 6 main characters in the anime. The basic setting is that all the characters work on or are familiar to shoujo mangas. The two main characters and the main couple work in an editing company for shoujo mangas and it really shows the daily routine of a manga editor. The main story is about how the main character, Onodera Ritsu stumbles with his old lover who was also his first love and starts getting confused in his feelings for the latter. I've seen this plot in a lot of other animes/mangas where the main character gets confused in his feelings and all so it's pretty common. But it's the first time I see a BL anime set up in a manga editing company so I guess it's a plus point. Nevertheless, the story has its own special originality to it which won't make the viewers bored if they are those who really focus on the storyline or setting.\\n\\n\r\n- Art -\\n\r\nThis is probably one of the biggest plus point in the anime. The art is AMAZING and beautiful... The colours they used really brought the life of the settings and characters. Not to mention it brought out the hotness of some characters like Saga/Takano Masamune and the newly introduced character Yukina Ko. They are all beautifully drawn and as the anime's target is for female viewers (such as I), this is basically the eye candy for every shounen-ai lover out there.\\n\\n\r\n- Sound -\\n\r\nI LOVE both the opening and ending song. The opening has an interesting upbeat sound which really attracted my attention straight on when I watched the first episode. And the ending can really make somebody cry tears of awe. Whenever it played, I imagined a hopeful person wishing for love and I can't help but just shed tears at the beautiful melody of it. The instrumental soundtrack is also well made. Music is pretty much what brings up the feelings in a scene and I have to say, it has done an amazing job to move me.\\n\\n\r\n- Character -\\n\r\nOnodera Ritsu will probably my absolute favourite in this anime. His stubborn, serious hard-headed yet soft-hearted personality really caught me right from the beginning. A hardworking main character is common for an anime but he has his own originality which makes him a very loveable character. Takano is your average awesome-hot guy who succeeds in almost everything he does except when dealing with the guy he loves. But then again, I'm pretty sure there's more to Takano than meets the eye. That's what makes this guy to die for! The other characters have their own story and background and this is why Junjou Romantica and Sekaiichi Hatsukoi are such interesting animes. It doesn't only focus on one main pairing but revolves in the other characters. I have to say, even though some pairings have a very fast or slow development and all, they are all an important substance in the story and they bring up their own originality in their own way.\\n\\n\r\n- Enjoyment + Overall -\\n\r\nWhat can I say? I've rewatched each episode at least twice after the subs come out. And I'm pretty sure I can rewatch it again even when it ends. I don't know about others' thoughts for the anime but I think it is a great release and I hope there is a second season of it just like Junjou Romantica. To those who haven't watched Junjou, you better do! Because it is just as awesome as Sekaiichi. \\n\\n\r\n10/10 -",
            "date": "2011-06-02T02:44:00+00:00",
            "helpful_count": 50,
            "mal_id": 37507,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/414122.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Amaranthyz",
                "username": "Amaranthyz"
            },
            "url": "https://myanimelist.net/reviews.php?id=37507"
        },
        {
            "content": "Sekaiichi Hatsukoi, you say? Now, looking at the picture right there at the top, you might think that this is just Junjou Romantica again, seeing as how both series are rather fluffy yaoi with the exact same art style. You'd be right. This is, more or less, Junjou Romantica season 3, even taking place in the same setting but with a different main cast.\r\nIs this a good thing or a bad thing? Let's dive deeper into the deep depths of the phenomenon known only as \"Sekaiichi Hatsukoi\".\r\nActually, the depths aren't that deep. This is one of the shallowest anime I've ever watched. Like Junjou Romantica,Sekaiichi Hatsukoi focuses on not one but three different couples. Well, I say \"different\". Each of the couples has one \"bottom\" and one \"top\". The bottoms all look the same, as do the tops. It was the same deal in Junjou Romantica. The character designs aren't very varied, to be perfectly honest. The couples' dynamics are very similar, too. Often to the point of being completely identical.\\n\\n\r\nYou see, the top is in love with the bottom for some reason or another. The bottom is completely clueless about this affection until the top sexually harasses the bottom in some way or another. The bottom then goes into full-blown tsundere mode, as he completely ignores the top's advances, while said top keeps going \"WHY DO YOU NOT ACCEPT MY FEELINGS\" or \"I WILL MAKE YOU FALL IN LOVE WITH ME\" with occasional additional sexual harassment. Repeat this formula twice and et voila! You have a 12 episode yaoi series. \\n\r\nHow wondrous! How magnificent!\\n\\n\r\nOkay, there's a slight bit more to it than that. I actually had high hopes for the third couple, which seemed to be basically... based on physical attraction and nothing more. Of course, by the end of their introductory episode those hopes were dashed and it was on to the aforementioned formula. But enough about that. If you've seen Junjou Romantica you know full well what to expect. \\n\r\nOn to the other aspects of this work of art.\\n\\n\r\nThe art and animation is rather lackluster for 2011. I mean, okay, it's Studio DEEN. They're not exactly the most financially stable studio. Hell, they're not even the best known for high quality stuff. Anyone see Higurashi? That was a very ugly show in more ways than one. Basically, it looks exactly like Junjou Romantica, a show from 2008. Not terribly ugly, but not exactly breathtaking.\\n\r\nAs for the BGM, I hardly even noticed it. I'm not too hot on the ending theme, but the opening theme, sung by Shuuhei Kita, is admittedly very catchy.\\n\\n\r\nThe characters are about as three-dimensional as a piece of paper being ironed while being run over with a steamroller made of pancakes, but they do have some rather nice voices. I mean, Hiroshi Kamiya. He can make just about anything better with his... very lovely voice. Too bad his character is relevant for all of one episode.\\n\\n\r\nNow, if you liked Junjou Romantica, you'll probably like Sekaiichi Hatsukoi. I mean, it's pretty much the exact same thing, but with less steamy gay sex. Junjou Romantica's absolutely hilarious fits of melodrama are still on display here, but either they're just not as amusing or I've been desensitized towards them. At any rate, Sekaiichi Hatsukoi isn't too bad a way to kill some time.\\n\\n\r\nJust don't go in expecting anything with substance.\\n\\n\r\nYou will be sorely let down.\\n\\n\r\nI give this show a 6/10. It's unremarkable but I kind of like it, even though I'm not exactly in its target demographic. Unless I've somehow turned into a 13 year old girl overnight.\\n\\n\r\nThat would be an interesting experience. More interesting than this anime, at least.",
            "date": "2011-07-03T18:07:00+00:00",
            "helpful_count": 34,
            "mal_id": 38630,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/118640.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Keirik",
                "username": "Keirik"
            },
            "url": "https://myanimelist.net/reviews.php?id=38630"
        },
        {
            "content": "Sekaiichi Hatsukoi is the first shounen-ai anime that I have ever seen, so I was skeptical at the beginning of course, but after only the first episode I was already sure that was a very well done anime.\r\nStory 9/10\r\nThe story it's nothing out of the ordinary, but still not so predictable. Even though the themes are simple they are well explained, the timing it's perfect so that you can feel what the main character feels (at least, I felt it).\r\nThere are three love stories but they are different to each other so that the viewer won't get bored. So yes, 9 out of 10 becausenothing is left unsolved (the story continues in the second season though), every event matters.\\n\\n\r\nArt 7/10\\n\r\nNothing much to say, the animation is fine but nothing spectacular, I don't like very much the drawings but that's my personal opinion, everithing's fine, nothing extraordinary.\\n\\n\r\nSound 7/10\\n\r\nThe opening and the ending are fine, they could be better but they do their job. The soundtrack it's not memorable but it fits the moment.\\n\\n\r\nCharacter 10/10\\n\r\nThe characters are very well developed, they let you know what they think so that you can understand the reasons under their behavior. Throughout the story, the characters behaviors are always in line with their personality, and that's the real strenght of this anime.\\n\\n\r\nEnjoyment 9/10\\n\r\nThis anime made me remember how I felt when I fell in love for the first time. I thought I would never feel again like that.. So I recommend this anime because it's not superficial at all, instead it's deep and intense.\\n\\n\r\nOverall: 8 (I have to consider sound and art.. but enjoyment is more important!)\\n",
            "date": "2015-02-26T18:26:00+00:00",
            "helpful_count": 19,
            "mal_id": 181278,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4466175.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/lichedilia",
                "username": "lichedilia"
            },
            "url": "https://myanimelist.net/reviews.php?id=181278"
        },
        {
            "content": "I just finished watching Sekaiichi Hatsukoi for the second time. I was worried my review would have been biased after the first time because I had fallen in love with the series. After watching it a second time, I can say with the utmost certainty that this series is fantastic.\r\nDo not let the fact that this is boy love scare you away. Whether you are straight or not, you can find yourself being taken away by this love story. I did.\r\nThe story is fantastic, much better than the story of the parent series Junjou Romantica. It kept moving at a steady pace and only ina few situations did I feel that it was taking steps back. But if you look at it from another perspective, it can be accounted to Onodera’s apprehensions of loving Takano again. In which case, it can be seen as great characterization of Onodera. The final episode is told from Takano’s perspective and it is a great conclusion. It tells us more about Takano as well as giving us more of their past. I loved the manga backdrop to it all. It gives an insight to the process manga authors and editors go through. I don’t know what else to note of the story besides that it is well thought out and entertaining.\\n\\n\r\nThe artwork was beautiful and only at a few points did I find myself put off by it. This is a romantic comedy so you should expect some chibi and playful drawings. Scenes that were dramatic were dramatic, while scenes that were fun were fun. The openings and closings were fun to watch and entertaining. Great and pleasing art nonetheless.\\n\\n\r\nI loved the music. The opening and closing songs were amazing and I still attempt to sing along to them. But I don’t know Japanese and I cannot keep up with how fast they sing. They are playful and set the mood for a romantic comedy. The rest of the music was good, it fit well and some of it is still chiming in my head.\\n\\n\r\nAs for the characters, Onodera is one of my all time favorite characters. In fact, he is number one on my list, even ranking higher than Lelouch from Code Geass. It is hard not to be impress and disgusted with Onodera. I found myself cringing at the awkwardness Onodera had in his teenage years, reminding me of myself somewhat. I can respect his diligence as a hard worker, even though he hates the idea of editing shoujo manga. His history is decent, while his emotions are all genuine. His struggle with love was noteworthy and if there is anything I have learned from this series, it is that love is lawless, just as it is bitter-sweet. Takano’s character is fun as well. I find his history understandable and representing his character. Even though his emotional changes are slight, when you do see them you will notice them.\\n\\n\r\nBeyond those two, there are two other couples. After seeing it a second time, I found the whole love triangle between Yuu, Hatori, and Chiaki boring. It seemed that Chiaki was just a child being cared for by Hatori, not that something like that is impossible to believe. It just didn’t satisfy me compared to Onodera and Takano.\\n\\n\r\nThe other two are Kisa and Kou where the couple is formed based on pure looks. It is fair to say that most relationships occur based on physical attraction, but that can lead to issues as we see Kisa has those issues. I enjoyed these two and it likely because it wasn’t overdone as the love triangle was.\\n\\n\r\nThese two couples were side couples and while development is necessary, they are nothing more than an additional side story. Like a short story, it needs to be concise and to the point. Hatori and Chiaki I believed had this verbosity that was unneeded and likely why I became bored with them.\\n\\n\r\nOverall, I loved the series. If I watch it for a third time, and I likely will, I will probably skip the episodes only pertaining to the side couples. It is the main couple that makes this series great for me and worth a watch to anybody.\\n\\n\r\nStory: 10/10\\n\r\nAnimation: 9/10\\n\r\nSound: 9/10\\n\r\nCharacters: 9/10\\n\r\nEnjoyment: 9/10\\n\\n\r\nRounded Total: 9/10\\n",
            "date": "2013-12-23T16:59:00+00:00",
            "helpful_count": 18,
            "mal_id": 125275,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3421185.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/AlexanderRP",
                "username": "AlexanderRP"
            },
            "url": "https://myanimelist.net/reviews.php?id=125275"
        },
        {
            "content": "I've personally gotten very frustrated with shounen ai/yaoi, not because of all the man love, but because there's no point to it. It's all 'Hey you're cute! Let's now have sex for no apparent reason or character development, YAY!\" I also dislike that it's always marketed to little \"YAOI SUKI DESU\" 12 year old fan girls, so quite a lot of it has basically children getting jiggy with it. Even if the anime goes 'Oh yeah, I'm 25', there's noooo way that little boy could even possibly pass as so.\r\nIt's ridiculous.\r\nWhich brings me to Sekaiichi Hatsukoi. My oasis in the KAWAII DESU quicksand realm. Story-wise,it's nice to actually see it take place in a publishing house in the manga section. I personally haven't seen this before and found it very interesting. I also like that they split the series by following three different storylines that are all intertwined by where they work and it really connects you with all the characters instead of just the two main guys.\\n\\n\r\nI also like the fact that they're not always KAWAII BISHOUNEN hot and the fact that there are cycles where they look like they've been dragged under a bus and have bags under their eyes really cracks me up and I warm to the characters even more.\\n\\n\r\nNow, let's get to why most people will be coming across Sekaiichi Hatsukoi in the first place: The man shex. Don't worry! There's loads of little tidbits and oomph to sate your needs, but because of the character emotion and the build-up in storyarc, it rarely feels like a simple 'fanservice', where the creators have gone \"Oh this scene is running a bit flat. Let's add some sex!!\"\\n\\n\r\nIt's also very tastefully done, so those expecting a gangbang of wild pleasure, this really isn't the shounen ai for you. But for those of you who get the most enjoyment out of a growing story with buckets of angst, misunderstandings, tenderness, warmth, caring, hilarity and overall enjoyment, cue up episode one right now. RIGHT NOW, I SAY.",
            "date": "2011-10-14T04:30:00+00:00",
            "helpful_count": 13,
            "mal_id": 45515,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/560167.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/baskervwatson",
                "username": "baskervwatson"
            },
            "url": "https://myanimelist.net/reviews.php?id=45515"
        },
        {
            "content": "So having watched the first season and the second one, I am seriously loving this anime and as well as the manga. This deserves an overall of 10 to me, i'm not sure what it'll be to you but, i truly loved this anime. A lot of people have said that this is similar to Junjou Romantica and in the anime itself, there's lots of references to Junjou and personally i do think its kind of similar but there is a difference to it. Sekaiichi is more cuter to me as compared to Junjou which has more of 'those' scenes XD Personally, i enjoyed Sekaiichimore than Junjou\\n\\n\r\nNow moving on to the story, like Junjou, the main characters are these 3 guys with their love interests, to me it has a score of 9, the story line is there and its nice but i will link this to the characters which has a score of 7 to me. The character designs were really great and everything but the characters themselves were a little annoying in the sense that they were really stubborn (to be honest, it pissed me off a little, there was a lot of facepalm-ing here and there XD) but they were good, tsunderes i would say, are the best XD.\\n\\n\r\nthe art was definitely a grade higher than Junjou and overall i enjoyed this anime and the manga a hell lot. I CANT TAKE THE CUTENESS IT HAS IN IT!!! There are the novels as well, and i'd just say this to those who know of this MY OTP IS KIRISHIMA X YOKOZAWA~  Alright, as you can see, this randomness will tell you how much i seriously enjoyed and love this anime and so overall, it deserves a score of 10! ... personally :3 \\n\\n\r\ni would recommend this to those who like a little pure romance and enjoy that little squeeze in your heart every now and then X3 but don't watch it if you don't like BL or anything like that, i'd recommend Junjou Romantica to you if you like that little PIZAZZ(if you know what i mean) in your BL anime. And if you're, to say, 'scared' (i don't know how to explain this XD) just watch it and you won't regret, that's what i did and now i have become a fan girl. hahahaha~ :3 \\n\\n\r\n~Shinobu An~",
            "date": "2012-12-13T10:20:00+00:00",
            "helpful_count": 13,
            "mal_id": 80080,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1470407.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/AnPan-Desu",
                "username": "AnPan-Desu"
            },
            "url": "https://myanimelist.net/reviews.php?id=80080"
        },
        {
            "content": "First, I wasn't even a fan of yaoi before, but I tried Junjou Romantica and I started liking it. And then I read, and watched, Sekaiichi Hatsukoi and it totally blew me away. I've watched both seasons of Junjou Romantica once, and watched both seasons of Sekaiichi Hatsukoi FIVE times and I'm still enjoying it. Lets get to the point.\r\nSeeing the fluffy cute picture of a yaoi couple at the top left corner of this page, you might think 'oh, another fluffy nonsense yaoi where all they do is have sex''. YOU ARE WRONG. One of the reasons why I love this manga/anime so muchis because there is more than just the story of two guys falling in love. Unlike Junjou Romantica where one falls in love with another after his heart was broken, Sekaiichi's main couple actually has a history with each other since high school which gives the story more depth than Junjou Romantica. \\n\\n\r\nAlso, this story is not just 'we meet, we fall in love, happily ever after, the end'. It's 'we meet, we fall in love but we won't admit it, we face relationship troubles but we overcome it'. And personally, I can relate so much of these relationship situations in real life. \\n\\n\r\nDespite what some others might say, the other two couples other than the main is also pretty interesting for me and basically the guys are plainly 'hot' and they're like ideal boyfriends for girls. You can practically daydream about them and not get bored. \\n\\n\r\nI have more to say but I'm extremely bad with words so I might just end up repeating everything up there. But I hope you get the main point I'm trying to say - this manga/anime is not the same as the other BL out there, it has depth and story and not just sex sex sex. Really. c:",
            "date": "2012-07-22T09:17:00+00:00",
            "helpful_count": 9,
            "mal_id": 67331,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1373279.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/kiisa-",
                "username": "kiisa-"
            },
            "url": "https://myanimelist.net/reviews.php?id=67331"
        },
        {
            "content": "The story was perfect it made a lot more sense than Junjou and it had a lot more feeling to it. I loved the setting as well how it was set in a shojo manga department. The comedy in this series is so funny, how everyone is like dying at the department and the faces Onodera makes! It was a great story, long lost love, jealousy, romance. It was perfect. \r\nThe art is fair. It wasn't anything that stands out, other than the ridiculous faces Onodera makes XD, but it's not anything that would put you off watching it. \r\nThe sounds track was really goodin my opioid. Well to be honest I didn't like the first opening song it sounded too cliché. But I LOVED the ending song and the second season theme songs. Also the songs throughout the series were cute too, fitting the scenes perfectly.\\n\\n\r\nThe characters were almost perfect. I mean Onodera was the cutest being ever but I got so confused with some characters like Kisa and Chiaki... They all look so similar! The seme's were super hot though.. \\n\\n\r\nI enjoyed this anime so much, like so so much simply because I am a HUGE yaoi fan. I loved it so much that I basically died when I finished watching it. It's a shame it's only 24 episodes because I loved it so much I had to continue it reading the manga and there are so many cute stories in there that should have been continued!\\n\\n\r\nThe only disappointment is that Onodera never told Takano that he loved him.. but the ending was super cute, the ending was perfect.\\n\\n\r\nOver all: 9.8",
            "date": "2012-06-16T16:07:00+00:00",
            "helpful_count": 9,
            "mal_id": 63589,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1158433.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/EllenMelon",
                "username": "EllenMelon"
            },
            "url": "https://myanimelist.net/reviews.php?id=63589"
        },
        {
            "content": "If you are ready to indulge yourself in a colorful world with predictable actions, predictable lines, a cast full of bishounens, a lot of love confessions (as well as characters who desperatly try to deny their loveydovey feelings) and those superduper cutsey scenes then I would recommend this one. If, however, you are looking for awesome character building, groundbreaking ideas or something unique then you might want to spent your anime time on some other show.\r\nI am an adult, I know all the reasons why I should not like this anime as much as I do, but I just can't help it. This is myguilty pleasure. \\n\\n\r\nJust kick back, don't sweat it and enjoy.",
            "date": "2011-12-30T12:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 50513,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/444246.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 10,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/painappurut",
                "username": "painappurut"
            },
            "url": "https://myanimelist.net/reviews.php?id=50513"
        },
        {
            "content": "This is the first BL anime that I've ever seen. All in all, I'm glad as I came across this series, as I gladly enjoyed it. While this show was written for the female audience more than the male audience, as a bisexual male, I feel I found the perfect level of enjoyment from this show. However, it has comedic aspects and a strong romance that even straight guys themselves could easily get into. \r\n-Story- 9/10 \r\nAs far as I can tell, no problems here. Even though I'm new to BL anime, I'm not new to anime in general. And still, this show seemed tobe quite refreshing. Nothing about it seems boring, and I was able to binge watch the show in two days. At the same time, it's nothing out of the ordinary, that's why I'm not giving it a 10/10. However, anyone can easily be sucked into the story. \\n\\n\r\n-Art- 7/10\\n\\n\r\nFrom what I can tell, since BL anime isn't the most popular thing in the world, it usually lacks in artistic style, compared to other genres of anime. Of course, it's nothing bad to look at. It's just average. Compared to other BL though, I must say, it'd be a 10/10. \\n\\n\r\n-Sound- 9/10\\n\\n\r\nNo complaints here. The voice acting was on point, and the anime had enough music to force a decent amount of emotion upon yourself. It could have used some more songs, which would be my only complaint. Other than that, it's completely fine. \\n\\n\r\n-Character- 10/10\\n\\n\r\nProbably the most enjoyable thing of the anime, the characters! I absolutely loved all 3 couples and their personality. They're all different in their own means, however, it was fun to watch them deal with their daily lives, some of them knew that they were gay, while others weren't sure, and this is what made it fun to watch them react to their situations and how society views them. Trust me, you'll love most, if not all of the characters in this show. \\n\\n\r\n-Enjoyment- 10/10\\n\\n\r\nI absolutely loved every minute if this anime! It's fantastic! I never thought that BL could offer a romance as satisfying at this one. There's only one complaint I have, however, I'll address it at the end. The fact of the matter is, I'd recommend this anime to ANYONE who is even remotely interested in anime. This show would definitely be in the top 15 of all the anime I've ever seen. \\n\\n\r\n-Overall- 9/10\\n\\n\r\nBesides the sub-par art style and hiccup of the story, this anime is great. Oh, but there is one thing I would like to mention. After you finish watching this anime, WATCH  SEKAIICHI HATSUKOI SEASON 2! My one complaint with this anime is the ending was unsatisfying. You will definitely experience this, too.  I'd say the second season is even better, it grows on the relationships and patches up the rough spots. If you enjoyed season 1 at all, season 2 is a must see.",
            "date": "2015-07-20T19:31:00+00:00",
            "helpful_count": 8,
            "mal_id": 193957,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4759204.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/tyler_thomas48",
                "username": "tyler_thomas48"
            },
            "url": "https://myanimelist.net/reviews.php?id=193957"
        },
        {
            "content": "*This is a spoilerfree review*\r\nThis is my favourite anime of all time. \r\nHonestly it is the cutest, funniest and most addicting BL story I have ever had the pleasure of being addicted to. \r\nIf you are into BL, Shounen ai and the like, this really is a MUST watch.\r\nThe anime (and manga alike) are divided into stories about several couples. I know a lot of people who have watched this feel like they could do with only following the main story, and I can agree with this to a certain degree as their story is the most elaborate one and probably also the most infatuatingof them. BUT I honestly have to say that I enjoy them all, and the anime certainly wouldn't be the same without them.\\n\\n\r\nAs to why you should watch this particular anime I would start off by mentioning Takano-san, as he is one of my all time favourite characters and makes this story so much better than it already is. Forceful, manly and to the point that is what i love about him. \\n\r\nAs you watch and learn about the past and present hidden feelings in the relationship between him and the main protagonist Onodera, it makes your heart ache both in agony and in excitement for the two of them as they live their (not so separate) lives, being pulled closer and closer together.\\n\\n\r\nAs I mentioned before, in addition to this couple you get the pleasure of watching three other couples whose stories supplement the main one, bringing you different perspectives and  make out separate pieces of the full story.\\n\\n\r\nTo sum it all up, this is a romance story where you don't have to wait for the action to start, it hits you right out of the gate and holds you in front of your screen until you're suddenly done with the whole thing. \\n\r\nDefinitely a story worth watching, and one that will make you cry and laugh along with the characters as they fall in and out of love. \\n\r\n \"doki doki\"",
            "date": "2015-08-19T11:45:00+00:00",
            "helpful_count": 8,
            "mal_id": 196543,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4723499.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 8,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Varmkun",
                "username": "Varmkun"
            },
            "url": "https://myanimelist.net/reviews.php?id=196543"
        },
        {
            "content": "TLDR; Even if it has BL, it doesn't excuse the show from poor writing and poorly written characters.\r\nI like BL... which is something this show has. But I also like good writing... which is something this show DOESN'T have.\r\nStory 3/10\r\nAs I mentioned before, this show's writing is pretty bad. The story is basically the characters going through the everyday issues they have at work (needing to meet a deadline, being overworked, ...being sexually harassed by their boss...) and a bunch of romantic melodrama that basically boils down to bad communication. A lot of decisions the characters make are questionable and usually made me go \"WTFyou doin m8\". Oh, and apparently all the dudes that work at this shoujo department are gay. Makes sense.\\n\\n\r\nArt 7/10\\n\\n\r\nIt's good. Many attractive bishies and stuff. Woo. However, one of my gripes is that all the ukes basically look the same (sneering expression, big eyes, short). Same can be said about the semes.\\n\\n\r\nSound 6/10\\n\\n\r\nThe OP and ED of the first season are okay. Season 2 had a better OP and ED. The rest of the music is forgettable at best and dull at worst. However, I give this a 6 because it has some good voice acting (not to mention that it features many of my seiyuu biases).\\n\\n\r\nCharacter 2/10\\n\\n\r\nThe worst part of this entire anime. Also this part will contain mild spoilers so if you don't wanna know, move on. First off, the personalities of the ukes are basically carbon copies! HINT: They're tsunderes. On the other hand, the personalities of the semes are different but blander than cardboard. Yukina- The \"prince\". Basically a perfect dude with pretty much no flaws besides the fact that he's a lot younger than his lover (but that's not even a flaw so WTF). Hatori- A kind and caring workaholic who is very loyal. He was actually the most likeable out of the main six but apparently he rapes Yoshino in the manga so nvm I guess. Takano- the seme of the main couple and the dude I had the most issues with. First of all, he basically abuses his power as Onodera's boss and sexually harasses him both in and out of the office. Yes, we as the audience knows that Onodera does like him, but no means no. He tells Takano to stop MULTIPLE TIMES and yet Takano just pushes it further going like \"you know you want it\". BRUH, STOP. He also takes advantage of Onodera when he's drunk and then has the audacity to get pissed at Onodera when he doesn't remember what happened. Dude, you were completely sober and knew full well that he was drunk and yet you were like \"we'll bang okay\". Creep. He only gets slightly redeemed near the end when we FINALLY see his backstory.\\n\\n\r\nEnjoyment 6/10\\n\\n\r\nEven though I had issues with the characters and story, I will admit that I enjoyed watching this at times. Why? Cuz I like BL, and there are barely any shows that have it.\\n\\n\r\nOverall 4/10\\n\\n\r\nAt the end of the day, this show is only about fan service for BL lovers. There is no depth to it at all and does not portray a healthy relationship in anyway. Don't be fooled by this show's high ratings. We fujoshis tend to cling onto anything that has BL and hype it up to be better than what it actually is. If you can turn your brain off, then you'll probably enjoy this. Otherwise, stay away as this show will make you go \"wtf are you doing m8 he said stop OH GOD WHY ARE YOU DOING THIS YOU'RE HIS BOSS I'M PRETTY SURE SOMEONE COULD FILE A LAWSUIT AGAINST YOU FOR DOING THAT\". Or something.",
            "date": "2017-01-19T06:00:00+00:00",
            "helpful_count": 4,
            "mal_id": 238628,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3780691.jpg",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/krzywasabi",
                "username": "krzywasabi"
            },
            "url": "https://myanimelist.net/reviews.php?id=238628"
        },
        {
            "content": "So, I'm a little conflicted on how to review this anime properly because I did enjoy it to the fullest extent. I'm gonna try to give criticisms here so I'm not so biased, but it really is a fun anime to watch regardless of its imperfections. \r\nI'm not the biggest fan of the art style. The character designs aren't exactly the nicest to look at all the time because of the facial proportions, but I guess that's down to taste. Additionally, the characters are all very similar in appearance, so I actually had a difficult differentiating between them initially. As far as scenery and stuffgoes, it isn't really all that spectacular. So, I guess you could say the art is average. The music is also average, though the voice acting is pretty awesome. It sets the tone for comedic scenes really well. \\n\\n\r\nI like the characters quite a lot, stereotypical they may be. Stereotypical may seem bad, but they became stereotypes for a reason, right? I didn't mind it, at least. The story was mostly good, especially for a Shounen Ai. By that, I mean that it actually HAD a story rather than it just being about the risque stuff. The story also extends past the relationships in the anime, so that's nice. You get to see a bit of character growth out of the main character besides the development he has through his love life. \\n\\n\r\nI don't necessarily think the extra two couples were necessary to add in as their stories, by default, didn't make as much sense as the main one because their side stories, so they didn't get the proper setup. Unfortunately, that meant some of the things, like the \"I love yous,\" felt cheap and unrealistic, which runs a little closer to how normal Shounen Ai anime are. I'm also not the biggest fan of the whole \"oh, but you're a GUY\" mindset in these types of anime because it ruins the point of the romance, but that was a small detail to look over in this anime. \\n\\n\r\nAll in all, if you're looking for a Shounen Ai with a little something more, give this a go. It does have some substance to back everything else up, and while it's not perfect, it's probably one of the better Shounen Ai anime you're gonna get.",
            "date": "2018-10-31T13:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 293076,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6871769.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/BabyGirl06301",
                "username": "BabyGirl06301"
            },
            "url": "https://myanimelist.net/reviews.php?id=293076"
        },
        {
            "content": "It's been a while since I finished the anime, meaning all Junjou and Sekaiichi seasons. \r\nSo I'm gonna write a review of Sekaiichi as I feel like giving a shoutout to a specific thing from the anime that I'll be mentioning in a bit.\r\nLet me quickly add to this that it was amazing to watch Junjou and Sekaiichi crossover moments, it was awesome and a great idea.\r\nAnyway let's get into it!\r\nThe story:\r\nThe story itself is great and super cute in so many ways, and there's a lot of drama and like JJR, the characters in this anime always tend to overthink everything that happens, whichsometimes gets on my nerves but yeah.\\n\r\nI like how this is all based on real artistic manga editing, speaking of the characters daily jobs in the story, or so I think.\\n\\n\r\nThe art is super great and the face expressions the characters are able to show in each scene is just on the spot.\\n\\n\r\nThe characters:\\n\r\nThey are each unique but it can be difficult to tell them apart because..\\n\r\nYeah they look alike. \\n\r\nBut it was a good idea to add more than just one couple to the series like JJR did.\\n\r\nIt appears the youngest looking main characters always have their funny expressions way more often than the other partner of theirs, and it makes me laugh all the time, of all the anime series I've watched, these JJR and SH made me laugh the most.\\n\\n\r\nAs for what I was gonna mention, is how a lot of episodes ends up with the watchers (us) gets a view of the skies, while this one character screams his lungs out, whereas an echo is heard afterwards, that always make me laugh it's so funny that this kind of scene repeats itself so many times in Sekaiichi.\\n\r\nGiving an example on what the character could be screaming as the episode is about to end:\\n\r\n\"This isn't love...THIS ISN'T LOVE..... THIS ISN'T LOOOOOOOOOOVEEEEEEEEEEEEEEE!!!\" \\n\r\nAmazing, very good idea!\\n\\n\r\nAnyway, overall, I really like Sekaiichi and Junjou and they're very alike of course.\\n\r\nIf you have yet to watch Junjou, I recommend watching that first.\\n\r\nI give this anime a 9.\\n\\n",
            "date": "2018-09-11T11:04:00+00:00",
            "helpful_count": 2,
            "mal_id": 288759,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6738220.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Craneface",
                "username": "Craneface"
            },
            "url": "https://myanimelist.net/reviews.php?id=288759"
        },
        {
            "content": "It's really too bad that only popular BL manga gets an anime, not actually quality BL manga. I am clearly getting too darn old for this.\r\nBut at least it isn't as bad as BL anime used to be, so that's progress.  Nobody is actually getting outright raped!  We just have to put up with the never ending dubcon and the obnoxious stereotypes.  The stories are contrived, but at least hang together by a thread, so that's something else to be grateful for.  I had trouble with the pacing -- we get 4 episodes with couple A, then 2 with couple B,back to couple A, then 2 episodes with couple C; I felt like story coitus interruptus every few episodes.  I think this would have worked better as either distinct parts A, B, and C, or much more interwoven.  The latter would have required a lot of authorial skill.  \\n\\n\r\nStory:  Nakamura Shungiku is actually writing about something she knows here, which is the manga publishing business, and that's a pleasant surprise; it adds verisimilitude to the otherwise typical BL story style which isn't realistic or believable.  Sure, high school lovers fall out over stupid misunderstandings, and heck, maybe they indeed meet accidentally again 10 years later in the same workplace, but please -- do they also have to end up living right next to each other?  In Tokyo, of all places?  You'd win the lottery before that would happen.  Onodera doesn't even recognize the love of his life, which I also find not very believable, especially since the art makes them look pretty much the same, only a little younger.  Story B features the densest childhood friend ever (childhood friendship leading to love being a trope I admittedly love, but not in this incarnation).  Story C is more believable (Kisa falls in love with any pretty face after all, and Yukina certainly is pretty), but I can't say I liked it much because that's so damn superficial.  In all three stories, misunderstandings drive the plot.  I hate that, it is the laziest writing.  There is no good ending here; they must have known they were getting a second season, because the first one just petered out.\\n\\n\r\nArt: Nakamura has gotten better over the years, but I don't think I'll ever like her art much.  Her guys all look too much alike since she has basically only two types, uke and seme, and they fit all the standard stereotypes:  Seme are taller, dominant, forceful, usually older, with stoic faces, while uke are much smaller, submissive, usually younger, with bigger eyes, rounder faces, wishy-washy but tsundere to cover up their insecurities which are legion, who blush constantly, and cry at the drop of a hat.  The backgrounds are fairly nice.  The animation is standard for BL; gotta keep the budget down.\\n\\n\r\nSound:  I like the Japanese-flavoured BGM, and the OP and ED are upbeat pop which is always fun to bop along to even if it is forgettable.  Voice talent is a nice collection of good seiyuu who do BL, and I think they do a decent if not inspired job -- well, the material isn't inspiring.\\n\\n\r\nCharacter:  Oy. I tend to prefer seme to uke, and that's no different here, especially since the uke are such whiny stereotypes. The disadvantage is that we're never in the head of a seme, so we get them only second-hand, while for the uke we get their entire inner monologue, which tends to make me want to kill them.  I wonder if the seme would only grunt if I could hear them think, they have such caveman tactics.  I kind of like Onodera because he is actually hard working, wants to make it on his own instead of resting on the family laurels, and he has somewhat of a legitimate reason for ditching Saga/Takano in high school.  I always enjoy the times when those two work together, because that's when they both shine, and when one can see a decent relationship.  It's when it comes to interpersonal relationship skills that they both suck.  Yakazawa makes an interesting spoiler, though we know of course that his obvious love for Takano isn't going anywhere (he's a seme, after all, and that would be seriously transgressive).\\n\\n\r\nHatori is too bloody stoic, and Yoshino is an oblivious moron whom I despise because he is also selfish and a lousy friend, and since Hatori has to know how dense he is, it's his own damn fault he doesn't get anywhere with him.  I don't care about this pairing at all, I would hope Hatori finds somebody better.  Heck, take Yanase, at least he has more than two brain cells to rub together.\\n\\n\r\nI don't really care for the third pairing either, though Kisa doesn't bother me quite as much as Yoshino because he isn't as dense, but his resigned tone is depressing.  Yukino, on the other hand is a great guy, incredibly mature for his age (more so than Kisa), and hey, here we have Nakamura getting as transgressive as she ever gets -- he is a younger seme!  These two have the least dubcon, but I just can't like Kisa enough.  His story also seems inconsistent, what with how he acquired a stalker.\\n\\n\r\nEnjoyment:  I enjoyed this most for the workplace and the information about publishing; Marukawa Shoten has got to be the gayest publisher ever.  ;)  Takano x Onodera was somewhat interesting, but I got eventually tired of them and the neverending protestations of Onodera, and Takano's rough handling of him. I am not sure why any straight man would be interested in this anime; maybe there is enough humour in the misunderstandings to get some laughs.  There isn't a whole lot of fan service here (watch \"Free\" if you want near-nudity nearly all the time), and nothing graphically explicit.",
            "date": "2016-09-20T10:36:00+00:00",
            "helpful_count": 4,
            "mal_id": 229622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/127437.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pleochroic",
                "username": "pleochroic"
            },
            "url": "https://myanimelist.net/reviews.php?id=229622"
        },
        {
            "content": "A very generic BL story, which I would describe as a waste of time. \r\nUnlike other BL anime this anime goes no further than a kiss, let me remind you all character are 18+ but nothing more than that developed.\r\nAs usual the younger boy in 2 of the 3 cases was basically the same character, both being unaware of their own feelings and looking and sounding exactly the same.\r\nWould rather this focused on 1 couple instead of 3, as this got very confusing with the character all looking alike.\r\nHow much more generic could you get than a BL story being based around literature/manga\r\nStudio Deen seemsto copy and paste all their BL stories, so if you've seen one you've seen them all.\\n\\n\r\nWaste of time, DONT WATCH! Have no idea how this anime is rated so high",
            "date": "2017-02-01T13:25:00+00:00",
            "helpful_count": 3,
            "mal_id": 239669,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5585425.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Ren07",
                "username": "Ren07"
            },
            "url": "https://myanimelist.net/reviews.php?id=239669"
        }
    ],
    [
        {
            "content": "I don't have much experience with shounen-ai, but it's a genre I'm interested in and enjoy. I've watched Nakamura Shungiku's other series, Junjou Romantica, and enjoyed it. I happened upon Sekaiichi Hatsukoi while checking out Junjou Romantica's anime page on MAL, and was pretty excited to find a new story in the same \"world.\"\r\nSTORY → 9/10\r\nI enjoyed the stories in Sekaiichi Hatsukoi because a lot of them were really entertaining to watch, even if I sometimes wanted to shake the characters because they were frustrating. The anime opens with Onodera, the son of a literary publishing house CEO. Frustrated that his coworkers think he's onlya hotshot editor because of his name, he quits and goes to work for Marukawa Publishing - and ends up in their manga department, where his boss happens to be his long lost love from ten years prior, Takano. \\n\\n\r\nI enjoyed Onodera's character. I felt that his internal struggle with Takano was more believable than if he'd fallen at Takano's feet and proclaimed his love for him. While Takano bothered me sometimes (incapable of leaving Onodera alone, sometimes pushing himself on him even when Onodera said no), this also comes with the territory a bit (there are similar dynamics in Junjou Romantica).\\n\\n\r\nLater on in the series we're introduced to another couple: Hatori (\"Tori\") and Yoshino, who are childhood friends turned editor and mangaka. Hatori is connected to Onodera and Takano because he is another editor alongside Onodera. There's also Kisa (an editor alongside Onodera and Hatori) and Yukina, who were my favorite (I'm a sucker for age differences okay). There is a fourth couple, but there is only one episode devoted to them and they're not seen again.\\n\\n\r\nOverall, I just felt the story surpassed Junjou Romantica because these characters were more connected, so you got to see their relationships happening at the same time. I thought that was really sweet. \\n\\n\r\nAlso: no one in this anime is straight. Except the girls, ha.\\n\\n\r\nART → 8/10\\n\r\nMy only real issue with the art was that the characters all looked very similar except for hair and eye color. The only noticeably different looking character was Yukina, and that was because he had bright orange hair instead of a shade of black/brown. Otherwise, the art is lovely. I just wish there was more difference in the appearance of each character.\\n\\n\r\nSOUND → 6/10\\n\r\nThe voices of the characters are pretty similar, too. If all of the characters were to be put in a room and say the same lines without showing their faces I'm not so sure it would be easy to pick them out. The main song was fun but not memorable, and I can say the same for the end song.\\n\\n\r\nCHARACTER → 9/10\\n\r\nI really, really liked the characters. I mentioned this above in STORY, but I really felt like they were easy to like. Of them all, Kisa and Yukina had my favorite relationship because, though they had their moment, they ultimately communicated their feelings in the end without going through TONS of trouble to get there. Despite Yukina being 9 years younger than Kisa and seemingly immature, he wants Kisa to confront him head-on instead of hiding. So I just felt their relationship was a lot more mature, even though it had its moments.\\n\\n\r\nHatori and Yoshino were my second favorite because their relationship was just really cute. There's a bit of a love triangle in their episodes that frustrated me sometimes, but in the end it works out (because, hey, it always does in Nakamura's stories).\\n\\n\r\nWhile Onodera and Takano weren't horrible, there were problems with their relationship that I can't overlook. Number one being Takano constantly forcing himself on Onodera, even though Onodera had said NO more than once. Yes, as an audience member we know that Onodera really does love Takano and that's why he doesn't immediately fight him, but it was still...eh. I could've done without it. The other two couples didn't have to go through that in order for their relationships to work out, so it was just a bit irritating sometimes. Plus, it took TWO SEASONS for Onodera and Takano to work out their problems. I would've rather it taken a season, and then the last season was them navigating their relationship. #butthatsjustme\\n\\n\r\nENJOYMENT → 10/10\\n\r\nI watched Sekaiichi Hatsukoi in like 3 days. I couldn't STOP watching it, honestly. I binged all 24 episodes in that time period, and I was watching 5-6 episodes a night! So while I had some issues here and there, at the end of it all I can definitely say my enjoyment was a 10 because I really couldn't stop watching, and I was sad when it ended.\\n\\n\r\nOVERALL → 9/10\\n\r\nSekaiichi Hatsukoi is not without its faults, much like Junjou Romantica isn't without its own. But when it comes down to it, I really enjoyed this anime, its characters, and its relationships. I binged all 24 episodes in a matter of days and would probably rewatch it in the future. Nakamura writes interesting stories with a lot of drama and angst, so if that isn't your thing I wouldn't recommend it, but I really enjoyed this series and would recommend it to someone looking for more shounen-ai anime!",
            "date": "2016-07-21T21:25:00+00:00",
            "helpful_count": 4,
            "mal_id": 224622,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1103847.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 6,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/kumorinohi",
                "username": "kumorinohi"
            },
            "url": "https://myanimelist.net/reviews.php?id=224622"
        },
        {
            "content": "I want to be honest with this review, coming from a yaoi fan who appreciates character and story line as much as boy love and the occasional sex scene. \r\nThis anime is good, but its just not up to par with what I was expecting from it. It was often amusing and very cute, but toward the end grows tiresome and feels drawn out. \r\nThe story is interesting as it offers a unique perspective on the process of creating, editing and selling manga. I for one felt humbled and enlightened while watching each character work tirelessly to create and perfect entertainment for their readers. Thesetting itself is also a fresh twist on the usual genre stereotype of young lovers in high school. However, the element of adolescent love plays a role in the plot by creating an incredibly bizarre twist in the love dynamic. The two characters in the main or first couple dated in high school, and their meeting again ten years later in the workplace creates a quirky series of events which is refreshing if not stupidly unrealistic. Everything in the story revolves around strange and hardly believable circumstance. It works in the sense that they're creating it for humor, but I felt as though it was laid on too thick and eventually became tiresome.\\n\r\n As is the convention with this particular artist, we follow three couples who all know each other in some vague way, each facing the trials and tribulations that come with the business of selling manga and the painstakingly aggravating way in which they attend to their relationships. Overall, story is not bad especially considering the genre and intended audience.\\n\\n\r\nThe art is nothing too exceptional, however it is clean and clear. It could be called pretty even, due to the smooth lines and feminine aspects attributed to the character designs.There is a fair amount of attention to detail and the colors are well done, vibrant and captivating. The only flaw worth noting is that, as fans of this artists previous work \"JunJou Romantica\" might notice, there are only three types of character designs; Male seme, male uke, and female. One could not distinguish between two male semes, for example, if it weren't for vaguely different characteristics like hair and eye color. It is a strong flaw in the work which gives the impression that the artist is either far too stylized or artistically incapable of variation.\\n\\n\r\nSound was perfectly fine, however that's not what I really watch the show for. In terms of the beginning and ending themes, they were catchy at first but I found myself skipping them as the weeks went on as I can only take the catchy pop songs for a certain length of time. Voice acting was very good as far as I was concerned, expressions in the voice were dealt with very well and I appreciated the variation in voice acting as it helps me tell apart the characters easier (seeing as they all look like clones of each other.)\\n\\n\r\nCharacter is where the show took a bit of a nose dive, I'm afraid. There are six main characters and in short, they all suck at relationships. The lot of them, every single one. At first I thought that Onodera's temper and shyness was amusing and even cute, however after 24 episodes of his character reaching new and intense relationship levels with Tanakno (The brooding love interest), his personality does not change with him. Try as he might, his character struggles immensely to grow or evolve in response to his circumstances, and it was terribly aggravating to watch at times. Realistically, a character like Takano could be labeled as a sexual deviant for doing things intended audiences find romantic. I found myself wishing that he would relax and let friendship bloom instead of forcing love. \\n\r\nMy main problem with the characters is that while some got a lot of screen time, others hardly got any and appeared shallow and boring as a result. \\n\r\nOne other point I'd like to touch on is I strongly disliked how the anime uses the characters incapability to communicate with one another to create drama and suspense. Every issue they face could be resolved easily by talking about their feelings. I believe conflict could have been stirred up in better and more creative ways then ignoring your boyfriends confused text messages because of something you THINK he did.\\n\r\nEnding on a light note, the show has good moments in regard to characters dealing with repressed memories and fear of accepting homosexuality. However subtle, I thought that they were important points that the anime touched on in a gentle way, and I could see how viewers could appreciate they were there.\\n\\n\r\nI will be honest, I enjoyed the show very much up until the last few episodes where they started to feel drawn out and exhausting. I liked the show because it was light, cute and interesting, however flawed it might be. This show is basically brain candy, and though you can't expect to find a large degree of depth, it is humorous and entertaining and probably worth your time if BL is your thing.\\n\r\n I will warn hardcore yaoi fans that there is not much sex to be had in this series, however fans of shounen-ai will love it regardless of its sexual content. I would also recommend fans of shojo who are curious to start getting into BL to start with watching/reading the series that Sekai ichi is a spin off from, \"JunJou Romantica\" and then graduate to watching this afterward if it tickles your fancy. \\n\r\nOverall it is a good show, worthy of a 7 or a 7.5. If you can deal with the flaws, as I assume many BL fangirls/boys can, then away with you! Go and give it a try.",
            "date": "2012-01-02T22:49:00+00:00",
            "helpful_count": 4,
            "mal_id": 50799,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/795819.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/tendrillar",
                "username": "tendrillar"
            },
            "url": "https://myanimelist.net/reviews.php?id=50799"
        },
        {
            "content": "Surprisingly, I really enjoyed this anime. While the art was not to my liking (character-wise, at least. The colours were rather beautifully done and backgrounds were very calming, although character designs did not vary much) I could easily look around that and look at character design personality-wise.\r\nA lot of people don't see the difference between characters, and in a way they were correct. All three couples focused on a very clearly-drawn seme-uke format. Who bottomed in the relationship was as easy to tell as taking a quick glance at the characters. The ukes were small, with more feminine features, while semes were quite tall, withstrong jaws and a more masculine feel to them. But, if you look beyond that, their personalities are quite different. My review will mainly be going over character personalities.\\n\\n\r\nKisa/Yukina\\n\r\nKisa is a mature, spiteful man who hides behind an optimistic outside to appeal to men. He is the only uke in the series who has admitted (not just to loving his seme) to being gay. Kisa hides behind a fake mask, usually not even giving his hookups his correct age, in exchange for sex, and on occasion a short relationship. Another quirk he has is judging a man only for his face, and not his actions. Later, Kisa gets lucky and falls in love with an attractive salesman who sells his manga, and gives him the top sales in all of Japan. He's rather stalker-ish when it comes to the salesman, named Yukina, often spending endless hours in the manga store, feigning interest in the shoujo section to watch him. Later, he is introduced, they go out, and he learns that Yukina is a major fan of shoujo manga, specifically his editing, even claiming that although the plots are completely different, they all have the same \"feel\" to them. And their relationship (although it seems skin-deep because of Kisa's appearance fetish, the age gap--Kisa being thirty and Yukina twenty-one--and Yukina's love for his work, it is actually quite beautiful in the end) goes on from there.\\n\\n\r\nOnodera/Takano\\n\r\nOnodera is the main character, and used to be an innocent, ignorant teenager who confessed his love to Saga-senpai, and started a superficial relationship. They break up after timid Onodera asks Saga if he loves him, and he laughs. They don't see each other for ten years, because Onodera got butt-hurt and ran off without even talking about it. Turns out he didn't even tell Saga about it, but we love him anyways because he was just a stupid kid.\\n\r\nNow, he is more mature, similar to Kisa, but he doesn't hide it. He does not trust easily, and has gone into editing literature. Unfortunately, he works for his dad, and his colleagues believed he was so successful because his father owned the company. So, he transfers companies, but there was a mix-up. Instead of editing literature, he's working in shoujo manga. His new boss, Takano, is a crazy mo-fo, and there's something real funky about the guys who work alongside him. Turns out, his new boss is Saga, and is still in love with him. He confesses this, but Onodera isn't the same man. And so the main plot begins. \\n\r\nBonus quirks of Onodera's include being a bad drunk, and hauling major baggage in the form of a (SPOILER!) fiancee. \\n\\n\r\nChiaki/Hatori/Yuu (not a threesome, but a love triangle)\\n\r\nChiaki is the most oblivious kid you'll ever meet, and is a shoujo manga author, with Hatori (or Tori) as his editor. Working as his main assistant is his best friend Yuu. Turns out, his two best friends hate each other, and have been battling behind his back (note: not so discreetly, but Chiaki's adorable so don't hold it against him he didn't notice) for his affections. Soon, he's caught up in a bunch of misinterpretation hoo-hah in which he believes they're in love with each other, while both are in love with him and hope the other rots in Hell. I'm not going to tell you who he ends up with, but I'll tell you in my opinion Yuu is a much more interesting character than the emotionless blob that is Tori.\\n\\n\r\nPersonally, Chiaki is my favourite character, with Onodera in a close second and Kisa in third. I believed that the ukes were more developed, and varied more not only in looks, colouring and body shape more different than the semes, all of which had brown hair and were of near-equal height, but in personality. \\n\\n\r\nThis anime, while a lot of people are quite controversial, in general was actually very good, and had me watching to the end. It did not affect me as deeply as other animes, but it definitely left me with a smile on my face. \\n\\n\r\nBonus: While the ending was not solid, it didn't leave me feeling empty, and I could very easily interpret the ending however you want, and that was, for me, a good thing. \\n\\n\r\nIf you like shounen-ai, I recommend this anime. It is a very good starter for the genre.",
            "date": "2012-08-18T22:22:00+00:00",
            "helpful_count": 4,
            "mal_id": 70251,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 3,
                    "character": 6,
                    "enjoyment": 9,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/raewise",
                "username": "raewise"
            },
            "url": "https://myanimelist.net/reviews.php?id=70251"
        },
        {
            "content": "I love Sekaiichi Hatsukoi so much!\r\nAre you a fujoshi (yaoi fans)? If yes, you must've know this anime. Well, you can't call yourself a fujoshi if you don't know this anime.\r\nSekaiichi Hatsukoi is an anime TV series authorized by Nakamura Shungiku-sensei, the same author for the manga series Sekaiichi Hatsukoi Onodera Ritsu no baai, Takano Masamune no baai, Hatori Yoshiyuki no baai, Yoshino Chiaki no baai, Kisa Shouta no baai, Yukina Kou no baai, and Yokozawa Takafumi no baai. The status of the manga is still ongoing.\r\nI give you a warn. If you are a first time user of yaoi (read or watch), I won'tsuggest you to read the manga first. I found it harsh myself the first time I read it. Just try to watch the anime first, trust me, you won't feel gross at all. Contrary, you will find yourself absorbed into its story, beautiful graphic and good-looking characters, fabulous voice actor, and nice soundtracks.\\n\\n\r\nSekaiichi Hatsukoi literary means the world's greatest first love. Like its title, the story is about the first love of the main roles'. There are 3 pairs in this anime, Takano Masamune x Onodera Ritsu, Hatori Yoshiyuki x Yoshino Chiaki, Yukina Kou x Kisa Shouta. All of the stories is super romantic and full of comedy! You even can't hold your laugh. The story is light and happens a lot in our daily life, so the anime is easy to understand. It also discover the manga editor's job, so that we can know how the comics in front of us is made of.  This anime will never make you bored no matter how many times you watch it. I even watch it over and over again, and always laughing out loud.\\n\\n\r\nThe graphic of this anime is enjoyable. The colors are so matching, the movement of the characters is so natural with no stiff at all. The important thing, all of the characters are super handsome!\\n\\n\r\nThe characters also supported by the talented voice actors. They succeed in making the characters more alive. They are amazing! You will find yourself liking the way they talked and how they really suited their own roles.\\n\\n\r\nLast, the thing that makes me fall in love deeply with this anime is the soundtracks. The soundtracks is really nice to listen to and the mv in the anime is ashamed to be missed to. I never skip the opening and ending songs when watching this anime.\\n\\n\r\nOverall, I'm really addicted to this anime. I hope you feel the same.\\n\\n\r\nThanks for reading. Jaa~",
            "date": "2014-11-25T03:11:00+00:00",
            "helpful_count": 4,
            "mal_id": 169865,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4264959.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/LisAnimeLover",
                "username": "LisAnimeLover"
            },
            "url": "https://myanimelist.net/reviews.php?id=169865"
        },
        {
            "content": "So good I finished it all in two days? Oh yes!\r\nAs BL anime go Sekaiichi Hatsukoi has to be one of my favourites without a doubt. The story, although sometimes a little stereotypical of this genre, is extremely enjoyable; hysterical, heart-breaking. It didn't seem tedious which is always a plus. \r\nAll the main characters are actually relatively likeable  however this show, like many others, has that massive borderline stereotypical distinction between the seme and uke characters. It can get a little annoying, primarily with the difference in voice pitch and stature - a little over the top but not too big of an issue.\\n\\n\r\nI would absolutely recommend this to anyone that enjoys the fluffy BL nonsense that this undoubtedly is and is looking for a great story. Obviously if you've seen Junjou Romantica you definitely need to watch this (even just for the sly references to it!), especially because, in my opinion, SH didn't include any of the things I disliked about Junjou.",
            "date": "2011-12-22T19:53:00+00:00",
            "helpful_count": 4,
            "mal_id": 49857,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/190959.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AllTearsMustFall",
                "username": "AllTearsMustFall"
            },
            "url": "https://myanimelist.net/reviews.php?id=49857"
        },
        {
            "content": "*this is my first review, so it's probably not going to be the most coherent thing, but I'll give it a go!\r\nFor what it's worth, I enjoyed this anime. The only things I knew about it before I began to watch it was that a) gayness, and b) manga. Trust me when I say that it delivered strongly on both of those points!\r\nTo start off with, the things that worked: (for me)\r\n- I really enjoyed the environment. It reminds me of GSNK, but on a much larger scale, where there's various processes in manga production, and certain people specialise in certain areas. I dunno, Ijust found it interesting, and that it created some good moments for the characters.\\n\\n\r\n- It's funny. It's light. It's fluffy. PLUS it's BL, and when all of that combines together... well, I'm just absolute trash for anything like that. \\n\\n\r\n- My final point is that I wasn't expecting the cast of characters. I thought this was going to revolve around one couple's story, both their past and their current situation. This wasn't the case, and the fact that you follow multiple romantic story-lines works really well. It kept things interesting, and it was cool to see how everyone and everything linked together. \\n\\n\r\n...and then, what I didn't like, or at least could've been better:\\n\\n\r\n- Some of these characters creep me out. There, I said it. Despite this being BL and everything, I still got the distinct vibe of gender-roles. This led to half of the characters being very masculine and intimidating, and the other half seeming shy and more flamboyant. \\n\\n\r\nNow, that's not what I have a problem with, for the most part. I mean, it's an over-used character trope, but fine. My issue is when some of the more stereotypically-masculine characters force themselves on their respective love interests. They may be protesting against their advancement, trying to push them off, or in one case literally slapping them, yet they still try to force them into a kiss or something, as if they think \"I know what's best for this person, despite what they're saying\". It made me uncomfortable, and I was not a fan of this.\\n\\n\r\n- Everything is animated and drawn to a decent and consistent standard. However, there was just never that moment where I though \"Holy crap, this is stunning\". It's just consistently okay, which is fine, but still. It felt kind of lacking, to me.\\n\\n\r\n- Also, the sound and music is just not memorable. It's very generic, and you can kind of predict what the tone of the music's about to be before it actually starts up in certain scenes.\\n\\n\r\nAnyway. Think that's everything I've got to say. Overall, it was a decent watch, but not a memorable one. I'll probably watch S2 at some point, but I'm in no hurry.",
            "date": "2016-06-08T00:16:00+00:00",
            "helpful_count": 3,
            "mal_id": 220238,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2742195.jpg",
                "scores": {
                    "animation": 5,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Totoros-Treasure",
                "username": "Totoros-Treasure"
            },
            "url": "https://myanimelist.net/reviews.php?id=220238"
        },
        {
            "content": "It has the same Author, Producer, and Writer of Junjou Romantica. It is connected to Junjou Romantica because of the same venue of Marukawa Shoten\r\nThe anime is kinda cliche, if you read the manga.\r\nSome of the characters already appeared in Junjou Romantica.\r\nREVIEW:\r\nBroken-hearted by his First love at 15, Onodera Ritsu (now 25), leaves his father's company due to his co-worker's jealousy and now works at Marukawa Shoten and is now ready to become independent. Ritsu meets his new boss, Takano Masamune, later on he discovers that Takano turns out to be Saga Masamune (his high school first love).\r\nIt's not your typical \"First love never dies\"theme series, you can actually learn lots of lesson from this slice-of-life anime.\\n\\n\r\nThe art style is the same as Junjou Romantica. Ritsu is a combination of Shinobu and Misaki. Frankly speaking, This anime is hotter than Junjou Romantica.\\n\\n\r\nI Love the humor of this series and also the plot of the story, it's easy to understand.\\n\\n\\n",
            "date": "2012-04-03T04:54:00+00:00",
            "helpful_count": 3,
            "mal_id": 57783,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1228745.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/dawnkresher",
                "username": "dawnkresher"
            },
            "url": "https://myanimelist.net/reviews.php?id=57783"
        },
        {
            "content": "STRAIGHT ACROSS 10'S!!\r\nYes, this anime IS awesome and I highly recommend it!\r\nEven if you're a straight male or a girl that doesn't like yaoi- this is simply shonen-ai; for those of you looking for sexierness...the manga will definitely quench your thirst...PLUS it's ongoing.\r\nThe backstory is touching and you actually feel for the characters- the ups and downs of love. Every kiss scene in movies is PERFECT, like all of a sudden everyone's good at kissing? Was there a worldwide class I missed? But in SIH, Ritsu was not so good at kissing in the beginning. He always pressed his lips tightly together.\r\nOkay- if that's notsomething you can relate to...then I DONT KNOW WHAT IS!\\n\\n\r\nIt's so much more than sexy sex or lovey love or kissy kisses (while all those components are nice) it's also about falling in love- real love.\\n\\n\r\nIt's about growing up and trying to find your niche in life. And then once you're settled you find the man of your dreams, this is a story about falling in love...for amateurs. Since it gets awkward, like every relationship does....especially if your boss is poundin' you in the ass...\\n\\n\r\nOutstanding job by Shungiku Nakamura. His talents are amazing- not only did he create Junjou Romantica (WHICH IS AMAZING) but he also made this masterpiece!!\\n\\n\r\nOnly bad thing ever about this: THE LEDGENDARY YAOI HANDS\\n\r\n...ya, they exist.",
            "date": "2013-03-29T21:29:00+00:00",
            "helpful_count": 3,
            "mal_id": 91541,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2306671.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/SoraKiryu",
                "username": "SoraKiryu"
            },
            "url": "https://myanimelist.net/reviews.php?id=91541"
        },
        {
            "content": "For once, I'd like a healthy relationship shown in a BL anime. You know where you respect the other person's no. Where you give each space to grow, allow your significant other to have friends without being overly jealous and controlling \r\nguess thats too much to ask :/\r\n(Discard: okay so it keeps asking me to submit a longer review but honestly, for me the first line was enough as a rant but yeah here we are. okay lemme talk about what I liked about it. hmm lets see. I thought the love story between the salesperson yukina kou and editor shouta kisa was really adorable.it was cute that they were both in love with each other. wish they had more screen time :3",
            "date": "2018-08-30T14:07:00+00:00",
            "helpful_count": 1,
            "mal_id": 287785,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4790893.jpg",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/agreed",
                "username": "agreed"
            },
            "url": "https://myanimelist.net/reviews.php?id=287785"
        },
        {
            "content": "After finishing the first two seasons of Junjou Romantica and feeling kind of 'meh', I decided it was about time to check Sekaiichi Hatsukoi. I had heard many good things about it, and believed I should give it a shot. \r\nI was extremely dissappointed.\r\nThe story itself actually does have some backbone, and the setting in general is interesting - the editing industry isn't often spoken of in anime or manga, and I think it captured the atmosphere really well. \r\nBut then...there's the art. To be fair, Nakamura-sensei has really improved over the years, and the anime looks clean. But in some places, it just seemedvery unappealing and awkward. That's only because I'm very picky with the art, though - I may be a little harsh, here.\\n\\n\r\nNow, if there is something I cannot forgive, however, it's the characters. Where do I even begin? All the ukes look pretty much the same [there were points where I couldn't figure out who was who], and act the same too. In fact, if you don't like tsunderes, you might as well dump the whole anime altogether. I'm sick of seeing underdeveloped characters who act childish and cannot admit their love. It's exhausting to watch, and many situations are based upon misunderstandings that could have easily been avoided. I honestly think that Nakamura-sensei could have done so much more with the characters. Perhaps I'm judging too fast, and there are many improvements in the second season, but I'm having my doubts.\\n\\n\r\nThe semes always have to do all the goddamn work. While they do have some variations in personality, which is a breath of fresh air, the artwork really isn't flattering at all. They also look pretty much the same...it's just so frustrating to see. There could be so much more improvement! \\n\\n\r\nThe soundtrack isn't much to write home about...it's nothing very memorable, but it does blend into the atmosphere pretty well. \\n\\n\r\nOverall...I guess I just dislike tsunderes :') I'm sorry if I said anything to offend the fans. I'm just an old potato x ~ x I'm picky with my animes at the moment.",
            "date": "2016-06-03T13:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 219917,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5425198.jpg",
                "scores": {
                    "animation": 4,
                    "character": 2,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Tetsu_Jin",
                "username": "Tetsu_Jin"
            },
            "url": "https://myanimelist.net/reviews.php?id=219917"
        },
        {
            "content": "As a straight female, I thought I wouldn't like this and I avoided Yaoi anime all together but I just gave in and i LOVE it. I just love boy x boy anime. It is very good, in a(n) episode(s) there is 2 new characters and the story goes off into an authors and an editors boy x boy relationship, it veered away from the 2 main characters and that was pretty lame but this anime was a really good one and I got caught laughing my head off a couple times at 1 AM from watching this",
            "date": "2014-06-28T12:02:00+00:00",
            "helpful_count": 2,
            "mal_id": 149121,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3658819.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/PoisonSunflower",
                "username": "PoisonSunflower"
            },
            "url": "https://myanimelist.net/reviews.php?id=149121"
        },
        {
            "content": "Ah, my new favourite anime of all time. Where to start...\r\nStory: 10 \r\nJust beautiful. I mean they had a romance  already established relationship in high school and basically broke up for misunderstandings. And then they found each other again 10 years later! Also I enjoyed the other two romances a lot. I enjoyed them much more than the other 2 romances in Junjou Romantica. Not that they're bad, I just enjoyed these a lot better.\r\nArt: 6\r\nSometimes the art could get very gorgeous. I also loved the constant use of the characters facial expressions. It made me laugh. Although the art could of been better,it didn't bother me a whole lot.\\n\\n\r\nSound: 8\\n\r\nThere isn't much I can remember besides the opening themes song which are really catchy. The first theme song is my Jam.\\n\\n\r\nCharacter: 10\\n\r\nAlthough some of the characters had a lot of the same characteristics of the others, they all each have something unique to them. Takano's character was the best for me. I loved how one moment he'd be all calm and quiet and then BAM. They were some of the most funniest moments of the show. I also enjoyed our main character, although he was very unrelenting. He was the kind of person who would say something but his expression would say otherwise, so he rarely ever fouled anyone. That's a good thing. \\n\\n\r\nEnjoyment: 10\\n\r\nI would rush home from school just to watch this. It was all I could think about. It kept me from doing my assignments.\\n\\n\r\nOverall: 10\\n\r\nWhat can I say? This anime is pure bliss for me.\\n\\n\r\nI HIGHLY RECOMMEND my new favourite anime. I've completed the whole series now and am missing it terribly ): I can't wait to read the manga and I am praying for a season 3. \\n\\n\\n\\n",
            "date": "2016-06-14T02:16:00+00:00",
            "helpful_count": 1,
            "mal_id": 220726,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5255364.jpg",
                "scores": {
                    "animation": 9,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/jaedencex",
                "username": "jaedencex"
            },
            "url": "https://myanimelist.net/reviews.php?id=220726"
        },
        {
            "content": "Fluff. Pure fluff, which is probably what made me love this anime so much. \r\nThe storyline was pretty much predictable, so if you're looking to watch this for a unique plot, don't. If you are however looking for a cute story with great art, than you'll probably love this!\r\nOpening and ending theme's were amazing.\r\nThe only thing that sorta put me off was the switching of the 3 (four?) couples. Other than that, it's a good anime. \r\nBut like I mentioned before, this a yaoi, and if you want a good yaoi with an actual plot, read yaoi manga.",
            "date": "2013-10-06T19:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 115859,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3228491.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/WithTheSky",
                "username": "WithTheSky"
            },
            "url": "https://myanimelist.net/reviews.php?id=115859"
        },
        {
            "content": "I decided that I would try at least one anime from every genre a long time ago, and I am just remembering this decision right now as I type this review. I was curious to see what the shounen-ai genre had to offer. I'm a fan of god slice-of-life anime, and a sucker for a good, well-paced love story. It really didn't matter what kind of love story it was as long as the characters look good and it's not some cheesy crap you can find almost anywhere. Too many clichés get quite boring.\r\nAbout this series now: Well, it was amusing, funny, decently paced, nicestory and it explored a current subject of interest: Manga & Manga Publishing. I must admit there were some moments where I rolled my eyes at the stubbornness or stupidity of the some characters in relation to the love stories, but it wasn't enough to make me dislike it. Some may say the characters in focus think a lot, but I enjoy watching them trying to makes sense of their emotions and understand the various situations they get themselves into, or attempt to get themselves out of.\\n\\n\r\nThis anime's main focus is on Onodera Ritsu, but it also focuses on the love stories of two other sets of people at times. I find it interesting since all of them are intertwined and weae the setting of the stories together.",
            "date": "2015-11-14T14:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 203366,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4520633.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/For_Reign",
                "username": "For_Reign"
            },
            "url": "https://myanimelist.net/reviews.php?id=203366"
        },
        {
            "content": "So I started watching this on the strength of some recommendations that compared it to BAKUMAN. \r\nPerhaps because I came to this series with a different expectation from most of the reviewers who gave this show a high rating, I really did not like the show. The relationships portrayed are unrealistic to say the least, and there is no lot to speak of, unlike NANA where the characters interact in a flawed but sympathetic way, Sekaiichi shows a collection of guys who seemingly have no concept of sexual harassment and with each kiss border on sexual assault. This is the characteristic of the seme (the'top' in each pairing). The uke (the 'bottom') is clueless beyond belief, every single one of them, without exception. For that reason, it becomes very hard to differentiate between the characters' personalities.\\n\\n\r\nThis has been my first foray into Yaoi, and if MAL is to be trusted, this is the most beloved entry of the genre, so I'm doubly disappointed by this mediocre work.",
            "date": "2014-02-07T10:59:00+00:00",
            "helpful_count": 0,
            "mal_id": 131783,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 2,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/hellomrpoor",
                "username": "hellomrpoor"
            },
            "url": "https://myanimelist.net/reviews.php?id=131783"
        },
        {
            "content": "This is my first review. I can't express what I want to say in English so i'm gonna do it in Spanish (i've never seen an spanish review, but it's not bad to be the first one once xD).\r\nSi te da flojera leer todo esto, entonces solo ve al final y ya c:\r\n--------\r\nSekaiichi Hatsukoi.\r\nSiempre que pido que me recomienden un anime shonen-ai, los primeros que me dicen son \"Junjou Romantica\" y \"Sekaiichi Hatsukoi\". A diferencia del primero, (que como en una review anterior alguien dijo), que es en su mayoría SEXOSEXOTEAMOSEXOTEAMO, este es como mássss, cariñoso(? romántico(?, bueno, por ahí va.\r\nTrama - 5\r\n¿Qué trama? esun yaoi/shonen-ai ¿qué tanta trama puedes esperar? es lo mismo de siempre, el uuuke que no quiere admitir que ama al seeme y el seeme seduciendo al uuke y este siempre se aleeja y blablablabalbalablala.\\n\\n\r\nArte - 5\\n\r\nAlgo que nunca voy a entender, es por qué la animación de los yaois/shonen-ais son tan mediocres. Los cuerpos todos grandes y deformes, solo detallan algunas cosas, etc. Sólo mirenles a los personajes de SH el labio inferior, están casi en el final de la cara! Además, los personajes son casi todos iguales! Es como si les diera igual. \"Este mechón se lo ponemos en otra dirección, le ponemos otro tono de pelo y ya, perfecto.\"\\n\\n\r\nY en cuanto a los fondos y otras cosas... meh. \\n\\n\r\nSonido - 5\\n\r\nNo recuerdo siquiera el ritmo de el opening o el ending. \\n\\n\r\nPersonajes - 1\\n\r\nYa hablé de su diseño en cuanto a físico así que no lo voy a mencionar aquí.\\n\r\nAunque, \\n\r\ntambién son iguales a las de los demás yaois en cuanto a personalidad.\\n\r\nTodos los uke de SH son, para mi, iguales. Las maneras de reaccionar son iguales, las maneras de pensar son iguales, \"Cómo es posible que me guste?\" \"pero somos hombres!\" \"Aléjate de mi! *sonrojarse*\" \"Por qué me molesta una cosa como esta?\" etcétera, etcétera, etcétera.\\n\\n\r\nAmbiente - 6\\n\r\nA pesar de todo lo malo que he dicho, debo admitir que Sekaiichi Hatsukoi tampoco fue una completa tortura. En algunos momentos se me hizo divertido y lo disfruté, pero en otras partes solo quería que simplemente los ukes dejaran de ser tan estúpidos abrazaran a su uke y admitieran que los aman de una vez por todas >:v.\\n\\n\r\nPuntuación total: 4.\\n\\n\r\nSekaiichi Hatsukoi es entretenido hasta cierto punto. Luego solo se vuelve repetitivo y empieza a aburrir. Es el típico shonen-ai, así que no esperes nada nuevo. \\n\r\nOkay, sí, pueden matarme, solo quería expresar mi opinión. \\n",
            "date": "2017-05-12T10:36:00+00:00",
            "helpful_count": 0,
            "mal_id": 247523,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5227037.jpg",
                "scores": {
                    "animation": 5,
                    "character": 1,
                    "enjoyment": 6,
                    "overall": 4,
                    "sound": 5,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/JuuzouGun",
                "username": "JuuzouGun"
            },
            "url": "https://myanimelist.net/reviews.php?id=247523"
        },
        {
            "content": "Sekaiichi Hatsukoi is my personal fav. It's fairly long series with  three extra stories aside from the main. These side stories tie into the main and keep the main story from going stale by breaking it up. All four storylines are interesting and funny with really sweet lovey dovey parts in it. There are sexual scenes but the hardcore stuff is only in the manga and even the hardcore scenes are not disturbing. \r\nThe best part in it for me was the humor, all throughout the plotline bits and pieces of funny moments were put in that didn't take away from the story itself.\\n\\n\r\nAnother interesting part was how they display the workplace, not being a manga writer or even going into a publishing house I can't say how accurate this is but it seems like the headaches people in this field would go through.\\n\\n\r\nThe only downside is the ending is not to my personal liking as the words are not actually said but that is me being picky.",
            "date": "2014-08-16T12:37:00+00:00",
            "helpful_count": 0,
            "mal_id": 156775,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4017287.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ditzyjess",
                "username": "ditzyjess"
            },
            "url": "https://myanimelist.net/reviews.php?id=156775"
        },
        {
            "content": "First of all, the story is awesome, funny and the guys character are cute...the story plot was okay...luckily there was not many bed scene but there were a lot of kissing going on...so, whoever like kissing scene between guys, this is the story for you...all the guy characters almost look the same...so, dont mixed up the stories with the other couples...although the plot was great but i just dont get why all the guy characters who play the boyfriend role has to so forceful when it comes to kissing or making out....its not romantic at all...looks like sexual harassment to me...but the guys character whoplay the girlfriend role end up enjoying it, making weird sounds or just pushing their boyfriend away...and for the art, it is amazing...and as for the sound, its okay but i just feel weird whenever they making out, they have to do the sound eventough it was suppose to sound like that...just ignore that part, i guess is just me who feels it weird.....thats all from me...hope you enjoy the story...",
            "date": "2012-02-11T10:28:00+00:00",
            "helpful_count": 0,
            "mal_id": 53653,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1143237.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/zen169",
                "username": "zen169"
            },
            "url": "https://myanimelist.net/reviews.php?id=53653"
        }
    ]
]