[
    [
        {
            "content": "Watching this anime is very painful.\r\nBack in 2016 I've heard, that Toaru Majutsu no Index is very good light novel, so I've decided to watch the anime adaptation .After watching first two seasons of TAMNI I was wondering \"this is at most decent, why is it considered a very good light novel?\", so I've decided to try and read it. I don't regret this decision. Toaru Majutsu no Index is the best light novel I've ever read. And I'm not overrating it, I loved almost everything about it. Besides La Regina del Mare Adriatico Arc, even in light novel it isn't good. I've read wholeOT in about a year, and then started NT, which in my opinion is worse than OT and I never ended it.\\n\r\nAfter I heard that there will be 3rd season of Toaru Majutsu no Index I was scared. I know J.C.Staff very well and I was sure that they will ruin it. But this is even worse than I imagined. But let's start from the beginning\\n\r\nStory: 9/10\\n\r\nEven if it is executed poorly, it's still the story that I love so much. \\n\r\nArt: 5/10\\n\r\nAfter I heard about 3rd season I thought that it will have similar art to that in Railgun S. Wrong. It's even worse than in previous season, but maybe a bit better than in first. The fights could have been epic, but they aren't. I thought about rating it even lower, but I've seen anime with worse art than this, so I won't do it\\n\r\nSound: 8/10\\n\r\nSoundtrack is good, it fits this series and I like it. After it comes out on youtube I'm sure that I will add it to my playlist \"Favourite Music\"\\n\r\nCharacter: 3/10\\n\r\nInner thought of characters from light novel are cut off. Because of that the characters lack depth and I can't identify myself with them. And I'm not only talking about supporting characters, even the main trio is bad. I really liked Hamazura in light novel, I felt he is very similar to me, but I don't feel the same in anime. I hate this anime because of it, characters were the strong point of TAMNI light novel series, but in anime adaptation they're the bad point. \\n\r\nEnjoyment: 2/10\\n\r\nAs I writed in the beginning. Watching this anime is painful. It's so painful that every episode I think about dropping it. But I'm still watching, only because I still had hope in J.C. Staff, that maybe when one of the best arcs in the whole series starts up, it will be adapted properly. But after watching episode 6 I think I'm done with it. I'm dropping this series.\\n\r\nOverall: 3/10\\n\r\nGood job J.C. Staff, you ruined one of my most favourite series. I wish that season three would never come up, or that other studio would animate it properly. You had very good source material, how could you fuck this up. I'm done with you, it's my last time I ever watched something made by you. To the people who are only anime viewer - read the light novel, I'm sure you won't regret it. But do it before you watch the anime, because it will spoil the best of it in the worst way possible.",
            "date": "2018-11-09T14:20:00+00:00",
            "helpful_count": 102,
            "mal_id": 293702,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4512346.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kuba4ful",
                "username": "Kuba4ful"
            },
            "url": "https://myanimelist.net/reviews.php?id=293702"
        },
        {
            "content": "“Disappointment is a sort of bankruptcy – the bankruptcy of a soul that expends too much in hope and expectation”. – Eric Hoffer\r\nWatching Index Season III is like procrastinating a school project where hope seems lost with you clinging onto a tiny bit of hope that somehow, someway, everything may be ok. I began watching Index since 2011 and got into the light novels around 2014. While the first two seasons certainly had its share of flaws, both series managed to capture a good deal of concepts that I applauded for. It’s not easy to craft a story with so many characters, conflicts, and intersectingstorylines altogether in a complex system of magic and science. Here we are in 2018-2019, and we are gifted for the long anticipated third season. And with my sincere and deepest regret, I proclaim Index III as a disgraceful abomination.\\n\\n\r\nI remember watching some of the Dengeki Festival events in the past few years. Every time, it seems we are so close to the Index Season 3 announcement, it ends up with a tease of “please, just wait a little bit longer!” The long wait ended on September 30, 2017. I jumped in joy realizing that the dream came true and we are finally getting a continuation. It didn’t take long for the show to announce its airing date either just a few months later. Flash forward to Fall 2018 and here we are, the first episode of Index III. What aired on TV seemed like a miracle at the time with many familiar gimmicks. We are reintroduced to level 0 Esper, Touma where he is still unlucky as ever. After getting bitten by Index and running into a slew of misadventures with other characters, it seems the show had a flow going. It also didn’t take long for an ominous feeling to settle in with the realization that the God’s Right Seat are on the move. In fact, the first few episodes covers Touma clashing against God’s Right Seat member Terra of the Left with some unlikely allies. (such as the towel girl Itsuwa) More importantly, we also learn that Touma is suffering from a case of amnesia. As a recurring trend, girls like Itsuwa gets their fair share of screen time when it comes fan service. Indeed, these are just a few elements you’ll get have to get used to throughout the third season. But unfortunately, Index III quickly began to wore itself out.\\n\\n\r\nIf you recall from the previous season, Academy City is well known for its darker storytelling when it involves espers and its underworld activities. The first season and even its spinoff Railgun had level 5 esper Accelerator undergo an experiment project known as  the Level 6 Shift Project where he would have to kill 20,000 Misaka Mikoto clones to become level 6. Of course, that project never reached completion thanks to the intervention of Touma. My point for bringing this up is because in this season, we are introduced to new forms of esper conflicts. As a show with an expansive cast of characters, the third season decided to set 5 different factions in a plot known as the “Battle Royale Arc”. This was actually one of my favorite arcs in the light novels but the anime adaptation made my stomach sink upon seeing how they treated this. Make no mistake, if you are an anime only viewer, confusion will be a common thought. Once again, Accelerator becomes a prominent character in this arc due to his status as the strongest level 5 Esper. Hamazura Shiage is upgraded as a protagonist while we are also shown with other familiar characters such as ITEM (if you’ve seen Railgun Season 2). The newer characters introduced includes Level 5 esper Kakine Teitoku, Teshio Megumim, and the Professor. The big problem? All of these characters are little more like actors in a poorly constructed script. For whatever reason, the directors thought it would be a good idea to cram such an important arc into a mere set of just 4 episodes. Once I realized this, it became immediately obvious that the producers had little intention to make an impact of its story or characters. Because let’s face it, there’s far too many characters to get invested into in the Battle Royal arc. There’s also too much going on that puts you into a state of confusion. At the apex of this arc, we have two of the strongest espers clashing against each other but the outcome lacked depth and instead replaced with endless screaming of pure absurdity. It felt like these entire few episodes limited what potential it could have been. Even with certain deaths of several characters, I felt nothing for them. In essence, what could have been one of the most memorable plot in the franchise turned into a depressing fallout of rushed execution and poor story craftsmanship. \\n\\n\r\nUnfortunately, it doesn’t stop there.\\n\\n\r\nAt this point, we’re around a third of the show and I had to put down my thoughts and wonder how long this would last. Indeed, the next arc had me worried although to my delight, Acqua of the Back had probably the most consistent arc in this season. Perhaps this is because the anime only had one volume to work (Volume 16) so locking the arc to three episodes is actually consistent. Nonetheless, we are shown more conflict against the God’s Right Seat. Kaori Kanazaki also makes a big return from the previous seasons although she’s given more of a role as a combatant. The purpose of this arc wasn’t made entirely clear although it suggests that Touma would have some significant role in the upcoming struggle with the God’s Right Seat. Nonetheless, we can’t forget that Touma is a prominent character regardless how you feel about him. Ironically, titular Index remains mostly in the background despite having a significant role in the previous seasons. Here, she lost a lot of relevance and is even absent for quite a bit during the first half of the show. \\n\\n\r\nWith the British Royal Family arc that followed, the anime again suffers problems with pacing and many characters stuffed together in one place. Featuring new characters such as the United Kingdom Princess Carissa, it will really make us wonder how Touma fits in all of this. The British Royal arc basically drops him into the magic side of the story without emphasizing its main purpose. Meanwhile, the plot twists didn’t feel meanginful even with some of the characters face-heel turns. Index actually becomes somewhat more relevant although I didn’t feel her role as nearly as memorable as the first two seasons. So in essence, the anime could have done more to capitalize itself by explaining more as everything is too frantic to absorb. \\n\\n\r\nHonestly, if you made it this far into the third season, I have to applaud you. It takes commitment after seeing how much Index III has degenerated. The final story arc of this season covers the World War III saga covering from episodes 18-26. It also covers the final light novels of the Index series (before New Testament) Meanwhile, I’m sitting wondering how the hell we can this can be accomplished through just 8 episodes. The World War III arc involves God’s Right Seat leader Fiamma of the Right pushing his goals for domination. Three different protagonists are actually featured in this final arc although all with different purposes. I’m not going to spoil it but the season makes it clear that all of them are important in some way or another. Again, Index III continues to suffer the problem of confusing storytelling. It doesn’t get viewers invested into what it’s telling us. Instead, what it does is trying to mix too much content at once. It’s like putting all the fruits into one basket and the customer isn’t sure what to pick in the end. Here, Index III chronicles the storytelling of three different protagonists without really getting us to fully invest into any of them. It’s very messy and we are pretty much left to figure out their motives and purpose. Most of these characters suffer development too as the show devotes much of its time on the plot. Oh dear God, how many times do we have to see Accelerator suffer more?\\n\\n\r\nIn perhaps the worst kept secret of the franchise, studio J.C. Staff once again decided to tackle this show with its production staff and talent. Honestly, it’s not too bad if you go with the flow for its action elements. If there’s anything actually worthy about Index III, it would be the technical quality. Sure, it’s not a masterpiece polished art piece but is able to sell an acceptable degree of animation. Character designs are carried over from the previous seasons with little change in style. There are some scenes that makes the action more overdramatic than it should be though. (such as Accelerator vs Kakine) This also extends to the emotive performances of certain characters such as Accelerator and Hamazura. And as previous Index shows, fan service returns with girls such as Misaka, Ituswa, and even Kaori to an extent. We just can’t have a full season of Index without bath scenes, right Mr Director Nishikiori? \\n\\n\r\nAfter waiting for years, Toaru Majutsu no Index III turned out to be nothing more than a big fest of mushy questionable content. In fact, you could probably learn from reading Wikipedia than watching the show. It’s crystal clear that we needed more than 26 episodes but instead, this came out like a procrastinated school project. Sometimes, I wish certain franchises aren’t revived so it can't be killed anymore. Index III became another example of tragic adaptation with what’s shown us. As someone who has read the light novels, I recommend reading through volumes 14-22 to get a much better understanding of this series. But it’s too bad really. What could have been a big hit of the year instead showed us how some big franchises can’t live up to its reputation. I just hope Accelerator spinoff or Railgun Season 3 doesn’t become another victim.",
            "date": "2019-04-05T06:29:00+00:00",
            "helpful_count": 80,
            "mal_id": 305514,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=305514"
        },
        {
            "content": "Keep in mind this is only related to the anime adaptation and slightly targeted towards the Battle Royale Arc that just ended:\r\nWhile I want to keep this short, there is something I just want to get off my chest, after having waited so long for an adaptation, since I am more willing to watch an anime than read a Light Novel (I did read most of the summary and wiki entries however), I couldn't have been more happy to finally see all these scenes animated with good visuals.\r\nSadly, this is where my heart just breaks down now, what is this J.C. Staff? What have youdone to Index! Why were you breaking the rule of 24 ep to make 26 ep instead, only to disappoint us with more cuts? I was expecting that this change was made to include \"more\", not \"less\". I've been a long on going fan of the series, I was heavily biased even towards it, but this, this just does it. \\n\\n\r\n\"Points that led to me dropping the series:\"\\n\r\n- Significant Character plots are cut out, especially for new characters\\n\r\nespecially during Episode 5, where we are suddenly introduced to more Dark Side Groups without any proper introduction for them, I couldn't feel anything for these guys. And in Episode 6 where a certain Level 0 is capable of doing something amazing without explaining why he is capable of this in the first place, then the fact they cut out a very important quote and metaphor of said character, which would have helped in developing the character further.\\n\\n\r\n- random dying everywhere without knowing who was/is who\\n\\n\r\n- changes that technically ruin and/or change future lore in the anime\\n\\n\\n\r\nOverall you can see where this is going already. After having finished The Battle Royale Arc I had enough of it, I felt sad, betrayed. \\n\\n\r\nIndex and Index II, while being not the best adaptation either, still sticked towards the LN and atleast made sense, leaving the important plot in. Watching this however just hurts.\\n\r\nThankfully I already currently have most of the English translated Light Novels of it from Vol 1-16 in my hands, so I will stick to these.\\n\\n\r\nThank you J.C. Staff for having ruined my most favourite Anime ever. I don't think I will be able to watch Railgun 3 and Accelerator with such a direction right now.\\n\\n\\n\r\n\"Story: 3/10:\"\\n\r\nPoorly adapted so far, only highlights and fights so far\\n\\n\r\n\"Art: 6/10:\"\\n\r\nI'd say it is decent enough but the budget definitely changed, several effects we were used to see like in Index II, the Movie and Railgun S are not present anymore and replaced with downgraded effects.\\n\\n\r\n\"Sound: 8/10:\"\\n\r\nNot much to say about Sound, the only thing that takes me off was the sound change of Imagine Breaker \"again\", like, why change it in the first place? Why can't we just keep the same sound from Index, it was changed in Railgun once, in Railgun S they went back with the original sound, now Index 3 all of a sudden changes it again? Seriously, what the fuck.\\n\\n\\n\r\n\"Character: 1/10:\"\\n\r\nTotally butchered, the characters can't even develop the way J.C. Staff adapted this. \\n\r\n*see part about important plot points being cut out*\\n\\n\r\n\"Enjoyment: 2/10:\"\\n\r\nWhat's there to enjoy when after several years, this is what you get.\\n\\n\r\n\"Overall: 3/10:\"\\n\r\nOverall I don't recommend watching \"this\", but I do recommend reading the Light Novel or possibly reading the Manga of it. These are much much more faithfull (duh, the Light Novel is the original after all). \\n\\n\r\nSo yeah, any Anime only watchers should probably get acquainted with the Light Novels now instead, if they want the enjoyment they desired. Index 3 is not gonna give you that with the way it is handled.\\n\\n",
            "date": "2018-11-09T21:19:00+00:00",
            "helpful_count": 52,
            "mal_id": 293733,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2860857.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Devostator",
                "username": "Devostator"
            },
            "url": "https://myanimelist.net/reviews.php?id=293733"
        },
        {
            "content": "I'll be brief. This particular adaptation failed. Hard.\r\nEither they tried to adapt everything in a short timetable, or the opposite, but J.C.Staff cut too much of the novel content in the process. I would prefer it if they decided to animate less in this season, but with better detail, instead of rushing through the story abandoning valuable pieces left and right. Story 4/10.\r\nCharacters' inner thoughts are omitted, some characters were not even introduced and just appeared with no backstory. As a result, their motivation is unknown, their actions seem irrational and forced. Even an off-screen narrator would do, like when Touma narrates about his situation.Why not give Hamazura the same opportunity to introduce the viewer to his situation? 5/10.\\n\\n\r\nAnd it's all too rushed. We should have had 4-5 episodes dedicated to ITEM alone before Fre//nda happens. Because like this we feel nothing, it just doesn't faze us. The constant jumping between POVs is also not appreciated, not with THAT pace.\\n\\n\r\nArt is passable (6/10), but fights are pathetic. Special effects are just... total trash. Accelerator vs Dark Matter was supposed to be epic. It was instead a short sequence of bad choreography mixed with garbage CG (especially Accelerator's attacks - wtf is that black thing?). And then... the conclusion of the fight happens off-screen on top of that. Other fights are also bad. Mercs and drones that shoot bad CG lines of yellow and never can hit any named characters (who stand still and scatter only AFTER the shooting starts), constant speaking in the middle of the fight, characters teleporting (not via ability, but through scenarists' oversight) all over the city...\\n\r\nThe sound is not praiseworthy either. Touma's canceling sound was changed from glass breaking to... something. It just doesn't suit the situation. Music is fine but nothing fantastic. The rest is normal. 5/10.\\n\\n\r\nWhile original story and characters are good, in this adaptation we can't see any of that. Enjoyment 3/10.\\n\\n\r\nSo, overall - poor. 3/10.",
            "date": "2018-11-18T18:23:00+00:00",
            "helpful_count": 43,
            "mal_id": 294329,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Durmanstainer",
                "username": "Durmanstainer"
            },
            "url": "https://myanimelist.net/reviews.php?id=294329"
        },
        {
            "content": "this will be my first quick review into the series, i have read the Light novel all the way to its recent released.\r\nStory: 7, Story now revolves around Touma, Accelerator, and now the recent one named Hamazura who is a level 0 like touma but with no powers whatsoever. The anime will be changing perspectives as the plot moves forward regarding the full on war with the science side and magic side.\r\nArt: 7,  Way better than the last 2 seasons but not on par on Railgun S i think. the fight scene with Accelerator and Dark Matter was really well done though, and hopingfuture fights will be done like that.\\n\\n\r\nSound: 7 they change touma's imagine breaker sound when he touches anything magic related or esper related powers but you''ll get used to it i hope. sounds when characters fight is still top notch with their futuristic edm style (?).\\n\\n\r\nCharacters: 8, With more characters getting included, it may be a mess trying to switch to some of them to get in screen time but ill hold on it atm. Im really interested in how Hamazura will play out.\\n\\n\r\nEnjoyment: 9, I love this series tbh, with its setting, plot, and the characters interacting in this world of magic and science society. how will they react to the others sides powers?\\n\\n\r\nOverall: 8, a good series but is not for everyone since it can get convoluted at times. will update later on",
            "date": "2018-11-18T10:45:00+00:00",
            "helpful_count": 41,
            "mal_id": 294303,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6340638.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DivineLion",
                "username": "DivineLion"
            },
            "url": "https://myanimelist.net/reviews.php?id=294303"
        },
        {
            "content": "I love the Toaru series, I really do, I have seen all the spin offs, read the novels, read the manga, will watch the third season of railgun and will watch the Accelerator spin off. Despite this I will be giving this particular adaptation of the show a low review, not because the source material is bad, but because its just a terrible adaption. If you want to actually enjoy this series, please just read the damn novels. This adaptation was basically JC Staff butchering the plot, stitching it back together incorrectly, throwing out important parts because hey we need to save budget for Misaka’sass shots, and then setting it on fire. Anyway, now that I cleared that up we can get onto the actual review.\\n\\n\r\nTHIS REVIEW CONTAINS SPOILERS\\n\\n\r\nStory: 4\\n\\n\r\nI have never seen such a poorly executed story in anime before, and I have seen that one isekai anime involving a Kirito clone and a smart phone. Nothing in the story actually makes sense, and this is from a novel reader who knows exactly what is supposed to be going on. The anime was already very fast paced in season 1 and 2 and those 2 seasons adapted 12 novels combined, while this season tried to adapt 10 at once, this lead to a great portion of the plot being cut out.\\n\\n\r\nThe battle Royale Arc, one of the best arcs in the novel, with mind games, extremely well written fights, great conflicting motivations, was turned into an endless blood bath. What happened was a bunch of characters you don’t care about got killed, some soldiers got shot up, and all for a bunch of reasons that they don’t expand beyond a single line here and there. \\n\\n\r\nThe British Halloween arc? One of the best political stories I seen in an LN, one that successfully predicted Britain in real life leaving the EU before it actually happened, was turned into a half ass coup by some bratty girl who was really tsundere about Great Britain. \\n\\n\r\nDon’t even get me started on the acqua of the back, arc with more focus on Misaka’s ass than the motivations on WHY acqua was in the city, how he got there, when in the timeline he got there, and why Academy City dint put him down as fast as possible. \\n\\n\r\nAlso the exposition in this season was some of the worst, it was already bad in previous seasons, when they start explaining character abilities, half of it sounds like chuuni nonsense someone on drugs came up with, the other half shouldn’t even be included since it wastes a good portion of the episode with someone just talking. Would it be so hard to just simply explain their abilities, since clearly going into the origins of the abilities in depth won’t work in an ANIME, it works well in novel because they can dedicate 3 pages to something like that. They also don’t do this once, they do it like 30 times, every time some new character shows up. \\n\\n\r\nArt: 3\\n\\n\r\nThe animation is honestly disgusting, and I have seen shows released in 1998 that are much better looking, I am serious, we have scenes that look worse and more broken than that bad berserk adaption a few years back. The fights which in the novel were described as shattering mountains, tearing space, explosions in every colors as reality was distorted, had no weight to them at all. Most of the fights were just the characters talking, them using their abilities 2 or 3 times and then eventually one of them backed down or got knocked out. \\n\\n\r\nThe effects for the abilities looked terrible, curtana was supposed to cut through space, what were those stupid cubes of jello???? Or how Accelerator’s black wings were not consistent between this season and last season, heck it wasn’t even consistent in the 2 fights this season alone. Also, what the heck were the gods right seat abilities, seat of the left had some weird look blade that moved slowly through the air, acqua’s speed was downplayed the entire time, fiammas holy right looked so ugly and did not do any of the cool sounding stuff it was supposed to, like teleport to the target and knock them out without force, oh by the way his sword was supposed to be 40KM long and on FIRE.\\n\\n\r\nThis being said, the only reason the art gets a 3 instead of a 1 was because of the second opening, after seeing it though it made me even more angry, how can they make an opening so great visually, and then make a show that looks so awful after. The opening visuals were possibly top 10 out of 100s of series I seen, if JC staff is capable of that, then it’s clear it was not even a lack of talent but just laziness on why the show looked this garbage.\\n\\n\r\nThe sound: 8\\n\\n\r\nThe openings were absolutely amazing I will admit that, and the soundtrack is as good as ever, I guess they managed to get one thing right. I have nothing bad to say here, the sound effects used were interesting even if it was not consistent with the previous season, and I really enjoyed the soundtrack that played during major fights. \\n\\n\r\nCharacters: 2\\n\\n\r\nAccelerator became the epitome of edge and stupid justifications instead of a well written anti hero, the MC became an endless platitude generator who quotes basic lines about justice and punches out his enemies without understanding their view point, and hamazura apparently survives every situation by luck. This is essentially how the anime adaption portrayed them, one dimensional cardboard characters with no nuance, who can’t think beyond the most obvious solutions to their issues, and who win by luck or plot armor. I will tell you that the novel does not do this and the characters are much more likable but I think I already said this enough, the character writing and development in the series is just awful.\\n\\n\r\nAnother issue in the series is that they add like 100 new characters without developing any of them, some of them genuinely have great character designs, interesting abilities, and look really cute or cool. However, we will never get to know them because they either die, or are forgotten about in the next arc, and you don’t care much about them because the show skipped any significant development or backstories for the characters. \\n\\n\r\nAlso outside of fan service some of the most popular characters got no screen time, we dint even get to see Misaka do anything substantial or have any of the Academy city students show up outside of 3 minutes of screen time.\\n\\n\r\nEnjoyment: 5\\n\\n\r\nI really wanted to enjoy this series, since the source material is something I love, and I was looking forward to seeing this anime. However I just could not get myself to like it for the most part, I know the story from the novel and could barely follow it, I feel sorry for anime only viewers who likely understood nothing through the entire show. Now I wouldn’t say I hated all of it, but a majority of it except some highlight scenes were pretty bad. I used to like JC staff as a studio, however after this adaptation, and whatever they are doing with Date a Live 3, they are garbage to me. All I can hope for is that the railgun season 3 director manages to put on a good show despite the studio, like he did last time with railgun s.\\n\\n\r\nOverall: 5\\n\\n\r\nI give this show an 5, it was really hard deciding whether or not to give this show a lower score since it was very bad and disappointing, however I will give it an 5 for just because I love the source series, and because I rarely ever give a show under a 7, if its under a 7 on my list it means the show it hot garbage and I would never recommend it.",
            "date": "2019-04-05T09:06:00+00:00",
            "helpful_count": 32,
            "mal_id": 305528,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7060988.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ACasualViewer",
                "username": "ACasualViewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=305528"
        },
        {
            "content": "As the curtain closed on the season of Winter 2019, the epidemic known as JC Staph Infection had claimed yet another victim from the masses of announced sequels to previously aired shows. This time, it’s the adaptation of a popular Dengeki Bunko light novel series known as A Certain Magical Index (which is alternatively called Toaru Majutsu No Index). It is practically inexcusable to have people wait out just over seven years for another season, and then come out with such a disappointing product. Having watched and enjoyed the previous two seasons, I was really looking forward to an announcement for a third one. Sowhen it finally came, I was really looking forward to how they’ll handle the rest of the story, so I didn’t think too much about the possibility JC Staff mishandling everything. Instead, what was supposed to bring an epic finalization to the main story was just one hell of a tumbling mess.\\n\\n\r\nSTORY:\\n\r\nTo Aru Majutsu No Index III’s premises are practically the same as the two previous seasons, so regardless of whether or not you’ve read the LN source, this installment is only for those who’ve watched the two preceding installments and are curious to see how the continuation turned out. Watching the Railgun series is also a helpful option to familiarize yourselves with the majority of the characters.\\n\\n\r\nIt was after the first three episodes that the lack of craftsmanship became very obvious to me, despite me not wanting to initially admit it at the time. One of the biggest issues in the show, while common with most LN adaptations, grew prominent as one watches….PACING. Even though I don’t read light novel or manga sources myself, it was made clear very early on than the show’s content has been condensed and trimmed to accommodate for the listed twenty-six episodes. From what I was told, the season was trying to shove nine volumes worth of content, which contrasts the shared thirteen volumes by the previous two seasons.\\n\\n\r\nBecause of the forced condensation of the story, the six individual arcs within the plot, excluding the final climactic WWIII arc don’t last much more than three episodes. This consequently results in the sudden introduction or reintroduction of characters, and we are expected to care about them without enough, if any, background context to them. The lack of proper introduction of the cast members can leaves viewers quite lost and confused, as they try to figure out the characters’ individual motives within the story. Even worse…it can actually be hard to remember the names of the newcomers who are somehow supposed to be important to a particular arc. Because of the significant lack of character background, it’s also hard to feel for them when some of them die in action.\\n\\n\r\nLet’s use a somewhat brief example with the Battle Royale Arc. Being the only arc to actually not feature the main protagonist Kamijou Touma, it was supposed to focus on Accelerator and reintroduce Hamazura Shiage in a major protagonist role, as well as reintroduce the group ITEM, whom we may know previously from watching the Railgun series. This was the most problematic arc for me, personally; for a segment that only lasted three episodes, it was clear that the studio probably wanted to have it over and done with quickly to set up room for the finale. Throughout the adapting of the Battle Royale, new characters and groups are just introduced from left to right without any sort of explanation of what they’re here for and why, making their actions feel so forced and idiotic. Many of the fights that take place during this arc and future ones often conclude off-screen for no apparent reason. \\n\\n\r\nNot to mention, there’s FAR too much pointless standing around and talking during those bouts; it’s as if they’re not actually taking stuff in earnest or sincerity with their actions at all, considering how vaguely their intentions are portrayed. As if that’s not enough, a good number of these introduced or reintroduced characters are seemingly killed off suddenly without anything building up for them, sometimes biting the dust off-screen; in fact, some of them are simply introduced and then killed within the same damn episode; as a result, we feel absolutely nothing for them. I don’t see how it’s any possible as a viewer get emotional over such poorly introduced cast members.\\n\\n\r\nAdditionally, the plot omits helpful exposition or even inner dialogue that would explain what certain characters were thinking or how some were able to perform something particularly hard to explain. All we end up getting are mostly just poorly conducted fights and pointless, bland dialogue from the characters. \\n\\n\r\nThe show also fails to show any of the characters’ inner thoughts, which would’ve proven helpful in terms of giving more sense and logic to their actions. Whatever exposition that DOES come out, or what’s supposed to be exposition, quite often feel like very half-hearted attempts to sound witty due to the unfortunate lack of prior context. Lastly, the constant, nauseous shifting between POVs, without the proper siegeways or breaks, just makes it even harder to follow and keep track of what’s going on, especially with the kind of pacing this show has resorted to.\\n\\n\r\nThe only particular arc that I considered okay was the Acqua of the Back Arc. For this particular segment, despite being just three episodes as well, the story didn’t really seem to omit as much important events and details as the others. Kanazaki, one of my more favorite support characters of the show, returns to take a more upfront role as a combat participant against the likes of Acqua, who himself was a particular character of interest. Nonetheless, this arc felt rather pointless for the story, or at very least, not made clear.\\n\\n\r\nART/SOUND:\\n\r\nThe quality of the animation is notably downgraded from the previous seasons. The 2D animation and designs from this season, while not exactly awful, per say, have considerably more inconsistencies compared to the second season and the Railgun series. The movements don’t feel as fluid or liberated, the characters can occasionally look “off” in terms of facial expressions and body gestures, the emotional acts feel far more overdramatic than emotionally powerful, and the special effects are just horrific. The CGI was not exactly very pleasing; while it was not anywhere near “Hand Shakers level” of awfulness, the notably increased usage of it resulted in poorly choreography of the 1-on-1 fights and the military conflict.\\n\\n\r\nThe soundtracks are actually very nice and at least try to fit with the tense or lighthearted mood, depending on the current point of the story. Maon Kurosaki, whom also did the two ending themes for the second season previously, sings the two opening themes for this one. Both songs are j-pop rock soundtracks, with “Gravitation” setting a moderate tempo to fit the inner urban activity and stuff going on behind the scenes, while “Roar” is more complementary to represent the frantic tension of international war and all-out conflict. The sound effects this season just don’t have the same kind of natural feel; for example, while I understand changing the noise of Touma’s Imagine Breaker was to make it sound more ominous and mysterious, due to the ambiguous and undisclosed nature of his power, it can feel quite out of place amidst the heavy conflict of him fighting it out with his adversaries. The previous sound, felt more fitting as it gives the clear indication of something being cancelled out and/or broken through, which is exactly the effect of Touma’s power. The voice acting was fine, in all honesty, but the vagueness of the story and plot can have you wondering why, for example, two high-leveled espers in Accelerator and Kakine are just excessively screaming for no particularly good reason or explanation; as a result, it just feels like overcooked displays of emotion. At least the show sort of lets us know when to cover our poor eardrums when a characters wails with absurdity.\\n\\n\r\nCHARACTERS:\\n\r\nThere’s not much else I can really say about the new supporting characters, as I’ve mentioned the major issue with them in the previous section of this review. The more prominent recognizable main and support cast from the previous seasons are, in all honesty, unchanged for the most part.\\n\\n\r\nTouma is still the usual “act first, talk later” selfless character we should all remember, regardless of whether we hate him or not. With the exception of the Battle Royale Arc, Touma has always taken at least a major role in all the arcs he’s involved in, especially the final arc, the WWIII Arc, where he fought the superiority complex jackass known as Fiamma, who was trying to accomplish the typical, regurgitated objective of world domination.\\n\\n\r\nIndex, as always, with the exception of the final arc, always took to the benches on the sideline and doesn’t really have a very major role. While I can understand her origins and her case of amnesia, I’ve never really liked Index as a character due to her rather annoying personality. Despite her high intelligence, she is overly naïve and easily irritated, which often leads to the gag where she bites poor Touma on the head, often for no good justifications. She does have a good side to her, though, as she is shown to kind, nice, and polite with other people. Despite the bright side of her, her role as the primary heroine just never felt right, as she barely get involved personally barring when she’s taken hostage. In the final arc of this season, she is only relevant as a puppet of destruction until she was eventually freed. Her mostly backseat role, despite being the main heroine, felt like a hindrance as she almost always ends up in the damsel-in-distress situation when she does get involved, and Touma is usually the one that has always had to be her savior.\\n\\n\r\nMisaka Mikoto, another favorite character of mine and one that I personally felt that should’ve taken both roles as main heroine in both Index and Railgun (but is unfortunately a support cast member in the former), doesn’t show up as much as she used to in the previous seasons, though she does appear as a minor participant in the WWIII Arc to try to help her love interest in Touma. Her character from the previous installments is mostly unchanged for the most part. The majority of times Misaka is seen is almost always involving Touma, whether it’s the usual lighthearted gag of her getting flustered and/or angry due to her feelings for him, or it’s on a serious note where Misaka is trying to tell Touma to not push himself, with the latter saying otherwise. In the end, Touma and Misaka’s relationship stayed pretty much the same, so Misaka’s overall relevance to the season was not exactly as full-fledged as it could’ve been.\\n\\n\r\nA particular support character I do want to focus on is Hamazura Shiage. Previously an antagonist in the Skill-Out Arc in the previous season, he is involved as one of the “good guys”, especially during the dreadfully adapted Battle Royale Arc. Because of the shift to him playing as a protagonist, character development for Shiage was absolutely necessary to give more meaning to his actions. However, to the aforementioned issues with the said arc, Shiage’s imagery in the adaptation seemed more like an idiot shifting between wishy-washiness and recklessness. He is neither as idealistic and compassionate as Touma, nor as bloodlusted and insane as Accelerator; in this way, he can be considered as a medium between the two. He has an obvious inferiority complex due to being branded as a powerless individual and not having esper skills himself, hence his previous involvement in the Skill-Out Arc. While he does get notable character development within this part of the series, it just seems so rushed and without enough context behind it to be considered properly managed. The show basically displayed his change as if it was propelled solely via the virtue of his growing feelings with a barely memorable support character (at least in the Index story), Takitsubo Rikou….and I’m not sure if that’s how a well-written character is supposed to experience progression.\\n\\n\r\nAll the other returning support cast members barely get much highlights unless they’re heavily involved within a particular arc. While the previous seasons, due to their better sense of pacing, gave them more reason to pay attention to and be attached to them, this sequel didn’t really do them much justice. They’re just there cause the story sorta “obligated” them to be present. Itsuwa, one of those particular support characters, started out her reintroduction with developing her feelings for Touma, and while she’s considerably much nicer to the latter and arguably a better female partner for him, she never truly got much shine outside the Constantine and Acqua Arcs. \\n\\n\r\nOn one \"dual-colored\" note, while Accelerator himself was a rather enjoyable character due to his nature and did get a significantly more prominent spotlight and better characterization during this season, his role is still mostly overshadowed by the chaos of the events going on around him. \\n\\n\r\nIn short, overall, a bunch of wasted products in the character department.\\n\\n\r\nENJOYMENT:\\n\r\nI’ll be quick to the point. I started out really enjoying it for the first few episodes. The first episode really had me optimistic, especially with one of my favorite gags where Misaka gets upset at Touma, fires her electrical powers, and Touma blocks it with his Imagine Breaker. It was always SO nice to see the two’s interactions and dynamics, as they were more common and meaningful in the previous seasons. Unfortunately, we don’t get much of that all with the third season. Sure, Itsuwa played as a nice substitute, and the return Kanazaki’s tsundere behavior due to her OWN feelings for Touma (from way back in season 1) was something to give credit to in terms of enjoyment value, especially for me, personally…but in the end, those were still simply flauntings of rather unnecessary fanservice made just for the fanboys.\\n\\n\r\nAs for the serious parts of the story itself, it was an absolute pain to watch. I’ve mentioned those issues already; rushed events, poorly animated fights, jarring CGI, characters being introduced left to right that it’s hard to catch up to or consider them as something important. It’s a mess that I tried my best to stick with and be optimistic about. However, with the handling of the British Royal Family Arc, where the main purpose of the segment and Touma’s intended involvement was severely downplayed, it became so clear that the show is literally going nowhere in the right direction. It was literally like watching your birthday or homecoming party getting crashed by a bunch of drunk idiots. Considering that J.C. Staff was also handling the third season of Date A Live at the time, and how horribly it turned out, it became all the more obvious that, regardless of what financial reasons or justifications, the studio just tainted its own brand by not being able to hire a proper team of staff members during the production of this show. I’m honestly disheartened because in the past, J.C. Staff produced plenty of other good shows in addition to the previous two seasons of Index as well as the two Railgun seasons. While I can’t say it was like a hated chore, it still felt laborious to watch.\\n\\n\r\nOVERALL:\\n\r\nConsidering how we waited for years for the third season, and to receive a spoiled meal like this, Toaru Majutsu no Index III is the one of the more disappointing sequels in the recent years of anime. This season clearly needed more than just 26 episodes, and in the end, it was simply a rushed school project like Date A Live III and both TG:Re seasons were. To be honest, I wished this season was given more time to work with so that events, characters, and themes are played out and executed a lot more properly than what was showcased here. At this point, I’m highly considered to hit the light novel books for the first time and start from the very beginning, provided I find time for that. \\n\\n\r\nUnfortunately, for this season, it was simply something unable to follow up on the series’ previous accomplishments. I now pray to God, Christ, Arceus, whomever is up there….that the new Accelerator anime and s3 of Railgun don’t fall victim to the dreaded plague of JC Staph Infection as well.\\n",
            "date": "2019-04-05T08:30:00+00:00",
            "helpful_count": 23,
            "mal_id": 305525,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=305525"
        },
        {
            "content": "It’s been eight years since the previous season of Index, and six years since I started watching anime. Index was one of the earlier series that I saw, and at the time I really enjoyed it. However, a lot has changed in my life since then, and I’m not the same person I was back in 2013. I’ve been looking at this third season as an opportunity to reevaluate the series, and unfortunately, it doesn’t hold up under scrutiny. Many of the preliminary reviews suggest that this dissatisfaction is purely with the quality of this particular adaptation, but I feel the source material isn’t blamelessin this matter.\\n\\n\r\nFirst off, I’m going to talk about the author of the series, Kamachi Kazuma, who is best known for the absurd rate at which he puts out light novels. A while back, there was a period of over two years in which he managed to release a volume every single month, and though he has slowed since then, his publishing speed is still well above just about anyone else in the industry. This rapid release schedule is a powerful tool for increasing audience engagement, since there will almost always be a new release to keep him fresh in mind, and it also generates pressure for readers to stay up to date or risk falling behind.\\n\\n\r\nHowever, while this model was no doubt successful in getting his work acknowledged, it is also to the detriment of its quality. For some arcs, it feels as if Kamachi was only putting something out for the sake of it, and not because it contributed to the overall narrative. Some of the middle arcs in this season drop a lot of information on the viewers to keep track of, but end up hardly mattering to the main plot. There’s so much going on, and a lot of it doesn’t amount to anything.\\n\\n\r\nAnother product of this release schedule is how the powers have been simplified over the course of the series. I still think that Academy City is one of the coolest settings in any anime that I’ve seen, but only because of how unique and thought-out all the different powers that occupied it felt initially. But as the rate of releases accelerated, this deliberateness was lost. Gradually, the new abilities introduced have become less interesting, and even the application of existing abilities has become less creative. This is best illustrated through Vector Change, a power which is limited only by the imagination of the user. Accelerator’s greatest strength over the first two seasons was the flexibility of this ability, but now he primarily uses it as a force field and those dumb tornado wings.\\n\\n\r\nBut yes, I’m not going to disagree that this adaptation is rough. This season covers the last nine volumes of the original light novel, which is a lot of material to cover (for reference, the first and second seasons covered six and seven volumes, respectively). A lot had to be cut to fit everything into 26 episodes, and the gaps are apparent. The biggest casualty of this is the characterization. It’s a frequent occurrence that the villains from previous arcs return as allies in new arcs, though the process by which their allegiances shift is often unaddressed. This material ties in with the series’ main theme of great strength coming from the unification of different perspectives, but it doesn’t get the attention it deserves. The show ends up having an impressive ensemble cast, but with all the material that has been removed, any episode that tries to follow too many of them comes across as completely incoherent.\\n\\n\r\nIt’s always interesting to revisit media you’ve consumed in the past, and see how your opinion has shifted on it over time. Unfortunately, Index doesn’t hold the same appeal that it used to, but I’m still going to try to end this review on an optimistic sentiment. We’ll also be getting a third season of Railgun this year, which has always been my preferred side of the franchise. I plan to cover it as well, and I choose to believe that it won't let me down in the same way.",
            "date": "2019-04-05T07:19:00+00:00",
            "helpful_count": 21,
            "mal_id": 305517,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2578639.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RiverRode",
                "username": "RiverRode"
            },
            "url": "https://myanimelist.net/reviews.php?id=305517"
        },
        {
            "content": "What happened to this show? The first 2 seasons were pretty good, you knew what was going on, why people were doing things and the arcs felt fleshed out. Season 3? \"Naw bro, you gotta read the books to enjoy the show.\" NO! That's not how it's supposed to work, the viewer needs to know what is going on while readers get to enjoy nuance and animated fight scenes they imagined. \r\nThis season is a waste of time. I hate what they've done. I hate that I've wasted 6 hours on it and I hate that they'll probably ruin Railgun too.",
            "date": "2018-12-23T01:07:00+00:00",
            "helpful_count": 18,
            "mal_id": 296584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SuperCheese88",
                "username": "SuperCheese88"
            },
            "url": "https://myanimelist.net/reviews.php?id=296584"
        },
        {
            "content": "After careful analysis, I’ve come to the realisation that the guys in J.C Staff want  Toaru Majutsu no Index III to give Tokyo Ghoul re: a run for it’s money for the worst adaptation in recent years!\r\nIndex season 1 and 2 were relatively decent, however season 3 is a complete trainwreck. J.C Staff are trying to adapt so much this season, that they crammed too much in each episode, causing it not to flow cohesively anymore. \r\nThey skipped a lot of content from the Light Novel, as a result the story is extremely rushed and most anime watchers don’t know what the hell ishappening.\\n\\n\r\nIndex III has a plethora of problems: the bad direction, poor animation, unexplained plot points and plot holes. The story bouncing from different groups of characters without giving us enough time for events to sink in or get acquainted with the characters. Inner monologues are being cut out. Characters are constantly teleporting from one scene to another, the villains motivations are vague, there’s meaningless deaths and stupid organisations like: ITEM, SCHOOL, BLOCK, GROUP, MEMBER fighting for unclear reasons. \\n\\n\r\nHonestly, I gave up trying to understand what’s going on in the story because it’s been confusing and hard to follow. I’m only watching to complete it now. \\n\\n\r\nTouma is still the same as ever. Lecturing his opponents how they’re wrong and he’s always morally right, until they become dumbfounded as he proceeds to punch them in the face.\\n\\n\r\nIf you’re a Misaka fan then prepare to be disappointed because Misaka barely anything for the entire season and when she eventually does get some focus it’s only for 2 mins at the end.\\n\\n\r\nAccelerator remains the best part of Index. His character development into a hero is amazing and watching the lengths he goes to protect Last Order is a joy to watch.\\n\\n\r\nTo make matters worst, Hamazura becomes on of three MCs along with Touma and Accelerator this season. I despise Hamazura with a passion because he’s like a bland, discount version of Touma. I don’t know why Hamazura gets so much screentime when nothing he does is plot relevant. I don’t care about his goal to save his girl. He’s blantantly protected by plot armour and the guy can’t do anything without plot convenience or enemies being dumbed down to save him. This is why you don’t make a fodder civilian a MC because he’s just boring to watch.\\n\\n\r\nMugino acting like a cartoony evil, psychotic bitch annoys me.\\n\\n\r\nEvery episode I’m left with more questions than I am answers.\\n\\n\r\nThe message of Index III is “read the light novel if you want to understand the story”.",
            "date": "2018-12-28T10:34:00+00:00",
            "helpful_count": 11,
            "mal_id": 297205,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 1,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=297205"
        },
        {
            "content": "And So the Index franchise is back with another season,  at the time of the review the 9th episode had just finished airing so without further ado let's get in with it.\r\nI love it !! The first thing I loved about the third season is the stakes, this season is a direct follow up of Index ii so we all know the God's Right seat are the villains this time around. It starts off with Touma facing off against them as always but what I particularly like about this season so far are how multiple protagonists are popping up. In fact, I think thisis the first time we have so many character perspectives in a single season. FYI this season alongside Touma we are getting two new protagonists, Accelerator and Hamazura.\\n\\n\r\nThere's, of course, the usual amalgamation of pacing problems, completely new characters that end up fighting and killing without any explanation. The character introduction scenes have been cut short is what I can tell as an Anime-only viewer. Particularly if you ask me the episodes 4-6 were a mess, but if you are the kind of viewer who follows every single dialogue like me then it isn't much of a problem as the essence of the arcs are conveyed. However, I will suggest reading the Light novels if you want to enjoy this season as that's what most of the LN readers have said.\\n\\n\r\nCharacters: To Aru's strong point has always been its characters and it has plenty of those.\\n\\n\r\nArt: 7 is the best rating I can manage, either JC Staff is lazy or they are just not invested in Index III.\\n\\n\r\nEnjoyment: 8, if you are okay with a few unexplained details I'm sure better arcs are coming up!\\n",
            "date": "2018-12-02T00:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 295098,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4968063.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeOracles",
                "username": "AnimeOracles"
            },
            "url": "https://myanimelist.net/reviews.php?id=295098"
        },
        {
            "content": "It has finished and I felt like I should make a review (just so it wouldn't be crowded with just negative reviews). So here we go:\r\nThe story for Index III isn't that bad. Personally I didn't think that it was rushed nor did I thought that it was confusing. Index has always been like this when if you don't pay attention there is a high chance in which you would be lost. Though I do admit that plenty of things were explained a lot better in the novels but this isn't a review of that but more as if I were an anime-only watcher.\r\nThe artis fine. Like the characters do look different from each other. But the only reason why it's a 6 in this category is because I know it could have been done better as some of the CG wasn't that great (I'm looking at you tornado wings) and that sometimes the characters can look off-model.\\n\\n\r\nSound wise it is quite good. The voice actors feel like they did a really good job and gave me performances I wasn't expecting to hear (like Mugino and Misaka Worst for example). The OST was pretty good though a nitpick I had was that an emotional scene could have something that would fit an exposition scene for example.\\n\\n\r\nOf course like any anime there has to be good opening and ending themes to go along with it to help with the experience and I'll start with the openings. While I do really like Graviation, I feel like it overstayed its welcome a bit more than it should have. And as for ROAR... I feel like it is the most visually impressive of all the ops in the Index series (even if the \"Engrish\" can sound weird during the chorus).\\n\\n\r\nAs for the endings... well it is hit or miss just like the other eds in the series. ED1 might be my least favorite of the endings mostly for how forgettable it is while I will be able to remember ED2 pretty well even if I am not sure if it fits the WW3 arc...\\n\\n\r\nOne of the things that I always liked about Index would be the character cast and how well they interact with each other and the situations that they get in and it didn't disappoint me this time around. Though just don't expect Misaka to do much as there's always Railgun 3 coming up and Accelerator is just Accelerator doing his own thing.\\n\\n\r\nAnd while I would like to continue talking about the cast... I shouldn't really be going to spoiler material (hence why this section might be the most vague of them all).\\n\\n\r\nNow I don't think Index III is anywhere close to being a butchered adaptation compared to something like Date A Live III or even Hyakuren no Haou to Seiyaku no Valkyria. Instead I see this as a flawed adaptation but that didn't meant that I didn't enjoy myself. In fact I thought it was a really nice ride getting through this weekly as there were plenty of moments that I was glad to see getting animated.\\n\\n\r\nI am not here to make you change your mind as I am perfectly fine with you being disappointed with the way this series turned out and if I had to say one thing about this season it would be: I am glad that it exists.",
            "date": "2019-04-05T09:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 305532,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6105995.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fullmetalmasify",
                "username": "fullmetalmasify"
            },
            "url": "https://myanimelist.net/reviews.php?id=305532"
        },
        {
            "content": "This review is **SPOILER FREE**\r\nThe ToAru franchise has caught me by storm back when I started watching anime. It just had this certain \"something\" from the getgo, that kept me entertained. I couldn't express how excited I was when I heared about all the news about the new anime adaptations coming in 2019: so then, why am I so disappointed?\r\nSidenote: I've seen the entire ToAru franchise (5 seasons including the new \"ToAru majutsu no Index III\" (up to episode 19). I've rewatched the previous installments multiple times, both in release order and chronological order and I've bought all the source material (Lightnovels + Mangas). Iknow what I'm talking about when I say that this season wasted pretty much all its potential so far.\\n\\n\r\nThe ToAru Franchise takes place in a world, where magic and science have long both been part of our daily lives. One much more than the other, as the magical side tends to work hidden rather than open. In the most advanced city in the world \"Gakuen Toshi\" or \"Academy city\" millions of students live in \"peace and harmony\", where they train their supernatural powers as espers. However, the mascerade of this city is nothing more but a construct of illusions: Human laboratories, clones, warfare and abductions as well as murder all take place in the darkest places of this brightest city. Its a world doomed by the illusion, that with great power, great responsibility follows and that people will use their power to protect those, that can't do it themselves. Its sadly an Illusion, that Touma (male protagonist) has to destroy. Sacred with the mysterious power to negate any supernatural force by simply touching it with his right arm, the \"Majutsu\" branch follows his daily life as he keeps getting involved in these dark, brutal things that take place in this city and how he has to give it his all to fight back and protect those that are close to him.\\n\\n\r\nThe ToAru franchise is filled with intruiging plots and sidestories that all come together to one big clash. Again and again. No matter how weird it seems, it always ends up in something way bigger than you originaly expected. This however is sadly also why the anime adaptation of this genius series often sucks ass. Excuse my words.\\n\\n\r\nDue to the sheer size of source-material and its complexity, a H U GE part of the entire narrative gets lost in its adaptation - even with 24 episodes per season. Some arcs may be lighter than others but in general you'd need at least 10 - 12 episodes per arc. Often times sadly they get broken down in 4 - 6. \\n\\n\r\nStory: 5\\n\r\nThe story itself would get a straight 10/10 from me. But sadly the series cuts so much material that its just confusing - even after you read 17 goddamn lightnovels about it. \\n\\n\r\nArt: 7\\n\r\nIt looked pretty decent in the beginning but it suffers from its rushed nature and often times you have a very neatly animated clash only to be followed by a static close-up battle and an \"evil explanation of why they have to destroy the world for the greater\" for 5+ Minutes (once again, its just too rushed...)\\n\\n\r\nSound: Oh lord. I loved the new sounddesign, instantly felt in love with it when the first episode aired of this new season. It also has a lot more epic OST and some absolute banger OPs. So why not 10/10 or at least 9? Simply because there are some soundtracks that are nice to listen to - maybe for 20 seconds. But you'll hear the looped for the entirity of 5 minutes whilst someone has a monologue about their motives and past. \\n\r\nThe VA did an amazing job - especially \"Accelerator\" is just insanely (hehe~) talented ;)\\n\\n\r\nCharacter: Standart bunch of okay characters. Could've been a lot better but pretty much all their detail gets lost - once again - in its rushed nature. \\n\\n\r\nEnjoyment: 10/10 cause boi, why would I spend 500 Dollars on source material if it ain't good? Its my fravourite series of all time and I'd love to see it come alive as an anime more lively. But this installment just falls flat because it cuts so much source off and keeps having very blunt moments stretched out to eternity. \\n\\n\r\nOverall: 7\\n\r\nYeah. I'd love to give it a higher rating but this season falls very flat compared to the previous ones (especially considering that the sidebranch \"ToAru kagaku no railgun has a waaaaay better anime adaptation)",
            "date": "2019-02-19T06:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 301984,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5580758.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Arglos",
                "username": "Arglos"
            },
            "url": "https://myanimelist.net/reviews.php?id=301984"
        },
        {
            "content": "for the first time, I was disappointed with the anime to aru project adaptation. after I can enjoy the stories of season 1 and 2, movie, and to aru railgun series. In this season 3, the Aru Majutsu Index is a failure. that many stories must be spent in one season, even forgetting the habit of adaptation in 24 episodes to 26 episodes. almost all the strongest characters appear in this season. but they don't seem to have a role at all. the epic battle scene in the opening song looks like a cat playing thread balls in the anime, there is no scene thatshows it is a fierce battle. many scenes such as landings, punches, shots, ambushes, which were very failed to make the scene, for example the episode of Touma tried to jump several times to hit Fiamma, when pushed aside he was not thrown backwards but he landed in his original place. even though the jump distance is far from the logic it should fall. fiamma as super vilain does not show him at all strong, as a criminal he is so easily frightened, just like a street person who happens to find strength. especially in the last episode. The epic battle that is awaited waiting has never happened in season 3. Why can't it make a fight like Touma fight the first accelerator ?, or Misaka against ITEM on Railgun ?. is it just that fiamma ability? only ordinary people can chant and use their hands on their backs? a character who looks like this does not deserve the ambition to control the world. I hope similar things don't happen in the series accelerator or railgun season 3. Don't break the good story again with a messy anime adaptation.",
            "date": "2019-04-08T05:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 305753,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6722789.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DNGlist",
                "username": "DNGlist"
            },
            "url": "https://myanimelist.net/reviews.php?id=305753"
        },
        {
            "content": "As someone who has watched all seasons of A Certain Magical Index and A Certain Magical Railgun quite recently, I was left confused by this third season, and think it is a shame to see it decline. I can't imagine recommending this to someone who wasn't already a big fan of the anime series at least, and I'm sure even fans of the manga would be frustrated and perplexed after watching this adaptation. I don't like to disparage anime, but this was a mess of a show. Foremost, there were far too many characters being introduced to keep track of on top of the alreadyextensive cast, which resulted in each character getting an insignificant amount of screen time for them to really develop. Not only that, but with the collision of both the \"science\" and \"magic\" sides, there were simply too many rules and deus ex machinas out of left field. The anime expects the viewer to accept and understand the events that are happening on screen, despite their incoherence, and because of that, much of the scenes lack impact. Especially later in the anime, during the major action scenes, there was inconsistent, questionable animation quality, although the action scenes really could look swell at times. The OST was forgettable, but at least the sound effects and voice acting were what we have come to expect from this series. I'm not sure how well the series will be able to recover from this season.",
            "date": "2019-04-06T04:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 305598,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6716388.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AngryCactus",
                "username": "AngryCactus"
            },
            "url": "https://myanimelist.net/reviews.php?id=305598"
        },
        {
            "content": "Toaru Majutsu no Index III or a certain magical index III has  been  full of anticipations  and excitement as the previous season end was foreshadowing the events that were about to come since this is the climax for the old testament (which is this season), however it is starting to turn into an anticlimax..., Let's start of with the story\r\nStory: 3/10\r\nAlthough this was adapted from the novel (which is probably the best novel i have ever read), It has been executed very poorly through the first half of the season and i bet it's going to continue like this through the end,now you ask if this was deliberate i would say yes, if you ask why the answer is simple: JC staff doesn't care about the story i mean they are omitting the necessary parts of the dialogue such as the details that are mentioned in the story(LN) that make up most of the plot,  Its like all they care about are fan service: such as panty shots, jokes and etc etc... ok i would say fan service here and there is fine but too much of it start's to make the viewers watching experience boring (especially those viewer's who wanted to see some substance in this anime ). JC staff think's that they might lose views cause they think that majority of the viewers only care about the fan service. Overuse of  fan service has plagued the anime industry as people think this a better way to earn more cash. It definitely doesn't encourage people to switch on their brains while watching, sad... and they are definitely rushing it\\n\\n\r\nArt: 5/10\\n\r\nOk seriously i wasn't expecting movie animation but this this way below s2 art let alone railgun SS,\\n\r\nHow did they mess up here, the cg is terrible. Some  Part's of the scene (cg):  from accelerator vs a certain powerful villain was almost crap, I mean what was black thing accelerator was using on the villain, It was never seen in the previous season and it was definitely not some new power(also vector's used the previous season never emitted that dark thing or anything at all (please note here i am not talking about his wings),  Kanzaki face when she was battling a certain  knight leader was crap not much hard efforts put what so ever, Now they did  have some  good  animated parts but i feel that some of the important parts were made a mess of \\n\\n\r\nSound: 6/10\\n\r\nToma's imagine breaking sound while using it has changed, accelerator attack sound effects used were new but some what ok and the ost can hardly be remembered and was definitely not catchy\\n\r\nThe opening, first and second end song were ok but i doubt the second end song is memorable\\n\\n\r\nCharacter: 7/10\\n\r\nThe reason i gave this score is because of the addition 1 more protagonist hamazura, also misaka continues to be a side show and keeps on acting like a tsundere, guess her time to shine is in railgun S3  -_-\\n\r\nToma continues to be toma, with misaka no longer in the protagonist picture (cause she does almost nothing) hamazura, accelerator are the only one's to see in action. Toma is not so annoying but speeches about being righteous are nothing but boring. Accelerator and Hamazura are playing a good role, but it's painful to watching this rating go down just because the story(anime) that destroyed their development as a character on the contrary the LN did a better job in portraying their character especially hamazura who is way better than toma  (-_-)\\n\\n\r\ni wouldn't say anything to index cause there is a chance she might get involved, but  up till now not much\\n\\n\r\nEnjoyment: 2/10\\n\r\nCurrently it on the crap level and i doubt its going to improve, definitely didn't enjoy this\\n\r\nI wanted to give this a 1 but i still have some respect for this series as a whole\\n\\n\r\nOverall: 4/10\\n\r\nIn the end it's come to only one conclusion this season is the one of worst anime to be ever adapted from the best novel, The best story was given to JC staff on the platter but they just made a mess of it.  My advice: don't watch or watch (if you think they can change the current cluster fuck situation) such misfortune.....\\n\\n",
            "date": "2019-01-31T07:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 300479,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7771316.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rogue_Player",
                "username": "Rogue_Player"
            },
            "url": "https://myanimelist.net/reviews.php?id=300479"
        },
        {
            "content": "A train-wreck that I cannot stop watching.\r\nSeriously what is going on? I didn't read the novels but I can tell for sure that a lot of content was skipped. The objectives are hardly ever made clear, and even if they do, somehow they find a way to rush it or make it so cheesy that I swallow my own vomit. \r\nThe art, the animation, the music are well done. And when they want to make it look good, trust me they make it look really good. The music is the typical Index type music we all know, nothing amazing but gets the job done well.\r\nTheshow is just a big disaster but yet I cannot stop watching it. Perhaps its the concept of everything that makes me want to watch it. Because if you look at the franchise as a whole, the plot is really interesting. A war between science and magic? Hell yeah that's cool. A power system that is made through real world physics? Why the hell not? And an internal, political power struggle between the higher ups and the ones below them? Count me the hell in. And yet, the show does nothing with that. The plot is good, but the execution is so bad that sometimes it makes me sad, because I wonder, how awesome would this show be if the people at J.C Staff actually gave a shit about the plot.\\n\\n\r\nThe war is carried out in such a boring way that it feels like they're making me do a Try Not to Sleep Challenge. The interesting power system is kept in the side in this season and more focus is put on the \"just because\" element of magic. And oh man the power struggle can make no sense at all some times. I'll give credit to some of the characters. Accelerator is carrying the show because of how interesting he is, and Misaka's is still charming in her own quirky way but man I wish she had more screentime. Touma and Index are... boring. GROUP as a whole are very fun to watch even if I can't understand a lot of what they're doing.  \\n\\n\r\nThe problems in this season is nothing new to anyone who has been following the main Index series, but it's like they went Plus Ultra with the problems this time. If you're someone who has been following this series for a while, you'll still watch this even if you know the problems. If you're a casual fan who recently got into this franchise you'll probably will drop this after a few episodes. And if you're new to the franchise and are thinking about if you should commit fully to this franchise, eh.. go ahead? But know that its hard to get into. I myself am going to read the novels from now on to understand wtf is going on.",
            "date": "2019-01-27T03:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 300150,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6440278.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Meren",
                "username": "Meren"
            },
            "url": "https://myanimelist.net/reviews.php?id=300150"
        },
        {
            "content": "I really liked how this series started. I meant the whole To Aru series, including side stories like Railgun. This is due to how fascinating the world adapts to people with \"Abilities\" how the whole story revolves around those. But sadly this series just made me lose interest on the whole thing. I find most episodes \"tiring\" to watch as there's so many random characters that probably showed up on the prequels and it's like it's expecting me to know who they are and what they did in the story. I'm partly at fault because the anime is there, so I should watch it, right?Still, I try to go to some sites to read up on these characters and as I do, I just get more confused and it spawns questions causing me to read up. In the end, I am more confused than I started out with and I spent more time than the 24 mins of episode just reading.\\n\\n\r\nThe plot became quite convoluted that I don't really know what's happening aside from Touma using his hand to fight \"bad guys\" that after a few episodes, would be his allies/lovers. This will probably the last of the series I watch.",
            "date": "2019-04-07T03:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 305678,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4578340.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/-ShInIgAmIsAmA-",
                "username": "-ShInIgAmIsAmA-"
            },
            "url": "https://myanimelist.net/reviews.php?id=305678"
        },
        {
            "content": "Index has suffered the poor fate of being created created by J.C Staff, and you can tell at first glance that this was nothing more than one last cash grab before the studio goes bankrupt. This is evident from the very start, and you can tell that the team behind this couldn't give a damn about the quality. Seasons one and two were also made by J.C Staff, however with a different director and actual budget. However when looking at an anime what really matters is the story, and this was the one chance of redemption Index season three had. So was the story good?Well yes and no, the story was definitely there except you'll find yourself asking yourself what is happening time and time again.\\n\\n\r\nThe Toaru Majutsu no Index light novels are among my favourites of all time, and this is because story and everything that happens in the universe of Index. All around the world of Index many plot holes are constantly unfolding and it really helps the world come to life. The universe Index takes place in is big enough to earn itself 2 Spinoffs, one also receiving three seasons. Index season three is the best example of everything the world has to offer, especially in the final arc where an entire WW3 breaks out where we get to see almost everyone from earlier episodes play a role.\\n\\n\r\nAfter all the praise I'm giving to the story it might not sound that bad, but watching it unfold in the anime is the most hellish experience one can have. Not only is it rushed to the point where over half the light novel scenes get cut out, inner dialogue is cut out and overall nothing makes sense. The light novels for Index are packed with important details and information which are barely scraped in the anime. Even as someone who has read the novels this is incredibly hard to follow, and everything that happens feels like it serves no real purpose.\\n\\n\r\nI'm not about to hate on an anime because of the art and animation, but when the first season that aired back in 2008 looks better than this there is a serious problem. half of this anime consists of either still shots or some of the most derpy looking movement I've ever seen. If the animation team can't even get still images right you can only imagine what the fights look like. I liked the fights in both Index and its spin-off Railgun because of the unique set of laws of both magic and science used in the fights. Index three is no different, sticking to the same principles as the precious seasons, just this time a lot uglier. We barely even see these amazing abilities being used to their max potential, as the team behind this anime takes the cheap way out and ends most fights  with a Touma-punch to the face before any real fighting starts. Despite the crappy animating I can proudly give praise to the background tea because damn do th backgrounds look good. The background team in my opinion is highly overshadowed and the work goes to waste with the trashy art over it.\\n\\n\r\nAnother thing I love about the universe of Index are all the characters. Season three has multiple characters with high importance, and all their ideals are constantly clashing. I'll try to summarise a few of them from the eyes of a light novel reader\\n\r\nAccelerator- By far best boy. Not only is he badass, he gets some amazing through the many volumes he is in. He started as a killing machine with a sweet ability, but slowly learns to love and protect as well.\\n\r\nTouma- Touma Kamijou is supposed to be the main heroine of this series. He can negate all supernatural powers with his right hand, and solves most his problems by punching people in the face. Not the greatest character of all time, but makes for a nice protagonist.\\n\r\nHamazura- A level 0 with no abilities. I find his character annoying but he is essential to the plot. He is part of a group named GROUP (ironic I know) which become necessary later down. Hamazura isn't necessarily a main character, but not really a side character either.\\n\r\nMisaka- Best girl by far. Also known as Birbiri she is a tsundere with electric powers. A perfect combination and good waifu material ( if you don't mind being electrocuted).\\n\\n\r\nRemember, that was in the light novel. But what about the anime? The characters mentioned above still suffer from the same issues as the story; they are rushed, boring, and their actions make no sense. There are also many side characters with the same issues and everything becomes a nonsensical mess. Everyone's personalities and traits are highly different from the novels and don't match up with the first two seasons at all.\\n\\n\r\nOne thing I can safely praise are the soundtracks and openings. The music is intense and sounds amazing, but sometimes doesn't match the themes of the current scene. As for the openings, they are amazing. opening two, Roar, has some great visuals and fights, as well as an amazing song. A shame the quality doesn't hold up for anything else though.\\n\\n\r\nThe only way you can enjoy this pile of trash adaptation is if you have read the novels. Once you understand everything the choices and decisions that are made begin to make a bit more sense, however if an anime is difficult to follow from the very beginning then it fails at every job it had. I highly recommend the novels or spin-off to get the full experience of the Toaru universe.",
            "date": "2019-04-06T00:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 305589,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7523460.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gilliesss",
                "username": "Gilliesss"
            },
            "url": "https://myanimelist.net/reviews.php?id=305589"
        },
        {
            "content": "Ah, alright. Let's do this. \r\nStory: 7/10. The story CONCEPT is really cool. The execution.... heh. We'll get to that later. \r\nArt: 5/10. I'll admit that I'm no expert on anime artwork. But even I could tell that this seemed.... a bit lackluster? And others appear to have agreed. \r\nSound: 7/10. I'm actually not as peeved about the sound as some other people are. I thought it was fine, and had some good moments. \r\nCharacter: 4/10. Oh boy. Here we go. Look, the main characters who we ACTUALLY care about are lovely. Touma, Index, Mikoto, Accelerator, Hamazura, Kanzaki, Itsuwa, Stiyl, Tsuchimikado, Kuroko, Uhiharu, Last Order,Miguno, Misaka Worst, Fiamma, Crowley,.... And I'm sure that I'm still missing some others. Now, you might be thinking, \"Wow! That's a LOT of characters! Surely, they can make a compelling story from that alone!\" Hah. Yes, maybe in the first two seasons, that was somewhat the case. But in Index III, there are tons of new characters introduced in very quick intervals, and many of them hardly get any explanation or are killed off almost as soon as they show up. By the end, your head is spinning trying to keep track of who's who and who's fighting for which side and what the motivations are. And that leads me to.....\\n\\n\r\nEnjoyment: 5/10. This is going to seem more like a continuation of the 'character' category, but there's a reason for that. The storyline is enjoyable in concept, and would have probably gotten at least a 7 or an 8 out of 10 from me, if not higher. But its *execution* with its characters is just.... yuck. I already mentioned how this show likes to throw more characters at you than you're able to shake a stick at. But furthermore, half of their motivations are hardly even explored. Now, this might not be the end of the world, except for one teensy little problem. This anime has made a staple out of bad guys being redeemed as good guys CONSTANTLY. Well, it's not very enjoyable when a bad guy just suddenly does a 180 degree turn and starts fighting for the good guys for no real descernable reason. When there is little to no exploration as to WHY the bad guy's motivations have changed for the better, it just comes off as confusing and cheap. Plus, people like Touma are always just punching people and giving them little pep- talks which seem to change everything in the course of 30 seconds or less. The first two seasons seemed to just barely keep this in a reasonable balance which kept it right below the threshold of absurdity. But this 3rd season just blew the freaking lid off. \\n\\n\r\nOverall: 5/10. I still love this franchise. And for that, I'll rate it as 'average' instead of anything below average. But I'm sure as hell not going to put it above average either. This season was so unbelieveably rushed, with so many characters and arcs flashing before your eys faster than you can even comprehend what's supposed to be going on. Many folks seemed to have been fairly lost this season, me included. Add to that the fact that even our beloved staple characters, let alone the side characters, seem to just be doing random stuff all the time and switching between good guys and bad guys at the drop of a dime, with no real explanation of WHY their motivations have suddenly done a 180 turn in 30 seconds.... yeah. No. \\n",
            "date": "2019-04-05T15:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 305551,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7912687.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Elisile",
                "username": "Elisile"
            },
            "url": "https://myanimelist.net/reviews.php?id=305551"
        }
    ],
    [
        {
            "content": "Watching this anime is very painful.\r\nBack in 2016 I've heard, that Toaru Majutsu no Index is very good light novel, so I've decided to watch the anime adaptation .After watching first two seasons of TAMNI I was wondering \"this is at most decent, why is it considered a very good light novel?\", so I've decided to try and read it. I don't regret this decision. Toaru Majutsu no Index is the best light novel I've ever read. And I'm not overrating it, I loved almost everything about it. Besides La Regina del Mare Adriatico Arc, even in light novel it isn't good. I've read wholeOT in about a year, and then started NT, which in my opinion is worse than OT and I never ended it.\\n\r\nAfter I heard that there will be 3rd season of Toaru Majutsu no Index I was scared. I know J.C.Staff very well and I was sure that they will ruin it. But this is even worse than I imagined. But let's start from the beginning\\n\r\nStory: 9/10\\n\r\nEven if it is executed poorly, it's still the story that I love so much. \\n\r\nArt: 5/10\\n\r\nAfter I heard about 3rd season I thought that it will have similar art to that in Railgun S. Wrong. It's even worse than in previous season, but maybe a bit better than in first. The fights could have been epic, but they aren't. I thought about rating it even lower, but I've seen anime with worse art than this, so I won't do it\\n\r\nSound: 8/10\\n\r\nSoundtrack is good, it fits this series and I like it. After it comes out on youtube I'm sure that I will add it to my playlist \"Favourite Music\"\\n\r\nCharacter: 3/10\\n\r\nInner thought of characters from light novel are cut off. Because of that the characters lack depth and I can't identify myself with them. And I'm not only talking about supporting characters, even the main trio is bad. I really liked Hamazura in light novel, I felt he is very similar to me, but I don't feel the same in anime. I hate this anime because of it, characters were the strong point of TAMNI light novel series, but in anime adaptation they're the bad point. \\n\r\nEnjoyment: 2/10\\n\r\nAs I writed in the beginning. Watching this anime is painful. It's so painful that every episode I think about dropping it. But I'm still watching, only because I still had hope in J.C. Staff, that maybe when one of the best arcs in the whole series starts up, it will be adapted properly. But after watching episode 6 I think I'm done with it. I'm dropping this series.\\n\r\nOverall: 3/10\\n\r\nGood job J.C. Staff, you ruined one of my most favourite series. I wish that season three would never come up, or that other studio would animate it properly. You had very good source material, how could you fuck this up. I'm done with you, it's my last time I ever watched something made by you. To the people who are only anime viewer - read the light novel, I'm sure you won't regret it. But do it before you watch the anime, because it will spoil the best of it in the worst way possible.",
            "date": "2018-11-09T14:20:00+00:00",
            "helpful_count": 102,
            "mal_id": 293702,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4512346.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Kuba4ful",
                "username": "Kuba4ful"
            },
            "url": "https://myanimelist.net/reviews.php?id=293702"
        },
        {
            "content": "“Disappointment is a sort of bankruptcy – the bankruptcy of a soul that expends too much in hope and expectation”. – Eric Hoffer\r\nWatching Index Season III is like procrastinating a school project where hope seems lost with you clinging onto a tiny bit of hope that somehow, someway, everything may be ok. I began watching Index since 2011 and got into the light novels around 2014. While the first two seasons certainly had its share of flaws, both series managed to capture a good deal of concepts that I applauded for. It’s not easy to craft a story with so many characters, conflicts, and intersectingstorylines altogether in a complex system of magic and science. Here we are in 2018-2019, and we are gifted for the long anticipated third season. And with my sincere and deepest regret, I proclaim Index III as a disgraceful abomination.\\n\\n\r\nI remember watching some of the Dengeki Festival events in the past few years. Every time, it seems we are so close to the Index Season 3 announcement, it ends up with a tease of “please, just wait a little bit longer!” The long wait ended on September 30, 2017. I jumped in joy realizing that the dream came true and we are finally getting a continuation. It didn’t take long for the show to announce its airing date either just a few months later. Flash forward to Fall 2018 and here we are, the first episode of Index III. What aired on TV seemed like a miracle at the time with many familiar gimmicks. We are reintroduced to level 0 Esper, Touma where he is still unlucky as ever. After getting bitten by Index and running into a slew of misadventures with other characters, it seems the show had a flow going. It also didn’t take long for an ominous feeling to settle in with the realization that the God’s Right Seat are on the move. In fact, the first few episodes covers Touma clashing against God’s Right Seat member Terra of the Left with some unlikely allies. (such as the towel girl Itsuwa) More importantly, we also learn that Touma is suffering from a case of amnesia. As a recurring trend, girls like Itsuwa gets their fair share of screen time when it comes fan service. Indeed, these are just a few elements you’ll get have to get used to throughout the third season. But unfortunately, Index III quickly began to wore itself out.\\n\\n\r\nIf you recall from the previous season, Academy City is well known for its darker storytelling when it involves espers and its underworld activities. The first season and even its spinoff Railgun had level 5 esper Accelerator undergo an experiment project known as  the Level 6 Shift Project where he would have to kill 20,000 Misaka Mikoto clones to become level 6. Of course, that project never reached completion thanks to the intervention of Touma. My point for bringing this up is because in this season, we are introduced to new forms of esper conflicts. As a show with an expansive cast of characters, the third season decided to set 5 different factions in a plot known as the “Battle Royale Arc”. This was actually one of my favorite arcs in the light novels but the anime adaptation made my stomach sink upon seeing how they treated this. Make no mistake, if you are an anime only viewer, confusion will be a common thought. Once again, Accelerator becomes a prominent character in this arc due to his status as the strongest level 5 Esper. Hamazura Shiage is upgraded as a protagonist while we are also shown with other familiar characters such as ITEM (if you’ve seen Railgun Season 2). The newer characters introduced includes Level 5 esper Kakine Teitoku, Teshio Megumim, and the Professor. The big problem? All of these characters are little more like actors in a poorly constructed script. For whatever reason, the directors thought it would be a good idea to cram such an important arc into a mere set of just 4 episodes. Once I realized this, it became immediately obvious that the producers had little intention to make an impact of its story or characters. Because let’s face it, there’s far too many characters to get invested into in the Battle Royal arc. There’s also too much going on that puts you into a state of confusion. At the apex of this arc, we have two of the strongest espers clashing against each other but the outcome lacked depth and instead replaced with endless screaming of pure absurdity. It felt like these entire few episodes limited what potential it could have been. Even with certain deaths of several characters, I felt nothing for them. In essence, what could have been one of the most memorable plot in the franchise turned into a depressing fallout of rushed execution and poor story craftsmanship. \\n\\n\r\nUnfortunately, it doesn’t stop there.\\n\\n\r\nAt this point, we’re around a third of the show and I had to put down my thoughts and wonder how long this would last. Indeed, the next arc had me worried although to my delight, Acqua of the Back had probably the most consistent arc in this season. Perhaps this is because the anime only had one volume to work (Volume 16) so locking the arc to three episodes is actually consistent. Nonetheless, we are shown more conflict against the God’s Right Seat. Kaori Kanazaki also makes a big return from the previous seasons although she’s given more of a role as a combatant. The purpose of this arc wasn’t made entirely clear although it suggests that Touma would have some significant role in the upcoming struggle with the God’s Right Seat. Nonetheless, we can’t forget that Touma is a prominent character regardless how you feel about him. Ironically, titular Index remains mostly in the background despite having a significant role in the previous seasons. Here, she lost a lot of relevance and is even absent for quite a bit during the first half of the show. \\n\\n\r\nWith the British Royal Family arc that followed, the anime again suffers problems with pacing and many characters stuffed together in one place. Featuring new characters such as the United Kingdom Princess Carissa, it will really make us wonder how Touma fits in all of this. The British Royal arc basically drops him into the magic side of the story without emphasizing its main purpose. Meanwhile, the plot twists didn’t feel meanginful even with some of the characters face-heel turns. Index actually becomes somewhat more relevant although I didn’t feel her role as nearly as memorable as the first two seasons. So in essence, the anime could have done more to capitalize itself by explaining more as everything is too frantic to absorb. \\n\\n\r\nHonestly, if you made it this far into the third season, I have to applaud you. It takes commitment after seeing how much Index III has degenerated. The final story arc of this season covers the World War III saga covering from episodes 18-26. It also covers the final light novels of the Index series (before New Testament) Meanwhile, I’m sitting wondering how the hell we can this can be accomplished through just 8 episodes. The World War III arc involves God’s Right Seat leader Fiamma of the Right pushing his goals for domination. Three different protagonists are actually featured in this final arc although all with different purposes. I’m not going to spoil it but the season makes it clear that all of them are important in some way or another. Again, Index III continues to suffer the problem of confusing storytelling. It doesn’t get viewers invested into what it’s telling us. Instead, what it does is trying to mix too much content at once. It’s like putting all the fruits into one basket and the customer isn’t sure what to pick in the end. Here, Index III chronicles the storytelling of three different protagonists without really getting us to fully invest into any of them. It’s very messy and we are pretty much left to figure out their motives and purpose. Most of these characters suffer development too as the show devotes much of its time on the plot. Oh dear God, how many times do we have to see Accelerator suffer more?\\n\\n\r\nIn perhaps the worst kept secret of the franchise, studio J.C. Staff once again decided to tackle this show with its production staff and talent. Honestly, it’s not too bad if you go with the flow for its action elements. If there’s anything actually worthy about Index III, it would be the technical quality. Sure, it’s not a masterpiece polished art piece but is able to sell an acceptable degree of animation. Character designs are carried over from the previous seasons with little change in style. There are some scenes that makes the action more overdramatic than it should be though. (such as Accelerator vs Kakine) This also extends to the emotive performances of certain characters such as Accelerator and Hamazura. And as previous Index shows, fan service returns with girls such as Misaka, Ituswa, and even Kaori to an extent. We just can’t have a full season of Index without bath scenes, right Mr Director Nishikiori? \\n\\n\r\nAfter waiting for years, Toaru Majutsu no Index III turned out to be nothing more than a big fest of mushy questionable content. In fact, you could probably learn from reading Wikipedia than watching the show. It’s crystal clear that we needed more than 26 episodes but instead, this came out like a procrastinated school project. Sometimes, I wish certain franchises aren’t revived so it can't be killed anymore. Index III became another example of tragic adaptation with what’s shown us. As someone who has read the light novels, I recommend reading through volumes 14-22 to get a much better understanding of this series. But it’s too bad really. What could have been a big hit of the year instead showed us how some big franchises can’t live up to its reputation. I just hope Accelerator spinoff or Railgun Season 3 doesn’t become another victim.",
            "date": "2019-04-05T06:29:00+00:00",
            "helpful_count": 80,
            "mal_id": 305514,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 4,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=305514"
        },
        {
            "content": "Keep in mind this is only related to the anime adaptation and slightly targeted towards the Battle Royale Arc that just ended:\r\nWhile I want to keep this short, there is something I just want to get off my chest, after having waited so long for an adaptation, since I am more willing to watch an anime than read a Light Novel (I did read most of the summary and wiki entries however), I couldn't have been more happy to finally see all these scenes animated with good visuals.\r\nSadly, this is where my heart just breaks down now, what is this J.C. Staff? What have youdone to Index! Why were you breaking the rule of 24 ep to make 26 ep instead, only to disappoint us with more cuts? I was expecting that this change was made to include \"more\", not \"less\". I've been a long on going fan of the series, I was heavily biased even towards it, but this, this just does it. \\n\\n\r\n\"Points that led to me dropping the series:\"\\n\r\n- Significant Character plots are cut out, especially for new characters\\n\r\nespecially during Episode 5, where we are suddenly introduced to more Dark Side Groups without any proper introduction for them, I couldn't feel anything for these guys. And in Episode 6 where a certain Level 0 is capable of doing something amazing without explaining why he is capable of this in the first place, then the fact they cut out a very important quote and metaphor of said character, which would have helped in developing the character further.\\n\\n\r\n- random dying everywhere without knowing who was/is who\\n\\n\r\n- changes that technically ruin and/or change future lore in the anime\\n\\n\\n\r\nOverall you can see where this is going already. After having finished The Battle Royale Arc I had enough of it, I felt sad, betrayed. \\n\\n\r\nIndex and Index II, while being not the best adaptation either, still sticked towards the LN and atleast made sense, leaving the important plot in. Watching this however just hurts.\\n\r\nThankfully I already currently have most of the English translated Light Novels of it from Vol 1-16 in my hands, so I will stick to these.\\n\\n\r\nThank you J.C. Staff for having ruined my most favourite Anime ever. I don't think I will be able to watch Railgun 3 and Accelerator with such a direction right now.\\n\\n\\n\r\n\"Story: 3/10:\"\\n\r\nPoorly adapted so far, only highlights and fights so far\\n\\n\r\n\"Art: 6/10:\"\\n\r\nI'd say it is decent enough but the budget definitely changed, several effects we were used to see like in Index II, the Movie and Railgun S are not present anymore and replaced with downgraded effects.\\n\\n\r\n\"Sound: 8/10:\"\\n\r\nNot much to say about Sound, the only thing that takes me off was the sound change of Imagine Breaker \"again\", like, why change it in the first place? Why can't we just keep the same sound from Index, it was changed in Railgun once, in Railgun S they went back with the original sound, now Index 3 all of a sudden changes it again? Seriously, what the fuck.\\n\\n\\n\r\n\"Character: 1/10:\"\\n\r\nTotally butchered, the characters can't even develop the way J.C. Staff adapted this. \\n\r\n*see part about important plot points being cut out*\\n\\n\r\n\"Enjoyment: 2/10:\"\\n\r\nWhat's there to enjoy when after several years, this is what you get.\\n\\n\r\n\"Overall: 3/10:\"\\n\r\nOverall I don't recommend watching \"this\", but I do recommend reading the Light Novel or possibly reading the Manga of it. These are much much more faithfull (duh, the Light Novel is the original after all). \\n\\n\r\nSo yeah, any Anime only watchers should probably get acquainted with the Light Novels now instead, if they want the enjoyment they desired. Index 3 is not gonna give you that with the way it is handled.\\n\\n",
            "date": "2018-11-09T21:19:00+00:00",
            "helpful_count": 52,
            "mal_id": 293733,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2860857.jpg",
                "scores": {
                    "animation": 6,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 3,
                    "sound": 8,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Devostator",
                "username": "Devostator"
            },
            "url": "https://myanimelist.net/reviews.php?id=293733"
        },
        {
            "content": "I'll be brief. This particular adaptation failed. Hard.\r\nEither they tried to adapt everything in a short timetable, or the opposite, but J.C.Staff cut too much of the novel content in the process. I would prefer it if they decided to animate less in this season, but with better detail, instead of rushing through the story abandoning valuable pieces left and right. Story 4/10.\r\nCharacters' inner thoughts are omitted, some characters were not even introduced and just appeared with no backstory. As a result, their motivation is unknown, their actions seem irrational and forced. Even an off-screen narrator would do, like when Touma narrates about his situation.Why not give Hamazura the same opportunity to introduce the viewer to his situation? 5/10.\\n\\n\r\nAnd it's all too rushed. We should have had 4-5 episodes dedicated to ITEM alone before Fre//nda happens. Because like this we feel nothing, it just doesn't faze us. The constant jumping between POVs is also not appreciated, not with THAT pace.\\n\\n\r\nArt is passable (6/10), but fights are pathetic. Special effects are just... total trash. Accelerator vs Dark Matter was supposed to be epic. It was instead a short sequence of bad choreography mixed with garbage CG (especially Accelerator's attacks - wtf is that black thing?). And then... the conclusion of the fight happens off-screen on top of that. Other fights are also bad. Mercs and drones that shoot bad CG lines of yellow and never can hit any named characters (who stand still and scatter only AFTER the shooting starts), constant speaking in the middle of the fight, characters teleporting (not via ability, but through scenarists' oversight) all over the city...\\n\r\nThe sound is not praiseworthy either. Touma's canceling sound was changed from glass breaking to... something. It just doesn't suit the situation. Music is fine but nothing fantastic. The rest is normal. 5/10.\\n\\n\r\nWhile original story and characters are good, in this adaptation we can't see any of that. Enjoyment 3/10.\\n\\n\r\nSo, overall - poor. 3/10.",
            "date": "2018-11-18T18:23:00+00:00",
            "helpful_count": 43,
            "mal_id": 294329,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Durmanstainer",
                "username": "Durmanstainer"
            },
            "url": "https://myanimelist.net/reviews.php?id=294329"
        },
        {
            "content": "this will be my first quick review into the series, i have read the Light novel all the way to its recent released.\r\nStory: 7, Story now revolves around Touma, Accelerator, and now the recent one named Hamazura who is a level 0 like touma but with no powers whatsoever. The anime will be changing perspectives as the plot moves forward regarding the full on war with the science side and magic side.\r\nArt: 7,  Way better than the last 2 seasons but not on par on Railgun S i think. the fight scene with Accelerator and Dark Matter was really well done though, and hopingfuture fights will be done like that.\\n\\n\r\nSound: 7 they change touma's imagine breaker sound when he touches anything magic related or esper related powers but you''ll get used to it i hope. sounds when characters fight is still top notch with their futuristic edm style (?).\\n\\n\r\nCharacters: 8, With more characters getting included, it may be a mess trying to switch to some of them to get in screen time but ill hold on it atm. Im really interested in how Hamazura will play out.\\n\\n\r\nEnjoyment: 9, I love this series tbh, with its setting, plot, and the characters interacting in this world of magic and science society. how will they react to the others sides powers?\\n\\n\r\nOverall: 8, a good series but is not for everyone since it can get convoluted at times. will update later on",
            "date": "2018-11-18T10:45:00+00:00",
            "helpful_count": 41,
            "mal_id": 294303,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6340638.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/DivineLion",
                "username": "DivineLion"
            },
            "url": "https://myanimelist.net/reviews.php?id=294303"
        },
        {
            "content": "I love the Toaru series, I really do, I have seen all the spin offs, read the novels, read the manga, will watch the third season of railgun and will watch the Accelerator spin off. Despite this I will be giving this particular adaptation of the show a low review, not because the source material is bad, but because its just a terrible adaption. If you want to actually enjoy this series, please just read the damn novels. This adaptation was basically JC Staff butchering the plot, stitching it back together incorrectly, throwing out important parts because hey we need to save budget for Misaka’sass shots, and then setting it on fire. Anyway, now that I cleared that up we can get onto the actual review.\\n\\n\r\nTHIS REVIEW CONTAINS SPOILERS\\n\\n\r\nStory: 4\\n\\n\r\nI have never seen such a poorly executed story in anime before, and I have seen that one isekai anime involving a Kirito clone and a smart phone. Nothing in the story actually makes sense, and this is from a novel reader who knows exactly what is supposed to be going on. The anime was already very fast paced in season 1 and 2 and those 2 seasons adapted 12 novels combined, while this season tried to adapt 10 at once, this lead to a great portion of the plot being cut out.\\n\\n\r\nThe battle Royale Arc, one of the best arcs in the novel, with mind games, extremely well written fights, great conflicting motivations, was turned into an endless blood bath. What happened was a bunch of characters you don’t care about got killed, some soldiers got shot up, and all for a bunch of reasons that they don’t expand beyond a single line here and there. \\n\\n\r\nThe British Halloween arc? One of the best political stories I seen in an LN, one that successfully predicted Britain in real life leaving the EU before it actually happened, was turned into a half ass coup by some bratty girl who was really tsundere about Great Britain. \\n\\n\r\nDon’t even get me started on the acqua of the back, arc with more focus on Misaka’s ass than the motivations on WHY acqua was in the city, how he got there, when in the timeline he got there, and why Academy City dint put him down as fast as possible. \\n\\n\r\nAlso the exposition in this season was some of the worst, it was already bad in previous seasons, when they start explaining character abilities, half of it sounds like chuuni nonsense someone on drugs came up with, the other half shouldn’t even be included since it wastes a good portion of the episode with someone just talking. Would it be so hard to just simply explain their abilities, since clearly going into the origins of the abilities in depth won’t work in an ANIME, it works well in novel because they can dedicate 3 pages to something like that. They also don’t do this once, they do it like 30 times, every time some new character shows up. \\n\\n\r\nArt: 3\\n\\n\r\nThe animation is honestly disgusting, and I have seen shows released in 1998 that are much better looking, I am serious, we have scenes that look worse and more broken than that bad berserk adaption a few years back. The fights which in the novel were described as shattering mountains, tearing space, explosions in every colors as reality was distorted, had no weight to them at all. Most of the fights were just the characters talking, them using their abilities 2 or 3 times and then eventually one of them backed down or got knocked out. \\n\\n\r\nThe effects for the abilities looked terrible, curtana was supposed to cut through space, what were those stupid cubes of jello???? Or how Accelerator’s black wings were not consistent between this season and last season, heck it wasn’t even consistent in the 2 fights this season alone. Also, what the heck were the gods right seat abilities, seat of the left had some weird look blade that moved slowly through the air, acqua’s speed was downplayed the entire time, fiammas holy right looked so ugly and did not do any of the cool sounding stuff it was supposed to, like teleport to the target and knock them out without force, oh by the way his sword was supposed to be 40KM long and on FIRE.\\n\\n\r\nThis being said, the only reason the art gets a 3 instead of a 1 was because of the second opening, after seeing it though it made me even more angry, how can they make an opening so great visually, and then make a show that looks so awful after. The opening visuals were possibly top 10 out of 100s of series I seen, if JC staff is capable of that, then it’s clear it was not even a lack of talent but just laziness on why the show looked this garbage.\\n\\n\r\nThe sound: 8\\n\\n\r\nThe openings were absolutely amazing I will admit that, and the soundtrack is as good as ever, I guess they managed to get one thing right. I have nothing bad to say here, the sound effects used were interesting even if it was not consistent with the previous season, and I really enjoyed the soundtrack that played during major fights. \\n\\n\r\nCharacters: 2\\n\\n\r\nAccelerator became the epitome of edge and stupid justifications instead of a well written anti hero, the MC became an endless platitude generator who quotes basic lines about justice and punches out his enemies without understanding their view point, and hamazura apparently survives every situation by luck. This is essentially how the anime adaption portrayed them, one dimensional cardboard characters with no nuance, who can’t think beyond the most obvious solutions to their issues, and who win by luck or plot armor. I will tell you that the novel does not do this and the characters are much more likable but I think I already said this enough, the character writing and development in the series is just awful.\\n\\n\r\nAnother issue in the series is that they add like 100 new characters without developing any of them, some of them genuinely have great character designs, interesting abilities, and look really cute or cool. However, we will never get to know them because they either die, or are forgotten about in the next arc, and you don’t care much about them because the show skipped any significant development or backstories for the characters. \\n\\n\r\nAlso outside of fan service some of the most popular characters got no screen time, we dint even get to see Misaka do anything substantial or have any of the Academy city students show up outside of 3 minutes of screen time.\\n\\n\r\nEnjoyment: 5\\n\\n\r\nI really wanted to enjoy this series, since the source material is something I love, and I was looking forward to seeing this anime. However I just could not get myself to like it for the most part, I know the story from the novel and could barely follow it, I feel sorry for anime only viewers who likely understood nothing through the entire show. Now I wouldn’t say I hated all of it, but a majority of it except some highlight scenes were pretty bad. I used to like JC staff as a studio, however after this adaptation, and whatever they are doing with Date a Live 3, they are garbage to me. All I can hope for is that the railgun season 3 director manages to put on a good show despite the studio, like he did last time with railgun s.\\n\\n\r\nOverall: 5\\n\\n\r\nI give this show an 5, it was really hard deciding whether or not to give this show a lower score since it was very bad and disappointing, however I will give it an 5 for just because I love the source series, and because I rarely ever give a show under a 7, if its under a 7 on my list it means the show it hot garbage and I would never recommend it.",
            "date": "2019-04-05T09:06:00+00:00",
            "helpful_count": 32,
            "mal_id": 305528,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7060988.jpg",
                "scores": {
                    "animation": 3,
                    "character": 2,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/ACasualViewer",
                "username": "ACasualViewer"
            },
            "url": "https://myanimelist.net/reviews.php?id=305528"
        },
        {
            "content": "As the curtain closed on the season of Winter 2019, the epidemic known as JC Staph Infection had claimed yet another victim from the masses of announced sequels to previously aired shows. This time, it’s the adaptation of a popular Dengeki Bunko light novel series known as A Certain Magical Index (which is alternatively called Toaru Majutsu No Index). It is practically inexcusable to have people wait out just over seven years for another season, and then come out with such a disappointing product. Having watched and enjoyed the previous two seasons, I was really looking forward to an announcement for a third one. Sowhen it finally came, I was really looking forward to how they’ll handle the rest of the story, so I didn’t think too much about the possibility JC Staff mishandling everything. Instead, what was supposed to bring an epic finalization to the main story was just one hell of a tumbling mess.\\n\\n\r\nSTORY:\\n\r\nTo Aru Majutsu No Index III’s premises are practically the same as the two previous seasons, so regardless of whether or not you’ve read the LN source, this installment is only for those who’ve watched the two preceding installments and are curious to see how the continuation turned out. Watching the Railgun series is also a helpful option to familiarize yourselves with the majority of the characters.\\n\\n\r\nIt was after the first three episodes that the lack of craftsmanship became very obvious to me, despite me not wanting to initially admit it at the time. One of the biggest issues in the show, while common with most LN adaptations, grew prominent as one watches….PACING. Even though I don’t read light novel or manga sources myself, it was made clear very early on than the show’s content has been condensed and trimmed to accommodate for the listed twenty-six episodes. From what I was told, the season was trying to shove nine volumes worth of content, which contrasts the shared thirteen volumes by the previous two seasons.\\n\\n\r\nBecause of the forced condensation of the story, the six individual arcs within the plot, excluding the final climactic WWIII arc don’t last much more than three episodes. This consequently results in the sudden introduction or reintroduction of characters, and we are expected to care about them without enough, if any, background context to them. The lack of proper introduction of the cast members can leaves viewers quite lost and confused, as they try to figure out the characters’ individual motives within the story. Even worse…it can actually be hard to remember the names of the newcomers who are somehow supposed to be important to a particular arc. Because of the significant lack of character background, it’s also hard to feel for them when some of them die in action.\\n\\n\r\nLet’s use a somewhat brief example with the Battle Royale Arc. Being the only arc to actually not feature the main protagonist Kamijou Touma, it was supposed to focus on Accelerator and reintroduce Hamazura Shiage in a major protagonist role, as well as reintroduce the group ITEM, whom we may know previously from watching the Railgun series. This was the most problematic arc for me, personally; for a segment that only lasted three episodes, it was clear that the studio probably wanted to have it over and done with quickly to set up room for the finale. Throughout the adapting of the Battle Royale, new characters and groups are just introduced from left to right without any sort of explanation of what they’re here for and why, making their actions feel so forced and idiotic. Many of the fights that take place during this arc and future ones often conclude off-screen for no apparent reason. \\n\\n\r\nNot to mention, there’s FAR too much pointless standing around and talking during those bouts; it’s as if they’re not actually taking stuff in earnest or sincerity with their actions at all, considering how vaguely their intentions are portrayed. As if that’s not enough, a good number of these introduced or reintroduced characters are seemingly killed off suddenly without anything building up for them, sometimes biting the dust off-screen; in fact, some of them are simply introduced and then killed within the same damn episode; as a result, we feel absolutely nothing for them. I don’t see how it’s any possible as a viewer get emotional over such poorly introduced cast members.\\n\\n\r\nAdditionally, the plot omits helpful exposition or even inner dialogue that would explain what certain characters were thinking or how some were able to perform something particularly hard to explain. All we end up getting are mostly just poorly conducted fights and pointless, bland dialogue from the characters. \\n\\n\r\nThe show also fails to show any of the characters’ inner thoughts, which would’ve proven helpful in terms of giving more sense and logic to their actions. Whatever exposition that DOES come out, or what’s supposed to be exposition, quite often feel like very half-hearted attempts to sound witty due to the unfortunate lack of prior context. Lastly, the constant, nauseous shifting between POVs, without the proper siegeways or breaks, just makes it even harder to follow and keep track of what’s going on, especially with the kind of pacing this show has resorted to.\\n\\n\r\nThe only particular arc that I considered okay was the Acqua of the Back Arc. For this particular segment, despite being just three episodes as well, the story didn’t really seem to omit as much important events and details as the others. Kanazaki, one of my more favorite support characters of the show, returns to take a more upfront role as a combat participant against the likes of Acqua, who himself was a particular character of interest. Nonetheless, this arc felt rather pointless for the story, or at very least, not made clear.\\n\\n\r\nART/SOUND:\\n\r\nThe quality of the animation is notably downgraded from the previous seasons. The 2D animation and designs from this season, while not exactly awful, per say, have considerably more inconsistencies compared to the second season and the Railgun series. The movements don’t feel as fluid or liberated, the characters can occasionally look “off” in terms of facial expressions and body gestures, the emotional acts feel far more overdramatic than emotionally powerful, and the special effects are just horrific. The CGI was not exactly very pleasing; while it was not anywhere near “Hand Shakers level” of awfulness, the notably increased usage of it resulted in poorly choreography of the 1-on-1 fights and the military conflict.\\n\\n\r\nThe soundtracks are actually very nice and at least try to fit with the tense or lighthearted mood, depending on the current point of the story. Maon Kurosaki, whom also did the two ending themes for the second season previously, sings the two opening themes for this one. Both songs are j-pop rock soundtracks, with “Gravitation” setting a moderate tempo to fit the inner urban activity and stuff going on behind the scenes, while “Roar” is more complementary to represent the frantic tension of international war and all-out conflict. The sound effects this season just don’t have the same kind of natural feel; for example, while I understand changing the noise of Touma’s Imagine Breaker was to make it sound more ominous and mysterious, due to the ambiguous and undisclosed nature of his power, it can feel quite out of place amidst the heavy conflict of him fighting it out with his adversaries. The previous sound, felt more fitting as it gives the clear indication of something being cancelled out and/or broken through, which is exactly the effect of Touma’s power. The voice acting was fine, in all honesty, but the vagueness of the story and plot can have you wondering why, for example, two high-leveled espers in Accelerator and Kakine are just excessively screaming for no particularly good reason or explanation; as a result, it just feels like overcooked displays of emotion. At least the show sort of lets us know when to cover our poor eardrums when a characters wails with absurdity.\\n\\n\r\nCHARACTERS:\\n\r\nThere’s not much else I can really say about the new supporting characters, as I’ve mentioned the major issue with them in the previous section of this review. The more prominent recognizable main and support cast from the previous seasons are, in all honesty, unchanged for the most part.\\n\\n\r\nTouma is still the usual “act first, talk later” selfless character we should all remember, regardless of whether we hate him or not. With the exception of the Battle Royale Arc, Touma has always taken at least a major role in all the arcs he’s involved in, especially the final arc, the WWIII Arc, where he fought the superiority complex jackass known as Fiamma, who was trying to accomplish the typical, regurgitated objective of world domination.\\n\\n\r\nIndex, as always, with the exception of the final arc, always took to the benches on the sideline and doesn’t really have a very major role. While I can understand her origins and her case of amnesia, I’ve never really liked Index as a character due to her rather annoying personality. Despite her high intelligence, she is overly naïve and easily irritated, which often leads to the gag where she bites poor Touma on the head, often for no good justifications. She does have a good side to her, though, as she is shown to kind, nice, and polite with other people. Despite the bright side of her, her role as the primary heroine just never felt right, as she barely get involved personally barring when she’s taken hostage. In the final arc of this season, she is only relevant as a puppet of destruction until she was eventually freed. Her mostly backseat role, despite being the main heroine, felt like a hindrance as she almost always ends up in the damsel-in-distress situation when she does get involved, and Touma is usually the one that has always had to be her savior.\\n\\n\r\nMisaka Mikoto, another favorite character of mine and one that I personally felt that should’ve taken both roles as main heroine in both Index and Railgun (but is unfortunately a support cast member in the former), doesn’t show up as much as she used to in the previous seasons, though she does appear as a minor participant in the WWIII Arc to try to help her love interest in Touma. Her character from the previous installments is mostly unchanged for the most part. The majority of times Misaka is seen is almost always involving Touma, whether it’s the usual lighthearted gag of her getting flustered and/or angry due to her feelings for him, or it’s on a serious note where Misaka is trying to tell Touma to not push himself, with the latter saying otherwise. In the end, Touma and Misaka’s relationship stayed pretty much the same, so Misaka’s overall relevance to the season was not exactly as full-fledged as it could’ve been.\\n\\n\r\nA particular support character I do want to focus on is Hamazura Shiage. Previously an antagonist in the Skill-Out Arc in the previous season, he is involved as one of the “good guys”, especially during the dreadfully adapted Battle Royale Arc. Because of the shift to him playing as a protagonist, character development for Shiage was absolutely necessary to give more meaning to his actions. However, to the aforementioned issues with the said arc, Shiage’s imagery in the adaptation seemed more like an idiot shifting between wishy-washiness and recklessness. He is neither as idealistic and compassionate as Touma, nor as bloodlusted and insane as Accelerator; in this way, he can be considered as a medium between the two. He has an obvious inferiority complex due to being branded as a powerless individual and not having esper skills himself, hence his previous involvement in the Skill-Out Arc. While he does get notable character development within this part of the series, it just seems so rushed and without enough context behind it to be considered properly managed. The show basically displayed his change as if it was propelled solely via the virtue of his growing feelings with a barely memorable support character (at least in the Index story), Takitsubo Rikou….and I’m not sure if that’s how a well-written character is supposed to experience progression.\\n\\n\r\nAll the other returning support cast members barely get much highlights unless they’re heavily involved within a particular arc. While the previous seasons, due to their better sense of pacing, gave them more reason to pay attention to and be attached to them, this sequel didn’t really do them much justice. They’re just there cause the story sorta “obligated” them to be present. Itsuwa, one of those particular support characters, started out her reintroduction with developing her feelings for Touma, and while she’s considerably much nicer to the latter and arguably a better female partner for him, she never truly got much shine outside the Constantine and Acqua Arcs. \\n\\n\r\nOn one \"dual-colored\" note, while Accelerator himself was a rather enjoyable character due to his nature and did get a significantly more prominent spotlight and better characterization during this season, his role is still mostly overshadowed by the chaos of the events going on around him. \\n\\n\r\nIn short, overall, a bunch of wasted products in the character department.\\n\\n\r\nENJOYMENT:\\n\r\nI’ll be quick to the point. I started out really enjoying it for the first few episodes. The first episode really had me optimistic, especially with one of my favorite gags where Misaka gets upset at Touma, fires her electrical powers, and Touma blocks it with his Imagine Breaker. It was always SO nice to see the two’s interactions and dynamics, as they were more common and meaningful in the previous seasons. Unfortunately, we don’t get much of that all with the third season. Sure, Itsuwa played as a nice substitute, and the return Kanazaki’s tsundere behavior due to her OWN feelings for Touma (from way back in season 1) was something to give credit to in terms of enjoyment value, especially for me, personally…but in the end, those were still simply flauntings of rather unnecessary fanservice made just for the fanboys.\\n\\n\r\nAs for the serious parts of the story itself, it was an absolute pain to watch. I’ve mentioned those issues already; rushed events, poorly animated fights, jarring CGI, characters being introduced left to right that it’s hard to catch up to or consider them as something important. It’s a mess that I tried my best to stick with and be optimistic about. However, with the handling of the British Royal Family Arc, where the main purpose of the segment and Touma’s intended involvement was severely downplayed, it became so clear that the show is literally going nowhere in the right direction. It was literally like watching your birthday or homecoming party getting crashed by a bunch of drunk idiots. Considering that J.C. Staff was also handling the third season of Date A Live at the time, and how horribly it turned out, it became all the more obvious that, regardless of what financial reasons or justifications, the studio just tainted its own brand by not being able to hire a proper team of staff members during the production of this show. I’m honestly disheartened because in the past, J.C. Staff produced plenty of other good shows in addition to the previous two seasons of Index as well as the two Railgun seasons. While I can’t say it was like a hated chore, it still felt laborious to watch.\\n\\n\r\nOVERALL:\\n\r\nConsidering how we waited for years for the third season, and to receive a spoiled meal like this, Toaru Majutsu no Index III is the one of the more disappointing sequels in the recent years of anime. This season clearly needed more than just 26 episodes, and in the end, it was simply a rushed school project like Date A Live III and both TG:Re seasons were. To be honest, I wished this season was given more time to work with so that events, characters, and themes are played out and executed a lot more properly than what was showcased here. At this point, I’m highly considered to hit the light novel books for the first time and start from the very beginning, provided I find time for that. \\n\\n\r\nUnfortunately, for this season, it was simply something unable to follow up on the series’ previous accomplishments. I now pray to God, Christ, Arceus, whomever is up there….that the new Accelerator anime and s3 of Railgun don’t fall victim to the dreaded plague of JC Staph Infection as well.\\n",
            "date": "2019-04-05T08:30:00+00:00",
            "helpful_count": 23,
            "mal_id": 305525,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5242474.jpg",
                "scores": {
                    "animation": 4,
                    "character": 4,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/Ryuseishun",
                "username": "Ryuseishun"
            },
            "url": "https://myanimelist.net/reviews.php?id=305525"
        },
        {
            "content": "It’s been eight years since the previous season of Index, and six years since I started watching anime. Index was one of the earlier series that I saw, and at the time I really enjoyed it. However, a lot has changed in my life since then, and I’m not the same person I was back in 2013. I’ve been looking at this third season as an opportunity to reevaluate the series, and unfortunately, it doesn’t hold up under scrutiny. Many of the preliminary reviews suggest that this dissatisfaction is purely with the quality of this particular adaptation, but I feel the source material isn’t blamelessin this matter.\\n\\n\r\nFirst off, I’m going to talk about the author of the series, Kamachi Kazuma, who is best known for the absurd rate at which he puts out light novels. A while back, there was a period of over two years in which he managed to release a volume every single month, and though he has slowed since then, his publishing speed is still well above just about anyone else in the industry. This rapid release schedule is a powerful tool for increasing audience engagement, since there will almost always be a new release to keep him fresh in mind, and it also generates pressure for readers to stay up to date or risk falling behind.\\n\\n\r\nHowever, while this model was no doubt successful in getting his work acknowledged, it is also to the detriment of its quality. For some arcs, it feels as if Kamachi was only putting something out for the sake of it, and not because it contributed to the overall narrative. Some of the middle arcs in this season drop a lot of information on the viewers to keep track of, but end up hardly mattering to the main plot. There’s so much going on, and a lot of it doesn’t amount to anything.\\n\\n\r\nAnother product of this release schedule is how the powers have been simplified over the course of the series. I still think that Academy City is one of the coolest settings in any anime that I’ve seen, but only because of how unique and thought-out all the different powers that occupied it felt initially. But as the rate of releases accelerated, this deliberateness was lost. Gradually, the new abilities introduced have become less interesting, and even the application of existing abilities has become less creative. This is best illustrated through Vector Change, a power which is limited only by the imagination of the user. Accelerator’s greatest strength over the first two seasons was the flexibility of this ability, but now he primarily uses it as a force field and those dumb tornado wings.\\n\\n\r\nBut yes, I’m not going to disagree that this adaptation is rough. This season covers the last nine volumes of the original light novel, which is a lot of material to cover (for reference, the first and second seasons covered six and seven volumes, respectively). A lot had to be cut to fit everything into 26 episodes, and the gaps are apparent. The biggest casualty of this is the characterization. It’s a frequent occurrence that the villains from previous arcs return as allies in new arcs, though the process by which their allegiances shift is often unaddressed. This material ties in with the series’ main theme of great strength coming from the unification of different perspectives, but it doesn’t get the attention it deserves. The show ends up having an impressive ensemble cast, but with all the material that has been removed, any episode that tries to follow too many of them comes across as completely incoherent.\\n\\n\r\nIt’s always interesting to revisit media you’ve consumed in the past, and see how your opinion has shifted on it over time. Unfortunately, Index doesn’t hold the same appeal that it used to, but I’m still going to try to end this review on an optimistic sentiment. We’ll also be getting a third season of Railgun this year, which has always been my preferred side of the franchise. I plan to cover it as well, and I choose to believe that it won't let me down in the same way.",
            "date": "2019-04-05T07:19:00+00:00",
            "helpful_count": 21,
            "mal_id": 305517,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2578639.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 3,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/RiverRode",
                "username": "RiverRode"
            },
            "url": "https://myanimelist.net/reviews.php?id=305517"
        },
        {
            "content": "What happened to this show? The first 2 seasons were pretty good, you knew what was going on, why people were doing things and the arcs felt fleshed out. Season 3? \"Naw bro, you gotta read the books to enjoy the show.\" NO! That's not how it's supposed to work, the viewer needs to know what is going on while readers get to enjoy nuance and animated fight scenes they imagined. \r\nThis season is a waste of time. I hate what they've done. I hate that I've wasted 6 hours on it and I hate that they'll probably ruin Railgun too.",
            "date": "2018-12-23T01:07:00+00:00",
            "helpful_count": 18,
            "mal_id": 296584,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/SuperCheese88",
                "username": "SuperCheese88"
            },
            "url": "https://myanimelist.net/reviews.php?id=296584"
        },
        {
            "content": "After careful analysis, I’ve come to the realisation that the guys in J.C Staff want  Toaru Majutsu no Index III to give Tokyo Ghoul re: a run for it’s money for the worst adaptation in recent years!\r\nIndex season 1 and 2 were relatively decent, however season 3 is a complete trainwreck. J.C Staff are trying to adapt so much this season, that they crammed too much in each episode, causing it not to flow cohesively anymore. \r\nThey skipped a lot of content from the Light Novel, as a result the story is extremely rushed and most anime watchers don’t know what the hell ishappening.\\n\\n\r\nIndex III has a plethora of problems: the bad direction, poor animation, unexplained plot points and plot holes. The story bouncing from different groups of characters without giving us enough time for events to sink in or get acquainted with the characters. Inner monologues are being cut out. Characters are constantly teleporting from one scene to another, the villains motivations are vague, there’s meaningless deaths and stupid organisations like: ITEM, SCHOOL, BLOCK, GROUP, MEMBER fighting for unclear reasons. \\n\\n\r\nHonestly, I gave up trying to understand what’s going on in the story because it’s been confusing and hard to follow. I’m only watching to complete it now. \\n\\n\r\nTouma is still the same as ever. Lecturing his opponents how they’re wrong and he’s always morally right, until they become dumbfounded as he proceeds to punch them in the face.\\n\\n\r\nIf you’re a Misaka fan then prepare to be disappointed because Misaka barely anything for the entire season and when she eventually does get some focus it’s only for 2 mins at the end.\\n\\n\r\nAccelerator remains the best part of Index. His character development into a hero is amazing and watching the lengths he goes to protect Last Order is a joy to watch.\\n\\n\r\nTo make matters worst, Hamazura becomes on of three MCs along with Touma and Accelerator this season. I despise Hamazura with a passion because he’s like a bland, discount version of Touma. I don’t know why Hamazura gets so much screentime when nothing he does is plot relevant. I don’t care about his goal to save his girl. He’s blantantly protected by plot armour and the guy can’t do anything without plot convenience or enemies being dumbed down to save him. This is why you don’t make a fodder civilian a MC because he’s just boring to watch.\\n\\n\r\nMugino acting like a cartoony evil, psychotic bitch annoys me.\\n\\n\r\nEvery episode I’m left with more questions than I am answers.\\n\\n\r\nThe message of Index III is “read the light novel if you want to understand the story”.",
            "date": "2018-12-28T10:34:00+00:00",
            "helpful_count": 11,
            "mal_id": 297205,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6370674.jpg",
                "scores": {
                    "animation": 5,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 1,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/OG_Guts",
                "username": "OG_Guts"
            },
            "url": "https://myanimelist.net/reviews.php?id=297205"
        },
        {
            "content": "And So the Index franchise is back with another season,  at the time of the review the 9th episode had just finished airing so without further ado let's get in with it.\r\nI love it !! The first thing I loved about the third season is the stakes, this season is a direct follow up of Index ii so we all know the God's Right seat are the villains this time around. It starts off with Touma facing off against them as always but what I particularly like about this season so far are how multiple protagonists are popping up. In fact, I think thisis the first time we have so many character perspectives in a single season. FYI this season alongside Touma we are getting two new protagonists, Accelerator and Hamazura.\\n\\n\r\nThere's, of course, the usual amalgamation of pacing problems, completely new characters that end up fighting and killing without any explanation. The character introduction scenes have been cut short is what I can tell as an Anime-only viewer. Particularly if you ask me the episodes 4-6 were a mess, but if you are the kind of viewer who follows every single dialogue like me then it isn't much of a problem as the essence of the arcs are conveyed. However, I will suggest reading the Light novels if you want to enjoy this season as that's what most of the LN readers have said.\\n\\n\r\nCharacters: To Aru's strong point has always been its characters and it has plenty of those.\\n\\n\r\nArt: 7 is the best rating I can manage, either JC Staff is lazy or they are just not invested in Index III.\\n\\n\r\nEnjoyment: 8, if you are okay with a few unexplained details I'm sure better arcs are coming up!\\n",
            "date": "2018-12-02T00:23:00+00:00",
            "helpful_count": 10,
            "mal_id": 295098,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4968063.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 7,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AnimeOracles",
                "username": "AnimeOracles"
            },
            "url": "https://myanimelist.net/reviews.php?id=295098"
        },
        {
            "content": "It has finished and I felt like I should make a review (just so it wouldn't be crowded with just negative reviews). So here we go:\r\nThe story for Index III isn't that bad. Personally I didn't think that it was rushed nor did I thought that it was confusing. Index has always been like this when if you don't pay attention there is a high chance in which you would be lost. Though I do admit that plenty of things were explained a lot better in the novels but this isn't a review of that but more as if I were an anime-only watcher.\r\nThe artis fine. Like the characters do look different from each other. But the only reason why it's a 6 in this category is because I know it could have been done better as some of the CG wasn't that great (I'm looking at you tornado wings) and that sometimes the characters can look off-model.\\n\\n\r\nSound wise it is quite good. The voice actors feel like they did a really good job and gave me performances I wasn't expecting to hear (like Mugino and Misaka Worst for example). The OST was pretty good though a nitpick I had was that an emotional scene could have something that would fit an exposition scene for example.\\n\\n\r\nOf course like any anime there has to be good opening and ending themes to go along with it to help with the experience and I'll start with the openings. While I do really like Graviation, I feel like it overstayed its welcome a bit more than it should have. And as for ROAR... I feel like it is the most visually impressive of all the ops in the Index series (even if the \"Engrish\" can sound weird during the chorus).\\n\\n\r\nAs for the endings... well it is hit or miss just like the other eds in the series. ED1 might be my least favorite of the endings mostly for how forgettable it is while I will be able to remember ED2 pretty well even if I am not sure if it fits the WW3 arc...\\n\\n\r\nOne of the things that I always liked about Index would be the character cast and how well they interact with each other and the situations that they get in and it didn't disappoint me this time around. Though just don't expect Misaka to do much as there's always Railgun 3 coming up and Accelerator is just Accelerator doing his own thing.\\n\\n\r\nAnd while I would like to continue talking about the cast... I shouldn't really be going to spoiler material (hence why this section might be the most vague of them all).\\n\\n\r\nNow I don't think Index III is anywhere close to being a butchered adaptation compared to something like Date A Live III or even Hyakuren no Haou to Seiyaku no Valkyria. Instead I see this as a flawed adaptation but that didn't meant that I didn't enjoy myself. In fact I thought it was a really nice ride getting through this weekly as there were plenty of moments that I was glad to see getting animated.\\n\\n\r\nI am not here to make you change your mind as I am perfectly fine with you being disappointed with the way this series turned out and if I had to say one thing about this season it would be: I am glad that it exists.",
            "date": "2019-04-05T09:53:00+00:00",
            "helpful_count": 8,
            "mal_id": 305532,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6105995.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/fullmetalmasify",
                "username": "fullmetalmasify"
            },
            "url": "https://myanimelist.net/reviews.php?id=305532"
        },
        {
            "content": "This review is **SPOILER FREE**\r\nThe ToAru franchise has caught me by storm back when I started watching anime. It just had this certain \"something\" from the getgo, that kept me entertained. I couldn't express how excited I was when I heared about all the news about the new anime adaptations coming in 2019: so then, why am I so disappointed?\r\nSidenote: I've seen the entire ToAru franchise (5 seasons including the new \"ToAru majutsu no Index III\" (up to episode 19). I've rewatched the previous installments multiple times, both in release order and chronological order and I've bought all the source material (Lightnovels + Mangas). Iknow what I'm talking about when I say that this season wasted pretty much all its potential so far.\\n\\n\r\nThe ToAru Franchise takes place in a world, where magic and science have long both been part of our daily lives. One much more than the other, as the magical side tends to work hidden rather than open. In the most advanced city in the world \"Gakuen Toshi\" or \"Academy city\" millions of students live in \"peace and harmony\", where they train their supernatural powers as espers. However, the mascerade of this city is nothing more but a construct of illusions: Human laboratories, clones, warfare and abductions as well as murder all take place in the darkest places of this brightest city. Its a world doomed by the illusion, that with great power, great responsibility follows and that people will use their power to protect those, that can't do it themselves. Its sadly an Illusion, that Touma (male protagonist) has to destroy. Sacred with the mysterious power to negate any supernatural force by simply touching it with his right arm, the \"Majutsu\" branch follows his daily life as he keeps getting involved in these dark, brutal things that take place in this city and how he has to give it his all to fight back and protect those that are close to him.\\n\\n\r\nThe ToAru franchise is filled with intruiging plots and sidestories that all come together to one big clash. Again and again. No matter how weird it seems, it always ends up in something way bigger than you originaly expected. This however is sadly also why the anime adaptation of this genius series often sucks ass. Excuse my words.\\n\\n\r\nDue to the sheer size of source-material and its complexity, a H U GE part of the entire narrative gets lost in its adaptation - even with 24 episodes per season. Some arcs may be lighter than others but in general you'd need at least 10 - 12 episodes per arc. Often times sadly they get broken down in 4 - 6. \\n\\n\r\nStory: 5\\n\r\nThe story itself would get a straight 10/10 from me. But sadly the series cuts so much material that its just confusing - even after you read 17 goddamn lightnovels about it. \\n\\n\r\nArt: 7\\n\r\nIt looked pretty decent in the beginning but it suffers from its rushed nature and often times you have a very neatly animated clash only to be followed by a static close-up battle and an \"evil explanation of why they have to destroy the world for the greater\" for 5+ Minutes (once again, its just too rushed...)\\n\\n\r\nSound: Oh lord. I loved the new sounddesign, instantly felt in love with it when the first episode aired of this new season. It also has a lot more epic OST and some absolute banger OPs. So why not 10/10 or at least 9? Simply because there are some soundtracks that are nice to listen to - maybe for 20 seconds. But you'll hear the looped for the entirity of 5 minutes whilst someone has a monologue about their motives and past. \\n\r\nThe VA did an amazing job - especially \"Accelerator\" is just insanely (hehe~) talented ;)\\n\\n\r\nCharacter: Standart bunch of okay characters. Could've been a lot better but pretty much all their detail gets lost - once again - in its rushed nature. \\n\\n\r\nEnjoyment: 10/10 cause boi, why would I spend 500 Dollars on source material if it ain't good? Its my fravourite series of all time and I'd love to see it come alive as an anime more lively. But this installment just falls flat because it cuts so much source off and keeps having very blunt moments stretched out to eternity. \\n\\n\r\nOverall: 7\\n\r\nYeah. I'd love to give it a higher rating but this season falls very flat compared to the previous ones (especially considering that the sidebranch \"ToAru kagaku no railgun has a waaaaay better anime adaptation)",
            "date": "2019-02-19T06:27:00+00:00",
            "helpful_count": 5,
            "mal_id": 301984,
            "reviewer": {
                "episodes_seen": 19,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5580758.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Arglos",
                "username": "Arglos"
            },
            "url": "https://myanimelist.net/reviews.php?id=301984"
        },
        {
            "content": "for the first time, I was disappointed with the anime to aru project adaptation. after I can enjoy the stories of season 1 and 2, movie, and to aru railgun series. In this season 3, the Aru Majutsu Index is a failure. that many stories must be spent in one season, even forgetting the habit of adaptation in 24 episodes to 26 episodes. almost all the strongest characters appear in this season. but they don't seem to have a role at all. the epic battle scene in the opening song looks like a cat playing thread balls in the anime, there is no scene thatshows it is a fierce battle. many scenes such as landings, punches, shots, ambushes, which were very failed to make the scene, for example the episode of Touma tried to jump several times to hit Fiamma, when pushed aside he was not thrown backwards but he landed in his original place. even though the jump distance is far from the logic it should fall. fiamma as super vilain does not show him at all strong, as a criminal he is so easily frightened, just like a street person who happens to find strength. especially in the last episode. The epic battle that is awaited waiting has never happened in season 3. Why can't it make a fight like Touma fight the first accelerator ?, or Misaka against ITEM on Railgun ?. is it just that fiamma ability? only ordinary people can chant and use their hands on their backs? a character who looks like this does not deserve the ambition to control the world. I hope similar things don't happen in the series accelerator or railgun season 3. Don't break the good story again with a messy anime adaptation.",
            "date": "2019-04-08T05:13:00+00:00",
            "helpful_count": 4,
            "mal_id": 305753,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6722789.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/DNGlist",
                "username": "DNGlist"
            },
            "url": "https://myanimelist.net/reviews.php?id=305753"
        },
        {
            "content": "As someone who has watched all seasons of A Certain Magical Index and A Certain Magical Railgun quite recently, I was left confused by this third season, and think it is a shame to see it decline. I can't imagine recommending this to someone who wasn't already a big fan of the anime series at least, and I'm sure even fans of the manga would be frustrated and perplexed after watching this adaptation. I don't like to disparage anime, but this was a mess of a show. Foremost, there were far too many characters being introduced to keep track of on top of the alreadyextensive cast, which resulted in each character getting an insignificant amount of screen time for them to really develop. Not only that, but with the collision of both the \"science\" and \"magic\" sides, there were simply too many rules and deus ex machinas out of left field. The anime expects the viewer to accept and understand the events that are happening on screen, despite their incoherence, and because of that, much of the scenes lack impact. Especially later in the anime, during the major action scenes, there was inconsistent, questionable animation quality, although the action scenes really could look swell at times. The OST was forgettable, but at least the sound effects and voice acting were what we have come to expect from this series. I'm not sure how well the series will be able to recover from this season.",
            "date": "2019-04-06T04:02:00+00:00",
            "helpful_count": 3,
            "mal_id": 305598,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6716388.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/AngryCactus",
                "username": "AngryCactus"
            },
            "url": "https://myanimelist.net/reviews.php?id=305598"
        },
        {
            "content": "Toaru Majutsu no Index III or a certain magical index III has  been  full of anticipations  and excitement as the previous season end was foreshadowing the events that were about to come since this is the climax for the old testament (which is this season), however it is starting to turn into an anticlimax..., Let's start of with the story\r\nStory: 3/10\r\nAlthough this was adapted from the novel (which is probably the best novel i have ever read), It has been executed very poorly through the first half of the season and i bet it's going to continue like this through the end,now you ask if this was deliberate i would say yes, if you ask why the answer is simple: JC staff doesn't care about the story i mean they are omitting the necessary parts of the dialogue such as the details that are mentioned in the story(LN) that make up most of the plot,  Its like all they care about are fan service: such as panty shots, jokes and etc etc... ok i would say fan service here and there is fine but too much of it start's to make the viewers watching experience boring (especially those viewer's who wanted to see some substance in this anime ). JC staff think's that they might lose views cause they think that majority of the viewers only care about the fan service. Overuse of  fan service has plagued the anime industry as people think this a better way to earn more cash. It definitely doesn't encourage people to switch on their brains while watching, sad... and they are definitely rushing it\\n\\n\r\nArt: 5/10\\n\r\nOk seriously i wasn't expecting movie animation but this this way below s2 art let alone railgun SS,\\n\r\nHow did they mess up here, the cg is terrible. Some  Part's of the scene (cg):  from accelerator vs a certain powerful villain was almost crap, I mean what was black thing accelerator was using on the villain, It was never seen in the previous season and it was definitely not some new power(also vector's used the previous season never emitted that dark thing or anything at all (please note here i am not talking about his wings),  Kanzaki face when she was battling a certain  knight leader was crap not much hard efforts put what so ever, Now they did  have some  good  animated parts but i feel that some of the important parts were made a mess of \\n\\n\r\nSound: 6/10\\n\r\nToma's imagine breaking sound while using it has changed, accelerator attack sound effects used were new but some what ok and the ost can hardly be remembered and was definitely not catchy\\n\r\nThe opening, first and second end song were ok but i doubt the second end song is memorable\\n\\n\r\nCharacter: 7/10\\n\r\nThe reason i gave this score is because of the addition 1 more protagonist hamazura, also misaka continues to be a side show and keeps on acting like a tsundere, guess her time to shine is in railgun S3  -_-\\n\r\nToma continues to be toma, with misaka no longer in the protagonist picture (cause she does almost nothing) hamazura, accelerator are the only one's to see in action. Toma is not so annoying but speeches about being righteous are nothing but boring. Accelerator and Hamazura are playing a good role, but it's painful to watching this rating go down just because the story(anime) that destroyed their development as a character on the contrary the LN did a better job in portraying their character especially hamazura who is way better than toma  (-_-)\\n\\n\r\ni wouldn't say anything to index cause there is a chance she might get involved, but  up till now not much\\n\\n\r\nEnjoyment: 2/10\\n\r\nCurrently it on the crap level and i doubt its going to improve, definitely didn't enjoy this\\n\r\nI wanted to give this a 1 but i still have some respect for this series as a whole\\n\\n\r\nOverall: 4/10\\n\r\nIn the end it's come to only one conclusion this season is the one of worst anime to be ever adapted from the best novel, The best story was given to JC staff on the platter but they just made a mess of it.  My advice: don't watch or watch (if you think they can change the current cluster fuck situation) such misfortune.....\\n\\n",
            "date": "2019-01-31T07:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 300479,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7771316.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 1,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Rogue_Player",
                "username": "Rogue_Player"
            },
            "url": "https://myanimelist.net/reviews.php?id=300479"
        },
        {
            "content": "A train-wreck that I cannot stop watching.\r\nSeriously what is going on? I didn't read the novels but I can tell for sure that a lot of content was skipped. The objectives are hardly ever made clear, and even if they do, somehow they find a way to rush it or make it so cheesy that I swallow my own vomit. \r\nThe art, the animation, the music are well done. And when they want to make it look good, trust me they make it look really good. The music is the typical Index type music we all know, nothing amazing but gets the job done well.\r\nTheshow is just a big disaster but yet I cannot stop watching it. Perhaps its the concept of everything that makes me want to watch it. Because if you look at the franchise as a whole, the plot is really interesting. A war between science and magic? Hell yeah that's cool. A power system that is made through real world physics? Why the hell not? And an internal, political power struggle between the higher ups and the ones below them? Count me the hell in. And yet, the show does nothing with that. The plot is good, but the execution is so bad that sometimes it makes me sad, because I wonder, how awesome would this show be if the people at J.C Staff actually gave a shit about the plot.\\n\\n\r\nThe war is carried out in such a boring way that it feels like they're making me do a Try Not to Sleep Challenge. The interesting power system is kept in the side in this season and more focus is put on the \"just because\" element of magic. And oh man the power struggle can make no sense at all some times. I'll give credit to some of the characters. Accelerator is carrying the show because of how interesting he is, and Misaka's is still charming in her own quirky way but man I wish she had more screentime. Touma and Index are... boring. GROUP as a whole are very fun to watch even if I can't understand a lot of what they're doing.  \\n\\n\r\nThe problems in this season is nothing new to anyone who has been following the main Index series, but it's like they went Plus Ultra with the problems this time. If you're someone who has been following this series for a while, you'll still watch this even if you know the problems. If you're a casual fan who recently got into this franchise you'll probably will drop this after a few episodes. And if you're new to the franchise and are thinking about if you should commit fully to this franchise, eh.. go ahead? But know that its hard to get into. I myself am going to read the novels from now on to understand wtf is going on.",
            "date": "2019-01-27T03:56:00+00:00",
            "helpful_count": 3,
            "mal_id": 300150,
            "reviewer": {
                "episodes_seen": 15,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6440278.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Meren",
                "username": "Meren"
            },
            "url": "https://myanimelist.net/reviews.php?id=300150"
        },
        {
            "content": "I really liked how this series started. I meant the whole To Aru series, including side stories like Railgun. This is due to how fascinating the world adapts to people with \"Abilities\" how the whole story revolves around those. But sadly this series just made me lose interest on the whole thing. I find most episodes \"tiring\" to watch as there's so many random characters that probably showed up on the prequels and it's like it's expecting me to know who they are and what they did in the story. I'm partly at fault because the anime is there, so I should watch it, right?Still, I try to go to some sites to read up on these characters and as I do, I just get more confused and it spawns questions causing me to read up. In the end, I am more confused than I started out with and I spent more time than the 24 mins of episode just reading.\\n\\n\r\nThe plot became quite convoluted that I don't really know what's happening aside from Touma using his hand to fight \"bad guys\" that after a few episodes, would be his allies/lovers. This will probably the last of the series I watch.",
            "date": "2019-04-07T03:27:00+00:00",
            "helpful_count": 2,
            "mal_id": 305678,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4578340.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/-ShInIgAmIsAmA-",
                "username": "-ShInIgAmIsAmA-"
            },
            "url": "https://myanimelist.net/reviews.php?id=305678"
        },
        {
            "content": "Index has suffered the poor fate of being created created by J.C Staff, and you can tell at first glance that this was nothing more than one last cash grab before the studio goes bankrupt. This is evident from the very start, and you can tell that the team behind this couldn't give a damn about the quality. Seasons one and two were also made by J.C Staff, however with a different director and actual budget. However when looking at an anime what really matters is the story, and this was the one chance of redemption Index season three had. So was the story good?Well yes and no, the story was definitely there except you'll find yourself asking yourself what is happening time and time again.\\n\\n\r\nThe Toaru Majutsu no Index light novels are among my favourites of all time, and this is because story and everything that happens in the universe of Index. All around the world of Index many plot holes are constantly unfolding and it really helps the world come to life. The universe Index takes place in is big enough to earn itself 2 Spinoffs, one also receiving three seasons. Index season three is the best example of everything the world has to offer, especially in the final arc where an entire WW3 breaks out where we get to see almost everyone from earlier episodes play a role.\\n\\n\r\nAfter all the praise I'm giving to the story it might not sound that bad, but watching it unfold in the anime is the most hellish experience one can have. Not only is it rushed to the point where over half the light novel scenes get cut out, inner dialogue is cut out and overall nothing makes sense. The light novels for Index are packed with important details and information which are barely scraped in the anime. Even as someone who has read the novels this is incredibly hard to follow, and everything that happens feels like it serves no real purpose.\\n\\n\r\nI'm not about to hate on an anime because of the art and animation, but when the first season that aired back in 2008 looks better than this there is a serious problem. half of this anime consists of either still shots or some of the most derpy looking movement I've ever seen. If the animation team can't even get still images right you can only imagine what the fights look like. I liked the fights in both Index and its spin-off Railgun because of the unique set of laws of both magic and science used in the fights. Index three is no different, sticking to the same principles as the precious seasons, just this time a lot uglier. We barely even see these amazing abilities being used to their max potential, as the team behind this anime takes the cheap way out and ends most fights  with a Touma-punch to the face before any real fighting starts. Despite the crappy animating I can proudly give praise to the background tea because damn do th backgrounds look good. The background team in my opinion is highly overshadowed and the work goes to waste with the trashy art over it.\\n\\n\r\nAnother thing I love about the universe of Index are all the characters. Season three has multiple characters with high importance, and all their ideals are constantly clashing. I'll try to summarise a few of them from the eyes of a light novel reader\\n\r\nAccelerator- By far best boy. Not only is he badass, he gets some amazing through the many volumes he is in. He started as a killing machine with a sweet ability, but slowly learns to love and protect as well.\\n\r\nTouma- Touma Kamijou is supposed to be the main heroine of this series. He can negate all supernatural powers with his right hand, and solves most his problems by punching people in the face. Not the greatest character of all time, but makes for a nice protagonist.\\n\r\nHamazura- A level 0 with no abilities. I find his character annoying but he is essential to the plot. He is part of a group named GROUP (ironic I know) which become necessary later down. Hamazura isn't necessarily a main character, but not really a side character either.\\n\r\nMisaka- Best girl by far. Also known as Birbiri she is a tsundere with electric powers. A perfect combination and good waifu material ( if you don't mind being electrocuted).\\n\\n\r\nRemember, that was in the light novel. But what about the anime? The characters mentioned above still suffer from the same issues as the story; they are rushed, boring, and their actions make no sense. There are also many side characters with the same issues and everything becomes a nonsensical mess. Everyone's personalities and traits are highly different from the novels and don't match up with the first two seasons at all.\\n\\n\r\nOne thing I can safely praise are the soundtracks and openings. The music is intense and sounds amazing, but sometimes doesn't match the themes of the current scene. As for the openings, they are amazing. opening two, Roar, has some great visuals and fights, as well as an amazing song. A shame the quality doesn't hold up for anything else though.\\n\\n\r\nThe only way you can enjoy this pile of trash adaptation is if you have read the novels. Once you understand everything the choices and decisions that are made begin to make a bit more sense, however if an anime is difficult to follow from the very beginning then it fails at every job it had. I highly recommend the novels or spin-off to get the full experience of the Toaru universe.",
            "date": "2019-04-06T00:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 305589,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7523460.jpg",
                "scores": {
                    "animation": 3,
                    "character": 3,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 8,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Gilliesss",
                "username": "Gilliesss"
            },
            "url": "https://myanimelist.net/reviews.php?id=305589"
        },
        {
            "content": "Ah, alright. Let's do this. \r\nStory: 7/10. The story CONCEPT is really cool. The execution.... heh. We'll get to that later. \r\nArt: 5/10. I'll admit that I'm no expert on anime artwork. But even I could tell that this seemed.... a bit lackluster? And others appear to have agreed. \r\nSound: 7/10. I'm actually not as peeved about the sound as some other people are. I thought it was fine, and had some good moments. \r\nCharacter: 4/10. Oh boy. Here we go. Look, the main characters who we ACTUALLY care about are lovely. Touma, Index, Mikoto, Accelerator, Hamazura, Kanzaki, Itsuwa, Stiyl, Tsuchimikado, Kuroko, Uhiharu, Last Order,Miguno, Misaka Worst, Fiamma, Crowley,.... And I'm sure that I'm still missing some others. Now, you might be thinking, \"Wow! That's a LOT of characters! Surely, they can make a compelling story from that alone!\" Hah. Yes, maybe in the first two seasons, that was somewhat the case. But in Index III, there are tons of new characters introduced in very quick intervals, and many of them hardly get any explanation or are killed off almost as soon as they show up. By the end, your head is spinning trying to keep track of who's who and who's fighting for which side and what the motivations are. And that leads me to.....\\n\\n\r\nEnjoyment: 5/10. This is going to seem more like a continuation of the 'character' category, but there's a reason for that. The storyline is enjoyable in concept, and would have probably gotten at least a 7 or an 8 out of 10 from me, if not higher. But its *execution* with its characters is just.... yuck. I already mentioned how this show likes to throw more characters at you than you're able to shake a stick at. But furthermore, half of their motivations are hardly even explored. Now, this might not be the end of the world, except for one teensy little problem. This anime has made a staple out of bad guys being redeemed as good guys CONSTANTLY. Well, it's not very enjoyable when a bad guy just suddenly does a 180 degree turn and starts fighting for the good guys for no real descernable reason. When there is little to no exploration as to WHY the bad guy's motivations have changed for the better, it just comes off as confusing and cheap. Plus, people like Touma are always just punching people and giving them little pep- talks which seem to change everything in the course of 30 seconds or less. The first two seasons seemed to just barely keep this in a reasonable balance which kept it right below the threshold of absurdity. But this 3rd season just blew the freaking lid off. \\n\\n\r\nOverall: 5/10. I still love this franchise. And for that, I'll rate it as 'average' instead of anything below average. But I'm sure as hell not going to put it above average either. This season was so unbelieveably rushed, with so many characters and arcs flashing before your eys faster than you can even comprehend what's supposed to be going on. Many folks seemed to have been fairly lost this season, me included. Add to that the fact that even our beloved staple characters, let alone the side characters, seem to just be doing random stuff all the time and switching between good guys and bad guys at the drop of a dime, with no real explanation of WHY their motivations have suddenly done a 180 turn in 30 seconds.... yeah. No. \\n",
            "date": "2019-04-05T15:16:00+00:00",
            "helpful_count": 2,
            "mal_id": 305551,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7912687.jpg",
                "scores": {
                    "animation": 5,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Elisile",
                "username": "Elisile"
            },
            "url": "https://myanimelist.net/reviews.php?id=305551"
        }
    ],
    [
        {
            "content": "LA loves the Index/Railgun franchise, with all it's flaws and strengths and this third season is no different...buuuut\r\nToaru Majutsu no Index III comes about 7 years from the second season and LA was clamoring for another season with the lukewarm movie and specials to keep LA vested in the franchise, in which LA thought oddly enough the Railgun series, a \"spinoff\" series featuring Misaka was in a ways superior to the Index series. Anyways LA heard lots about the \"World War III arc\" and how great that was so without a doubt LA was hyped by the third season's announcement.\r\nOk, so enough brass tax andlet's see whether this third season tops any installment of it's previous seasons or Railgun by that matter.\\n\\n\r\nProgression is the name of the game and man how RUSHED do they pace this anime, without a doubt one of the biggest issues with Toaru Majutsu no Index III is it's erratically rushed pacing throughout the anime. But on the upsides the To aru Universe grows with the progression of ALOT of plotlines , new and old woven together into this complex tapestry that leads into the World War III arc.\\n\\n\r\nTouma deals with the remaining Four Seats of God members (from the second season) and well things escalate quickly to say the least, from the Four Seats of God attack towards Academy City, from Touma being whisked away to Italy and with the help of Itsuwa, help defeat Terra of the Left then moving along with the Amakusa Church along with Kanzaki helping to subdue Acqua the Back, to Touma going to England to help the Queen of England get the original Curtana back which leads into his confrontation of Fiamma the right which triggers the World War III and Touma going to Russia to save Index and defeat the \"final boss\" Fiamma the Right. To say that Touma gets into a whole lot of trouble is an understatement but yes Touma's arcs deal ALOT with the rushed pacing LA aforementioned.\\n\\n\r\nAccelerator gets his progression as the \"anti-villain\" in all this as he's become a mercenary for Academy City and his \"call\" to World War III is what else, Last order being comatosed and Awaki saying that Fiamma & Russia has the means of stopping Last Order's coma and fix her. Accelerator in this season, his sense of \"villainous intent\" is questioned, as he still thinks he's a \"villain\" or \"has to be a villain\" in order for him to do what he needs to do and this easily is seen when he interacts with anyone cept Last Order, like Accelerator \"wants\" to be seen as a hero especially towards Last Order, but he just hates the concept of it and rather be the villain, but \"villains\" can only destroy. Much like Touma getting a harem along the way, Accelerator DEFINITELY does this season, smaller than Touma's of course but the parallels to his harem is noticeable, as Accelerator already has an \"index\" in the form of Last order, but Misaka comes into the mix and well, this \"Misaka\"...is ohh soo WORST in a good way that his chemistry with her is actually quite amusing. But yeah, once again, the rushed pacing of his progression though not as harsh as Touma still lingers, but his progression as a character was a vast improvement, what with season essentially making this a redemption arc for him and seeing the error of his beliefs as a \"villain\"\\n\\n\r\nRounding out the trio of main protagonist, we are introduced to Hamazura Shiage a Level 0 much like Touma and a member of ITEM along with Mugino and her co. and Hamazura at first was directly opposite Accelerator due to Hamazura being in the bottom of the totem pole of the Dark Side of Academy City. Once again, the Touma harem parallels are seeping through with him and Hamazura's Index comes into form as Takitsubo Rikou, the AIM Stalker user and when Mugino goes utterly rogue, it utterly tears ITEM apart and both Takitsubo and Hamazura has to fend for themselves while both Mugino and GROUP are after them, to say that Hamazura is ALSO unlucky is a freakin' understatement, but like Touma, he is EXTREMELY lucky at the same time with all the situations he gets himself into. Yes, Mugino is the Misaka of Hamazura harem...no seriously. Like Accelerator, Hamazura wants to save Takitsubo after a defect occurs with Takitsubo and thus takes them to Russia where Fiamma the right is.\\n\\n\r\nSo with all three main protagonists heading to Russia and Fiamma the Right, incomes World War III and it's.........\\n\\n\r\nOk, not amazing or anything but what this climax leads to with the revelation of each of the protagonists and some major fights leading itself it was just fine, LA could see it being MUCH MUCH better but what LA got, it \"mildly satisfied\" LA. Well at least the climax to all this each of the main protagonists goes through tons of development about themselves as well as the relationships and villains that form around them. Accelerator and Hamazura goes through some of the same thing, just in the opposite spectrum alot of the time and some similarities of them wanting to protect those close to them and showing a bit more about themselves, Accelerator of again the aforementioned \"villain dilemma\" and that just doing the right thing is proof enough at times, while Hamazura gets out his inferiority complex and not only wants to protect Takitsubo but everyone (much like Touma). Touma is the only one in LA's eyes that gets any intense development what with Touma being somewhat integral to Fiamma the Right, both in ideology and powers, see Fiamma the Right has a \"right hand\" that can create miracles and destroy evil, so in a ways like Touma's right hand and Fiamma \"wants to save humanity\" with his plan, but Touma is also tested with what Fiamma's idealogy of why when Touma always tells someone to there is always another way besides violence and whatnot and Touma's entire ideology of white knighting those he protects are questioned, but strengthened when confronted with Accelerator and his final fight against Fiamma as a result. LA liked the ideological clash and questioning Touma's beliefs in justice to say the least in World War III arc along with what Accelerator and Hamazura's involvement in all this, it felt like a climax to the majority of the threads, even from the first season to get some major payoff in this arc, without a doubt.\\n\\n\r\nWhat the problem however and say it with LA, the rushed pacing and the long expositions drag this season down and LA thinks it's even worse from the second season. Look exposition is necessary, but having entire episode dedicating itself to some much detail just bogs the plot down and slows it down and as a result latter on rushes the arc to finish the quota and quite obviously it leads into confusion at times with how erratically paced it is and it's not just World War III arc, it's the ENTIRETY of this third season and quite easily this installment is the biggest victim of rushed pacing.\\n\\n\r\nThe animation done by JC Staff, well LA KNOWS alot of people utterly hated the animation, but to be honest, it was actually decent, flip flopped alot but still decent. See though the animation dips ALOT, JC Staff seemed to have dedicated it's animation to World War III arc the most as it has some decent quality control put into it, making it as much of a climax as possible. Yes even the World War III arc does dip in the animation at times, but JC Staff did the best they could in LA's eyes and was the probably the most consistent during the World War III arc, but nonetheless some arcs from this third season still had the quality LA was expected from Index, just erratic in places. In all and without ANY bias to JC Staff, the animation was erratic as hell, bottom line.\\n\\n\r\nVoice acting at least was great, from Nobuhiko Okamoto's screechy Accelerator back at it again, Atsushi Abe as Touma, Rina Satou as Misaka, Satonshi Hiro as Hamazura and Yuuki Takada as Lessar. Toshiyuki Morikawa (wait...YOSHIKAGE KIRA!) as Fiamma the Right was just oozing villany to heck Kei Shidou as Carissa was impressive as well. Seriously LA would be here all day if LA noted everyone that even caught LA's interest, so to that the majority of the cast fit the bill, new and returning ones of course and to say that LA was impressed with this voice cast of this magnitude is an understatement...what with how large of an ensemble cast of revolving characters comes along.\\n\\n\r\nSo, yes To aru Majustu no Index III has a MAJOR MAJOR pacing problem that does utterly cripple this season to no end, LA still sees Railgun as the better series to this front, and towards the Index series, it's...unfortunately the worst installment of the franchise, even though it's suppose to be the climax to all the plot threads that leads itself into a huge evolution of the majority of the characters, it's kinda a damn shame as if it had much better direction and kept consistent animation World War III arc would had been bloody amazing.\\n\\n\r\n-sigh- at least there still will be Railgun III and Accelerator spinoff that might carry the mantle of \"best installment of To aru\", but for now that title stays with Railgun II (yeah LA said it).\\n\\n\r\nFukou da To aru Majutsu no Index III...Fukou da...",
            "date": "2019-04-05T12:15:00+00:00",
            "helpful_count": 2,
            "mal_id": 305537,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=305537"
        },
        {
            "content": "This anime is kinda sucks & really painful to watch\r\nback in 2016 i heard an anime series called \"A Certain Scientific Railgun\" & enjoyed it so much that i made Mikoto Misaka as my \"One and Only Waifu\". Turns out that ASCR actually a spinoff of the \"A Certain Magical Index\" & quite enjoy it despite confused by the plot\r\nthen in 2017 i heard that the Season 3 of Index is being announced & i'm a bit of hyped back then. But, my expectation was a bit of disappointed when \r\nStory: 9/10\r\nthere's nothing wrong at the story, just a poor execution on this adaptation\r\nArt: 3/10\r\nthey(JC Staff) claim that the art style will be akin to Railgun S & The Movie, but they were wrong. The graphics are kinda Index II'ish, but extremely downgraded to the point that it actually comparable to Ore Imouto on last season (not as bad) & a lot of derpy face here & there\\n\\n\r\nSound: 8/10\\n\r\nthe soundtrack is pretty fine for the epic story (thanks Maon)\\n\\n\r\nCharacter: 1/10\\n\r\nthe characters are all botchered version of their LN counterpart, especially Hamazura (barely felt like a third protagonist & felt like a supporting character) & alot of characters are being introduced and killed off at the same time without proper characterization\\n\\n\r\nEnjoyment: 2/10\\n\r\nwatching this series as Anime Only will felt kinda confusing, but for the die hard Toaru fan is really painful & guilty pleasure at the beast. I always had a urge to dropped at some point until i gave up on 6th episode\\n\\n\r\nOverall: 5/10\\n\r\nthank you JC Staff, you ruined my beloved series. I can't believed that you actually could do your best at Railgun S but why not try the same on Index? \\n\\n\r\nIndex s1 & II are still keeping the spirit of the LN, but this 3rd season is the example of the worst scenario of \"Compressed Adaptation\"\\n\\n\r\nfor those Anime Only who somehow interested on this series, avoid this season & stick to the Light Novel and Manga (the only definitive adaptation at least) and hope for the Remake",
            "date": "2019-03-18T00:54:00+00:00",
            "helpful_count": 2,
            "mal_id": 303786,
            "reviewer": {
                "episodes_seen": 6,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6307753.jpg",
                "scores": {
                    "animation": 3,
                    "character": 1,
                    "enjoyment": 2,
                    "overall": 5,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Japije01",
                "username": "Japije01"
            },
            "url": "https://myanimelist.net/reviews.php?id=303786"
        },
        {
            "content": "What an absolute disaster of a sequel. After years of waiting all we got was this mess. It would've been better to just end it with just season 2 and not bother with a third.\r\nThe pacing is very confusing, almost reminds me of Tokyo Ghoul : Re season 2. Very fast and makes no sense. A lot of the things that happens is questionable, a few main thing is power scaling. Someone who can booty clap on people 1 moment, but after a few hours later (literally says in anime) they're almost on equal footing for a brief moment??? What kind of power up isthat?\\n\\n\r\nVery questionable with how some people are perfectly fine, mainly looking at the main character who is JUST A NORMAL HUMAN BEING WITH NO SPECIAL POWERS, somehow gets to second floor underground when there's no elevator and had to have jumped like everyone else yet somehow made it fine??? Trying my best not to spoil\\n\\n\r\nEverything in this anime is questionable. Overall not recommended, is confusing with its pacing, they jump from scene to scene and you're left wondering y tho",
            "date": "2019-03-11T23:59:00+00:00",
            "helpful_count": 2,
            "mal_id": 303356,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/510123.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Lexmin",
                "username": "Lexmin"
            },
            "url": "https://myanimelist.net/reviews.php?id=303356"
        },
        {
            "content": "Please be aware that this is my own opinion and others may feel differently.\r\nWhen I read that there was a Toaru Majutsu no Index III I was quite glad because I had enjoyed the first series, although the 2nd was not as good. I am afraid the 3rd is awful. To be frank I have no idea what it is about, who half of the characters are or what they are even trying to achieve by resurrecting the show.  \r\nTo be fair the artwork is still very good and the OP is enjoyable and even Touma is pretty much the same as he wasin the other series. However, Index has become a pain, all she does is irritate and seems to add nothing to the story. Story? there is one? I wish I knew what it was supposed to be about.  I was hoping to oggle Misaka too while I was about it, but she is really just eye candy with no real definable role.  \\n\r\nI will be honest and admit that this is a waste of time, I have watched up to the 12th episode and I am sure that if I watch the last episode and nothing inbetween I will not have missed much. The current rambling discourse is some mumbo jumbo in England, but what the back story to it is I have no idea. \\n\r\nNope, I am dropping this one, it does not even come close to the first series all those years ago, this is really a dead horse that should have never been made.\\n",
            "date": "2018-12-22T08:22:00+00:00",
            "helpful_count": 2,
            "mal_id": 296500,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/122299.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 2,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/nixops",
                "username": "nixops"
            },
            "url": "https://myanimelist.net/reviews.php?id=296500"
        },
        {
            "content": "Throughout my life as an otaku I have witnessed many anime(over 250 if I may say). However A certain magical Index has by far piqued my interest the most. It’s ability to create unique characters whom can’t be catergerized as simply hero’s or villains, but individual protagonists of their own inherent stories. In this sense a Certain Magical index is not a story of a boy with the ability to nullify the supernatural, but a boy and the people he has affected with not just his power but his weakness. The story focuses on Toma Kamijo, a boy who in my opinion is one ofthe greatest anime protagonist of all time. An individual whom is sucked into the world of magic and esper abilities. The thing that I find most striking is that his ability of nullifying the supernatural is neither an offense or defencive ability. In its stead his ability is the ability to make overpowered characters unoverpowerd. In other words this is a story not of an individual with fighting potential but in its stead a story of an individual tearing down the small logic of our worlds, of those with exceptional capabilities and revealing just how stupid we are as individuals, and how admirable. \\n\\n\r\nStory\\n\\n\r\nThe story is good in the sense that it’s ability to utilize phenomenon and other fundamental ideologies to produce a logical plot line is amazing. However the terminology and requirements for understanding this are high level. As such this is a plot line meant for those of exceptional reading and understanding capabilities. \\n\\n\r\nSound\\n\\n\r\nIt was good at some points, other could be improved but it was decent overall.\\n\\n\r\nArt\\n\\n\r\nThe art was moderate and not bad. I’ve seen better but I’ve also seen much worse.\\n\\n\r\nCharacter\\n\\n\r\nThe character development in this anime exceeds all other anime’s I have seen. Never before have I witnessed an anime that is able to truly make a two dimensional character so human, so alive. What is exceptional about the development is that the supporting characters are all given thorough attention and rarely left alone. Every character is significant, every character grows, and every character is neither a villain or a hero. At the end of the day their Highschool students. And that’s what makes them such good characters.\\n\\n\r\nEnjoyment\\n\\n\r\nI can easily say this is one of my top anime’s ever.",
            "date": "2019-05-03T05:40:00+00:00",
            "helpful_count": 1,
            "mal_id": 307702,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 9,
                    "overall": 10,
                    "sound": 7,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Jeffjta21",
                "username": "Jeffjta21"
            },
            "url": "https://myanimelist.net/reviews.php?id=307702"
        },
        {
            "content": "Wonderfully animated, excellent sound, and great coreography! Everything else? Abysmal.\r\nThey couldn't even bother to make Terra's ability coherent. First he somehow survives a giant laser which cuts through rock like paper. His ability requires him to say \"precedence self -> laser\" or something but he just gets baked alive. Then he reappears in the next scene, literally says \"I can survive anything, so long as it's just one thing at a time!\" ... Not 5 seconds later his comrade drops a rock on him and he dies. It's just... Sigh.\r\nThe series contains almost no plot or character development; it's merely one battle after another mixedin with contradictory terms, lots of talk no jutsu, and so many \"gotcha\" moments that it becomes routine. The entirety of Accelerator's screentime involves him rambling about being a villain while doing absolutely nothing villainous. Index is seen in the shower and chasing a cat. Some random people get involved in the story only to die immediately. Stuff blows up more often than a Michael Bay movie and I have no idea why I should care.\\n\\n\r\nThe coup de grace? A battle... for lunch. No, really. I quit watching. How did it get EVEN WORSE?",
            "date": "2019-04-19T15:32:00+00:00",
            "helpful_count": 1,
            "mal_id": 306694,
            "reviewer": {
                "episodes_seen": 7,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 1,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 9,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/Mekronid",
                "username": "Mekronid"
            },
            "url": "https://myanimelist.net/reviews.php?id=306694"
        },
        {
            "content": "Index 3 does not exist. If they ask you something, this season never happened. \r\nThe animation was horrible, and because of that we could not enjoy the fights. \r\nThe story was completely rushed, there were 9 volumes in 26 episodes, 9 volumes is what SAO: Alicization is putting in 50 episodes and still suffering with cuts. \r\nThe director? is busy directing the movie of Trinity Seven.  \r\nThis season is a huge disregard for any fan of the franchise, they simply showed the middle finger to us.\r\nAnd I bet, that Railgun 3 and Accelerator, will come out much better than that. Even if Index iswhat sold the most.\\n\r\nI hope they do not touch those dirty hands of the J.C Staff and the Nishikiori in the New Testament.\\n\\n\r\nINDEX 3 DOES NOT EXIST!!!  \\n\r\n#RebootTheOldTestamentNow",
            "date": "2019-04-05T15:36:00+00:00",
            "helpful_count": 1,
            "mal_id": 305553,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4375797.jpg",
                "scores": {
                    "animation": 1,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 3,
                    "sound": 4,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/UmMLKNoMundo2D",
                "username": "UmMLKNoMundo2D"
            },
            "url": "https://myanimelist.net/reviews.php?id=305553"
        },
        {
            "content": "This has got to have a season four, And its kind of annoying that i wish this was/has a romance genre . Not with index but with Misaka i like Misaka than Index... Index's character is flat she don't really change  and misaka mostly she's static type of a character and she's cuter than index \r\nSorry for the people who like index . But personally i like Misaka better  right now i'm in just a computer shop skip classes just to write a review here hahah. \r\nI'm a filipino and i'm not proud to be a filipino.\r\nI like 2D or i mean animerather than reality, well that's common knowledge for someone who likes anime ! \\n\\n\r\nBack to topic \"what i'm saying is that to aru's next series must have a romance genre  !   please author give this anime some romance and it will be really great ! \\n\r\nAnd one more thing the clones of misaka at this series ( A certain magical index ) \\n\r\nThey look lifeless because of there eyes. I know that they set it that way so we could know whether if it is Misaka or her clones , But still I think they look better at (A certain scientific railgun )",
            "date": "2019-03-20T20:39:00+00:00",
            "helpful_count": 1,
            "mal_id": 303947,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7896943.jpg",
                "scores": {
                    "animation": 7,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/sketchbook017",
                "username": "sketchbook017"
            },
            "url": "https://myanimelist.net/reviews.php?id=303947"
        },
        {
            "content": "i am very happy when this anime finaly come, very exiting watch again touma and friend. but i am very disappointed with the animation in this anime, some character become have annoying face and key between movement become weird. i think its because the deadline and the other, so the works not very well. overall i things this anime can still to watch till the end, because have a good story. sory i have a short review because this my first\r\nsinopsis :\r\nSet in a city of not only scientifically advanced superhuman students, but in a world where magic is also real. Kamijyo Touma's right hand,the Imagine Breaker, will negate all magic, psychic, or divine powers, as well as his own luck. One day he finds a young girl hanging on his balcony railing. She turns out to be a nun from the Church of England, and her mind has been implanted with the Index Librorum Prohibitorum—all the magical texts the Church has removed from circulation.",
            "date": "2019-03-19T06:28:00+00:00",
            "helpful_count": 1,
            "mal_id": 303843,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3550515.jpg",
                "scores": {
                    "animation": 5,
                    "character": 7,
                    "enjoyment": 5,
                    "overall": 6,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Yashi_Reikan",
                "username": "Yashi_Reikan"
            },
            "url": "https://myanimelist.net/reviews.php?id=303843"
        },
        {
            "content": "I tried giving season 3 time to redeem itself, but unfortunately it hasn't lived up to any of its potential. I gave the story a high score only due to the source material being written very well. Aside from that, the art clearly skipped in many areas and is rather bland in most cases. The details that are shown don't correspond with the actions surrounding them, and on a few occasions facial emotion and character actions are completely disconnect from the voice acting and context of the story (Think Touma saying in a pained voice \"No!\" as someone falls down a cliff, but his faceis deadpan like a fish). That ties in to the overall character score, as the adaptation leaves a lot to be desired in terms of character exploration. Too many details have been left out, and it reduces wonderful characters to cardboard.\\n\r\n I'm going to watch to the final episode only because I've come this far already. But I HIGHLY recommend reading the light novels instead. \\n",
            "date": "2019-03-17T23:57:00+00:00",
            "helpful_count": 1,
            "mal_id": 303784,
            "reviewer": {
                "episodes_seen": 23,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5892304.jpg",
                "scores": {
                    "animation": 4,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Umberflare",
                "username": "Umberflare"
            },
            "url": "https://myanimelist.net/reviews.php?id=303784"
        },
        {
            "content": "The character of Accelerator is an interesting one. He gets a lot of development through out the series and it appears to culminate with this season's finale. I was never able to sympathize with the character: \r\nhe has wild outbursts, unpredictable hysterical laughter and has a weird villain persona (or tries to act one). I never found him interesting but the last episode changes everything, that passionate laughter, that insane look on his face and that loli fetish he has: it all makes sense now, it all comes together. He is an angel. He was an angel all along and now I understand what drovehim so mad, for the first time I shared his rampant laughter as he Accelerated towards the heavens and the shitty flute music made it even more hilarious. Never have I ever been so emotionally attached to a character.",
            "date": "2019-04-27T11:55:00+00:00",
            "helpful_count": 0,
            "mal_id": 307257,
            "reviewer": {
                "episodes_seen": 26,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/supdahey",
                "username": "supdahey"
            },
            "url": "https://myanimelist.net/reviews.php?id=307257"
        }
    ]
]