[
    [
        {
            "content": "*Spoilers will exist to explain why this show is great*\r\nStory: 8\r\nNow some of you have heard that time is considered part of the fourth dimension, but what if you were told that there is a dimension that contains all of the possibilities in the world? This is basically what the story is based on.\r\nThe anime does not explain the mechanics of Dimension W too deeply, but it explores it enough to give us an understanding of what it's trying to convey, such as when coils go haywire and Dimension W manifests in the real world, or when the characters are able to enter Dimension Wand see all the possibilities. However, the actual use of Dimension W is a bit superficial outside of that. Everything just mainly revolves around coils and the 'possibilities' get shoved back as more of a nominal thing. So in the end the actual usage and exploration of 'possibilities' was a bit minimal, and may have become more of just a theme to a battle story with some cute moments.\\n\\n\r\nAnd as good as the combat was, it seemed a little odd at times. Mabuchi seems to just freely throw out however many dart things as he likes, while being able to wire them so he can perform spiderman or AOT style swings and climbs as he wishes, along with the fact that they can also act as some sort of snare. There wasn't any moment where he ran out of darts or was in any particular danger due to his choice of weaponry which kind of made him a bit of an immortal god of sorts. \\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nArt: 9\\n\r\nIn regards to the art, it was very well done, especially the characters. They stood out well and were designed quite differently. Mira was consistently cute, Mabuchi maintained his gruffness, Loser maintained his enigma while Lasithi was designed quite sexily. The use of colour was appropriate to the moment, though backgrounds would occasionally look quite bland.\\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nCharacter: 9\\n\r\nAs for the characters, I did want to give it a 10, but the only thing that ruined it was the main antagonist, Haruka Seameyer. He was just a little too cliched with his insanity and cruelty. He just didn't feel unique enough as an antagonist for me to really be drawn to him and to actually hate him for his existence (like Joffrey in Game of Thrones). \\n\r\nHowever, setting aside the antagonist, Mabuchi Kyoma is quite the likeable character. He's strong and independent (not clinging to friendship nonsense), and has a cool attitude but with a sad history. \\n\r\nWhilst Mira is the lovable female MC who's a robot with a full human personality. She cries, blushes, and even expresses pain. She's funny, cute and most of all, has a consistent character. \\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nSound: 9\\n\r\nThe voice acting in this was also great. Mabuchi has a cool, deep and slightly apathetic voice that suits the character and helps set him apart from everyone else, while Mira has an appropriately feminine and cutesy voice which greatly complements the character. \\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nEnjoyment: 10\\n\\n\r\nOverall: 9\\n\r\nOverall, I really liked this show. Maybe I'm biased towards shows that can have a consistently cute girl and who isn't annoying or out of place. Mira is not your damsel in distress, but an actual partner to Mabuchi, which I feel really helped with me giving this show such a high score. And I definitely hope to hear more of her voice in future titles.\\n\\n\\n\\n\\n\r\n*Some further spoilers and personal inputs on what could have made this show even greater*\\n\\n\r\nThere was a line in the last few episodes that really helped bring the logic of the world and the coils together, which was: \"Possibilities can be predicted and explained but not observed, that is because once it is observed, it is no longer the possibility but the result. I.e. Schrodinger's cat.\" or something to that effect. \\n\r\nThis line alone is what could have made this show all the more interesting. Somehow manipulating Dimension W to bring about a favoured possibility which results in the defeat of the final boss. Maybe the anime studio ran out of time, maybe the author just wasn't ready for such a complex story. They had the opportunity to utilise it through Genesis, but ultimately removed it by 'destroying' Genesis.\\n\r\nWithout actually exploring the fundamental concept of possibilities which links the entire story together, the show was prevented from being unique and instead became another battle story with just a different theme, much like Bleach, Naruto or Fairy Tail.",
            "date": "2016-03-28T07:00:00+00:00",
            "helpful_count": 118,
            "mal_id": 214525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/2LongDidntReview",
                "username": "2LongDidntReview"
            },
            "url": "https://myanimelist.net/reviews.php?id=214525"
        },
        {
            "content": "If there's one anime this season that went unnoticed, unhyped, and maybe even unfairly underrated, it's Dimension W. While not the flashiest, and certainly not the most outstanding anime- DimW has one thing going for it: it's original. Sidestepping the trappings and tropes that seem to permeate modern anime, and instead embracing a groovy sci-fi near future with androids, flying cars, giant robots, and more- this one was a definite breath of fresh air. \r\nProduced by Studio 3Hz, apparently a very new studio, with literally one credit to their name, the animation and art aren't anything special, but neither are they completely uninspired. It's abit on the low budget side compared to some modern shows, but fluid and frenetic action coupled with some stylized CG made it very watchable. Similarly, voice acting is handled competently, and the music fits well, adding accents or enhancement to the mood when necessary.\\n\\n\r\nThe nearly infinite, but unstable energy source that the show is named for takes a front and center position in the plot- weaving a narrative around the creation of \"coils\", which as essentially batteries that can access the 4th dimension, a plane of existence where possibility is endless, and is tapped into as a source of energy. Everything takes coils: the robots, cars, computers, and nearly the entire world run on this limitless supply of energy.\\n\r\nKyouma Mabuchi, our main character, is essentially a luddite in this techno world of Dimension W. He works essentially as a mercenary, collecting special types of highly unstable coils which can create massive rifts in space/time, and generally screw up everything, including sucking people into the energy black hole it forms. In return, he gets paid in things like gasoline (a scarce commodity in this future-world) and parts for his \"antique\" cars. \\n\r\nKyouma's dislike for coils, robots, and essentially anything technological puts him at odds with the technologically obsessed world he lives in- in a sort of \"born in the wrong generation\" way. His rugged, tough guy, and often rude demeanor are offputting to most people he meets, but he's dependable to get stuff done when it needs doing.\\n\\n\r\nThe premise of the show is a fairly basic revenge tale, but this isn't immediately apparent, even through the first half of the show. The first section with Kyouma taking various jobs from his boss serves mostly as a semi-episodic adventure, introducing all the myriad characters, and then neatly segues into a long term plot. Without saying too much- there's a very collectible coil situated in a very dangerous area out in the Pacific ocean- one that is worth a lot of money, and none of the \"collectors\" (people like Kyouma who hunt coils for a living) can pass up. In a sort of \"Mewtwo Strikes Back\" kind of way- this alluring prize on an island in an old lab turns out to be more dangerous than any of the collectors can handle. They gather, each with their own goals and reasons for doing so- whether to use the money to help a decimated country, for personal greed, revenge, or just to satisfy bloodthirst, and this sets the stage for a battle royale of wits and wills. At times though, the show seems to lose sight of what it was going for- getting sidetracked on what are seemingly one off adventures that mostly end in Kyouma questioning something about himself, but not actually creating any new development. \\n\\n\r\nThe show has quite a large cast to be as short as it is, but this isn't all great, as many characters are relegated to first string bench warmer status, and play little to no role, especially later on. It does, however, do a fair job of returning to important moments from previous scenes, and wrapping things that seemed like dead ends up.\\n\\n\r\nKyouma's motivation for his job and raison d'etre are both explored at length. Finally, a show with a non-insert main character who actually has both tangible goals and reasons for why they do what they do. In his own angry-at-the-world way, Kyouma struggles against his inner demons, for love lost, his survivor's guilt, and the purpose of his continued existence in a world he no longer cares about. Cynical, hardened, and rather rage-filled, he makes for an interesting character who doesn't need anyone but himself, and honestly doesn't really care if people around him get hurt or killed. While not entirely heartless, he's a pretty cold and stoic character focused almost solely on his revenge. This isn't revealed immediately, but as we learn more about the character, we slowly begin to understand the obsession that eats at him.\\n\\n\r\nIn finishing, Dimension W was a nice change of pace this season- with a very action oriented show that wasn't preachy or pretentious in presentation, satisfying, and most importantly: unique. It's not a mystery, and it's not a pure shonen battle- it's got just the right amount of spice to keep things interesting, moving, and fresh. I don't think there are too many anime that couldn't benefit from longer to flesh out their ideas and really explore characters and plots, but Dimension W is just about right at 12 episodes. Any less would have felt extremely rushed, and any more would have unnecessarily dragged it out. A shallow anime that's enjoyable enough? Sleeper anime of the season? That's for you to decide. \\n\\n\r\nAs always, come rage at me, or say something nice. I don't care.",
            "date": "2016-03-30T07:53:00+00:00",
            "helpful_count": 67,
            "mal_id": 214793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=214793"
        },
        {
            "content": "Watching Dimension W makes me feel a bit like my childhood days. I’d watch some random anime on TV with my friends on Toonami and we’d make jokes about the story, characters, artwork, and every other funny thing going on. Dimension W isn’t a funny story but it does have the feel of a show that’s aimed at the Western audience. And furthermore, it takes place in a fictional world in the future so there’s tons of potential. Dimension W capitalizes on those potentials and makes this show not just fun but an insightful experience.\r\nCalling Dimension W another stereotypical sci-fi action flick would be injusticeas the series explores quite a bit based on its premise. The show is directed by Kanta Kamei with Aketagawa Jin as the sound producer and produced by Studio 3Hz and Orange. It’s noticeable that Funimation is the co-committee of this series as well to bring their talent into the mix. For those who have seen Darker than Black, you may find the show has a familiar vibe in terms of character design. The interesting part is how Dimension W focuses on its own story and despite not being too refreshing for its ideas, it’s very a high dose of popcorn entertainment.\\n\\n\r\nThe story takes place in a fictional world in the future. By 2071, humanity began using a source of energy that can last forever for their planet. Through influence of the fourth dimension, they are able to harness energy in the form of objects known as “coils”.  Coils are manufactured by New Tesla, an energy company that uses them for profit. However, they also private firms and groups that uses illegal coils for their own purposes. The show introduces Kyouma, a collector who has a hatred for coils. His adventures takes him to all sort of places including his meeting with a peculiar robot girl, Mira. Get the picture here? Any fan of sci-fi should feel intrigued because of the amount of world building with the show. Indeed, Dimension W does a good job by building up its fictional world and constructing it concepts with interesting details. The imaginary setting of Dimension W introduces many concepts including its rich history, society, and technological advancements. As such, getting into this show allows the viewers to appreciate the ideas of the creator.\\n\\n\r\nIn general, the plot is about Kyouma, a collector who despises coils. There’s actually a credible reason for this as explored in later episodes through background storytelling. His encounter with Mira is a bit odd however. Essentially and for most of the series, he is indifferent about her presence and often calls her names like “junk” and “useless robot”. Despite that, there’s a growing chemistry between the two. Mira is also a character that will spark interest because of her very human behavior. She is a robot but displays a lot of personality as if she is an ordinary girl. Throughout the show, we can see that she wants to help people and her partnership with Kyouma leads her to do selfless deeds. Kyouma is portrayed more as the guy who wants to get the job done and lives life like a simple man with a love for vintage cars but hate for coils. His fighting skills is fairly impressive and is able to fight on par with cyborgs, coil enhanced mechanisms, and even multiple enemies at once. Add a bit of his driving skills and it’s easy to see that Kyouma is the badass everyman. \\n\\n\r\nWhen watching the show, I noticed some trends about the plot structure. It focuses on society and explores Kyouma’s daily adventures. At first, some of his cases really shows more than what he does in everyday life. However, subsequent episodes introduces other ways at how Dimension W’s world works. There’s also murder mystery, cyber-punk themes, and how events from the past connects with the story in the present. The show also introduce Numbers and their presence really exposes the dangers of coils. Background storytelling is also incorporated into the show that explores Kyouma and other characters’ pasts. Unfortunately, the series is only one cour of 12 episodes while the manga has at least 9 volumes. Get the idea? Expect a lot of cuts with certain side characters and certain rush of the story to get to specific arcs. Characters like Elizabeth, Albert, and other many of the minor villains get some spotlights but not much characterization. As one of the downsides, Dimension W’s adaptation content may be a disappointment for manga fans. \\n\\n\r\nDespite that, I think the show is still very entertaining for its characters. Then, there’s a lot about the Dimension W universe that is intriguing. We get to see how androids interact, the world fiction of Dimension W’s technological aspects (coils, numbers, machinery, etc), and the show even has some pretty solid action. Kyouma’s a legitimate badass and he has little patience for evildoers. Similarly, the show has both a comedic and serious feel. The comedic moments are timed right especially through the interactions between Kyouma and Mira. In addition, the series rarely tries to exploit its shock values to entertain the fans but rather with its own merits. \\n\\n\r\nThe art style of Dimension W tends to have a very scientific feel. Character designs are also neat and will remind anyone of Darker than Black. Kyouma reminds me of a lone wolf detective and bounty hunter that came out of a classic movie. Meanwhile, Mira has the appearance of a young girl with robotic characteristics. (see that cute little mechanical tail?) The sci-fi backgrounds and technology also looks credible and advanced enough to be set in its timeline. The gadgets of the show and other robotic designs have a fair amount of details to further make its world building look believable. There’s even a bit of artistic enhancement with creative shade coloring at many noticeable scenes. Fan service is fairly minimal although there are a few times when the camera likes to shine on Mira. The real fan service is the action delivered right to your face.\\n\\n\r\nSoundtrack is solid especially when Kyouma is on a mission involving him collecting illegal coils. It’s eerie, energetic, and portrays science fiction with theatrics. In addition, I appreciate how Kyouma’s voice sounds as a mature adult rather than some kid out of high school. On the other hand, Mira’s voice can sound a bit bratty so fans will have to get used to that. Luckily, you will be rewarded with the very creative OP song. Performed by STEREO DIVE FOUNDATION, it’s very colorful with the dancing, full throttle action, and creative coloring. OST and music is just as impressive and shows that the creators cares a lot about their work.\\n\\n\r\nDimension W is a show that I think anyone can watch with something to talk about towards the end. Whether it’s the world building, storytelling, characterization, or technical art/music/soundtrack style, the show is a lot of fun. It lives up to what it tries to do despite cutting content from the original manga. As most series in modern years, it’s not very original and still borrows a lot of ideas from other sci-fi works. However, Dimension W still embraces the sci-fi genre and shows that it can be unique in its own way.\\n",
            "date": "2016-03-27T08:05:00+00:00",
            "helpful_count": 65,
            "mal_id": 214347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=214347"
        },
        {
            "content": "Dimension W, definitely the best thing Studio 3Hz has made so far.\r\nDimension W is a very episodic road trip-ish anime about a dude who is essentially a \r\nbounty hunter and a robot girl who gets stuck with him.\r\nPretty standard setup for an action show with some fancy visuals.\r\nIt's not without its flaws but if that sounded interesting to you it might be worth a watch.\r\n--Full review: minor spoilers ahead\r\n-Presentation(visuals & sound)\r\nDimension W has some well used CGI, though sometimes it can still stand out a bit too much.\r\nThe backgrounds are well made, the CGI never felt choppy, and I like the character designs.\r\nI've heard fromsome people that this is their favorite OP of the season, but it just sounded like pretty generic electro to me.\\n\r\nSame thing with the ED, not saying they're bad but I've heard better.\\n\r\nOverall the animation is just very fluid, colorful and nice to look at.\\n\\n\r\n-Story\\n\r\nDimension W is very arch based and starts with what I would call a very bad first episode, it's essentially just a setup for the next episode.\\n\r\nIf you plan on giving Dimension W a go, then make sure you watch two episodes before deciding if you're going to complete it.\\n\r\nThe second episode is much stronger, and introduces one of the recurring characters, Loser (yes they actually call him that).\\n\r\nThere's one more episode that just felt like mostly boring info dumping, but that doesn't come until later on.\\n\r\nAnd even with the info dumping by the characters this is how I understand the coils: wibbly wobbly timey wimey, realities inside of coils.\\n\\n\r\nBased on the premise I thought this show would comment on fossil fuel usage, but I didn't really hear much of that at all, for the better or worse.\\n\r\nFor the sake of explanation I'm going to mention that the coils can essentially provide infinite energy, meaning they can do pretty much anything.\\n\r\nThe author clearly had fun with this, maybe a bit too much since sometimes it feels like whatever happens the author basically pulled out of his ass.\\n\r\nNot that it matters too much since it's excused and explained and the story isn't super important here.\\n\\n\r\nOne more gripe I have with the story is how the characters backstories are explained almost entirely in flashbacks, come on can't you figure out something more creative?\\n\r\nOtherwise the story is interesting enough.\\n\r\nThe ending is conclusive enough, definitely not just a read the manga ending.\\n\\n\r\n-Characters\\n\r\nProbably the best or the second best thing about the show, depending on how much you appreciate the animation.\\n\r\nFor once we don't have a completely bland main character, Mabuchi Kyouma is a person who dresses in traditional clothes and hates coils.\\n\r\nMinor note that I don't particularly like the fact that Kyoma does his fighting with throwing knives, it tends to make for poor battle choreography.\\n\r\nThough the choreography is still better than average.\\n\r\nHe has a fairly extensive backstory that I won't spoil.\\n\r\nYurizaki Mira is Kyoma's robot partner who is extremely strong and can detect coils.\\n\r\nTheir dynamic was quite fun to watch, and mira is also given an okay backstory.\\n\r\nOther than that due to the Nature of the show there aren't that many interesting recurring characters aside from Loser\\n\r\nBut what is there is pretty good.\\n\\n\r\n-Overall\\n\r\nIt might sound a bit harsh to only give Dimension W a 6/10 but there are many shows just like it, and outside of the premise\\n\r\ndimension W doesn't have much to distinguish itself with.\\n\r\nAnd on top of that it wasn't really my type of a show to begin with.\\n\r\nThe narrative can feel a bit choppy at times.\\n\r\nCharacters didn't get much development because the show was busy just establishing them in 12 episodes.\\n\r\nThe visuals aren't without a few hiccups and the music used wasn't really my thing either.\\n\r\nI could still recommend Dimension W to someone who likes futuristic action shows.",
            "date": "2016-03-27T08:57:00+00:00",
            "helpful_count": 44,
            "mal_id": 214355,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4837031.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TheAnimeToast",
                "username": "TheAnimeToast"
            },
            "url": "https://myanimelist.net/reviews.php?id=214355"
        },
        {
            "content": "Dimension W was billed as one of this season's shows with the potential to really appeal to a western audience. On the surface it does share some of the elements that tend to get a bit more attention from action-starved overseas fans. A cyberpunk setting, a sci-fi thriller plotline, and a no-nonsense masculine lead in Mabuchi Kyouma. The latter is a near-future Luddite. Dimension W is set in a world where everything is powered by devices called 'coils' which tap into a hypothetical fourth dimension for unlimited energy. Kyouma despises the contraptions, symbolically driving a gasoline-fuelled car when the rest of the population has switchedto electric vehicles. The coils are administered by an uber-powerful corporation called New Tesla, and yes, the very predictable routes of corporate corruption will be explored, beating that horse just a few more times as it barely wheezes a neigh. \\n\\n\r\nSo the punchline is that Dimension W isn't that good, but how could an anime with such a cool setting be so mediocre? Well, let's start with the setting. It actually sucks. A few episodes start with a synopsis that pisses in the face of Albert Einstein, where dimension w is shown on a cartesian x-y-z graph as a line parallel and opposite to the x-axis. A keen observer might notice this is actually the negative-x axis, but the laziness doesn't end there (by the way, E=mc^2 is only the non-relativistic component). Apparently the energy from dimension negative-x is distributed amongst the populace via a network of 60 control towers, and that's not the only big number used to give an illusion of complexity where there is none. Also, apparently New Tesla just straight up murdered the wife and child of their most important inventor, and if there was an actually legitimate reason for this to be at all plausible, I've completely forgot it.\\n\\n\r\nThat important inventor, Professor Yurizaki, has developed a robot called Mira that mimics human emotions, who due to a series of goofy hijinks, teams up with Kyouma in his job to hunt illegal coils, which aren't regulated by Megagoogle. Her name is Mira and sure enough she's the best character is the series. Cute, while also having genuine agency in the story. The dynamic between her and Kyouma is great fun, so of course the more screen-time she gets, preferably along with Kyouma, the better this show turns out. Well, more than half of the series is taken up by Kyouma's character arc, where she spends a lot of time as a supporting role. Whoopsie!\\n\\n\r\nIt's a shame in fact, because Dimension W starts off okay. As overwrought and uninspired as the setting is, it can at least serve as a template for some interesting episodic stories. That describes the first five episodes. The latter seven episodes comprise the aforementioned character arc, and boy if the series doesn't squander its potential in them. One thing I've noticed with one-cour series is that they usually tend to do best when they focus on a cast of four or five key characters, while not getting too distracted by side characters that can be interesting but should nonetheless remain on the shelf most of the time. The alternative is having a good story, which at the moment is an ambitious expectation.\\n\\n\r\nThe last half of this series does neither. Many different parties participate in a search for a macguffin, and so the focus of the plot is immediately split between the motivations and backstories of these parties. This is such a waste of time, when time is of the essence in the one-cour format. Do you care about the stereotypical African prince, or the mysterious phantom thief Loser, or the downtrodden villain who's shoehorned into the plot out of nowhere? Of course not, but Dimension W shoves every hackneyed detail of these characters down your gullet.\\n\\n\r\nGranted, if the series kept up the episodic structure, it still wouldn't be good. The underlying flaws in the setting preclude any attempt to really take itself seriously. But it would have at least had variety going for it. Alas, this show is simply following the broad structure of the manga. \\n\\n\r\nAt least it looks good. The character designs are on point and blend in well with the style of the backgrounds. Both use a fairly wide color palette that is tamed by avoiding over-saturation. The quality of the drawings doesn't deteriorate much, and the animation quality is above average, although the CG robots are as unwelcome as ever. Wait for Flip Flappers for an exhibition of what Studio 3Hz may really be capable of.\\n\\n\r\nSo ultimately, Dimension W was just boring. Its source material is crap and it doesn't make any effort to spice it up.",
            "date": "2016-04-01T19:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 215112,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Gridfire",
                "username": "Gridfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=215112"
        },
        {
            "content": "Warning possible Spoilers\r\nI do like a good Sci-Fi show from time to time and this is a very good example of that considering it has an interesting story and good characters to back it up.\r\nThe year is 2071 and Humanity uses Coils to power pretty much anything and Kyouma Mabuchi a Collector who hunts down illegal coils in exchange for money suddenly ends meeting a little girl called Mira and then everything changes \r\nNow this show had a surprisingly good story it really delved into the whole mystery of how coils worked, what they can actually do and what secrets they hold that only afew people know it was very interesting watching the events unfold itself as the two MC's tried to figure out what was going on and why they were connected to the coils.\\n\r\nI loved the relationship that developed between Kyouma and Mira who started off on the wrong foot and over time slowly started to become more of a team and respect one another, plus the show has a dark tone to it since Kyouma has a dark backstory which is really the answer to everything that happens, but there were a few other moments that were dark like the episode at Lake Yasogami which is when the anime suddenly turned supernatural, there was also quite a few plot twists throughout the show which did surprise me.\\n\\n\r\nThe characters were actually really good even though Kyouma and Mira, especially Mira stole the show the other supporting characters weren't too bad either.\\n\r\nKyouma is an Ex-Soldier who became a Collector after an incident that happened, he hates coils and uses devices that we use today like a couple of Gasoline fuelled cars which included a Toyota 2000 GT which was pretty cool and he doesn't use guns instead he uses knifes attached to wires which at some point he kinda used like 3D Maneuver Gear from AOT when was jumping around and stuff, his personality is stubborn, short tempered and anti-social, but he is a definite badass because he knows how to kick ass mainly because of his experience as a soldier and because of his hatred for coils or anything technical he treats Mira poorly at first, but when he was finding out more about his past and the coils he slowly starts to loosen up to her and starts treating her like a teammate. Despite his personality and attitude towards other people when you find out what he was like in the past and what happened to him you do feel truly sorry for him and understand why he is like this.\\n\r\nMira was a brilliant, sweet and fun character who is also a robot, but compared to other robots I've seen the way her body works is much like a humans just mechanical which made her very interesting and the fact that she has antennas that look like ears and a amplifier cord that looks like a tail then you have a robotic neko which is cute as hell, but don't be fooled because she is very intelligent and strong thanks to her robotic abilities, she is treated poorly by Kyouma because of this who keeps calling her junk which annoys Mira which when she reacts can be pretty cute and understandable, she is a very likeable character and has a big role in the events of the show since she was created for a specific reason that'll unlock the mystery of the coils.\\n\r\nThe other supporting characters were interesting too like the mysterious masked thief called Loser who is looking for special coils because they unlock something and the fact he used to be a scientist, he is a pretty cool character and his daughter Elizabeth wasn't too bad either since she was actually very useful helping out her father.\\n\r\nThere was two other guys like Albert who was a former soldier with Kyouma who has some banter with him from time to time and there was Lwai a prince of Isla who is actually a Robot being controlled by his mind from his real body (I know it's confusing).\\n\r\nNot only that there was a bunch of other Collectors who were introduced later on in the show that also provided some good entertainment since they had some pretty interesting abilities.\\n\\n\r\nNow I did like the Artstyle it had a Cowboy Bebop feel to it mainly because it is set in funny enough the same year and it has that gloomy, dirty tone that Cowboy bebop had too, but the difference here is that Dimension W felt more advanced compared to Cowboy Bebop, I liked the design of some of the characters especially Mira who looked very strange, but cool and sweet as well plus some of the locations that Kyouma and Mira went too looked very interesting too like Lake Yasogami looked like it was out of a horror film and Easter island looked terrifying to be on.\\n\\n\r\nThe action was actually pretty good it was fun seeing Kyouma and Mira kick some ass against badguy's , but some of the other characters also proved their worth too like Loser and even the other Collectors who has some pretty impressive abilities and these abilities were very handy when they were fighting against the Security Robots on Easter Island or against each other.\\n\\n\r\nOverall I think this was a fun and entertaining show that gave off a familiar vibe that I had with Cowboy Bebop so if you're someone who enjoys Sci-Fi or enjoyed Cowboy Bebop then this is definitely something you might want to check out.",
            "date": "2017-06-15T10:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 249964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=249964"
        },
        {
            "content": "It started off as a fresh anime with cosplay worthy characters (robot girl is the only good character honestly) The opening and ending song and art were really enjoyable, i didn't skip any of it. \r\nBut here is the tricky part of all science fiction series/film/etc, you need to be able to explain stuff logically  and the explanation should be satisfying (even if it is just made up for the sake of fiction) just claiming that everthing worked with coils that got the energy from dimension w is a very poor explanation about what the f_ was going on throughout this series. \r\nThe charactersand events were hard to follow at one point, as everthing was everywhere. The nemesis was presented and written poorly. \\n\\n\r\nThe best I can say for this series, it started off with lots of potential and I was hyped and excited to see the next episodes, a few weeks ago. It's an illusion though, this series presents nothing new, just re-introduces tropes from around the anime/manga industry. I haven't read the manga, and after finishing the anime adaptation, I don't think I ever will.\\n",
            "date": "2016-03-28T03:41:00+00:00",
            "helpful_count": 10,
            "mal_id": 214507,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3219829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/murasakikitsune",
                "username": "murasakikitsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=214507"
        },
        {
            "content": "a futuristic anime where they've unlocked the \"fourth dimension\" where they can draw out unlimited energy, thus resulting in robots and other interesting things that we dont know of yet in this day an age. Weird that they'd use Tesla, but it works well with the story. \r\nIt took me a while before I could fully understand what was going on since you're just literally thrown into a story that really has no depth yet. \r\nTurns out this story follows a group of \"collectors\" looking for illegal coils for money, and conveniently enough they all suffer from huge loses in there lives. \r\nMost ofthese people are out looking to avenge the deaths of the people they have lost because for whatever reason they all have lost whats most important to them. \\n",
            "date": "2017-12-17T13:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 265446,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=265446"
        },
        {
            "content": "I'm mixed about Dimension W. Should you watch this show. Check this review to find out.\r\nPros\r\n- Opening and ED themes (Kyouma dancing and Mira being a waifu. Nuff said)\r\n- Stellar animation\r\n- Good OST (shout out to my boys , STEREO DIVE FOUNDATION for that opening tho)\r\n- Marvelous Action\r\n- Very interesting sci-fi premise\r\nCons\r\n- Uninspiring plot\r\n- Substandard character development \r\n- Kyouma and Mira's relationship (When will Kyouma stop hitting Mira and callling her trash, I mean thats his character but it got annoying real quick. Who in their right mind wants to abuse that adorable robot (ಥ﹏ಥ) )\r\n- Terrible Villains\r\nOverall, I don't know if i enjoyed DimensionW too be honest. It started out hype af (especially because of that opening) but then after about episode 5, I felt the show's plot dragged on and became predictable. I felt I was being forced to watch it every Sunday. Hey, but don't let my thoughts dismay you. Check it out yourself and make your own opinion!\\n\\n\\n\r\nGive it a 4 episode rule\\n\\n\r\n- Hans out ಠ_ಠ\\n",
            "date": "2016-03-29T07:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 214662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5163761.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_Hans_",
                "username": "_Hans_"
            },
            "url": "https://myanimelist.net/reviews.php?id=214662"
        },
        {
            "content": "The story of Dimension W takes place in a world where humanity has attained unlimited energy, reshaping the foundation of our daily lives, raising the bar for what is possible for us to achieve. With an interesting premise and the promise of sci-fi action the anime catches your eye easily.\r\nThe artwork of the series remains flashy and slightly stylized through the whole experience, even when it obviously cuts a few corners. Sometimes the backgrounds will vanish for example, but rather than hide it, Dimension W makes it their greeting card, turning a weakness into a recognizable trait.\r\nSadly enough, when I reached the end of theseries, I couldn't help but feel it ended up a mess. At some point, the series simply lost focus and fell under the pressure of its own potential. What I mean by that is that the setting, story, and characters, are being pulled in so many directions that you can't get a sense of what it wants to be. It lays out its premise very clearly - 'What if humanity had unlimited energy?' - yet it never focuses on exploring this concept. Instead it brings in tropes from countless other animes and classic stories, and then tries to push it all into a blender. Examples would include the master thief that announces where he'll strike next, and ghosts living at a mysterious rural mansion. Neither of those examples seem to fit into a sci-fi setting.\\n\\n\r\nI was very happy to see some actual variety in the cast, showing a wide array of personalities, backgrounds, and nationalities. It's not every day that you see African characters portrayed in anime, and on top of it, playing roles that are important to the story. The show manages to make the world seem connected by doing this.\\n\\n\r\nBut what about our main leads? First there is Kyoma, the brooding version of Sakata Gintoki, a veteran soldier who's haunted by his past and refuses to fight with modern weaponry. Secondly there is Mira, the sexier version of Pinocchio, the robot with a heart of gold that looks at the world like a naïve child. They form a dynamic duo that's fun to watch, but since the anime doesn't have time to delve too deep into them there is still a lot of untapped potential.\\n\\n\r\nTo summarize, Dimension W is a series that will disappoint those who are looking for a strict sci-fi story, but might just barely entertain those who just want a bit of action.",
            "date": "2016-03-27T14:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 214421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4319803.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Markezzo",
                "username": "Markezzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=214421"
        },
        {
            "content": "I binged watched Dimension W for 2 days while waiting for episode 12 to air. I have to say that I thoroughly enjoyed Dimension W. Here are some of the reasons.\r\nStory (8): What I loved about Dimension W is that it is engaging and leaves you wanting more and more. You want to know what happens in every twist and turn and in a way, you wish that it could go on and on. I did not like however that it felt entirely inconclusive and that the ending seemed lacking, at least for me.\r\nArt (9): Bandai Visual is one of the best production houses, inmy opinion and the art for Dimension W was colorful, despite the darkness of its theme. The animation was also really stunning and the fight scenes are engaging. It's not overwhelming to look at and the characters, both protagonists, supporting characters and villains, seem distinct. \\n\\n\r\nSound (9): I really give much credit for the opening and ending themes for the score I'm giving this category because they are amazing. I loved the opening theme and of course animation. It definitely brought me back to my love of Gangsta. The ending was just adorable. The sound in the show itself wasn't necessarily up there but it blended in nicely with the plot.\\n\\n\r\nCharacter (8): What's so great about the characters of Dimension W is that they don't beg to be liked, well maybe except for Mira, who you need to like because cmon that face. Anyway, the characters are not waiting for you to love them because they are stereotypically lovable. They aren't. You wouldn't love Kyouma if you're looking for a bishounen or someone who is nice and sweet. He isn't. He's a cold,  badass and detached person yet why do I love him so much? It's because he is himself. This goes for the other characters like Loser, Mary and even Salva. They aren't the type of people you'd actually like but you like them anyway. \\n\\n\r\nAlthough one thing I have to say is that some characters felt like fillers. Even Al felt like a filler character. A lot of them are and some of them seem senseless. All in all, character-wise, Dimension W was pretty solid.\\n\\n\r\nEnjoyment (8): I left watching Dimension W thoroughly enjoyed. Although I didn't necessarily have those shouty feeling-feelings I usually have for an anime, I have to say that because of the action and the story, I definitely got hooked. There were more hits than misses but I think those holes could've been filled if it were a few more episodes longer. \\n\\n\r\nOverall (8): If you're looking for an anime that can fill your action and angst needs, Dimension W is a pretty decent anime to go and watch.",
            "date": "2016-04-01T00:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 215005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5288471.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jayvwrites27",
                "username": "jayvwrites27"
            },
            "url": "https://myanimelist.net/reviews.php?id=215005"
        },
        {
            "content": "Looking for a fun and intriguing 12 episode anime? Well look no further than the 4th dimension, as that is exactly were you'll find Dimension W. You'll be immersed in the future, empathizing with the characters and enjoying the way this anime brings mystery, drama and action together. \r\nWhile the story isn't anything \"out of the norm\" in terms of characters and plot-lines, Dimension W does a decent job of not overstepping its bounds in this inter dimensional genre. The story was engaging all the way through and the cast was just the right size to keep things interesting all within just 12 episodes. \r\nInany short anime, character development can be a struggle. Dimension W handled this obstacle fairly well and you'll get a sense of who each of the main characters are, if only at a semi-basic level. But don't let that scare you away, the characters are by no means flat. Each of their backgrounds are genuine and fuel this likable story. \\n\\n\r\nOverall, Dimension W is an entertaining, easy to watch, futuristic anime that is sure to satisfy.",
            "date": "2018-04-08T22:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 277488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4096255.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/iceMantheman",
                "username": "iceMantheman"
            },
            "url": "https://myanimelist.net/reviews.php?id=277488"
        },
        {
            "content": "This MAY contain spoilers!\r\nStory 8/10: This anime contains BOTH character and plot development. It has an interesting plot with a lot of backstories of each characters & how they all interrelate with each other & Dimension W. There is a lot of action & fighting scenes with the characters in the anime. \r\nCharacters 8/10: There are a lot of characters that are introduced in the anime. Most of them have a form of connection to Kyoma. (For this review, I will be focusing on the two main characters in the anime). Kyoma Mabuchi is tough guy and works as collector. He is also mean toMira-chan over the series. Mira Yurizaki is helpful, understanding & cute robot. She wants to be able to help Kyoma throughout their missions.\\n\\n\r\nEnjoyment 10/10: One of the best animes that I have every watched. This was my #1 anime to watch on my TOP 10 Anime List. The theme song is awesome too. I always keep listening to it on replay -- if anything, Genesis will become my entrance theme song as a wrestler. The theme of robots, cars & machines are cool too! I assumed that there might a romance between Kyoma and Mira in the future. \\n\\n\r\nOverall 8/10: All-around great anime with lots of actions. Great plot and backstories included! Dimension W has the potential to have a second season!\\n",
            "date": "2016-04-30T12:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 217517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=217517"
        },
        {
            "content": "Sci-fi is a pretty common genre in not only anime, but other mediums, such as novels and movies, as well. For a sci-fi series to stand its ground, its need to at least  have a solid fleshed out world or rules that are consistent to that world, or else, everything else will fall flat and lose its impact. Dimension W follows the typical sci-fi formula while still being able to differentiate itself from others in the genre. In a world where unlimited energy is no longer an issue, Dimension W explores the possibilities and situations various people can still go through. Devices called Coilswere created to harness an unlimited source of energy. At first might be seen as a MacGuffin Device, Coils, which are pretty important in the world building, are a means to deliver elements of the narrative.  \\n\\n\r\nOne of the many notable aspects of Dimension W is its ability to stay consistent to its own rules. I always admired how Dimension W was able to use its \"4-th dimension\" premise\" to craft intriguing yet enjoyable stories and plot points, plot points that actually become relevant as the series progresses. The show was able to build an interesting world with creative rules and still able make new ones while not breaking the show. Dimension W doesn't don't do anything groundbreaking, but the story for the most part is consistent and its all I ever want from sci-fi animated series. Another brilliant element of the show is its cast of characters. Kyouma is your typical badass main character who lives in the future, but due to unforeseen circumstances in the past, hates the world he lives in. Mira, his cute robot sidekick, provides a light cheerful mood in the relationship in contrast to Kyouma's serious and brooding demeanor. The chemistry and history between the two is enjoyable to watch, as well as give some levity to the dangerous situations they are put in. Another character, who is my personal favorite, is the supposed \"villain\" of the series, Loser. A masked vigilante with cybernetic enhancements with the power to manipulate energy, with an added bonus of having an awesome costume design and mysterious past. From the get-go, I was in love with his character and I loved what the show did to explore his character even more, giving him a meaningful yet compelling motivation. \\n\\n\r\nThe animation for the most part is pretty solid, it isn't as shiny or as polished as a high budget anime, but it could have been a lot worse also. It gets the job done. When it came to action scenes, they were pretty enjoyable, though was a bit disappointed with the lack of choreography seeing as how Kyouma is basically a ninja... Well he is, isn't he?  The art and aesthetics of the show also work in its favor. The character designs are all unique and makes it easier to distinguish the characters. The choice of colors was also quite pleasing to see as it helps portray the beautiful world of Dimension W and its sci-fi landscape. The use of green was also quite clever as it is used to portray how energy flows in that world as well as give the various locations in the show charm. The music for the most part is pretty good. The Opening song, as well as the animation in conjunction with it, will be stuck in your mind for awhile. Seriously, it is that catchy. The OST is also pretty solid, however, they isn't many outstanding tracks. The ending song of each episode was also nice to listen to. \\n\\n\r\nThere aren't many complaints I have with the series. Dimension W followed the typical sci-fi formula of having a futuristic setting for \"such and such\" reason and certain situations because of some science related disaster. The show sort of played it safe by following the usual tropes seen in sci-fi series, while still being able to bring something new to the table. The premise of unlimited energy, the existence of a 4-th dimension, and presence of impending doom all makes the show really enjoyable and entertaining to watch, which is all I want from a sci-fi  series. Not every sci-fi show needs to be an overly dramatic, dark, and serious thriller. I enjoyed every aspect of the show, and this is without a doubt one of the most enjoyable series of 2016 so far, as well as my favorite of the Winter 2016 season. \\n\\n\r\nI highly recommend the show to those looking for a good action and sci-fi series, Dimension W will fill your needs. I can guarantee you will not get bored with the series. However, those looking for a serious and compelling story or a show with amazing visuals, you may want to approach this show with caution. Overall Dimension W is a pretty solid sci-fi series that entertained me throughout its entire run.",
            "date": "2016-03-27T10:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 214371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3468953.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AwesomeDudex3",
                "username": "AwesomeDudex3"
            },
            "url": "https://myanimelist.net/reviews.php?id=214371"
        },
        {
            "content": "The show is not bad, but it wasn't good either. There are no overarching themes, all the characters were cliché. Really I bursted out laughing, when the episode with the main guys backstory was. It s like a bad Hollywood movie, stretched over 12 episodes. \r\nYou can correct me if I am wrong, but I didn't see any relatable situations or character arcs in the show. The problem of the protagonist is he can't move on from a past event and it catches up to him. Nothing new. \r\nThe main theme of the show are the \"coils \" a new technology that symbolise progress ormoving on. Because the protagonist doesn't use them he is stuck in the past , emotionally as well as physically. Even that theme is developed poorly. Even the growth of kyoma was underplayed at the end .\\n\r\nThere is not much to gain from the show. The sci fi elements were not explored. The majority of the characters are unimportant and there wasn't a single memorable moment.",
            "date": "2019-02-26T11:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 302510,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LackyN",
                "username": "LackyN"
            },
            "url": "https://myanimelist.net/reviews.php?id=302510"
        },
        {
            "content": "This would have been in my top 5 season of anime if it wasnt for the poor storytelling of the first half of the season.\r\nEP 1-6 is a 4.5/10 , EP 7-12 9.5/10\r\nI LOVE the premise of a robot learning how to be a human its my PB and J. Mira is a really cool character and concept but this season did a poor job of using her (hopefully they dig deep in later seasons).\r\nKyouma was lackluster for me until they started to develop him in the latter of the season in which this dark little caterpillars past blossoms out into a beautiful story.\r\nArt andSound i gave both 8, they dont seem to be anything special but the fight sound effects where cool and the colorful landscape of the Dimension W world is cool.\\n\\n\r\nCharacters 10/10, Soo many Animes try and fit 4+ main characters and develop them into a show im happy with this show for only having 2 and developing atleast 1 of them to my satisfaction. \\n\\n\r\nEnjoyment 8/10, I had to stop watching this because while it was airing because i really didnt like it as much as the other things i was watching, but after binge watching it i felt sucked in and had to finish it as fast as possible.\\n\\n\r\nOverall 7/10, Could have been done better overall but if i were to here something like \"we spent most of the money on the Island arc\" It would make soo much sense to me",
            "date": "2016-04-30T13:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 217526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Evil_Ood",
                "username": "Evil_Ood"
            },
            "url": "https://myanimelist.net/reviews.php?id=217526"
        },
        {
            "content": "If you loves sci-fi, future, android related movies, this might entertain you (as well as a little bit of combat, I said little bit because it is just ok)\r\nThe story revolves around the main character (Mabuchi Kyoma) and an android (Mira).\r\nThe story about a future world where earthlings can substract infinite energy from the other dimension (or dimension in the axis W) through a device named coil. Kyoma who got a bad experience with coil failure is probably the only person on earth that doesn't use any coil and resort to old time battery and petroleum. \r\nOne thing that doesn't stand out for me isthe lack of climax and anticlimax each episodes. So the pace is relatively flat but still in an interesting phase. (I would usually ditch shitty anime in the first episodes, at least Dimension W survive)\\n\\n\r\nArtwork is awesome, there are a lot of variety in character design, quite fancy colouring. It is nice to watch, altough it is not that fancy in terms of combat animation (because it is an action sci-fi anime, I hope Kyoma have a better combat ability and a lot more combat skills)\\n\\n\r\nThe main character was too cold for me, and it goes in at least 5-6 episodes until we know why he is that cold, and for me it is too slow. On the opposite, Mira who is tagging along Kyoma was more than cheerful as an android. Somehow in doesn't make sense how Yurizaki hakase can make such powerful AI (well, anime is anime right?)\\n\\n\r\nOverall I did enjoy Dimension W so far, so could not give less than 8 for this. \\n\r\nI don't recall any anime that have specific type of story like Dimension W. Quite curious with the story development.",
            "date": "2016-08-02T13:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 225768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5161820.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/samuel_sfx",
                "username": "samuel_sfx"
            },
            "url": "https://myanimelist.net/reviews.php?id=225768"
        },
        {
            "content": "Dimension W feels like it has something really good with lots of potential to be a very good cyber-punk action show.....however.\r\nWell before LA even starts this review, LA will say that LA did a bit of an experimentation when viewing this anime to see if simultaneously watching BOTH subbed and FUNimation Dubbed vers. in the ways of odd episodes are dubbed ONLY with even episodes being Subbed would be just something interesting for LA's viewing experience...it was however LA won't be trying this method for a looong time. Why?, because it was sooo hard keeping track of which voice actor voiced who (more specifically withDimension W's large ensemble cast). As for LA's viewing experience, it was a nice way of seeing if the dubbed or subbed vers. was in tune with each other and gave LA a psuedo-unbiased look at the dub (due it being odd episodes so LA technically watched it in dubbed first) but about the dub and sub will be later.\\n\\n\r\nFor now let's get to what LA meant by LA's first statement to this anime.\\n\\n\r\nDimension W has many strengths when it comes down to it, from it's initially interesting characters as well as it's world-building it did in establishing the coils and their true intent with the coils. Character development or to be more precise backstory was heavily used especially to our resident main protagonist Kyoma Mabuchi and that helped flesh out his dilemma about his for robotics and him even being a collector of coils. The animation done by Studio 3Hz and Orange is also stunning to look at from the bolded detailed to it's character designs and extremely fluid battle scenes, the psuedo-cyber and variety of gorgeous backgrounds (from supernatural craziness, cyber-like wastelands to the typical futuristic yet urbanized buildings) and the animation is one of major highlights of Dimension W without a doubt. The last strength LA will say is that although the finale gets really nutty and crazy with it's reality warping (it's called \"DIMENSION W\"...LA doubt this is a spoiler people), the finale did wrap up this well and did give something of a good sendoff to the anime.\\n\\n\r\nHowever with strengths comes weaknesses and although these weaknesses don't outright make the anime horrible per say, it still has an effect on the anime. Dimension W as much as they put emphasis to Kyoma's mysterious backstory, one of the biggest problems is that not only Kyoma but also Mira is affected with having no character development until the final 5 episodes of the anime, there is a bit of leeway to this as the first 7 episodes focuses on the introduction of Dimension W and it's characters and the world of coils then starts to see separate coil cases with plotlines that don't have a major effect to the main plot but it does gives us context as to the coil's true defect and that adds up into world building sure...but other than that, the coils in general are nothing but a plot device and all the plotlines including the main one focuses more on characters backstories than developing the characters as the plot progresses.\\n\\n\r\nWhile LA says this LA's opinions of the characters is that LA does sees Kyoma as a badass.....yet LA HATED it when he kept treating Mira poorly (mind you LA didn't outright hated Kyoma for this but still annoyed LA from time to time especially when he constantly calls Mira a \"piece of junk\"), as for Mira..well she was LA's favourite character as she was the Hope Spot and a constant source of help to the plot at hand and Mira's voice actor helped with this. The minor characters that had no connection to Kyoma and his backstory however got it MUCH worse being nothing but having importance only inside of their own arcs. The final arc is pretty long too but even then only a few minor characters that were introduced had little effect to the major plotline besides being support or annoying red herrings or spanner in the work distractions for Kyoma and Mira to the anime.\\n\\n\r\nSo where is the lost potential LA was talking about?, the coils and it's defects and the fact there are hundreds of them could have made this anime sooo much better shifting focus from characters to world building and what or HOW the coils functioned or go into more cases about coil malfunction to the most extreme degree and develop it's characters along the way. The last bit of potential wasted was Loser in his entirety, a sort of rival to Kyoma's coil hunting, never really had his exploits fully shown to us and the mere fact that he was an interesting character only for him to be relegated to ONLY when Loser was needed to further Kyoma's backstory dampened the experience and wasted potential on him. Now mind you LA still enjoyed Kyoma's backstory and how the anime still used his mysterious backstory to tie up loose ends to past events that links to the major plotline but looking deeper to the coils and it's lore would had been nice instead of being handwaved away as \"it's the future!\".\\n\\n\r\nAlright time to talk dubbing. LA actually enjoyed both vers. of Dimension W and NONE of either sides of the voice actors weren't bad or horrible. On the FUNimation dubbed side, LA would say that Jad Saxton as Mira was extremely good choice as Jad fit into Mira's shy yet extremely helpful and caring nature, Christopher Sabat as Kyoma was also the same and LA very much approved of both roles. The minor voice cast did well too with NO annoyance from any of the minor dubbed voice cast. This dub is actually one of the consistently good dubs LA has seen from FUNimation and pretty much gives praise to Colleen Clinkenbeard and Zach Bolton the ADR Director for the great picks in choosing their voice actors and their dubbed script. LA's favourite dub voice actor would go to Jad Saxton because does LA need to say it. On the flipside, the Japanese was pretty good and LA just have to say the same as LA said nearly verbatim as the FUNimation dub for this, the minor voice cast was great, Daisuke Ono was great as Kyoma and Reina Ueda as Mira was LA's favoruite voice actor just LA's reasoning for Reina is pretty much that Reina Ueda's adorable vocals as Mira was just great and again brought out the \"Hope Spot\" for the series. If LA had to choose which way to watch this anime...LA would say either of them is fine as neither did horribly or deterred your experience. However if you want Mira at her finest...stick to the Japanese (no offense to Jad Saxton as LA DOES love Jad as Mira and everything but dubs DO have a problem with portraying moe and Jad Saxton did a good job at this which is RARE, but Reina Ueda's vocals were just too damn adorable to let up), if you don't care for it...go with whatever suits you, LA is just showing LA's taste is all.\\n\\n\r\nSoo from all this, is Dimension W bad or good?...LA will say it's still a good anime as result even with all it's wasted potential of interesting plotlines it could take itself to, to the faults it had with it's characters and it's barren character development outside of our main protagonist's backstory to it's lack of explanation about coils outside of being plot devices but even with this, the end product still gave out a gorgeously intriguing action-filled cyber-punk anime focusing on one man who collects illegally dangerous coils.",
            "date": "2017-06-26T01:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 251073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=251073"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nWhen I was a kid, I would play video games so much that I had to constantly beg my parents to keep a reserve of batteries in the house. We actually stashed them in the refrigerator, believing that having them at a colder temperature would somehow make them last longer.\r\nWhether or not that’s true, though, I cannot say. What I can say is that Dimension W needed to replace its own batteries at some point but never got the memo.\r\nSTORY\r\nDimension W follows Kyouma, a man with a deep resentment for Coils. Coils are a newfoundtechnology that tap into the ominous fourth-dimension – named Dimension W – allowing for, as its founder would describe, “unlimited energy.”\\n\\n\r\nWhile not technically true, Dimension W has two halves: the first five episodes and the last seven episodes.\\n\\n\r\nThe first five episodes do a nice job of presenting necessary information. The concept of Coils, the society built around the devices, and the futuristic setting are laid out. Mira, a unique cyborg, makes for a cute yet purposeful companion. And the importance of the so-called Numbers is made known. All within just the first two episodes.\\n\\n\r\nEpisode three is more character oriented, but episodes four and five are more relevant narratively. Episode four includes an interesting setting relative to the one given prior, and episode five introduces the idea that Numbers allow for a myriad of possibilities – an important detail for later.\\n\\n\r\nThen the rest of the anime happens.\\n\\n\r\nWhere the first five episodes were spread out in terms of focus, the last half of the anime hones in on one specific plotline: Easter Island. With the change in focus comes a drastic change in scale. Before, breaking into a museum, playing with a bunch of kids, and investigating a spooky mansion were as grandiose as the anime got. Afterwards, threats of global destruction, the end goal of the different cast members, and the political and violent direction each inflate the scale beyond what feels reasonable.\\n\\n\r\nSimultaneously, the anime tries and fails to introduce new narrative elements. Different villains that are either too silly or improperly explored join the fray. Random ideas, like a floating ball of energy or Mira moving through Kyouma’s subconscious, are difficult to accept even with all of the concurrent pseudoscience. Even certain plotlines, such as the bureaucracy finding out about Mira’s true origins, are discarded, making the anime come off as forgetful.\\n\\n\r\nIn order to present a lot of this information, the anime relies on heavy exposition. Characters spill their thoughts through long-winded monologues. And thematic subtlety is traded for heavy-handed explanations, telling rather than showing its messages.\\n\\n\r\nNevertheless, these themes are surprisingly complex: immutable history, acceptance of reality, and indeterminism.\\n\\n\r\nIn Dimension W, many of the episodes focus on the past. Kyouma’s life and wife are presented entirely through flashback. The same happens for many of the events in the last half of the anime – how Kyouma came to acquire Genesis, what drove Seameyer to go insane, and so on. In a way, the anime demonstrates that the past cannot be changed. I.e., history is immutable.\\n\\n\r\nAlong the same lines, the show pushes the idea that people have to accept this given reality. Both Kyouma and Salva refuse to acknowledge their pasts. For them (and anyone), it’s something that sticks no matter how much they may forget or not want to remember.\\n\\n\r\nYet that does not mean what is to come is predetermined. For while the past cannot be changed, and the present must be accepted, the future has no such rules. The possibilities are endless. Mira does not have to sacrifice herself. Kyouma can turn a new leaf. Loser has every right to fight to save his beloved.\\n\\n\r\nAltogether, these themes have close ties to Dimension W (the concept, not the title). Dimension W’s voids symbolize history’s immutability through their stillness. The widespread use of Dimension W, despite it challenging established norms, represents society’s acceptance. And Dimension W creating multiple possibilities help to highlight that indeterminism still stands.\\n\\n\r\nThe themes are both layered and connected, and the first half of the narrative is at least competent. But the numerous amount of issues in the second half are still enough to make the narrative an overall weak package.\\n\\n\r\nANIMATION\\n\\n\r\nDimension W’s artistic direction does have a few positives. It uses a visual trick to, at times, profile the characters. One-colored backgrounds and off-colored shadows give Kyouma, Mira, and others a poster-art look. The technique does not serve a purpose, but it does add flair.\\n\\n\r\nThe outcome of interacting with Dimension W (the concept) is also an interesting choice. Grotesque mutations and otherworldly obstructions turn what should be a lauded discovery into a hideous amalgamation – a dichotomy reminiscent of the show’s own love-and-hate technology motif.\\n\\n\r\nThe rest of the art tends to be hit or miss. On the hit side, the sprawling city – with its alleys, skyscrapers, and underground shops – adds variety as well as a futuristic yet realistic setting. On the miss side, the monotonous mountains, snow, and derelict corridors that make up the vast majority of the second half of the anime replace the variety and futuristic details with repetitive, boring backgrounds.\\n\\n\r\nActual animation remains roughly around average. Once again, a first-half-second-half distinction can be made. In the first half, Kyouma’s escapades and Mira’s silly reactions keep the anime from feeling static. In the second half, while the action involves robots of different types, the animation is not as fluid as it once was. Certain scenes can bring back that spark, like when Kyouma takes down a robot, but those moments are few and far between.\\n\\n\r\n(Even so, Kyouma’s dance moves from the OP deserve a special shout-out.)\\n\\n\r\nIf nothing else, the character designs manage to be both interesting, cool, and different compared to one another. Kyouma’s lion-esque hair and laidback attire paint him as both fierce and nonchalant. Mira’s green hair, catlike features, and various outfits (especially her bulbous hat) turn her into the cute and likable character that she is. And both Salva’s and Lwai’s appearances are exotic, fitting their royalty and foreign statuses.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Dimension W is weirdly handled.\\n\\n\r\nTake Salva and Lwai. Salva’s backstory is shown, but the extent of his relationship to his brother (and his secretary that he constantly slaps) does not receive much attention. Lwai is similar. It is revealed later on that Lwai is actually in a comatose state, controlling, at the same time, robots that look like him. But beyond his devotion to his brother, he does not have much to his character.\\n\\n\r\nTo be fair, his main purpose is to become friends with Kyouma before his revelation. By doing so, it demonstrates that Kyouma can, in fact, befriend a cyborg that uses the very Coils that he despises.\\n\\n\r\nBut a weird problem arises: The anime spends almost too much time on the Egyptian brothers. Instead of focusing on other established characters, like Loser and Dr. Shidou (Mira’s father), the anime instead chooses to focus on these latecomers despite their relative unimportance to the plot. Worse still, the focus needed is stolen from others. Namely, Kyouma and Mira.\\n\\n\r\nKyouma and Mira share a tenuous relationship. Kyouma despises Coils and, consequently, Mira. Mira does not hold any feelings of ill-will towards Kyouma, but she does wish he would treat her more like a friend (at least an acquaintance) and less like a piece of junk he picked up from the side of the road.\\n\\n\r\nSo when Kyouma gets all buddy-buddy with Lwai, it almost feels like a betrayal. Granted, Kyouma does not know of Lwai’s personal background, but as he grows his relationship with the young boy, Kyouma (and therefore the anime) must subsequently disregard the relationship between him and Mira. Given that Kyouma and Mira’s relationship is easily more important to Dimension W when compared to Kyouma and Lwai’s relationship, it becomes hard to justify the anime practically forgetting about its main duo.\\n\\n\r\nTheir relationship is weird, too. Mostly because the transition from Kyouma ragging on the young girl to tolerating her presence has little to do with each other. Yes, Kyouma saves Mira from certain death (twice), but his behavior towards her does not change as a result of their interactions together. Rather, the change occurs because of Kyouma learning more about himself.\\n\\n\r\nWhat he learns is memories he had essentially repressed. The girl he met, fell in love with, and married. The horrors he and his crew faced while scouring the island. The location of Genesis.\\n\\n\r\nA lot of these details helped to explain his current character. His wife imparted on him a love of old objects (which partly explains the muscle cars), and her death instilled in him a deep hatred for anything related to Coils (which also partly explains the muscle cars). His membership with the so-called Beasts of Grendel provided a foundation for his uncanny physical abilities. And learning the truth behind why his memories were disjointed in the first place allows him to understand his own origins.\\n\\n\r\nHe believed that he failed his comrades and, more importantly, his wife. But who he truly failed was himself. He blamed the Coils for his losses rather than the choices he (and his wife) made, turning him into the angered man afterwards.\\n\\n\r\nIn the end, Kyouma foregoes entirely hating Coils. His use of his signature Coil-based weaponry is evidence enough. But this change is only nice for him. He now views Mira more positively, sure, but, to reiterate, their change does not derive from mutual understanding. It’s a one-sided shift that the anime attempts to make balanced – but it fails.\\n\\n\r\nMira’s character unfortunately gets sidelined by the aforementioned weirdness. The inordinate amount of time spent on less important characters, as well as her relationship with Kyouma going largely unexplored, leaves her in a difficult spot character-wise.\\n\\n\r\nAt the minimum, she has a bit of uniqueness in the Dimension W world. While she is yet another cyborg, her make and conception are shrouded in mystery. Indeed, she is much more reactive and lifelike when compared to other similar cyborgs. Her affable personality, general cuteness, and overall calm demeanor make her an easily likable person.\\n\\n\r\n“Person,” not cyborg. For her major conflict involves a sense of self. She does not fully comprehend her origins – a parallel to Kyouma, one that gets surprisingly tied back with the revelation that her own body is in fact Kyouma’s wife’s body. She does not ever want to be reset, losing the relationships and experiences she has made thus far. And the idea of death scares her, for she knows that that means the end.\\n\\n\r\nAgain, though, this conflict is not fleshed out. It comes together through small, singular scenes rather than through a layered approach. Yes, Kyouma stops Mira from sacrificing herself, proving to her and the audience that she is more than just a cyborg. But Mira does not experience so much development as she does a reaffirmation of what her character has symbolized from the beginning.\\n\\n\r\nAfter Kyouma and Mira, the rest of the cast is riddled with issues. Seameyer, the main antagonist, is awful. He appears out of nowhere, his motivations are laughable, and his overt craziness cannot be taken seriously.\\n\\n\r\nLoser (as was briefly mentioned) hardly receives any attention despite how much he is invested in the proceedings, and his own backstory is sloppily put together. Plus, his relationship to his daughter, in contrast to Salva and Lwai’s relationship, does not receive any attention, losing out on an important emotional connection.\\n\\n\r\nAnd many of the cast members are forgotten about once the second half rolls around – such as the kids, the big boss lady, and Albert, Kyouma’s closest friend and fellow Beast of Grendel.\\n\\n\r\nThe cast is, simply put, weirdly handled.\\n\\n\r\nSOUND\\n\\n\r\nArguably, the strongest part of Dimension W is its OP. The techno beat and feel easily fits alongside the technology, electric, and futuristic motifs. And the different tonal sections add variety without coming off as out of place. Admittedly, the English lyrics can be silly to hear (“Low resistance of high zest inner cells”), but the song is still a welcome addition to the anime.\\n\\n\r\nThe ED does not reach the same heights. While the start of it is cool with its guitar work, and the ending is nice with its vocal work, the middle stretch of the piece leaves much to be desired as it somewhat strolls along despite the band’s loud interjection.\\n\\n\r\nAs for the rest of the original soundtrack, it has a surprising number of interesting tracks. “Osoikuru-Mizukaranoteki” intertwines orchestra with acoustic guitar and castanets. “Yappariwakaranai” slows everything down with slick harmonica playing. “Kanashiki-Kioku,” with its choir and organ, invites a sense of foreboding. “Isshokusokuhatsu” builds suspense through clanging and light violins. And “Kesshi-no-Tatakai” goes grandiose to coincide with the later, larger scale.\\n\\n\r\nThese tracks from the OST are not stellar, and, indeed, many of the pieces are rather average. But the they do at least have some care put into them.\\n\\n\r\nFinally, only a couple of shout-outs are deserved in terms of voice acting performances. Reina Ueda as Mira adds cuteness, personality, and life to the robotic girl, and Daisuke Ono as Kyouma proves his veteran status with a manly and peeved voice for the disgruntled main protagonist.\\n\\n\r\nENJOYMENT\\n\\n\r\nWithout a doubt, Mira was a lot of fun. In this world filled with angry dudes and potential death, I could count on Mira to make me smile. Her pouting when Kyouma was being mean, her kindness in dealing with others, and her happy face while holding hard-earned money had me grinning and laughing. Usually both.\\n\\n\r\nMira’s antics with Kyouma were fun, too. Kyouma closing the bathroom door on Mira and Mira freaking out when Kyouma approached her from behind after she read all of those scary books were silly moments. I especially liked the rock-moving bit. Kyouma was having extreme difficulty moving even one rock, but Mira was tossing them aside like pebbles. I just wish there had been more of these moments.\\n\\n\r\nI also liked Albert. More specifically, I liked the relationship he shared with Kyouma. Albert was technically Kyouma’s enemy, but they were friends. It gave their dynamic a sense of camaraderie. That they understood each other’s positions and treated each other with respect. Similar to Kyouma and Mira, however, I wish that Albert had more scenes with his friend.\\n\\n\r\nEverything else, however, was not the most engaging for me. A lot of the action was either too over the top or lacking in coolness. The various dramatic bits, like Kyouma’s wife’s death or Loser’s death, didn’t get to me emotionally. And the other characters and plotlines were simply uninteresting. I was simply not entertained.\\n\\n\r\nDimension W gets lost amidst space and time. The story’s construction introduces a lot of problems, the characters are given odd levels of importance, and the art does not usually impress. Basically, the show’s batteries didn’t last.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the first half sets the stage only for the second half to trip all over it\\n\\n\r\nAnimation: Fine, okay artistic direction, about average actual animation, and nice character designs\\n\\n\r\nCharacters: Terrible, from Kyouma to Mira, the cast have a hard time remaining relevant let alone being worthwhile\\n\\n\r\nSound: Fine, good OP, bad ED, okay OST, and okay VA performances\\n\\n\r\nEnjoyment: Bad, Mira and Albert were fun, but the majority of the show was not\\n\\n\r\nFinal Score: 3/10",
            "date": "2017-06-04T12:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 249270,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=249270"
        },
        {
            "content": "Although it says I completed it that is a bit of a bold face lie. Well not a lie, just more like I am half way through the last episode since I tried to watch it this morning but I had to go to school halfway through it. But none the less I am doing a review\r\nFor those who don't know I'm Josh and today I'm reviewing the anime known as Dimension W. Let's do this\r\nStory- The setting is interesting. Personally I have never been an end all be all sci-Fi fan but I like the setting. The story on the other hand was...meh. Imean it was original I give it credit there and not he worst story I have ever seen but it just felt...meh to me for some reason. Through the first 5 episodes I liked it but by the second half that is when I found it to be meh. It isn't really a bad story though. I don't know what happens in the end so I couldn't really say anything about that till I fully see it. Overall though I will give it a 6/10\\n\\n\r\nArt- I actually liked the art in this. Pretty good for what it is and I like the character designs to a certain extent. Plus the fight scenes were pretty cool Overall I give this a 7/10\\n\\n\r\nSound- I love the opening to this to death. I will play it over and over again. That is how much I like it. The ending is average for me and the sound track is decent. Overall it gets a 7/10\\n\\n\r\nCharacters- Like the story I did find he characters to be meh. Now granted I do like a couple of them but in the end the character just felt meh to me. Not hat they weren't interesting or anything, I just found them not to be that exciting really. Overall 6/10\\n\\n\r\nEnjoyment- I really enjoyed. It's one of those anime I just can't do anything but find myself enjoying it. Overall 8/10\\n\\n\r\nOverall- Dimension W isn't the greatest, but it is a pretty good anime to watch. I would recommend this to anyone who loves Sci-Fi anime really. Overall the show gets a 7/10 from me",
            "date": "2016-05-26T06:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 219344,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5378004.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JoshuaJones16",
                "username": "JoshuaJones16"
            },
            "url": "https://myanimelist.net/reviews.php?id=219344"
        }
    ],
    [
        {
            "content": "*Spoilers will exist to explain why this show is great*\r\nStory: 8\r\nNow some of you have heard that time is considered part of the fourth dimension, but what if you were told that there is a dimension that contains all of the possibilities in the world? This is basically what the story is based on.\r\nThe anime does not explain the mechanics of Dimension W too deeply, but it explores it enough to give us an understanding of what it's trying to convey, such as when coils go haywire and Dimension W manifests in the real world, or when the characters are able to enter Dimension Wand see all the possibilities. However, the actual use of Dimension W is a bit superficial outside of that. Everything just mainly revolves around coils and the 'possibilities' get shoved back as more of a nominal thing. So in the end the actual usage and exploration of 'possibilities' was a bit minimal, and may have become more of just a theme to a battle story with some cute moments.\\n\\n\r\nAnd as good as the combat was, it seemed a little odd at times. Mabuchi seems to just freely throw out however many dart things as he likes, while being able to wire them so he can perform spiderman or AOT style swings and climbs as he wishes, along with the fact that they can also act as some sort of snare. There wasn't any moment where he ran out of darts or was in any particular danger due to his choice of weaponry which kind of made him a bit of an immortal god of sorts. \\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nArt: 9\\n\r\nIn regards to the art, it was very well done, especially the characters. They stood out well and were designed quite differently. Mira was consistently cute, Mabuchi maintained his gruffness, Loser maintained his enigma while Lasithi was designed quite sexily. The use of colour was appropriate to the moment, though backgrounds would occasionally look quite bland.\\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nCharacter: 9\\n\r\nAs for the characters, I did want to give it a 10, but the only thing that ruined it was the main antagonist, Haruka Seameyer. He was just a little too cliched with his insanity and cruelty. He just didn't feel unique enough as an antagonist for me to really be drawn to him and to actually hate him for his existence (like Joffrey in Game of Thrones). \\n\r\nHowever, setting aside the antagonist, Mabuchi Kyoma is quite the likeable character. He's strong and independent (not clinging to friendship nonsense), and has a cool attitude but with a sad history. \\n\r\nWhilst Mira is the lovable female MC who's a robot with a full human personality. She cries, blushes, and even expresses pain. She's funny, cute and most of all, has a consistent character. \\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nSound: 9\\n\r\nThe voice acting in this was also great. Mabuchi has a cool, deep and slightly apathetic voice that suits the character and helps set him apart from everyone else, while Mira has an appropriately feminine and cutesy voice which greatly complements the character. \\n\\n\r\n-------------------------------------------------------------------------------\\n\\n\r\nEnjoyment: 10\\n\\n\r\nOverall: 9\\n\r\nOverall, I really liked this show. Maybe I'm biased towards shows that can have a consistently cute girl and who isn't annoying or out of place. Mira is not your damsel in distress, but an actual partner to Mabuchi, which I feel really helped with me giving this show such a high score. And I definitely hope to hear more of her voice in future titles.\\n\\n\\n\\n\\n\r\n*Some further spoilers and personal inputs on what could have made this show even greater*\\n\\n\r\nThere was a line in the last few episodes that really helped bring the logic of the world and the coils together, which was: \"Possibilities can be predicted and explained but not observed, that is because once it is observed, it is no longer the possibility but the result. I.e. Schrodinger's cat.\" or something to that effect. \\n\r\nThis line alone is what could have made this show all the more interesting. Somehow manipulating Dimension W to bring about a favoured possibility which results in the defeat of the final boss. Maybe the anime studio ran out of time, maybe the author just wasn't ready for such a complex story. They had the opportunity to utilise it through Genesis, but ultimately removed it by 'destroying' Genesis.\\n\r\nWithout actually exploring the fundamental concept of possibilities which links the entire story together, the show was prevented from being unique and instead became another battle story with just a different theme, much like Bleach, Naruto or Fairy Tail.",
            "date": "2016-03-28T07:00:00+00:00",
            "helpful_count": 118,
            "mal_id": 214525,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/2LongDidntReview",
                "username": "2LongDidntReview"
            },
            "url": "https://myanimelist.net/reviews.php?id=214525"
        },
        {
            "content": "If there's one anime this season that went unnoticed, unhyped, and maybe even unfairly underrated, it's Dimension W. While not the flashiest, and certainly not the most outstanding anime- DimW has one thing going for it: it's original. Sidestepping the trappings and tropes that seem to permeate modern anime, and instead embracing a groovy sci-fi near future with androids, flying cars, giant robots, and more- this one was a definite breath of fresh air. \r\nProduced by Studio 3Hz, apparently a very new studio, with literally one credit to their name, the animation and art aren't anything special, but neither are they completely uninspired. It's abit on the low budget side compared to some modern shows, but fluid and frenetic action coupled with some stylized CG made it very watchable. Similarly, voice acting is handled competently, and the music fits well, adding accents or enhancement to the mood when necessary.\\n\\n\r\nThe nearly infinite, but unstable energy source that the show is named for takes a front and center position in the plot- weaving a narrative around the creation of \"coils\", which as essentially batteries that can access the 4th dimension, a plane of existence where possibility is endless, and is tapped into as a source of energy. Everything takes coils: the robots, cars, computers, and nearly the entire world run on this limitless supply of energy.\\n\r\nKyouma Mabuchi, our main character, is essentially a luddite in this techno world of Dimension W. He works essentially as a mercenary, collecting special types of highly unstable coils which can create massive rifts in space/time, and generally screw up everything, including sucking people into the energy black hole it forms. In return, he gets paid in things like gasoline (a scarce commodity in this future-world) and parts for his \"antique\" cars. \\n\r\nKyouma's dislike for coils, robots, and essentially anything technological puts him at odds with the technologically obsessed world he lives in- in a sort of \"born in the wrong generation\" way. His rugged, tough guy, and often rude demeanor are offputting to most people he meets, but he's dependable to get stuff done when it needs doing.\\n\\n\r\nThe premise of the show is a fairly basic revenge tale, but this isn't immediately apparent, even through the first half of the show. The first section with Kyouma taking various jobs from his boss serves mostly as a semi-episodic adventure, introducing all the myriad characters, and then neatly segues into a long term plot. Without saying too much- there's a very collectible coil situated in a very dangerous area out in the Pacific ocean- one that is worth a lot of money, and none of the \"collectors\" (people like Kyouma who hunt coils for a living) can pass up. In a sort of \"Mewtwo Strikes Back\" kind of way- this alluring prize on an island in an old lab turns out to be more dangerous than any of the collectors can handle. They gather, each with their own goals and reasons for doing so- whether to use the money to help a decimated country, for personal greed, revenge, or just to satisfy bloodthirst, and this sets the stage for a battle royale of wits and wills. At times though, the show seems to lose sight of what it was going for- getting sidetracked on what are seemingly one off adventures that mostly end in Kyouma questioning something about himself, but not actually creating any new development. \\n\\n\r\nThe show has quite a large cast to be as short as it is, but this isn't all great, as many characters are relegated to first string bench warmer status, and play little to no role, especially later on. It does, however, do a fair job of returning to important moments from previous scenes, and wrapping things that seemed like dead ends up.\\n\\n\r\nKyouma's motivation for his job and raison d'etre are both explored at length. Finally, a show with a non-insert main character who actually has both tangible goals and reasons for why they do what they do. In his own angry-at-the-world way, Kyouma struggles against his inner demons, for love lost, his survivor's guilt, and the purpose of his continued existence in a world he no longer cares about. Cynical, hardened, and rather rage-filled, he makes for an interesting character who doesn't need anyone but himself, and honestly doesn't really care if people around him get hurt or killed. While not entirely heartless, he's a pretty cold and stoic character focused almost solely on his revenge. This isn't revealed immediately, but as we learn more about the character, we slowly begin to understand the obsession that eats at him.\\n\\n\r\nIn finishing, Dimension W was a nice change of pace this season- with a very action oriented show that wasn't preachy or pretentious in presentation, satisfying, and most importantly: unique. It's not a mystery, and it's not a pure shonen battle- it's got just the right amount of spice to keep things interesting, moving, and fresh. I don't think there are too many anime that couldn't benefit from longer to flesh out their ideas and really explore characters and plots, but Dimension W is just about right at 12 episodes. Any less would have felt extremely rushed, and any more would have unnecessarily dragged it out. A shallow anime that's enjoyable enough? Sleeper anime of the season? That's for you to decide. \\n\\n\r\nAs always, come rage at me, or say something nice. I don't care.",
            "date": "2016-03-30T07:53:00+00:00",
            "helpful_count": 67,
            "mal_id": 214793,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4277165.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/lawlmartz",
                "username": "lawlmartz"
            },
            "url": "https://myanimelist.net/reviews.php?id=214793"
        },
        {
            "content": "Watching Dimension W makes me feel a bit like my childhood days. I’d watch some random anime on TV with my friends on Toonami and we’d make jokes about the story, characters, artwork, and every other funny thing going on. Dimension W isn’t a funny story but it does have the feel of a show that’s aimed at the Western audience. And furthermore, it takes place in a fictional world in the future so there’s tons of potential. Dimension W capitalizes on those potentials and makes this show not just fun but an insightful experience.\r\nCalling Dimension W another stereotypical sci-fi action flick would be injusticeas the series explores quite a bit based on its premise. The show is directed by Kanta Kamei with Aketagawa Jin as the sound producer and produced by Studio 3Hz and Orange. It’s noticeable that Funimation is the co-committee of this series as well to bring their talent into the mix. For those who have seen Darker than Black, you may find the show has a familiar vibe in terms of character design. The interesting part is how Dimension W focuses on its own story and despite not being too refreshing for its ideas, it’s very a high dose of popcorn entertainment.\\n\\n\r\nThe story takes place in a fictional world in the future. By 2071, humanity began using a source of energy that can last forever for their planet. Through influence of the fourth dimension, they are able to harness energy in the form of objects known as “coils”.  Coils are manufactured by New Tesla, an energy company that uses them for profit. However, they also private firms and groups that uses illegal coils for their own purposes. The show introduces Kyouma, a collector who has a hatred for coils. His adventures takes him to all sort of places including his meeting with a peculiar robot girl, Mira. Get the picture here? Any fan of sci-fi should feel intrigued because of the amount of world building with the show. Indeed, Dimension W does a good job by building up its fictional world and constructing it concepts with interesting details. The imaginary setting of Dimension W introduces many concepts including its rich history, society, and technological advancements. As such, getting into this show allows the viewers to appreciate the ideas of the creator.\\n\\n\r\nIn general, the plot is about Kyouma, a collector who despises coils. There’s actually a credible reason for this as explored in later episodes through background storytelling. His encounter with Mira is a bit odd however. Essentially and for most of the series, he is indifferent about her presence and often calls her names like “junk” and “useless robot”. Despite that, there’s a growing chemistry between the two. Mira is also a character that will spark interest because of her very human behavior. She is a robot but displays a lot of personality as if she is an ordinary girl. Throughout the show, we can see that she wants to help people and her partnership with Kyouma leads her to do selfless deeds. Kyouma is portrayed more as the guy who wants to get the job done and lives life like a simple man with a love for vintage cars but hate for coils. His fighting skills is fairly impressive and is able to fight on par with cyborgs, coil enhanced mechanisms, and even multiple enemies at once. Add a bit of his driving skills and it’s easy to see that Kyouma is the badass everyman. \\n\\n\r\nWhen watching the show, I noticed some trends about the plot structure. It focuses on society and explores Kyouma’s daily adventures. At first, some of his cases really shows more than what he does in everyday life. However, subsequent episodes introduces other ways at how Dimension W’s world works. There’s also murder mystery, cyber-punk themes, and how events from the past connects with the story in the present. The show also introduce Numbers and their presence really exposes the dangers of coils. Background storytelling is also incorporated into the show that explores Kyouma and other characters’ pasts. Unfortunately, the series is only one cour of 12 episodes while the manga has at least 9 volumes. Get the idea? Expect a lot of cuts with certain side characters and certain rush of the story to get to specific arcs. Characters like Elizabeth, Albert, and other many of the minor villains get some spotlights but not much characterization. As one of the downsides, Dimension W’s adaptation content may be a disappointment for manga fans. \\n\\n\r\nDespite that, I think the show is still very entertaining for its characters. Then, there’s a lot about the Dimension W universe that is intriguing. We get to see how androids interact, the world fiction of Dimension W’s technological aspects (coils, numbers, machinery, etc), and the show even has some pretty solid action. Kyouma’s a legitimate badass and he has little patience for evildoers. Similarly, the show has both a comedic and serious feel. The comedic moments are timed right especially through the interactions between Kyouma and Mira. In addition, the series rarely tries to exploit its shock values to entertain the fans but rather with its own merits. \\n\\n\r\nThe art style of Dimension W tends to have a very scientific feel. Character designs are also neat and will remind anyone of Darker than Black. Kyouma reminds me of a lone wolf detective and bounty hunter that came out of a classic movie. Meanwhile, Mira has the appearance of a young girl with robotic characteristics. (see that cute little mechanical tail?) The sci-fi backgrounds and technology also looks credible and advanced enough to be set in its timeline. The gadgets of the show and other robotic designs have a fair amount of details to further make its world building look believable. There’s even a bit of artistic enhancement with creative shade coloring at many noticeable scenes. Fan service is fairly minimal although there are a few times when the camera likes to shine on Mira. The real fan service is the action delivered right to your face.\\n\\n\r\nSoundtrack is solid especially when Kyouma is on a mission involving him collecting illegal coils. It’s eerie, energetic, and portrays science fiction with theatrics. In addition, I appreciate how Kyouma’s voice sounds as a mature adult rather than some kid out of high school. On the other hand, Mira’s voice can sound a bit bratty so fans will have to get used to that. Luckily, you will be rewarded with the very creative OP song. Performed by STEREO DIVE FOUNDATION, it’s very colorful with the dancing, full throttle action, and creative coloring. OST and music is just as impressive and shows that the creators cares a lot about their work.\\n\\n\r\nDimension W is a show that I think anyone can watch with something to talk about towards the end. Whether it’s the world building, storytelling, characterization, or technical art/music/soundtrack style, the show is a lot of fun. It lives up to what it tries to do despite cutting content from the original manga. As most series in modern years, it’s not very original and still borrows a lot of ideas from other sci-fi works. However, Dimension W still embraces the sci-fi genre and shows that it can be unique in its own way.\\n",
            "date": "2016-03-27T08:05:00+00:00",
            "helpful_count": 65,
            "mal_id": 214347,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/887295.jpg",
                "scores": {
                    "animation": 7,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Stark700",
                "username": "Stark700"
            },
            "url": "https://myanimelist.net/reviews.php?id=214347"
        },
        {
            "content": "Dimension W, definitely the best thing Studio 3Hz has made so far.\r\nDimension W is a very episodic road trip-ish anime about a dude who is essentially a \r\nbounty hunter and a robot girl who gets stuck with him.\r\nPretty standard setup for an action show with some fancy visuals.\r\nIt's not without its flaws but if that sounded interesting to you it might be worth a watch.\r\n--Full review: minor spoilers ahead\r\n-Presentation(visuals & sound)\r\nDimension W has some well used CGI, though sometimes it can still stand out a bit too much.\r\nThe backgrounds are well made, the CGI never felt choppy, and I like the character designs.\r\nI've heard fromsome people that this is their favorite OP of the season, but it just sounded like pretty generic electro to me.\\n\r\nSame thing with the ED, not saying they're bad but I've heard better.\\n\r\nOverall the animation is just very fluid, colorful and nice to look at.\\n\\n\r\n-Story\\n\r\nDimension W is very arch based and starts with what I would call a very bad first episode, it's essentially just a setup for the next episode.\\n\r\nIf you plan on giving Dimension W a go, then make sure you watch two episodes before deciding if you're going to complete it.\\n\r\nThe second episode is much stronger, and introduces one of the recurring characters, Loser (yes they actually call him that).\\n\r\nThere's one more episode that just felt like mostly boring info dumping, but that doesn't come until later on.\\n\r\nAnd even with the info dumping by the characters this is how I understand the coils: wibbly wobbly timey wimey, realities inside of coils.\\n\\n\r\nBased on the premise I thought this show would comment on fossil fuel usage, but I didn't really hear much of that at all, for the better or worse.\\n\r\nFor the sake of explanation I'm going to mention that the coils can essentially provide infinite energy, meaning they can do pretty much anything.\\n\r\nThe author clearly had fun with this, maybe a bit too much since sometimes it feels like whatever happens the author basically pulled out of his ass.\\n\r\nNot that it matters too much since it's excused and explained and the story isn't super important here.\\n\\n\r\nOne more gripe I have with the story is how the characters backstories are explained almost entirely in flashbacks, come on can't you figure out something more creative?\\n\r\nOtherwise the story is interesting enough.\\n\r\nThe ending is conclusive enough, definitely not just a read the manga ending.\\n\\n\r\n-Characters\\n\r\nProbably the best or the second best thing about the show, depending on how much you appreciate the animation.\\n\r\nFor once we don't have a completely bland main character, Mabuchi Kyouma is a person who dresses in traditional clothes and hates coils.\\n\r\nMinor note that I don't particularly like the fact that Kyoma does his fighting with throwing knives, it tends to make for poor battle choreography.\\n\r\nThough the choreography is still better than average.\\n\r\nHe has a fairly extensive backstory that I won't spoil.\\n\r\nYurizaki Mira is Kyoma's robot partner who is extremely strong and can detect coils.\\n\r\nTheir dynamic was quite fun to watch, and mira is also given an okay backstory.\\n\r\nOther than that due to the Nature of the show there aren't that many interesting recurring characters aside from Loser\\n\r\nBut what is there is pretty good.\\n\\n\r\n-Overall\\n\r\nIt might sound a bit harsh to only give Dimension W a 6/10 but there are many shows just like it, and outside of the premise\\n\r\ndimension W doesn't have much to distinguish itself with.\\n\r\nAnd on top of that it wasn't really my type of a show to begin with.\\n\r\nThe narrative can feel a bit choppy at times.\\n\r\nCharacters didn't get much development because the show was busy just establishing them in 12 episodes.\\n\r\nThe visuals aren't without a few hiccups and the music used wasn't really my thing either.\\n\r\nI could still recommend Dimension W to someone who likes futuristic action shows.",
            "date": "2016-03-27T08:57:00+00:00",
            "helpful_count": 44,
            "mal_id": 214355,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4837031.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 6,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/TheAnimeToast",
                "username": "TheAnimeToast"
            },
            "url": "https://myanimelist.net/reviews.php?id=214355"
        },
        {
            "content": "Dimension W was billed as one of this season's shows with the potential to really appeal to a western audience. On the surface it does share some of the elements that tend to get a bit more attention from action-starved overseas fans. A cyberpunk setting, a sci-fi thriller plotline, and a no-nonsense masculine lead in Mabuchi Kyouma. The latter is a near-future Luddite. Dimension W is set in a world where everything is powered by devices called 'coils' which tap into a hypothetical fourth dimension for unlimited energy. Kyouma despises the contraptions, symbolically driving a gasoline-fuelled car when the rest of the population has switchedto electric vehicles. The coils are administered by an uber-powerful corporation called New Tesla, and yes, the very predictable routes of corporate corruption will be explored, beating that horse just a few more times as it barely wheezes a neigh. \\n\\n\r\nSo the punchline is that Dimension W isn't that good, but how could an anime with such a cool setting be so mediocre? Well, let's start with the setting. It actually sucks. A few episodes start with a synopsis that pisses in the face of Albert Einstein, where dimension w is shown on a cartesian x-y-z graph as a line parallel and opposite to the x-axis. A keen observer might notice this is actually the negative-x axis, but the laziness doesn't end there (by the way, E=mc^2 is only the non-relativistic component). Apparently the energy from dimension negative-x is distributed amongst the populace via a network of 60 control towers, and that's not the only big number used to give an illusion of complexity where there is none. Also, apparently New Tesla just straight up murdered the wife and child of their most important inventor, and if there was an actually legitimate reason for this to be at all plausible, I've completely forgot it.\\n\\n\r\nThat important inventor, Professor Yurizaki, has developed a robot called Mira that mimics human emotions, who due to a series of goofy hijinks, teams up with Kyouma in his job to hunt illegal coils, which aren't regulated by Megagoogle. Her name is Mira and sure enough she's the best character is the series. Cute, while also having genuine agency in the story. The dynamic between her and Kyouma is great fun, so of course the more screen-time she gets, preferably along with Kyouma, the better this show turns out. Well, more than half of the series is taken up by Kyouma's character arc, where she spends a lot of time as a supporting role. Whoopsie!\\n\\n\r\nIt's a shame in fact, because Dimension W starts off okay. As overwrought and uninspired as the setting is, it can at least serve as a template for some interesting episodic stories. That describes the first five episodes. The latter seven episodes comprise the aforementioned character arc, and boy if the series doesn't squander its potential in them. One thing I've noticed with one-cour series is that they usually tend to do best when they focus on a cast of four or five key characters, while not getting too distracted by side characters that can be interesting but should nonetheless remain on the shelf most of the time. The alternative is having a good story, which at the moment is an ambitious expectation.\\n\\n\r\nThe last half of this series does neither. Many different parties participate in a search for a macguffin, and so the focus of the plot is immediately split between the motivations and backstories of these parties. This is such a waste of time, when time is of the essence in the one-cour format. Do you care about the stereotypical African prince, or the mysterious phantom thief Loser, or the downtrodden villain who's shoehorned into the plot out of nowhere? Of course not, but Dimension W shoves every hackneyed detail of these characters down your gullet.\\n\\n\r\nGranted, if the series kept up the episodic structure, it still wouldn't be good. The underlying flaws in the setting preclude any attempt to really take itself seriously. But it would have at least had variety going for it. Alas, this show is simply following the broad structure of the manga. \\n\\n\r\nAt least it looks good. The character designs are on point and blend in well with the style of the backgrounds. Both use a fairly wide color palette that is tamed by avoiding over-saturation. The quality of the drawings doesn't deteriorate much, and the animation quality is above average, although the CG robots are as unwelcome as ever. Wait for Flip Flappers for an exhibition of what Studio 3Hz may really be capable of.\\n\\n\r\nSo ultimately, Dimension W was just boring. Its source material is crap and it doesn't make any effort to spice it up.",
            "date": "2016-04-01T19:24:00+00:00",
            "helpful_count": 14,
            "mal_id": 215112,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 6,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Gridfire",
                "username": "Gridfire"
            },
            "url": "https://myanimelist.net/reviews.php?id=215112"
        },
        {
            "content": "Warning possible Spoilers\r\nI do like a good Sci-Fi show from time to time and this is a very good example of that considering it has an interesting story and good characters to back it up.\r\nThe year is 2071 and Humanity uses Coils to power pretty much anything and Kyouma Mabuchi a Collector who hunts down illegal coils in exchange for money suddenly ends meeting a little girl called Mira and then everything changes \r\nNow this show had a surprisingly good story it really delved into the whole mystery of how coils worked, what they can actually do and what secrets they hold that only afew people know it was very interesting watching the events unfold itself as the two MC's tried to figure out what was going on and why they were connected to the coils.\\n\r\nI loved the relationship that developed between Kyouma and Mira who started off on the wrong foot and over time slowly started to become more of a team and respect one another, plus the show has a dark tone to it since Kyouma has a dark backstory which is really the answer to everything that happens, but there were a few other moments that were dark like the episode at Lake Yasogami which is when the anime suddenly turned supernatural, there was also quite a few plot twists throughout the show which did surprise me.\\n\\n\r\nThe characters were actually really good even though Kyouma and Mira, especially Mira stole the show the other supporting characters weren't too bad either.\\n\r\nKyouma is an Ex-Soldier who became a Collector after an incident that happened, he hates coils and uses devices that we use today like a couple of Gasoline fuelled cars which included a Toyota 2000 GT which was pretty cool and he doesn't use guns instead he uses knifes attached to wires which at some point he kinda used like 3D Maneuver Gear from AOT when was jumping around and stuff, his personality is stubborn, short tempered and anti-social, but he is a definite badass because he knows how to kick ass mainly because of his experience as a soldier and because of his hatred for coils or anything technical he treats Mira poorly at first, but when he was finding out more about his past and the coils he slowly starts to loosen up to her and starts treating her like a teammate. Despite his personality and attitude towards other people when you find out what he was like in the past and what happened to him you do feel truly sorry for him and understand why he is like this.\\n\r\nMira was a brilliant, sweet and fun character who is also a robot, but compared to other robots I've seen the way her body works is much like a humans just mechanical which made her very interesting and the fact that she has antennas that look like ears and a amplifier cord that looks like a tail then you have a robotic neko which is cute as hell, but don't be fooled because she is very intelligent and strong thanks to her robotic abilities, she is treated poorly by Kyouma because of this who keeps calling her junk which annoys Mira which when she reacts can be pretty cute and understandable, she is a very likeable character and has a big role in the events of the show since she was created for a specific reason that'll unlock the mystery of the coils.\\n\r\nThe other supporting characters were interesting too like the mysterious masked thief called Loser who is looking for special coils because they unlock something and the fact he used to be a scientist, he is a pretty cool character and his daughter Elizabeth wasn't too bad either since she was actually very useful helping out her father.\\n\r\nThere was two other guys like Albert who was a former soldier with Kyouma who has some banter with him from time to time and there was Lwai a prince of Isla who is actually a Robot being controlled by his mind from his real body (I know it's confusing).\\n\r\nNot only that there was a bunch of other Collectors who were introduced later on in the show that also provided some good entertainment since they had some pretty interesting abilities.\\n\\n\r\nNow I did like the Artstyle it had a Cowboy Bebop feel to it mainly because it is set in funny enough the same year and it has that gloomy, dirty tone that Cowboy bebop had too, but the difference here is that Dimension W felt more advanced compared to Cowboy Bebop, I liked the design of some of the characters especially Mira who looked very strange, but cool and sweet as well plus some of the locations that Kyouma and Mira went too looked very interesting too like Lake Yasogami looked like it was out of a horror film and Easter island looked terrifying to be on.\\n\\n\r\nThe action was actually pretty good it was fun seeing Kyouma and Mira kick some ass against badguy's , but some of the other characters also proved their worth too like Loser and even the other Collectors who has some pretty impressive abilities and these abilities were very handy when they were fighting against the Security Robots on Easter Island or against each other.\\n\\n\r\nOverall I think this was a fun and entertaining show that gave off a familiar vibe that I had with Cowboy Bebop so if you're someone who enjoys Sci-Fi or enjoyed Cowboy Bebop then this is definitely something you might want to check out.",
            "date": "2017-06-15T10:46:00+00:00",
            "helpful_count": 6,
            "mal_id": 249964,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6236028.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Tyrannicswine117",
                "username": "Tyrannicswine117"
            },
            "url": "https://myanimelist.net/reviews.php?id=249964"
        },
        {
            "content": "It started off as a fresh anime with cosplay worthy characters (robot girl is the only good character honestly) The opening and ending song and art were really enjoyable, i didn't skip any of it. \r\nBut here is the tricky part of all science fiction series/film/etc, you need to be able to explain stuff logically  and the explanation should be satisfying (even if it is just made up for the sake of fiction) just claiming that everthing worked with coils that got the energy from dimension w is a very poor explanation about what the f_ was going on throughout this series. \r\nThe charactersand events were hard to follow at one point, as everthing was everywhere. The nemesis was presented and written poorly. \\n\\n\r\nThe best I can say for this series, it started off with lots of potential and I was hyped and excited to see the next episodes, a few weeks ago. It's an illusion though, this series presents nothing new, just re-introduces tropes from around the anime/manga industry. I haven't read the manga, and after finishing the anime adaptation, I don't think I ever will.\\n",
            "date": "2016-03-28T03:41:00+00:00",
            "helpful_count": 10,
            "mal_id": 214507,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3219829.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/murasakikitsune",
                "username": "murasakikitsune"
            },
            "url": "https://myanimelist.net/reviews.php?id=214507"
        },
        {
            "content": "a futuristic anime where they've unlocked the \"fourth dimension\" where they can draw out unlimited energy, thus resulting in robots and other interesting things that we dont know of yet in this day an age. Weird that they'd use Tesla, but it works well with the story. \r\nIt took me a while before I could fully understand what was going on since you're just literally thrown into a story that really has no depth yet. \r\nTurns out this story follows a group of \"collectors\" looking for illegal coils for money, and conveniently enough they all suffer from huge loses in there lives. \r\nMost ofthese people are out looking to avenge the deaths of the people they have lost because for whatever reason they all have lost whats most important to them. \\n",
            "date": "2017-12-17T13:20:00+00:00",
            "helpful_count": 4,
            "mal_id": 265446,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3492883.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 10,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/kassnicxo",
                "username": "kassnicxo"
            },
            "url": "https://myanimelist.net/reviews.php?id=265446"
        },
        {
            "content": "I'm mixed about Dimension W. Should you watch this show. Check this review to find out.\r\nPros\r\n- Opening and ED themes (Kyouma dancing and Mira being a waifu. Nuff said)\r\n- Stellar animation\r\n- Good OST (shout out to my boys , STEREO DIVE FOUNDATION for that opening tho)\r\n- Marvelous Action\r\n- Very interesting sci-fi premise\r\nCons\r\n- Uninspiring plot\r\n- Substandard character development \r\n- Kyouma and Mira's relationship (When will Kyouma stop hitting Mira and callling her trash, I mean thats his character but it got annoying real quick. Who in their right mind wants to abuse that adorable robot (ಥ﹏ಥ) )\r\n- Terrible Villains\r\nOverall, I don't know if i enjoyed DimensionW too be honest. It started out hype af (especially because of that opening) but then after about episode 5, I felt the show's plot dragged on and became predictable. I felt I was being forced to watch it every Sunday. Hey, but don't let my thoughts dismay you. Check it out yourself and make your own opinion!\\n\\n\\n\r\nGive it a 4 episode rule\\n\\n\r\n- Hans out ಠ_ಠ\\n",
            "date": "2016-03-29T07:25:00+00:00",
            "helpful_count": 9,
            "mal_id": 214662,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5163761.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/_Hans_",
                "username": "_Hans_"
            },
            "url": "https://myanimelist.net/reviews.php?id=214662"
        },
        {
            "content": "The story of Dimension W takes place in a world where humanity has attained unlimited energy, reshaping the foundation of our daily lives, raising the bar for what is possible for us to achieve. With an interesting premise and the promise of sci-fi action the anime catches your eye easily.\r\nThe artwork of the series remains flashy and slightly stylized through the whole experience, even when it obviously cuts a few corners. Sometimes the backgrounds will vanish for example, but rather than hide it, Dimension W makes it their greeting card, turning a weakness into a recognizable trait.\r\nSadly enough, when I reached the end of theseries, I couldn't help but feel it ended up a mess. At some point, the series simply lost focus and fell under the pressure of its own potential. What I mean by that is that the setting, story, and characters, are being pulled in so many directions that you can't get a sense of what it wants to be. It lays out its premise very clearly - 'What if humanity had unlimited energy?' - yet it never focuses on exploring this concept. Instead it brings in tropes from countless other animes and classic stories, and then tries to push it all into a blender. Examples would include the master thief that announces where he'll strike next, and ghosts living at a mysterious rural mansion. Neither of those examples seem to fit into a sci-fi setting.\\n\\n\r\nI was very happy to see some actual variety in the cast, showing a wide array of personalities, backgrounds, and nationalities. It's not every day that you see African characters portrayed in anime, and on top of it, playing roles that are important to the story. The show manages to make the world seem connected by doing this.\\n\\n\r\nBut what about our main leads? First there is Kyoma, the brooding version of Sakata Gintoki, a veteran soldier who's haunted by his past and refuses to fight with modern weaponry. Secondly there is Mira, the sexier version of Pinocchio, the robot with a heart of gold that looks at the world like a naïve child. They form a dynamic duo that's fun to watch, but since the anime doesn't have time to delve too deep into them there is still a lot of untapped potential.\\n\\n\r\nTo summarize, Dimension W is a series that will disappoint those who are looking for a strict sci-fi story, but might just barely entertain those who just want a bit of action.",
            "date": "2016-03-27T14:41:00+00:00",
            "helpful_count": 8,
            "mal_id": 214421,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4319803.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 5,
                    "overall": 4,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/Markezzo",
                "username": "Markezzo"
            },
            "url": "https://myanimelist.net/reviews.php?id=214421"
        },
        {
            "content": "I binged watched Dimension W for 2 days while waiting for episode 12 to air. I have to say that I thoroughly enjoyed Dimension W. Here are some of the reasons.\r\nStory (8): What I loved about Dimension W is that it is engaging and leaves you wanting more and more. You want to know what happens in every twist and turn and in a way, you wish that it could go on and on. I did not like however that it felt entirely inconclusive and that the ending seemed lacking, at least for me.\r\nArt (9): Bandai Visual is one of the best production houses, inmy opinion and the art for Dimension W was colorful, despite the darkness of its theme. The animation was also really stunning and the fight scenes are engaging. It's not overwhelming to look at and the characters, both protagonists, supporting characters and villains, seem distinct. \\n\\n\r\nSound (9): I really give much credit for the opening and ending themes for the score I'm giving this category because they are amazing. I loved the opening theme and of course animation. It definitely brought me back to my love of Gangsta. The ending was just adorable. The sound in the show itself wasn't necessarily up there but it blended in nicely with the plot.\\n\\n\r\nCharacter (8): What's so great about the characters of Dimension W is that they don't beg to be liked, well maybe except for Mira, who you need to like because cmon that face. Anyway, the characters are not waiting for you to love them because they are stereotypically lovable. They aren't. You wouldn't love Kyouma if you're looking for a bishounen or someone who is nice and sweet. He isn't. He's a cold,  badass and detached person yet why do I love him so much? It's because he is himself. This goes for the other characters like Loser, Mary and even Salva. They aren't the type of people you'd actually like but you like them anyway. \\n\\n\r\nAlthough one thing I have to say is that some characters felt like fillers. Even Al felt like a filler character. A lot of them are and some of them seem senseless. All in all, character-wise, Dimension W was pretty solid.\\n\\n\r\nEnjoyment (8): I left watching Dimension W thoroughly enjoyed. Although I didn't necessarily have those shouty feeling-feelings I usually have for an anime, I have to say that because of the action and the story, I definitely got hooked. There were more hits than misses but I think those holes could've been filled if it were a few more episodes longer. \\n\\n\r\nOverall (8): If you're looking for an anime that can fill your action and angst needs, Dimension W is a pretty decent anime to go and watch.",
            "date": "2016-04-01T00:33:00+00:00",
            "helpful_count": 8,
            "mal_id": 215005,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5288471.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/jayvwrites27",
                "username": "jayvwrites27"
            },
            "url": "https://myanimelist.net/reviews.php?id=215005"
        },
        {
            "content": "Looking for a fun and intriguing 12 episode anime? Well look no further than the 4th dimension, as that is exactly were you'll find Dimension W. You'll be immersed in the future, empathizing with the characters and enjoying the way this anime brings mystery, drama and action together. \r\nWhile the story isn't anything \"out of the norm\" in terms of characters and plot-lines, Dimension W does a decent job of not overstepping its bounds in this inter dimensional genre. The story was engaging all the way through and the cast was just the right size to keep things interesting all within just 12 episodes. \r\nInany short anime, character development can be a struggle. Dimension W handled this obstacle fairly well and you'll get a sense of who each of the main characters are, if only at a semi-basic level. But don't let that scare you away, the characters are by no means flat. Each of their backgrounds are genuine and fuel this likable story. \\n\\n\r\nOverall, Dimension W is an entertaining, easy to watch, futuristic anime that is sure to satisfy.",
            "date": "2018-04-08T22:55:00+00:00",
            "helpful_count": 3,
            "mal_id": 277488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4096255.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/iceMantheman",
                "username": "iceMantheman"
            },
            "url": "https://myanimelist.net/reviews.php?id=277488"
        },
        {
            "content": "This MAY contain spoilers!\r\nStory 8/10: This anime contains BOTH character and plot development. It has an interesting plot with a lot of backstories of each characters & how they all interrelate with each other & Dimension W. There is a lot of action & fighting scenes with the characters in the anime. \r\nCharacters 8/10: There are a lot of characters that are introduced in the anime. Most of them have a form of connection to Kyoma. (For this review, I will be focusing on the two main characters in the anime). Kyoma Mabuchi is tough guy and works as collector. He is also mean toMira-chan over the series. Mira Yurizaki is helpful, understanding & cute robot. She wants to be able to help Kyoma throughout their missions.\\n\\n\r\nEnjoyment 10/10: One of the best animes that I have every watched. This was my #1 anime to watch on my TOP 10 Anime List. The theme song is awesome too. I always keep listening to it on replay -- if anything, Genesis will become my entrance theme song as a wrestler. The theme of robots, cars & machines are cool too! I assumed that there might a romance between Kyoma and Mira in the future. \\n\\n\r\nOverall 8/10: All-around great anime with lots of actions. Great plot and backstories included! Dimension W has the potential to have a second season!\\n",
            "date": "2016-04-30T12:27:00+00:00",
            "helpful_count": 7,
            "mal_id": 217517,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1458799.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/nanakox21",
                "username": "nanakox21"
            },
            "url": "https://myanimelist.net/reviews.php?id=217517"
        },
        {
            "content": "Sci-fi is a pretty common genre in not only anime, but other mediums, such as novels and movies, as well. For a sci-fi series to stand its ground, its need to at least  have a solid fleshed out world or rules that are consistent to that world, or else, everything else will fall flat and lose its impact. Dimension W follows the typical sci-fi formula while still being able to differentiate itself from others in the genre. In a world where unlimited energy is no longer an issue, Dimension W explores the possibilities and situations various people can still go through. Devices called Coilswere created to harness an unlimited source of energy. At first might be seen as a MacGuffin Device, Coils, which are pretty important in the world building, are a means to deliver elements of the narrative.  \\n\\n\r\nOne of the many notable aspects of Dimension W is its ability to stay consistent to its own rules. I always admired how Dimension W was able to use its \"4-th dimension\" premise\" to craft intriguing yet enjoyable stories and plot points, plot points that actually become relevant as the series progresses. The show was able to build an interesting world with creative rules and still able make new ones while not breaking the show. Dimension W doesn't don't do anything groundbreaking, but the story for the most part is consistent and its all I ever want from sci-fi animated series. Another brilliant element of the show is its cast of characters. Kyouma is your typical badass main character who lives in the future, but due to unforeseen circumstances in the past, hates the world he lives in. Mira, his cute robot sidekick, provides a light cheerful mood in the relationship in contrast to Kyouma's serious and brooding demeanor. The chemistry and history between the two is enjoyable to watch, as well as give some levity to the dangerous situations they are put in. Another character, who is my personal favorite, is the supposed \"villain\" of the series, Loser. A masked vigilante with cybernetic enhancements with the power to manipulate energy, with an added bonus of having an awesome costume design and mysterious past. From the get-go, I was in love with his character and I loved what the show did to explore his character even more, giving him a meaningful yet compelling motivation. \\n\\n\r\nThe animation for the most part is pretty solid, it isn't as shiny or as polished as a high budget anime, but it could have been a lot worse also. It gets the job done. When it came to action scenes, they were pretty enjoyable, though was a bit disappointed with the lack of choreography seeing as how Kyouma is basically a ninja... Well he is, isn't he?  The art and aesthetics of the show also work in its favor. The character designs are all unique and makes it easier to distinguish the characters. The choice of colors was also quite pleasing to see as it helps portray the beautiful world of Dimension W and its sci-fi landscape. The use of green was also quite clever as it is used to portray how energy flows in that world as well as give the various locations in the show charm. The music for the most part is pretty good. The Opening song, as well as the animation in conjunction with it, will be stuck in your mind for awhile. Seriously, it is that catchy. The OST is also pretty solid, however, they isn't many outstanding tracks. The ending song of each episode was also nice to listen to. \\n\\n\r\nThere aren't many complaints I have with the series. Dimension W followed the typical sci-fi formula of having a futuristic setting for \"such and such\" reason and certain situations because of some science related disaster. The show sort of played it safe by following the usual tropes seen in sci-fi series, while still being able to bring something new to the table. The premise of unlimited energy, the existence of a 4-th dimension, and presence of impending doom all makes the show really enjoyable and entertaining to watch, which is all I want from a sci-fi  series. Not every sci-fi show needs to be an overly dramatic, dark, and serious thriller. I enjoyed every aspect of the show, and this is without a doubt one of the most enjoyable series of 2016 so far, as well as my favorite of the Winter 2016 season. \\n\\n\r\nI highly recommend the show to those looking for a good action and sci-fi series, Dimension W will fill your needs. I can guarantee you will not get bored with the series. However, those looking for a serious and compelling story or a show with amazing visuals, you may want to approach this show with caution. Overall Dimension W is a pretty solid sci-fi series that entertained me throughout its entire run.",
            "date": "2016-03-27T10:25:00+00:00",
            "helpful_count": 7,
            "mal_id": 214371,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3468953.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/AwesomeDudex3",
                "username": "AwesomeDudex3"
            },
            "url": "https://myanimelist.net/reviews.php?id=214371"
        },
        {
            "content": "The show is not bad, but it wasn't good either. There are no overarching themes, all the characters were cliché. Really I bursted out laughing, when the episode with the main guys backstory was. It s like a bad Hollywood movie, stretched over 12 episodes. \r\nYou can correct me if I am wrong, but I didn't see any relatable situations or character arcs in the show. The problem of the protagonist is he can't move on from a past event and it catches up to him. Nothing new. \r\nThe main theme of the show are the \"coils \" a new technology that symbolise progress ormoving on. Because the protagonist doesn't use them he is stuck in the past , emotionally as well as physically. Even that theme is developed poorly. Even the growth of kyoma was underplayed at the end .\\n\r\nThere is not much to gain from the show. The sci fi elements were not explored. The majority of the characters are unimportant and there wasn't a single memorable moment.",
            "date": "2019-02-26T11:58:00+00:00",
            "helpful_count": 2,
            "mal_id": 302510,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/LackyN",
                "username": "LackyN"
            },
            "url": "https://myanimelist.net/reviews.php?id=302510"
        },
        {
            "content": "This would have been in my top 5 season of anime if it wasnt for the poor storytelling of the first half of the season.\r\nEP 1-6 is a 4.5/10 , EP 7-12 9.5/10\r\nI LOVE the premise of a robot learning how to be a human its my PB and J. Mira is a really cool character and concept but this season did a poor job of using her (hopefully they dig deep in later seasons).\r\nKyouma was lackluster for me until they started to develop him in the latter of the season in which this dark little caterpillars past blossoms out into a beautiful story.\r\nArt andSound i gave both 8, they dont seem to be anything special but the fight sound effects where cool and the colorful landscape of the Dimension W world is cool.\\n\\n\r\nCharacters 10/10, Soo many Animes try and fit 4+ main characters and develop them into a show im happy with this show for only having 2 and developing atleast 1 of them to my satisfaction. \\n\\n\r\nEnjoyment 8/10, I had to stop watching this because while it was airing because i really didnt like it as much as the other things i was watching, but after binge watching it i felt sucked in and had to finish it as fast as possible.\\n\\n\r\nOverall 7/10, Could have been done better overall but if i were to here something like \"we spent most of the money on the Island arc\" It would make soo much sense to me",
            "date": "2016-04-30T13:30:00+00:00",
            "helpful_count": 6,
            "mal_id": 217526,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Evil_Ood",
                "username": "Evil_Ood"
            },
            "url": "https://myanimelist.net/reviews.php?id=217526"
        },
        {
            "content": "If you loves sci-fi, future, android related movies, this might entertain you (as well as a little bit of combat, I said little bit because it is just ok)\r\nThe story revolves around the main character (Mabuchi Kyoma) and an android (Mira).\r\nThe story about a future world where earthlings can substract infinite energy from the other dimension (or dimension in the axis W) through a device named coil. Kyoma who got a bad experience with coil failure is probably the only person on earth that doesn't use any coil and resort to old time battery and petroleum. \r\nOne thing that doesn't stand out for me isthe lack of climax and anticlimax each episodes. So the pace is relatively flat but still in an interesting phase. (I would usually ditch shitty anime in the first episodes, at least Dimension W survive)\\n\\n\r\nArtwork is awesome, there are a lot of variety in character design, quite fancy colouring. It is nice to watch, altough it is not that fancy in terms of combat animation (because it is an action sci-fi anime, I hope Kyoma have a better combat ability and a lot more combat skills)\\n\\n\r\nThe main character was too cold for me, and it goes in at least 5-6 episodes until we know why he is that cold, and for me it is too slow. On the opposite, Mira who is tagging along Kyoma was more than cheerful as an android. Somehow in doesn't make sense how Yurizaki hakase can make such powerful AI (well, anime is anime right?)\\n\\n\r\nOverall I did enjoy Dimension W so far, so could not give less than 8 for this. \\n\r\nI don't recall any anime that have specific type of story like Dimension W. Quite curious with the story development.",
            "date": "2016-08-02T13:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 225768,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5161820.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/samuel_sfx",
                "username": "samuel_sfx"
            },
            "url": "https://myanimelist.net/reviews.php?id=225768"
        },
        {
            "content": "Dimension W feels like it has something really good with lots of potential to be a very good cyber-punk action show.....however.\r\nWell before LA even starts this review, LA will say that LA did a bit of an experimentation when viewing this anime to see if simultaneously watching BOTH subbed and FUNimation Dubbed vers. in the ways of odd episodes are dubbed ONLY with even episodes being Subbed would be just something interesting for LA's viewing experience...it was however LA won't be trying this method for a looong time. Why?, because it was sooo hard keeping track of which voice actor voiced who (more specifically withDimension W's large ensemble cast). As for LA's viewing experience, it was a nice way of seeing if the dubbed or subbed vers. was in tune with each other and gave LA a psuedo-unbiased look at the dub (due it being odd episodes so LA technically watched it in dubbed first) but about the dub and sub will be later.\\n\\n\r\nFor now let's get to what LA meant by LA's first statement to this anime.\\n\\n\r\nDimension W has many strengths when it comes down to it, from it's initially interesting characters as well as it's world-building it did in establishing the coils and their true intent with the coils. Character development or to be more precise backstory was heavily used especially to our resident main protagonist Kyoma Mabuchi and that helped flesh out his dilemma about his for robotics and him even being a collector of coils. The animation done by Studio 3Hz and Orange is also stunning to look at from the bolded detailed to it's character designs and extremely fluid battle scenes, the psuedo-cyber and variety of gorgeous backgrounds (from supernatural craziness, cyber-like wastelands to the typical futuristic yet urbanized buildings) and the animation is one of major highlights of Dimension W without a doubt. The last strength LA will say is that although the finale gets really nutty and crazy with it's reality warping (it's called \"DIMENSION W\"...LA doubt this is a spoiler people), the finale did wrap up this well and did give something of a good sendoff to the anime.\\n\\n\r\nHowever with strengths comes weaknesses and although these weaknesses don't outright make the anime horrible per say, it still has an effect on the anime. Dimension W as much as they put emphasis to Kyoma's mysterious backstory, one of the biggest problems is that not only Kyoma but also Mira is affected with having no character development until the final 5 episodes of the anime, there is a bit of leeway to this as the first 7 episodes focuses on the introduction of Dimension W and it's characters and the world of coils then starts to see separate coil cases with plotlines that don't have a major effect to the main plot but it does gives us context as to the coil's true defect and that adds up into world building sure...but other than that, the coils in general are nothing but a plot device and all the plotlines including the main one focuses more on characters backstories than developing the characters as the plot progresses.\\n\\n\r\nWhile LA says this LA's opinions of the characters is that LA does sees Kyoma as a badass.....yet LA HATED it when he kept treating Mira poorly (mind you LA didn't outright hated Kyoma for this but still annoyed LA from time to time especially when he constantly calls Mira a \"piece of junk\"), as for Mira..well she was LA's favourite character as she was the Hope Spot and a constant source of help to the plot at hand and Mira's voice actor helped with this. The minor characters that had no connection to Kyoma and his backstory however got it MUCH worse being nothing but having importance only inside of their own arcs. The final arc is pretty long too but even then only a few minor characters that were introduced had little effect to the major plotline besides being support or annoying red herrings or spanner in the work distractions for Kyoma and Mira to the anime.\\n\\n\r\nSo where is the lost potential LA was talking about?, the coils and it's defects and the fact there are hundreds of them could have made this anime sooo much better shifting focus from characters to world building and what or HOW the coils functioned or go into more cases about coil malfunction to the most extreme degree and develop it's characters along the way. The last bit of potential wasted was Loser in his entirety, a sort of rival to Kyoma's coil hunting, never really had his exploits fully shown to us and the mere fact that he was an interesting character only for him to be relegated to ONLY when Loser was needed to further Kyoma's backstory dampened the experience and wasted potential on him. Now mind you LA still enjoyed Kyoma's backstory and how the anime still used his mysterious backstory to tie up loose ends to past events that links to the major plotline but looking deeper to the coils and it's lore would had been nice instead of being handwaved away as \"it's the future!\".\\n\\n\r\nAlright time to talk dubbing. LA actually enjoyed both vers. of Dimension W and NONE of either sides of the voice actors weren't bad or horrible. On the FUNimation dubbed side, LA would say that Jad Saxton as Mira was extremely good choice as Jad fit into Mira's shy yet extremely helpful and caring nature, Christopher Sabat as Kyoma was also the same and LA very much approved of both roles. The minor voice cast did well too with NO annoyance from any of the minor dubbed voice cast. This dub is actually one of the consistently good dubs LA has seen from FUNimation and pretty much gives praise to Colleen Clinkenbeard and Zach Bolton the ADR Director for the great picks in choosing their voice actors and their dubbed script. LA's favourite dub voice actor would go to Jad Saxton because does LA need to say it. On the flipside, the Japanese was pretty good and LA just have to say the same as LA said nearly verbatim as the FUNimation dub for this, the minor voice cast was great, Daisuke Ono was great as Kyoma and Reina Ueda as Mira was LA's favoruite voice actor just LA's reasoning for Reina is pretty much that Reina Ueda's adorable vocals as Mira was just great and again brought out the \"Hope Spot\" for the series. If LA had to choose which way to watch this anime...LA would say either of them is fine as neither did horribly or deterred your experience. However if you want Mira at her finest...stick to the Japanese (no offense to Jad Saxton as LA DOES love Jad as Mira and everything but dubs DO have a problem with portraying moe and Jad Saxton did a good job at this which is RARE, but Reina Ueda's vocals were just too damn adorable to let up), if you don't care for it...go with whatever suits you, LA is just showing LA's taste is all.\\n\\n\r\nSoo from all this, is Dimension W bad or good?...LA will say it's still a good anime as result even with all it's wasted potential of interesting plotlines it could take itself to, to the faults it had with it's characters and it's barren character development outside of our main protagonist's backstory to it's lack of explanation about coils outside of being plot devices but even with this, the end product still gave out a gorgeously intriguing action-filled cyber-punk anime focusing on one man who collects illegally dangerous coils.",
            "date": "2017-06-26T01:51:00+00:00",
            "helpful_count": 3,
            "mal_id": 251073,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2191881.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/LegendAqua",
                "username": "LegendAqua"
            },
            "url": "https://myanimelist.net/reviews.php?id=251073"
        },
        {
            "content": "(This review has been adapted from my blog/reddit thread. Spoilers ahead!)\r\nWhen I was a kid, I would play video games so much that I had to constantly beg my parents to keep a reserve of batteries in the house. We actually stashed them in the refrigerator, believing that having them at a colder temperature would somehow make them last longer.\r\nWhether or not that’s true, though, I cannot say. What I can say is that Dimension W needed to replace its own batteries at some point but never got the memo.\r\nSTORY\r\nDimension W follows Kyouma, a man with a deep resentment for Coils. Coils are a newfoundtechnology that tap into the ominous fourth-dimension – named Dimension W – allowing for, as its founder would describe, “unlimited energy.”\\n\\n\r\nWhile not technically true, Dimension W has two halves: the first five episodes and the last seven episodes.\\n\\n\r\nThe first five episodes do a nice job of presenting necessary information. The concept of Coils, the society built around the devices, and the futuristic setting are laid out. Mira, a unique cyborg, makes for a cute yet purposeful companion. And the importance of the so-called Numbers is made known. All within just the first two episodes.\\n\\n\r\nEpisode three is more character oriented, but episodes four and five are more relevant narratively. Episode four includes an interesting setting relative to the one given prior, and episode five introduces the idea that Numbers allow for a myriad of possibilities – an important detail for later.\\n\\n\r\nThen the rest of the anime happens.\\n\\n\r\nWhere the first five episodes were spread out in terms of focus, the last half of the anime hones in on one specific plotline: Easter Island. With the change in focus comes a drastic change in scale. Before, breaking into a museum, playing with a bunch of kids, and investigating a spooky mansion were as grandiose as the anime got. Afterwards, threats of global destruction, the end goal of the different cast members, and the political and violent direction each inflate the scale beyond what feels reasonable.\\n\\n\r\nSimultaneously, the anime tries and fails to introduce new narrative elements. Different villains that are either too silly or improperly explored join the fray. Random ideas, like a floating ball of energy or Mira moving through Kyouma’s subconscious, are difficult to accept even with all of the concurrent pseudoscience. Even certain plotlines, such as the bureaucracy finding out about Mira’s true origins, are discarded, making the anime come off as forgetful.\\n\\n\r\nIn order to present a lot of this information, the anime relies on heavy exposition. Characters spill their thoughts through long-winded monologues. And thematic subtlety is traded for heavy-handed explanations, telling rather than showing its messages.\\n\\n\r\nNevertheless, these themes are surprisingly complex: immutable history, acceptance of reality, and indeterminism.\\n\\n\r\nIn Dimension W, many of the episodes focus on the past. Kyouma’s life and wife are presented entirely through flashback. The same happens for many of the events in the last half of the anime – how Kyouma came to acquire Genesis, what drove Seameyer to go insane, and so on. In a way, the anime demonstrates that the past cannot be changed. I.e., history is immutable.\\n\\n\r\nAlong the same lines, the show pushes the idea that people have to accept this given reality. Both Kyouma and Salva refuse to acknowledge their pasts. For them (and anyone), it’s something that sticks no matter how much they may forget or not want to remember.\\n\\n\r\nYet that does not mean what is to come is predetermined. For while the past cannot be changed, and the present must be accepted, the future has no such rules. The possibilities are endless. Mira does not have to sacrifice herself. Kyouma can turn a new leaf. Loser has every right to fight to save his beloved.\\n\\n\r\nAltogether, these themes have close ties to Dimension W (the concept, not the title). Dimension W’s voids symbolize history’s immutability through their stillness. The widespread use of Dimension W, despite it challenging established norms, represents society’s acceptance. And Dimension W creating multiple possibilities help to highlight that indeterminism still stands.\\n\\n\r\nThe themes are both layered and connected, and the first half of the narrative is at least competent. But the numerous amount of issues in the second half are still enough to make the narrative an overall weak package.\\n\\n\r\nANIMATION\\n\\n\r\nDimension W’s artistic direction does have a few positives. It uses a visual trick to, at times, profile the characters. One-colored backgrounds and off-colored shadows give Kyouma, Mira, and others a poster-art look. The technique does not serve a purpose, but it does add flair.\\n\\n\r\nThe outcome of interacting with Dimension W (the concept) is also an interesting choice. Grotesque mutations and otherworldly obstructions turn what should be a lauded discovery into a hideous amalgamation – a dichotomy reminiscent of the show’s own love-and-hate technology motif.\\n\\n\r\nThe rest of the art tends to be hit or miss. On the hit side, the sprawling city – with its alleys, skyscrapers, and underground shops – adds variety as well as a futuristic yet realistic setting. On the miss side, the monotonous mountains, snow, and derelict corridors that make up the vast majority of the second half of the anime replace the variety and futuristic details with repetitive, boring backgrounds.\\n\\n\r\nActual animation remains roughly around average. Once again, a first-half-second-half distinction can be made. In the first half, Kyouma’s escapades and Mira’s silly reactions keep the anime from feeling static. In the second half, while the action involves robots of different types, the animation is not as fluid as it once was. Certain scenes can bring back that spark, like when Kyouma takes down a robot, but those moments are few and far between.\\n\\n\r\n(Even so, Kyouma’s dance moves from the OP deserve a special shout-out.)\\n\\n\r\nIf nothing else, the character designs manage to be both interesting, cool, and different compared to one another. Kyouma’s lion-esque hair and laidback attire paint him as both fierce and nonchalant. Mira’s green hair, catlike features, and various outfits (especially her bulbous hat) turn her into the cute and likable character that she is. And both Salva’s and Lwai’s appearances are exotic, fitting their royalty and foreign statuses.\\n\\n\r\nCHARACTERS\\n\\n\r\nThe cast of Dimension W is weirdly handled.\\n\\n\r\nTake Salva and Lwai. Salva’s backstory is shown, but the extent of his relationship to his brother (and his secretary that he constantly slaps) does not receive much attention. Lwai is similar. It is revealed later on that Lwai is actually in a comatose state, controlling, at the same time, robots that look like him. But beyond his devotion to his brother, he does not have much to his character.\\n\\n\r\nTo be fair, his main purpose is to become friends with Kyouma before his revelation. By doing so, it demonstrates that Kyouma can, in fact, befriend a cyborg that uses the very Coils that he despises.\\n\\n\r\nBut a weird problem arises: The anime spends almost too much time on the Egyptian brothers. Instead of focusing on other established characters, like Loser and Dr. Shidou (Mira’s father), the anime instead chooses to focus on these latecomers despite their relative unimportance to the plot. Worse still, the focus needed is stolen from others. Namely, Kyouma and Mira.\\n\\n\r\nKyouma and Mira share a tenuous relationship. Kyouma despises Coils and, consequently, Mira. Mira does not hold any feelings of ill-will towards Kyouma, but she does wish he would treat her more like a friend (at least an acquaintance) and less like a piece of junk he picked up from the side of the road.\\n\\n\r\nSo when Kyouma gets all buddy-buddy with Lwai, it almost feels like a betrayal. Granted, Kyouma does not know of Lwai’s personal background, but as he grows his relationship with the young boy, Kyouma (and therefore the anime) must subsequently disregard the relationship between him and Mira. Given that Kyouma and Mira’s relationship is easily more important to Dimension W when compared to Kyouma and Lwai’s relationship, it becomes hard to justify the anime practically forgetting about its main duo.\\n\\n\r\nTheir relationship is weird, too. Mostly because the transition from Kyouma ragging on the young girl to tolerating her presence has little to do with each other. Yes, Kyouma saves Mira from certain death (twice), but his behavior towards her does not change as a result of their interactions together. Rather, the change occurs because of Kyouma learning more about himself.\\n\\n\r\nWhat he learns is memories he had essentially repressed. The girl he met, fell in love with, and married. The horrors he and his crew faced while scouring the island. The location of Genesis.\\n\\n\r\nA lot of these details helped to explain his current character. His wife imparted on him a love of old objects (which partly explains the muscle cars), and her death instilled in him a deep hatred for anything related to Coils (which also partly explains the muscle cars). His membership with the so-called Beasts of Grendel provided a foundation for his uncanny physical abilities. And learning the truth behind why his memories were disjointed in the first place allows him to understand his own origins.\\n\\n\r\nHe believed that he failed his comrades and, more importantly, his wife. But who he truly failed was himself. He blamed the Coils for his losses rather than the choices he (and his wife) made, turning him into the angered man afterwards.\\n\\n\r\nIn the end, Kyouma foregoes entirely hating Coils. His use of his signature Coil-based weaponry is evidence enough. But this change is only nice for him. He now views Mira more positively, sure, but, to reiterate, their change does not derive from mutual understanding. It’s a one-sided shift that the anime attempts to make balanced – but it fails.\\n\\n\r\nMira’s character unfortunately gets sidelined by the aforementioned weirdness. The inordinate amount of time spent on less important characters, as well as her relationship with Kyouma going largely unexplored, leaves her in a difficult spot character-wise.\\n\\n\r\nAt the minimum, she has a bit of uniqueness in the Dimension W world. While she is yet another cyborg, her make and conception are shrouded in mystery. Indeed, she is much more reactive and lifelike when compared to other similar cyborgs. Her affable personality, general cuteness, and overall calm demeanor make her an easily likable person.\\n\\n\r\n“Person,” not cyborg. For her major conflict involves a sense of self. She does not fully comprehend her origins – a parallel to Kyouma, one that gets surprisingly tied back with the revelation that her own body is in fact Kyouma’s wife’s body. She does not ever want to be reset, losing the relationships and experiences she has made thus far. And the idea of death scares her, for she knows that that means the end.\\n\\n\r\nAgain, though, this conflict is not fleshed out. It comes together through small, singular scenes rather than through a layered approach. Yes, Kyouma stops Mira from sacrificing herself, proving to her and the audience that she is more than just a cyborg. But Mira does not experience so much development as she does a reaffirmation of what her character has symbolized from the beginning.\\n\\n\r\nAfter Kyouma and Mira, the rest of the cast is riddled with issues. Seameyer, the main antagonist, is awful. He appears out of nowhere, his motivations are laughable, and his overt craziness cannot be taken seriously.\\n\\n\r\nLoser (as was briefly mentioned) hardly receives any attention despite how much he is invested in the proceedings, and his own backstory is sloppily put together. Plus, his relationship to his daughter, in contrast to Salva and Lwai’s relationship, does not receive any attention, losing out on an important emotional connection.\\n\\n\r\nAnd many of the cast members are forgotten about once the second half rolls around – such as the kids, the big boss lady, and Albert, Kyouma’s closest friend and fellow Beast of Grendel.\\n\\n\r\nThe cast is, simply put, weirdly handled.\\n\\n\r\nSOUND\\n\\n\r\nArguably, the strongest part of Dimension W is its OP. The techno beat and feel easily fits alongside the technology, electric, and futuristic motifs. And the different tonal sections add variety without coming off as out of place. Admittedly, the English lyrics can be silly to hear (“Low resistance of high zest inner cells”), but the song is still a welcome addition to the anime.\\n\\n\r\nThe ED does not reach the same heights. While the start of it is cool with its guitar work, and the ending is nice with its vocal work, the middle stretch of the piece leaves much to be desired as it somewhat strolls along despite the band’s loud interjection.\\n\\n\r\nAs for the rest of the original soundtrack, it has a surprising number of interesting tracks. “Osoikuru-Mizukaranoteki” intertwines orchestra with acoustic guitar and castanets. “Yappariwakaranai” slows everything down with slick harmonica playing. “Kanashiki-Kioku,” with its choir and organ, invites a sense of foreboding. “Isshokusokuhatsu” builds suspense through clanging and light violins. And “Kesshi-no-Tatakai” goes grandiose to coincide with the later, larger scale.\\n\\n\r\nThese tracks from the OST are not stellar, and, indeed, many of the pieces are rather average. But the they do at least have some care put into them.\\n\\n\r\nFinally, only a couple of shout-outs are deserved in terms of voice acting performances. Reina Ueda as Mira adds cuteness, personality, and life to the robotic girl, and Daisuke Ono as Kyouma proves his veteran status with a manly and peeved voice for the disgruntled main protagonist.\\n\\n\r\nENJOYMENT\\n\\n\r\nWithout a doubt, Mira was a lot of fun. In this world filled with angry dudes and potential death, I could count on Mira to make me smile. Her pouting when Kyouma was being mean, her kindness in dealing with others, and her happy face while holding hard-earned money had me grinning and laughing. Usually both.\\n\\n\r\nMira’s antics with Kyouma were fun, too. Kyouma closing the bathroom door on Mira and Mira freaking out when Kyouma approached her from behind after she read all of those scary books were silly moments. I especially liked the rock-moving bit. Kyouma was having extreme difficulty moving even one rock, but Mira was tossing them aside like pebbles. I just wish there had been more of these moments.\\n\\n\r\nI also liked Albert. More specifically, I liked the relationship he shared with Kyouma. Albert was technically Kyouma’s enemy, but they were friends. It gave their dynamic a sense of camaraderie. That they understood each other’s positions and treated each other with respect. Similar to Kyouma and Mira, however, I wish that Albert had more scenes with his friend.\\n\\n\r\nEverything else, however, was not the most engaging for me. A lot of the action was either too over the top or lacking in coolness. The various dramatic bits, like Kyouma’s wife’s death or Loser’s death, didn’t get to me emotionally. And the other characters and plotlines were simply uninteresting. I was simply not entertained.\\n\\n\r\nDimension W gets lost amidst space and time. The story’s construction introduces a lot of problems, the characters are given odd levels of importance, and the art does not usually impress. Basically, the show’s batteries didn’t last.\\n\\n\r\nSUMMARY\\n\\n\r\nStory: Bad, the first half sets the stage only for the second half to trip all over it\\n\\n\r\nAnimation: Fine, okay artistic direction, about average actual animation, and nice character designs\\n\\n\r\nCharacters: Terrible, from Kyouma to Mira, the cast have a hard time remaining relevant let alone being worthwhile\\n\\n\r\nSound: Fine, good OP, bad ED, okay OST, and okay VA performances\\n\\n\r\nEnjoyment: Bad, Mira and Albert were fun, but the majority of the show was not\\n\\n\r\nFinal Score: 3/10",
            "date": "2017-06-04T12:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 249270,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3666117.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 3,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/BanjoTheBear",
                "username": "BanjoTheBear"
            },
            "url": "https://myanimelist.net/reviews.php?id=249270"
        },
        {
            "content": "Although it says I completed it that is a bit of a bold face lie. Well not a lie, just more like I am half way through the last episode since I tried to watch it this morning but I had to go to school halfway through it. But none the less I am doing a review\r\nFor those who don't know I'm Josh and today I'm reviewing the anime known as Dimension W. Let's do this\r\nStory- The setting is interesting. Personally I have never been an end all be all sci-Fi fan but I like the setting. The story on the other hand was...meh. Imean it was original I give it credit there and not he worst story I have ever seen but it just felt...meh to me for some reason. Through the first 5 episodes I liked it but by the second half that is when I found it to be meh. It isn't really a bad story though. I don't know what happens in the end so I couldn't really say anything about that till I fully see it. Overall though I will give it a 6/10\\n\\n\r\nArt- I actually liked the art in this. Pretty good for what it is and I like the character designs to a certain extent. Plus the fight scenes were pretty cool Overall I give this a 7/10\\n\\n\r\nSound- I love the opening to this to death. I will play it over and over again. That is how much I like it. The ending is average for me and the sound track is decent. Overall it gets a 7/10\\n\\n\r\nCharacters- Like the story I did find he characters to be meh. Now granted I do like a couple of them but in the end the character just felt meh to me. Not hat they weren't interesting or anything, I just found them not to be that exciting really. Overall 6/10\\n\\n\r\nEnjoyment- I really enjoyed. It's one of those anime I just can't do anything but find myself enjoying it. Overall 8/10\\n\\n\r\nOverall- Dimension W isn't the greatest, but it is a pretty good anime to watch. I would recommend this to anyone who loves Sci-Fi anime really. Overall the show gets a 7/10 from me",
            "date": "2016-05-26T06:17:00+00:00",
            "helpful_count": 5,
            "mal_id": 219344,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5378004.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/JoshuaJones16",
                "username": "JoshuaJones16"
            },
            "url": "https://myanimelist.net/reviews.php?id=219344"
        }
    ],
    [
        {
            "content": "In a day and age where energy is more or less required to live life, the constant demand forces us to use a lot more to gain very little.  Fossil fuels and and renewable energy both come with their pros and cons and really only serve to create conflict on determining what is the 'best method' for satisfying the world's needs.  Dimension W gives us a little spin on that idea with an anime dedicated to energy, the future, and one kick-ass opening.\r\nStory:  Mabuchi Kyoma is a man that is known as a collector.  In the world he lives in now,all other sources of energy have been exempt from society where they now solely only rely on one new source of energy, Dimension W.  (Roll Credits) Utilizing a technology known as 'coils' these little plugs harvest the energy from Dimension W and use them as clean, efficient energy without all of those nasty emissions and whatnot.  It is here where we have Kyoma working as a mercenary of sorts, beating down anyone who even thinks about using illegally manufactured or black market coils in a world that he despises.\\n\\n\r\nOn the surface, Dimension W seemed like a show that would get into the nitty gritty of the energy that they make and the current state of the company that manages these godforsaken things.  We follow Kyoma's story as he makes his living as a collector, stating quite often that he 'hates' coils and that he refuses to use any sort of coil technology.  In the beginning, the anime showed promise as it provided us with some rather interesting events of coil collecting due to the fact that the coils themselves are hardwired into the Dimension W, which does some pretty fucked up shit if left to go wild.  But only then did the show shift its focus around.\\n\\n\r\nThe primary focus of Dimension W is to focus on the aftereffects of coils and coil usage.  These stories are more or less based around the 'paved with good intentions' motif, as each event had positive effect before going horribly, horribly wrong.  As a result, the series felt rather plotless and was just more or less random events that spanned 1-2 episodes before going to the next one.  And then they decided to do some overarching plot stuff for its conclusion, and that just threw the series down a well.  Now why exactly is that?  Well, for starters, the show inputed a 'main antagonist' to the series, something that it had previously never done before.  Plus, with Kyoma's backstory being rather cliched in its content and presentation, coupled with an end that really felt like there was really no real conflict at the end due to how relatively easy everything was without any repercussions...yeah, this ending wasn't particularly the most well written, especially since the characters only gained shit at the end instead of losing anything.  (I'm all for happy endings, but this show did not seem to be happy for most of its run.)\\n\\n\r\nOne other thing that bothers me is the fact that the show seems to be missing a lot of detail and/or lacking potential.  There were things like the actual 'New Tesla' company that controls the whole coil business that seemed to be interesting, reasons as to why Mira, our main female protagonist, was created, and a whole slew of other potential storylines that just never saw the light of day.  Overall, Dimension W had potential, but just never really utilized it and instead, went a direction that went far beyond what was pre established in the beginning. \\n\\n\r\nOverview:\\n\r\n+  Interesting story concept\\n\r\n+  Storyline tapped into effects of its main story concept\\n\r\n-   Many looses ends left untied\\n\r\n-   Wasted potential on many aspects of the story\\n\r\n-   Main character backstory rather cliched\\n\\n\r\nCharacters:  For the most part, characters in Dimension W are more or less plot related.  Aside from our main two characters, everyone else is more or less shoved into the side cast. \\n\\n\r\nFirst we have Mabuchi Kyoma, the main protagonist of the series.  As a collector, Kyoma makes his living by hunting down illegal coil users in exchange for money, gas, all sorts of things.  As a person who hates coils (and I mean HATES coils), Kyoma's lifestyle is more or less equivalent to the life we live currently, meaning gas cars, battery powered phones, etc.  Kyoma is a character who only sees benefit for himself, and will only get the job done to help himself.  As the series goes along, you get to see his growth as he turns from this stone cold person into this slightly warmer being that isn't always so grumpy all the time.  My biggest issue with Kyoma is how forced his development is.  He changed only due to the plot, and it doesn't seem like the show would've done it any way.  His backstory is more or less an 'amnesia turned back into memory' deal involving romance in the past which doesn't really feel all that unique or interesting.  As a result, we have a character who was only changed due to the plot and really doesn't have any development that he personally does himself.\\n\\n\r\nThen we have Mira, the main female protagonist of the series.  As a robot who uses coils as her power source, Mira is equivalent to that of a human in many aspects, as she is more or less this spunky, childish character who is mostly referred to as 'piece of junk' by Kyoma.  Mira is sort of the mascot character of the series and doesn't really do much aside from aid Kyoma in his progression through the story.  She is his partner out on the field for coil collecting, and only serves to aid in the story's progression and his forced development.  Personally, while I find her to be adorable due to how upbeat she is to counteract Kyoma's constant moping, there really isn't much to her beyond that.  Plus, there's this whole underlying question as to why she was created, but do we get an explanation?  No.\\n\\n\r\nAs mentioned before, everyone else is more or less plot related more than anything.  All of the other characters participate to the plot in some way, either being part of an arc to bring about the major conflict for the episode, or aid Kyoma in giving him and Mira information and/or aid when it comes to dealing with the conflict.  Then there's Seameyer who is that shoehorned villain that comes in the end of the series who...I'll be honest, didn't really have a point to the series aside from being the convenient reason to have Loser and Kyoma hate life.  (Oh yeah, and there's a guy named Loser.  I laughed in spades when I found that out.)\\n\\n\r\nOverview:\\n\r\n+ Somewhat interesting main cast\\n\r\n+ Mira is relatively adorable.  (This is just my personal opinion.  There are those that find her annoying.)\\n\r\n- The cast is more or less dragged along with the plot more than anything\\n\\n\r\nArt:  Produced by Studio 3Hz, Dimension W boasts a rather average style of animation.  To be honest, aside from the good CGI that they use to animate the coils and some other aspects of the show like the robots, cars, and monstrous hellspawns that come from the Dimension W, there really isn't anything remarkable about the artstyle.  \\n\\n\r\nBut you know what?  I have to mention the stupid dancing that happens in the OP by Kyoma.  God that is spectacular.  It's so stupid, and unneeded, but my god that was a good choice by 3Hz.  I wish we got more of that, cause that was great.\\n\\n\r\nOverview:\\n\r\n+  Good mesh of CGI\\n\r\n+/- Good quality, not not spectacular art\\n\\n\r\nSound:  Now, the OST is something I really want to talk about.  Genesis, made by Stereo Dive Foundation is a techno beat music that really resonates with Dimension W.  I personally don't listen to techno or music of this kind, but my god, this shit is addicting.  It adds in a lot of autotune and synthesizers that make the song a hell of a lot more memorable that it would've been otherwise.\\n\\n\r\nThe ED on the other hand is a song that has a more toned down feeling in respective to its OP.  There really isn't anything spectacular about it though.  If anything, it's not really particularly worth its time to listen to, especially when compared to the opening song.\\n\\n\r\nOverview:\\n\r\n+  Good and memorable OP\\n\r\n-   Average ED\\n\\n\r\nPersonal Enjoyment:  When Winter 2016 rolled around, I was told that Dimension W was a series that had a lot of potential.  I was skeptical, but thought to myself that it was interesting enough and different from my usual kind of anime that I would dedicate time to watching it and may even like it in the end.  Well...right now, I'm a bit on the fence in that regard.\\n\\n\r\nDid I like this anime?\\n\\n\r\nIf I had to pick anything I liked, it would have to be just the innate world that we're in when it comes to Dimension W.  A society built around a new form of energy is bound to have a few kinks in the system, and I really wanted to see that.  Plus, I thought that Kyoma was badass initially, and I really wanted to pull off some epic stuff.\\n\\n\r\nWhat didn't I like about this anime?\\n\\n\r\nWell, to be frank, the anime itself.  To get into specifics, its progression.  The series got progressively worse and worse with every episode till is more or less crawled its way to the end.  Anything that it had set up beforehand in the first couple episodes were more or less forgotten, and I didn't really find myself enjoying this series all that much\\n\\n\r\nWould I recommend this anime? \\n\\n\r\nFrankly, this anime is one that I would say it's up to you.  The kind of story it tell is more of a niche sci-fi kind of story more than anything, and it doesn't stick with what it cements down as plot.  As such, I don't personally recommend this show, but honestly, it's up to you in regards to whether or not you want to watch it.",
            "date": "2016-03-27T16:43:00+00:00",
            "helpful_count": 5,
            "mal_id": 214439,
            "reviewer": {
                "episodes_seen": 11,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3086139.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/PyraXadon",
                "username": "PyraXadon"
            },
            "url": "https://myanimelist.net/reviews.php?id=214439"
        },
        {
            "content": "Saw the original series synopsis that AniDB gave and didn't think this anime would be my cup of tea.\r\nI'm so glad I did start watching it, as it's probably one of my current favourites.\r\nThe idea and concept aren't exceptionally new, as Psycho-Pass did touch on the same sort of subject, but the characters and the way the story is presented are top-notch.\r\nThe way the episodes are set-out can be a bit confusing, but it's done in an ingenious way to keep potential viewers gripped. They have a standard episode, then they tease and reveal little snippets of the character's backstories, which are fabulous I mustadd, and this teasing has certainly kept me chomping at the bit.\\n\\n\r\nWho is Loser? What are the memories Kyouma has lost? What happened on Easter Island? Who is Mira really and what are her goals? \\n\\n\r\n--Of course, these have been answered now the series is over--\\n\\n\r\nI really can't wait to see what they do in Season 2 (which I do believe will happen)",
            "date": "2016-04-16T07:38:00+00:00",
            "helpful_count": 5,
            "mal_id": 216488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 9,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/Eleiyas",
                "username": "Eleiyas"
            },
            "url": "https://myanimelist.net/reviews.php?id=216488"
        },
        {
            "content": "This is a surprisingly well done anime in a fairly unusual futuristic setting - which centers around \"coils\" that provide humanity with infinite energy. The world feels cyberpunkish or at least high tech, the protagonist is an adult and not a teen, and characters are fairly well done. The story follows mostly episodic format with over arching plot that ties inidividual episodes together.\r\nStory: 6/10:\r\nThe world is very interesting, appears to be fairly well thought out, and I don't recall anything similar to it in another title. It has cyberpunk-ish feeling to it, as I said, or at least gives impression of technologically advanced futuristic society.The world appear to be fairly well thought out, however, the anime doesn't really go out of its way to explain every single detail about it, and leaves many things open to interpretation, most likely on purpose. Final episode contained a small detail that left me scratching my head and wondering what really happened here.\\n\\n\r\nThe story format is less serious than, say, Ghost in the Shell or Patlabor, and is more similar to \"adventure\" kind of anime with more action in it, and even some mystery segments.\\n\\n\r\nArt: 7/10\\n\r\nArt is very well done, highly detailed and fluid. It didn't leave me speechless, but it is definitely above average visual quality - with well drawn and detailed characters and background, which are also fluidly animated. There are fight scenes, they're done very well. On occasion I spotted some CG being used, but they're incredibly well done, and noticing them is quite difficult.\\n\\n\r\nSound: 6/10:\\n\r\nSound does its job, and is pleasant, but that's about it. Solid voice work from all actors.\\n\\n\r\nCharacters: 7/10:\\n\r\nMost of them aren't deeply explained, and while they're have personality, they ostly exist for story purposes. Male lead is a bit cold/distant and possibly could be portrayed better. However, female lead is amazing/adorable, and watching her is incredibly enjoyable. Likewise her reactions feel more believable than other character's, and she stands out compared to the rest of them. Basically, very well done female lead, and everybody else is okay-ish.\\n\\n\r\nEnjoyment: 7/10:\\n\r\nI liked it but wasn't smitten by it. This anime was a bit of a surprise, because of unusual theme, unusual world, and unusual turn of the story. There were some oddities in last episodes that make them feel like story quality dropped a bit compared to the rest of anime, but maybe it is just me.\\n\\n\r\nOverall: 7/10:\\n\\n\r\nIT is a quality anime that is definitely worth checking out. I did not feel like this is a \"masterpiece level\" title, but it is definitely one of the higher quality ones. IT is worth checking out if you want sci-fi setting, adult protagonist, interesting world, and unusual story.",
            "date": "2018-01-27T14:30:00+00:00",
            "helpful_count": 2,
            "mal_id": 269819,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/GrayRealm",
                "username": "GrayRealm"
            },
            "url": "https://myanimelist.net/reviews.php?id=269819"
        },
        {
            "content": "NOTE: This was originally a post among r/Toonami's Post-Series Analysis as a review there. The original post is linked here.\r\nhttps://www.reddit.com/r/Toonami/comments/4jersz/dimension_w_final_thoughts_thread/\r\nWell this was a quite a letdown.\r\nI mean I liked the first 4 episodes of the series, the inital premise was promising, and I find Kyouma, Mira, and Loser to be fun characters. But I found things went downhill with that 5th episode being so convoluted that I'm still not sure what the fuck happened even with one guy giving me a wall of text explaining to me what happened. \r\nAnd sadly, I felt as if it never really recovered from that episode. It wasn't badenough that I would drop it and/or skip it all the time after that on the block like I did AGK, SAO2, or an average filler episode, but it was still a rather mediocre experience that made me care less and less with each episode that aired and it sometimes went back to making me question what in the flying fuck am I watching. It's ending did little to help me care either and its after credits scene just left me wishing that the series was more like that. At least I liked the OP(What little they played on the block) even if between this and Gangsta, Stereo Drive Foundation does seem to be stuck doing underwhelming shows. \\n\\n\r\nOn the plus side, at least the series is short so it doesn't overstay its welcome and it does somewhat prove that some 12 episode shows can work on Toonami in the future like say My Hero Academia, One Punch Man, Madoka Magica, or maybe even No Game No Life. Sadly, I don't think Dimension W is on the level with those shows.\\n\\n\r\nSo in conclusion, I didn't think it was terrible but I definitely feel like it wasted its potential in what could've been a cool sci-fi anime like Psycho Pass or possibly Darker Than Black. But Oh Well, I still liked it better than Akame Ga Kill(the show Dimension W replaced) though, Just hope the show that replaces Dimension W is better.",
            "date": "2016-07-07T10:33:00+00:00",
            "helpful_count": 4,
            "mal_id": 223396,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5139558.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/UltimateScorpion",
                "username": "UltimateScorpion"
            },
            "url": "https://myanimelist.net/reviews.php?id=223396"
        },
        {
            "content": "Dimension W was an anime I personally was excited for when I was checking the list of winter anime this year. The premise is interesting, the key visual seemed nice and the main character was a badass. What did I get? An interesting premise, nice visuals and a main character who is an ultimate badass. Some things felt lacking such as a convoluted story and rushed pacing. Also some characters end up lacking depth, but some characters do have depth, primarily the lead character. However, Dimension W ended up being a satisfying anime, even though I was hoping a little more from it. \r\n~{Story}~\r\nThe storyof Dimension W takes place in futuristic setting where people have created an unlimited source of energy, called coils, by discovering fourth dimension, Dimension W (which pretty much is the negative plane of X, according to their graphs). Kyouma, our protagonist, is someone who would die but never use coils for a certain reason and he is forced to work with a coiled-powered robot girl (who can use human emotions) to find illegal coils. The premise is indeed interesting. The whole concept around this coils is pretty good. Some of the backstories given, primarily the one for Kyouma, is fantastic. Though there are some problems with this. The execution isn’t as good as I was hoping for. The story is good but it didn’t feel properly presented. At times the narrative felt too messy and too unorganized. It would have been bet to focus on the major characters, rather than introduce too many character and not properly focus on any of them. At times it felt like the anime was losing my attention, even though the story isn’t bad, just unorganized.\\n\r\nStory: 4/10\\n\\n\r\n~{Presentation}~\\n\r\nFirst off, the atmosphere is outstanding in Dimension W. The futuristic setting looks and feels really cool. The style used in the anime is also nice. However there are some inconsistencies in its presentation. At times there will be moments where there’s too much exposition given (such as the concept of Dimension W), while at times, there’s too little exposition given (such as the main villains’ goals). At first, Dimension W stars off episodic (or more preferably arc based) but it slowly transitions to one major story. The transition works really well and feels proper. However, the pacing is an issue in Dimension W. At times, it feels like the anime is moving too fast for its own good. I never get enough time to breathe with these characters, especially in the second half. Everything moves so fast that I have little time to comprehend everything going on, so I end up rewatching those episodes. \\n\r\nPresentation: 4/10\\n\\n\r\n~{Character}~\\n\r\nOne of the best thing about Dimension W is its characters, yet one of its worst points is its characters. Let me explain why. Kyouma, our protagonist, is a badass. He’s super skilled and super likeable. His attitude might be a little too rude, especially to his partner Mira, but it just makes him look even cooler (besides, he’s got his reasons why he acts like that). And his flashback makes him such well-developed character. Then you have Mira, who, for the most time, just feels like she’s there just for the sake of being there. At first I thought there were going to go somewhere with her story with her creator, but it just fell flat and they continued on without her playing a huge role. She seemed like wasted potential. Loser, who is one of the supporting characters in this anime, is very well done. His backstory adds enough depth and easily one of the better characters of the series. The rest of the supporting cast is pretty weak though. There’s a lot of characters in Dimension W and not a lot of them get enough depth. I couldn’t care less about those African characters they introduced in the second half. Also the antagonists are pretty lame too.\\n\r\nCharacter: 5/10\\n\\n\r\n~{Art}~, \\n\r\nOne of the high points of Dimension W is its art style. The futuristic world really looks good. The use of color is also very nice. Something about the art also feels very diverse. You’ll see metropolitan settings, to foggy forests, to futuristic buildings. Dimension W is really good to look at. The art may not be the most detailed art out there, as some objects do have plain textures, the art design totally makes up for it. Also the character designs are top-notch. Something about Kyouma makes him look like a futuristic samurai (I don’t blame that African kid misunderstanding him). His design makes him look like a badass. Also Mira’s design is great too. Loser’s design is also fantastic (and he kind of looks like Zero from Code Geass). \\n\r\nArt: 7/10\\n\\n\r\n~{Animation}~\\n\r\nThe animations are also fantastic in Dimension W. It consistently smooth and fantastic. During the action sequences, smooth animation is present with minimal CGI used. Look at the OP for example, the animations when both Kyouma’s doing action and when he’s dancing (which is fun to look at) is very, very smooth, and similar animation quality can be found in the entire series. The CGI, when present, is sone really well. It never felt too distracting and it merges easily with its hand-drawn compartments. At times, I don’t even notice the CGI when it is used because it’s that good. The action choreography is also excellent. The camera angles used during these scene really makes the scene a lot more enjoyable. \\n\r\nAnimation: 7/10\\n\\n\r\n~{Voice Acting}~\\n\r\nFirst of all, Dimension W has a great cast. You’ve got Ono Daisuke playing as Kyouma and he does a fine job with his role. It may not be the best he’s done, but even if he doesn’t try, he’s talented enough to sound like he’s doing well. Ueda Reina does Mira, and she also does a fine job. Ueda might have given her best here as her voice acting is the one that stands out the most. And then you’ve got Nakamura Yuuichi doing Loser. Again, just like with OnoD, He doesn’t have to do much to sound good as he’s already very talented. Then you’ve got other well-known and talented seiyuu in Dimension W doing supporting roles, such as Ohara Sayaka, Sakaguchi Daisuke, Matsuoka Yoshitsugu, and Ishida Akira, and they all do a fine role. Even though the list of seiyuu is great, it felt like they all could have done something more with their characters since their all very talented. Nevertheless, they all still do a fine job. \\n\r\nVoice Acting: 6/10\\n\\n\r\n~{Music}~\\n\r\nThe music is also pretty good in Dimension W. The OP, “Genesis”, is pretty catchy and nice to listen (although the visuals that go with the OP make the OP much better). The OP does really feel cool. The ED, “Contrast”. The background music used in the anime is also pretty good. It has this funky techno-beat to it and it makes the scenes more enjoyable. The background music adds to the action scenes. Although I was hoping for a little more from the background music, but it’s fine the way it is. \\n\r\nMusic: 5.5/10\\n\\n\r\n~{Enjoyment}~\\n\r\nDimension W is an enjoyable anime to a certain degree. The main character, Kyouma, is enough for me to enjoy this anime really. The atmosphere and setting is also great and the story is also very interesting. The premise is top-notch too. However, due to inconsistent narrative and the plot being unorganized. At times, Dimension W loses my attentions and I feel like I couldn’t care less about what was going, which is a shame because it’s got a good story to tell. Also most of the characters end up lacking character development so it’s hard for me to feel about them. At least Kyouma and Loser get sufficient character development, so I ended up liking those two characters. \\n\r\nEnjoyment: 5/10\\n\\n\r\nIn the end, Dimension W was a fun ride. It’s got a nice premise with a very interesting setting, the main character is very likeable and well developed, the art style is very attractive and the action is really fun due to its great animation. The plot can feel a little messy as times and it can lose your attention, but it has a good story to tell. I was hoping that some of the other characters get just as much development as Kyouma and Loser gets. Still, Dimension W manages to be a fun time, even if it leaves me wanting more.\\n\\n\r\n+ Fantastic futuristic setting with a great premise\\n\r\n+ Kyouma and Loser are very well developed characters \\n\r\n+ Action choreography is great due to great animations\\n\r\n+ Art style is unique and stylish and adds to the atmosphere \\n\r\n- Some characters lack character development and depth\\n\r\n- Plot felt unorganized and messy at times, even if the story is actually good\\n\\n\r\nOverall: 5.4/10",
            "date": "2016-07-02T05:02:00+00:00",
            "helpful_count": 4,
            "mal_id": 222760,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4586872.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/GoldenDevilGamer",
                "username": "GoldenDevilGamer"
            },
            "url": "https://myanimelist.net/reviews.php?id=222760"
        },
        {
            "content": "I'll start off like I usually do for reviews and if I enjoyed it or not. I enjoyed this one.\r\nSo the quick summary is....Our MC Kyoma does not like Coils (Coils are the things taht run all technology in this world) and his job is ironically to hunt down illegal coils. \r\nI'll give a quick snapshot of what Dimension W (power source is) Dimension W is the fourth dimension that is being used as a energy source in this world. New Tesla is the organization that moderates the power. W is very unstable and illegal coils can go haywire and rip apart the fabrics ofreality. \\n\r\nGood! All caught up now I'll actually talk a bit about the story.  \\n\\n\r\nNow for the more in depth stuff that would be spoilerific. I don't do that. But the show itself spends the first 6 episodes with seemingly random missions where Kyoma meets Mira (Robot girl) and they become partners. Everything is told as a mystery not really knowing what is going on as the pieces come together. Kyoma also reveals that he has a bit of a memory lapse due to a mission he went with his group the beasts of Grendel.   \\n\\n\r\nThe last half of the anime is big stuff as everything comes at a rapid fire pace with everything being solved pretty quickly. Everything begins to fall into place as we learn that some characters played a specific role in the huge event that also took Kyoma's memory....Also the main bad guy made me cringe because he looked very similar to someone snakey... that's all I say.(possible spoiler)\\n\\n\r\n Also he shows up we learn about him..and is dealt with in...3 episodes? \\n\\n\r\nThoughts: \\n\r\nI gave it an 7. Dimension W is an anime that builds towards a big pay off in the end. It has a bit of scientific jargon flopping around as they try to make Dimension W sound as real as they could. It's a dimension of possibilities as is the anime. I'm also a sucker for a cute girl like Mira. There's bits of action some blood and even a bit of darker moments. Although the dark moments are quickly defused a little too quickly for my taste. I'll say its a solid anime that will probably be forgotten due to nothing being extremely memorable. But hey it's something to check out.",
            "date": "2016-05-15T18:15:00+00:00",
            "helpful_count": 4,
            "mal_id": 218649,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1273143.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/easilypleased23",
                "username": "easilypleased23"
            },
            "url": "https://myanimelist.net/reviews.php?id=218649"
        },
        {
            "content": "Dimension W\r\nStory 7: Humans discovered a 4th dimension(infinite source of energy).  The new energy was on \"coils\" something man made to hold this power, New Tesla Energy being the leader in this and then soon leading to illegal unofficial coils. \r\nArt 8: It was well made, not movie quality but it was really really well. The art work on Mira was always cute! Kyousma art work was boring compare to all of them, but then again he wasn't a big person for fun. There wasn't any filter art too.\r\nSound 8:  I watched this dubed and I got to say the voice actors aregreat! A lot of great actors are in this anime. Opening song is great and closing song is good, there isn't any tracks that cough my attention during the show. \\n\\n\r\nCharacter 9: I can't say I love/hate all the characters, but for the ones I do I feel like they work perfectly in this anime. Their back stories are amazing too, the reason why Kyousma doesn't like coils and the reason why Loser does what he does, is just great!\\n\\n\r\nEnjoyment 9: I finished this anime on a plane.. I really wanted to keep watching after each episode. Very fun, funny and slight ecchi too!! wish I knew that before I watched it on the plane <_<\\n\\n\r\nOverall 8.2: Great anime, I hope for there to be more titles with the same characters/cast soon..\\n\\n\r\nhttps://www.instagram.com/p/BX86xF_HHvk/?taken-by=geek.workshop\\n\\n\r\nThanks for reading :)\\n\\n",
            "date": "2017-08-18T15:29:00+00:00",
            "helpful_count": 2,
            "mal_id": 255763,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3879361.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/BCxER80",
                "username": "BCxER80"
            },
            "url": "https://myanimelist.net/reviews.php?id=255763"
        },
        {
            "content": "Dimension W was really hyped at the time of its premiere. I will admit, at the beginning, it showed a lot of promise, but I think it made the same mistake a lot of anime make, where they try to make too much happen too fast. A bad enough ending can ruin anything (Madoka Magica Movie 3, Jormungand Perfect Order), but a confusing ending can make a compelling anime seem underwhelming. At the end, too much happened too fast for anything to really sink in. It sucks, because in pretty much all other respects, Dimension W was excellent. It was smart, had good style, andgood action. The ending just didn't work. Compare this to something like Blood Blockade Battlefront. It had a complex ending, sure, but it was told in a much better way, and had good characters to keep the audience invested. That's not really the case with Dimension W. I'm sure that things will become easier to follow in the English Dub, but for now at least it is something good that could have been great.",
            "date": "2016-03-27T16:59:00+00:00",
            "helpful_count": 4,
            "mal_id": 214444,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4565250.jpg",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/NameWithheld",
                "username": "NameWithheld"
            },
            "url": "https://myanimelist.net/reviews.php?id=214444"
        },
        {
            "content": "The premise, main character development, and art style of this series are exceptional, but this anime does have some problems. There are times I feel like the creators make events happen just to move the story forward without bothering to explain how they are possible in the world they created. Furthermore, some of the supporting character's backstories aren't developed at all leaving the viewer wondering about them, while other supporting character's personalities feel inconsistent and contradictory. Most of the problems I have with the show I feel like could of been fixed if they expanded the series to 24 episodes rather than 12 and incorporatedmore material from the manga instead of trying to fit so much into what we were given. Some of these issues can still be addressed in later seasons, but they don't have the material to make those seasons at the moment, so I have to rate this series based on what is here right now. \\n\\n\\n\r\nThe thing that disappoints me the most about this anime is that I believe it has the necessary building blocks to be a 8 or 9 star series. The show’s premise is pretty unique, complex, and interesting once you wrap your head around it. Character development of Kyouma and Mira is well done with them having one of the best rapports I’ve seen between partners in an anime series. Its art style is beautiful and seemed to capture my attention drawing me into the anime while also portraying a fantasy world in a believable way that actually made it seem like it could be a possible future for us to live in. \\n\\n\r\nIn the end, I personally enjoyed it more than my rating suggests and I would probably rewatch it before most of the other shows I would rank above it. However, I can poke more holes in this anime than any other I can think of and that really bugs me, so my rating reflects that since I have to consdier the anime as a whole rather than just its parts. I do suggest whoever reads this though to watch the show especially if you are interested in the synopsis, but I recommend not thinking about it too much after you've finished the series. My initial impression of the title was a lot higher until I started analyzing it and realized how many questions the show left unanswered.",
            "date": "2017-07-15T10:05:00+00:00",
            "helpful_count": 2,
            "mal_id": 252924,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6387421.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 0,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/AndroidRoberts",
                "username": "AndroidRoberts"
            },
            "url": "https://myanimelist.net/reviews.php?id=252924"
        },
        {
            "content": "What started off as promising poorly delivers near the end. \r\nImagine a world where mankind, through use of cutting edge technology, has access to unlimited electrical energy. Sounds interesting, right? \r\nHow would such devices work?  How would it affect the worlds economy? What would happen if something goes wrong with a device?\r\nAll these questions and more will be touched on and never brought up again! \r\nInstead the story focuses on how the devices use memories and the past or something to that nature. Taking what could have been an interesting concept, where the main characters ideals are somewhat understandable, and tossing it out thewindow.\\n\\n\r\nThree characters have interesting designs, that being the lead characters and another that is introduced in the second episode, but the rest are easily forgettable.",
            "date": "2016-03-27T16:20:00+00:00",
            "helpful_count": 3,
            "mal_id": 214437,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3608513.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/SuperPowerless",
                "username": "SuperPowerless"
            },
            "url": "https://myanimelist.net/reviews.php?id=214437"
        },
        {
            "content": "The premise was promising and had a lot of potential but they didn't capitalise on it. Frankly I don't blame them because it was doomed from the start. What was we expecting from a 12-episode season? That is way too short for such a complex concept. This is a shame because the studio actually did a good job with the task given to them. It felt rushed at times but it was still coherent although the concept of Dimension W was glazed over too much making it difficult to follow. I would actually say they left too much explaining until the end. I would havepreferred the info dump at the start so I could keep in the loop throughout the series. Now for the other elements of the show..\\n\\n\r\nCharacter development - 3/5\\n\r\nIt wasn't bad, the relationship dynamic started off sterile between the main characters then built up nicely towards the end of the season.\\n\\n\r\nAnimation - 3/5\\n\r\nDecent but nothing to write home about. The fight scenes were not thrilling for what they could have been. In the penultimate episode they actually skipped to the end of a key battle which disappointed me a lot.\\n\\n\r\nStory - 3/5\\n\r\nI considered a higher rating purely for originality and potential because everything was set up to be an interesting story but the final reveals were underwhelming. A lot of people will be divided over the conclusion of this season for sure.\\n\\n\r\nThe time constraints of such a short series impacted the final product. I got nothing out of it but mild entertainment and a good soundtrack.",
            "date": "2016-05-02T02:04:00+00:00",
            "helpful_count": 3,
            "mal_id": 217679,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5172188.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/abovetheveil",
                "username": "abovetheveil"
            },
            "url": "https://myanimelist.net/reviews.php?id=217679"
        },
        {
            "content": "Dimension W\r\nThis show looks very........Twenty-Tens Anime, if that makes sense. As in, too sleek, or too 'cool.' To a point, this is true, but once you decide to really give it a shot, it doesn't let down. It's not as uber-unique as some people have said, but not as horrid as said by others. A solid story, competent characterization, and good work in the art + sound departments makes it worth the ride.\r\n[Story - 7]\r\nOur story follows Kyouma Mabuchi, a soldier turned repo-man in a sci-fi world revolving around a fourth dimension and its energies fueling new advancements on earth. This setting might not beuber original, but it certainly is a memorable one. It was interesting to see even GLIMPSES of the mere politics (New/Neo Tesla’s interal squabbles + beefs with the government), ‘science’/fantasy elements (dimension-hopping, memory exploration), and so on/so forth. You can tell that the writer(s) did try to do as much world-building as they felt they could, and it works. I hope to see more of this expanded upon in a future season.\\n\\n\r\nMoving on from that, however; Pacing’s alright. Nothing too shabby, but the beginning drags a bit until episode 4, which may be a bit too long to really set up the world and dynamics. By then, though, the story picks up a lot and really gets down to the real grit of the show (a hunt for a macguffin that holds a lot of importance for Mabuchi’s background). The finale is perhaps a bit too neat with how it resolves everything + comes about (sudden antagonist reveal), but it’s serviceable and allows for more to be explored potentially.\\n\\n\r\nThematically, this show isn’t too special. It covers typical sci-fi stuff like Are Robots Human? and the ethics of meddling with unknown technologies/energies/whatever. Even with a setting and story as engaging as this show has, it’s still…...meh. I guess it’s fine, but I’m getting tired of these types of things not being extensively explored.\\n\\n\r\n[Art - 6]\\n\\n\r\nThe artwork is pretty solid. Action can be followed pretty easily, and is fairly fluid. Character design is competent in that it’s all individualized, and can convey core traits with ease (i.e. Mabuchi’s gruffness with his happi coat + absence of any tech). The setting artwork is alright; It’s not a Shinkai movie, but it looks nice and is engaging enough.\\n\\n\r\nHowever, this is not a ‘7’ because of one word: fanservice. It…..lurks underneath the show as it goes on, and pops up when you most expect it (but least want it). Truly a devilish fiend, that fanservice.\\n\\n\r\n[Sound - 7]\\n\\n\r\nSoundwork is thankfully devoid of said fanservice, and thus deserves its 7. The music is nothing to really rave about, but it works in being suitable to what’s going on + the general setting and its atmosphere. The OP is a bit too ‘EDM’ for me, but it’s cool; The ED, however, is fairly memorable with how angsty it sounds and reads. \\n\\n\r\nThe SFX + voice-acting are good. Nothing to really say since there’s no stand-out performances save for Yuki Kaji as Sudden Antagonist (god, he has such range……….one minute he’s screaming his head off, the next he’s whimpering) and Daisuke Ono as Mabuchi (this totally didn’t influence me being reminded of Jotaro).\\n\\n\r\n[Character - 6]\\n\\n\r\nCharacterization in this show is interesting, to say the least. Maybe it’s because it’s only one cour, but there’s a lot of build-up that doesn’t quite come to fruition here. Certainly frustrating, but this is ultimately mitigated by how well said build-up was done.\\n\\n\r\nMabuchi’s a rather tragic man, honestly. Between what happened on Easter Island (watch the show, even if it’s kind of obvious) and losing such a close loved one (even if she looks 14), no wonder he’s so stereotypically stoic. It may certainly grate upon some people, especially in those first few episodes where everything is being established, but it does grow on you over time after you start to learn about why he’s like this. Naturally, he goes under the process of recovering from all of this (or at least the beginnings), and he comes out of it fairly okay.\\n\\n\r\nHowever, his sidekick/partner/robot/surrogate daughter/etc. Mira is a big part of the reason as to why, which means I have to talk about her. I’m gonna be frank: I don’t know how to feel about her. She can be really cute or funny sometimes, but really annoying with how naive she is at other times. Her arc mainly revolves around Pinocchio-style desires, but it never really gets dug into; This results in…...me not really caring about her. \\n\\n\r\nThen we have the foil to Mabuchi: Loser. I can’t talk a lot about this character, since their very identity is core to the mystery of Mabuchi’s past, but all I gotta say is that it’s worth the wait, and is PAINFULLY tragic. \\n\\n\r\nLast, but not least, is our surprise antagonist: Haruka Seameyer. While I enjoy how the character himself is written (genius driven to madness due to failure and all that), I HATE how suddenly he was introduced. No build-up at all in this case, so we’re just kind of…….accepting him at like episode 10. Ridiculous, in my opinion.\\n\\n\r\nThere are a bunch of other characters, but they’re either forgettable or Cool but not cool enough to really warrant a full sentence about them.\\n\\n\r\n[Enjoyment/Overall - 6]\\n\\n\r\nDimension W’s nothing radical, but it manages to escape the scorn of not being radical by just being light fun. I genuinely enjoyed the time I spent on this one, and would recommend this show to anyone looking for cool sci-fi action with decent world-building.\\n",
            "date": "2018-05-13T03:00:00+00:00",
            "helpful_count": 1,
            "mal_id": 280452,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6034124.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/comiclove",
                "username": "comiclove"
            },
            "url": "https://myanimelist.net/reviews.php?id=280452"
        },
        {
            "content": "While thoroughly entertaining all the way through, there is still a bit of something lacking in Dimension W.\r\nThe universe set up here has probably been done before in some way, shape, or form, but this has it's own unique spin. However, I must say the story that we follow goes in-and-out in a sense. The first couple of episodes establishes the story and then throws us into the fray to learn the ropes. Then, the next couple episodes (a two-part story) feel like a story that we'd see sometime later. Then the rest is basically setting up for the big final arc. I think theproblem is there wasn't enough time to get to know the feel of everything before having to up the ante. Since I haven't delved into the manga, I can't say how much of a difference there is between that and the anime (though, I'm certain there's bound to be some changes).\\n\\n\r\nThe main characters are what you would call the odd couple. You have one character that hates modern technology, and the other who is modern technology. These sort of pairing always work because they're polar opposites. Like what I said before about early establishing, although we focus on our two main characters, there's just not a whole lot of chemistry with them. We do, however, get individual developments was the story progresses. Some of the supporting cast appear to be important to the story, but most of them barely show up (a couple, we see in the beginning, but not later on). Again, this could have to do with adapting from the manga.\\n\\n\r\nThe animation is quite impressive on this, especially with the action sequences. I've seen the other works from Studio 3Hz, and the fluid movement of the characters is something they've done before. There's lots of detail with the setting, either showing what's brand new and what's old and rusty (which is one of the themes in the show).\\n\\n\r\nI may be a bit too critical trying to compare the series with the original source material (that I haven't even read yet), and I don't want to say that every adaptation, for the most part, has to stick with what it's based on. Of course, we're talking about a 12 episode adaptation of a story that I'm sure is further explained in the manga. I just felt like there not should've but could've been a better told story. All criticism aside, I still found Dimension W to be a delight.",
            "date": "2016-03-27T22:49:00+00:00",
            "helpful_count": 2,
            "mal_id": 214488,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AllenHavens92",
                "username": "AllenHavens92"
            },
            "url": "https://myanimelist.net/reviews.php?id=214488"
        },
        {
            "content": "Dimension W is one of those few animes that appear every few years. The two protagonists through odd circumstances they end up working together solving crimes. It explores technology and where it can possibly go in the future. The reliance of technology is great with people in this anime. Some reject this new progress. Another interesting thing is the dimension w. It is a mysterious place that unfolds little by little. It leaves you more curiosity as to what its real meaning is. There is plenty of action and science fiction. The animation is pretty and mesmerizing. Anyone interested in science fiction and action oreven mystery, should try this one out.",
            "date": "2017-05-10T20:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 247428,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5002079.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 9,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/Crashdumy16",
                "username": "Crashdumy16"
            },
            "url": "https://myanimelist.net/reviews.php?id=247428"
        },
        {
            "content": "Story: 3\r\nDimension W is a dumb show. Not terrible, it's just dumb. Don't come here for a story that makes sense. If you understand basic maths, then the premise won't excite you. The show never goes into too much depth on anything that happens, it just happens. To enjoy this show you're going to have to get over that. If you take everything as it comes at you, this show will be mildly enjoyable. Don't come here for a fascinating Sci-Fi series, it's a dumb action show.\r\nCharacters: 6\r\nAs stated previously, this show is enjoyable at times. The action scenes, while not ever being very tense,are nice to look at. There's no tension due to our super badass protaagonist, Kyouma. I like Kyouma a lot. He's not a teenage hero like a lot of anime and he looks like god damn Wolverine fused with a samurai. His character design is well chosen and he is funny to watch. Kyouma is an asshole and he ain't afraid to hide it. His reactions to a lot of things are amusing, especially one particular scene. The lead female does a whole outfit change and asks if she looks cute. While watcing this scene I rolled my eyes and sighed. Kyouma felt the same way; he just walked off. It was hilarious. Point being, Kyouma is a fun character and he never annoyed me. The lead female, Mira, is kinda just there. She only helps out or serves a purpose on rare occasions. Most of the time, she's just there. I never found her to be very attractive, which the show was insistent on changing. The creator obviously thought she was sexy as hell, because she is shoved down your throat. The show is like:\"Hey look! She has an ass! She has tits too! She can be moe if you want!!\". Mira feels kind of useless and I never really cared for her or felt worried when she was in danger. As for all the other characters, there's not much to talk about. No characters stand out and the villain is kind of shoehorned in at the last second. The character of Loser is mildly interesting, but nothing more. Kyouma was my saving grace in terms of characters.\\n\r\nSound: 5\\n\r\nNothing about the show's soundtrack ever stood out, it's just techno music and some other forgettable tracks for the most part. The opening is the only piece of music of note. The opening was a blast and I looked forward to it every time I started out a new episode. Much like the show itself, it's dumb but looks nice. The animation is flashy and shows Kyouma doing what he does best, being a badass. He dances as well in it for some reason. It's hilarious. The song is catchy too. The opening is definitely worth a listen if only for a laugh. \\n\r\nArt: 4\\n\r\nThe animation is very flashy at points during the fight scenes. But like I stated before, there's no sense of tension. Kyouma is never really under any threat due to him being so strong. This kills any tension the show might have built up. A close shave where Kyouma could've died when fighting Loser would have helped a lot. Apart from those moments of flashy animation, the show isn't up to much in regards to its visuals. The character designs are bland except for Kyouma and the backgrounds look very dodgy at times. The show isn't afraid to use CGI either, so if you hate CG stay away. \\n\r\nEnjoyment: 7\\n\r\nSo with all these criticisms, you must be wondering why I gave enjoyment a 7. At first, I was pissed off at the show. I thought it was dumb. I wasn't wrong, but I just decided to sit back and take all the dumb shit. To be honest, I had fun. The opening was great, Kyouma was awesome and the fights were cool to look at. If you come here expecting any more, you'll be sorely disappointed. Despite my enjoyment, I can't hide its flaws. It's a flawed show. But at least the opening is hilarious.\\n\r\nOverall: 6\\n",
            "date": "2016-08-18T14:09:00+00:00",
            "helpful_count": 1,
            "mal_id": 227063,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4857310.jpg",
                "scores": {
                    "animation": 4,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 5,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/eogo",
                "username": "eogo"
            },
            "url": "https://myanimelist.net/reviews.php?id=227063"
        }
    ]
]