[
    [
        {
            "content": "The Morose Mononokean is certainly a hidden gem from this Summer 2016 season as I unfortunately made the mistake of overlooking it. If you’re a comedy fan, then this show would be a treat for you with its crude humour and running gags that are recurring throughout. Although, it did turn less comedic in the later half when things take a more serious turn to them.\r\nYoukai, youkai, and even more youkai. These supernatural creatures are often viewed in a negative light in the anime medium, when numerous shows are based on the fact of exterminating them before they cause harm to us humans. Ashiya Hanae,the main character gets possessed by a fuzzy and white youkai on his way to his high school’s opening ceremony. This youkai is persistent on not leaving his side as its clings for dear life on his body, which in turn affects his mental state causing him to have severe depression as a result. This illness of sorts has left him recuperating in the nurse’s office, hence fellow students giving him the nickname of ‘Ashiya of the Nurse’s office’. He later seeks help through a notice board which leads him to his first meeting with Abeno Haruitsuki, who is more commonly known as the Master of the Mononokean.\\n\\n\r\nThe Mononokean is strangely a very large youkai in the form of a traditional Japanese tea ceremony room. The interior is fitted with all the tatami mats and other furniture making it look genuinely authentic. The best part for me personally is how the Mononokean communicates to its master and other guests, through the use of a wall scroll that hangs vertically on the wall. The Mononokean isn’t just some regular youkai guaranteed to give an answer every time but rather offers guidance to the inexperienced Hanae, who isn’t well versed with the world of youkais when he gets hired. The youkais mainly reside in the ‘Underworld’ which does not resemble anything like Hell or Purgatory for that matter. Although some youkai are prevented from returning to their homeland, as they have lingering regrets from their time in the ‘Mundane World’. The process of youkai being transferred to the Underworld is called exorcism which makes sense as they are getting rid of them from the Mundane world.\\n\\n\r\nThe series for the majority does follow an episodic structure as each episode involves dealing with a youkai (in the Mundane) with its unique set of problems. The show is paced very nicely to give us a brief but sufficient background on each client that arrives in the Mononokean. However, I am more intrigued in the events of the Underworld when part-timer Hanae makes his first visit alongside Haruitsuki to get some medicine. The Underworld is a place that is run by three powerful individuals called the Legislator, Justice and the Executive. The Legislator is the only person who makes an appearance, as he is technically the superior for Haruitsuki who was granted his title by that authoritative figure. The Legislator is very much interested in small talk and is keen to be informed on all matters regarding the Mononokean. The series being one-cour means there isn’t enough time for extra details to be explored, which is a disappointment as I’ll have to read the manga afterwards.\\n\\n\r\nThe series benefits from having a small cast of main characters and supporting cast. Hanae as an individual will not let supernatural entities ruin his day by being determined to make his way to school, despite all the difficulties imposed on him. He is also coerced into helping Haruitsuki as his understudy due to the fact that he was saved by him in the first place. The outstanding bill is used as a threat against Hanae but he does not let that dissuade him from doing youkai work. Hanae is a very unselfish individual who prioritises the needs of others over himself, evident in the fact that he cures people out of thin air… the man is Jesus I tell you!\\n\\n\r\nHaruitsuki is more of a stern individual who is not forgiving of blunders and other mistakes by Hanae, the man is a secret perfectionist I tell you. The title of being Master of the Mononokean has its own responsibilities and duties which are compulsory for him. The title makes him a revered and feared individual in the Underworld making him a celebrity of sorts, I wouldn’t mess with him at all costs. Haruitsuki in the Mundane world is an uneventful individual because the majority of time he is seen sleeping in class right behind Hanae. This is not the case across the barriers where he has plenty of associates and acquaintances who you could perhaps call friends. At the end of the day he is solely focused on his job to the best of his abilities.\\n\\n\r\nThe show does lack interesting characters as all you’ve got left afterwards are Zenko, fuzzball and Yahiko the mischievous fox. Zenko makes her appearance in her plea for help regarding her father’s condition laughing condition, who then makes frequent cameos alongside the main duo. Fuzzball is the youkai possessing Hanae from the start and is known to be quite the loyal friend, making him resemble a strong dog as the creature is reliable. Yahiko is known to be a childhood friend of Haruitsuki’s which is reflected in his behaviour of constantly wanting to be play all the time, as a result of nostalgia I guess. There are other characters as well but mostly everyone barring clients is there for comedic purposes.\\n\\n\r\nThe art style is very generic to begin with as it is a carbon copy of the manga’s character designs. The backgrounds used in the anime are very plain but is not the main focal point of the show. The lack of detail for both aspects may be down to budget as its barely average when compared to other series. However, the colour palette is wonderful to say the least, as it can be bright and vivid during cheerful times but dark and sombre during more downbeat scenes. The animation truth be told is not spectacular and once again is making the cut-off to what is acceptable. CGI animation is used to depict some of the youkai which can be very jarring to look at and looks misplaced at times which can be unsettling. This is probably the worst aspect of this show personally as even fuzzball is given the treatment despite being a miniscule thing in size.\\n\\n\r\nThe sound what can I say, has some exceptional voice actors for its main roles. We have the great Yuki Kaji voicing Hanae which to me is a treat every time, using his experience to play his character adequately. We also have Tomoaki Maeno giving us an exemplary job for voicing Haruitsuki which to me is a perfect match as it complements his demeanour. The best thing about this seiyuu duo is the fact they pulled off the ending for this show called Tobira no Mukou, which is another highlight. The background sound composition and OST by Morishita Hiroto wasn’t extraordinary but did not really have any memorable tracks that are worth mentioning.\\n\\n\r\nTo summarise, this is a nicely balanced show with a strong main duo combined with great comedy and the supernatural. You won’t be let down, I assure you.\\n",
            "date": "2016-09-25T01:30:00+00:00",
            "helpful_count": 51,
            "mal_id": 230119,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3858899.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/FireEmblemIke24",
                "username": "FireEmblemIke24"
            },
            "url": "https://myanimelist.net/reviews.php?id=230119"
        },
        {
            "content": "This anime left a good impression on me. It was funny, adorable and even had a couple of feels here and there. While there were many ups about this show, there was a reason for me to only give it a 7 overall, which was mainly the story.\r\n[MAY CONTAIN SPOILERS]\r\nThe story was not bad, but it definitely wasn't the best it could have been in my opinion. There wasn't a lot of plot, and it mainly only focused on the exorcism of Yokai, and Ashiya trying to regain his vision. However through story, lovely friendships were made and most of the Yokai were interesting andcute.\\n\\n\r\nI loved the art style in this one, especially when the main characters travel to the underworld. The colours were bright and appealing to the eye, it was a big plus for this show.\\n\\n\r\nThe soundtrack was lovely to listen to, consisting of harps and traditional Japanese music here and there. The OP and ED were catchy, and matched well with the show, and had me singing along with them.\\n\\n\r\nI loved each character, both human and Yokai, they gave me a lot of joy while I watched this show.\\n\\n\r\nThis anime was very heartwarming, and left me happy after each episode. I would recommend it if you're looking for a show that makes you feel warm and fuzzy.... Speaking of Fuzzy, I want one now!",
            "date": "2016-09-25T23:24:00+00:00",
            "helpful_count": 21,
            "mal_id": 230258,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106195.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chibi-Fukuro",
                "username": "Chibi-Fukuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=230258"
        },
        {
            "content": "Hey folks, this will be a review for Fukigen na Mononokean. This show was like a poor love child of Noragami and Hoozuki no Reitetsu. I don't much recommend this show, unless you seen the other two and have an itch for a bit more.\r\nThe story revolves around a highschool boy, who on just before his first day of high school manages to get possessed by a youkai(more like infected by one). The youkai causes him distress and he tries to get it exercised. While this happens he learns of the youkai and about this world that he was before, unable to see. This exorcismthough costs a small fortune and he is forced to take on work with the exorcist to pay off his debt.\\n\\n\r\nMuch of the rest of the show follows the \"walled off heart and uninhibited new person who through their actions heals the walled off heart character\" trope. Most of the show is episodic. Situations arise, new guy does stupid new guy thing that we all learn lessons from, rinse and repeat. Aside from this there seemed to be an underlying plot of Abeno, Haruitsuki's (walled off heart guy), oddly enough there is no closure on this subject. Instead we get some silly drama surrounding Ashiya, Hanae(new person).\\n\\n\r\nThe art was nice, bright and colorful.\\n\\n\r\nThe characters were annoying. Well, the two main characters were. Ashiya, Hanae is overly emotional and quick to words that he cant really back up. Often early on relying on blind luck that Abeno is capable of doing some version of what he promises the youkai. Abeno is the opposite, he has little emotion and shows no interest in anyone but the youkai. They had to make these two characters so polarizing to make the underlying story work, but its crap and cheap. Instead of real character development we have to see two sides of an annoying coin bicker until Ashiya just does whatever the hell he wants.\\n\\n\r\nThe other characters were alright. Mostly they stayed in the background. Fujiwara, Zenko had a cool personality and I would have liked to see more of her but not much can be said about anyone else. \\n\\n\r\nI didn't really enjoy the show that much. I absolutely loathed the show until about episode 5. A handful of episodes after that were decent but again its just a poorer version of two decent shows. Also this is not funny, shouldn't be labeled as a comedy. If your interested in the life of yaoki and want some comedy, you should check out Hoozuki no Reitetsu. If your interested in some semi dramatic and life changing relationship dynamics with some gods and demons and such then check out Noragami. All in all I would pass this one up. Its not unbearable, its just mediocre with enough missed potential and annoying characters its not worth the time.\\n\\n",
            "date": "2016-09-23T19:12:00+00:00",
            "helpful_count": 19,
            "mal_id": 229947,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=229947"
        },
        {
            "content": "That's a first : an anime that lacks so much confidence in its setting that it tries to lure you with yaoi bait. Which was absolutely meaningless (and useless, considering I'm pretty sure most people interested were more attracted by the youkai in the first place). \r\nThe thing is, this anime is quite enjoyable without it, so I can't get my head around the reasons (I mean reasons other than to satisfy excitable teenagers) that push the author to use yaoi as an audience trap.\r\nStill, maybe that's all it was, and it's not preventing this anime to be an easy recommandation to anyone that justdon't care, because this anime will found its public from people who wants to learn more about the curious nature of yokai, humans and friendship, all in a soft pace. \\n\r\nStory 7/10 : Clearly not the strongest point, unless we get a 2nd season. For now, the story looks like a work in progress, a stage setting for the events to come. It's a pity because there is a lot of potential, but as it is, unexploited.\\n\r\nArt 7/10 : easy on the eye. And that's it. No originality there (not that it was necessary in the first place).\\n\r\nSound 8/10 : there is some unexpected good work there. It's not really absolutely memorable, but somewhat \"carefully craft\", attentive to the details of the scene you're watching. Never off rhythm, never useless.\\n\r\nCharacter 6/10 : Here's the weakest point. Again, a work in progress issue : the anime was just not given enough time to grant the characters anything more than typical and boring traits.\\n\r\nEnjoyment 8/10 : I think people who usually love anime like Mushishi or Natsume will enjoy this one too. Certainly not as much, but still, the approach feels the same.\\n\\n\r\nSo, that's a nice anime to watch, easy to follow, easy on the mind, but here's something strange about it : if this anime get stuck here and don't get a sequel, then it's almost useless to know it exists. I don't think you're gonna lose something watching it, but if it stays as it is, you will not getting much from it either...",
            "date": "2017-01-18T01:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 238562,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477056.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mushimk",
                "username": "mushimk"
            },
            "url": "https://myanimelist.net/reviews.php?id=238562"
        },
        {
            "content": "It really boils down to whether you like the 2 main characters. If you like them, you'll like this anime. If you hate them, there's literally no point for you to watch it. The story, at this point, is kinda plain, not boring but not very interesting either. So I'd suggest that if by watching the first 3 episodes, the only impression you get from the 2 main characters is annoying, then you can safely drop it.\r\nMe personally, I found them loveable. I loved their personality and their looks. I could relate to Ashiya's & Abeno's tsundere-friendship too. And overall all characters were loveable, itreminded me of the atmosphere of Shirokuma Cafe. Character score: 9/10\\n\\n\r\nJokes: The jokes were pretty funny. I remember laughing literally out loud quite a few times. But at times it felt as though the writer tried too hard. Joke score (i.e. my enjoyment score, since the jokes were the element that I enjoyed most about this show): 8/10\\n\\n\r\nStory: I, as someone who believes in the concept of Jinn, found it entertaining to learn Japanese commoner's take on the unseen creatures. But I can admit that I didn't keep watching the show for its story. As most reviewers said, \"story\" is just simply not the strong point of this anime, at least for now. [Minor spoiler alert] But at times you'll notice that there's actually some depth to the story than it appears to be atm, like in the first episode, when Ashiya introduced himself to Abeno as \"Ashiya\", Abeno goes, \"Ashiya? Ok, I've changed my mind now\", and at later episode, the Legislator talks about how one of the reasons why Abeno hired Ashiya was because he was interested in Ashiya's first name, that that first name means something to Abeno. Nonetheless, the story score as of 1st season is: 5/10\\n\\n\r\nArt: I don't have much to say other than that the characters and the animation could look slightly better in some scenes. That doesn't mean it was awful, though. Art score: 7/10\\n\\n\r\nSound (Voice Actors-wise): The Japenese VAs did a really great job. The acting was superb. Sound score (VA): 10/10\\n\\n\r\nSound (OST/BGM/SFX-wise): The OP & the ED were decent. The BGM & the SFX were perfect. Sound score (OST/BGM/SFX): 8/10\\n\\n\r\nOverall: 7/10... It was good. I can rewatch it if I'm too bored and don't know what else to watch.",
            "date": "2019-02-15T03:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 301698,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7667665.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pispis",
                "username": "pispis"
            },
            "url": "https://myanimelist.net/reviews.php?id=301698"
        },
        {
            "content": "This is such a common anime. Seriously. But, why did I feel my heart beating so fast for him? So, at first, I have to admit that I fell in love at first sight for Fukigen na Mononokean. Just on the first episode I already felt so good watching, a feeling that I rarely have. It gives such enjoyment and leaves you absolutely absorbed on every episode.\r\nThe plot is very simple and very understandable: tells the story about a yokai exorcist, Abeno, and his employed, Hanae. And the story's development is so natural, since the change of sceneries until the new's characters entrance.\r\nThe art issoooooooooo beautiful. The sceneries itself are simples, but when it comes to the subworld... Ahh! Such an aesthetic should deserve an award.\\n\\n\r\nSo, overall, I felt very into this anime, the simplicity here is everything and makes you fall in love. Just.",
            "date": "2019-01-02T05:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 297794,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6067005.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mellllll",
                "username": "mellllll"
            },
            "url": "https://myanimelist.net/reviews.php?id=297794"
        },
        {
            "content": "*Just because I rated this a 6 does not mean this anime is not worth watching*\r\n\"The faith in the promise we made, gave him the strength to move on.\"\r\nThis story is pretty basic. I do not feel like there is too much to it. Which is not necessarily a bad thing. \r\nThe art is nice. I just personally am not a fan of different graphics used together in one anime. So you Kind of get the typical cartoony look but then you have the yokai which will be more computerized at times. \r\nThe sound was basic. Nothing out of the ordinary in my opinion.\r\nYou didn'tget a huge variation of characters like you would in some other anime. But I did feel a connection to the overly emotional character. \\n\\n\r\nI enjoyed this anime a lot still because I could relate to the feelings and emotions that were portrayed in the story line. For me, that is more than enough.",
            "date": "2018-09-24T18:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 289911,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6390396.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aubreyaylaine",
                "username": "aubreyaylaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=289911"
        },
        {
            "content": "I dropped this anime 8 and a half episodes into the story because its failure at storytelling/character development made it very hard to enjoy.\r\nPros: it's pretty and kind of cute, especially if you happen to be into demonic furballs.\r\nCons: it's the anime equivalent of oatmeal. Very bland, but pretty oatmeal.\r\nThe strongest points of this anime are the visual and audio aspects; the backgrounds are pretty, the animation is enjoyable to watch, and the character designs make the characters easily recognizable and memorable. \r\nThe weakest points are pretty much everything else. The protagonist is incredibly boring; a typical highschool kid who stumbles upon the supernatural andis sucked into a whole second life of magic and whatnot. Abeno is his tsundere master, serving as a guide to said supernatural world. Combined with the demonic furball that gets attached to them both, they're pretty much the only characters that get any development at all; there's a girl, and a fox, and about a thousand random yokai that appear once and never really feature again. The story is episodic, with each episode focused primarily on helping a single yokai with their problems (that you will probably find you couldn't care less about) and then learning something profound from this experience. \\n\\n\r\nThe thing that irked me the most about this anime is the very forced drama. The emotions it tries to evoke simply have no basis in the story--the protagonists say they're scared, or worried, but nothing in the story makes you feel like it's an appropriate reaction. The yokai are very cute and not at all threatening; the main character's exaggerated fear of them does not feel authentic or relatable. The main character's reactions don't seem consistent, either; he vacillates between strange conviction that makes him disobey Abeno to do random dumb things that somehow work out fine, and being apologetic to literally everyone immediately after. At points you get the feeling that you're supposed to be sad for the characters, but none of them are relatable or developed enough to justify this feeling. \\n\\n\r\nOverall, I wouldn't exactly discourage someone from watching this. It has its merits, and would probably serve as a good anime for a child or someone looking for a really simple story with minimal sadness. That said, I personally probably won't be finishing it anytime soon.",
            "date": "2018-09-11T09:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 288748,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7399528.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/okyuu",
                "username": "okyuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=288748"
        },
        {
            "content": "To be honest this anime  is probably intended for a very young audience . It gets extremely boring and has really no purpose. There isn't even very much material to discuss. It can be described as a very good anime for young children. There are generic morals to be learnt, cute \"animal sidekick\", appealing art, and interesting concept. Overall it just isn't very enjoyable for older individuals. \r\nThe one thing that this anime has is quality art. The characters are generic and not remotely interesting. (DON'T BE FOOLED THERE IS NO YAOI.) The humour is non-existent, the plot is nonexistent. The soundtrack can bedescribed as nice but nondescript. \\n\\n",
            "date": "2016-12-20T18:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 235960,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450307.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/wwtianyou",
                "username": "wwtianyou"
            },
            "url": "https://myanimelist.net/reviews.php?id=235960"
        },
        {
            "content": "I never thought I'd like this show as much as I did…at first it seems really mediocre but as it goes on, it's a very comedic and beautiful anime. It's a bit of a fujo-bait series for a shounen (coming from a fujoshi herself), but it doesn't stop you from enjoying it.\r\nThere's no real plot, instead there's just that episode to episode flow (mostly) and it gives a laid-back sort of slice-of-life feeling. Perfect for watching when you're bored or feeling melancholy, it picks you up a little. They way the human-yokai relationship thing is explained through the trials also gives it a nice feeling.\r\nTheart and the music are gorgeous and near perfectly suit the traditional Japanese theme. The art is very clear and colorful while the music is easy on the ears and nicely done. The theme songs- at first I thought \"eh, standard\" when I first heard them but they grew on me eventually =v= The vocalist from the op has a very (very) nice voice and although I don't like cv songs so much, the ed between the main cv's is actually pretty good –u–)/ \\n\r\nThe characters aren't out of the ordinary or anything but they're quite enjoyable.\\n\\n\r\nI really enjoyed this show! It made me want a second season, but also with the way it ended it felt like \"mission complete\", or that it's fine the way it is. Some things are left unattended to but not everything needs to be known, right? \\n\\n\r\n~~review no.4 ☆",
            "date": "2016-10-29T14:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 232858,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4014355.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/catcupcakes",
                "username": "catcupcakes"
            },
            "url": "https://myanimelist.net/reviews.php?id=232858"
        },
        {
            "content": "Story:\r\nThe storyline involved humans and youkais, and it is one of my favourite themes. It is especially vivid in portraying the lives and thoughts of youkais, and through the MC we are able to see how they interact with humans. It is mostly funny and heartwarming. The MC is kind and at times reckless, but very loveable. The other MC is like the grouchy uncle who is annoyed but takes care of his nephew anyway. The story does not just talk about bonds between youkais, or youkais and humans, but also between humans as well. The stories are episodic, but sufficient attention is given sothat each character can properly flesh out. \\n\\n\r\nArt:\\n\r\nThe art is good. The characters look cute, art is clean. Most importantly, vivid colours are used so the whole anime gives off a warm and vibrant feeling. I especially like how the Underworld is presented. The art for the underworld is simply amazing - not just the architecture or the colours of the sky, but the detailed portrayal of a youkai community as well. \\n\\n\r\nSound:\\n\r\nI give 10 for the sound. I'm the kind of person who fast forwards OPs and EPs, but pays too much attention on the voice actors. The two MCs are voiced by Maeno Tomoaki and Kaji Yuki, and they did a wonderful job. Their voices are unique and beautiful, and they played out their roles perfectly. Furthermore, Suwabe Junichi was also in the voice cast, and that is simply...wonderful. \\n\\n\r\nCharacter:\\n\r\nMany of shonen animes like to give a sudden change of heart for the characters to push the plot forward, but personally I've always found them forced. Fukigen na mononokean does not have such character development yet. We just see a gradual shift in the personalities of the MCs - from shutting off from humans to accepting that some people can understand even if they can't see, and from not believing in youkais to hating them to understanding them and loving them. I think its believable, it matches the pace of the anime, and can be rounded off with a warm feeling in the chest and many hearty laughs.\\n\\n\r\nEnjoyment:\\n\r\nI finished it in a day, that's how much I enjoyed it. It had nothing heavy, not those plots that require heavy brainpower to process, or so emotional that you just can't stop crying. It is extremely light-hearted, although sometimes it gets a little thought invoking, and just warm and funny.\\n\\n\r\nOverall:\\n\r\nPersonally, I find it better than some of the more popular anime series from 2016. I am surprised so few people actually know about it. I think it deserves more attention. Although it is not a masterpiece, it is an anime that is worth the watch. I'd definitely recommend it.",
            "date": "2017-06-20T09:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 250450,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AdelineKuang",
                "username": "AdelineKuang"
            },
            "url": "https://myanimelist.net/reviews.php?id=250450"
        },
        {
            "content": "\"The Morose Mononokean\"\r\nDON'T WATCH: if you're looking for an action-packed, fast-paced show.\r\nWATCH: if you like natsume yuujinchou, hotarubi no mori e or poco's udon world (in terms of heartwarming elements) or if you enjoy slow, heartwarming storylines.\r\nQuick review \r\nstory: 7.5\r\nart: 8\r\nsound: 8\r\ncharacter: 8\r\nenjoyment: 8\r\nStory- (surprisingly) heartwarming and adorable at times. it follows the 'main characters are involved with youkai and tries to solve problems related to it' storyline. hence, the pacing- a bit slow, but it suits a show like this. the vibe is quite similar to mononoke & natsume yuujinchou. \r\nArt - pretty unique (colour contrast, texture-thingy?) and pleasing to the eyes, a bitof CG, but nothing too unnecessary.the sceneries (especially in the 'underworld') are pretty as well.\\n\\n\r\nSound - the seiyuus, as always did a great job. i like the OP and ED as it gives off a nostalgic (?) feeling. background tracks used are suitable for bringing whatever moods it's supposed to bring\\n\\n\r\nCharacters - the main cast is small, yet their interactions are entertaining to watch. their background and development are also decently explored, considering the episode limit.  \\n",
            "date": "2017-06-02T06:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 249115,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5203002.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lensaamiranda",
                "username": "lensaamiranda"
            },
            "url": "https://myanimelist.net/reviews.php?id=249115"
        },
        {
            "content": "\" May contain light spoilers \" \r\nI feel that this anime is one of those \" you either like it, or you don't \" anime so I would highly recommend giving this one at least 6 eps before you make a judgement whether or not you like the plot or not.\r\nStory: The plot isn't a masterpiece nor was it bad. But what's the plot you ask? well if you expecting some plot twists here and big changes than this isn't what you will be expecting. The show centers around the Comedy, Drama and Supernatural aspect and mostly episodes are about the two guys helping outthe troubled yokai then sending them off to the Underworld when they are content. They will guarantee to play your heart like a instrument the entire time.\\n\\n\r\nIf you looking for answers to mysteries and the unexplained mysteries in Season 1 than your best bet may be to skip this season and go straight to Season 2 Tsuzuki, that's basically when the show moves towards mysteries regarding the two guys and the Underworld. A little darker tone. \\n\\n\r\nArt: Art will always be a preference thing to people, personally I found the art to be really good. It fits the theme of the show, its bright, vibrant but simple. \\n\\n\r\nSound: Not much music, the music fits in moments sure but could appreciate more variety. Voices of characters are good and fit the characters really well. By the way give the English dub a go, it's a surprisingly good but funny experience.\\n\\n\r\nCharacter: Great characters, never would have guessed having a bubbly, naive 5 yr old Ashiya paired so well with Abenos personality ( I don't know how to explain it but i know he's basically annoyed but caring ), its like water and oil but they work together well. The different yokai you meet all have different personalities and backstories; some might be sad, some working hard for the one they love, etc, heck! one of the main yokai you meet is a siscon.\\n\\n\r\nEnjoyment: Mainly the enjoyment comes from either laughing at the drama between Abeno being annoyed to hell with Ashiya acting like a 5yr old. If not for those you will enjoy the yokai stories.\\n\\n\r\nOverall: Its enjoyable but only if you like that kinda anime, it's like watching Natsume but its more focused on comedy. This season sadly does a bad job with explaining some things which starts leaving watchers hanging wondering if its just not important or they just forgot. Like I mentioned before Tsuzuki is when the mysteries start getting explained.\\n\\n\r\nPut everything together and you got yourself a cozy anime to watch after a hard long day from work or studying.",
            "date": "2019-02-10T03:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 301316,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6708506.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Windadepts",
                "username": "Windadepts"
            },
            "url": "https://myanimelist.net/reviews.php?id=301316"
        },
        {
            "content": "I'm not someone who writes reviews, so the fact that I decided to write a review for Fukigen No Mononokean speaks volumes in itself. First, I feel the reviews given to this anime is unfair in itself. And I do understand why. Mostly because people tend to compare it to the already popular supernatural anime around. And if you do that, you will not enjoy this gem of an anime.\r\nI'll keep this short and sweet. If you want to enjoy FNM, you need to throw away all the perceptions and judgement of supernatural anime with demons and gods. This is a different story. There isno character that is weak and fragile and is trying to make a difference or a God who is banished and wants to recreate himself.\\n\\n\r\nThis story is about a boy who assists another and helps the lost demons of this world get back to their homes in another world. It's a fun ride no doubt.\\n\\n\r\nStory: 7\\n\\n\r\nLike I said, this isn't one of those hold-your-breath shounen anime. It's a gentle and sweet ride. There isn't much complications but it is interesting enough to keeping you watching episode after episode due to their \"mysterious\" nature, I guarantee you that.\\n\\n\r\nArt: 8\\n\\n\r\nSimple but beautiful with good animation. The \"other world\" in this anime is nicely draw. Again simple but soothing with a setting that is easy to take in.\\n\\n\r\nSound 8: \\n\\n\r\nThe VA's were amazing. They fit to their characters perfectly. The soundtracks were not the sort that you would listen later and download to your phones but they did the trick of creating the right tone for this anime. The OP was my favorite. It was nothing like Gitnama's or Noragami's opening but more to the lines of Tanaka-kun is always listeless.\\n\\n\r\nCharacter: 9\\n\\n\r\nThis for me was the winning point. There is no character that is weak or useless. The main character is a school boy that discovers a supernatural creature and wants to help it get home and in doing so he meets Abeno, the master of the Mononokean. And the title of the anime fits him perfectly \"the Morose Mononokean\". He is broody and doesn't want to do anything with our MC but gets along with him (like all other characters) throughout the story. And the transition from his I-don't-care to he-is-my-friend is flawless and beautiful. There is no hints of BL like others make out. It's a normal friendship between two high schoolers or in this case a Master Mononokean and his apprentice. \\n\r\nThe side characters that are shown in this anime is also interesting and fun to watch. You will definitely fall for at least one of them. I guarantee. \\n\\n\r\nEnjoyment and Overall: 8\\n\\n\r\nI thoroughly enjoyed this anime to the point where I went and read the manga afterwards. And I definitely would watch the other seasons when they come out withour a doubt. And if you watch it with an open mind you would like it too.",
            "date": "2019-01-18T22:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 299421,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7102529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/otakukunkou",
                "username": "otakukunkou"
            },
            "url": "https://myanimelist.net/reviews.php?id=299421"
        },
        {
            "content": "I love series like Natsume Yujincho, xxxHolic, Mononoke and Hozuki no Reitetsu. I first started watching this series when it originally came but dropped it cause it didn't seem to have much depth to it. I recently decided to give it a second try and to my horror, with each passing episode, I realized that i had in fact already finished the series when it originally came out - it was just SO BLAND I forgot about it completely.\r\nSo, why didn't I like it? \r\nThe characters. \r\n The main character is as 2D as they come and the author has clearly committed one of thebig writing sins of \"everything the character does ends up being correct cause it all ends well in the end\". It's especially frustrating when his mentor, the head of Mononokean has clearly had to suffer for his ability to see yokai and now comes along our main character and everything goes right for him.\\n\r\n When it comes to all the other background characters they're so stereotypical you'll feel like you've seen all of them before in some other shows.\\n\\n\r\nWould I recommend it? \\n\r\nIf you liked series like Natsume Yujincho, xxxHolic and Mononoke but wish for something more lighthearted, more mainstream, something that doesn't deal with any difficult topics in any meaningful way and has less depth story wise, this is the series for you!",
            "date": "2018-11-18T07:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 294293,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6664812.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/caelesc",
                "username": "caelesc"
            },
            "url": "https://myanimelist.net/reviews.php?id=294293"
        },
        {
            "content": "I'll be honest: I mostly started watching this because I'm a complete sucker for BL subtext. And it has that, absolutely. But I really enjoyed this anime for more than that, more than I thought I would.\r\nSo, okay, I'll admit that I'm typically the kind of person who, if the show has great characters with great interactions, then I don't even care if the plot is weak: I'm satisfied. And Fukigen na Mononokean definitely has great characters. Ashiya is the incredibly kindhearted type--with a healthy dose of the airheaded type--passionate about helping others even when he might be scared or might not really know howto help them, and he's intensely loyal to those he befriends. Abeno initially seems rather cold and businesslike, but his interactions with yokai show how considerate and gentle he can be. Their interactions range from hilarious to sweet to quietly emotional and I loved every minute of it. It's always a treat to me to watch two characters learn to trust each other and forge a deeper connection; one of my favorite things is a character being able to predict how the other character will react to things and knowing when that character is feeling off because of how he's acting, and there's definitely a lot of that here. Whether you view their relationship as strictly platonic or heading towards romance, it's a fascinating relationship.\\n\\n\r\nThere's a healthy dose of interesting side characters too, though unfortunately we never spend much time with them. I feel like Zenko--a girl who initially meets Ashiya and Abeno because they come to help her father, but after getting bitten by a yokai and being able to see other yokai, she sort of informally becomes part of their circle--is going to eventually play a bigger role and I hope that's the case!\\n\\n\r\nI will admit that the plot is a little weak. It's a rather episodic structure of Ashiya and Abeno meeting a new yokai in almost every episode and assisting that yokai with a problem. There are hints of deeper stories--how the human Abeno came to be the Master of the Mononokean (a yokai in the form of a tea room that allows him to easily travel between places and gives him the power to move between the mundane world and the Underworld), some secret power Ashiya seems to have, what the heck is up with the three heads of the Underworld (we only meet the Legislator, but there's also the Justice and the Executive). Unfortunately, they are only briefly introduced and we get nothing near resolution on any of these things. But I still really enjoyed the anime, and ultimately I understand that the manga it's based off of is still ongoing and certain things haven't been revealed yet--I just hope this means there will be a season two to keep the story going! (I haven't read the manga yet so I suppose I have that to turn to if a season two never comes, but I really do hope this anime continues. I mean, listening to Kaji Yuki and Maeno Tomoaki is always bliss.)\\n\\n\r\nThe art was nice--nothing extraordinary, but I thought it was pleasing and fitting. (I'm no artist though.) I loved the unique take on the Underworld as a setting; I won't \"spoil\" it, but it's definitely not the kind of Underworld people generally imagine. I wish I could comment coherently on the music because the snatches I caught seemed quite lovely, but unfortunately I don't tend to focus on the music too much while people are speaking. But I do want to download the OST because it certainly seemed promising. I enjoyed the OP, and especially liked the ED featuring Kaji Yuki and Maeno Tomoaki.\\n\\n\r\nIt's a little tortuous because this anime teased at deeper plots without delving into any of them, but it certainly managed to get me hooked! I can only hope we'll see more of Ashiya and Abeno and their hodgepodge of yokai friends in a second season that will start revealing more about this story and these boys.",
            "date": "2016-11-24T21:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 234344,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1399321.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/chelime",
                "username": "chelime"
            },
            "url": "https://myanimelist.net/reviews.php?id=234344"
        },
        {
            "content": "As a fan of yokai/ghost stories, I was happy to see a series the felt with yokai in a more lighthearted fashion, not portraying them as a nuisance or a threat as many other series do. We get to see spirits and humans living in harmony.\r\nThe art is fine, nothing special, but watchable and consistent. The art style is generic, and doesn't stand out, making it look quite boring from the outside. The two protagonists can be unrecognisable in comparison to other, similar looking anime characters.\r\nThe major fault of this series, and that made me almost drop, is it's characters. The main character, Ashiya, isannoying and bland, with nothing to add to the series other than an annoying \"kindness\" - as they call it. He is unbelievably nice and I can't find any reason for it other than plot. I don't understand why anyone would create such a boring protagonist if they want people to be engaged.\\n\\n\r\nThe other protagonist, Abeno, also has a generic, overused personality-type, with a just enough depth to make him slightly more interesting as a character. As I watched the show, I just couldn't understand why he would choose Ashiya as his assistant, which made me dislike him.\\n\\n\r\nOverall, I enjoyed the story of the series, particularly the creative yokai that is introduced. However, the human characters are bland and almost annoying. I felt like watching them, particularly Ashiya is especially tedious. But it's a short series, perfect if you have some time and nothing to watch.",
            "date": "2018-05-15T03:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 280608,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5354775.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/abitofsalmon",
                "username": "abitofsalmon"
            },
            "url": "https://myanimelist.net/reviews.php?id=280608"
        },
        {
            "content": "The story was nice and I enjoyed watching it but there needs to be a season two because there are so many unanswered questioned. here are couple\r\nWhy did Ashiya have that mysterious power in episode 5? When fluffy got hurt by something and in Ashyia something ticked?\r\nWhy is his name Ashyia? It is a Yokai name after all in this anime?\r\nWhere is Ashyia's dad?\r\nWhy did Abeno's master accept him?\r\nOverall why did Ashyia have that power?\r\nIf there ould be a season two, I would like to see them answer all these questions or some of them \r\nBut a very nice anime just needs to answer allthese questions",
            "date": "2018-03-09T16:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 273441,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4127689.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/honeyonatoast",
                "username": "honeyonatoast"
            },
            "url": "https://myanimelist.net/reviews.php?id=273441"
        }
    ],
    [
        {
            "content": "The Morose Mononokean is certainly a hidden gem from this Summer 2016 season as I unfortunately made the mistake of overlooking it. If you’re a comedy fan, then this show would be a treat for you with its crude humour and running gags that are recurring throughout. Although, it did turn less comedic in the later half when things take a more serious turn to them.\r\nYoukai, youkai, and even more youkai. These supernatural creatures are often viewed in a negative light in the anime medium, when numerous shows are based on the fact of exterminating them before they cause harm to us humans. Ashiya Hanae,the main character gets possessed by a fuzzy and white youkai on his way to his high school’s opening ceremony. This youkai is persistent on not leaving his side as its clings for dear life on his body, which in turn affects his mental state causing him to have severe depression as a result. This illness of sorts has left him recuperating in the nurse’s office, hence fellow students giving him the nickname of ‘Ashiya of the Nurse’s office’. He later seeks help through a notice board which leads him to his first meeting with Abeno Haruitsuki, who is more commonly known as the Master of the Mononokean.\\n\\n\r\nThe Mononokean is strangely a very large youkai in the form of a traditional Japanese tea ceremony room. The interior is fitted with all the tatami mats and other furniture making it look genuinely authentic. The best part for me personally is how the Mononokean communicates to its master and other guests, through the use of a wall scroll that hangs vertically on the wall. The Mononokean isn’t just some regular youkai guaranteed to give an answer every time but rather offers guidance to the inexperienced Hanae, who isn’t well versed with the world of youkais when he gets hired. The youkais mainly reside in the ‘Underworld’ which does not resemble anything like Hell or Purgatory for that matter. Although some youkai are prevented from returning to their homeland, as they have lingering regrets from their time in the ‘Mundane World’. The process of youkai being transferred to the Underworld is called exorcism which makes sense as they are getting rid of them from the Mundane world.\\n\\n\r\nThe series for the majority does follow an episodic structure as each episode involves dealing with a youkai (in the Mundane) with its unique set of problems. The show is paced very nicely to give us a brief but sufficient background on each client that arrives in the Mononokean. However, I am more intrigued in the events of the Underworld when part-timer Hanae makes his first visit alongside Haruitsuki to get some medicine. The Underworld is a place that is run by three powerful individuals called the Legislator, Justice and the Executive. The Legislator is the only person who makes an appearance, as he is technically the superior for Haruitsuki who was granted his title by that authoritative figure. The Legislator is very much interested in small talk and is keen to be informed on all matters regarding the Mononokean. The series being one-cour means there isn’t enough time for extra details to be explored, which is a disappointment as I’ll have to read the manga afterwards.\\n\\n\r\nThe series benefits from having a small cast of main characters and supporting cast. Hanae as an individual will not let supernatural entities ruin his day by being determined to make his way to school, despite all the difficulties imposed on him. He is also coerced into helping Haruitsuki as his understudy due to the fact that he was saved by him in the first place. The outstanding bill is used as a threat against Hanae but he does not let that dissuade him from doing youkai work. Hanae is a very unselfish individual who prioritises the needs of others over himself, evident in the fact that he cures people out of thin air… the man is Jesus I tell you!\\n\\n\r\nHaruitsuki is more of a stern individual who is not forgiving of blunders and other mistakes by Hanae, the man is a secret perfectionist I tell you. The title of being Master of the Mononokean has its own responsibilities and duties which are compulsory for him. The title makes him a revered and feared individual in the Underworld making him a celebrity of sorts, I wouldn’t mess with him at all costs. Haruitsuki in the Mundane world is an uneventful individual because the majority of time he is seen sleeping in class right behind Hanae. This is not the case across the barriers where he has plenty of associates and acquaintances who you could perhaps call friends. At the end of the day he is solely focused on his job to the best of his abilities.\\n\\n\r\nThe show does lack interesting characters as all you’ve got left afterwards are Zenko, fuzzball and Yahiko the mischievous fox. Zenko makes her appearance in her plea for help regarding her father’s condition laughing condition, who then makes frequent cameos alongside the main duo. Fuzzball is the youkai possessing Hanae from the start and is known to be quite the loyal friend, making him resemble a strong dog as the creature is reliable. Yahiko is known to be a childhood friend of Haruitsuki’s which is reflected in his behaviour of constantly wanting to be play all the time, as a result of nostalgia I guess. There are other characters as well but mostly everyone barring clients is there for comedic purposes.\\n\\n\r\nThe art style is very generic to begin with as it is a carbon copy of the manga’s character designs. The backgrounds used in the anime are very plain but is not the main focal point of the show. The lack of detail for both aspects may be down to budget as its barely average when compared to other series. However, the colour palette is wonderful to say the least, as it can be bright and vivid during cheerful times but dark and sombre during more downbeat scenes. The animation truth be told is not spectacular and once again is making the cut-off to what is acceptable. CGI animation is used to depict some of the youkai which can be very jarring to look at and looks misplaced at times which can be unsettling. This is probably the worst aspect of this show personally as even fuzzball is given the treatment despite being a miniscule thing in size.\\n\\n\r\nThe sound what can I say, has some exceptional voice actors for its main roles. We have the great Yuki Kaji voicing Hanae which to me is a treat every time, using his experience to play his character adequately. We also have Tomoaki Maeno giving us an exemplary job for voicing Haruitsuki which to me is a perfect match as it complements his demeanour. The best thing about this seiyuu duo is the fact they pulled off the ending for this show called Tobira no Mukou, which is another highlight. The background sound composition and OST by Morishita Hiroto wasn’t extraordinary but did not really have any memorable tracks that are worth mentioning.\\n\\n\r\nTo summarise, this is a nicely balanced show with a strong main duo combined with great comedy and the supernatural. You won’t be let down, I assure you.\\n",
            "date": "2016-09-25T01:30:00+00:00",
            "helpful_count": 51,
            "mal_id": 230119,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3858899.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/FireEmblemIke24",
                "username": "FireEmblemIke24"
            },
            "url": "https://myanimelist.net/reviews.php?id=230119"
        },
        {
            "content": "This anime left a good impression on me. It was funny, adorable and even had a couple of feels here and there. While there were many ups about this show, there was a reason for me to only give it a 7 overall, which was mainly the story.\r\n[MAY CONTAIN SPOILERS]\r\nThe story was not bad, but it definitely wasn't the best it could have been in my opinion. There wasn't a lot of plot, and it mainly only focused on the exorcism of Yokai, and Ashiya trying to regain his vision. However through story, lovely friendships were made and most of the Yokai were interesting andcute.\\n\\n\r\nI loved the art style in this one, especially when the main characters travel to the underworld. The colours were bright and appealing to the eye, it was a big plus for this show.\\n\\n\r\nThe soundtrack was lovely to listen to, consisting of harps and traditional Japanese music here and there. The OP and ED were catchy, and matched well with the show, and had me singing along with them.\\n\\n\r\nI loved each character, both human and Yokai, they gave me a lot of joy while I watched this show.\\n\\n\r\nThis anime was very heartwarming, and left me happy after each episode. I would recommend it if you're looking for a show that makes you feel warm and fuzzy.... Speaking of Fuzzy, I want one now!",
            "date": "2016-09-25T23:24:00+00:00",
            "helpful_count": 21,
            "mal_id": 230258,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5106195.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Chibi-Fukuro",
                "username": "Chibi-Fukuro"
            },
            "url": "https://myanimelist.net/reviews.php?id=230258"
        },
        {
            "content": "Hey folks, this will be a review for Fukigen na Mononokean. This show was like a poor love child of Noragami and Hoozuki no Reitetsu. I don't much recommend this show, unless you seen the other two and have an itch for a bit more.\r\nThe story revolves around a highschool boy, who on just before his first day of high school manages to get possessed by a youkai(more like infected by one). The youkai causes him distress and he tries to get it exercised. While this happens he learns of the youkai and about this world that he was before, unable to see. This exorcismthough costs a small fortune and he is forced to take on work with the exorcist to pay off his debt.\\n\\n\r\nMuch of the rest of the show follows the \"walled off heart and uninhibited new person who through their actions heals the walled off heart character\" trope. Most of the show is episodic. Situations arise, new guy does stupid new guy thing that we all learn lessons from, rinse and repeat. Aside from this there seemed to be an underlying plot of Abeno, Haruitsuki's (walled off heart guy), oddly enough there is no closure on this subject. Instead we get some silly drama surrounding Ashiya, Hanae(new person).\\n\\n\r\nThe art was nice, bright and colorful.\\n\\n\r\nThe characters were annoying. Well, the two main characters were. Ashiya, Hanae is overly emotional and quick to words that he cant really back up. Often early on relying on blind luck that Abeno is capable of doing some version of what he promises the youkai. Abeno is the opposite, he has little emotion and shows no interest in anyone but the youkai. They had to make these two characters so polarizing to make the underlying story work, but its crap and cheap. Instead of real character development we have to see two sides of an annoying coin bicker until Ashiya just does whatever the hell he wants.\\n\\n\r\nThe other characters were alright. Mostly they stayed in the background. Fujiwara, Zenko had a cool personality and I would have liked to see more of her but not much can be said about anyone else. \\n\\n\r\nI didn't really enjoy the show that much. I absolutely loathed the show until about episode 5. A handful of episodes after that were decent but again its just a poorer version of two decent shows. Also this is not funny, shouldn't be labeled as a comedy. If your interested in the life of yaoki and want some comedy, you should check out Hoozuki no Reitetsu. If your interested in some semi dramatic and life changing relationship dynamics with some gods and demons and such then check out Noragami. All in all I would pass this one up. Its not unbearable, its just mediocre with enough missed potential and annoying characters its not worth the time.\\n\\n",
            "date": "2016-09-23T19:12:00+00:00",
            "helpful_count": 19,
            "mal_id": 229947,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2321573.jpg",
                "scores": {
                    "animation": 8,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 5,
                    "sound": 6,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/ShySorcerer",
                "username": "ShySorcerer"
            },
            "url": "https://myanimelist.net/reviews.php?id=229947"
        },
        {
            "content": "That's a first : an anime that lacks so much confidence in its setting that it tries to lure you with yaoi bait. Which was absolutely meaningless (and useless, considering I'm pretty sure most people interested were more attracted by the youkai in the first place). \r\nThe thing is, this anime is quite enjoyable without it, so I can't get my head around the reasons (I mean reasons other than to satisfy excitable teenagers) that push the author to use yaoi as an audience trap.\r\nStill, maybe that's all it was, and it's not preventing this anime to be an easy recommandation to anyone that justdon't care, because this anime will found its public from people who wants to learn more about the curious nature of yokai, humans and friendship, all in a soft pace. \\n\r\nStory 7/10 : Clearly not the strongest point, unless we get a 2nd season. For now, the story looks like a work in progress, a stage setting for the events to come. It's a pity because there is a lot of potential, but as it is, unexploited.\\n\r\nArt 7/10 : easy on the eye. And that's it. No originality there (not that it was necessary in the first place).\\n\r\nSound 8/10 : there is some unexpected good work there. It's not really absolutely memorable, but somewhat \"carefully craft\", attentive to the details of the scene you're watching. Never off rhythm, never useless.\\n\r\nCharacter 6/10 : Here's the weakest point. Again, a work in progress issue : the anime was just not given enough time to grant the characters anything more than typical and boring traits.\\n\r\nEnjoyment 8/10 : I think people who usually love anime like Mushishi or Natsume will enjoy this one too. Certainly not as much, but still, the approach feels the same.\\n\\n\r\nSo, that's a nice anime to watch, easy to follow, easy on the mind, but here's something strange about it : if this anime get stuck here and don't get a sequel, then it's almost useless to know it exists. I don't think you're gonna lose something watching it, but if it stays as it is, you will not getting much from it either...",
            "date": "2017-01-18T01:03:00+00:00",
            "helpful_count": 6,
            "mal_id": 238562,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4477056.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mushimk",
                "username": "mushimk"
            },
            "url": "https://myanimelist.net/reviews.php?id=238562"
        },
        {
            "content": "It really boils down to whether you like the 2 main characters. If you like them, you'll like this anime. If you hate them, there's literally no point for you to watch it. The story, at this point, is kinda plain, not boring but not very interesting either. So I'd suggest that if by watching the first 3 episodes, the only impression you get from the 2 main characters is annoying, then you can safely drop it.\r\nMe personally, I found them loveable. I loved their personality and their looks. I could relate to Ashiya's & Abeno's tsundere-friendship too. And overall all characters were loveable, itreminded me of the atmosphere of Shirokuma Cafe. Character score: 9/10\\n\\n\r\nJokes: The jokes were pretty funny. I remember laughing literally out loud quite a few times. But at times it felt as though the writer tried too hard. Joke score (i.e. my enjoyment score, since the jokes were the element that I enjoyed most about this show): 8/10\\n\\n\r\nStory: I, as someone who believes in the concept of Jinn, found it entertaining to learn Japanese commoner's take on the unseen creatures. But I can admit that I didn't keep watching the show for its story. As most reviewers said, \"story\" is just simply not the strong point of this anime, at least for now. [Minor spoiler alert] But at times you'll notice that there's actually some depth to the story than it appears to be atm, like in the first episode, when Ashiya introduced himself to Abeno as \"Ashiya\", Abeno goes, \"Ashiya? Ok, I've changed my mind now\", and at later episode, the Legislator talks about how one of the reasons why Abeno hired Ashiya was because he was interested in Ashiya's first name, that that first name means something to Abeno. Nonetheless, the story score as of 1st season is: 5/10\\n\\n\r\nArt: I don't have much to say other than that the characters and the animation could look slightly better in some scenes. That doesn't mean it was awful, though. Art score: 7/10\\n\\n\r\nSound (Voice Actors-wise): The Japenese VAs did a really great job. The acting was superb. Sound score (VA): 10/10\\n\\n\r\nSound (OST/BGM/SFX-wise): The OP & the ED were decent. The BGM & the SFX were perfect. Sound score (OST/BGM/SFX): 8/10\\n\\n\r\nOverall: 7/10... It was good. I can rewatch it if I'm too bored and don't know what else to watch.",
            "date": "2019-02-15T03:08:00+00:00",
            "helpful_count": 2,
            "mal_id": 301698,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7667665.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 10,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/pispis",
                "username": "pispis"
            },
            "url": "https://myanimelist.net/reviews.php?id=301698"
        },
        {
            "content": "This is such a common anime. Seriously. But, why did I feel my heart beating so fast for him? So, at first, I have to admit that I fell in love at first sight for Fukigen na Mononokean. Just on the first episode I already felt so good watching, a feeling that I rarely have. It gives such enjoyment and leaves you absolutely absorbed on every episode.\r\nThe plot is very simple and very understandable: tells the story about a yokai exorcist, Abeno, and his employed, Hanae. And the story's development is so natural, since the change of sceneries until the new's characters entrance.\r\nThe art issoooooooooo beautiful. The sceneries itself are simples, but when it comes to the subworld... Ahh! Such an aesthetic should deserve an award.\\n\\n\r\nSo, overall, I felt very into this anime, the simplicity here is everything and makes you fall in love. Just.",
            "date": "2019-01-02T05:37:00+00:00",
            "helpful_count": 2,
            "mal_id": 297794,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6067005.jpg",
                "scores": {
                    "animation": 10,
                    "character": 9,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/mellllll",
                "username": "mellllll"
            },
            "url": "https://myanimelist.net/reviews.php?id=297794"
        },
        {
            "content": "*Just because I rated this a 6 does not mean this anime is not worth watching*\r\n\"The faith in the promise we made, gave him the strength to move on.\"\r\nThis story is pretty basic. I do not feel like there is too much to it. Which is not necessarily a bad thing. \r\nThe art is nice. I just personally am not a fan of different graphics used together in one anime. So you Kind of get the typical cartoony look but then you have the yokai which will be more computerized at times. \r\nThe sound was basic. Nothing out of the ordinary in my opinion.\r\nYou didn'tget a huge variation of characters like you would in some other anime. But I did feel a connection to the overly emotional character. \\n\\n\r\nI enjoyed this anime a lot still because I could relate to the feelings and emotions that were portrayed in the story line. For me, that is more than enough.",
            "date": "2018-09-24T18:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 289911,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6390396.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 8,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/aubreyaylaine",
                "username": "aubreyaylaine"
            },
            "url": "https://myanimelist.net/reviews.php?id=289911"
        },
        {
            "content": "I dropped this anime 8 and a half episodes into the story because its failure at storytelling/character development made it very hard to enjoy.\r\nPros: it's pretty and kind of cute, especially if you happen to be into demonic furballs.\r\nCons: it's the anime equivalent of oatmeal. Very bland, but pretty oatmeal.\r\nThe strongest points of this anime are the visual and audio aspects; the backgrounds are pretty, the animation is enjoyable to watch, and the character designs make the characters easily recognizable and memorable. \r\nThe weakest points are pretty much everything else. The protagonist is incredibly boring; a typical highschool kid who stumbles upon the supernatural andis sucked into a whole second life of magic and whatnot. Abeno is his tsundere master, serving as a guide to said supernatural world. Combined with the demonic furball that gets attached to them both, they're pretty much the only characters that get any development at all; there's a girl, and a fox, and about a thousand random yokai that appear once and never really feature again. The story is episodic, with each episode focused primarily on helping a single yokai with their problems (that you will probably find you couldn't care less about) and then learning something profound from this experience. \\n\\n\r\nThe thing that irked me the most about this anime is the very forced drama. The emotions it tries to evoke simply have no basis in the story--the protagonists say they're scared, or worried, but nothing in the story makes you feel like it's an appropriate reaction. The yokai are very cute and not at all threatening; the main character's exaggerated fear of them does not feel authentic or relatable. The main character's reactions don't seem consistent, either; he vacillates between strange conviction that makes him disobey Abeno to do random dumb things that somehow work out fine, and being apologetic to literally everyone immediately after. At points you get the feeling that you're supposed to be sad for the characters, but none of them are relatable or developed enough to justify this feeling. \\n\\n\r\nOverall, I wouldn't exactly discourage someone from watching this. It has its merits, and would probably serve as a good anime for a child or someone looking for a really simple story with minimal sadness. That said, I personally probably won't be finishing it anytime soon.",
            "date": "2018-09-11T09:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 288748,
            "reviewer": {
                "episodes_seen": 9,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7399528.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 5,
                    "sound": 7,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/okyuu",
                "username": "okyuu"
            },
            "url": "https://myanimelist.net/reviews.php?id=288748"
        },
        {
            "content": "To be honest this anime  is probably intended for a very young audience . It gets extremely boring and has really no purpose. There isn't even very much material to discuss. It can be described as a very good anime for young children. There are generic morals to be learnt, cute \"animal sidekick\", appealing art, and interesting concept. Overall it just isn't very enjoyable for older individuals. \r\nThe one thing that this anime has is quality art. The characters are generic and not remotely interesting. (DON'T BE FOOLED THERE IS NO YAOI.) The humour is non-existent, the plot is nonexistent. The soundtrack can bedescribed as nice but nondescript. \\n\\n",
            "date": "2016-12-20T18:34:00+00:00",
            "helpful_count": 3,
            "mal_id": 235960,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5450307.jpg",
                "scores": {
                    "animation": 8,
                    "character": 3,
                    "enjoyment": 3,
                    "overall": 2,
                    "sound": 5,
                    "story": 2
                },
                "url": "https://myanimelist.net/profile/wwtianyou",
                "username": "wwtianyou"
            },
            "url": "https://myanimelist.net/reviews.php?id=235960"
        },
        {
            "content": "I never thought I'd like this show as much as I did…at first it seems really mediocre but as it goes on, it's a very comedic and beautiful anime. It's a bit of a fujo-bait series for a shounen (coming from a fujoshi herself), but it doesn't stop you from enjoying it.\r\nThere's no real plot, instead there's just that episode to episode flow (mostly) and it gives a laid-back sort of slice-of-life feeling. Perfect for watching when you're bored or feeling melancholy, it picks you up a little. They way the human-yokai relationship thing is explained through the trials also gives it a nice feeling.\r\nTheart and the music are gorgeous and near perfectly suit the traditional Japanese theme. The art is very clear and colorful while the music is easy on the ears and nicely done. The theme songs- at first I thought \"eh, standard\" when I first heard them but they grew on me eventually =v= The vocalist from the op has a very (very) nice voice and although I don't like cv songs so much, the ed between the main cv's is actually pretty good –u–)/ \\n\r\nThe characters aren't out of the ordinary or anything but they're quite enjoyable.\\n\\n\r\nI really enjoyed this show! It made me want a second season, but also with the way it ended it felt like \"mission complete\", or that it's fine the way it is. Some things are left unattended to but not everything needs to be known, right? \\n\\n\r\n~~review no.4 ☆",
            "date": "2016-10-29T14:42:00+00:00",
            "helpful_count": 3,
            "mal_id": 232858,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4014355.jpg",
                "scores": {
                    "animation": 9,
                    "character": 6,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/catcupcakes",
                "username": "catcupcakes"
            },
            "url": "https://myanimelist.net/reviews.php?id=232858"
        },
        {
            "content": "Story:\r\nThe storyline involved humans and youkais, and it is one of my favourite themes. It is especially vivid in portraying the lives and thoughts of youkais, and through the MC we are able to see how they interact with humans. It is mostly funny and heartwarming. The MC is kind and at times reckless, but very loveable. The other MC is like the grouchy uncle who is annoyed but takes care of his nephew anyway. The story does not just talk about bonds between youkais, or youkais and humans, but also between humans as well. The stories are episodic, but sufficient attention is given sothat each character can properly flesh out. \\n\\n\r\nArt:\\n\r\nThe art is good. The characters look cute, art is clean. Most importantly, vivid colours are used so the whole anime gives off a warm and vibrant feeling. I especially like how the Underworld is presented. The art for the underworld is simply amazing - not just the architecture or the colours of the sky, but the detailed portrayal of a youkai community as well. \\n\\n\r\nSound:\\n\r\nI give 10 for the sound. I'm the kind of person who fast forwards OPs and EPs, but pays too much attention on the voice actors. The two MCs are voiced by Maeno Tomoaki and Kaji Yuki, and they did a wonderful job. Their voices are unique and beautiful, and they played out their roles perfectly. Furthermore, Suwabe Junichi was also in the voice cast, and that is simply...wonderful. \\n\\n\r\nCharacter:\\n\r\nMany of shonen animes like to give a sudden change of heart for the characters to push the plot forward, but personally I've always found them forced. Fukigen na mononokean does not have such character development yet. We just see a gradual shift in the personalities of the MCs - from shutting off from humans to accepting that some people can understand even if they can't see, and from not believing in youkais to hating them to understanding them and loving them. I think its believable, it matches the pace of the anime, and can be rounded off with a warm feeling in the chest and many hearty laughs.\\n\\n\r\nEnjoyment:\\n\r\nI finished it in a day, that's how much I enjoyed it. It had nothing heavy, not those plots that require heavy brainpower to process, or so emotional that you just can't stop crying. It is extremely light-hearted, although sometimes it gets a little thought invoking, and just warm and funny.\\n\\n\r\nOverall:\\n\r\nPersonally, I find it better than some of the more popular anime series from 2016. I am surprised so few people actually know about it. I think it deserves more attention. Although it is not a masterpiece, it is an anime that is worth the watch. I'd definitely recommend it.",
            "date": "2017-06-20T09:23:00+00:00",
            "helpful_count": 2,
            "mal_id": 250450,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 10,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/AdelineKuang",
                "username": "AdelineKuang"
            },
            "url": "https://myanimelist.net/reviews.php?id=250450"
        },
        {
            "content": "\"The Morose Mononokean\"\r\nDON'T WATCH: if you're looking for an action-packed, fast-paced show.\r\nWATCH: if you like natsume yuujinchou, hotarubi no mori e or poco's udon world (in terms of heartwarming elements) or if you enjoy slow, heartwarming storylines.\r\nQuick review \r\nstory: 7.5\r\nart: 8\r\nsound: 8\r\ncharacter: 8\r\nenjoyment: 8\r\nStory- (surprisingly) heartwarming and adorable at times. it follows the 'main characters are involved with youkai and tries to solve problems related to it' storyline. hence, the pacing- a bit slow, but it suits a show like this. the vibe is quite similar to mononoke & natsume yuujinchou. \r\nArt - pretty unique (colour contrast, texture-thingy?) and pleasing to the eyes, a bitof CG, but nothing too unnecessary.the sceneries (especially in the 'underworld') are pretty as well.\\n\\n\r\nSound - the seiyuus, as always did a great job. i like the OP and ED as it gives off a nostalgic (?) feeling. background tracks used are suitable for bringing whatever moods it's supposed to bring\\n\\n\r\nCharacters - the main cast is small, yet their interactions are entertaining to watch. their background and development are also decently explored, considering the episode limit.  \\n",
            "date": "2017-06-02T06:38:00+00:00",
            "helpful_count": 2,
            "mal_id": 249115,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5203002.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/lensaamiranda",
                "username": "lensaamiranda"
            },
            "url": "https://myanimelist.net/reviews.php?id=249115"
        },
        {
            "content": "\" May contain light spoilers \" \r\nI feel that this anime is one of those \" you either like it, or you don't \" anime so I would highly recommend giving this one at least 6 eps before you make a judgement whether or not you like the plot or not.\r\nStory: The plot isn't a masterpiece nor was it bad. But what's the plot you ask? well if you expecting some plot twists here and big changes than this isn't what you will be expecting. The show centers around the Comedy, Drama and Supernatural aspect and mostly episodes are about the two guys helping outthe troubled yokai then sending them off to the Underworld when they are content. They will guarantee to play your heart like a instrument the entire time.\\n\\n\r\nIf you looking for answers to mysteries and the unexplained mysteries in Season 1 than your best bet may be to skip this season and go straight to Season 2 Tsuzuki, that's basically when the show moves towards mysteries regarding the two guys and the Underworld. A little darker tone. \\n\\n\r\nArt: Art will always be a preference thing to people, personally I found the art to be really good. It fits the theme of the show, its bright, vibrant but simple. \\n\\n\r\nSound: Not much music, the music fits in moments sure but could appreciate more variety. Voices of characters are good and fit the characters really well. By the way give the English dub a go, it's a surprisingly good but funny experience.\\n\\n\r\nCharacter: Great characters, never would have guessed having a bubbly, naive 5 yr old Ashiya paired so well with Abenos personality ( I don't know how to explain it but i know he's basically annoyed but caring ), its like water and oil but they work together well. The different yokai you meet all have different personalities and backstories; some might be sad, some working hard for the one they love, etc, heck! one of the main yokai you meet is a siscon.\\n\\n\r\nEnjoyment: Mainly the enjoyment comes from either laughing at the drama between Abeno being annoyed to hell with Ashiya acting like a 5yr old. If not for those you will enjoy the yokai stories.\\n\\n\r\nOverall: Its enjoyable but only if you like that kinda anime, it's like watching Natsume but its more focused on comedy. This season sadly does a bad job with explaining some things which starts leaving watchers hanging wondering if its just not important or they just forgot. Like I mentioned before Tsuzuki is when the mysteries start getting explained.\\n\\n\r\nPut everything together and you got yourself a cozy anime to watch after a hard long day from work or studying.",
            "date": "2019-02-10T03:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 301316,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6708506.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Windadepts",
                "username": "Windadepts"
            },
            "url": "https://myanimelist.net/reviews.php?id=301316"
        },
        {
            "content": "I'm not someone who writes reviews, so the fact that I decided to write a review for Fukigen No Mononokean speaks volumes in itself. First, I feel the reviews given to this anime is unfair in itself. And I do understand why. Mostly because people tend to compare it to the already popular supernatural anime around. And if you do that, you will not enjoy this gem of an anime.\r\nI'll keep this short and sweet. If you want to enjoy FNM, you need to throw away all the perceptions and judgement of supernatural anime with demons and gods. This is a different story. There isno character that is weak and fragile and is trying to make a difference or a God who is banished and wants to recreate himself.\\n\\n\r\nThis story is about a boy who assists another and helps the lost demons of this world get back to their homes in another world. It's a fun ride no doubt.\\n\\n\r\nStory: 7\\n\\n\r\nLike I said, this isn't one of those hold-your-breath shounen anime. It's a gentle and sweet ride. There isn't much complications but it is interesting enough to keeping you watching episode after episode due to their \"mysterious\" nature, I guarantee you that.\\n\\n\r\nArt: 8\\n\\n\r\nSimple but beautiful with good animation. The \"other world\" in this anime is nicely draw. Again simple but soothing with a setting that is easy to take in.\\n\\n\r\nSound 8: \\n\\n\r\nThe VA's were amazing. They fit to their characters perfectly. The soundtracks were not the sort that you would listen later and download to your phones but they did the trick of creating the right tone for this anime. The OP was my favorite. It was nothing like Gitnama's or Noragami's opening but more to the lines of Tanaka-kun is always listeless.\\n\\n\r\nCharacter: 9\\n\\n\r\nThis for me was the winning point. There is no character that is weak or useless. The main character is a school boy that discovers a supernatural creature and wants to help it get home and in doing so he meets Abeno, the master of the Mononokean. And the title of the anime fits him perfectly \"the Morose Mononokean\". He is broody and doesn't want to do anything with our MC but gets along with him (like all other characters) throughout the story. And the transition from his I-don't-care to he-is-my-friend is flawless and beautiful. There is no hints of BL like others make out. It's a normal friendship between two high schoolers or in this case a Master Mononokean and his apprentice. \\n\r\nThe side characters that are shown in this anime is also interesting and fun to watch. You will definitely fall for at least one of them. I guarantee. \\n\\n\r\nEnjoyment and Overall: 8\\n\\n\r\nI thoroughly enjoyed this anime to the point where I went and read the manga afterwards. And I definitely would watch the other seasons when they come out withour a doubt. And if you watch it with an open mind you would like it too.",
            "date": "2019-01-18T22:48:00+00:00",
            "helpful_count": 1,
            "mal_id": 299421,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/7102529.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/otakukunkou",
                "username": "otakukunkou"
            },
            "url": "https://myanimelist.net/reviews.php?id=299421"
        },
        {
            "content": "I love series like Natsume Yujincho, xxxHolic, Mononoke and Hozuki no Reitetsu. I first started watching this series when it originally came but dropped it cause it didn't seem to have much depth to it. I recently decided to give it a second try and to my horror, with each passing episode, I realized that i had in fact already finished the series when it originally came out - it was just SO BLAND I forgot about it completely.\r\nSo, why didn't I like it? \r\nThe characters. \r\n The main character is as 2D as they come and the author has clearly committed one of thebig writing sins of \"everything the character does ends up being correct cause it all ends well in the end\". It's especially frustrating when his mentor, the head of Mononokean has clearly had to suffer for his ability to see yokai and now comes along our main character and everything goes right for him.\\n\r\n When it comes to all the other background characters they're so stereotypical you'll feel like you've seen all of them before in some other shows.\\n\\n\r\nWould I recommend it? \\n\r\nIf you liked series like Natsume Yujincho, xxxHolic and Mononoke but wish for something more lighthearted, more mainstream, something that doesn't deal with any difficult topics in any meaningful way and has less depth story wise, this is the series for you!",
            "date": "2018-11-18T07:33:00+00:00",
            "helpful_count": 1,
            "mal_id": 294293,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/6664812.jpg",
                "scores": {
                    "animation": 7,
                    "character": 5,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 7,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/caelesc",
                "username": "caelesc"
            },
            "url": "https://myanimelist.net/reviews.php?id=294293"
        },
        {
            "content": "I'll be honest: I mostly started watching this because I'm a complete sucker for BL subtext. And it has that, absolutely. But I really enjoyed this anime for more than that, more than I thought I would.\r\nSo, okay, I'll admit that I'm typically the kind of person who, if the show has great characters with great interactions, then I don't even care if the plot is weak: I'm satisfied. And Fukigen na Mononokean definitely has great characters. Ashiya is the incredibly kindhearted type--with a healthy dose of the airheaded type--passionate about helping others even when he might be scared or might not really know howto help them, and he's intensely loyal to those he befriends. Abeno initially seems rather cold and businesslike, but his interactions with yokai show how considerate and gentle he can be. Their interactions range from hilarious to sweet to quietly emotional and I loved every minute of it. It's always a treat to me to watch two characters learn to trust each other and forge a deeper connection; one of my favorite things is a character being able to predict how the other character will react to things and knowing when that character is feeling off because of how he's acting, and there's definitely a lot of that here. Whether you view their relationship as strictly platonic or heading towards romance, it's a fascinating relationship.\\n\\n\r\nThere's a healthy dose of interesting side characters too, though unfortunately we never spend much time with them. I feel like Zenko--a girl who initially meets Ashiya and Abeno because they come to help her father, but after getting bitten by a yokai and being able to see other yokai, she sort of informally becomes part of their circle--is going to eventually play a bigger role and I hope that's the case!\\n\\n\r\nI will admit that the plot is a little weak. It's a rather episodic structure of Ashiya and Abeno meeting a new yokai in almost every episode and assisting that yokai with a problem. There are hints of deeper stories--how the human Abeno came to be the Master of the Mononokean (a yokai in the form of a tea room that allows him to easily travel between places and gives him the power to move between the mundane world and the Underworld), some secret power Ashiya seems to have, what the heck is up with the three heads of the Underworld (we only meet the Legislator, but there's also the Justice and the Executive). Unfortunately, they are only briefly introduced and we get nothing near resolution on any of these things. But I still really enjoyed the anime, and ultimately I understand that the manga it's based off of is still ongoing and certain things haven't been revealed yet--I just hope this means there will be a season two to keep the story going! (I haven't read the manga yet so I suppose I have that to turn to if a season two never comes, but I really do hope this anime continues. I mean, listening to Kaji Yuki and Maeno Tomoaki is always bliss.)\\n\\n\r\nThe art was nice--nothing extraordinary, but I thought it was pleasing and fitting. (I'm no artist though.) I loved the unique take on the Underworld as a setting; I won't \"spoil\" it, but it's definitely not the kind of Underworld people generally imagine. I wish I could comment coherently on the music because the snatches I caught seemed quite lovely, but unfortunately I don't tend to focus on the music too much while people are speaking. But I do want to download the OST because it certainly seemed promising. I enjoyed the OP, and especially liked the ED featuring Kaji Yuki and Maeno Tomoaki.\\n\\n\r\nIt's a little tortuous because this anime teased at deeper plots without delving into any of them, but it certainly managed to get me hooked! I can only hope we'll see more of Ashiya and Abeno and their hodgepodge of yokai friends in a second season that will start revealing more about this story and these boys.",
            "date": "2016-11-24T21:07:00+00:00",
            "helpful_count": 2,
            "mal_id": 234344,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1399321.jpg",
                "scores": {
                    "animation": 7,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 7,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/chelime",
                "username": "chelime"
            },
            "url": "https://myanimelist.net/reviews.php?id=234344"
        },
        {
            "content": "As a fan of yokai/ghost stories, I was happy to see a series the felt with yokai in a more lighthearted fashion, not portraying them as a nuisance or a threat as many other series do. We get to see spirits and humans living in harmony.\r\nThe art is fine, nothing special, but watchable and consistent. The art style is generic, and doesn't stand out, making it look quite boring from the outside. The two protagonists can be unrecognisable in comparison to other, similar looking anime characters.\r\nThe major fault of this series, and that made me almost drop, is it's characters. The main character, Ashiya, isannoying and bland, with nothing to add to the series other than an annoying \"kindness\" - as they call it. He is unbelievably nice and I can't find any reason for it other than plot. I don't understand why anyone would create such a boring protagonist if they want people to be engaged.\\n\\n\r\nThe other protagonist, Abeno, also has a generic, overused personality-type, with a just enough depth to make him slightly more interesting as a character. As I watched the show, I just couldn't understand why he would choose Ashiya as his assistant, which made me dislike him.\\n\\n\r\nOverall, I enjoyed the story of the series, particularly the creative yokai that is introduced. However, the human characters are bland and almost annoying. I felt like watching them, particularly Ashiya is especially tedious. But it's a short series, perfect if you have some time and nothing to watch.",
            "date": "2018-05-15T03:47:00+00:00",
            "helpful_count": 1,
            "mal_id": 280608,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/5354775.jpg",
                "scores": {
                    "animation": 6,
                    "character": 3,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/abitofsalmon",
                "username": "abitofsalmon"
            },
            "url": "https://myanimelist.net/reviews.php?id=280608"
        },
        {
            "content": "The story was nice and I enjoyed watching it but there needs to be a season two because there are so many unanswered questioned. here are couple\r\nWhy did Ashiya have that mysterious power in episode 5? When fluffy got hurt by something and in Ashyia something ticked?\r\nWhy is his name Ashyia? It is a Yokai name after all in this anime?\r\nWhere is Ashyia's dad?\r\nWhy did Abeno's master accept him?\r\nOverall why did Ashyia have that power?\r\nIf there ould be a season two, I would like to see them answer all these questions or some of them \r\nBut a very nice anime just needs to answer allthese questions",
            "date": "2018-03-09T16:25:00+00:00",
            "helpful_count": 1,
            "mal_id": 273441,
            "reviewer": {
                "episodes_seen": 13,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4127689.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/honeyonatoast",
                "username": "honeyonatoast"
            },
            "url": "https://myanimelist.net/reviews.php?id=273441"
        }
    ]
]