[
    [
        {
            "content": "I don't care how well a formula works, when it's repeated three times with no changes, it screws over suspension of disbelief. Although enjoyable with some fist-pumping moments, the third season is definitely a letdown from the previous seasons and I hope they make a fourth season just to repent for the mess they created here. I will start out with the small stuff because I want to save the story until the end.\r\nArt is the same as the last two seasons, it's nicely rounded out, and for being a cute/ecchi anime, the fighting scenes are better than expected, giving it a score of 7.\r\nI'vealways really liked the Zero no Tsukaima soundtrack and music cues, so although nothing but the OP/ED changes, I will give it a 9.\\n\\n\r\nStory was weird - I mean, it's built around the characters' backgrounds, sure, and then we have the interesting development midway, but nothing is really fleshed out and the end of the season feels more like facing just another Robotnik boss after shoving Sonic through a million winding tubes in Hydrocity Zone. I wish the general war/story/etc could focus almost entirely on how it affects the characters because that's what ZnT is based around. This random plot in the third season doesn't really excite me at all and I'd rather endure the agonizing fanservice. This gets a 3.\\n\\n\r\nCharacters, right. So the main reason I did this review was the rant about the characters, so get ready.\\n\r\nI seriously don't get why the makers of ZnT think it's all right to pull the same old romantic comedy junk without trying to develop the MAIN CHARACTERS one single bit. Yes, you can list all the things they've 'been through', but in the end, they're in the SAME GODDAMN PHASE that they were in at the end of Season 1. It's like they're daring each other - \"are you willing to go this far for me?\" or \"you don't like me that much do you?\" I mean...really? Being a Tsundere is one thing, but having chronic amnesia every episode is another. I thought I could endure it for season 3, but the first ten minutes of the very first episode almost literally made me spit out what I was drinking at that time because the fight that Louise and Saito had would be LUDICROUS to anybody else that had gone through what they had at the end of the second season. How does a life-changing event NOT lead to character development? ZnT is like the opposite of Clannad in the fact that almost all of the characters are completely inelastic except for maybe Agnes/Henrietta/Tabitha.\\n\r\nIn summary, I hated the fact that after three seasons, the ZnT crew were still not up to the task of plotting out a realistic relationship of any degree. The only thing that keeps me from dropping the character score down to a 3 is the Henrietta/Tabitha development, which could go so many ways, so good for us, and the Colbert coolness factor, kicking the character score up to a 7.\\n\\n\r\nOverall, I still did enjoy it - ZnT is mainly the anime where you get some smiles from the awkward moments and \"aww\"s from the cute moments and perhaps little else. I say perhaps because Saito's harem has ridiculous potential to not only enhance the viewer's experience but even the plot, both relationship and general, which gave me motivation to keep watching this thing. But anyways, watch this if you're a fan of ZnT, pray for a 4th season, and keep that suspension of disbelief locked in that cupboard.",
            "date": "2011-01-18T08:39:00+00:00",
            "helpful_count": 71,
            "mal_id": 33853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421926.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ymir233",
                "username": "ymir233"
            },
            "url": "https://myanimelist.net/reviews.php?id=33853"
        },
        {
            "content": "In contrast to the previous two seasons, which were somewhat enjoyable, the third season was the most disappointing of all for multiple reasons. It manages to start off well however there were many possibilities that were available but were infrequently explored which could've potentially made this season much better or so. Unlike the first season, the third season seemed to not focus on the plot as much. It seems as though there was an excessive amount of romance cliches which strongly detracted from the season, such as the overly emotional and volatile tsundere (ex : Louise zapping Saito as comic relief), ecchi fanservice (ex :hotsprings, nosebleeds, yuri, breasts). Though the storyline does bring along some good results that are decent to the viewers such as the highlight of Tabitha's storyline, development of henrietta's character and Louise's insecure side and Saito shows his chivalry side. In addition, with the introduction of new characters, each character has a unique personality. More often than not, Louise and Saito bring out romantic moments which bring out a refreshing experience to the audience. Saito accompanies latterly his incredibly and heart-warming feats of courage and caring devoted and engaged in singularly towards Louise, while Louise introspectively loves him so, she cannot express it properly and openly until there is more character development. \\n\\n\r\nOne of the best aspects of Zero no Tsukaima are the animations, the character designs are fairly decent visuals, and the illustrations successfully convey the character's expressions to the audience without a problem while adding onto the humorous moments. There is also a fair amount of detail in the background which would enlighten the audience respectively.\\n\\n\r\nThe opening and ending themes are fairly decent and manage to fit well and the bgm is also well-accustomed to the particular moments. The voice actors are consistent throughout the series as well with their voice acting.\\n\\n\r\nIn conclusion, Zero no Tsukaima ~Princesses no Rondo~ is an above average sequel to the series with some intriguing moments. It seemed to ignore the most compelling and intriguing aspects of the series, the storyline. It could have been possible to focus on the two main antagonists and the overall objective of the antagonists while filling in the plotholes instead or it could of spent more effort on the relationship of Saito and Louise. \\n\\n\r\nHopefully, the next season will end this cliffhanger.\\n\\n\r\nThough the enjoyability of this series is dependent on what exactly you are expecting.\\n",
            "date": "2008-11-30T12:08:00+00:00",
            "helpful_count": 50,
            "mal_id": 9968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nequam",
                "username": "Nequam"
            },
            "url": "https://myanimelist.net/reviews.php?id=9968"
        },
        {
            "content": "Well I would like to state that I watched both season 1 and 2, and I liked it ALOT.\r\nStory: This is the part where I was disapointed in the most. When I think about what should I write in \"Story\", the first thing that comes in mind is \"What story? There's a story? Maybe I missed the episode where there was acually a STORY?\". This show turned from a 'top-noch' anime to 'yet another harem' anime. Not only story is laking, IQ has dropped wonders. Characters are unable to understand things that are PLAINLY OBVIOUS like some things with the elf and the wierd puprlegirl (I can't explain because it wil be a spoiler, but you must be one of those who said 'WELL IT HAS TO BE HER! FOR F#$K SAKE! ARE YOU BRAIN DEAD?!\")\\n\\n\r\nArt: As always,the art is truly outstanding. It was hard for me to believe, but they actually GOT BETTER than the second season, and I thought that was as good as the art can get.\\n\\n\r\nSound: Don't care much about the opening, HATE the ending, just me probebly (makes me think im watching Hentai when she starts moaning...). Other then that, not much different then any other show.\\n\\n\r\nCharacter: I'm a big boobs fan. I won't lie. But I think i'm speaking for all of us when I say, THERE'S A LIMIT. What that elf has is NOT boobs. It's a wierd tumor thing that groses me out. The maid comes back for more harresing (I don't get whats so good about it. I liked her better in the first season), and our hero seems to get some criminal expirience on raping (She said NO and he kept pushing her. I think he should be jailed). Other than that, it's pretty much the same as last season. Elf has a typical \"i'm weak and I need a strong man (specific guy who has nothing to do with strenght, just the hero so she wants to sleep with him) to protect me!\".\\n\\n\r\nEnjoyment: Not very much (as a 7 would state). Could have been ALOT better.\\n\\n\r\nOverall: I really think they need to shape up and start copying from the second season. If this season goes on like this, I will regret seeing it. (Sorry for the long stories I wrote there, just diden't want to say I don't like it and not explain why). 7 Is how much I would give this show if it keeps up like this, and thats only because I feel like I owe it something for the last 2 seasons. Get better, and I might even give it a 10 again. Worse, maybe I will drop it. Hope it will get better.",
            "date": "2008-08-12T11:44:00+00:00",
            "helpful_count": 31,
            "mal_id": 7062,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46347.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/galluvton",
                "username": "galluvton"
            },
            "url": "https://myanimelist.net/reviews.php?id=7062"
        },
        {
            "content": "ZnT: Princess no Rondo\r\nThe worst season of all, this was just frustrating, i was just bored of Louise and Saito's act between eachother.\r\nStory\r\nThe story is almost the same, with the difference that they are looking for an elf that saved Saito from his death and revived him and because of this he lost the rune that tied him with Louise and because of this Louise starts to be more insecure than she was before and makes this so f**king annoying, is desperating and makes you being bored from their relationship and want them to end their s**t, it's like they hate each other even morein their love-hate attempt of comedy, there's a story more than that but this two ruined it and you don't care anymore, just a fine story here.\\n\\n\r\nArt & Sound\\n\r\nIt's the same as the 1st and 2nd season, there's no improvement but it was fine because it has the same quality from the last 2 seasons.\\n\\n\r\nCharacter\\n\r\nWorse than the other two previous seasons, it's the same, just focused on Louise and Saito and not developing them but even taking steps back from what they constructed in the last two, it's like they never loved each other, but in this one Kirche and Charlotte are very well developed in the way that we know more about them, i liked that and because of them this was saved from a worst score and just stays in fine.\\n\\n\r\nEnjoyment\\n\r\nThis season was painful to watch, i hated Louise and Saito relationship, even to a point that he should have stayed with Siesta or Tiffa or even Charlotte or Henrietta but it was fine because of Tiffa, Charlotte and Kirche and not to forget Siesta and the fanservice, so it was fine.",
            "date": "2015-08-07T15:01:00+00:00",
            "helpful_count": 26,
            "mal_id": 195454,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195454"
        },
        {
            "content": "I'd recommend this if you're new to harem anime and want a light-hearted story to go along with some fanservice and Saito-shenanigans. For the regular fans of harem animu, I'm sure you're already watching this...\r\nFor those of you who haven't seen it and are looking to see if you should pick it up this season -- There's a \"main\" plot and other stories to go along the usual fan-service and boy-beating (of course). But to be honest, I'm not sure it's worth it just for that.\r\nYou're watching it for the same reason as ALL of us: Louise & Saito... plus the other girls. You wantto see Saito (the main character) TRY to get Louise's love; You like seeing Louise kick Saito's ass in the castle, in the strip joint, in the restaurant, in school, in the dorms and everywhere else the animators care to  draw for us. And elftits. And panties.\\n\\n\r\nApparently, in the book, they've consumated the marriage already. So YES, he's taken her home and had consensual sex with her in the missionary position, with the lights off, at night. (f**kyeah!)\\n\\n\r\nBUT It's the 3rd season. Don't kid yourself; the story is not going to improve. It's gonna be the same crap over &amp; over. YOU KNOW THIS. It's not going to mature into anything more. As much as you're hoping it would get better, it's not.  So skip the denial stage already and just try to enjoy the show. \\n\\n\r\nAnyways, I'm gonna keep watching this show till it ends. So, continue watching this show with me. You bunch of masochists. (ONE OF US?)\\n\\n\r\nPS. Teh RIE",
            "date": "2008-07-24T00:58:00+00:00",
            "helpful_count": 25,
            "mal_id": 6545,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60618.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/futuresex",
                "username": "futuresex"
            },
            "url": "https://myanimelist.net/reviews.php?id=6545"
        },
        {
            "content": "Zero no Tsukaima is one of those rare romantic anime that actually allows the viewer some of the pleasures of romance that are rarely ever actually allowed in a series: actual physical contact. You see, most romance anime feature a boy and a girl and 24 episodes of them muddling through genre cliches and stuttering annoyances until finally, they get together in the end, and even then, only about 5% of the time, it ends in a kiss, which really blows my mind about romance anime in general, but that's another matter.\r\nNow, to be truthful, there's a lot that can be said against this show.The story is weak in itself, filled with more deux ex than can possibly be explained. It's almost like the creators just don't care about plot holes and rediculous assumptions. Not only that, but the original premise of Season 1 (where Louise is a magic student in a magical academy) has been completely abandoned. I think the academy showed up once or twice in Season 3 and the Professor showed up only in the last episode.\\n\\n\r\nHowever, somehow, all of the bad things that can be said about this show still gets pushed to the backburner because this anime is just downright fun! I could watch the episodes over and over because the characters are so well done and the dialogue and voice acting are top-notch and the relationship between Louise and Saito is just amazing. (Just watch the boat scene in episode 4 of Season 2 and you'll know what I mean. That kind of thing NEVER happens in romance anime, especially in the middle of the season, so I've watched it so many times, because I just loved it so much.)\\n\\n\r\nLouise is perhaps the most adorable character in the history of tsunderes, if not in all of anime. She hardly ever gets on your nerves like most tsundere types can from time to time, because in every episode you can see how vulnerable she is... how much she needs Saito. And unlike most tundere types, she breaks down quite easily in confessing what she doesn't want to: that she has feelings for him. That hits at the heart of what usually annoys most fans of romance: that it just takes too dark long for the characters to confess their love and that when it does happen, the anime is already concluding and we don't get to see any aftermath. Well, that's not the case with Zero. Louise and Saito confess early and often in Season 1 and after that, it's just more and more development, more and more physical contact that displays their feelings, and more and more love. It's actually amazing what a simple plot change can do when you do it right and let me tell you all: Zero no Tsukaima gets romance right!\\n\\n\r\nOther notables about this anime. The fanservice isn't the best, but its good. There's no nudity, but perhaps in this case, there's no need (although Louise naked would be nice, but that's just me *wink*). Louise's stuttering nervous voice is beyond adorable and I guarantee you'll fall in love with her the minute you hear it. Saito is actually pretty solid as a lead male in this genre and he surprises often. If I had to use one word to describe him, it would be &quot;realistic.&quot; Everything about him from his responses to his feelings is spot on and just makes sense. He brings balance to the anime.\\n\\n\r\nAnyways, overall, I would reccommend this to anyone who loves romance anime with strong harem theme, but isn't truly harem. I guarantee you won't find many pairings that matches the strength of Louise and Saito. From the looks of the last episode, it seems they probably aren't doing a Season 4, but luckily the last episode of Season 3 was magnificent.",
            "date": "2008-09-26T12:25:00+00:00",
            "helpful_count": 19,
            "mal_id": 8184,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85600.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mcjazzman32",
                "username": "mcjazzman32"
            },
            "url": "https://myanimelist.net/reviews.php?id=8184"
        },
        {
            "content": "&ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; is the third season of the &ldquo;Zero No Tsukaima&rdquo; anime, an adaptation of the currently still ongoing light novel series. As a third instalment, it is recommended to have seen the two previous seasons, else you may not fully comprehend some of the plot references or know the character's different pasts and backgrounds.\r\nThe first &ldquo;Zero No Tsukaima&rdquo; series was quite enjoyable, while not particularly extraordinary it offered us a nice romantic comedy with an ill-tempered flat-chested tsundere female lead who was one of the characters that would help launch the recent popular movement where plenty of series each seasonfeature that type of tsundere character. Many of those more well known tsundere female leading characters like Louise from &ldquo;Zero No Tsukaima&rdquo; are voiced by Rie Kugimiya, a good seiyuu who plays those roles well but one has to wonder if she's not being typecast too much.\\n\\n\r\nWhile I enjoyed &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; it definitely felt like the least good season of all three, an impression that is enhanced by the fact it seems more like some sort of intermission or a stepping stone meant to introduce new characters and new villains before embarking on a new large adventure.\\n\\n\r\nIn the previous season &ldquo;Zero No Tsukaima: Futatsuki No Kishi&rdquo; we were treated to some more entertaining and gripping character development between Saito and Louise. That season also offered interesting developments and concepts about Halkeginia, where the story takes place. \\n\\n\r\n&ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; starts roughly where &ldquo;Zero No Tsukaima: Futatsuki No Kishi&rdquo; left off, with our cast off on a search for a mysterious elf Saito and Guiche claim to have seen during the war with Albion. That elf turns out to be the kind, na&iuml;ve and ridiculously large breasted Tiffania. As one might expect Saito is easily enchanted by Tiffania's large bosom which leads to many jealous fits from Louise and oppai jokes abound in all of the following episodes.\\n\r\nWith Siesta already having served the role of the large breasted female who charms Saito with her bosom and makes Louise jealous with envy in the previous seasons, one could wonder if it was necessary to add another female character with an even larger chest to play on those typical jokes.\\n\r\nLuckily they did not make Tiffania into another girl that is smitten for Saito, while she clings to Saito, it's clear she sees him as a friend. While still enough to enrage Louise, it never comes off as a true romantic pairing. \\n\r\nAs the opening sequence of &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; suggest, this season does see another girl grow feelings for Saito, namely Tabitha.\\n\\n\r\nMost episodes of &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; we see Louise doubt herself, he lack of magical abilities and Saito's feelings for her.\\n\r\nArguably, this occurred in previous seasons as well, with several plots where Louise overcame her insecurities and was able to grow from there but by now it starts to become quite tiresome. Even after all that happened between them, Louise still doubts Saito's feelings and is unable to make her own emotions clear to him, which only worsens things between them. You could say Louise carries that burden of insecurity due to her inferior magical skills, but then you would also start to wonder how Saito can keep on coping with her like that. \\n\r\nFor the sake of decent storytelling they really should move on from there and focus on other characters their development or other traits in Saito and Louise. Personally I had increasing difficulty to really enjoy the series with Louise's incessant insecurities, it seems to drag on for too long and is becoming a bit much to bear.\\n\\n\r\nAnother new character we are introduced to is the happy-go-lucky blue haired Irukukwu, who is more than meets the eye. Alas she quickly comes off as mere fanservice to allow another moe large breasted girl to prance around in the series.\\n\\n\r\nPrincess Henrietta is featured less this season, nonetheless her character shows the most interesting and subtle evolutions. In the earlier episodes it is suggested she too may have romantic feelings for Saito, in part triggered due to the loneliness her position brings with it and her envy of Louise, who she sees as a strong, moral person that can take independent action by her own power, something she herself can not. That and some of the decisions she is forced to make, show a more realistic and three dimensional character in a series that else features rather generic thirteen in a dozen characters.\\n\\n\r\nMost of the episodes are spent on Tiffania joining the cast, a new villain and his minion that come after Louise, and another few adventures. While there are enough events and action, it still feels like some sort of  intermission chapter, meant to bridge the previous story and set up the next.\\n\\n\r\nAnimation by JC Staff throughout the series is decent, it never particularly excels or disappoints but is a solid average. More attention is spent on the cute girls and any fanservice scenes. The magic wielding action scenes in comparison, while still decent get less of a visual treat. \\n\r\nTypical for the series are the vividly colored and crisply rendered characters, full of bright hair colors and outfits.\\n\r\nThere seems to be less effort in rendering the medieval backgrounds and world of Halkeginia on screen, which is a shame as such adventure filled series taking place in other realms can always excel by really immersing the viewer in their unique world.\\n\\n\r\nThe soundtrack of &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; is fair, it boasts an upbeat techno-pop opening song and generic tunes that accompany the series well but never really accentuate or help elevate it. Most goes largely unnoticed although the opening track manages to get you fired up and enthusiastic about the episode to come.\\n\\n\r\nIn all I would mostly recommend &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; only to fans of the series and those who have seen the previous season and want to know what happens after those events. For the casual viewer, there are other series that would offer more laughs and fun. After this weak season, I ponder if I would pick up a fourth &ldquo;Zero No Tsukaima&rdquo; season if (or when) it were to come. \\n",
            "date": "2008-10-26T09:06:00+00:00",
            "helpful_count": 15,
            "mal_id": 8989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=8989"
        },
        {
            "content": "Zero no Tsukaima ~Princess no Rondo~, following the rather dissapointing second season, is shaping up to be a good season. The story follows the return of Saito after a fatal battle with knights and dragons and such. Saito, Louise, and Siesta go in search of the beatiful and busty elf Tiffania that revived a fallen wound-stricken Saito. Why they are searching for her....I can't quite remember lol.\r\nArt: The art style is great and really modern....but that's just it. Although it looks good there's nothing about it that really helps it stand apart from other modern day anime.\r\nSound: The sound is decent, although I'm not afan of the new intro and outro songs. Music successfully sets the mood throughout the show. My only real problem is....Louise. She's too damn squeaky and it grates my ears to hear her speak.\\n\\n\r\nCharacter: The characters are awesome and all develop well. Siesta, one of my favorite characters, has been granted a more important role in the story and I enjoy being able to see her more often. Tiffania, a newer character, has now become my number one favorite and just may be a new addtion to Saito's list of love interests. \\n\\n\r\nEnjoyment: The story is fun and new and just the right amount of comedy and fan-service flow throughout. It would probably be that much more enjoyable if seaon two had not left a rather bitter taste in my mouth. Of course, the problem I've always had with the show is Louise, in my opinion one of the most annoying anime characters ever invented. Unfortunatley for me she is a main character and love interest but hey, no everyone hates her.\\n",
            "date": "2008-08-03T19:21:00+00:00",
            "helpful_count": 14,
            "mal_id": 6807,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/50998.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hells_Pastry",
                "username": "Hells_Pastry"
            },
            "url": "https://myanimelist.net/reviews.php?id=6807"
        },
        {
            "content": "I was excited to see a third season was out when I had finally caught up with both seasons, but 10 episodes into Princess no Rondo and I'm not impressed.\r\nI wouldn't recommend watching this if you have not seen the 2 previous seasons, especially since the beginning of this season jumps right off from where Season 2 left off. \r\nStory - The third season definitely focuses a lot on the fan service for LouiseXSaito fans. =/ Most of the beginning episodes of the season are on that alone, however, it gets rather repetitive. Saito gets into a sticky situation that turns into an \"ecchi moment\",Louise catches him in the act, claims to &quot;never forgive him&quot;, and then she ends up forgiving him if not by the end of the episode, then by the next episode. By a third season, I'd wanna see more of a good plot than things we've seen in the past two seasons. Besides, we know Louise and Saito love each other, so why go through so many (as in like 3-4 episodes worth) inconvenient situations for them? When we finally get a plot going after many episodes of fan service, we learn that Tabitha is in some sort of predicament and Saito, Louise, and some other recurring characters put their social status on the line to rescue her, as she has helped them many times before. Can't say how well that turned out since the season hasn't finished airing, but it isn't bad so far. :P\\n\\n\r\nArt &amp; Sound - Neither of them are bad. We get another decent OP and ED song as well as some bright and colorful animation. :P\\n\\n\r\nEnjoyment - Even though I like Saito and Louise together, the fan service episodes got repetitive and boring. I hope that now that the plot has officially gotten underway, we'll end the season on a good note. ^_^\\n\\n\r\nOverall, Znt: PnR is a definite &quot;must watch&quot; if you're a fan of the Zero no Tsukaima series, but you probably won't be as impressed with this season as you might have been with its previous seasons.",
            "date": "2008-09-14T18:44:00+00:00",
            "helpful_count": 13,
            "mal_id": 7943,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56544.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Grimmm",
                "username": "Grimmm"
            },
            "url": "https://myanimelist.net/reviews.php?id=7943"
        },
        {
            "content": "Zero no Tsukaima is back for a third season with the so-called Princess no Rondo (translates to Rondo of the Princesses, for the curious ones) and I have to say that things haven’t changed too much. The first season was pretty good, the second one didn’t disappoint either (although season one was much better) and I’m somewhat happy to say that season three is pretty good too. “Pretty good” meaning that it won’t disappoint those who know what to expect – the fans of the series. Yes, Louise’s tsundere charm is still there and yes, Saito continues to get into seemingly perverse situations with othergirls, which makes Louise go gaga and punish him with her infamous whip.\\n\\n\r\nThe joke may be old, but it’s still as funny as it was the first day. Hell, maybe even funnier! How is that possible, you may ask yourself? Well, it seems that the writers really raised the bar and improved overall writing quality of the anime, especially the funny, more lighthearted situations. The jokes seem funnier than ever and there are tons of situations and scene that will make you laugh uncontrollably throughout the season. The main storyline isn’t as good as it used to be, but that really doesn’t matter too much anymore. Most of us who continue to watch this anime don’t watch it for its awesome plot, but rather for the interactions between characters.\\n\\n\r\nNot many new stuff are introduced in Princess no Rondo, but we do get some new characters and a continuation of the previous story (even if it develops rather slowly). The most important new character this season offers is Tifania, also known as the forest fairy which saved Saito’s life back in season two. There isn’t much to say about her without mentioning her enormous breasts (which are even bigger than Siesta’s – imagine that). Obviously she’ll somehow get attached to Saito, which will lead to Louise catching them during inappropriate and this-is-not-what-it-looks-like situations, and before you know it Saito will be punished by yet another creative and painful way by Louise. There are some other minor characters introduced as well, but they really aren’t worth mentioning. I’ll just add that we’ll get to meet a new villain, who seems to be the mastermind behind all these ‘evil’ operations. Not a very impressive character, but he gets the job done.\\n\\n\r\nThat’s about all I need to say about this season. It may not be the best in the series, but I consider it to be a fine improvement over the last season (Futatsuki no Kishi), which I consider to be more of a mess and totally out of balance (still good, though!). You’re definitely gonna enjoy this one if you’ve liked the other two seasons and even though there isn’t anything new to attract attention, it’s good enough to keep the story going and the entertainment pumping. Have fun watching Louise unleash her rage on Saito (and some of it on the enemies as well)!",
            "date": "2010-06-10T01:18:00+00:00",
            "helpful_count": 12,
            "mal_id": 26986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241809.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Andristian",
                "username": "Andristian"
            },
            "url": "https://myanimelist.net/reviews.php?id=26986"
        },
        {
            "content": "Zero no Tsukaima ~princess no Rondo~ is the third installment to the series where the story carries on from the previous 2 series, with saito and Louise now closer together but with more competition now from the other girls. The story reveals the presence of more than one void user and this is what the story revolves around.\r\nI must say that as someone who has watched the first 2 series of this show, it is a big letdown. The story does not develop very far until the last few episodes. And is very slow moving even for a 13 episode anime.While there is some progression,much of the story is actually left open ended, and i presume a fourth series will be produced to continue from this. Also i feel that many charcters have been altered or bent  in terms of personanlity in order to fit this comedy filled anime. Of course this is a romantic comedy so romance and comedy are both evident, but i think that the producers tried too hard this time, but there are some good moments still so it still passes.\\n\\n\r\nThe art was the same as the previous series with artwork leaning more to the cartoonic side to portray the comedy in this show. Nothing wrong with this area.\\n\\n\r\nSound was actually quite good compared to the first two series, the inserts were timed nicely to bring out the atmosphere of the different moments in the story. OP and ED songs were more lively and actually hints a comedy show.\\n\\n\r\nThe characters was another huge disappointment. As mentioned earlier, the characters have been altered here and there to the point that nearly all the girls go for Saito...it feels like this anime is becoming a harem more than romance. Louise is now some really over emotional girl who is quite dense(when you watch it you'll know what i mean) all the way through the show. Of course the characters were still as effective in portraying the comedy as the other two series had done but i felt no significance in the characters anymore. Depth was especially lacking in a lot of characters, i still give it a pass on the account of the comedy and romantic moments here and there in the show.\\n\\n\r\nOverall, If you have watched the first two series of the anime, don't expect anything better than the first two, it is a bid disappointment compared to them. The anime has become too emotional in some aspects and is clearly lacking in the romance genre as they have to create situations whereby louise gets jealous in order to keep up the love tension, they do this by altering the personality of some characters. Also the sheer number of characters has again increased which would explain the lack of depth in the characters. Hopefully, the fourth season would be something to look foward to...should there be one.",
            "date": "2008-09-27T02:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 8200,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=8200"
        },
        {
            "content": "For me the third season of Zero no Tsukaima wasn't anything special.\r\nI loved both season 1 and 2, but the season was disappointing.\r\nThe amount of girls that has joined Saito's harem has gotten out of controll. And it is frustrating watching.\r\nSomething that disappointed me most was that J.C. Staff seemed to be focusing on fan-service and the story didn't progress as much as it should done. And the story was very repetetiv.\r\nAnd the end of this season was far as saticfying as the two first season. If you love fan-service and some lesbian action you should enjoy this, but if you are like me thatonly gets embarrassed watching fan-service then this should be a problem.",
            "date": "2011-05-18T17:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 37111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pera",
                "username": "Pera"
            },
            "url": "https://myanimelist.net/reviews.php?id=37111"
        },
        {
            "content": "As a fan of Zero no Tsukaima , i'm quite dissapointed on the third season and that is Zero no Tsukaima: Princesses no Rondo . Why ? No improvement like the last one . Basically it's the same thing like the last two is . Other than the story , everything is the same . Onto the review yeahhh......\r\nStory:8\r\nAfter the event of Saito , who himself face more than 70 thousand army . After some 'gruesome' battle , he supposed to be dead but nahhh . He was save by a fairy . After that , his rune on his left hand dissapear and that'swhere the real journey begins . I won't tell much about the story plot because nothing is worth mentioning here .\\n\\n\r\nArt:8\\n\r\nLike the other two seasons , same arts and animations . Does have some 3D animation which is kind of cool . Have some beautiful arts . And yet again , the character design doesn't change like the last two . I really wish they improve this one .\\n\\n\r\nSound:9\\n\r\nSame voice actor and actress . Nothing that make me stop or anything . The OP and ED were enjoyable especially the OP . Have some thrill feelings like the last one .\\n\\n\r\nCharacter:8\\n\r\nSome characters here does have a background . Like the last two seasons , nothing change . There were a few new characters like Sheffield , the one that has a rune that has the same power as Saito rune except her rune is located on her forehead , Joseph , the one who kill Tabitha's father , Vitartial , the elf boy and many more . I can see that these new characters especially the female , have a lot in common with the old one . Huge , big , bodacious of boobs . Big is fine but if you make it THAT big , then it just look ridiculous man.....\\n\\n\r\nEnjoyment:7\\n\r\nI thought when i watch the third seasons of Zero no Tsukaima , i will get the same enjoyment as before . I was wrong . I didn't enjoy this one much . The comedy is still there , the romance are by far worse than twillight , harem is a must in this one , fan service paradise hooray which i hate . Nothing enjoyable on this one except that i was surprise that Colbert is still alive . That one did make me happy . I guess dead people is a NO on this anime....\\n\\n\r\nOverall:7\\n\r\nI am very dissapointed on the third seasons for Zero no Tsukaima . Because of this , i'm having trouble on trying to watch the fourth one . I can only hope that the fourth one has a surprise that can make me take my words back about this anime . If you like the other two seasons , try watching this . It is not everyone cup of tea .",
            "date": "2015-03-23T13:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 183144,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=183144"
        },
        {
            "content": "Well, this review is filled with haterism, I tell you in advance, I absolutely LOVE Zero no Tsukaima, but the anime adaptation is pure shit, it's an insult to the original work, the light novels written by Yamaguchi Nobura.\r\nI won't enter in much details, I'll only say that the story is invented, they're not adapt nothing of the novel, well, a bit maybe, but the whooooooooole anime of ZnT can be described in one word: Fanservice. Yeah, Fanservice, that and an invented story, and invented personality for the characters (Saito is my favourite main character! And in the anime he's just a fool boy! Inthe light novel he's a boy who fights for what he cares about, and have an adult mentality, in the anime he's just a fool teenager who loves to be surrounded by girls, how pathetic)\\n\\n\r\nI will only say you one thing, if you're interested in the plot of Zero no Tsukaima: Read the novels, you can find them easily in baka-tsuki or in nyaa torrent, no worries, they're translated into english so you can read it without problems. J.C Staff it's an unique studio yes, all the good works that they touch are inevitably turned into pure shit.\\n\\n\r\nHope this review had help you to DON'T WATCH THIS SERIES and to READ THE LIGHT NOVELS XD \\n\\n\r\nTo finish the review I'll say that Zero no Tsukaima is my favourte light novel and my favourite \"otaku thing\" to somehow call it, and yeah, i think that Yamaguchi Nobura is the people most closely to God for me XD. They are really good and if you had watch the Zero no tsukaima's \"anime\" and was deceived for his plot, don't worry, it's completely different of the light novels so read it anyway.\\n\\n\r\nGreetings.\\n\\n\r\nPS: Sorry for my bad grammar, i'm not an english native nor a native english speaker so maybe I have some grammatical misspellings.",
            "date": "2013-03-21T04:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 90325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984304.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/apau",
                "username": "apau"
            },
            "url": "https://myanimelist.net/reviews.php?id=90325"
        },
        {
            "content": "The following is true for all three seasons of Zero no Tsukaima. Overall there are over a million points to complain about, yet it was simply too much fun too watch xD. This review should be quite spoilerless, except for the very last line (which is a relatively small spoiler).\r\n==Story 7/10==\r\nThe Story is quite straightforward up the point of sometimes even being downright childish. At some points during the series this can slightly distract from the story itself, however there is an overall plot binding everything together enough for it be worth more than just a 6. Still I would definitely not advise anybody towatch it for any in-depth plot development.\\n\\n\r\n==Art 6/10==\\n\r\nThe art is fairly good in general, but at quite a number of points during the series cartoon like art is used (not sure about the name). Though this sometimes is enjoyable, I personally regarded this as being quite distracting at times. Still I would suggest you look for another review if you're concerned about the art.\\n\\n\r\n==Sound 7/10==\\n\r\n... no clue... (I don't care about music) ... It felt slightly repetitive at times, but all the music had one single theme binding it together, which IMHO is quite a good thing.\\n\\n\r\n==Character 7/10==\\n\r\nFirst of all the characters seem not to develop at all and the same situations are used over and over again. Despite of this one can not be stopped from loving and hating the characters at the same time. Loving because they are all adorable presented and hating them for reasons as messing up the main romantic relationship in the series and the main characters inability to stick with his choices. None the less the characters seem to develop over the course of all three seasons, so it wasn't as bad as I was fearing, though - if there is a fourth season - it would be cool to have a season without a fallback in character development, like the ones which happened at the beginning of the 2nd and 3rd season.\\n\\n\r\n==Enjoyment 10/10==\\n\r\nThe best aspect of this series xD, while watching I simply had to have a smile on my face. At various points the series actually crossed the border of what I find enjoyable as far as ecchi stuff goes and I have hated the series for the nearly-harem aspect. Despite the fact that I am a boy, I more than hated it how the main character was kissing every single girl in the series, but still I can't deny that I more than greatly enjoyed the rest. SPOILER!!!:(I wouldn't have been so positive if not for the main characters getting closer and closer in the end.)",
            "date": "2010-01-15T14:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 22417,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/62786.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GreatS",
                "username": "GreatS"
            },
            "url": "https://myanimelist.net/reviews.php?id=22417"
        },
        {
            "content": "Terrible tsundere and magical mishaps season 3. Have you ever had the feeling where you should have stopped a long time ago but you didn't and came crashing down from your peak? This is that crash.\r\nThe story for the first half seems to throw out the window what was learnt in previous seasons and go on its own trail for the good of doing nothing more than adding a new face to the already horrific harem. It does however have an evil working in the background that has been doing so for longer than the viewers realize and only now comes to light. More soeven though the play of this series, it seems the villain isn't played out to their full game yet so they just filled in the rest of the season with more quickly blown over conflicts, cleverly concealed in what seems like a multi episode situation.\\n\\n\r\nArt has more or less stayed same same as the previous season and thus not much can be noted on that front. However animation of the \"larger\" characters is a lot more fluid and carefree in their bounciness.\\n\\n\r\nIn the sound it lost the thrill of lengthy musical numbers and just became a lot of ambiance, whether that be guards chattering or a wagon strolling along. Which isn't bad, it shows they're doing something to fill is silence and for good reason too. The one scene of utter silence, when a character talks you can hear the background noise of the VA's lines and it's horrible!\\n\\n\r\nCharacter development went absolutely nowhere. The end result is exactly the same as it started with, only with more characters added to the harem of the main character that makes you want punch the creators over how thick you can make a person. Seriously if that was an award, this anime wins hands down every time.\\n\\n\r\nEnjoyment in the first 3 quarters of the season was dull. Same as season 1. However the last quarter seemed to up the ante a bit and get the viewer a little more interested. Even makes you laugh more than every episode prior. Then, much like the first season, when something interesting looks like it's going to happen, its all brushed over with in half an ep and you're left with a large sack of disappointment. Makes it worse when it's the last so called \"battle\" of the season.",
            "date": "2015-03-02T23:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 181591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=181591"
        },
        {
            "content": "There are many reasons to either love, or hate this ecchi - The realism, plot or anything like that, for that matter, isn't something you should expect to concentrate on. Even though i began to watch this ecchi for any OTHER reason than the plot, i got VERY caught up in it.. I'm currently watching Zero no Tsukaima F, the final season and i have no regrets in loving this show in almost every way. They've balanced ecchi and story in a very decent way and you can concentrate on both things at once. The character development also progresses a lot in this season, soenjoy!",
            "date": "2015-01-23T16:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 178826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437046.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DLDrillNB",
                "username": "DLDrillNB"
            },
            "url": "https://myanimelist.net/reviews.php?id=178826"
        },
        {
            "content": "Since this is sequel to the previous 2 season. Most of the people reading this should have watched the previous 2 season.\r\nWhat I wanted to say is - SCREW THE PERSON DOING THE GOD DAM ECCHI SCENE. HE MUST BE BURN IN HELL FOR @!%@%%@%.\r\n/rant\r\nSorry for the anger, but it must be done, in 1 way or another.\r\nSeason begins with quite an amazing episode which most will agree, with much pointless fillers as it continues, although I'm not complaining. The so-called plot begins around ep 7 where things actually start to get better, most of the time you will be see louise trying to gethold of her feeling towards saito, it was good, I admit. Smoothly and nicely until ep11, which I think the snag came. IT WAS HORRIBLE. How did J.C. manage to ruin something as smoothly as a slide into a terrain full of F**K-lots of spikes? Watching ep 11 makes me feel that I'm sliding through lots of spikes. They had done it. They had you excitied for 10 episode and ruin you with the 11th episode. Well done J.C. staff, you just made me lost 95% of my interest in Zero no Tsukaima.\\n\\n\r\nBut other than that screwed up episode, ZnT S3 is still considered enjoyable (as long as you don't think logically). Screw the plots cause theres never 1. Art is amazing, I admit, way more beter than the previous 2 seasons. I personally prefer this season's opening over the other 2, although not a great song, its nice to hear it every once a while (especially ep12 =P). Enjoyment is there, seriously, as long as you avoid 11 the value stays at 8 (but that would make 12 weird &gt;.&gt;).\\n\\n\r\nSo in overall, I'm giving this a 8. (Originally 7, thanks to last ep the god-dam saviour)\\n\\n\r\nScrew 4th season.",
            "date": "2008-09-23T10:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 8140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/87756.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/XydenicSky",
                "username": "XydenicSky"
            },
            "url": "https://myanimelist.net/reviews.php?id=8140"
        },
        {
            "content": "Full Disclosure: The first two Seasons of Zero no Tsukaima rank among my favorite anime of all time. But this season was a major letdown for me. First of all, the overall story and art maintain the same quality as the last two seasons, but somehow the characters and subplots have gotten considerably worse this season. \r\nWhat follows is my personal opinion.\r\nLet's start with the good: I  liked the inclusion of Joseph, the new villain, what he want isn't clear, but that's the fun part! I have no objections to Tiffania, I like her personality and it becomes soon clear that she has noromantic feelings towards Saito. Her interactions with Saito and Louise are funny and she's a generally likable character, if a bit generic. \\n\\n\r\nThe Bad: In all honesty, Louise's treatment of Saito is getting old at this point. it's an overused gag for this series, and is only made worse when Siesta is involved. \\n\r\nThat brings me to Siesta. I really liked Siesta originally, she was a great balance to Louise, but I though that her interest in Saito would fade as Saito and Louise got closer. Unfortunately, Siesta has morphed into one of the MOST ANNOYING characters I have ever seen. She actively tries to interfere with Louise and Saito, and actively prevents any further development in their relationship. Her actions can only be defined as annoying. When Tiffania was introduced, I genuinely hoped that she would replace this eyesore. \\n\r\nThis season also tries to hard to become a Harem anime, but wasn't too sure how to do that. What resulted was no romantic development for most of the season. One does not simply switch genres.",
            "date": "2015-06-19T15:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 190665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685233.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SmallTownN3rd",
                "username": "SmallTownN3rd"
            },
            "url": "https://myanimelist.net/reviews.php?id=190665"
        },
        {
            "content": "This is a story where there are two worlds,one is the world of normal humans and the other one's the world of magicians. A girl named Louise living in the world of magicians summoned a familiar (a pet) from the world of normal humans called Saito, by living together for long time they fell in love and bla bla bla...I think the some of this anime is copied from Harry Potter.\r\n If you watch this anime, all you will get is a short tempered girl like one from Taradora and a foolish boy. Their words didn't go any further, from season 1 to season 3,all you will see is Louise get jealous when she finds that Saito thinks about another girl. What a boring story -.-. Actually there's just one thing I loved about this anime that is the fairy Tiffany and her voice ( same voice as Himegami Aisa, Ichinose Kotomi ,Oshizu ) aaa...gomen gomen, I got a little carried away .\\n\\n\r\nAnyways, If you are suggested to watch this anime, say nai nai nai and instead go for Shakugan no Shana if by any chance you haven't watched it.. The story is a little bit more interesting than this one at least.\\n\\n\r\nI've just finished all the seasons hoping it will get me some interesting stories,unfortunately I got too bored that I want to delete all the episodes. Well, if you are a boring anime lover this one's just for u ^^.",
            "date": "2013-06-15T13:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 101171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2637835.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ukim",
                "username": "Ukim"
            },
            "url": "https://myanimelist.net/reviews.php?id=101171"
        }
    ],
    [
        {
            "content": "I don't care how well a formula works, when it's repeated three times with no changes, it screws over suspension of disbelief. Although enjoyable with some fist-pumping moments, the third season is definitely a letdown from the previous seasons and I hope they make a fourth season just to repent for the mess they created here. I will start out with the small stuff because I want to save the story until the end.\r\nArt is the same as the last two seasons, it's nicely rounded out, and for being a cute/ecchi anime, the fighting scenes are better than expected, giving it a score of 7.\r\nI'vealways really liked the Zero no Tsukaima soundtrack and music cues, so although nothing but the OP/ED changes, I will give it a 9.\\n\\n\r\nStory was weird - I mean, it's built around the characters' backgrounds, sure, and then we have the interesting development midway, but nothing is really fleshed out and the end of the season feels more like facing just another Robotnik boss after shoving Sonic through a million winding tubes in Hydrocity Zone. I wish the general war/story/etc could focus almost entirely on how it affects the characters because that's what ZnT is based around. This random plot in the third season doesn't really excite me at all and I'd rather endure the agonizing fanservice. This gets a 3.\\n\\n\r\nCharacters, right. So the main reason I did this review was the rant about the characters, so get ready.\\n\r\nI seriously don't get why the makers of ZnT think it's all right to pull the same old romantic comedy junk without trying to develop the MAIN CHARACTERS one single bit. Yes, you can list all the things they've 'been through', but in the end, they're in the SAME GODDAMN PHASE that they were in at the end of Season 1. It's like they're daring each other - \"are you willing to go this far for me?\" or \"you don't like me that much do you?\" I mean...really? Being a Tsundere is one thing, but having chronic amnesia every episode is another. I thought I could endure it for season 3, but the first ten minutes of the very first episode almost literally made me spit out what I was drinking at that time because the fight that Louise and Saito had would be LUDICROUS to anybody else that had gone through what they had at the end of the second season. How does a life-changing event NOT lead to character development? ZnT is like the opposite of Clannad in the fact that almost all of the characters are completely inelastic except for maybe Agnes/Henrietta/Tabitha.\\n\r\nIn summary, I hated the fact that after three seasons, the ZnT crew were still not up to the task of plotting out a realistic relationship of any degree. The only thing that keeps me from dropping the character score down to a 3 is the Henrietta/Tabitha development, which could go so many ways, so good for us, and the Colbert coolness factor, kicking the character score up to a 7.\\n\\n\r\nOverall, I still did enjoy it - ZnT is mainly the anime where you get some smiles from the awkward moments and \"aww\"s from the cute moments and perhaps little else. I say perhaps because Saito's harem has ridiculous potential to not only enhance the viewer's experience but even the plot, both relationship and general, which gave me motivation to keep watching this thing. But anyways, watch this if you're a fan of ZnT, pray for a 4th season, and keep that suspension of disbelief locked in that cupboard.",
            "date": "2011-01-18T08:39:00+00:00",
            "helpful_count": 71,
            "mal_id": 33853,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/421926.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/ymir233",
                "username": "ymir233"
            },
            "url": "https://myanimelist.net/reviews.php?id=33853"
        },
        {
            "content": "In contrast to the previous two seasons, which were somewhat enjoyable, the third season was the most disappointing of all for multiple reasons. It manages to start off well however there were many possibilities that were available but were infrequently explored which could've potentially made this season much better or so. Unlike the first season, the third season seemed to not focus on the plot as much. It seems as though there was an excessive amount of romance cliches which strongly detracted from the season, such as the overly emotional and volatile tsundere (ex : Louise zapping Saito as comic relief), ecchi fanservice (ex :hotsprings, nosebleeds, yuri, breasts). Though the storyline does bring along some good results that are decent to the viewers such as the highlight of Tabitha's storyline, development of henrietta's character and Louise's insecure side and Saito shows his chivalry side. In addition, with the introduction of new characters, each character has a unique personality. More often than not, Louise and Saito bring out romantic moments which bring out a refreshing experience to the audience. Saito accompanies latterly his incredibly and heart-warming feats of courage and caring devoted and engaged in singularly towards Louise, while Louise introspectively loves him so, she cannot express it properly and openly until there is more character development. \\n\\n\r\nOne of the best aspects of Zero no Tsukaima are the animations, the character designs are fairly decent visuals, and the illustrations successfully convey the character's expressions to the audience without a problem while adding onto the humorous moments. There is also a fair amount of detail in the background which would enlighten the audience respectively.\\n\\n\r\nThe opening and ending themes are fairly decent and manage to fit well and the bgm is also well-accustomed to the particular moments. The voice actors are consistent throughout the series as well with their voice acting.\\n\\n\r\nIn conclusion, Zero no Tsukaima ~Princesses no Rondo~ is an above average sequel to the series with some intriguing moments. It seemed to ignore the most compelling and intriguing aspects of the series, the storyline. It could have been possible to focus on the two main antagonists and the overall objective of the antagonists while filling in the plotholes instead or it could of spent more effort on the relationship of Saito and Louise. \\n\\n\r\nHopefully, the next season will end this cliffhanger.\\n\\n\r\nThough the enjoyability of this series is dependent on what exactly you are expecting.\\n",
            "date": "2008-11-30T12:08:00+00:00",
            "helpful_count": 50,
            "mal_id": 9968,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/questionmark_50.gif",
                "scores": {
                    "animation": 9,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 5
                },
                "url": "https://myanimelist.net/profile/Nequam",
                "username": "Nequam"
            },
            "url": "https://myanimelist.net/reviews.php?id=9968"
        },
        {
            "content": "Well I would like to state that I watched both season 1 and 2, and I liked it ALOT.\r\nStory: This is the part where I was disapointed in the most. When I think about what should I write in \"Story\", the first thing that comes in mind is \"What story? There's a story? Maybe I missed the episode where there was acually a STORY?\". This show turned from a 'top-noch' anime to 'yet another harem' anime. Not only story is laking, IQ has dropped wonders. Characters are unable to understand things that are PLAINLY OBVIOUS like some things with the elf and the wierd puprlegirl (I can't explain because it wil be a spoiler, but you must be one of those who said 'WELL IT HAS TO BE HER! FOR F#$K SAKE! ARE YOU BRAIN DEAD?!\")\\n\\n\r\nArt: As always,the art is truly outstanding. It was hard for me to believe, but they actually GOT BETTER than the second season, and I thought that was as good as the art can get.\\n\\n\r\nSound: Don't care much about the opening, HATE the ending, just me probebly (makes me think im watching Hentai when she starts moaning...). Other then that, not much different then any other show.\\n\\n\r\nCharacter: I'm a big boobs fan. I won't lie. But I think i'm speaking for all of us when I say, THERE'S A LIMIT. What that elf has is NOT boobs. It's a wierd tumor thing that groses me out. The maid comes back for more harresing (I don't get whats so good about it. I liked her better in the first season), and our hero seems to get some criminal expirience on raping (She said NO and he kept pushing her. I think he should be jailed). Other than that, it's pretty much the same as last season. Elf has a typical \"i'm weak and I need a strong man (specific guy who has nothing to do with strenght, just the hero so she wants to sleep with him) to protect me!\".\\n\\n\r\nEnjoyment: Not very much (as a 7 would state). Could have been ALOT better.\\n\\n\r\nOverall: I really think they need to shape up and start copying from the second season. If this season goes on like this, I will regret seeing it. (Sorry for the long stories I wrote there, just diden't want to say I don't like it and not explain why). 7 Is how much I would give this show if it keeps up like this, and thats only because I feel like I owe it something for the last 2 seasons. Get better, and I might even give it a 10 again. Worse, maybe I will drop it. Hope it will get better.",
            "date": "2008-08-12T11:44:00+00:00",
            "helpful_count": 31,
            "mal_id": 7062,
            "reviewer": {
                "episodes_seen": 5,
                "image_url": "https://cdn.myanimelist.net/images/userimages/46347.jpg",
                "scores": {
                    "animation": 10,
                    "character": 7,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/galluvton",
                "username": "galluvton"
            },
            "url": "https://myanimelist.net/reviews.php?id=7062"
        },
        {
            "content": "ZnT: Princess no Rondo\r\nThe worst season of all, this was just frustrating, i was just bored of Louise and Saito's act between eachother.\r\nStory\r\nThe story is almost the same, with the difference that they are looking for an elf that saved Saito from his death and revived him and because of this he lost the rune that tied him with Louise and because of this Louise starts to be more insecure than she was before and makes this so f**king annoying, is desperating and makes you being bored from their relationship and want them to end their s**t, it's like they hate each other even morein their love-hate attempt of comedy, there's a story more than that but this two ruined it and you don't care anymore, just a fine story here.\\n\\n\r\nArt & Sound\\n\r\nIt's the same as the 1st and 2nd season, there's no improvement but it was fine because it has the same quality from the last 2 seasons.\\n\\n\r\nCharacter\\n\r\nWorse than the other two previous seasons, it's the same, just focused on Louise and Saito and not developing them but even taking steps back from what they constructed in the last two, it's like they never loved each other, but in this one Kirche and Charlotte are very well developed in the way that we know more about them, i liked that and because of them this was saved from a worst score and just stays in fine.\\n\\n\r\nEnjoyment\\n\r\nThis season was painful to watch, i hated Louise and Saito relationship, even to a point that he should have stayed with Siesta or Tiffa or even Charlotte or Henrietta but it was fine because of Tiffa, Charlotte and Kirche and not to forget Siesta and the fanservice, so it was fine.",
            "date": "2015-08-07T15:01:00+00:00",
            "helpful_count": 26,
            "mal_id": 195454,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4739749.jpg",
                "scores": {
                    "animation": 6,
                    "character": 6,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ChucriBZ",
                "username": "ChucriBZ"
            },
            "url": "https://myanimelist.net/reviews.php?id=195454"
        },
        {
            "content": "I'd recommend this if you're new to harem anime and want a light-hearted story to go along with some fanservice and Saito-shenanigans. For the regular fans of harem animu, I'm sure you're already watching this...\r\nFor those of you who haven't seen it and are looking to see if you should pick it up this season -- There's a \"main\" plot and other stories to go along the usual fan-service and boy-beating (of course). But to be honest, I'm not sure it's worth it just for that.\r\nYou're watching it for the same reason as ALL of us: Louise & Saito... plus the other girls. You wantto see Saito (the main character) TRY to get Louise's love; You like seeing Louise kick Saito's ass in the castle, in the strip joint, in the restaurant, in school, in the dorms and everywhere else the animators care to  draw for us. And elftits. And panties.\\n\\n\r\nApparently, in the book, they've consumated the marriage already. So YES, he's taken her home and had consensual sex with her in the missionary position, with the lights off, at night. (f**kyeah!)\\n\\n\r\nBUT It's the 3rd season. Don't kid yourself; the story is not going to improve. It's gonna be the same crap over &amp; over. YOU KNOW THIS. It's not going to mature into anything more. As much as you're hoping it would get better, it's not.  So skip the denial stage already and just try to enjoy the show. \\n\\n\r\nAnyways, I'm gonna keep watching this show till it ends. So, continue watching this show with me. You bunch of masochists. (ONE OF US?)\\n\\n\r\nPS. Teh RIE",
            "date": "2008-07-24T00:58:00+00:00",
            "helpful_count": 25,
            "mal_id": 6545,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/60618.jpg",
                "scores": {
                    "animation": 5,
                    "character": 5,
                    "enjoyment": 7,
                    "overall": 5,
                    "sound": 9,
                    "story": 3
                },
                "url": "https://myanimelist.net/profile/futuresex",
                "username": "futuresex"
            },
            "url": "https://myanimelist.net/reviews.php?id=6545"
        },
        {
            "content": "Zero no Tsukaima is one of those rare romantic anime that actually allows the viewer some of the pleasures of romance that are rarely ever actually allowed in a series: actual physical contact. You see, most romance anime feature a boy and a girl and 24 episodes of them muddling through genre cliches and stuttering annoyances until finally, they get together in the end, and even then, only about 5% of the time, it ends in a kiss, which really blows my mind about romance anime in general, but that's another matter.\r\nNow, to be truthful, there's a lot that can be said against this show.The story is weak in itself, filled with more deux ex than can possibly be explained. It's almost like the creators just don't care about plot holes and rediculous assumptions. Not only that, but the original premise of Season 1 (where Louise is a magic student in a magical academy) has been completely abandoned. I think the academy showed up once or twice in Season 3 and the Professor showed up only in the last episode.\\n\\n\r\nHowever, somehow, all of the bad things that can be said about this show still gets pushed to the backburner because this anime is just downright fun! I could watch the episodes over and over because the characters are so well done and the dialogue and voice acting are top-notch and the relationship between Louise and Saito is just amazing. (Just watch the boat scene in episode 4 of Season 2 and you'll know what I mean. That kind of thing NEVER happens in romance anime, especially in the middle of the season, so I've watched it so many times, because I just loved it so much.)\\n\\n\r\nLouise is perhaps the most adorable character in the history of tsunderes, if not in all of anime. She hardly ever gets on your nerves like most tsundere types can from time to time, because in every episode you can see how vulnerable she is... how much she needs Saito. And unlike most tundere types, she breaks down quite easily in confessing what she doesn't want to: that she has feelings for him. That hits at the heart of what usually annoys most fans of romance: that it just takes too dark long for the characters to confess their love and that when it does happen, the anime is already concluding and we don't get to see any aftermath. Well, that's not the case with Zero. Louise and Saito confess early and often in Season 1 and after that, it's just more and more development, more and more physical contact that displays their feelings, and more and more love. It's actually amazing what a simple plot change can do when you do it right and let me tell you all: Zero no Tsukaima gets romance right!\\n\\n\r\nOther notables about this anime. The fanservice isn't the best, but its good. There's no nudity, but perhaps in this case, there's no need (although Louise naked would be nice, but that's just me *wink*). Louise's stuttering nervous voice is beyond adorable and I guarantee you'll fall in love with her the minute you hear it. Saito is actually pretty solid as a lead male in this genre and he surprises often. If I had to use one word to describe him, it would be &quot;realistic.&quot; Everything about him from his responses to his feelings is spot on and just makes sense. He brings balance to the anime.\\n\\n\r\nAnyways, overall, I would reccommend this to anyone who loves romance anime with strong harem theme, but isn't truly harem. I guarantee you won't find many pairings that matches the strength of Louise and Saito. From the looks of the last episode, it seems they probably aren't doing a Season 4, but luckily the last episode of Season 3 was magnificent.",
            "date": "2008-09-26T12:25:00+00:00",
            "helpful_count": 19,
            "mal_id": 8184,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/85600.jpg",
                "scores": {
                    "animation": 7,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 9,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/mcjazzman32",
                "username": "mcjazzman32"
            },
            "url": "https://myanimelist.net/reviews.php?id=8184"
        },
        {
            "content": "&ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; is the third season of the &ldquo;Zero No Tsukaima&rdquo; anime, an adaptation of the currently still ongoing light novel series. As a third instalment, it is recommended to have seen the two previous seasons, else you may not fully comprehend some of the plot references or know the character's different pasts and backgrounds.\r\nThe first &ldquo;Zero No Tsukaima&rdquo; series was quite enjoyable, while not particularly extraordinary it offered us a nice romantic comedy with an ill-tempered flat-chested tsundere female lead who was one of the characters that would help launch the recent popular movement where plenty of series each seasonfeature that type of tsundere character. Many of those more well known tsundere female leading characters like Louise from &ldquo;Zero No Tsukaima&rdquo; are voiced by Rie Kugimiya, a good seiyuu who plays those roles well but one has to wonder if she's not being typecast too much.\\n\\n\r\nWhile I enjoyed &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; it definitely felt like the least good season of all three, an impression that is enhanced by the fact it seems more like some sort of intermission or a stepping stone meant to introduce new characters and new villains before embarking on a new large adventure.\\n\\n\r\nIn the previous season &ldquo;Zero No Tsukaima: Futatsuki No Kishi&rdquo; we were treated to some more entertaining and gripping character development between Saito and Louise. That season also offered interesting developments and concepts about Halkeginia, where the story takes place. \\n\\n\r\n&ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; starts roughly where &ldquo;Zero No Tsukaima: Futatsuki No Kishi&rdquo; left off, with our cast off on a search for a mysterious elf Saito and Guiche claim to have seen during the war with Albion. That elf turns out to be the kind, na&iuml;ve and ridiculously large breasted Tiffania. As one might expect Saito is easily enchanted by Tiffania's large bosom which leads to many jealous fits from Louise and oppai jokes abound in all of the following episodes.\\n\r\nWith Siesta already having served the role of the large breasted female who charms Saito with her bosom and makes Louise jealous with envy in the previous seasons, one could wonder if it was necessary to add another female character with an even larger chest to play on those typical jokes.\\n\r\nLuckily they did not make Tiffania into another girl that is smitten for Saito, while she clings to Saito, it's clear she sees him as a friend. While still enough to enrage Louise, it never comes off as a true romantic pairing. \\n\r\nAs the opening sequence of &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; suggest, this season does see another girl grow feelings for Saito, namely Tabitha.\\n\\n\r\nMost episodes of &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; we see Louise doubt herself, he lack of magical abilities and Saito's feelings for her.\\n\r\nArguably, this occurred in previous seasons as well, with several plots where Louise overcame her insecurities and was able to grow from there but by now it starts to become quite tiresome. Even after all that happened between them, Louise still doubts Saito's feelings and is unable to make her own emotions clear to him, which only worsens things between them. You could say Louise carries that burden of insecurity due to her inferior magical skills, but then you would also start to wonder how Saito can keep on coping with her like that. \\n\r\nFor the sake of decent storytelling they really should move on from there and focus on other characters their development or other traits in Saito and Louise. Personally I had increasing difficulty to really enjoy the series with Louise's incessant insecurities, it seems to drag on for too long and is becoming a bit much to bear.\\n\\n\r\nAnother new character we are introduced to is the happy-go-lucky blue haired Irukukwu, who is more than meets the eye. Alas she quickly comes off as mere fanservice to allow another moe large breasted girl to prance around in the series.\\n\\n\r\nPrincess Henrietta is featured less this season, nonetheless her character shows the most interesting and subtle evolutions. In the earlier episodes it is suggested she too may have romantic feelings for Saito, in part triggered due to the loneliness her position brings with it and her envy of Louise, who she sees as a strong, moral person that can take independent action by her own power, something she herself can not. That and some of the decisions she is forced to make, show a more realistic and three dimensional character in a series that else features rather generic thirteen in a dozen characters.\\n\\n\r\nMost of the episodes are spent on Tiffania joining the cast, a new villain and his minion that come after Louise, and another few adventures. While there are enough events and action, it still feels like some sort of  intermission chapter, meant to bridge the previous story and set up the next.\\n\\n\r\nAnimation by JC Staff throughout the series is decent, it never particularly excels or disappoints but is a solid average. More attention is spent on the cute girls and any fanservice scenes. The magic wielding action scenes in comparison, while still decent get less of a visual treat. \\n\r\nTypical for the series are the vividly colored and crisply rendered characters, full of bright hair colors and outfits.\\n\r\nThere seems to be less effort in rendering the medieval backgrounds and world of Halkeginia on screen, which is a shame as such adventure filled series taking place in other realms can always excel by really immersing the viewer in their unique world.\\n\\n\r\nThe soundtrack of &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; is fair, it boasts an upbeat techno-pop opening song and generic tunes that accompany the series well but never really accentuate or help elevate it. Most goes largely unnoticed although the opening track manages to get you fired up and enthusiastic about the episode to come.\\n\\n\r\nIn all I would mostly recommend &ldquo;Zero No Tsukaima: Princess No Rondo&rdquo; only to fans of the series and those who have seen the previous season and want to know what happens after those events. For the casual viewer, there are other series that would offer more laughs and fun. After this weak season, I ponder if I would pick up a fourth &ldquo;Zero No Tsukaima&rdquo; season if (or when) it were to come. \\n",
            "date": "2008-10-26T09:06:00+00:00",
            "helpful_count": 15,
            "mal_id": 8989,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3488.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 6,
                    "sound": 7,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Smithy",
                "username": "Smithy"
            },
            "url": "https://myanimelist.net/reviews.php?id=8989"
        },
        {
            "content": "Zero no Tsukaima ~Princess no Rondo~, following the rather dissapointing second season, is shaping up to be a good season. The story follows the return of Saito after a fatal battle with knights and dragons and such. Saito, Louise, and Siesta go in search of the beatiful and busty elf Tiffania that revived a fallen wound-stricken Saito. Why they are searching for her....I can't quite remember lol.\r\nArt: The art style is great and really modern....but that's just it. Although it looks good there's nothing about it that really helps it stand apart from other modern day anime.\r\nSound: The sound is decent, although I'm not afan of the new intro and outro songs. Music successfully sets the mood throughout the show. My only real problem is....Louise. She's too damn squeaky and it grates my ears to hear her speak.\\n\\n\r\nCharacter: The characters are awesome and all develop well. Siesta, one of my favorite characters, has been granted a more important role in the story and I enjoy being able to see her more often. Tiffania, a newer character, has now become my number one favorite and just may be a new addtion to Saito's list of love interests. \\n\\n\r\nEnjoyment: The story is fun and new and just the right amount of comedy and fan-service flow throughout. It would probably be that much more enjoyable if seaon two had not left a rather bitter taste in my mouth. Of course, the problem I've always had with the show is Louise, in my opinion one of the most annoying anime characters ever invented. Unfortunatley for me she is a main character and love interest but hey, no everyone hates her.\\n",
            "date": "2008-08-03T19:21:00+00:00",
            "helpful_count": 14,
            "mal_id": 6807,
            "reviewer": {
                "episodes_seen": 4,
                "image_url": "https://cdn.myanimelist.net/images/userimages/50998.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 8,
                    "overall": 9,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/Hells_Pastry",
                "username": "Hells_Pastry"
            },
            "url": "https://myanimelist.net/reviews.php?id=6807"
        },
        {
            "content": "I was excited to see a third season was out when I had finally caught up with both seasons, but 10 episodes into Princess no Rondo and I'm not impressed.\r\nI wouldn't recommend watching this if you have not seen the 2 previous seasons, especially since the beginning of this season jumps right off from where Season 2 left off. \r\nStory - The third season definitely focuses a lot on the fan service for LouiseXSaito fans. =/ Most of the beginning episodes of the season are on that alone, however, it gets rather repetitive. Saito gets into a sticky situation that turns into an \"ecchi moment\",Louise catches him in the act, claims to &quot;never forgive him&quot;, and then she ends up forgiving him if not by the end of the episode, then by the next episode. By a third season, I'd wanna see more of a good plot than things we've seen in the past two seasons. Besides, we know Louise and Saito love each other, so why go through so many (as in like 3-4 episodes worth) inconvenient situations for them? When we finally get a plot going after many episodes of fan service, we learn that Tabitha is in some sort of predicament and Saito, Louise, and some other recurring characters put their social status on the line to rescue her, as she has helped them many times before. Can't say how well that turned out since the season hasn't finished airing, but it isn't bad so far. :P\\n\\n\r\nArt &amp; Sound - Neither of them are bad. We get another decent OP and ED song as well as some bright and colorful animation. :P\\n\\n\r\nEnjoyment - Even though I like Saito and Louise together, the fan service episodes got repetitive and boring. I hope that now that the plot has officially gotten underway, we'll end the season on a good note. ^_^\\n\\n\r\nOverall, Znt: PnR is a definite &quot;must watch&quot; if you're a fan of the Zero no Tsukaima series, but you probably won't be as impressed with this season as you might have been with its previous seasons.",
            "date": "2008-09-14T18:44:00+00:00",
            "helpful_count": 13,
            "mal_id": 7943,
            "reviewer": {
                "episodes_seen": 10,
                "image_url": "https://cdn.myanimelist.net/images/userimages/56544.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 7,
                    "sound": 9,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Grimmm",
                "username": "Grimmm"
            },
            "url": "https://myanimelist.net/reviews.php?id=7943"
        },
        {
            "content": "Zero no Tsukaima is back for a third season with the so-called Princess no Rondo (translates to Rondo of the Princesses, for the curious ones) and I have to say that things haven’t changed too much. The first season was pretty good, the second one didn’t disappoint either (although season one was much better) and I’m somewhat happy to say that season three is pretty good too. “Pretty good” meaning that it won’t disappoint those who know what to expect – the fans of the series. Yes, Louise’s tsundere charm is still there and yes, Saito continues to get into seemingly perverse situations with othergirls, which makes Louise go gaga and punish him with her infamous whip.\\n\\n\r\nThe joke may be old, but it’s still as funny as it was the first day. Hell, maybe even funnier! How is that possible, you may ask yourself? Well, it seems that the writers really raised the bar and improved overall writing quality of the anime, especially the funny, more lighthearted situations. The jokes seem funnier than ever and there are tons of situations and scene that will make you laugh uncontrollably throughout the season. The main storyline isn’t as good as it used to be, but that really doesn’t matter too much anymore. Most of us who continue to watch this anime don’t watch it for its awesome plot, but rather for the interactions between characters.\\n\\n\r\nNot many new stuff are introduced in Princess no Rondo, but we do get some new characters and a continuation of the previous story (even if it develops rather slowly). The most important new character this season offers is Tifania, also known as the forest fairy which saved Saito’s life back in season two. There isn’t much to say about her without mentioning her enormous breasts (which are even bigger than Siesta’s – imagine that). Obviously she’ll somehow get attached to Saito, which will lead to Louise catching them during inappropriate and this-is-not-what-it-looks-like situations, and before you know it Saito will be punished by yet another creative and painful way by Louise. There are some other minor characters introduced as well, but they really aren’t worth mentioning. I’ll just add that we’ll get to meet a new villain, who seems to be the mastermind behind all these ‘evil’ operations. Not a very impressive character, but he gets the job done.\\n\\n\r\nThat’s about all I need to say about this season. It may not be the best in the series, but I consider it to be a fine improvement over the last season (Futatsuki no Kishi), which I consider to be more of a mess and totally out of balance (still good, though!). You’re definitely gonna enjoy this one if you’ve liked the other two seasons and even though there isn’t anything new to attract attention, it’s good enough to keep the story going and the entertainment pumping. Have fun watching Louise unleash her rage on Saito (and some of it on the enemies as well)!",
            "date": "2010-06-10T01:18:00+00:00",
            "helpful_count": 12,
            "mal_id": 26986,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/241809.jpg",
                "scores": {
                    "animation": 0,
                    "character": 0,
                    "enjoyment": 0,
                    "overall": 7,
                    "sound": 0,
                    "story": 0
                },
                "url": "https://myanimelist.net/profile/Andristian",
                "username": "Andristian"
            },
            "url": "https://myanimelist.net/reviews.php?id=26986"
        },
        {
            "content": "Zero no Tsukaima ~princess no Rondo~ is the third installment to the series where the story carries on from the previous 2 series, with saito and Louise now closer together but with more competition now from the other girls. The story reveals the presence of more than one void user and this is what the story revolves around.\r\nI must say that as someone who has watched the first 2 series of this show, it is a big letdown. The story does not develop very far until the last few episodes. And is very slow moving even for a 13 episode anime.While there is some progression,much of the story is actually left open ended, and i presume a fourth series will be produced to continue from this. Also i feel that many charcters have been altered or bent  in terms of personanlity in order to fit this comedy filled anime. Of course this is a romantic comedy so romance and comedy are both evident, but i think that the producers tried too hard this time, but there are some good moments still so it still passes.\\n\\n\r\nThe art was the same as the previous series with artwork leaning more to the cartoonic side to portray the comedy in this show. Nothing wrong with this area.\\n\\n\r\nSound was actually quite good compared to the first two series, the inserts were timed nicely to bring out the atmosphere of the different moments in the story. OP and ED songs were more lively and actually hints a comedy show.\\n\\n\r\nThe characters was another huge disappointment. As mentioned earlier, the characters have been altered here and there to the point that nearly all the girls go for Saito...it feels like this anime is becoming a harem more than romance. Louise is now some really over emotional girl who is quite dense(when you watch it you'll know what i mean) all the way through the show. Of course the characters were still as effective in portraying the comedy as the other two series had done but i felt no significance in the characters anymore. Depth was especially lacking in a lot of characters, i still give it a pass on the account of the comedy and romantic moments here and there in the show.\\n\\n\r\nOverall, If you have watched the first two series of the anime, don't expect anything better than the first two, it is a bid disappointment compared to them. The anime has become too emotional in some aspects and is clearly lacking in the romance genre as they have to create situations whereby louise gets jealous in order to keep up the love tension, they do this by altering the personality of some characters. Also the sheer number of characters has again increased which would explain the lack of depth in the characters. Hopefully, the fourth season would be something to look foward to...should there be one.",
            "date": "2008-09-27T02:01:00+00:00",
            "helpful_count": 6,
            "mal_id": 8200,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/65596.jpg",
                "scores": {
                    "animation": 8,
                    "character": 6,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 8,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/ethann",
                "username": "ethann"
            },
            "url": "https://myanimelist.net/reviews.php?id=8200"
        },
        {
            "content": "For me the third season of Zero no Tsukaima wasn't anything special.\r\nI loved both season 1 and 2, but the season was disappointing.\r\nThe amount of girls that has joined Saito's harem has gotten out of controll. And it is frustrating watching.\r\nSomething that disappointed me most was that J.C. Staff seemed to be focusing on fan-service and the story didn't progress as much as it should done. And the story was very repetetiv.\r\nAnd the end of this season was far as saticfying as the two first season. If you love fan-service and some lesbian action you should enjoy this, but if you are like me thatonly gets embarrassed watching fan-service then this should be a problem.",
            "date": "2011-05-18T17:53:00+00:00",
            "helpful_count": 5,
            "mal_id": 37111,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/441723.jpg",
                "scores": {
                    "animation": 6,
                    "character": 8,
                    "enjoyment": 6,
                    "overall": 6,
                    "sound": 6,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Pera",
                "username": "Pera"
            },
            "url": "https://myanimelist.net/reviews.php?id=37111"
        },
        {
            "content": "As a fan of Zero no Tsukaima , i'm quite dissapointed on the third season and that is Zero no Tsukaima: Princesses no Rondo . Why ? No improvement like the last one . Basically it's the same thing like the last two is . Other than the story , everything is the same . Onto the review yeahhh......\r\nStory:8\r\nAfter the event of Saito , who himself face more than 70 thousand army . After some 'gruesome' battle , he supposed to be dead but nahhh . He was save by a fairy . After that , his rune on his left hand dissapear and that'swhere the real journey begins . I won't tell much about the story plot because nothing is worth mentioning here .\\n\\n\r\nArt:8\\n\r\nLike the other two seasons , same arts and animations . Does have some 3D animation which is kind of cool . Have some beautiful arts . And yet again , the character design doesn't change like the last two . I really wish they improve this one .\\n\\n\r\nSound:9\\n\r\nSame voice actor and actress . Nothing that make me stop or anything . The OP and ED were enjoyable especially the OP . Have some thrill feelings like the last one .\\n\\n\r\nCharacter:8\\n\r\nSome characters here does have a background . Like the last two seasons , nothing change . There were a few new characters like Sheffield , the one that has a rune that has the same power as Saito rune except her rune is located on her forehead , Joseph , the one who kill Tabitha's father , Vitartial , the elf boy and many more . I can see that these new characters especially the female , have a lot in common with the old one . Huge , big , bodacious of boobs . Big is fine but if you make it THAT big , then it just look ridiculous man.....\\n\\n\r\nEnjoyment:7\\n\r\nI thought when i watch the third seasons of Zero no Tsukaima , i will get the same enjoyment as before . I was wrong . I didn't enjoy this one much . The comedy is still there , the romance are by far worse than twillight , harem is a must in this one , fan service paradise hooray which i hate . Nothing enjoyable on this one except that i was surprise that Colbert is still alive . That one did make me happy . I guess dead people is a NO on this anime....\\n\\n\r\nOverall:7\\n\r\nI am very dissapointed on the third seasons for Zero no Tsukaima . Because of this , i'm having trouble on trying to watch the fourth one . I can only hope that the fourth one has a surprise that can make me take my words back about this anime . If you like the other two seasons , try watching this . It is not everyone cup of tea .",
            "date": "2015-03-23T13:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 183144,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4425611.jpg",
                "scores": {
                    "animation": 8,
                    "character": 8,
                    "enjoyment": 7,
                    "overall": 7,
                    "sound": 9,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/ToshibaKenichi",
                "username": "ToshibaKenichi"
            },
            "url": "https://myanimelist.net/reviews.php?id=183144"
        },
        {
            "content": "Well, this review is filled with haterism, I tell you in advance, I absolutely LOVE Zero no Tsukaima, but the anime adaptation is pure shit, it's an insult to the original work, the light novels written by Yamaguchi Nobura.\r\nI won't enter in much details, I'll only say that the story is invented, they're not adapt nothing of the novel, well, a bit maybe, but the whooooooooole anime of ZnT can be described in one word: Fanservice. Yeah, Fanservice, that and an invented story, and invented personality for the characters (Saito is my favourite main character! And in the anime he's just a fool boy! Inthe light novel he's a boy who fights for what he cares about, and have an adult mentality, in the anime he's just a fool teenager who loves to be surrounded by girls, how pathetic)\\n\\n\r\nI will only say you one thing, if you're interested in the plot of Zero no Tsukaima: Read the novels, you can find them easily in baka-tsuki or in nyaa torrent, no worries, they're translated into english so you can read it without problems. J.C Staff it's an unique studio yes, all the good works that they touch are inevitably turned into pure shit.\\n\\n\r\nHope this review had help you to DON'T WATCH THIS SERIES and to READ THE LIGHT NOVELS XD \\n\\n\r\nTo finish the review I'll say that Zero no Tsukaima is my favourte light novel and my favourite \"otaku thing\" to somehow call it, and yeah, i think that Yamaguchi Nobura is the people most closely to God for me XD. They are really good and if you had watch the Zero no tsukaima's \"anime\" and was deceived for his plot, don't worry, it's completely different of the light novels so read it anyway.\\n\\n\r\nGreetings.\\n\\n\r\nPS: Sorry for my bad grammar, i'm not an english native nor a native english speaker so maybe I have some grammatical misspellings.",
            "date": "2013-03-21T04:06:00+00:00",
            "helpful_count": 4,
            "mal_id": 90325,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1984304.jpg",
                "scores": {
                    "animation": 1,
                    "character": 1,
                    "enjoyment": 1,
                    "overall": 1,
                    "sound": 2,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/apau",
                "username": "apau"
            },
            "url": "https://myanimelist.net/reviews.php?id=90325"
        },
        {
            "content": "The following is true for all three seasons of Zero no Tsukaima. Overall there are over a million points to complain about, yet it was simply too much fun too watch xD. This review should be quite spoilerless, except for the very last line (which is a relatively small spoiler).\r\n==Story 7/10==\r\nThe Story is quite straightforward up the point of sometimes even being downright childish. At some points during the series this can slightly distract from the story itself, however there is an overall plot binding everything together enough for it be worth more than just a 6. Still I would definitely not advise anybody towatch it for any in-depth plot development.\\n\\n\r\n==Art 6/10==\\n\r\nThe art is fairly good in general, but at quite a number of points during the series cartoon like art is used (not sure about the name). Though this sometimes is enjoyable, I personally regarded this as being quite distracting at times. Still I would suggest you look for another review if you're concerned about the art.\\n\\n\r\n==Sound 7/10==\\n\r\n... no clue... (I don't care about music) ... It felt slightly repetitive at times, but all the music had one single theme binding it together, which IMHO is quite a good thing.\\n\\n\r\n==Character 7/10==\\n\r\nFirst of all the characters seem not to develop at all and the same situations are used over and over again. Despite of this one can not be stopped from loving and hating the characters at the same time. Loving because they are all adorable presented and hating them for reasons as messing up the main romantic relationship in the series and the main characters inability to stick with his choices. None the less the characters seem to develop over the course of all three seasons, so it wasn't as bad as I was fearing, though - if there is a fourth season - it would be cool to have a season without a fallback in character development, like the ones which happened at the beginning of the 2nd and 3rd season.\\n\\n\r\n==Enjoyment 10/10==\\n\r\nThe best aspect of this series xD, while watching I simply had to have a smile on my face. At various points the series actually crossed the border of what I find enjoyable as far as ecchi stuff goes and I have hated the series for the nearly-harem aspect. Despite the fact that I am a boy, I more than hated it how the main character was kissing every single girl in the series, but still I can't deny that I more than greatly enjoyed the rest. SPOILER!!!:(I wouldn't have been so positive if not for the main characters getting closer and closer in the end.)",
            "date": "2010-01-15T14:47:00+00:00",
            "helpful_count": 4,
            "mal_id": 22417,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/62786.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 10,
                    "overall": 8,
                    "sound": 7,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/GreatS",
                "username": "GreatS"
            },
            "url": "https://myanimelist.net/reviews.php?id=22417"
        },
        {
            "content": "Terrible tsundere and magical mishaps season 3. Have you ever had the feeling where you should have stopped a long time ago but you didn't and came crashing down from your peak? This is that crash.\r\nThe story for the first half seems to throw out the window what was learnt in previous seasons and go on its own trail for the good of doing nothing more than adding a new face to the already horrific harem. It does however have an evil working in the background that has been doing so for longer than the viewers realize and only now comes to light. More soeven though the play of this series, it seems the villain isn't played out to their full game yet so they just filled in the rest of the season with more quickly blown over conflicts, cleverly concealed in what seems like a multi episode situation.\\n\\n\r\nArt has more or less stayed same same as the previous season and thus not much can be noted on that front. However animation of the \"larger\" characters is a lot more fluid and carefree in their bounciness.\\n\\n\r\nIn the sound it lost the thrill of lengthy musical numbers and just became a lot of ambiance, whether that be guards chattering or a wagon strolling along. Which isn't bad, it shows they're doing something to fill is silence and for good reason too. The one scene of utter silence, when a character talks you can hear the background noise of the VA's lines and it's horrible!\\n\\n\r\nCharacter development went absolutely nowhere. The end result is exactly the same as it started with, only with more characters added to the harem of the main character that makes you want punch the creators over how thick you can make a person. Seriously if that was an award, this anime wins hands down every time.\\n\\n\r\nEnjoyment in the first 3 quarters of the season was dull. Same as season 1. However the last quarter seemed to up the ante a bit and get the viewer a little more interested. Even makes you laugh more than every episode prior. Then, much like the first season, when something interesting looks like it's going to happen, its all brushed over with in half an ep and you're left with a large sack of disappointment. Makes it worse when it's the last so called \"battle\" of the season.",
            "date": "2015-03-02T23:50:00+00:00",
            "helpful_count": 3,
            "mal_id": 181591,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3455919.jpg",
                "scores": {
                    "animation": 6,
                    "character": 5,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 3,
                    "story": 6
                },
                "url": "https://myanimelist.net/profile/Temere",
                "username": "Temere"
            },
            "url": "https://myanimelist.net/reviews.php?id=181591"
        },
        {
            "content": "There are many reasons to either love, or hate this ecchi - The realism, plot or anything like that, for that matter, isn't something you should expect to concentrate on. Even though i began to watch this ecchi for any OTHER reason than the plot, i got VERY caught up in it.. I'm currently watching Zero no Tsukaima F, the final season and i have no regrets in loving this show in almost every way. They've balanced ecchi and story in a very decent way and you can concentrate on both things at once. The character development also progresses a lot in this season, soenjoy!",
            "date": "2015-01-23T16:59:00+00:00",
            "helpful_count": 3,
            "mal_id": 178826,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4437046.jpg",
                "scores": {
                    "animation": 9,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 9,
                    "sound": 8,
                    "story": 9
                },
                "url": "https://myanimelist.net/profile/DLDrillNB",
                "username": "DLDrillNB"
            },
            "url": "https://myanimelist.net/reviews.php?id=178826"
        },
        {
            "content": "Since this is sequel to the previous 2 season. Most of the people reading this should have watched the previous 2 season.\r\nWhat I wanted to say is - SCREW THE PERSON DOING THE GOD DAM ECCHI SCENE. HE MUST BE BURN IN HELL FOR @!%@%%@%.\r\n/rant\r\nSorry for the anger, but it must be done, in 1 way or another.\r\nSeason begins with quite an amazing episode which most will agree, with much pointless fillers as it continues, although I'm not complaining. The so-called plot begins around ep 7 where things actually start to get better, most of the time you will be see louise trying to gethold of her feeling towards saito, it was good, I admit. Smoothly and nicely until ep11, which I think the snag came. IT WAS HORRIBLE. How did J.C. manage to ruin something as smoothly as a slide into a terrain full of F**K-lots of spikes? Watching ep 11 makes me feel that I'm sliding through lots of spikes. They had done it. They had you excitied for 10 episode and ruin you with the 11th episode. Well done J.C. staff, you just made me lost 95% of my interest in Zero no Tsukaima.\\n\\n\r\nBut other than that screwed up episode, ZnT S3 is still considered enjoyable (as long as you don't think logically). Screw the plots cause theres never 1. Art is amazing, I admit, way more beter than the previous 2 seasons. I personally prefer this season's opening over the other 2, although not a great song, its nice to hear it every once a while (especially ep12 =P). Enjoyment is there, seriously, as long as you avoid 11 the value stays at 8 (but that would make 12 weird &gt;.&gt;).\\n\\n\r\nSo in overall, I'm giving this a 8. (Originally 7, thanks to last ep the god-dam saviour)\\n\\n\r\nScrew 4th season.",
            "date": "2008-09-23T10:40:00+00:00",
            "helpful_count": 3,
            "mal_id": 8140,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/87756.jpg",
                "scores": {
                    "animation": 9,
                    "character": 8,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 8,
                    "story": 1
                },
                "url": "https://myanimelist.net/profile/XydenicSky",
                "username": "XydenicSky"
            },
            "url": "https://myanimelist.net/reviews.php?id=8140"
        },
        {
            "content": "Full Disclosure: The first two Seasons of Zero no Tsukaima rank among my favorite anime of all time. But this season was a major letdown for me. First of all, the overall story and art maintain the same quality as the last two seasons, but somehow the characters and subplots have gotten considerably worse this season. \r\nWhat follows is my personal opinion.\r\nLet's start with the good: I  liked the inclusion of Joseph, the new villain, what he want isn't clear, but that's the fun part! I have no objections to Tiffania, I like her personality and it becomes soon clear that she has noromantic feelings towards Saito. Her interactions with Saito and Louise are funny and she's a generally likable character, if a bit generic. \\n\\n\r\nThe Bad: In all honesty, Louise's treatment of Saito is getting old at this point. it's an overused gag for this series, and is only made worse when Siesta is involved. \\n\r\nThat brings me to Siesta. I really liked Siesta originally, she was a great balance to Louise, but I though that her interest in Saito would fade as Saito and Louise got closer. Unfortunately, Siesta has morphed into one of the MOST ANNOYING characters I have ever seen. She actively tries to interfere with Louise and Saito, and actively prevents any further development in their relationship. Her actions can only be defined as annoying. When Tiffania was introduced, I genuinely hoped that she would replace this eyesore. \\n\r\nThis season also tries to hard to become a Harem anime, but wasn't too sure how to do that. What resulted was no romantic development for most of the season. One does not simply switch genres.",
            "date": "2015-06-19T15:15:00+00:00",
            "helpful_count": 3,
            "mal_id": 190665,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/4685233.jpg",
                "scores": {
                    "animation": 7,
                    "character": 6,
                    "enjoyment": 5,
                    "overall": 5,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/SmallTownN3rd",
                "username": "SmallTownN3rd"
            },
            "url": "https://myanimelist.net/reviews.php?id=190665"
        },
        {
            "content": "This is a story where there are two worlds,one is the world of normal humans and the other one's the world of magicians. A girl named Louise living in the world of magicians summoned a familiar (a pet) from the world of normal humans called Saito, by living together for long time they fell in love and bla bla bla...I think the some of this anime is copied from Harry Potter.\r\n If you watch this anime, all you will get is a short tempered girl like one from Taradora and a foolish boy. Their words didn't go any further, from season 1 to season 3,all you will see is Louise get jealous when she finds that Saito thinks about another girl. What a boring story -.-. Actually there's just one thing I loved about this anime that is the fairy Tiffany and her voice ( same voice as Himegami Aisa, Ichinose Kotomi ,Oshizu ) aaa...gomen gomen, I got a little carried away .\\n\\n\r\nAnyways, If you are suggested to watch this anime, say nai nai nai and instead go for Shakugan no Shana if by any chance you haven't watched it.. The story is a little bit more interesting than this one at least.\\n\\n\r\nI've just finished all the seasons hoping it will get me some interesting stories,unfortunately I got too bored that I want to delete all the episodes. Well, if you are a boring anime lover this one's just for u ^^.",
            "date": "2013-06-15T13:53:00+00:00",
            "helpful_count": 2,
            "mal_id": 101171,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/2637835.jpg",
                "scores": {
                    "animation": 6,
                    "character": 7,
                    "enjoyment": 4,
                    "overall": 5,
                    "sound": 7,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/Ukim",
                "username": "Ukim"
            },
            "url": "https://myanimelist.net/reviews.php?id=101171"
        }
    ],
    [
        {
            "content": "Harem oriented anime have always been about a bunch of girls getting off on either one guy or few of them. The formula still remains same in Zero no Tsukaima series with also some action packed scenario. \r\nWhat I liked about Zero no Tsukaima is the light-hearted mood it took, lots of indecent jokes and just the hilarity of its own stupidity. However, the third season of the series went just too far ... with everything.\r\n[STORY] 4 \r\n- Probably the worst story in the series is really explained in only later 4-5 episodes whilst the others are mainly fillers or some pretty unnecessary stuff. Thething about the story is that ... it's plain ridiculous, predictable and pretty annoying at the times. I won't talk much about it in fear that I might spoil something, but regardless, if you're a guy/girl who wants at least a decent story in an anime, run away from here. Seriously, run. \\n\\n\r\n[ART] 6\\n\\n\r\n- Art is actually fairly solid; it's the same as in previous seasons, but it does the job. Being probably the best aspect of the series, the fights are decently animated, the characters are different from one another, there are some beautiful sceneries and stuff like that. All in all, fairly decent. \\n\\n\r\n[SOUND] 5\\n\\n\r\n- Even though the opening and ending songs aren't much of my taste, they were quite good actually. Aside from that, there are some great background music which sometimes hits the mood and ... well sometimes it just fails. However, I found that the voices of the characters were immensely annoying (especially the one from Louise). I don't know whether it's just me or not, but it's like that.\\n\\n\r\n[CHARACTERS] 4\\n\\n\r\n- I'm really not sure what kind of characters to expect when you embark yourself upon a journey for watching harem anime, but this show fails a lot in that aspect. The relationship between Saito and Louise was all cute in the season 1, bearable in season 3, but it's plain RETARDED in season 3. It's obvious that they're just dragging the series out to their maximum proportions, but that brings such failures to the light that you can't overlook them even if you want to. The characters might appear even worse than they are due to the story they're set in. Saito's harem keeps growing even though it shouldn't, he still likes big breasts, kissing every single girl he can, but, somehow, he still loves Louise. There's a silver lining called \"sense\" when creating a harem story and characters, but this Anime simply forgot that. Yes, most of the luvy-duvy situations are plain stupid and senseless. And those \"cute moments\" where we finally expect some kind of closure are just a waste of time for my eyes. They're on it like 2s and then someone comes knocking on without any apparent reason. I really wanted to like the characters, I really did, because in previous seasons they were quite fun to watch. However, all that “servant-master” thing had worn out even during the second season. It’s just plain stupid in this one …\\n\r\nDon’t get me wrong; there are some likeable characters. There are few great developments regarding other characters, but the focus of the show, Saito and Louise is just embarrassing (and not as in “embarrassing to watch because of the awkwardness” … just embarrassing). \\n\r\n\tI doubt I’ll force myself to go through the final season anytime soon because it’ll take some time to wash things out from this season.\\n\\n\r\n[ENJOYMENT] 4\\n\\n\r\n-You’d think that anyone could enjoy harem anime simply because it’s funny, right? Well, you’re wrong. Compared to the first 2 seasons, this season of the anime is simply stupid. I tried to enjoy it, I really did, but I failed at it – THERE’S ALMOST NOTHING TO GIVE YOU JOY. Maybe there are few moments with half-elf, later on with a dragon and its master, but that’s about it. It’s the same all over again – Louise and Saito seem to finally get things started, girl pops in, she leans her breasts on Saito, Saito blushes, Louise treats him like a dog – all through the 12 episodes. You can enjoy that, let’s say, in the first 2 episodes, but considering that that formula has been done in the past 24 episodes of the show, it’s really … bad. Up to this season, Zero no Tsukaima was one of my favorite (if not the favorite since I haven’t watched that much harem shows) harem anime and I deeply regret watching this season. I’ve read many reviews here that state that this is the worst seasons in the entire run, and I really have to agree. I can’t see how this show can get any worse … third season lost all of the anime’s charm, that goofiness and light-hearted story, and simply overdid the formula that was already overdone. \\n\\n\r\n[OVERALL] 4\\n\\n\r\n-I wanted to give it a higher grade, I really did because there were some really fun moments in the show, but it was impossible. Those few moments can’t make up for the rest of the show. There are only like 2-3 characters that I actually like now in the show (and one of them is the bad guy …), story is plain stupid, characters come back to life like in DBZ (again …) and the anime follows the same stupid formula that it had during the first 24 episodes of it. God damn it … it really makes me angry. The show could’ve been far greater if they only changed some things. Like, at the end of the second season, they could’ve emphasized the fact that Saito and Louse ARE MARRIED, they could’ve created a show where one fights for the one he loves without her harming him more than any of his foes. Bah … maybe those are just my expectations, but I really can’t understand why are there so many harem anime if they all use one formula. Cute or not, this season is by far the worst of the series. You can simply skip it and move onto the fourth one – I hear it’s a bit better than this crap. Hopefully, it is. \\n",
            "date": "2013-01-23T05:34:00+00:00",
            "helpful_count": 2,
            "mal_id": 84585,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/1560121.jpg",
                "scores": {
                    "animation": 6,
                    "character": 4,
                    "enjoyment": 4,
                    "overall": 4,
                    "sound": 5,
                    "story": 4
                },
                "url": "https://myanimelist.net/profile/MAND4",
                "username": "MAND4"
            },
            "url": "https://myanimelist.net/reviews.php?id=84585"
        },
        {
            "content": "I don't really classify this one as a typical harem anime.  In a typical harem, the guy in question is either totally bland or else a notably pathetic loser.\r\nThe hero of this series is a little above average in his decency, bravery and decisiveness.  I tend to think that girls would give him a chance even in his own world.\r\nHowever, he's gotten to a world, showed his mettle,  won some battles, and reaped some rewards.  This guy is a winner.  Girls like winners.  The fact that girls keep hitting on him is not unrealistic.\r\nI really like the main femalecharacter as well.  Given her aristocratic upbringing, her family pressures, and her peer pressures, her personality is absolutely convincing to me.",
            "date": "2008-08-07T04:52:00+00:00",
            "helpful_count": 1,
            "mal_id": 6905,
            "reviewer": {
                "episodes_seen": 3,
                "image_url": "https://cdn.myanimelist.net/images/userimages/83256.jpg",
                "scores": {
                    "animation": 7,
                    "character": 7,
                    "enjoyment": 8,
                    "overall": 8,
                    "sound": 6,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/formosan",
                "username": "formosan"
            },
            "url": "https://myanimelist.net/reviews.php?id=6905"
        },
        {
            "content": "Honestly I was a little disappointed with this season, a lot of good ideas were put into it but there were so many it seems they rushed through them like saito's rune disapearring, tabitha's rescue, and the end with the square golem. I'd rather see them make more seasons and extend everything than smashing it into one, still I can't complain, it is ZnT still laughed a lot, and had fun watching it. I don't want to be one of those people who complains about everything wrong with an anime though so I will tell you this is still a must watch, very funny, muchis revealed, a few suprises, louise is starting to act more mature and see whats important, and louise and saito's relationship has some advancement where she's learning to trust him more. If the pattern I'm seeing is correct than season 4 should be good with an epic ending.",
            "date": "2011-11-24T01:43:00+00:00",
            "helpful_count": 1,
            "mal_id": 47951,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/976291.jpg",
                "scores": {
                    "animation": 8,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 7,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/VelocityWaffles",
                "username": "VelocityWaffles"
            },
            "url": "https://myanimelist.net/reviews.php?id=47951"
        },
        {
            "content": "i think that the writers had run out of idea's for this  because there were to many unexplored areas of story yet should be filled out. more could of been added i dont think that this should of ended the way it did. i have a strong feeling that there wont be a season4 people say the mangas not fininshed but i dont read manga so =( this series was one of the best in all the harems i watched even though most of the stupid things everyone did in this series was more of comady. there were some romance in this series butkinda dull. only in the end will u cry and say wtf this was so good make another. i should tell u to watch this anime starting from season1 and if u still dont get it i would insist u watch it 2ce. honestly ill give this series a 10/10 bc it is one like no other and i feel very strongly about this dont get mad and say well u knwo he says its good and i don like it. its good for me and if u dont like it after seeing it twice then i guess u have no taste for anime. thanx \\n\\n\r\nXD",
            "date": "2010-03-20T11:35:00+00:00",
            "helpful_count": 1,
            "mal_id": 24129,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/305650.jpg",
                "scores": {
                    "animation": 10,
                    "character": 10,
                    "enjoyment": 10,
                    "overall": 10,
                    "sound": 10,
                    "story": 10
                },
                "url": "https://myanimelist.net/profile/haremfreak900",
                "username": "haremfreak900"
            },
            "url": "https://myanimelist.net/reviews.php?id=24129"
        },
        {
            "content": "Bwahahaha that pretty much sums up my feelings after the final episode. I've been following this series since the first season and let me just say this season has by far been the most funny if not the most irrelevant addition to the story line yet.\r\nStory- To understand where we are and everything that's happening you must have at least watched the first two seasons otherwise you'll have no idea about the whole atmosphere of this season. In terms of what this season added to the series...near nothing we moved a little forward.\r\nArt- I think well drawn and well animated I love the way magiclooks in this series and I love how we get a combination of new age and old age technology.\\n\r\nSound- Probably my least favorite opening and closings yet but it still has what I love best and that would be the killer voice acting which got me addicted to this series to begin with.\\n\r\nCharacter- So we had some more character development this season which was good I always wanted to know more about some characters not to mention we had some new character introductions which in my opinion only made this season better.\\n\r\nEnjoyment- If we're talking about how I enjoyed the comedy, romance, and drama of this season a ten would be my score however if we're talking about my enjoyment in terms of what was added to the storyline and how I felt things progressed a seven would be my score. This season was hilarious.\\n\r\nOverall- I give this season an 8 although you didn't give me much to add to a storyline you more than did your part in making me laugh and reminding me why at first I thought this series was so funny.",
            "date": "2008-10-05T16:25:00+00:00",
            "helpful_count": 0,
            "mal_id": 8460,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/40654.jpg",
                "scores": {
                    "animation": 9,
                    "character": 0,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 7
                },
                "url": "https://myanimelist.net/profile/Aphiel1",
                "username": "Aphiel1"
            },
            "url": "https://myanimelist.net/reviews.php?id=8460"
        },
        {
            "content": "I have read a lot of reviews saying they didn't like this season as much as the previous but I loved it.  Season 1 they met and liked each other.  Season 2 they fell in love and finally admitted it.  Season 3 is all about their relationship and how it grows.  I really liked how the focus shifted from the secondary characters back to the main.  Sadly, Season 4 is the end of the show but I am excited to see how it all works out.  This tale of love and comedy is the reason I gave this genrea chance and after watching this series I'm glad I did.",
            "date": "2013-12-03T04:57:00+00:00",
            "helpful_count": 0,
            "mal_id": 122417,
            "reviewer": {
                "episodes_seen": 12,
                "image_url": "https://cdn.myanimelist.net/images/userimages/3308415.jpg",
                "scores": {
                    "animation": 8,
                    "character": 9,
                    "enjoyment": 9,
                    "overall": 8,
                    "sound": 8,
                    "story": 8
                },
                "url": "https://myanimelist.net/profile/seroth77",
                "username": "seroth77"
            },
            "url": "https://myanimelist.net/reviews.php?id=122417"
        }
    ]
]